[
    {
        "post_id": "af6lmf",
        "author": "cerise-biscuit",
        "title": "UPDATE: Is it wrong for me(F20) to choose my friendship with my ex(M22) over the guy I’m dating now(M23)?",
        "url": "https://www.reddit.com/r/relationships/comments/af6lmf/update_is_it_wrong_for_mef20_to_choose_my/",
        "score": 3156,
        "num_comments": 234,
        "created_utc": 1547292689.0,
        "selftext": "Original Post is here: https://www.reddit.com/r/relationships/comments/ae6inj/is_it_wrong_for_mef20_to_choose_my_friendship/\n\nThanks to all the people who gave me their advice and perspective on the matter, it was greatly appreciated and helped me sort my priorities out.\n\n First, let me clear up some things I probably should have made clearer in the original post:\n\nThe thing with the mind reading is not really meant to be taken as a soul mate situation. Ben sometimes struggles to get a point across but I seem to get it most of the times and can tell people what he meant to say. So I think this got blown out of proportion a bit. I should have phrased this differently, sorry.\n\nAlso, many people referred to Chris as my boyfriend in their comments, which he was not. We were dating for a month and weren’t an official couple.\n\nAnother thing I should have talked about is how Ben and I ended up dating for a second time. An acquaintance told us that it was a shame that us dating never worked out and we decided to test the waters again. Not even a month in I said that it did not feel right, he agreed and said how relived he was that I felt it too and we went back to being friends. That was considerably easy since we hadn’t even had sex in that month. Chris knew that the second time wasn’t all that serious.\n\nOne comment was suspicious of why Ben hadn’t moved on so I probably should‘ve mentioned that Ben had a girlfriend from February to June 2018. I liked her and she was always lovely to me. She left him because, ironically, she still had feelings for her ex. So I thought it‘d be safe to assume that he‘d be over me as well.\n\nNone of my close friends talked about my history with Ben and they didn’t joke about us at the party. They genuinely want me to be happy and most of them instantly liked Chris. However something did happen at the party that ended up causing all this mess. So buckle up folks.\n\nNow that that’s been said, let’s move on to the shit show that’s been my life for the last couple of days.\n\nAfter reading some of your comments I texted Chris back and agreed to talk about things that night under the condition that we both will be civil and adult about it. He was fine with that and I came over to his place.\n\nChris started the conversation by immediately apologizing for how aggressive he reacted and how stupid he felt for not being able to keep it together. He said it wasn’t fair of him to mistrust me and that his jealousy was ridiculously overblown considering we weren’t even official.\n\nI told him that it’s okay if he gets jealous or uncomfortable but I just wished we could have talked about it before things escalated. I apologized for not being sensitive enough to realize that no matter what he said to me, he wouldn’t exactly be thrilled with the situation. I could have made more of an effort to reassure him and adapt situations so that we could both be happy.\n\nWe both made it clear that it would make us sad if things ended before they had even begun and we’d probably end up regretting not giving this another shot. After all, we have this crazy chemistry and got along so well.\n\nNow all that seemed to stand in the way of a happy ending was an awkward conversation about my friendship with Ben. But before I could even get into it Chris dropped this bomb:\n\nSo at the party he overheard Ben and his best friend talking. Ben said how awful it was to see me with another guy and how unfair it was that we weren’t an item.\nChris did not know what to do with that. He said that that’s where what little jealousy and insecurity he had went from zero to a hundred and he couldn’t help seeing red. He weight his options and thought that if he’d tell me it’d end in a situation where it’s his word against Ben’s and I’d believe Ben more. He also didn’t want to be “that guy that ruined a friendship“. So he swallowed his feelings until they burst out when I casually mentioned hanging out with Ben.\n\nAs he told me that, I put my guard up and took it with more than just a grain of salt. That story sounded almost cartoonishly convenient. Some people in the comments warned me that he could try to manipulate me and I had to look out for myself. I told him in all honesty that I‘d have to talk to some other people as it was hard to take his word for it given the current situation.\n\nChris was very understanding and told me that to whatever solution I‘d come, he‘d have to accept it because as he put it he “lost the right to be involved in this with throwing a jealous fit“. I disagreed but he was adamant about me having to find my truth.\n\nWe ended the night with me telling him that I really wanted to trust in what he said to me for the sake of salvaging our relationship but it was just so hard and I was so confused. He again said that he understands and that I should take my time to sort things out. Then he gave me a long hug (yes, this one was actually long) and I left to figure things out.\n\nAnd oh boy did I figure things out...\n\nThe first thing that came into my head was that at the party in September, the one where I was dared to kiss Ben, guess who thought of the dare. It was Ben‘s best friend, who, if I‘d take Chris’ word, would know if Ben still had feelings for me. Ben’s friend was also the person who suggested playing truth or dare in the first place even though he usually doesn’t like that many drinking/party games.\n\nThen I thought about how weird Ben acted when I asked him about Chris. At the time I was convinced that he just didn’t want to hurt my feelings but what if he just saw his chance of getting Chris out of the picture and held an inner debate whether he should act on it or not.\n\nMy head was in bits and pieces as I overanalysed basically every interaction I had with Ben for the past months. I had to rip the band aid off and talk to Ben directly. So I asked him if he’d be free after work and he came over. We usually don’t spend time alone at each other’s place so he knew that something wasn’t quite right.\n\nIt was very awkward but I had carefully thought about what to say beforehand which made it a bit easier. I told Ben that I value our friendship but had gotten the suspicion that he might want more out of our relationship than I could give him and asked if this was true. Ben is a bad liar so he got defensive instead and asked me if Chris wanted to separate us. He used that phrasing. “Separate us”\n\nI told him that it did not matter if Chris was involved in this because I just wanted a clear answer on whether us being friends was enough for him or not. He avoided the answer. Asking again if this was because of Chris. He spun in circles trying to change the subject and ended up saying some mean things about Chris not being a good person and what not (Reminder that their first and only interaction had been at the party). I however stayed focused, as I wanted an answer. Given, his avoiding of my question was answer enough but I was getting angry with him and I wanted him to spell it out.\n\nAfter some more back and forth he finally snapped: “Fine! I thought that we’d eventually get back together and it was only a matter of time until you realized that we were meant to be! You should be with me then we wouldn’t have to deal with this.” His words still echo in my head.\n\nLike, what…? I could have handled him having a little crush on me or if he felt that some things were left unresolved, but this? It felt like my entire world was shattered. All these years of friendship he just stuck around to one day get back together with me? Everything we’ve been through and everything he did for me was just so that I’d eventually realize that we should date again?\n\nI told him that I couldn’t return his feelings. Not now and not in the future. We had tried twice, it didn’t work out, at least for me it didn’t, and I saw nothing that could change that. I wanted us to be friends but I don’t think it is possible under these conditions.\n\nHe got pretty worked up about it and it was like watching someone go through all stages of grief except acceptance. “We can still work this out!” “This is unfair!” “Nobody will ever love me!” “I’ll change and we can try again in a few months!”\n\nIt took a lot out of me but I remained calm and told him that it’d be better if we stopped seeing each other for quite some time. Then I asked him to leave. I was exhausted and honestly creeped out. I felt so betrayed. This person that I was so close to and that I trusted so much was always acting with an ulterior motive.\n\nI called my best friend and once she heard me sob through the speaker she got in her car and came over. I told her what had happened and she was horrified. She had no idea. As word spread in these last two days it turned out that my friends didn’t know about his feelings either and most of them were shocked and repelled by how he acted.\n\nI got some amazing support from my friends and they were great at helping me not losing my head over this so far.\nChris and I talked yesterday and I apologized for putting him in such a horrible situation. I hadn’t wanted for us to start out with this level of drama. He believes that I wasn’t to blame but I still think I should have realized some things earlier... it’s been five years of “friendship” for Christ‘s sake...\n\nChris was very sweet. He ordered food from my favourite take out place, we watched a movie and cuddled up on the sofa. He said that he was glad that we came out okay and somehow everything was worth the struggle in the end. He also asked if I wanted to be his girlfriend and I said yes.\n\nSo tl;dr: Ben had feelings for me for years and expected that I’d just get back together with him one day. I told him that I couldn’t be friends with him if that’s what he wants. Chris and I are now an official couple and can’t wait for a drama free relationship.",
        "permalink": "/r/relationships/comments/af6lmf/update_is_it_wrong_for_mef20_to_choose_my/",
        "comments": [
            "Honestly, this is a pretty comfortable example of how easy it can be for an unbiased stranger to look at a situation and see what's really going on. That's kind of why I like this subreddit, regardless of the fact that a lot of commenters can jump to extremes. ",
            "That read like an episode of \"Friends\" down to the meddling best friend and playing Truth or Dare (although that was Spin the Bottle). Gah, way too much drama. I'm glad you and Chris worked it out. \n\nI hope you know there *ain't no way* you can be friends again with Ben, even after \"quite some time.\" First, he acted manipulative AF. Second, if you did, Chris should drop you like a hot rock. Ben is not your friend. \n\nThe good news is that most people will get more mature as you guys get older. ",
            "Chris is a freaking keeper. Was understandably upset but still presented his feelings calmly, gave you the benefit of the doubt, and let you have time to sort through what actually happened. I know you say you didn't want this drama right at the beginning, but the silver lining is that you got an early lesson about how Chris handles conflict, and it turns out he handles it extremely maturely.\n\nI'm sorry about Ben. I've been blindsided like that before and it's not a fun feeling. But know that you also handled this situation so well not only with doing your due diligence vetting what Chris said, but also taking it seriously when you found out he was telling the truth. Really good behavior on both your parts.",
            "Chris is a gem. Let’s just say that now. \n\nObviously, and sadly, your “friendship” with Ben is over. Lean on your friends (not Chris) for support in this. It’s okay to be sad and hurt and angry. He really pulled a Nice Guy here and that always sucks. You did beautifully in your fact-checking here and learned several good lessons. Take comfort in the fact that you’ll be harder to fool next time. That has value.\n",
            "Glad it worked out. You handle that talk with Ben well. I hope things with Chris works out.",
            "Sounds like you handled this really well. Well done! It can be a horrible feeling to learn a friendship wasn't what you thought it was but you'll get through it. Ben's level of manipulation is intense and you're so lucky that Chris overheard that convo.\nBest of luck!",
            "Ever since I read your first post I just had this feeling that Chris was a decent guy. When you said Ben mentioned Chris was bring frosty I was like 'OK BEN IS THE ONE WHO HAS AN ISSUE' .. knew Chris was a reasonable guy. It's nice things worked out the way it did. You see Chris for who he really is, and you also see Ben's true colours. I just can't believe he tried to sabotage your relationship. ",
            "Was hoping to see an update for this! Glad it (more or less) worked out well for you in the end!",
            "Good “ending” to this story. I was on Chris’s side all along. Always trust your instincts, Chris. Nice Guy Ben didn’t have the best motives, after all. ",
            "Geez I'm so impressed by how you handled this whole situation! I had a similar experience with my boyfriend and his ex and I wish we'd both handled things differently (I didn't fully explain my feelings about the two of them being \"best friends\" after breaking up not long before we became a couple, and he kept some things (a couple were BIG things) that happened from me because he didn't want to cut her off/hurt her feelings but was afraid I'd break up with him - I later found out/he fessed up and I'm gradually getting over it as time passes, but geez if we'd both done what you and Chris did right at the start, we would've avoided so much drama (and trauma in my case) 😅 Massive props to you ",
            "You handled this super well op (: glad you and Chris are official now!",
            "Damn, coming from a guy, that's a keeper OP. It's admittedly pretty hard for (at least most) of us to put our jealousy completely aside for the sake of having a completely fair conversation. He sounds like a really quality dude. ",
            "\"I'm surprised that your close, platonic male friend has a romantic interest in you,\" said no boyfriend ever.",
            "guess i’m the only one who smells how fake this is ",
            "I’m surprised at your age - both of your (you and Chris) actually. There’s no way I could/would have handled a situation like this that maturely when I was 20. Way to go OP, you both sound like you’ve got your shit together - all the best!",
            "This is ***the*** ultimate textbook reason why you don't remain friends with exes",
            "How do so many women not see these obvious signs?",
            "Yeah. Some dudes do this, he’s not an outlier. Get attached, don’t want to give up when the other person isn’t interested romantically, so they become close “friends” with the person and have this make believe story playing out in their head. Cautionary tale for women with close male friends. Not saying they always have ulterior motives, but it’s not surprising. Glad things became clear OP.",
            "Oh wow, being super close with an ex didn't work out. I'm shocked.",
            "If you're here for advice, apologize to Chris, profusely, for essentially calling him a liar while he was being open and honest. \n\n&#x200B;\n\n\\> As he told me that, I put my guard up and took it with more than just a grain of salt. That story sounded almost cartoonishly convenient. Some people in the comments warned me that he could try to manipulate me and I had to look out for myself. I told him in all honesty that I‘d have to talk to some other people as it was hard to take his word for it given the current situation\n\n&#x200B;\n\n&#x200B;",
            "I'm going to get down-voted to high fuck here, and I don't really care. Chris told you the truth and you didn't believe him. He seems like a good guy, with good perspective, but you should be mindful of the fact that this guy was upfront with you in a pretty impossible situation, and you had to verify with others to believe Chris.\n\nGiven that he didn't make his point well the first time it gives you a little lee-way in having to verify, but most people could see a mile away that Ben was not who you thought he was.",
            "I had a friend exactly like Ben. Things got hairier in my situation with my “Ben,” but I had to ultimately let him go. It started with a break but I just couldn’t go back to our friendship. In that break, I realized how much he was holding me down and how much he was just wearing me out! I feel so much better now without his manipulation and never knowing if things are genuine and cool, or are a game and I should be on guard. \n\nFunny side story: I had my “Ben” meet my “Chris” and “Ben” would NOT stop bringing up the one time we dated- TEN YEARS AGO. For 3 MONTHS. It was so cringey \n\nEdit: you made the right decision. Good job !!",
            "Chris is a good guy. He took responsibility for his actions, was understanding and empathetic, saw things from your side, and accepted/trusted you.\n\nSucks to find this out about Ben. What he and his friend tried to do with the truth and dare was truly despicable and I'm glad he's out of your life. Imagine if you'd chosen him and ended things with Chris without ever knowing what he was up to.",
            "[deleted]",
            "I kinda feared this was the situation. I’m so sorry to hear that your friendship with Ben was basically one-sided in the “just friends” area.\n\nI hope things get better <3 and I’m glad that you and Chris were able to talk things through as adults. Your willingness to talk things out as well as listen is an extremely admirable trait.",
            "My rule #1 is that you cannot be friends with an ex while dating someone else, especially if there was physical interaction. There will always be a level or depth that goes slightly beyond friends. I’ve read this in a lot of dating guideline books as well. Many of those books also pointed out it’s not fair to your other half to see you around an ex.\n\nIn regards to your story, Ben is not friend material worthy. Even if you and Chris don’t work out, I would advise keeping Ben away, which could be tough after a breakup but very necessary.",
            "This will be a great lesson for you and you will encounter this probably again in life. We cant control what we feel and there are most of the times some feelings lingering over a relationship. I always wondered why older people always assumed my best friend and me were a couple. Well she was deeply into me. The same happened with me not dealing with other friendships properly. I have to admit the older I get the more I feel like very close male-female relationships are very difficult to manage properly. My last girlfriend had a best male friend and even though they didnt have something sexual going between them it was still a very complicated relationship. I believe the opposite gender just gives us something that is hard wired to a romantic relationship for us.",
            ">I however stayed focused, as I wanted an answer.\n\nYOU ARE THE BEST. ",
            "Suprise suprise. Dont crap where you eat. \n\nAny type of hookup/dating ALWAYS ends up with one person wanting more than the other. Even if it ends amicably like you and ben did where you stayed as friends. \n\nBen probably did feel the lack of chemistry but stuck it out as friends for a what if scenario.. like what just happened. \n\nI hate to say it but for you and chris to continue, ben cant be in the picture anymore.. no matter what he says. Maybe once he finds somebody long term, and thats still a MAYBE because it will strain your relationship with chris no matter when he comes back. \n\nHe is/was an active threat to chris as a romantic interest so dont put him through that circus",
            "[deleted]",
            "Your ex is never your friend, they're always your ex. Sometimes they become friendly exes. This wasn't one of those situations. ",
            "[deleted]",
            "I’m glad everything is working out for you. Going through that drama was hard, but probably for the best for you going forward.\n\nAlso, I feel a little guilty for how entertaining this was for me to read. Thank you for sharing!",
            "From a guy who got to experience this at one point with a ex fiancee. I would never date a girl who is still friends or good friends with a ex. It's a horrible mess and this Chris was probably like me trying to be nice to somebody who is really interested in but didn't want to blow the chance from the start by saying you shouldn't talk to a ex.\nBut in reality you should have told ben have a nice life and moved on but you didn't. Remember you two at one point found something both liked to date for awhile even if it didn't work out. Now a new flame has to deal with the fact you are goid friends with a ex and there is always a possibility of you two connecting again maybe on a drunken night. He will always be looking over his shoulder. It that one time a hookup happens with your ex it will destroy Chris. Trust me I got to experience it. \nIf this was the am i the asshole reddit I would vote yes and say you got some issues with not letting this ex out of your life so you can move on. Just imagine if you were in his shoes. Not fair, huh?",
            "Hopefully you learn from this. Being cordial with exes is fine, but any kind of close relationship is not. ",
            "Lmao what is wrong with girls these days? You can’t be friends with someone you already fucked and expect your boyfriends to be cool with it ",
            "Great ending but Chris is an amazing guy for dealing with your shit honestly. I don't know anyone else who would put up with an ex like this ",
            "Personally, this is why im never friends with exs. I didn't read your first post but i would have told you that its not worth the hastle even if ben wasn't like this. Because it would have happened to the next guy, or the one after. I only ever see the point in being friends with exs, if you literally live in a small town where everyone knows everyone. And its impossible not to date someone and never see them again. Its just that why risk future relationships when you don't need to. Its not like the ex is going to add so much to your life, because if they did, then you literally will always have this problem. ",
            "Next time you break up save yourself the trouble and move on. There’s plenty of people in this world... it’s healthier for you and your future relationships. This reminds me of some high school stuff",
            "I like this turn of events.  A couple of days ago everyone was saying leave Chris, and the friendship with Ben is was too important. People pick their friends for reasons; when a past relationship becomes a friendship it's important to ask what is your ex getting from the friendship.  Because the new friendship will always be less than the relationship, and should change according.  If I  breakup with someone and they want to remain friends the first thing I change is money.  In relationships I don't mind paying for everything, but friends go Dutch. I also am not affectionate with friends and for Ex's I make an effort to avoid physical contact. I never had an Ex who would agree to my friendship dynamics. I mean some remain in our group but not one on one interactions. ",
            "Reading the comment section of your original post, a lot of people must feel pretty stupid. Exes cannot turn back to friends after a relationship unless one still likes the other. Only a very small chance of exes will be able to be friends after a relationship together, maybe. Thats the reality of it.",
            "Yeah, I don't know how you're surprised that your ex who's still around has feelings for you. No one else was surprised by this post.",
            "Nice creative writing",
            "I'll be honest.  \n\nAny guy who puts up with you keeping your exes as friends is a spineless as a jellyfish and probably deserves the bad relationship that awaits him.\n\nOut of respect for my SO, I don't hang out with my exes.",
            "Wow, this is all just like the damn plot of HIMYM.",
            "One thing I learned the older I got is that men are usually \"friends\" with you for a reason. Usually feelings are involved in their part. When I got married do you know how many \"friends\" disappeared? It really hurt my feelings and made me feel dumb, like I should have noticed or known better. It really was a painful lesson so I feel for you 💜",
            "I feel like people probably told you this in the first thread. Guys and girls are never “just friends” without one being interested \n\nYou people are naive ",
            "I honestly was not expecting this info, this guy has been pining over you for 5 years? A part of me feels bad for him the other part says, why would he wait so long to say something and play games instead of being upfront. Sorry OP that is a whole level of info that you have to deal with and process. ",
            "Wow, that is not what I expected from reading that first post. Good on Chris for acknowledging his first approach was unreasonable, and helping you figure out the truth.\n\nIt’s unfortunate that Ben couldn’t move on and didn’t value your friendship - or you, really - more than the relationship he imagined in his head.\n\nEDIT: Also, I’m not sure why people see this as an inherent issue of staying friends with exes. The problem is this “friend zone” nonsense logic where the only value his friendship with you had was being a path to an inevitable relationship, rather than seeing you as an actual friend. Him being an ex gave his brain a sturdier place to start from, sure, but the problem was still that he was in denial about your own feelings, and avoided actually communicating anything about this.",
            "I think a lot of guys often feel like “Jims” in this situation, when they are really “Michaels”",
            "No, in your mind you can validate it. Whether it's just due to the times yall had or the hardships endured or even if you feel comfortable telling things. It would bug me if I was the guy but if it is what makes you happy than he should be supportive. ",
            "[deleted]",
            "Thank god both you and Chris were able to have a proper adult conversation to get exactly what needed to be said. I’m sorry for the situation and Ben did a pretty crap thing but it looks like everything worked out. ",
            "Yo, Chris is a champ. Keep him.",
            "Pick the relationship that has the most potential to be long term, the other one is easier to replace.",
            "Read your other post and didn't comment but Im glad that this turned out the way it did.  I've been in Chris's position before (also share the same name haha) and yeah there's a level of foresight that with hindsight seems that it should have been there but its good you were able to pull back and examine with a somewhat objective point of view. \n\n&#x200B;\n\nCrazy to think though what would've happened if he didn't overhear that convo. ",
            "Oh damn, Ben was a nice guy   disguise ",
            "Can you update when Chris and you get married?",
            "[removed]",
            "Finally someone who handled things well. You played this out perfectly. You're not at fault here. Ben is a piece of shit.\n\nAnd wow, Chris is a great guy. ",
            "I just hope Chris got a blow job and stealing for dealing with the cluster fuck",
            "This story is a little too convenient and filled with cliches (it’s also the only posts you ever made), but it was a good read nonetheless so have my upvote.",
            "[removed]",
            "You are the best judge of your own interest. Keep whoever you value the most",
            "> I hadn’t wanted for us to start out with this level of drama. \n\nOoh, I know that feeling, sister. I started seeing my current boyfriend while I was still technically married, but in the process of getting divorced. It was messy and my BF was initially worried that I'd go back to my ex, but it was 100% not going to happen. \n\nI didn't know how to prove to him that my life isn't normally this dramatic. But it's worked out fine now. :)\n\n&#x200B;",
            "Honestly, you sound like a great friend to have.",
            "I don’t have to read the rest yes it is wrong lol",
            "I'll just jump on to the part where you answered Chris that you want to be his girlfriend. This alone brought tears in my eyes as I remembered the first time I got the same answer and not to mention the part with the cuddles, it brings so many memories... I am so happy for you and Chris and godspeed! ",
            "It is not wrong if you are honest with the guy you are dating. You must not like him that much or you would choose him. Who’s the last person you think of when you lay your head on that pillow at night. That’s probably who you love most. ",
            "Please write books! I know this was a real life situation and a difficult one at that but tbh it was a long read and I was captivated the whole time! You have a good head on your shoulders and a high aptitude for expression through writing. ",
            "Answer is simple once I saw what ben said and Chris overheard. He needs to go",
            "You pick who was most important. Done and done. ",
            "I sort of sympathise with Ben some what. Guys get shit for just dropping ex's from their lives rather than maintaining a friendship, but this is usually why guys do that so it doesn't end up in a situation like this. Now Ben is viewed as the \"bad\" guy in this story. Obviously there are no good and bad people in this but it's still a fucked up situation. ",
            "Yolo! U choose who and what you want in this life.",
            "The new boyfriend sounds abusive. Actually, there are so many abusive/controlling red flags that he is displaying already that my head is spinning. Get out while you can. "
        ]
    },
    {
        "post_id": "40dph8",
        "author": "mybroisgay",
        "title": "I [20M] caught my brother [17M] having sex with his friend [17M]. Hasn't come out yet. Should I tell him?",
        "url": "https://www.reddit.com/r/relationships/comments/40dph8/i_20m_caught_my_brother_17m_having_sex_with_his/",
        "score": 3157,
        "num_comments": 131,
        "created_utc": 1452466384.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/3v3cxl/i_20m_caught_my_brother_17m_having_sex_with_his/\n\ntl;dr from previous post: Walked in on my brother having sex with another man. Parents are homophobic and he's still in the closet. Should I tell him? And if so, how?\n\n______________\n\nSo about a month ago I made a post about how I caught my brother having sex with his best friend and I wanted advice on how to approach him. One redditor suggested I write my brother a letter, so that's exactly what I did. I could have let it go, but I didn't want my brother to become a statistic and feel isolated.\n\nIn my letter I essentially told me brother that I had seen him and Friend together. I told him that he doesn't have to tell me anything, but I love him and he can talk to me about anything and I'd never tell our parents.\n\nHe never responded straight forward. We talked like normal, and whenever Friend came over I just kept my distance. But on New Years Eve, him and Friend and I went out to a party (no family was around). He and Friend kissed at midnight, and I've never seen him so happy. \n\nThis was a really uneventful update but I thought I'd post it anyway.\n\ntl;dr: Wrote brother a letter, he seemed to get a little more comfortable around me. Things are going good.",
        "permalink": "/r/relationships/comments/40dph8/i_20m_caught_my_brother_17m_having_sex_with_his/",
        "comments": [
            "> This was a really uneventful update but I thought I'd post it anyway.\n\nActually, I rather disagree.  It may all seem uneventful now, but I think as you both get older you may realize how important it was that you reached out to him.  Instead of building a life separate from his family, you allowed him to \"merge his spheres\" so to speak, and you will have so many more memories together because of your decision and his willingness to trust you.",
            "You are a great brother. You did a great thing.",
            "I think you handled this very well.\n\nPost-NYE, I think you can be a bit more open with him. Just a quick chat to let him know you're still supportive of him, and will keep any secrecy he requests.\n\nI'm willing to bet he's thought about how/when he will come out to your family, and you can offer to be a resource on that (but without pressuring him to do so).\n\nBasically just keep doing what you're doing. You are a good, supportive brother and he's lucky to have you.",
            "I am sure it was an awkward letter to write and deliver but you absolutely did the right thing.He may not say how much he appreciates it, but obviously you allowed him to feel safe with you. Feeling accepted is an amazing feeling for anyone, considering your family I am sure he appreciates it even more.",
            "I'm not sure if this means anything. My brother is gay. He has a boyfriend he brings to family events. I haven't really told my children about his orientation or anything. We've discussed acceptance and all that jazz. \n\nWell, Christmas time, my middle child started asking questions about my brother and his boyfriend (which led to youngest asking questions. I'm pretty sure oldest was aware and just accepted it as normal). I answered honestly. All three of my children said, okay, and were perfectly fine. My middle even expressed his fondness of my brother's boyfriend. \n\nI'm not sure this was the best way to handle this. I wasn't actively hiding anything. My husband and I actively accepted him and his relationship (as does the rest of our family) and just acted like it was normal. We let them come to their own conclusions and ask questions when they needed. We didn't make a big deal about it. To them now, it's not a big deal. It's just a fact. \n\nAs a side note, I did tell my brother a more detailed conversation. I thought he was upset because he had his face down. I apologized for upsetting him. He looked up and said no, he was so happy. He loved the way they reacted. He thought they were sweet. \n\nGood for you for being such a good brother. Please continue to be there for him.\n\n As for parents, sometimes they can surprise you. I hope yours come around. My parents were initially shocked and upset. Now boyfriend is part of the family. Someone complemented my mom's ability to accept him as gay. She got this confused look and said, he's my son. Why wouldn't I accept him? \n\nGood luck. Sorry for the book. =]",
            "Ah man, thanks for being a decent human being.",
            "I don't think he feels he needs to talk to you about it. He's probably embarrassed talking about it. But he feels safe with you, so that's good. So just continue life.\n\nDid you tell him to use condoms though?",
            "I love happy updates. good job OP!",
            "You are such an amazing sibling.",
            "Awrsome!!! You rock. So glad you updated this.",
            "You are a great brother. ",
            "This might be an uneventful update for you, but trust me, it means the world to your brother. You're a good man. ",
            "You're such a good brother and person.  Finally something happy on this sub. ",
            "He might not be able to currently express it to you but this must mean so much to him, to have to not hide. Good job big bro.",
            "Missed opportunity to just have a letter that said\n\n\"Congrats on the sex!\"\n\nYou're still an awesome brother.",
            "You're a great brother. It's so easy for family to overreact in either direction. I'm a lesbian and I can say from experience that this non-reaction is the best. I don't think I ever sat down with my brothers to talk about me being gay - they never batted an eye when I talked about my girlfriend, they don't say shit-all about ally pride or whatever, I'm just their sister and my partner is my partner, we are normal people through and through.",
            "No explosions and personally that's how I love my updates. Glad to hear :) ",
            "I think you did the right thing for him, OP, and I'm sure he appreciates it. Maybe one day he'll want to talk, maybe he won't; the important thing is that he knows he can talk to you and you'll respect his privacy. At that age, privacy is worth gold.",
            "Please do talk to him about safe sex, though.",
            "Your brother probably can't even express in words how happy he is to know you're there for him. ",
            "Totally not an uneventful update! I loved hearing you'd never seen him so happy :) Very cool",
            "that was a super eventful update! i cant tell you how great it feels to have someone accept you for who you are when you think you have to hide it from everyone! super kudos to you, and best of luck to you and your brother",
            "Good.  Hopefully when your brother graduates, he's going to go to college out of state, far from your parents.  He'll be able to live his life then.",
            "I can't even imagine how thrilling it must have been for him to be able to be his true self in front of you. I'm tearing up over here. ",
            "You sound like a very dear brother.  Even if you did make me laugh at \"[my brother] hasn't come out yet.  Should I tell him?\"  \"Pretty sure he doesn't need you to tell him, he seems to have figured it out pretty well on his own...\"",
            "For some reason this update made me tear up. Not uneventful!",
            "I think having a trustworthy confidante would be good for your brother, particularly so because of your parents. ",
            "I believe that the best thing you can do now is to continue to be a supportive brother and encourage your brother's relationship with his friend.\n\n\n[EDIT] grammar\n\n",
            "Aww thats adorable! ",
            "Did you mention he should be more careful if he doesn't want to be outted?  This time it was you, who was cool with it.  It might not be someone who thinks the same way next time.",
            "Well done! Keep supporting him and help to deal with family whether he wants to hide it or come out.",
            "you are a wonderful person. <3",
            "Even though he didnt say anything, just the fact that he now trusts you with that, shows how much more love and respect he has for you as a brother. \n\nThis is shit you cant buy~ \"tear feels\" :')",
            "That's probably the absolute best thing you could have done. He now knows he has support and he's safe now. Sometimes the scariest thing is comming out or having no one. He probably really happy he has you but dosen't see it as a big enough deal to address it. After all he knows what he needs to know - your there for him. ",
            "I think it's a great, upbeat and positive update.  I wish there were more like it.\n\n",
            "Nice one! My cousin has been so much happier since she started dating girls. Your brother quietly knows he has an ally in the family, that's worth so much. :-D",
            "You get so many awesome brother points. Seriously, you don't know how much some people wish they could have this simple form of support--it means a lot.",
            "You rock.",
            "I wish I had an older brother like you. You did good.",
            "You did a good thing :)\n\n\n*Nana internet hug*",
            "You did the right thing. Thanks for being so discreet and understanding about your brother and his situation. :)",
            "He may not have explicitly responded  but he knows. You are a good bro op",
            "D' awwww",
            "I am happy for you, I am so relieved for your brother. ",
            "Good on you man. That's awesome.",
            "This is happy! Happy updates feel rare on here. Good on you for being a supportive brother. It probably means more to him than you know.",
            "You did great. ",
            "It is awkward to get caught. Are there any resources he can turn to?",
            "I mean, until he tells you he's gay I wouldn't assume that. He might be bi or something else. All you really know is that he's happy with this guy, and that's great.",
            "It's a good thing he knows someone supports him. Honestly it is good that he hasn't come out yet. He is young and may not be sure he is homosexual yet. Coming out slaps you with a label which is disappointing because sexual preferences can change as you become an adult. I find the urgency to pick a side really annoying. ",
            "[removed]",
            "[removed]",
            "I don't like your use of your word caught. You saw your brother having sex is more appropiate.",
            "[deleted]",
            "Not your business to make him feel uncomfortable if other people he doesn't want to know, know.. Don't say anything and just ignore it for now. Try to think of something to help your parents get through it if they're gonna have a hard time when and if he tells them."
        ]
    },
    {
        "post_id": "3w5ssd",
        "author": "crystalcleric",
        "title": "[update] My [25F] boyfriend [26M] of 1 year just told me that he wants me to pay him a rental fee for borrowing his car to visit my family. Am I wrong to be upset?",
        "url": "https://www.reddit.com/r/relationships/comments/3w5ssd/update_my_25f_boyfriend_26m_of_1_year_just_told/",
        "score": 3154,
        "num_comments": 592,
        "created_utc": 1449713407.0,
        "selftext": "Here is a link to my last post. \n\nhttps://www.reddit.com/r/relationships/comments/3uf0cz/my_25f_boyfriend_26m_of_1_year_just_told_me_that/\n\nAnd here is the tl;dr: I had to borrow my boyfriend's car to visit my family. He wants me to pay him $50 per day for use of it. I am upset by this, but I think that maybe I am just being too sensitive.\n\n***\n\nHey, everyone. I know a lot of you have been wanting an update. I meant to post one way a few days ago, but things have been really busy lately.\n\nI didn't want to ruin my Thanksgiving holiday thinking about the car situation, so I decided to wait until I got back to discuss it with my boyfriend. I was really hoping that this was all just a misunderstanding, but unfortunately it was not. \n\nWhen I brought up the rental payment, my boyfriend said that he thought it was only fair that I compensate him for the use of his car. He asked me if I had a problem with that, and I told him that I did. I mentioned what some of you said about how I could have rented a car for less if I had known he was going to charge me. I also told him how I felt like he had taken advantage of me by only mentioning the fee after I had taken his car. \n\nOne thing that one of you mentioned was that maybe someone had suggested it to him. I asked him about that, and he said that no one had said anything. He just figured that it would only be fair for me to pay for the use of his car. I did at least get him to see that the price he charged me was too high, but he didn't think he was wrong about the fee. We ended up having a larger conversation about how tight he is with money and some other things I mentioned in my first post. I didn't intend to break up with him, but after he still insisted on the rental payment, I just realized that he was not someone I wanted to be with. I did end up paying him, but it was $100 instead of $250.\n\nSo that's the update. He has apologized and asked me to take him back, but I don't think I'm interested anymore. Thanks for your help everyone. \n\n\n\n   \n**tl;dr**: Boyfriend was serious when he requested I pay him a rental fee for his car. We broke up. ",
        "permalink": "/r/relationships/comments/3w5ssd/update_my_25f_boyfriend_26m_of_1_year_just_told/",
        "comments": [
            "lol so when he asked you to take him back did he offer a refund? Sorry it didn't work out!",
            "Did he charge you a cancellation fee when you broke up with him?",
            "He sounds like the Comcast of boyfriends.",
            "Penny wise and pound foolish.  Sorry he turned out to suck.",
            "Wow, I was really hoping it was a misunderstanding (maybe a poorly executed joke?) too. \n\nWell, it sounds like you're better off.",
            "In the long run, $100 is a cheap price to pay to find out someone is an asshole. Imagine being married to someone like that. He probably would have charged you for hours spent wedding planning. ",
            "Break-ups suck but I can't help but laugh at this one a bit. Your ex sounds like a clueless plonker.",
            "Has anybody mentioned what this advice is going to cost you?",
            "[removed]",
            "Wow.  What the hell is wrong with your ex?  I'm glad that you got out of there.  This is like the bottom level of cheapness in our society.",
            "Good riddance. Happy holidays OP!",
            "This was completely unreasonable, especially considering he didn't decide that it was a business transaction until after he'd already agreed to let you borrow his vehicle without any apparent conditions.\n\nThis is like if someone brought a sandwich to a homeless person and watched them eat half of it before saying, \"Okay, that'll be $6.75!\"\n\nI wouldn't have paid him anything.",
            "Hah wait until he sees how expensive dating around is. Keeping a longterm girlfriend happy is much cheaper in the long run.",
            "Good for you.  I hope you find someone that doesn't blindside you like that.",
            "At least it was only a year. And a valuable lesson. I'm sure you will sniff this shit out immediately if faced with it in the future. I feel bad for his next girlfriend. \n\nI had this boyfriend in my early 20's. We went out for food and drinks with his brother to a spot that offered a $25 off coupon if you subscribed to their email list. So we'd make new email addresses all the time and always go with a coupon. So one night the three of us are about to settle up the check and he informs his brother and I that his share of the check will be the coupon. That his brother and I will have the split the rest between ourselves. Hahahahahhaha oh bless his heart. \n\nYou dodged a fucking bullet. ",
            "Has he never been in a relationship before?  I can't even imagine how he asked you for money with a straight face.",
            "Did he walk around the car with a clipboard and check the fuel gauge when you returned it? \"Sorry, found a Dorito under the driver's seat. Unfortunately, we are going to have to charge you a cleaning fee.\" And then you say: \"But I don't even eat Doritos!\" Good riddance, sister. This guy is a real piece of work.",
            "[deleted]",
            "Charge a $1500 \"take me back\" consideration fee, then say, \"Nope\".",
            "Good riddance. I'm sure as time goes by you will heal and think back and realize his other douchey behaviors. Maybe you will even laugh remembering the story of the most ridiculous car rental service ever. \n\nYou handled this with a lot of maturity and grace, and gave him the benefit of a doubt. There are lots of great guys out there OP. \n\nHappy holidays and good on you on giving you the great gift of freedom and a chance at a real partner.",
            "Good riddance! Soon enough this will become a hilarious story you will be telling people for years!",
            "Thank the stars your car broke down before holidays! Thats a bullet dodged for 100$. \n\nI don't know how long you were together, but who asks gf/bf to pay for using car!\n\n",
            "Well done! What a sleezebag! ",
            "It sounds like the wheels fell off his plan",
            "He was tight on money, so he figured he'd pull this? Wow.\n\nYou dodged a major bullet here. I would not have given him a penny since he only mentioned the fee AFTER you took his car. That's not how life works dude. \n\nFriends/significant others borrow from each other free of charge all the freaking time, can you imagine if everyone was to ask for money AFTER the lending had occurred?\n\nWhat a douche.\n\nHilarious too that he's asking for you back after pocketing your $100.",
            "Where you dating George Costanza by any chance? ",
            "$100 is a cheap price to find out how much the relationship is ultimately worth for the long run. Good on you for figuring that out.",
            "It would have been realistic to ask you to re-fill the gas tank when you got back. Anything more than that is just being an asshole.",
            "You should show him this post next time he tries getting back with you. ",
            "I wonder how he will choose to explain the break up to his friends and family if he opens up about it with them? Hmmmmm",
            "Was he redpilled^tm lately?",
            "You should not have paid him.  There was no contract.  Anyway, glad you cut him loose.  You're supposed to be his girlfriend, not a customer.",
            "[deleted]",
            "Tell him you will take him back if he pays a relationship renewal fee. ",
            "Wow. Clearly he could have at leeeeast been like \"you're right, since I didn't tell you beforehand there won't be a fee this time\" which is still pretty shitty but more reasonable. \n\nBut, at least he was very open about being a fuckwad so you could dump him. ",
            "That was messed up. I remember a family member loaned me their car for around 1-2 months when I was an undergrad (my car met an unfortunate end with some black ice), as I was a commuter and could not find a replacement in time for the semester. They never asked me for a rental fee, and our mutual understanding was that I would pay for any routine maintenance that came up due to my use, and my own gas. That is reasonable. Even if we didn't come to that agreement, I still would have done that.\n\nHim expecting you to pay $50.00 a day is asinine, and he was just trying to make bank off of you. I'm glad you broke up with him. You are far better off!",
            "There's frugal and then there's stingy. Your ex-bf is the latter. And if he intended to charge you for the use of his car, he should have brought that up before handing over the key. Asking for more than the typical rental fee was just plain greedy.",
            "[deleted]",
            "[deleted]",
            "I had a similar situation (slightly different but I won't go into details) but I luckily talked to my mentor beforehand and she said \"You are trying to find ways to fill your pockets, not actually be fair. So it's a question of if $200 is worth that friendship because it will probably end\"\n\nAnd then I realized I was being an asshole driven by a fear of not having money. Sorry your boyfriend didn't get some senses knocked into him but I do think dumping him was the best course of action. ",
            "Good for you. Charging your girlfriend to use your car is pretty lame and indicative of a lack of respect for you or clear view of how a relationship works. People like that are a lost cause. Glad you didn't put up with it any longer.",
            "Since you mentioned you did a lot of the cooking and cleaning, it would have been fun to take the money out of his hand for your own fees; he'd even have to pay you if the relationship was based on business transactions.",
            "Wow! To be honest you shouldn't have paid the 100 and should have just walked out. However, you're better off. ",
            "Good job OP, made my day!",
            "Girl! I think it's ridiculous that you paid $100, but OMG, this will absolutely be one of the best stories you'll continue to tell for the rest of your life! Over and over again! ",
            "On a most basic level, if you want to charge someone for something, let them know in advance so they can consent or disagree. Once the thing has been borrowed, one cannot expect you to honor an agreement you never made. I would never treat an acquaintance like that, let alone a girlfriend.",
            "I feel like if I were to try to break up with someone I'd been with for a year I'd be freaking out over it. How did you deal with that so well?",
            "Wow, I consider myself quite a greedy person, but this is batshit crazy.",
            "Good for you.  \n\nBorrowing a car from a loved one has one fee- fill the tank.  ",
            "He put money before his relationship ! He was NOT relationship material ! You did good !!!",
            "Is your boyfriend an addict? Cause that sounds a lot like a guy who has ran out of reasons he needs to borrow money and had an ah-ha moment.",
            "Its one thing to be \"tight\" with money. That's fair. But he showed who he WAS to you. Now, you can either live with that, or not.\n\nI see the answer is \"not\". I agree with you. From your explanation of both posts it looks like you are responsible. You offered to fill the tank with gas etc. You don't sponge off him. And you are in a bind. Your car is in the shop. Its not like you ask to borrow it all the time.\n\nI have lent my car, on occasion, to my brother, cousin etc. I would EXPECT them to fill the tank, or at LEAST give it back with the same amount of gas. But I would not charge anyone. \n\nFrankly, sometimes you just need someone to give you a hand. Like lending you car to someone to go home for the holidays.\n\nIf he did this with you now, better you know now and get out. ",
            "So, why did your last relationship end?\n\nOk, well, you see, .... uhh well I charged her for borrowing my car.",
            "Bravo! What a bargain to be rid of him for $100. I love that he offered you a refund for taking him back. Lol He can wipe his tears with the cash he demanded from you. What a tool.  Please send him a bill for all the times you had sex.  Itemized. Extra fee for all the times you didn't orgasm.",
            "Um what? That's bull. Good riddance boy!",
            "I remembered your first post, and I'm sorry that you guys had to break up but I think you're better off. Your ex sounds cheap and idiotic and he'll be regretting this one for a long time.",
            "What a douche bag. You are way better off with out that guy. ",
            "This guy... and now he comes crawling back? I hope he sits long and hard about how he fucked this up completely. I hope his friends and family give him shit for YEARS to come. What a colossal fuck up.",
            "wow i did not expect an update to this story, im really glad you did. I remember reading it and telling my bf about this (I tell my bf all the interesting reddit stories that catch my attention) and he thought that your bf was crazy which I agree. Him requesting a rental fee? That's so ridiculous.. it's called *being a good boyfriend*, and he clearly doesn't know how to. I'm sorry things didn't work out but it's good that you found out he wasn't compatible with you now rather than later on. I know you'll find someone who will treat you right, much luck to you!",
            "This is straight out of Curb Your Enthusiasm",
            "Smart woman. ",
            "lol thats ridiculous. realistically me and my wife are partners. she has my social security card stored someone, i've got her bank cards in my wallet. we think nothing of sharing eachothers stuff. we are both a team to get to where we want. I can't imagine trying to make money off my significant other.",
            ">He has apologized and asked me to take him back, but I don't think I'm interested anymore.\n\nGood. ",
            "Jeez, he should have been paying you for putting up with him. Send him an invoice for any cleaning, medical help or sexual favours.",
            "Geez. My car was in the shop and my bf *insisted* that I use his, even though I could have easily made other arrangements.\n\nThen he got \"upset\" when I returned it with a full tank of gas. \n\nYour partner should have your back. If he doesn't, you know it's not going to be a lasting relationship.",
            "Is he on the spectrum or something? I still can't get over charging a SO to borrow a car that's just sitting there. I've let friends drive my car while I'm out of town in exchange for a ride to the airport. ",
            "Good for you. He took advantage of your situation for his own personal gain. He sucks.",
            "Downvote me if you must but I wouldn't have paid him a fucking cent.... That was really shitty and I'm glad you at least broke up with him. ",
            "I can offer you some more advice but its gonna cost you",
            "you did the right thing by breaking up",
            "Lol I love the way you handled it. Stupid idiot didn't think he'd lose his gf over this, serves him right. People who have a mindset like him have no business being in a romantic relationship.",
            "Don't forget to invoice him, for all the wonderful times, in your lovely company!!!!",
            "Jesus.  What an asshole.\n\nI couldn't imagine ever charging my buddies to use my car in a pinch, let alone my fucking girlfriend of over a year.\n\nThe most I would expect would be to refill the tank, and pay for repairs if you crash the damned thing.",
            "The original post was only 13 days ago! Is time accelerating at an alarming rate? Because it seems like that post was several months ago!!!",
            "Ha, I like how he stuck to his guns, what an idiot. Wonder if he was as giving in bed...",
            "Good for you.\n\nIf he's cheap with his car he's going to wing up being stingy about other things, too.",
            "I think this may have been a learning experience for him as well. Winners all round!",
            "Lol.  What a douche.",
            "tell him if he wants you back that bad it will be 250.00",
            "Wow.  You are correct in breaking up.  If he feels entitled to compensation even though he wasn't using the car and gave you permission, dang.  Good luck sharing things with him in the future.  That kind of stingy breaks up relationships.  The friend discount is there for a reason.  Good for you OP",
            "Jesus. Glad you got away from that douche-nozzle. Wow.",
            "Seems like if he really wanted to charge you and you didn't think it was warranted since you're in an long-term relationship with him, then maybe he thought of your relationship as a lot more short-term than you did, so it worked out best for both of you.  Sure, he probably regrets having to go out and find another GF now, but his loss...",
            "It's better that you found this out now. \nGood news: this will be a funny story to tell later.",
            "$100 is cheap for a car rental and learning that you're wasting your time with an asshat.  Congrats!  You will find better.",
            "Sorry to hear that, OP. He kinda sounds lousy anyway. You let strangers rent your car, not someone you care for that can take care of said thing. ",
            "I would have understood if he had asked for returning it with a full tank and maybe a little thank you gift. but 250$ ? dafuq man.",
            "I guess your relationship was worth less than $100 to him.\n\n",
            "Maybe he's thinking \"jeez, maybe having a girlfriend would have been nicer than having $100.\" Or even $250.\n\nToo fucking late now though. ",
            "I wonder, what us he being sorry for? He was thinking it's fair before you left, did it suddenly change for him?",
            "This sounds like something my brother would do. Sorry you realized you were dating a cheapskate!",
            "It's one thing to be frugal with money it's a whole other thing to look at your relationships as profit centers.",
            "A reasonable suggestion is to fill it up with gas... It wasn't like you were going on a business trip and you were getting compensated for it. That's absurd to request something from your partner let alone if someone was even a good friend. Good on you! ",
            "Serious thought: You should direct him to this and the previous thread. Let him read the replies so he can truly understand what a piece of shit he is. Maybe he'll grow up?",
            "As if it wasn't bad enough that he would expect his own GF to pay him car rental in the first place (I wouldn't even expect my GF to pay for the gas), it sounds like he was trying to trick you into paying it as well. \n\nYou've done the right thing by leaving him. Maybe he'll eventually learn not to be the tightest person in the world from this experience. ",
            "I am curious how the breakup thing went. Did you pay him and break up at the same time and he tried to give the money back right there. Or did he take a couple of days to think about it before realizing he messed up?",
            "Tell him you will take him back at a cost of $50 a day. ",
            "When I read your first post, where you wrote:\n\nEDIT: Just so you guys know, I am already at my family's house. Sorry if that wasn't clear.\n\nYou should have stayed at your family's house! \n\nQuite a bizarre way to break-up.  It sounds like he's on the Autistic spectrum as that is unusual behaviour and showed a lack of empathy - a key trait with Autism/Aspergers. \n\nClearly he did not appreciate you and does not deserve your company.  Most decent boyfriends/husbands/girlfriends and wives - even friends, would never expect anything more than a few quid worth of fuel.\n\nDon't wish to blow my own trumpet, but I spontaniously filled my girlfriend's car up with fuel the other day because I simply love her (and she is on occasion, skint).\n\n",
            "He is going to cringe every time he remembers he got dumped for renting his car out to his gf.",
            "You should have told him you were a hooker, and he needs to pay for the sex you've had. ",
            "Good. I am glad to hear you dumped him because obviously he is too stingy and selfish to see that you don't charge a fee to a SO for something like that. It won't be hard to find someone better. ",
            "haha What? Is this serious? He was out of town over Thanksgiving and your car was being fixed. So in order for you to not be alone on a holiday about togetherness, he expected you to pay $50 a day plus gas. For a car he could not use because he was out of town. Yeah, you pay for gas when borrowing a car and you return it with a full tank as a thanks for the favor gesture....but you don't charge people a rental fee. Especially when he couldn't even use it himself! \n\nFirm boundary I have for my relationships: being in a relationship with me is not a money making scheme. You don't get to make money off being in a relationship with someone. Its just uncouth. ",
            "Calling is rental fee is weird. Couldn't he have just asked for gas money? ",
            "You did the right thing, that's just selfish if he wasn't even going to be home to use it, plus you have been together for a year.....my SO of 7 months had allowed me on numerous occasions to take her car back home to see my family and doesn't expect any compensation besides gas, which she doesn't even ask for I just fill out of gratitude.\n\n\n\n\nWell done OP!",
            "[removed]",
            "Wow...just wow...I would have charged him an inconvenience fee",
            "Good move OP,it's hard to make choices line that but relationships are about supporting each other, not capitalizing on each other.  Hope you're doing well and still rid of the guy.",
            "You are better off for sure, bet he won't try charge anyone in the future, or maybe he will, he seems a bit clueless. Be glad you escaped that sooner rather than later! :)",
            ">So that's the update. He has apologized and asked me to take him back, but I don't think I'm interested anymore.\n\nThis is the most important part. Make sure not to take his ass back. Somethings are too stupid to forgive.",
            "Better off without that Bert...if he still can't see why it's a dickish move in general.",
            "So sorry the relationship is gone, but it's a giant step towards yourself if you question unfair behavior.",
            "Good for you! You don't need that in your life.\n\nI hope you find someone much more reasonable.",
            "I think you did the right thing. There are more important things than money, and apparently your relationship wasn't one of those things to your boyfriend. Good for you",
            "I'd tell him that the fee to consider getting back together is $50 per day. ",
            "What an asshole... I'm usually not so quick to say break up, but it was certainly a wise decision. I mean sure you're not entitled to use his car.. But basically you are. I can't imagine the reasoning behind that. It just seems so silly to me to charge someone you love to borrow your car? Why? I mean sure I'd expect the tank filled up to where it was if we had separate incomes, but even that I can't see myself caring at all if she forgot.. What a douche. ",
            "Good on you. Leaving is all for the best I think. ",
            "Ugh, what a loathsome little shit. I guess it's better for that to have come out now rather than 5 years down the line. ",
            "How far was the drive? His baby miles",
            "That dude sucks, good move. Move on to greener pastures.",
            "I want to say that I admire your confidence in how you have responded to people's comments. \n\nI hope your boyfriend learns that there are more important priorities in life than minding every penny.",
            "You go OP!!",
            "You definitely made the right choice! He was treating you like a stranger asked him to borrow his car and didn't even bother to check and see if the amount he was asking for was reasonable. ",
            "God no. For him to ask you that is an asshole thing. I let my bf borrow my car and all I ask is if he uses all the gas is to fill it up. And I have borrowed his truck and I always give him gas $ or fill it up ",
            "I'm sorry to hear about your breakup OP. But it sounds like you might have dodged a bullet in the long run. Have a nice holiday!",
            "What the fuck? I can't even wrap my head around this idiot.",
            "Who the fuck charges their SO to borrow their car. WTF",
            "I've seen a lot of crazy shit on this sub-reddit, but this is honestly the most unbelievable. I hope this is real! ",
            "My ex-boyfriend tried to do the exact same thing when I lived with him during the summer. I made it so I got a summer job near where he lived (a few hours away from where I studied). He was 35 and established (owned a house) and I was staying for the summer (2 months) and was a full-time student (studying for a masters) and had a room I already rented.\n\nHe expected me to pay him for staying with him during the summer. May be just a coincidence, but he also had troubles with the economy. In fact, to this date he still owes me a small amount of money (roughly a month of rental), but I have sort of given up hope I will ever get it back.",
            "I know this might be a tough time for you, but I find some measure of comedy in your situation by imagining it as a Seinfeld episode.  You are basically George Costanza.",
            "What a prick.",
            "Good for you to cut loose that tight-wad. Seriously, who does that shit to their girlfriend?!",
            "Honestly, I think the most he could ask for was to make sure you filled it up back to where it was when he first let you borrow it.  Obviously if anything happened to it while you drove it would be your fault, but with that aside I think this is a bit ridiculous.\n\n",
            "Glad it worked out for you. I've been in a similar position in the past. I had roommates borrowing my car to get to work. At some point I realized I was filling the gas tank, paying for insurance, and paying for maintenance on a car that everyone else was using. But I still think I never would have asked that of someone I was actually in a relationship with.",
            "Saying \"hey don't bring it back empty\" is one thing but charging a daily rate?  You made a wise decision. Next he will want you to pay him every time he fixes something in the house.",
            "I hope you stick with your decision... I'm sure there are many better guys out there for you... Good luck!!  ",
            "He did you a favor. This is not the type of person you want to negotiate the random things that come up in life with. Good luck. ",
            "I'm glad you got out.  I was following your first post and it really blew my mind. You don't need people that dense in your life.  I hope it goes well you.  ",
            "Good for you! You deserve better than that.",
            "Sheesh.  What a douche.  Good riddance to him and I'm glad you're out of that.",
            "I'm glad you decided to leave. Thanks for the update! I would say that it would have started with the rental fee for the car and would have escalated to other things. If he asks for you back, you should charge a fee (jokingly of course). \n\nRelationship Reinstatement Fee",
            "He was probably planning on breaking up with you soon, otherwise why charge.",
            "If I were him, I might've asked that you gave it back to me with a full tank of gas.\n\nIf I were the one borrowing, I would've filled it up and maybe even cleaned the car as a thank you gesture.\n\nBut asking for a dollar amount/daily rental?   Yeesh.",
            "So boyfriend, do want a girlfriend or do you want car rental money? You can only pick one. \n\nWhat a clueless jerk. ",
            "You absolutely did the right thing by dumping him. I've been with my boyfriend for almost 5 years now, but even in the beginning, I wouldn't have hesitated to loan him my car, and vice versa. No fees at all (except maybe some nookie gratuity). You're better off. Good luck!",
            "Smart choice! You deserve way better.",
            "You made the right decision.",
            "My then gf now fiacée let me use her car for months when I got a job that required it. This dude is too self absorbed to have a real relationship. Breaking up was the way to go. Relationships are partnerships where you have to think of another person more so than yourself, this dude can't do that.",
            "Wow, what an asshole...",
            "That's so douchy. Glad you broke up with him.",
            "Wat.. Who does this?? I think you're right in breaking up with him",
            "I'm glad you dumped him. Can't have that weirdo's penis in you after that.\n",
            "Good riddance to bad rubbish. ",
            "[deleted]",
            "The price for renting his car $50 the cost for breaking his heart priceless. ",
            "Congrats, /r/Relationships\n\nAnother couple that barely has a problem convinced to break up.\n\nWho needs to actually work through a problem in a relationship when you can just toss em back and get another one? Because if you re-roll enough, eventually you'll find a perfect relationship where you never have to compromise, right?",
            "As an asian, I have always found hard core yours is yours and mine is mine culture I often see with western couples quite contrasting (is that even a word lol). IF that guy mentioned this to an asian cultured girl or woman, thats summary breakup material.",
            "Did you pay for gas, or something in that way?\n\nI don't believe in lending something I have paid for, which gets wear and tear, not to mention needs fuel to function, to someone for free.\n\nMe and my SO split car gas whenever we go places, and I would ask her to refill what she used if she borrowed my car to drive reasonable distances."
        ]
    },
    {
        "post_id": "11ht74l",
        "author": "ThrowRAUncleIroh",
        "title": "UPDATE: I (27M) met a girl (27F) who used to bully me when we were little. Now she is asking me out and I don't know what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/11ht74l/update_i_27m_met_a_girl_27f_who_used_to_bully_me/",
        "score": 3149,
        "num_comments": 192,
        "created_utc": 1677915553.0,
        "selftext": "Link to the original post: [https://www.reddit.com/r/relationships/comments/11bj0i0/i\\_27m\\_met\\_a\\_girl\\_27f\\_who\\_used\\_to\\_bully\\_me\\_when\\_we/](https://www.reddit.com/r/relationships/comments/11bj0i0/i_27m_met_a_girl_27f_who_used_to_bully_me_when_we/)\n\nI (27M) wasn't sure about doing an update post but quite a few of you gave me some good advice ( and some didn't but I want to focus on the good ones) so I thought it would be fair to update you on how the situation evolved.\n\nAfter reading your advices, I decided to meet Nina (27F) for that coffee. It was awkward but it wasn't that bad. She apologized profusely about the past. I thought her apologies would make me feel good but to be honest, I was wrong. The truth is that I still think badly of the Nina who bullied me in middle school but I couldn't see that Nina in the current Nina ( I don't know if what I'm trying to say makes sense or if my brain finally decided to give up on me.). Her voice, her demeanor, everything except for her face is completely different.\n\nI told her exactly how what she and the other bullies did affected me and then I decided to forgive her... more or less.\n\nI decided to start over as strangers and told her as much. I told her that while I couldn't forget what she did in the past, I don't know the current Nina. It's been 14 years since the those times, more than half of our lives passed since then and I firmly believe people can change ( I did.) so, if she wanted to try and get to know the current me, we could act as if that was the first time we met and move on from then. I don't know if this decision show my maturity or my stupidity, I guess the future will tell.\n\nI admit what she did next made my giggle a bit ( I think she took it from a film but I don't remember which one.). She stood up and got out of the coffee shop, then came back in, sat down and introduced herself.\n\nWe chatted for a bit and it was ok.\n\nI what to thank all the people who gave me advices in the comment section of the previous post.\n\nTL;DR : I decided to forgive her and we decided to start over as strangers and see what happen..",
        "permalink": "/r/relationships/comments/11ht74l/update_i_27m_met_a_girl_27f_who_used_to_bully_me/",
        "comments": [
            "Hope something good comes of it. People really can change, especially from such a young age. And props to you for facing your traumas head on.",
            "\n>She stood up and got out of the coffee shop, then came back in, sat down and introduced herself.\n\n\nthat's actually adorable",
            "Meeting your bully for a coffee is a pretty big step, regardless of where it goes. Glad you felt like you could do it and came out just as strong as when you went in. \n\nI’m a big believer that people can change, but that doesn’t mean everyone does. Just take it slow and go at your comfort level.\n\nAlso, have a good think about whether this is something you are ready for. Just because she’s changed, doesn’t mean you’re in the right headspace.",
            "As a deeply afflicted trash person, I have to admit, the updates struck me as a romance anime pilot.\n\nBut jokes aside, just remember that if you find you can't be comfortable around them, it's okay to decide you don't want to and walk away. You wouldn't be doing anything wrong or being mean, you would be protecting your peace of mind. Sometimes the consequences of a person's actions means that they effectively close a door on getting to know someone great. But if you find that it doesn't make you uncomfortable and that you enjoy this person's company, that's cool too. People can change, in fact childhood is all about changing. So if you see some kind of connection worth giving a shot, it's okay to trust your instincts. You know what's best for you.",
            "I just read both your posts.  I just want to say, it sounds like you’ve been doing a wonderful job working to overcome your trauma and not let it dictate who you are today. A lot of people in your situation would have gone “fight or flight” with this person, but you managed to approach the situation with a level head, keep your mind open, and use this as an experience to learn and grow from. That is amazing.\n\nI just want to say keep it up.  Like you said, you don’t know this person. It’s great you can recognize that someone who was terrible as a child can overcome those character flaws.  I think being willing to talk to a former bully like this is another good step in overcoming your past.",
            "Wouldn't have blamed you for not giving her the time of day, but I'm proud of you for being open to reconnecting and giving her a chance.  While you might not feel like it healed your past at all, as long as you're open to that being a possibility in the future, that's what matters, for your own good health, not hers.\n\nI myself befriended the woman my ex cheated on me with, and I found it to be incredibly healing.  It was after he did the same to her.  I'm currently sitting in the airport, waiting to fly out to meet her in Vegas for her birthday, in fact.  I was very hesitant at first, but introspection as a powerful tool for me to wield, and I think I did so well.\n\nI hope good things for you in the future.",
            "Good for you. I know how hard it is to be severely bullied as a kid. Like you, I was bullied all through elementary school and it didn’t stop until I moved out of town. When I came back to a minoring neighboring town, I was unrecognizable. I had gone through puberty, dyed my hair and stopped wearing glasses. I guess I was considered pretty suddenly and it was a big shock, me included. One of the guys that had bullied me, went to my new high school. I didn’t recognize him nor him me but after hearing my full name, he remembered me. He tried joking about the past, down playing it and he kind of said sorry. When I told him to go f*** himself and walked, he was dumbfounded. He ended up being a AH to me although high school. Doing little kid stuff, like through gum in my hair or trying to get my attention by repeatedly calling my name and then laughing at me when I finally ask what. I later heard he liked me but since he couldn’t tell me, he resorted to how little kids do it. I forgave him and all the rest of those kids that had bullied me but I could never be friends with any of them, let alone date one. I’d be too worried that it be another prank/joke they were playing on me. Because of their bullying, I have a hard time having any type of relationships including friendships and romantic relationships because my trust in people is so broken. I’ve gone to therapy and all but I can’t get the damage they did to me undone. I hope things go good for you and that she truly changed.",
            "That's great OP. I just read your previous thread and your comments. Meeting up, expressing what it did with you and making up your mind how you feel towards forgiving her was what I would've suggested. You can see how you feel going forward and something entirely new and positive could come out of this. Or not, but you gave it a shot and you (both) grew through it. Good luck!",
            "I found out from my sister that the girl who used to terrorize me for an amazingly random reason in High School apparently turned into a nice person. Don’t think I would care to meet her though. \n\nOn another note, I stopped the bullying cold by making her believe (accidentally but a strange response I have to terror) I was a psycho.",
            "people can change, that is absolutely true, but of alllllll the people in this wide world one can be involved with, its your former bully?",
            "Even disregarding the history of bullying completely, I'm not sure what you're thinking.\n\nThis woman regularly hangs out in the bar alone, gets drunk, cries and vents to the staff about how her life sucks.\n\nIs this really someone you want to be with?",
            "She must be SCORCHINGLY attractive for you to be so forgiving of her. Or you're just the most understanding person to ever live I guess lol.",
            "I’d do some serious reading about boundaries to be better able to spot red flags",
            "Congrats on making the mature choice and ignoring the drama-hungry people who often post here. \n\nYou are right, neither one of you are the same people you were over a decade ago. It's pointless to hold onto anger and resentment against a person who doesn't exist anymore.",
            "I just don’t see the point. You very clearly still associate her with bullying you are there no other women in the world?",
            "This like some kdrama scenarios",
            "This sounds lovely.  Liberating.  Good luck to you both!",
            "Whoa dude she obviously has a crush on you now. I’d say if she’s being serious and genuine then I would say to accept her request and if she apologizes for then accept her apology too. I wish you all the best😎",
            "Bullies stop being bullies because they are no longer in position of power. They will show their true self once they are.\n\nMany bullies i know are train wreck today and work low level jobs, they can’t bully anyone that’s why they seem more tame but they are still major asshole bottled up. \n\nIn your case, she was in the C group so still can be forgiven but everyone form B deserves do burn in hell.",
            "I'm sorry if this is insensitive, but I didn't get what the B in the original post stood for.",
            "It's Just a personal thought.\nYou met and forgave her that should be the end of it.\nI don't recommend moving forward with it.\nIf you believe you are totally over it and will not think of the things she did whenever you have an afterthought about her, a glance at her looking how she used to be and totally can handle fights when there is a possibility of things she can recite from your childhood that you already know you have been hurt of. If you can totally believe the person who used to be disrespectful towards you and now will respect and keep respecting you and your presence like a new person you just met ? \nFor me if someone was disrespectful towards me I would also lose my respect towards that person. Yeah people grow they understand that actions they used to do were shitty however things were said , stuff that happened in the past will always stick with you that will always be there to bug you that is part of your life you cannot just forget.\nApologies for being so pessimistic about it.\nI don't know how severe the bullying was but you still have to think it through.\nTake care.",
            "You are very compassionate to forgive them. This story gives me hope that things can change.",
            "Hey!\n\nFirst off, it’s really big of her to contact you and apologize after all these years.  Most people, even if they know they are in the wrong, don’t apologize because they are too embarrassed and it’s been too long.\n\nI was severely bullied in third grade.  Though it doesn’t excuse the situation, this girl went through a lot.  We “re-met” in high school and she was a different person.  She was incredibly nice to me.  We weren’t friends but we got along.  I graduated high school in 2017 so it’s been a while but last I heard, her plan was to go to college or join the air force.\n\nI hope something good comes out of this!  It’s great that you’ve forgiven her.  Forgiveness is more for you than for her anyways.  But people can change if they truly want to.",
            "Oh, you must feel so free of the past. Good on you for meeting up with her! :-)",
            "Good job, it takes a lot of courage to apologize for something that happened a long time ago, people can redeem themselves, I think you both won in this situation.",
            "I feel like this could be a very successful relationship. Honestly, these two strike me as very mature young adults. Best of luck, OP.",
            "You mentioned in your first post she was C team. It sounds like she was a follower not an instigator. It sucks what she did to you and she was friends with the mean girls but it sounds like she was more following the herd and didn't have the strength to stop it than an instigator and feels bad now.\n\nIt's probably worth talking to her about what happened with her and the other girls. Is she still friends with any of your former tormentors? Did they bully her too? Did they grow apart? I know this is thinking way too far ahead, but let's say you got engaged, would she want to invite the B squad to your wedding, or would she laugh and say God No about that?\n\nI guess I'll also throw this out there: hooking up with her might help you flip the narrative in your mind a bit.",
            "In these types of situations you gotta do what's best for you, Ya gotta fuck the shit outta her man😈",
            "I know how she can make it up to you! 😜",
            "I want to applaud you, OP. I for one probably wouldn't have done what you have(specifically because I'm a passively angry and petty person, and tend to hold grudges), but occupational me greatly applauds your interpersonal growth and steps you've taken to both approach your trauma, confront it, and simultaneously give yourself a fresh start with someone who could potentially be good for you (be it romantically or platonically). Either way, you did a good thing, and I'm proud of you, for what that is worth.",
            "You won't realize she never changed till you're married with kids and have to endure her bullying you instead of your kids..",
            "We do stupid things as kids that we generally end up regretting later.",
            "Dude no. RUN\n\n\nSHE HAS NOT CHANGED.\n\n\nRUN",
            "I do love a story with a Hollywood ending. So adorable.",
            "Ur better than me. I havent changed. They apologized on sm thru txt, havent met in person.",
            "It's so weird how people write a fake post here and then do follow ups.  Like, sociopathic or delusional weird.",
            "Set up a date then stand her up! HahHaha",
            "As you said it, people can change. You did. It sounds like she did as well, especially since she did the “got up walked out and came back to sit down” thing. Lol. \n\nI think I speak for everyone who reads your post…..give us an update in a few months!",
            "I’m really shocked, 4 billion women on earth and you decided to date your bully…\nI hope it works for you, but I’d cut ties before getting invested too much. You don’t need this. I don’t want to belittle your accomplishments because what you did for yourself is amazing, not everyone can claim they bounced out from that, but dating this woman is a recipe for disaster, it’s like giving a recovering addict access to drugs, maybe he’s a changed person and he’s never going to touch a drug ever, but do you really want to bet your life on it? You have no shared romantic history before, so you absolutely don’t have to do this…",
            "As a former bully, who has changed immensely in the last 15+ years, I believe people can change. Especially when people were bullies as children. Childhood is traumatic and kids just cannot be held culpable the same way adults can. I'm sure there are some people who were bullies as children, who continued on to become terrible adults, but I think the majority change for the better. I truly believe that about the people that bullied me. \n\nHowever, I don't have a huge belief that people can change as adults. Like if you are a bad person as an adult, I feel that's quite permanent, barring serious therapy and continuous, strenuous effort to change.",
            "Someone who recognized their deficiencies, changed, expressed remorse and has a good sense of humor? Dude...I would see where it leads. Sounds like she could be a quality woman. Browse these forums, that's hardly the norm",
            "What’d the bullies do?",
            "Reddit is a shadow of its former self. It is now a place of power tripping mods with no oversight and endless censorship.\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Biased but giving you a perspective since most here support giving it a chance.\n\nI say don’t do it! Pretending to be “strangers” might work short term but it  won’t on a long run. Life has a way of throwing unexpected events at us where we aren’t able to keep the game face on. Then it can all come out at once.\n\nSmile and move on. Start again with an actual stranger.\n\nAgain, I’m biased due to similar personal experiences",
            "If you can’t forgive bang her, make her fall in love, and then dump her out of the blue. Revenge 14 years in the making. That’s IF you can’t forgive her. If you truly forgive her then maybe this can blossom into a beautiful love story.",
            "Leopard don't change its spots.",
            "I really admire you for choosing to forgive her. I was bullied pretty bad in elementary by most of my classmates and I'm still dealing with it in therapy.",
            "Is your name Sophocles?",
            "Keep doing what you are doing :)",
            "Well done.  A good compromise and good for your soul.",
            "I congratulate you on being a better person than me. I honestly would have been the AH that would have been friends with Nina, then found out her biggest female enemy and dated the enemy. \n\nBe careful as most people that are bullies in school will be bullies in life. Watch out for red flags and games she may play with you just for fun. \nAlso just in case, find out her biggest female enemies... 😉",
            "Only you can tell if someone is genuine in their apology, it seems like she was. Thank you for sharing.",
            "I’d clarify what type of coffee (romantic or just talking) and go from there. Personally, I wouldn’t go either way - but I know for some folks it can bring closure.",
            "Right on dude. You’re very mature and I hope things work out for you.",
            "There is a gigantic difference between who we are at 14 and 28.    I'm glad you gave this human another chance, and offered her your forgiveness.   Good luck!",
            "This is a good story OP, I don't know if you choose to continue or just make friends with her but I have some thoughts. \n\nI am not a fan of enemies  to lovers tropes but I do have an interesting  statement Enemies to lovers isn't as much about trauma as it may appear, it's often about how much we crave attention and how even someone we have adversarial  relationships  with help us know they think of us as valuable, worthy  of thought or even threatening which may not seem super positive but it means you have their attention and that feels good.\n\nBest of luck OP, I'd  love to see updates doing forward.",
            "It kinda reminds me of the 2min date (or however long it was) that Ned did in How I Met Your Mother lol.",
            "[you take her out!](https://youtu.be/J4NcZwPdUZc)",
            "Update us on how it's going!",
            "I’m really sorry for you. I really feel you are in for a great fall, and that this is an incredible trap that she is setting for you. \n\nI have “forgiven” many people in my life, but they always go back to their evil ways. People never can really change, a leopard can’t change their spots. And somehow, she won’t either. \n\nBad things always happen to good people, trying to help bad people “get better.” What most people don’t realize until it’s too late, is that bad people don’t think like good people at all. As a matter of fact, nobody will think like you, ever.\n\nGo ahead, and try this relationship, but don’t get up any false hopes. \n\nIs she really that beautiful? Remember ever time you see a really beautiful woman, there is a man who is tired of putting up with her shit. \n\nPM me, and I’ll tell you more. You probably will never get to this one.",
            "I would have done exactly the same as OP. 15 years is a looong time.. especially at that age. Even 5 years is a long time at that age.",
            "Who even identifies as their 13 year old self or sees others as that? \n\nYou met someone completely new and she happened to be a girl you used to know as a child. You were strangers from the start.",
            "You smash and dash my dude",
            "I can just see this coming up in the future hopefully with a bit of humour if all goes well. \n\n“You didn’t take the trash out like I asked”\n\n“Well maybe you shouldn’t have called me fat in grade 6”",
            "She is husband searching, aka she's looking for a provider, not for love. She's reaching fur the baby rabies near the age of 30. People rarely change, I seriously urge you to walk away from this woman. \n\nShe remembers bullying you. She sees you as a sucker. Don't do it.",
            "Say no! Especially if youre still dealing with traumas she caused ! And tell her",
            "Just live man ✌️ don’t overthink it. It could go wrong it could be good. Just stay aware as if it was any person on how they treat you and what their motivations are. At least you start this new relationship with open communication and hopefully that can be the foundation for all types of conversations. All the best OP!",
            "Holy, this is like an irl anime plot line, except more irl"
        ]
    },
    {
        "post_id": "15upkan",
        "author": "Famous_Delivery5916",
        "title": "My husband of 16 years is having a baby. And it's not mine.",
        "url": "https://www.reddit.com/r/relationships/comments/15upkan/my_husband_of_16_years_is_having_a_baby_and_its/",
        "score": 3145,
        "num_comments": 485,
        "created_utc": 1692376871.0,
        "selftext": "I (46f) have lived with my husband (48m) for over 20 years, married for 16 and we have two kids (16 and 9). One year ago he decided that he has had enough of family life and went to live with his parents for some time. He was behaving like a bachelor for the entirety of his stay with them, found a girlfriend and was drunk constantly. He had used alchohol before but we never had much problems around it. He also spent a lot of his time playing games with friends on his computer.\n\nOne year ago he informed me that he found a girlfriend and was ready to move out of our apartment and cut ties, although he didn't quite do that. He left me (making close to minimum wage) to care for our two kids and also left a collection of unpaid bills going back months. After that I fell into a depressive episode that lasted two months and my two close friends managed to get me out of it.\n\nAbout three months after he left us, he came back, well not really. He started coming to our city, hanging out with the kids again and also with me, inviting me out for drinks and dinner. All was going well and my 16 year old went on a week long trip with him. \n\nFor a while, all was going well. He said that the girlfriend was a lie and he just needed some time away to clear his head, last night I sent him a \"Good night, love you\" text as I usually do, but in the morning he replied with \"I don't deserve your love. I'm about to become a dad again. I'm sorry\" I later called him to ask what he meant by that and he told me that he has a girlfriend in another country who is pregnant with his kid. She plans to keep it and he wants to cut ties with me and our kids to care for that child.\n\nI don't know what to do. I requested devorce but he declined saying he was not ready. Can anyone give me advice regarding this situation. Can I divorce him anyways, even though he doesn't want to do it. Is there any way I can secure payments to my kids, since with only my job I can barely make end meet for the basics. I do some odd jobs here and there but it's not enough.\n\n&#x200B;\n\nTL;DR! My husband of 16 years took a break from our marrieage, then returned and impregnated a woman he was seeing. He wants to be with her, but refuses divorce. I can barely make ends meet with my salary for our kids. Can I divorce him anyways, even though he doesn't want to do it. Is there any way I can secure payments to my kids, since with only my job I can barely make end meet for the basics.",
        "permalink": "/r/relationships/comments/15upkan/my_husband_of_16_years_is_having_a_baby_and_its/",
        "comments": [
            "Speak with an attorney asap. He doesn't want a divorce because he doesn't want to help with the kids. File for divorce and request child support and alimony.",
            "> I requested devorce but he declined\n\nYOU DO NOT NEED HIS PERMISSION TO START A DIVORCE.",
            "Even if you guys are split why the hell is he not financially contributing to your kids’ needs?? He doesn’t get to just up and leave and you deal with everything. If he wants to leave then adios but he has to financially support/assist. You need to talk to someone to take the next steps. Ask the friends that helped you before to navigate the lawyer process with you. Fuck that guy he’s a loser.",
            "This shit makes me wanna cry",
            "You need a divorce lawyer. Many will do the initial consultation for free. You're going to need a divorce and to set up child support.",
            "He's not ready for a divorce, but he was ready to make a child out of another woman!",
            "Jesus christ…one of the worst things I’ve read in a while. \n\nWhy the fuck do these men that have children outside of their marriage choose to just abandon their previous children/family?? Like okay, you’re already a disgusting individual that let your family down. But why choose to punish them even more by abandoning them?! What a disgusting excuse of a man",
            "He doesn't get to announce that hes leaving you and his kids for another women while also saying he doesn't want a divorce. He doesn't want the divorce because he doesn't want to pay child support. That's not how it works. \n\nContact a divorce lawyer anyways and get him for everything penny he's got.",
            "It’s already wild to me that you allowed him to come back and went to get drinks with him, sent “good night, I love you” texts etc. after he abandoned you and your two kids and left you with his debt… Divorce should have happened a year ago.",
            "You get a divorce and take him to the cleaners. \n\nGet a divorce lawyer ASAP and record every single thing your ex says to you. You'll also want to start setting up therapy for your kids.",
            "Please please please call a lawyer ASAP. You are being manipulated and are in an emotionally abusive relationship. This man is going to continue to ruin your life when he should be paying child support.",
            ">I don't know what to do. I requested devorce but he declined saying he was not ready. Can anyone give me advice regarding this situation. Can I divorce him anyways, even though he doesn't want to do it. Is there any way I can secure payments to my kids, since with only my job I can barely make end meet for the basics. I do some odd jobs here and there but it's not enough.  \n\n\nA divorce lawyer will answer these questions. We don't know where you live so it's hard to answer these questions",
            "Man, Fuck him extra for sending that as a text *first thing in the morning.*\n\nAs for the rest of it, this isn’t legal advice, but I do have some experience with what this is. \n\nOne, initiate divorce proceedings if you can where you live. State by state matters. Use avvo dot com to find a family law attorney who will give you a free consultation. \n\nFind out their fees \nFind out if they will do a flat-fee divorce\nDon’t leave your home if you don’t have to, or he can claim you’ve abandoned it\n\nMention to your lawyer that you don’t know if he’s married or not, and practicing bigamy. \n\n*deep breath*\n\nBecause that’s a lot more common than many families find out until the man who is a bigamist is dead. By then, most of his other wives are, too, so it’s easy enough to hide. Or has been, for the last two generations. \n\nAnd get yourself an STI test and therapist. \n\nIf you’re in the US, Mental Health America should have a local spot in your state offering pro-bono counseling. \n\nFinally, go to the hotline dot org if you have concerns about any other behaviors and patters from this relationship. \n\nRepeat after me: *I’ve got this.* repeat as needed.\n\nEdit: thanks for the gold!",
            "File, and DO NOT TELL HIM PRIOR. If he went and hid from a wife and children, he’s going to hide from whoever tries to serve him papers if he knows it’s coming.",
            "Another childish male with midlife crisis is destroying his family’s life. Dump him and completely remove him from your life.",
            "The reason he “declined” (you don’t need his permission to divorce him FYI, not in most countries anyways) is because then he’d be required to pay child support and possibly alimony. Save copies of all communications and proof of his infidelity. Get a lawyer ASAP and take this sad excuse for a man to the cleaners. Doing this immediately is important if he has plans to leave the country. I’d also track down his girlfriend and tell her EVERYTHING - that he abandoned you and his other two children to be a middle aged teenager, that he came back and started reconciling with you until the pregnancy, etc. She likely has no idea and deserves to know before having a baby with this scumbag. Also, as a bonus it could fuck up his life even more and leave him divorced, single, and paying child support to two exes. 🙂",
            "Edit: I shouldn't have assumed you were US based. Still, your best bet is to contact a lawyer to answer at least the divorce questions you have. Then see if your government offers any sort of assistance programs.\n\nHe declined? That's not how that works. Find a lawyer and have him served. Contact child support to apply, look into things like SNAP, TANF, and Medicaid.",
            "You are continuing to try and maintain a relationship with a man who doesn't care about you. He returns because you are an easy option and you have not assigned any consequences. You need to speak to a lawyer or advocate in your country, at the very least stop speaking with him and sending him I love you texts. Do you have family you can ask for support?",
            "If your husband has fathered a child with another woman, surely that gives you the grounds for divorce without permission?",
            "He had a new kid and wants to abandon the ones with you, scum bag you’re dealing with",
            "He has you totally bamboozled.  Get acquainted with your rights and get what you deserve.  Time for him to find out that he can’t just waltz in and out of his wife and kids lives without consequences.",
            "Put your kids first. Divorce him.",
            "If you’re not American, you may be able to get a general idea of the divorce procedure by googling “divorce procedure [your country/state]”",
            "You need to get in first to formalise things and apply for child support, you don’t know how the situation with the other baby will work out, and the one who files first often gets a bigger percentage of his salary.",
            "Love is real so no judgment- all I can say is I’m sorry your love and care are being abused like this :/",
            "i’m not passing any judgement but you needed to *file* for divorce a long time ago. not ask. he has not been a partner to you in your family or finances for several years. he has been cheating on you for just as long, if not longer. it’s time to speak with a lawyer and start your divorce, child support payments, etc. this is absolutely unsustainable for yourself and your children.",
            "He’s right, he doesn’t deserve your love. Don’t ask for divorce, tell him it IS happening. Take him to court for child support and get want you need and your kids are owed.",
            "Say goodbye and stop wasting you life",
            "I saw you stated you live in The Balkans and a quick Google search shows that if he needs to agree or not to a divorce depends on which country you reside in but I think most allow for a contested divorce, it will just be a lengthier process than uncontested. But you absolutely should talk to a lawyer because you and your children deserve to be protected.",
            "Reach out to the nearest woman’s resource services near you and get the name of a good lawyer who deals with this kind of stuff. You don’t need to ask someone for a divorce. Just divorce them.",
            "When you think humans can’t go any lower!!",
            "He walked out on you and your children. This man literally walked out on his family. File for divorce, you don't need his permission and have a legal, valid reason for doing it. Also he committed adultery and got another woman pregnant during your marriage; regardless if you two were not together at the time you were still legally married. \n\nYou have every legal right to file a divorce without his even knowing. Just serve the papers to him and walk away. Run even.",
            "Y’all kids deserve a better father and you deserve a better husband.",
            "Don’t want a Divorce = Don’t want to pay alimony and/or child support.",
            "Just divorce him already. You can do so much better than this.",
            "Jesus Christ stick up for yourself. The second he up and left the first time you should have divorced. You don’t need his permission. Get a lawyer and take him to the cleaners. What kind of example are you teaching your kids about how to treat a partner?",
            "Here’s the cool thing, you don’t need his permission to divorce his ass. I’m sorry you are going through this. Just file the paperwork with a lawyer.",
            "I'm so sorry that you've been put through this. It's awful for you and your children. \n\nI agree that you need to kick things off and make sure that your children are getting the financial support they deserve from their Dad. \n\nIf he moves internationally, it might be very tricky, so you need to get things sorted before he can make any sort of move like that.",
            "Speak with an attorney, make sure you don't have ANY joint banking accounts with him, and start divorce proceedings IMMEDIATELY. Get an order for support from him for the kids. He's trying to stall until your oldest is over 18 and he won't have to pay child support for him. And if he leaves the country you will probably not be able to enforce a support order.",
            "I really hope you divorce him asap",
            "Hopefully the text saying he's having a baby with someone else and doesn't want to be with you will help get you a divorce. Save everything - take screenshots and back it up.",
            "Speak to an attorney about irreconcilable differences. Cause an affair and baby is a deal breaker.",
            "I googled Divorce in the Balkans and it says you can divorce by either mutual consent or by lawsuit in a closed court to protect your privacy. If you are in Serbia it said divorce was very liberal there. On child support it said: The amount of child support depends on many factors that can be divided into two groups – the needs of the obligee and the income of the obligant. The amount depends on the child's needs and the parent's income. It means that the amount of child support varies from case to case. It is always monetary.\n\nSo you need to see a lawyer and start the process as he will need to pony up.",
            "You need an experienced family law attorney licensed in your jurisdiction, and you need to follow that lawyer's advice. You do not need his permission to file for divorce, and your children are entitled to child support, but you need an attorney who can walk you through that process and maximize your financial recovery in the divorce and your chances of actually being able to collect the money your kids are owed.",
            "This feels like a mid-life crisis situation. You don’t need to carry his emotional weight, let him figure out his shit and leave. Fuck him. Talk to a divorce lawyer asap. He can’t have everything on his terms.",
            "You don't actually get to decline divorce. It only takes one person. It might take a while but you will get divorced regardless what he has to say on it.",
            "What *he wants* went out the window once he stepped out of your marriage. No....absolutely not. Keep receipts of his confession. Talk to a divorce lawyer immediately. Be safe, though, and don't let him know so he doesn't flee. He owes those children he has with you and the new one. He's 100% wrong here. Don't take him back, I know it hurts, but you'll be thankful later. Good luck.",
            "He left you a married single mother, and started a whole new family while you are still married. Can't you get crazy alimony for something so treacherous?",
            "You need to file *now*, before he leaves the country. The court will restrict his ability to travel until everything is worked out.",
            "You don't need his permission to divorce him. Do it, and do it quick so you can file for child support. He's probably going to end up deserting his GF, too, and the first one to the table gets the lion's share of the child support.",
            "You don’t need his permission to divorce him. He can’t hold you hostage. Get a lawyer, serve him with divorce papers, take him to court, and get a divorce and get child support.",
            "He doesn't get to decline a divorce. wth.",
            "You need to speak to an attorney immediately. The reason he doesn't want a divorce is to try avoid paying alimony. Get all your ducks in a row and get your lawyer to take him to the cleaners for you and your kids.",
            "It's so callous, I wonder if he's a narcissist, the flakey selfish and compulsive lying behaviour makes me suspect that. Anyway, you sound like a kind and understanding lady who considers what others say and feel before you act. Your estranged husband however has messed you around in one of the worst ways possible. Don't feel guilty for pursuing divorce and alimony. Jokers like him rely on the kindness and forgiveness of others to keep getting away with nonsense. I don't know about your divorce options legally as I don't know what country you are in and what country your husband might elope to. I don't know much about it anyway, but mentioning those things may allow someone more knowledgeable to give you better advice. Hope it works out soon for you",
            "He is an asshole behaving like a irresponsible teenager, hit him legally and hit him hard to put some sense into him.",
            "> I requested devorce but he declined saying he was not ready.\n\nIt doesn't work that way.  Consult with an attorney and get the ball rolling.  He doesn't get to veto your divorce request simply because it's inconvenient to him.",
            "Whether or not you can divorce him without his permission will depend on where you live.",
            "As a mental health professional my brain goes there pretty fast..sudden bizarre changes in behavior can be a cognitive/medical issue",
            "This isn't directed at you OP, but why do women have children with men who don't want to take care of their other kids? If I ever met a person who wanted to abandon their spouse and children for me and my child, that would be the hugest turn off ever.\n\nThis man thinks he can just scroll in and out of people's lives like a video game. Fuck that guy. Tell your children who their father really is (telling the truth is not defamation). File for divorce now and lawyer up for spousal and child support.",
            "You do not need his permission. Go get a lawyer asap and get the divorce papers ready and make sure you put the reason for your split his infidelity",
            "He’s not ready for a divorce as he wants to come back to you if it doesn’t work out",
            "> requested devorce but he declined saying he was not ready.\n\nNot up to him. Call a lawyer for you who will force him to be ready.",
            "Neither you need his permission to go ahead with divorce nor you have to wait so long for him to abandon his family twice. The proceeding should have been started the time he moved out. And why were you OK with him having a girlfriend while still being married to you and accepting him after he abandoned you and kids. He doesn't want to divorce because he doesn't want to be liable for child support. Drop him please, you can do much better OP",
            "In this scenario, child support the fuck out of him.",
            "He doesn't want the divorce because he'll have to pay child's support.\n\nIf you stay married, he can just pretend like he doesn't have responsabilities for his kids.\n\nYou can divorce him even if he doesn't want to. Talk to a lawyer, they'll have him pay for his part of the kids lives.\n\nHe's an AH BTW and I'm sorry you're going through that",
            "This is a one sided rough one. \n\nBest lawyers and wishes OP.",
            "At 48 he's having a baby? Yeah OP clean him up financially thoroughly. Is there a pro bono lawyer or something like that? Find it. You definitely need a lawyer. \n\nHis life is screwed with a baby at this late age. Your kids are almost grown, focus on yourself and your kids. He is a baggage you don't need.\n\nGet that lawyer and make him financially responsible for you and kids. Leave him nothing for his next family.\n\nUpdateme!",
            "Why don't you fucking talk to a lawyer? Seriously what is wrong with you. Stop treating him with kid gloves. Treat him like the enemy he is. Divorce, take half his shit, 401k, pension, alimony, and child support. Apply for every government program you qualify for; Snap, Tanf, Medicaid, etc.",
            "Maybe it's just me, but I'm seeing this a little differently.  Is there any concrete evidence of him having traveled to this other country, to meet and impregnate his girlfriend?  He said he had a girlfriend, but then said it was a lie as he was weaseling is way back into your lives... but now the girlfriend's real again *and* pregnant??  It sounds like he's having some kind of manic depression and/or anxiety, and he's very unsure of his life and future.  Have you had a chance to actually talk with him about this all, or is it being based on just some text messages exchanged?  And then you brought up divorce and he got flippy-floppy about his future with you and the kids again?  I don't know... I'm not convinced there's a pregnant girlfriend.  Perhaps there is, but I'm not convinced.\n\nIn any case, you and the kids deserve better and you don't need to -- nor should you -- wait for his approval to formally and finally severe ties with this person.",
            "How’s he having the baby?",
            "What country are you in??? In most countries, you can just divorce him! Call a DV group tomorrow and ask if there are any pro bono or low cost attorneys and get started now. Secure any money, etc. in a joint account where he can't get it. It is also your money, just make sure this is okay in your jurisdiction. If he leaves the country, you may be screwed, or you may not, but get this started TODAY. Call those two wonderful friends of yours this second to get them to help you.\n\nHe cannot \"cut ties: on his minor kids, not for child support. You can also get him to pay for when he was gone.\n\nWhat does his family think of this? Jesus.",
            "What kind of man does this shit ? He's a f...king moron . Yes you can divorce him whether he wants it or not. He more than deserves all of the consequences and bad karma that is coming his way. I hope you and your children get a nice hefty sum in child support and i wish you nothing but the best. You will be better off without this dumbshit.",
            "You don't need him to \"agree\" to the divorce... you can push it through. Do it asap and file for child support and alimony asap too. Don't fall for any manipulation from him. I'm sorry you're going through this.",
            "Sounds like he has a brain tumor.",
            "File for assistance and child support now. Sounds like there is no way you can afford a divorce currently. He abandoned the family. I’m so sorry.",
            "Ask for proof. He's swinging so hard, that it might be mental illness (with no mistress and a baby), and that's something that falls under \"in sickness and in health\" you promised to him. If he gives no proof, try to convince him to see a doctor. \n\nIn the meantime, also consult a lawyer in case it's true.\n\nIn both scenarios, try to think how you could keep him in the country. Both mental illness and divorce are easier to handle when he's in the same country as you are.",
            "How do you know it's not yours?",
            "If you live in the United States you do not need his permission for a divorce. You can get a no fault divorce and be done with him very easily. I paid $1200 for my mom’s no fault divorce and was divorced in 6 months. Laws ate different everywhere. Some states require a separation period before the divorce, etc. Go to a lawyer right away. \n\nGet your name taken off all the bills and lines of credit. He will run up the bills and lines of credit to ruin you. If you have a joint bank account take out only whatever money belongs to you and then don’t touch anything else. Get your own account at a whole different bank. \n\nCollections will try to come after you for his debts. Do not pay any of his debts without consulting an accountant first. Stop helping with any payments whatsoever except for things you are currently using like your light bill and phone etc. \n\nTake any important documents and put them in a safe deposit box at your new bank. Get a post office box for all your mail. Fill out a change of address form for yourself and your children so your mail will go to the P.O. Box. \n\nConsult a family lawyer (if you have little funds done will help you for free) to get a custody agreement in place for the children. That way he can’t abduct them.",
            "Discuss financials for the wellbeing of all kids involved. Avoid emotions interfering. Divorce not a condition for positive outcome.",
            "If you’re in the US you don’t need his permission to divorce. But it will take a long time since kids are involved. Also if he works you can have his paychecks garnished for child support.",
            "You do not need your husband's permission to leave him and get a divorce. And from what you've told us, you need to go on ahead and move that along.\n\nYour husband, after 20 years, suddenly decided that he didn't want to be a dad and traipsed off to live the bachelor life, sticking you with the support and care of your two kids alone. Then he swooped back in three months later, only to turn around a few more months later and say \"actually now I want to leave you and take care of my new family?\" WTF? But he's not ready for divorce??\n\nThis guy sounds like he is 100% not worth the headache. Divorce him, file for child support, and tell him not to let the door hit his ass on the way out.",
            "Op, talk with a lawyer, he doesn't want divorce because he doesn't want any responsability. He will probably try to come back when he realizes the grass isn't greener in the other side and that he is a complete loser. I read that you are from the Balkans, I read the following:\n\nA marriage can be dissolved by the courts in two ways: by mutual agreement of the spouses or by the filing of a lawsuit for divorce. In these court proceedings the public is excluded in order to protect the privacy of the family.\n\nI guess you would have to file a lawsuit for divorce, but I am no lawyer or from your country ( latinamerican here) so yeah, get in contact with llawyer.\n\nAlso, be mindful of your kids, they will suffer from your husband being a POS and abandoning them again.",
            "You don't need his permission to start a divorce. You need a lawyer ASAP.",
            "You need legal advice ASAP. You may not need to be divorced yet to get child support! And sometimes the payment amount will be retroactive to whenever it was initially requested, so file asap. \n\nMore importantly and imminently - it sounds like there is a possibility he may leave the country to avoid paying. This is why you need legal advice ASAP. I don’t know where you are but in the US the government can decide to confiscate someone’s passport for that reason. Gather and securely store any evidence of his intentions to “cut ties with his family” and that he has a pregnant gf abroad. Courts do not look kindly on people who think they can walk away from such legal obligations. Please speak to a lawyer, I know it’s expensive and you’re struggling but it will pay off in the long run.",
            "Can you update the post please to say what specific country you are in? So we can look up what resources are available to you?",
            "Yes you can divorce him.  You go to a lawyer NOW and get a custody and child support order for your kids.  That's what you do.",
            "You should speak with an attorney. Infidelity is a legitimate reason for divorce. He's also trying to.flat out abandon you.",
            "Not gonna get any sort of alimony when he moves to another country and refuses to pay.",
            "Divorce, you don't need anyone's permission. Take everything away from that piece of shit.",
            "You absolutely need an attorney immediately. File for child support immediately, back dated to when he first moved out, and file for divorce. _Take everything you can get_.",
            "Get a divorce, you deserve better",
            "You need an attorney yesterday. If he plans to move to another country then child support may be difficult, but I can't be sure. Get legal advice.",
            "Speak with a lawyer and file for child support.",
            "You do not need permission from him to start divorce proceedings. Speak to a divorce and family lawyer asap and get a plan started. He made his choice, he can’t keep you on a tether while he does his wild oats.",
            "What a piece of crap. You don’t need his permission on a divorce. Talk to a lawyer before you talk to him again",
            "TALK TO A DIVORCE LAWYER.\n\nEven if you think a court divorce will be too expensive, TALK TO A LAWYER SO THEY CAN TELL YOU WHAT TO EXPECT\n\nHe doesn't get to abandon his first family scot free. He can say he doesn't want a divorce all he wants, doesn't mean a thing.\n\nTALK TO A LAWYER. NOW.",
            "Sue this fucker for child support. He’s a loser",
            "Save any and all evidence and contact a lawyer than tell them that he has a pregnant mistress in another country and he wants to leave to be with her and raise her baby but he doesn’t want to divorce.\n\nAlso You do not need his permission to start the divorce process, he just doesn’t want to divorce cause he knows he has to pay for it. Don’t let him get away Scott free.",
            "Divorce him and secure resources for your kid before the new one is out of the womb. Lock down shared accounts and high-end items",
            "Divorce in the US is no fault and can be initiated by any one of the people in the marriage. He doesn’t have to agree. Divorcing him will almost certainly result in him being required to pay child support, and potentially alimony, and it will cut ties with him so he can’t do any more financial damage to you. It sounds like there’s really nothing to work on with this guy and you should definitely divorce him. I’d say you should have done it a year ago and that you’ve put up with/been through enough already.",
            "Most civil courts have a free family law program to point you in the right direction if you are unable to afford an attorney.",
            "the grossest part is he wants to cut ties with his current children as well. doesn’t work like that though, go to a lawyer asap and file for divorce, doesn’t matter if he’s “ready” or not, he doesn’t have to be apart of his kids lives but he absolutely needs to pay for them.",
            "He's not ready? Who gives a shit.",
            "Contact divorce lawyer don’t take his word for anything",
            "Start the divorce and get you and your children support before your dirt bag ex-husband flees the country leaving you in the  dust.",
            "Wow! Your ex is a real shitbag!\n\nWhat country are you in? There are different divorce laws depending on where you are.\n\nHowever, as far as I know, the father has to contribute financially to his kids no matter what.\n\nLike others have said, you NEED to get a lawyer.\n\nMake sure you find out exactly where he lives so he can receive any court summons.\n\nIf you're living in Canada or the USA, you can get a fault based divorce. His faults were leaving you and the kids, not paying the bills and getting someone else pregnant. This easily constitutes \"irreconcilable differences\" and is a clear basis for a divorce.\n\nSome places require a separation period, but it sounds like that's already happened.\n\nIn short, you don't need his permission to get a divorce and he **does** need to financially support his kids with you. The courts might garnish his wages to make sure he pays what he owes.\n\nAgain, talk to a lawyer.",
            "File for divorce with a lawyer, it isn't up to him and you should have done that the moment he pulled this nonsense",
            "Im sorry he's hurt you again. I felt that sinking gut feeling, and it didn't even happen to me.",
            "Divorce him and get child and if you can spousal support. There’s nothing further to discuss with him if a lawyer isn’t involved. \n\nMy ex did close to the same thing and I only wish I went harder with the lawyer when I did to get what was rightfully mine and the kids. Don’t fail your kids by letting him walk out. Lawyer up hard.",
            "One question: during the 20 years of you living with him, was he already that unstable?\nIf his behavior is completely out of character, he may be struggling with mental issues. Does he have family to check whether he’s normal?\nEventually if mental illness were the problem, there would be a chance that he gets a treatment and comes back to normal, which would solve your problem too.",
            "You’ll be fine; just make an appointment with a divorce attorney and drag him through court. If you’re close with your family, don’t be afraid to ask for support. A contested divorce with an attorney should run about $5k depending on where you live. \n\nYou’ve been married over 10 years. You’ve likely got Alimony plus spousal support in the bag depending on the state, plus child support and you’ll probably be able to take the house as well. He’s gonna go down on adultery. \n\nSo again, sit down with a divorce attorney, tell them what happened, serve him with divorce papers. Given the circumstances, 99% chance you’ll clean him out.",
            "Cut this selfish bastard loose. He’s not an asset to you or your kids.",
            "Start a divorce. Take his ass to court for alimony and child support. Take time to heal. He is an asshole and hope univerhas better plans for you n",
            "Can this even be real? No offense I just don’t understand how people allow their loser husbands to jerk them and their children around like this. Wtf?",
            "If you're broke just forget about him and start a side business and take control",
            "Girl take him to court to pay his dues!!! Do not delay!! He can leave you but he can NOT shirk his responsibilities to his existing family! Divorce the walking midlife crisis but get what you are owed!",
            "24m, dad was this guy from 7y old.\n\nI’m a kid of a fucking dipshit dad who did the same thing but at a much earlier age. He left us and drank, played video games, and just did his own thing after racking up huge debt for my mom and selling the business they made together for a new car. Drove to AZ and fucked off. \n\nMom had to work 2 jobs and I never saw her for most my early life. Until she found a new husband who actually cared and had a good stable job. Then my dad came back jealous and wanted to “raise us” and “teach us” things. Like who even are you..\n\nAs someone who grew up in that scenario. Just divorce the idiot and find someone else ASAP for the kids. I wish to god I had a good role model growing up. Especially a dad as a male myself. I never got that. Really sorry for what you’re going through. He WILL NOT change and don’t expect him to. Move on from him and find someone who will care for you like my step dad (who is really my dad as he raised me basically). Wouldn’t be here without him.",
            "Divorce him yesterday. \n\nYou are being a bad mom to your kids if you don’t (I know that sounds harsh, but sometimes hearing it in a harsh way can be eye opening). Your children are owed support from their father and you are owed any support from the marriage and bills he up and left you with. Stop being his doormat so he can run away from his responsibilities and stick up for your kids and yourself.",
            "Get an attorney. Stop talking to him unless directly related to your children.",
            "Good grief, get a lawyer and divorce this dude",
            "Your poor children. I can't imagine what they're going through.\n\nAs far as divorcing someone goes, check the laws where you live. Mostly the answer is yes, you can divorce without their agreement but you'll need to speak to a family lawyer. I would get on that ASAP. And yes you shoukd be able tonsexure child support.",
            "If you’re in the US, yes, you can get a divorce. You’ll need a lawyer to determine your rights, and need to determine what the laws are especially if you’re outside the US.",
            "Regardless of if he’s divorcing you or not , he has to pay support. I’m not sure where you’re located but look into any legal action you can take against him for abandonment. But seriously, get some legal assistance and protect yourself and your kids. \nWhat a midlife crisis putz. Geez",
            "Don’t let him flee the country! If he goes to another county it will be impossible to hunt him down for child support. Do an emergency divorce asap.",
            "There is a lot of good advice here so I just wanted to send you some love, a virtual hug and let you know that you're not alone. You have a community of people to support you and lift you up if needed here.  ❤️❤️❤️",
            "OP you're getting a lot of legal advice but it seems to me you may not be in the US and legalities differ widely between countries. Make sure whatever you decide to do will actually work out legally in your country.",
            "You can file for divorce. Ask for child support and spousal support (depending where you are from) if there is a chance he’s going to leave the country, I would do all of this very soon.",
            "Your husband has the maturity of a 12 year old. \n\nHe got his girlfriend pregnant and declared he doesn't want anything to do with your kids or you, yet he's not ready for a divorce. I guess this is his show and no one else's.\n\nMidlife crisis or not, I would drop-kick him to the curb and consult with a divorce attorney asap.",
            "Dump him. Divorce him and sue every penny out of the manipulative abuser.",
            "Not a lawyer and honestly this is just my opinion but since he impregnated someone else it should be automatic non contested divorce, alimony and child support....but unfortunately that would be to right and to easy..Goodluck I'm sorry have to deal with this",
            "You don’t need a divorce to get CS! If you apply for cash assistance and say you guys are split up they’ll tell you they’re going to file for you. That’s what I did in IL before starting my divorce. Should be the same in all states\n\n*edit *\nI see you said euros, not sure about how Europe does it, but I’ll look into it for you!",
            "Who cares what he wants, get a lawyer and get child support.",
            "That’s messed up! I never understand people who want to cut ties with some of their family just so they can be a part of another! Like, if he doesn’t want to be married to you then that’s one thing? But he doesn’t have to cut ties with his children just so he can raise another child! That’s some BS right there! Plus, it’s so ridiculous of him to think that he gets to cut ties with you but still be married to you! Get with a lawyer and file for divorce! It may be a hassle getting him to sign the paperwork, but I’m sure it will at the very least show him how serious you are and that he can’t just stay married to you while being with another woman!",
            "He got tired of the family life but wasn’t too tired if he made another family. That makes absolutely no sense. Cutting ties with the kids he already has because another kid is coming also makes no sense. Hope his girlfriend knows he’s going to leave when he gets tired of that baby and girlfriend.",
            "**SERVE HIM THE DAMN PAPERS!!**\n\nYou get a lawyer and file for divorce.\n\nYou’ve been letting him make all the decisions here.   Now you’re  **requesting** divorce like it’s an ice cream???\n\n**YOU** decide when it’s over. \n\n**YOU** serve him the papers.\n\nBe utterly RUTHLESS. Take him for **every damn penny**.",
            "You need to speak to a divorce attorney. Asshole husband is trying to get out paying alimony and child support. He will have his cake and eat it. File for divorce so atleast you and the children are supported. In the end, he will regret his mistakes but it will be too late.",
            "Is this kind of behaviour from your husband out of character? You had been with him for 16 years already. Was he always this erratic?",
            "One word: Lawyer. \n\nYou get that man to pay child support & MORE.",
            "If you have joint anything, make sure you document stuff and go to a divorce lawyer.   Make sure you also let them know how much you provided alone while he was off doing what ever. \n\nHe made this bed, now he needs to lay in it",
            "If you can't afford a divorce contact the court house the have a indigent program",
            "‘Declined Divorce’ lol",
            "Ew, what a disgusting read. Sorry for what's happening, what kind of a dad does that.",
            "Contact a lawyer! You need to file for divorce and get your child support first!! Often the first to file out of the baby mommas gets the biggest support amount.  Of course it varies from state to state, country to country.",
            "He doesn't have a choice about the divorce. If you file for divorce, the court will rule whether your husband wants it or not.",
            "My first question is what country do you live in?  The answer to this would help folks give you better advice.  The way you've written this, it doesn't sound like you're in the USA which is where I am.  \n\nI know that in the United States, you wouldn't need your husband's permission to get a divorce and you would certainly be granted an order for child support. I don't know what is typical for your country.",
            "It really depends on what country you live in. But I would find out where you are. I know in the US he can’t just decide not to pay child support. Well he can but it will add up. Also you can still file and he will have to respond by a certain time. But I don’t know where you are. Most people can’t give advice without knowing the laws there. …… I’m SO sorry this happened. The same happened to me. I was left with 4 kids and had never worked. I had all the bills and no money. I know everyone says get an attorney but they are expensive and not everyone can afford it. But do what you have to. Don’t let him get away with it. Talk to whoever you can that has been through this. What about his parents? What do they say ? Do your kids know? Don’t hide anything from them. They are old enough. He is sick. He doesn’t need to be in yours or the kids lives. To just walk away and say he chooses someone else. He’s also been lying to you. Try to divorce him right away. He can’t control everything. That’s not fair to you and the kids.",
            "Yeah... Fuck this guy. What a scum bag.",
            "Get a lawyer and file for divorce. He’s only refusing it because he doesn’t want to pay child support.",
            "The others have given sound advice re seeking legal help immediately. There may be legal aid available to you if you earn below a certain threshold of income. I'm really just stopping by to say I am incredibly sorry for what you are going through, and the fact he's gaslighted you. You deserve so much better and so does your children. Wishing you the best of luck, OP, and sending you lots of love and healing wishes.",
            "He doesn't get to make the decision.  You can get a divorce.  Heck - your attorney should be able to help you make him accountable for the bills he left you with and child support.",
            "You match over to the court house file RIGHT NOW. You do not owe him the time of day. He is a selfish loser. He cannot pick and choose which kids to support. ALL KIDS DESERVE TO BE SUPPORTED BY BOTH PARENTS.",
            "He's not only saying what he would do to you and your kids, he has abandoned you and your kids twice and left you to fend for yourself. \nSeek the services of an attorney, get advice and help to proceed with your divorce if you have already decided to. Secure your rights and the needs of your kids.",
            "You need to file child support now. Whoever files first gets the most money per child",
            "I feel very sorry for your children. Just get a lawyer and let him do all the work but please divorce this man. He's having a midlife crisis and trust me, you do not want to be along for the ride. He will regret his decisions someday.",
            "He doesn't get to decide if he wants a divorce or not. Go file and get that thing going before a child support order starts garnishing your (his wife's) wages.",
            "How sure are you there is even another girlfriend, that she's even pregnant, and that it's even his... He could be getting scammed into paying child support on a kid that didn't exist or isn't his leaving your kids high and dry.\n\nAny way you look at it this is definitely lawyer level stuff... You're way beyond relationship advice here and into financial and legal territory.",
            "Yep. He doesn't get to play Russian roulette when marriage and kids are involved. He can have his bachelor or new life with this \"girlfriend\" but it's going to cost him. You make a commitment your bound by law to uphold and don't you dare let him off the hook. Your making minimum wage caring for these kids. Hopefully you have this entire process documented because you will need this down the road. Think of the kids. They need financial support and this man can't be trusted to do the right thing without legal intervention. Also for your own sanity stop going on this roller coaster with him. He's using you as some safety and not allowing you to get on stable ground.",
            "Starting the divorce process as early as humanly possible is the only way you can secure funds for your children as well as get appropriate tax breaks and government help. If you have 2 incomes you may not get anything. File for legal separation ASAP.",
            "Part of me wonders if this isn't another manipulation to get out of being a dad, but keeping you on the hook to not divorce his ass.  Is there really a girlfriend in another country?  What the fuck is wrong with this guy? \n\nEither way, you need to decide if you're done.  If you are done, find out what the laws in your country are for divorce and how to go about getting what you deserve for child support.  A lawyer will definitely pay for themselves in this case.",
            "First of all I want to say sorry for everything he's putting you and your family through this is so messed up on many levels. I would get a good attorney and completely cut him out.",
            "If you have a joint account, pull 1/2 the money out",
            "Meet with a divorce attorney on Monday, the consult it usually free. Look into someone who takes payments/or legal aid- usually you could go after the spouse for legal fees, but I'm doubtful he has much money given what you've said.\n\nStop asking him/communicating with him, just file now. Sadly it may be a long time before you see any child support money (does he even have a job), but get it started and he'll have to pay back child support.\n\nWith your kids in school, start looking at better paying jobs, not sure what your education background is, but factory jobs are often better paying and offer benefits, or even restaurant jobs with management options, substitute teaching can be very lucrative- basically, it's you who is going to have to provide for your kids. \n\nLook at applying for medicaid for health insurance, food stamps, reduced/free lunches for the kids at school, look at food pantry's, these are all wonderful services that your local community offers, it just takes some digging.\n\nI'm assuming his parents know what is happening, but if they don't, let them know he has left their grandchildren and you are struggling. Maybe they can offer assistance?\n\nIf you can, lean on those good friends who helped you out before, unfortunately, this isn't an easy situation, but for your kids you need to get started taking care of everything.\n\nDo not tell him what you are doing, consider either getting a new phone (if he can access yours, get a simple track phone to call lawyers etc.). Change all  your passwords, make sure you know where all the important documents are. Don't let him put any more charges on credit cards you have jointly, put a freeze on your credit. You can not change the locks (I see so many people suggest this in this situation). \n\nListen to whatever the lawyer tells you to do.",
            "What an absolute clown of a man.",
            "I blame you for coming back to him after all what hes done to you and your children he is  disgusting  and the fact he told you befor he had a girlfriend and left to live with hes parents and you still wanted to be with him after he came back is dumb he knew you would always comeback to him he played you when he needed you and threw you when he is bored.",
            "Depends entirely on the laws in your country.  Where I live divorce is pretty much always granted.\n\nIn say, the Philippines,  if the husband refuses it may be harder or not granted.",
            "Girl you deserve so much more in a partner. He wants to cut ties and be with his new family, but also won’t divorce? \nIt’s time to do what’s best for you and, CHOOSE YOU. \n\nIt’s definitely worth speaking to a lawyer. \n\nHe’s wanted to cut ties with you multiple times now and it’s time to show him you’re not just waiting around for him to come back each time.",
            "Get an attorney, get that child support...\n\nUpdate: I read County not country my bad. Will be hard",
            "> and he wants to cut ties with me and our kids to care for that child.\n\nWOW. i cant even begin to imagine the betrayal you must feel. what a scumbag...\n\nplease take care of yourself none of this is your fault,it takes a special kind of man to turn their back on his own kids...\n\n> I requested devorce but he declined saying he was not ready. \n\nhe probably doesnt need to agree, contact a divorce lawyer. they will help you with this.\n\n>Is there any way I can secure payments to my kids, since with only my job I can barely make end meet for the basics.\n\nYES, he is legally required to participate in the sustenance of the kids. your lawyer will help you make a case and a court will set up monthly payments. \n\n\nbest of luck",
            "I'm confused by this, maybe it's just because I'm tired but he \"left\" the marriage to do his own thing, got a girlfriend, presumably had that fall apart and then just wandered back into the marriage without any sort of repercussions? \n\nThat is a genuine question as I'm struggling to understand how this all pieces together.",
            "Document everything (save his texts and any other communication re: him moving out and dating other people) and get a lawyer ASAP. Good luck 🩷",
            "Wow your husband is a whole asshole. Lawyer up, document all the past conversations of him skipping out on you, financial statements showing you were the primary caregiver while he was galavanting around.",
            "You don't need to request a divorce you can simply file for one, he has no say in. When he gets served the papers it won't matter if he is ready or not.",
            "> He wants to be with her, but refuses divorce.\n\nHe doesn’t need to agree",
            "He declined? He's not ready for a divorce? Sorry about his luck. He's going to cut ties with the children he already has?!? Divorce. Child support.  All the money you can get.  See a lawyer immediately.",
            "You can get a divorce easily with his infidelity. The child is just more solid evidence he cheated. That’s all you should need honestly",
            "If you’re in the US, you can divorce without his consent :)",
            "Absolutely fuck this guy. He’s not ready? Oh my god that encrages me. HE is not ‘ready’? SLAM him with those divorce papers fucking slam him. That’s how you secure payments to cover your basics.",
            "Where do you live? Every country has different laws on divorce and child support. I believe in many you can seek divorce if the other spouse is unfaithful, and you can seek child support payments from an ex-spouse (in some, you can seek child support if separated too(.",
            "And this is one reason I'm never getting married. I've got no energy for this kind of mess in case things go awry.",
            "Where are you? What country? EU divorce laws vary by member state. You need to lawyer up.",
            "Dude serve him divorce papers and take him to the cleaners before he disappears",
            "He doesn’t get to choose if he’s ready. He left you, and got another woman pregnant. Divorce him. He was right. You’re too good for him.",
            "Contact an attorney and serve him with divorce papers. He's trying to avoid supporting you and the kids. \n\nIt's time to stop thinking of him as the man you loved, and see him as the man trying to screw you and your kids over.",
            "He doesn’t get to choose “if” you get to divorce him. You will have living proof of infidelity. Get to an attorney asap. And file for child support. Get legal separation. If you cannot afford one check with your local social services or child support enforcement to find out where you can get free or income based legal aid. Do it now, he does not care about his family, only what he wants. You need to look out for you and your kids. Period",
            "So he wants to cut all ties with you but stay married? That's not how it works, sir.",
            "What the actual fuck? Never let your child go anywhere with this asshole again. File for divorce and fuck him. Gold lord woman pull yourself together. Don't let this man treat you this way! He foesnt get to decide for everyone he's a fucking child. Anyone who can just cut ties with their kids sucks.  Ew.",
            "Whaf the actual fuck? Fuck that guy. Why do men (and by men, i mean men in general because you will hardmy get women thinking this way!) think its ok to just come and go out of their family lives whenever they want because they're \"bored\" but if a woman does the same everyone comes out with their pitchforks to label her a bad mother🙄🙄.\n\nNo offence OP but you were a bit foolish to send those \"i love you\" texts even after he started to behave like an asshat, i wish you the best for you and your kids moving forward. Normally i hate the idea of talking negatively to your children about the other parent because you have issues with that person.\n\nHowever in instances like this i dont have any problem. If someones being a shit, they need to be called out on it and they need to be an example to your kids of how NOT to behave.",
            "He doesn't get to decide if he's ready for divorce. File asap, get child and spousal support on the go and tell him to fly a fucking kite.",
            "OP, you can divorce him even if he doesn't want to. \n\nBut also, there are several call center jobs that start off at 15-20 dollars an hour. There is no reason why you should be making barely minimum wage. You deserve a living wage.",
            "What a scumbag ! How was sex between you before he went to the parents?",
            "Divorce him and put him on child support.\n\nContact the woman if you can.",
            "Again, why do people not specify the country that this is happening in. It would help in giving advice. To me, this seems like it might be a cultural area thing where the men have more rights than women for some reason. Why would you put up with him leaving after he \"had enough of married life\" then take him back or want anything to do with him at all anymore?",
            "Lawyer up. \n\nHe can't force you to stay married. In the US, at least, there are laws where one party can file for divorce, and it can still move forward without the other party's participation.\n\nIt sounds like hubby is having a mental breakdown. \"I have a gf and want to abandon my family.\"... \"jk I lied. I only wanted a break.\" Now it's \"I have a girlfriend in another country who I got pregnant and I need to abandon my family\" again?\n\nSounds like dude has a reality issue or a truth issue... but it shouldn't be your kid's issue. Make sure you get primary placement... and child support. If he contributed in a more substantial way to the household, you can also go for spousal support.\n\nHis lack of participation in the divorce process won't stop it (if you live in the US, not sure about other countries), and, in fact, can be a detriment to his interests. \n\nEither way, don't jelly fish and work on things this time if he comes back with, \"surprise, I don't have a pregnant gf in another country. I just needed space again\". You'll only get disappointed again.",
            "Hell be very famous if he has a baby",
            "Yes, this is a disaster. He’s dishonest on the regular and is being manipulative and abusive.\nYou’re  wet bet is getting a lawyer and ending this before he can hurt you more and he has to pay child support",
            "This is substance abuse 101. Time to protect your kids. Lawyer up, girlfriend. Your children will look back at how you handle this, and they’ll be grateful to you for rising above his nonsense to have their backs.",
            "Why are you sending him I love you texts. That man is your ex. There probably is no girlfriend or baby. He’s lying and he’s probably doing it for attention and to distract you while your kids age out of legal childhood so that he doesn’t have responsibilities",
            "What a terrible human being he is. Don't ever go back to him .Talk to a lawyer and get a divorce and child support for you kids.",
            "You should have filed the after he walked out the first time. Do it now. It’s bad enough for you to be vying for your own husband’s attention against his girlfriend, but do you really want to set your kids up for that? “Gee, I hope dad will come see us for Christmas… Do you think he’ll go to the new kid instead?” Meanwhile, wastrel father is sitting back, waiting to see who makes him the best holiday offer. \n\nCut him out of your life now, get a good lawyer and go no contact. Him coming around whenever he feels like it to play “fun dad” to the kids is setting a terrible example to them. Good luck.\n\n\nETA: and get some therapy to work on your self-esteem. You deserve so much better than the mistreatment this turnip is pretending to himself is an acceptable to treat his life partner and mother of his children.",
            "He wants to have his cake and eat it too. He made this bed, let him lay in it.",
            "Your husband is scum.\n\n\nTake legal action for everything you can, you need that money, and he has not made up for the shit he has done, he hasn't learned anything, his actions have consequences and he has to deal with them\n\n\nYou have been through emotional and financial abuse, try to get compensation for that if possible, talk to a lawyer, get a divorce, get child support, every single thing possible, do not let him get off of this, or there's no doubt in my mind he'd do it to this girl and her kid too",
            "Take him to the cleaners. Alimony, his retirement, child support.",
            "Girl,  file for divorce and claim child support and before it's too late.  He's an asshole that is playing with everyone's lives",
            "You don't need his permission to get divorced. He doesn't have to want it.\n\nI think you've been far too accommodating and he's taken advantage of that. \n\nYou cared, he didn't. He's not trustworthy.",
            "You need to get receipts. Screenshot every text conversation, if ever calls you make sure to record it. Find proof about his little break where he lived like a bachelor and get a really good lawyer and serve him with divorce papers. If he wants to cut ties with your family, make it legal.",
            "To OP, I don't have any good advice, I just wanted to say I'm so sad to read this. What an agonising situation for you and your children and you as their mum supporting/navigating them through this. I'm so sorry.",
            "Wow he’s selfish to the end. If he’s gonna abandon y’all the absolute least he can do is make it legal so the government isn’t still considering y’all a 2 income household and you can get financial aid. I hope you drag him for filth in court. Take every penny: past, present, and future. Ruin his life so bad his baby mama don’t even want him anymore. That man is scum, and I hope his final day on earth is spent alone because everyone abandoned him just like he did y’all. I hope he goes out crying as his soul descends into hell. And I hope you and your children’s lives are 1000000x better without that waste of oxygen. Much love 💜",
            "There are so many assholes in this world and majority of them are men. PERIOD",
            "Wtf is taking a break from a marriage bro you can't just do that",
            "He is lying to you, you have great friends there, ask them for help that you can finally divorce this poor excuse of a man.",
            "What a pile of shit fuck him",
            "You need to get a backbone and make moves why are you still waiting on him this is pathetic",
            "How are you OP? I hope you got things sorted for you and the kids.",
            "Why does a grown ass 48yo man even request a fucking break from family life? This is not college anymore!"
        ]
    }
]