[
    {
        "post_id": "4r354y",
        "author": "TimBonr",
        "title": "(Update) I(29M) broke my wife(28F)'s heart please help me save my marriage.",
        "url": "https://www.reddit.com/r/relationships/comments/4r354y/update_i29m_broke_my_wife28fs_heart_please_help/",
        "score": 3143,
        "num_comments": 138,
        "created_utc": 1467570361.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/46vjbn/i29m_broke_my_wife28fs_heart_how_do_i_save_my/\n\nI had forgotten about this post and I am back to update so maybe seeing my stupidity could prevent someone else from making the same mistakes.\n I cringe when I read today what I wrote months ago and it seems ridiculous to me that I could have felt this way about another woman. I wrote that I would imagine my former coworker while lying in bed but in the end when my wife stopped acknowledging my existence waking up without seeing her face was just absolute torture. I really took all I had for granted until I almost lost it\n\nSo I took some of the advices and decided to court my wife again the hardest I could. Of course the first step was looking for another job, and it took me a month but I managed to find a similar position in another entreprise. I did what was suggested of taking over every chore and she stopped ignoring me but would simply stare at me with some kind of hostility and go on with her life. I tried flowers but she would leave them to die. My wife dominant love language is physical but I wouldn't dare try touching her so I went for telling her. I somehow realized it was really the content of what I wrote about the other woman which obviously when you are deep in a crush is amplified, that really hurt her. I tried engaging her in conversations so we could talk about what was happening to us but more importantly what I did to her but she remained closed off. And so I started writing her letters and would leave them under her pillow.\n\n At first I apologized for everything, for writing the post, for not putting an end to the crush faster, for making her feel like another woman could hold a higher place of importance to me and for not taking the initiative to change jobs earlier. For making her life hard by creating this situation which ended in her sleeping in the guest room of her own house, for making her cry and causing stress to her. \n\nThen I wrote her love letters telling her how much I loved her, how the crush couldn't compare to the deep love I have for her. I was chewed for saying I loved her because of our history in my last post but I was misunderstood. I meant that the love I have for her has gotten stronger with time. 5 years ago I loved her, but wouldn't have given her one of my organs if she needed for example while now I would without hesitation. Our history is what caused the attachement to grow stronger therefore no random crush could override that. I was awed in front of my crush and wrote sappy things about her but in the end I do not know this woman on a personal level while I have seen the worst of my wife and the love remains. \n\nI told her how beautiful she was and how impressed and proud I was with her development as a person since we have met, how grateful I was for her presence in my life and every single thing I was thankful for that she did and enhanced my life, how much I needed her and missed hearing her tell me how her day went, laugh at my bad jokes and basically just missed hearing the sound of her voice. This is a small sample but it must have taken a good 3 weeks of daily letters until she answered me back.\n\nShe answered with a letter of her own telling me how much I have hurt her with my crush, how I made her feel invisible next to that woman, how I never told her such loving words (until the letters) how much she hated me but also how she loved me and missed me too. Her letter allowed me to feel her vulnerability. After reading it I cried and went to see her, we locked eyes,she cried and we held each other for a long time. She started talking to me again then and softened. Honestly the possibility of the marriage ending just like that scared the both us. \n\nAs of today we are, to my surprise, mostly back to normal and actually I feel closer to her. We continue with the letters which have helped increasing our emotional intimacy. I make an effort to tell and show her my love. I am very grateful that she has given me a second chance and even more so that she has decided to put the crush behind us. We had maybe 2  fights since but she hasn't brought it up and doesn't punish me. It really wasn't the crush on itself but how I went about it and the lack of affection from my part in comparison.\n Maybe I am being optimistic here but I truly think we are going to get through this. We will be going to couple counselling after our vacation just to make sure things are really settled between us.\n\n\n\n\n\n   \n**tl;dr**: I managed to get my wife back after working on the way I conveyed love to her and we are doing alright.",
        "permalink": "/r/relationships/comments/4r354y/update_i29m_broke_my_wife28fs_heart_please_help/",
        "comments": [
            "Yeah buddy. Save the letters, and when you have a fight, or you forget how much you love her, you break that shit out and remind yourself.\n\n",
            "I would kill or die to see my late wife again for even one second.  Treasure her and don't fuck up again.",
            "Make her proud in the years to come - make it so she knows she made the right choice in staying.   Glad you had the opportunity and gumption to put it back together.  ",
            "Someone once told me that Love is a choice as much as it is an emotion ... sometimes even moreso.  This is a prime example of that being true.  I wish you both all the best.",
            "It's nice how hard you are trying. The thing you need to continue to work on is not stopping this once you have got her completely back. For me I would never get over what you said. I would have filled for divorce immediately. I'm glad things are working out for you though. ",
            "I'm glad things are working out now. However...\n\nSecond chances are extremely rare. Don't take this for granted as well. Be aware that every time this topic comes up (you fantasizing about another woman, divorce, etc..), it will open deep scars. Be sensitive to her feelings and do not in any way make her feel invalidated. Reassure her in all ways possible when the topic comes up, and never stop doing it. \n\nGood luck, OP.",
            "OP I really hope you read this advice.\n\nIf you communicate like this the best I have some excellent advice for you.  I do this with my wife.\n\n***Get a journal.***  Don't get a shitty one.  Go out and buy a *beautiful* one.\n\nEach of you write an entry a week *minimum*.  Write the date, then write what you did together that week, what you love about each other, about relationship goals and achieving them, what you want to do together in the future... Hell, wife and I even wrote out an vacation plan than synopsis of the best parts of the trip more than once.  Write to her or just write for her to read, just write.\n\nThe one rule is that you don't ever write anything negative.  That you *talk* about.\n\nYears later, when you're old and grey, or on the horrible day when one of you passes the other will have the journal, and can look back at how much you love each other, how much you grew, and how happy you made each other.\n\nWrite.",
            "Writing letters..  Something to take to my next relationship as a young adult",
            "Ouch. I read both your posts (the first one and this) and I am amazed at the quality of forgiveness that your wife has. It took a lot of work on your part, yes, that's natural... But the fact that she eventually talked to you and you guys are going to be going to counseling is beyond amazing to me. \n\nSomething severe like that would have led me to want to divorce my husband as well with little to no chance of completely forgiving him or reconciling. I commend you for the effort that you have put into earning her love back and into making her feel worthy... But I commend her even more for being forgiving and willing to move past it.\n\nI hope you realize how lucky you are to have next to you someone who loves you so much that she is willing to move past that kind of betrayal. \n\nI wish you both the best, and I'm glad that both of you are working towards fixing and bettering your relationship. ",
            "This post made me tear up, probably because I can just picture all of it happening and can completely understand what she must've gone through. Glad to see that it worked out for you two. Don't ever take each other for granted again, don't become complacent with romancing each other, and indeed, remain honest with each other and work on that connection/passion between you two. Best of luck going forward!",
            "Glad you got another chance. Hope things continue to work out.",
            "Buy you and your wife some nice heavyweight paper and envelope sets...that way your not writing love letters on notebook paper or blank paper from the copy machine.  \n\nAnd if you continue this letter writing...might I suggest refinishing an old roll top writing desk or maybe finding an antique one.  That way the two of you have a space for just your letter writing.\n\nMaybe do something to personalize it like carefully carving important dates into the desk itself so the desk kind of represents your journey together.\n\n\n\nBest of luck to ya dude",
            "Wow this post made me cry, how sad but beautiful:(",
            "Good job and good luck. Remember though, there are no third chances.",
            "That brought tears to my eyes. It will take work and time but you are on the right track.",
            "Man, you're a good man for making that much effort to win her back. And she's an even better woman for forgiving you. \n\nI would kill for that kind of love. Wishing the best for both of you! ",
            "Hope you can avoid fucking up again and keep her with you!",
            "Yikes, I hope you didn't tell her you wouldn't have given her one of your organs if she needed it when you first got married. Ouch. If your husband won't save your life, who can you count on?",
            "LOVE the letters under the pillow! She will keep them forever. I know I would. Good job OP. So awesome!",
            "I'm really glad you've put so much effort into recovering your relationship. It seems like it is slowly coming back to normal. Keep up the hard work ",
            "Wow I actually started tearing up reading this. I'm glad you guys have worked it out, and I encourage you to keep putting this much effort into your relationship. It sounds like she is matching your efforts. ",
            "This is the best thing I've ever read on this sub. I truly wish the best to you all, and I admire both of your strength and tenacity. I will echo the other advice posted before mine in the importance of continuing this courting and ensuring she feels your love. ",
            "Hi mate. Just saw this so went back and read the old post also. Top work on the effort and work you've put in to turn this around. It's nice to see some positive stories and looks like this one ended up pretty decent. Hope it keeps working out great for you and the misses ay.",
            "Your wife's a real Eliza Hamilton. Don't ever forget how lucky you are to have her.",
            "This is really touching. It's really nice to see you both working on things. I'm sure it hasn't been easy but I applaud your perseverance!",
            "I remember that first post! Well done OP, you are so lucky for getting your wife back after you almost lost her. Never forgot how much you love and appreciate her. You've received some great advice here in order to stay on the right track. ",
            "Very nice to hear this. Im happy to know things are going well. In fact, I will probably use letters for my future love. ",
            "oh thank god you got back together,do you still see the other woman?(like around in your life and stuff)i was **dis** close to crying",
            "This is what makes a real man I think. Well done mate, keep up the good work. ",
            "I'm glad this has turned around for you guys. Most importantly, I am glad that you have actually realized how badly this hurt her. In your last post, you kind of seemed like you were saying 'what's the big deal, it's not like I cheated on her?' So I am glad that you realize that there are other things that you do in a relationship that can be really painful for spouses as well. ",
            "This is really such a heartwarming tale. I'm very happy that things seem to have smoothed out for the most part and y'all are speaking to one another. It seems that you're both taking the right steps to a new and brighter future which makes me happy to read. \n\nCongratulations and you're right; it's easy to take the person you're with after a long time for granted but like most said, keeping those letters is a great idea. They'll reinforce how special she is and how special you are to her. \n\nGood Speed my friend.",
            "Good work, and I hope it all continued to improve. After changing jobs, taking over the chores was a really solid thing to do, it's penance and it's sacrifice and shows you weren't just trying to talk your way out of it. As Billy Bragg says \"No amount of poetry can mend a broken heart but you can put the Hoover round if you want to make a start.\"",
            "holy shit... congratulations on getting your wife back, i hope you two do amazing together",
            "Damn i got a little misty-eyed not gonna lie, hope it works out for u guys.",
            "Yayyyy! I'm happy for you, OP. ",
            "Am happy you were able to save your marriage. Once you have gotten her back completely don't stop writing. Those letters mate, and always tell her-She is the love of your life remind her as much as possible!. Good luck!.",
            "I am so happy for you buddy. Am going through similar stuff.\nI so wish it turns out your way.",
            "Good for you, I wish you both luck.",
            "I'm glad this worked out for you, you're a lucky man! Good work! ",
            "I can't be the only one who teared up. ",
            "Love love. Wishing you a better & fulfiling love forever",
            "My parents belong to this marriage group and one of the thing they teach in this is to \"dialogue\". It's where every night, and I mean every single night, my parents will write a letter to each other. They will tell each other the good and bad things that happened during the day and what they did good and what they want to work on. Honestly I think it's an amazing tool and allows for amazing communication. Keep up the good work man! I'm glad things have gotten better! ",
            "Glad y'all were able to reconcile.",
            "[deleted]",
            "You mention in the other post that it helped you understand crushes in LTR...care to share some insight or the website. I need it...going through somwthing similar.",
            "Hey man, congratulations on your wife forgiving you. Please cherish this experience as something that opens your eyes, and try your hardest to show your love to her to make your marriage stronger than ever. Its really up to you now to be the one to make her feel as loved as possible. Keep reminding yourself of how you almost lost her to motivate your love toward her for the rest of your life. A lot of men don't get a second chance like you did.",
            "Beautiful. You two will create a strong base from this and move forward stronger than ever. We are all cheering for you. ",
            "I almost had tears in my eyes reading through your original and updated post. Damn...you've been given a second chance, don't fuck it up!! ",
            "Sounds like her second love language is words of affirmation.  ",
            "This is going to be a very unpopular opinion, but I don't think you did anything wrong. This is not to say that your wife's feelings were ever invalid. If I found out my SO was infatuated with someone else I would be extremely hurt. But all you are guilty of is having natural feelings of attraction for someone else, and reaching out to a community you trust about those feelings. Your wife is entitled to her reaction, and I don't judge her for it, but you are also entitled to your feelings. And if those feelings include attraction to someone else then that's not something you have to feel guilty about. Acting on those feelings by pursuing a relationship with this other woman would have been a betrayal, but you didn't do that. You felt attraction beyond your control, and wrote about it. Why is that something you should feel guilty about in and of itself? The expectation this community put on you to leave your job and beat yourself up even more than your wife already was made me feel angry on your behalf. Are we all so insecure that we demand people who are feeling natural, healthy feelings to flagelate themselves?\n\nDon't get me wrong, I'm happy for you that you have saved your marriage, and I wish you and your wife the best. I just also wish this community would have taken a more compassionate angle with its advice. I would have told you to do everything it takes to save your marriage, because that is what you want, but you are married, not dead. In all likelihood you will feel attraction to another woman again (and your wife will feel attracted to other men). And when that happens just realize your brain is doing what it is designed for, and that's okay. Celebrate it as a sign of being alive! Then take that awakened energy and invest it back into your marriage.",
            "[deleted]",
            "I'm so glad that you took the advice of the good people here who are rather invested in other people's relationships. I went back to read your other post and found that while I didn't comment, upvoted the crap out of some that were particularly harsh but said with the best interest of your marriage in mind. You, however, did the work and I am so happy for you! ",
            "Your infatuation is based on a physical attraction. Talk to the woman, and you'll realize you have nothing in common. ",
            "[deleted]",
            "\"but in the end I do not know this woman on a personal level\"\n\nSo... you're telling me you married a woman without even getting to know her as a person? Why would you do that?"
        ]
    },
    {
        "post_id": "8tq98r",
        "author": "lenabeaner",
        "title": "My (36F) husband (36M) caught lying about seeing another girl; do I end this before he does?",
        "url": "https://www.reddit.com/r/relationships/comments/8tq98r/my_36f_husband_36m_caught_lying_about_seeing/",
        "score": 3145,
        "num_comments": 427,
        "created_utc": 1529931088.0,
        "selftext": "Update/More Fuel: We talked last night, and he told me he met this girl a few years ago in London while he was in a pub. They “got on”, exchanged numbers (he didn’t offer that, i had to ask). The million dollar rhetorical question: Did this happen while we were together? “Yes. Am I not allowed to get on with people?” I left the room.\n\nMy mother works for a law firm and has sent me the names of immigration lawyers. I’m processing everything I need to do before I make an emotional decision and potentially screw something up. The kindness-and humor- have been stabilizing and have genuinely kept my knees from shaking. Thank you, thank you, thank you.\n ——————————————————————————————————————————\nMy husband moved here from London to marry me in February of 2017. Honestly, it was a weird transition going from long distance to suddenly living together and married, but I figured that was something we’d navigate together.\n\n\nThe last few months, I noticed  a change in his Whatsapp activity- constantly online, last seen time stamps at really early hours in the morning...combined with zero sex, zero touching, barely any talking,I tortured myself over what could be going on.\n\nLong story short: I confronted him about it, even used the name of the girl he was talking to (my friend was holding my husband’s phone when a message from her showed up) and he denied denied denied.\n\nTonight, for absolutely no reason whatsoever, I decided to scroll through Venmo feed. Seriously I was just vegging out and scrolling.\nSaw my husband’s name, and transfer to the girl’s name with the title “Damsel in Distress.” \n \nConfronted him. Then he told me he’s having doubts about this, about us. I do understand how difficult it has been to move from London to a suburb, but my empathy stops there. The lies continued.\n\nTells me he booked a trip to Denver last Thursday to see “a mate”. I look up the girl on Facebook, what do you know, she lives in Denver. He then admits he was going to see her while he was there. The ease with which he lies is unnerving...\n\nSo here I am. He wants to work things out. I don’t.I don’t trust he won’t come back from Denver in July and tell me it’s over, and here I was, waiting for him and twiddling my thumbs. He’s controlling the situation, and my trust in him is gone. I want to tell him to either leave now, or plan to relocate to Denver bc he clearly has intentions.\n\nHow do I approach this? His “I want to try to fix this” rings hollow and leaves me open to be stomped on at his will.\n\nTL;DR: Husband has been talking to another girl, lied about it, cites difficulty adjusting here, has flights booked to go and see her, and only told me because I pushed.\n",
        "permalink": "/r/relationships/comments/8tq98r/my_36f_husband_36m_caught_lying_about_seeing/",
        "comments": [
            "He wants to fix things but is still going to Denver? \n\nHe’s already made his choice, I’m sorry. End it. ",
            "Go see a lawyer, the sooner the better. ",
            "\"We're done.\" That's how you handle it. Is he using you for a Visa?",
            "If he truly wanted to work things out he would’ve cancelled that trip to Denver immediately, and without any prompting from you. He doesn’t want to work things out: he wants you on standby in case it turns out that the grass isn’t greener on the other side. \n\nI’d tell him to go to Denver and never come back. ",
            "I'm sorry, you're second place.  He plans to fly to Denver to meet this girl, and if it does not work out with her, THEN he'll be kind enough to return to you - UNTIL the next girl comes along",
            "[deleted]",
            "[deleted]",
            "If he really wanted to fix things he wouldn’t go to Denver at all. He just wants you to still be here as a failsafe if things don’t work out during his visit. I’d be hesitant to give him another chance - this isn’t a one-night drunken mistake, it’s a deliberate attempt to build an affair behind your back. I don’t think I could recover from the loss of respect/trust. I would definitely collect evidence of infidelity and lawyer up. ",
            ">I don’t trust he won’t come back from Denver in July and tell me it’s over,\n\nHe might come back from Denver and tell you he wants to be with you and he's still shagged her every night he's gone. If he was putting you first, that trip would have been cancelled already.\n\nGet ahead of this. Take back the control.",
            "Brexit him out of your life. \n\nYou deserve love and happiness, and this isn't it. Sure, you invested some time in the guy, but you have at least 50 years of fun left in you. Don't waste it on tosspots like him. ",
            "It's over. Take steps and move on. I just don't get why go through all the trouble of getting married and come here to cheat and see someone else? Was it to get American residence? he thinks he's a stud because he has a British accent? why bother get married, just join hook up sites",
            "Just tell him that if he still wants to go to Denver, he should exchange his ticket for a one-way because there won't be anything for him to return for.\n\nThen lawyer up and make a counseling appointment for yourself.  If he cancels the trip, book some couples counseling.",
            "Well, “wanting to fix this” starts with cancelling his trip to Denver. That is bare minimum effort to repair his marriage from cheating. So I don’t think there’s much to consider until that happens and even then, he’s not giving you a lot to want to save here.\nIn your shoes, i would contact an attorney and get he ball rolling. If you guys share finances, I’d also want to know how much money has been sent, but if he’s sending from his own accounts only, I wouldn’t be as concerned about that. \nSorry, OP. Your husband sounds like a real jerk and I think you’ll be a lot better off when you are rid of him.",
            "Your story unfortunately speaks to one of the most devastating and real possibilities within any intimate, adult relationship, and that is the fact that in your husband's doubts or \"adjusting to life with you\" he showed you who he truly was. In doing so, he also revealed the manner in which he forms/sheds attachments to the opposite sex. As you mentioned, you acknowledged within yourself that going from long distance to all of sudden constantly having to be around someone and stimulate them within the confines of a marriage daily was an arduous transition. That's difficult for anyone, no matter how solid of a foundation the relationship was built upon prior to the move to be together. However, despite that, you never expressed or engaged in any lecherous behavior/acts that would even remotely jeopardize your relationship with him. Unfortunately, he did and there's the crux of the issue and I'm sure what's hurting you the most. You were committed to the commitment and all that entails, while he was merely committed to the idea of you (evident in the fact that once you two were married and genuinely together physically, he began to secretly, mentally and emotionally, long for something/someone else). I genuinely applaud you for understanding what empty, hollow verbiage \"I want to try and fix this\" is. It's not dissimilar to someone purposefully breaking a precious item in your home and then lackadaisically declaring with no contrition \"hey, I want to try and fix that if I can.\" It could have been avoided had you respected my home and maneuvered through it carefully with full awareness and precision. My point is, this could have been avoided because he moved to you to be with you, not vice-versa so he should've honestly and genuinely ruminated on precisely what that meant. It meant an extended adjustment period, it meant forgoing aspects of yourself in some degree in order to build and maintain an \"us,\" it meant reaching the culmination of our long-distance time together and finally enjoying the intimacy and closeness of being a unit finally after that not being an option for however long. Instead, he used the adjustment period as an excuse, when you didn't, to forgo his commitment to you, eviscerate the trust in the relationship with various lies and now as he stares head-on at the broken pieces of what used to be something meaningful that he helped build, but just singlehandedly shattered, and he essentially says \"hey, I want to try and fix that if I can.\" No, you deserve better and I feel you should move on.",
            "I think you should just cut your losses and get the hell out of Dodge. How lovely that he \"wants to work things out,\" when he's been deceptive from the get go. \n\nDon't put yourself through this - waiting to see who he picks because it sounds like he's only going to pick himself.",
            "Tell him you’re going to Denver with him and watch him squirm 😂\n\nHe’s already done. Id say it’s time to snoop to confirm and then just get out. ",
            "This relationship is over.  And maybe you can get it annulled instead of a divorce depending on the laws of your jurisdiction. There is nothing to fix here and nothing to salvage. I'm sorry and I know it hurts, but this man has no desire to be a true SO. And make sure he isn't trying for residency or bullshitting you just to retain a good job.",
            "i know. i just feel like an idiot.",
            "This is really a no-brainer.. kick his ass out.",
            "Get a lawyer first, handle all the mess, and then leave the ass. Working things out would just cause more problems in the future, hearing from you how manipulative he is. Get out while you can. You sound like a good person and deserve to be happy.",
            "I went through exactly your situation, six weeks before we were due to marry. He denied constantly that there was anyone else, and made me believe I was paranoid. He told the most ridiculous lies, and for me the lies were worse than the fact that he was sleeping with someone else. That he actually believed I was stupid enough to believe him. We split up, but after a few months got back together. It ultimately didn't work as my trust was gone and I could never respect him in the way I had before. Its my personal experience that it's extremely difficult to come back from this type of situation. However hard it was at the time I'm so glad it happened, I'm sure this would have happened at some point down the line and I'm now with a great man. If he's been capable of doing this once, he'll do it again. You can do better! ",
            "He wants the visa until he can find other sucker\n\nPleae dont fall for this sorry for the hard words end this he is using u ",
            "If he is serious about working things out he would have cancelled the trip already. If he hasn't done that yet or even suggested it, you should consider seeing a lawyer. If you want to give him a shot, tell him what your conditions are; giving you open access to phone/accounts, couples counseling, or cutting off contact with this girl. Actions speak louder than words, what are his actions telling you right now?",
            "Sounds like you’ve made up your mind about it. For me personally, the cheating is one thing but lying to my face over and over is the bigger sin. I can file an oops under unintentional but to me the lies mean it was done on purpose and that I can’t forgive. I guess the question is can you forgive and forget? And can you ever trust me him? If not, do you love him enough to wanna live with that insecurity. Just my two cents ",
            "I’m gonna go ahead and let you know, your husband paid a prostitute. \n\nWhatsApp is a very common app we use to communicate with our married clientele. And Damsel in Distress is a term we use with sugar daddies and high end regulars. ",
            "\" Did this happen while we were together? “Yes. Am I not allowed to get on with people?” \"\n\nGaslighting 101 tbh. I'm not one of those people who believes that men and women can't be friends, but you would have met this woman ages ago if they were truly friends, and you would be visiting her with him, and you would know her and be friends with her too. Don't let him make you feel like you are being jealous and unreasonable. You are not, and this whole thread is proof.",
            "Go to /r/survivinginfidelity. You should take charge of this situation and that begins with, he cancels this trip or you cancel your marriage.",
            "Find and save evidence that he cheated on you. Like, screenshot that venmo. Document, document, document. You want this to be fool-proof. Then talk to a lawyer and get a divorce, stat. I believe there is a certain marriage duration, after which immigrants can keep their legal residency. And you don't want that, do you? ",
            "He doesn’t want to fix anything. He wants to do as he pleases without consequence. \n\nGet to a lawyer. Lock down accounts. Tell them it is an emergency and you need their insight and help NOW; your spouse has left the state with every intention (and a confession) to cheat, and you want to know how to protect yourself financially. Talk to more than 1 lawyer. Then act. ",
            "I mean, this is pretty clear.  He is STILL going out to Denver.  If he honestly (I doubt it but maybe it's true) has a friend in Denver he wants to see, have them come out to you.  He should pay their ticket and handle it that way.  Or have you fly out with him (assuming that's possible on your end).\n\nHe is most likely (again, not 100% sure) going out to Denver to see if he can make something work with this other woman.  If he can, he is going to leave you.  If he can't, he may come back and look for something else.  Do you really want either of those situations?",
            "He actively worked towards cheating on you. Lied to your face, he has ZERO intentions on working out your marriage.\n\nActions will always speak louder than words, especially here.\n\nDrop him like it's hot OP.",
            "He lied about an affair multiple times.  That's the end.",
            "I’m so sorry you are going through this, but pls get documentation. If not, it’s your word against his. Screenshots, phone records. Whatever you can, record conversations. Then have your lawyer stipulate that HE must pay your court fees and alimony. With evidence in hand, you can come out ahead financially. It is a horrible thing that happened to you, but you can get through this and come out better on the other side. ",
            "I swear to god I almost went through the same thing. I was infatuated with a honey-tongued Englishman and made me feel good about myself for once. I cut it off after a month or so of talking. Do as everyone says OP, drop it like it's hot. ",
            "I think I speak for all of Denver when I say... we don't want him here. \n\nSaying that, you shouldn't stick with him either. He wants to see if this thing with the other girl will work out before he makes a decision about staying with you. It's bullshit. Even if he chose you, are you going to he happy knowing that you were always the back up? End it.",
            "End it. \n\nYou’re not a girl, you’re a grown woman. You can handle the truth and you deserve someone who doesn’t run circles around you.  ",
            "I am so sorry you're going through this OP. Given that there could be immigration/citizenship crap involved, I would recommend a lawyer just to make sure you're covered. He's not even trying to fix things, despite his words. Given how easily he lied and his lack of remorse (being bummed he got caught doesn't count) there's no fixing this. He'll do it again if you let him.",
            "Sounds like he's a serial long distance dater, and it doesn't sound like he has any intention of stopping. If it's not this Denver girl, it will be another girl, and you were just a link in that chain. Go see a lawyer. You'll find a guy who won't lie and cheat, who you can trust, it's just not this guy.",
            "OP, you need to secure your finances (cash money, credit, retirement accounts, stock, life insurance, etc.), and papers. Change all of your passwords. Document all of this behavior that you can. \n\nHe may come back from Denver, but I believe it will only be to string you along until he gets back with that girl or finds another. \n\nYou deserve better than this.  ",
            "> I don’t trust he won’t come back from Denver in July and tell me it’s over, and here I was, waiting for him and twiddling my thumbs.\n\nIf he is still going to Denver, then he doesn't want to work anything out.\n\nEven if he canceled his Denver trip, I would still leave him. He is lying constantly and he is admitting the minimum that he absolutely has to when you confront him with direct evidence.\n\nYou can do better than this.\n\n> How do I approach this?\n\nIf you're married (or if you have a shared lease), consult an attorney. End the relationship (including divorce or whatever your attorney advises). He won't stop lying to you.\n\nI would also consider an STI test just to be safe.",
            "Whatsapp and Kik are almost ALWAYS used by cheaters, and sex workers. I know this to be fact, I work in a high end strip club as a VIP hostess and MOST of the girls use these apps to hook customers, and Venmo to receive payment because it doesn't require the sender to see your legal name. My bet is she's a dancer or camgirl.",
            "Honey. I am 24 yr old female, and I know this is not salvageable. Usually you can work througj, but he still wants to go. He wants to have his cake and eat it to. He wants to find a way to marry you, and still have his \"damsel in distress\" on the side. What's more is he lied, even when you knew it was true, and in front of your friend no less.\n\nGurrrl, you can do so much better. Do not marry this man and have doubts for the rest of your life. \nDon't let your emotions cloud the reason and logic that tells you this is not okay. It's not, and let him know it's not, by leaving. I know it sounds harsh and cruel, but he wasn't concerned with sparing your feelings. Who knows what else he will keep from you if he is capable of this.",
            "> Am I not allowed to get on with people?\n\nLmao no he's not, because he's already taken. He knows he's in the wrong and so do you, OP.",
            "liars never stop lying.  \n",
            "Pay the money and get out while u can. No shade but he dont want u. Let him be someone elses problem. ",
            "Go and see a lawyer as soon as you can!!\nYou can’t continue with this game in where he wants you to just be there while he “has fun”.\nYou absolutely deserve better and don’t worry about him, what happens to him is HIS PROBLEM and it’s something that he looked for, he didn’t think about you when he booked his flight to see the other girl.\nDon’t look for the divorce, look for an annulment!!! It’s better for you and it will be a good lesson for him. ",
            "Yeah. Timeline suggests hes using you for a visa. Get a lawyer, get it annulled and kick him out of the country for abusing your kindness. ",
            "This asshole doesnt deserve you. NEVER be the backup to your own damn husband. Divorce his ass and move on.",
            "this definitely sounds like an episode of 90 day fiance. fuck this guy",
            "...Your husband is going on a vacation to hook up with his mistress. Yes, it's over. No, he doesn't want to \"fix things\" or he'd cancel the damn trip. Get a fucking divorce lawyer, stat. With luck, you may even be able to get his cheating ass deported.",
            "I'd pack up all of his stuff. And call him while in Denver and tell him not to come back. You are not some place holder or some safety net for him. He doesn't deserve you at all.  ",
            "\"Working this out\" means he's really stalling you. Kick his ass out. Throw his crap out and change the locks. Make sure he doesn't take your money. You got this!  ",
            "Get away from him immediately. I have been through a similar situation with an ex. When you confront him and he lies to you, he is gaslighting and emotionally abusing you. Do not let this happen to you- it is extremely damaging. A marriage is built on mutual love and respect; anyone who can hurt you in that way while also telling bold faced lies does not love you. Contact a lawyer, get rid of him immediately, and don't let him back into your life.",
            "I am so so sorry OP. This just sounds so terrible. I just went through a break up and went through something somewhat similar. I caught my boyfriend texting flirty messages with another girl and also saw, funnily enough, venmo transactions with another girl which showed them hanging out and doing shrooms together lol. This basically caused the end of our relationship.\n\nIt's fucking hard. I was making every excuse in the book for him but in the end. This guy is acting like an asshole. Do you really want to be married with someone who treats you this way? I know that when I found out about my boyfriend, I was angry, upset, and confused. And for some reason, I still wanted to be with him.\n\nYou just have to be strong and realize that you don't deserve this type of shit. Like come on. He's still planning on going to Denver? What a fucking inconsiderate guy.",
            "Sorry, but your marriage is over. Good news, it seems like you won't be missing much. ",
            "Set him on fire. No man, no problem 😊",
            "It would be best if you didn’t give him any of your time or respect from here on out. Don’t waste anything good of yours on him.",
            "Cut him out of your life.\n\nIt's very disturbing that he lies so easily. Doesn't that make you uncomfortable? You don't know what else he could have lied about.",
            "Kick him out and change the locks. Sorry for your loss 😢",
            "Ugh. Yes, end this marriage. Considering he did not even offer to cancel his trip to Denver, there is no coming back from all the distrust he's planted into this relationship. Sorry, OP. At this point, consult a lawyer and receive guidance on how to move forward.",
            "Hell no, I wouldn’t wait; I’d end it. What really is left to salvage, especially if he still plans to meet this girl? Him moving to a new place shouldn’t make him cheat; that’s a flimsy excuse. And, even though I HATE throwing this out there (because I get it often, but in this case), he was probably cheating during your LDR, too. This doesn’t just spring up because he changed location. If you’re lonely, you spend more time with your partner and work on finding FRIENDS, to build a social life with, you don’t find a girl in another location to cheat with. He was probably already talking to her BEFORE he moved to you and used you to get to America, so he could see her. I’d find a lawyer and dump him quick. If he wants to be with that girl, she and he can figure that stuff out because, while he may have started out loving you and wanting to be with you, he’s just using you, now. Get out. The sooner, the better. \n\nEDIT: And I read he hasn’t even booked a return flight to you after his trip to see her. He definitely was cheating during your LDR and used you to get here. Figure out what to do right now because you need to end this. Oh, and make sure you keep evidence of everything you found to prove the cheating. ",
            "A relationship without trust is like a car without gas - you can stay in it but it won't go anywhere ",
            "Contact a divorce lawyer and then tell him he better book a one way to Denver.",
            "Run!!!!! You deserve better. If you are done, GET OUT. ",
            "I'm surprised you haven't flown into a rage by now, you have more restraint than I. He would be kicked out with his belongings and the locks changed and that girl in Denver can deal with his lying ass. ",
            "He’s your husband. This isn’t a boyfriend. You are supposed to have a committed relationship. If he booked the flight, your marriage already is over, it seems. I’m sorry OP. \n\nChances are he might come back and want to fix things. After getting his thrill and fill (if you know what what I mean) and coming home. I doubt the future will be any different... seems like this cycle might continue if you let it. I wouldn’t. ",
            "You don’t want to work things out. \nSo don’t. \nIt does NOT get better from here. \n\nAbsolutely end it. ",
            "Tell him to take all his shit with him to Denver bc he is not welcome back in your place. And have him sign divorce papers before he leaves ",
            "I'm so sorry, but you can't mend something that doesn't exist in the first place. It doesn't sound to me like he was ever fully committed to his marriage. \n\nGood luck to you.",
            "Hit the Facebook, delete the gym, and get plenty of lawyers.",
            "Initiate divorce yourself, because if he initiates it he will do it in ways that benefit him not you.",
            "The good news is while he is gone in Denver you can take your time sorting out all the things you need to do for the separation and divorce and the lawyer consulting etc.",
            "Jesus, I’ve been seeing so many posts about cheaters today. Horrible. I hope you get things figured out as quickly and as cleanly as possible. \n\nSounds like you need to tell him something along the lines of “if you go to Denver, then this is over.” He would not go if he cared about how you felt. Him going is him not choosing you. ",
            "You can't fix this.  I was in nearly an identical situation.  Found out once he moved in that he had been seeing someone else the entire time and basically everything he had told me and everything our relationship was built on was a lie.  \n\nHe probably likes the whirlwind of long distance, but not the reality of a face to face relationship dynamic- so he keeps going for this relationship dynamic.  I'm so sorry :(  My opinion, is that you are best to just end it now with him.  Why keep dragging it out.  ",
            "It seems like he's already ended it by having a whole other relationship with somebody else and is just keeping you around for maybe convenience? Is he dependent on you for anything? I'm all for having friendships but the moment you lie about a friendship and hide a friendship it's no longer a friendship and it's a situationship. While he's seeing this girl in Denver I'd pack his things and change the locks. ",
            "Who cares if he wants to fix it. Why would you wait on a cheater? Of course you end it. You can't trust him and he's just garbage. Take him for all you can, and make him leave asap. DO NOT leave the home. He leaves. Bye boi.",
            "\"If you wanted to fix things, you wouldn't've gone to Denver after I'd already confronted you about the problem. We're over.\"",
            "This shouldn't even be a question. End it.",
            "Geez I feel for you OP. I have never heard of a husband buying a one way ticket to anywhere without their spouse.  That just sounds so hateful. It is over. He has left. You need to do what you need to do now. ",
            "I am so proud of you OP for being level-headed and deciding to stand up for yourself. You can do it, and I'll be thinking of you. Best wishes.",
            "He's keeping you as a backup plan in case Miss Denver doesn't work out. I'm so sorry, he's already ended it. You need to get out of there.",
            "If he is still going to his \"his mate\" it's already over in his mind he just wants to see how it goes with this chick before he decides. Simple words to tell him.. \"I'm done, get out.\"",
            "Yeah, no. \n\nHe doesn’t want to work things out.\n\nHe wants to have the security and stability of marriage and do what he pleases on the side. \n\nEnd it. End it now.\n\nYou were the fantasy, now it’s real. He wants to keep living with that taste of not really knowing someone.",
            "I swear to god. Is he a Ginger? Because I feel like I know him. ",
            "It doesn’t sound like this marriage will go well. Chances are he will likely do his a few times. If you’re not ok with that then you should take things in your own hands and cut it off. ",
            "Leave him right away no if ands or buts . He's not good for you",
            "If he wanted to work this out he would have cancelled the trip.",
            "don't take him back. tell him to go live with the other girl in Denver",
            "End it before he does. It'll still hurt but it'll hurt much, much less. ",
            "He has to want to fix it if he's going to fix it. He clearly doesn't want to, he wants his cake and to eat it too. Apparently his thing is meeting girls in far flung places so how about you let Denver girl deal with all that",
            "He may not end it. The question is do you want to l live with regret. ",
            "Please call a lawyer. This relationship is over. You need to salvage your dignity and get rid of him. Please 😅",
            "My ex was going to visit a \"friend\" while I was out of the country. I found out about it by going through his messages (he is a pathological liar, this was how I discovered his lies), because he didn't tell me. 4 days after I returned he proposed to me. 8 months later he broke up with me and later married a girl he met and flirted with while we were together. (A different girl than when I was out of the country). There was always another girl and he'd manipulate and convince me it was nothing until there was no way I couldn't see the truth. \n\nHe will do this to you and looks to be already doing it. Get out with your dignity in tact girl.",
            "I can't see any scenario for which you should try to work this out. Save yourself.",
            "I honestly can't believe you even have to ask.",
            "Lovely lady, I say this with compassion and so much empathy for what you’re going through:\n\nGET\n\nTHE\n\nFUCK\n\nOUT\n\nOF\n\nTHERE\n\n!!!!!!!!!!!!\n\nHe is going to waste your youth and suck you dry. He only wants to work it out because having a wife is convenient in general. This girl is his sexy-time outlet - he will never love or respect her. And he certainly isn’t loving or respecting you. He’s flying to Denver to fuck this girl. I know that is harsh, and I don’t want to be vicious, but it’s very obvious that he will do whatever he wants with or to whoever he wants, whenever he wants, as often as he wants. It’s all about him. It’s his TV show and right now you’re the nagging wife putting a damper on his quality time with the Internet Fantasy Girl, and all he’s going to do is pacify you so he can get away with as much as possible. This is a narcissist. He may even be a sociopath, based on how you describe the “ease with which he lies.” I can’t diagnose people online, but I can detect BS when I hear it. He is shoveling a truckload of shit onto your plate and will never stop as long as you’re with him.\n\nOh, maybe he will break it off with Damsel In Distress. When he’s bored of her or she starts wanting more from him, he may come running back to you. But he will look for someone else. And for all you know, there’s already been another Damsel, another Fantasy Girl he’s already burned through, either online or in person. Again, this is harsh but I hope you don’t wind up like friends I’ve had who have been completely devastated by men who sound just like your husband. \n\nTrust your gut. You know deep down that he’s already lied an extraordinary amount. The fact that he’s actually prepared to visit this woman under your nose means he has zero respect for you, your marriage, or your future as a couple. Don’t make it comfortable for him while he continues to disrespect everything you built together. Moving on will hurt like hell, and I hope you have a strong support system. But you deserve to be with someone who will love and honor you - not this clown.",
            "Put a fork in it. Your marriage is done. Take the initiative on this. And I'm really sorry it all turned out like this. ",
            "End it. There is nothing to gain from him but lies. You've become a backup.",
            ">do I end this before he does?\n\nHe already has ended it, you just now get to pick how the end of your marriage is handled.\n\nThis is assuming his behaviour is an instant \"it's over\" as it would be for me. Some people forgive cheating, I'm not one of them",
            "END IT!! He’s keeping his options open until he knows if Denver girl will take him. All of his belongings on the porch pronto!!",
            "Leave.\n\nI went through the exact same thing with my ex.\nDifference is I actually let him go. He did exactly what I guessed he would... \n\nDon't make the same mistake. \nYou deserve better.",
            "He only \"wants to fix this\" so he doesn't mess up his chances to stay here. Respect yourself, his ass can go back to the UK. ",
            "Lawyer up. Unfortunately there’s not a happy ending to this. As much as I’d hope a relationship doesn’t fail, it did when he chose to keep secrets and lie. I wish you good luck on whatever you choose!",
            "He does not respect you. That is very clear from an outsider's point of view. Do you want to be with someone who doesn't respect you? I believe you deserve better than what he is giving you. ",
            "That's not how you fix things. If he is serious about fixing things he will stay and stop all contact with her. ",
            "He wouldn't be going to Denver to see her if he wanted to work on things. End it.",
            "You don’t have to work this out because he wants to. You can, but you could also let him go, consider it over, and see if he does the work to earn you back. If he earns you back he earns you back. Time for him to put in the work. Not work convincing you to forgive. Work to prove he’s changed. ",
            "He doesn't want to fix this. He wants to keep you on the hook until he confirms that the new girl is a sure thing; that way he can use you as a fall-back if it doesn't work out. I say cut the string.",
            "Uh he is going to Denver for her. He’s not visiting anyone else unless it’s a cover for seeing her. Lol it’s not a coincidence that he happened to be going to the city where she lives. Yeah for sure end it, your marriage is over either way unfortunately. ",
            "I'd book a lawyer and have him served papers asap.",
            "If he were actually committed to working things out he would have cancelled the trip to Denver to show that he’s serious. Leave him.",
            "He probably just wanted an easy ticket to American citizenship tbh",
            "Guess he seen shaggys video - it wasn't me. \n\nAnyways, dump this scumbag. Find a real man. ",
            "If you also want to fix things, tell him that you feel like your trust has been broken, and then figure out what you would need him to do in order for you to trust him again, and ask him to do that. At that point, it's up to him to decide whether or not he's going to do what you need to regain your trust. ",
            "End it before he does. You don’t deserve the agony of waiting for him to end it after he’s had his fun. You’ve given him multiple chances and he still continues to lie to you. \n\nYou deserve so much more.",
            "I think you have to end it before it's late ",
            "Don’t try to fix things. Dump his cheating ass and never look back. ",
            "> for absolutely no reason whatsoever, I decided to scroll through Venmo feed.\n\nYeah right, you know why you looked at his Venmo feed.\n\nYou know what going on. You know what needs done. If you need internet strangers to convince you to do it, well, that's what we're here for. Leave him.",
            "You're already really in tune with what's happening here. Beat him to it, don't let him mug you off like that. He admitted only upon being caught, can you imagine not discovering any of this?\n\nYou're no back up OP. Hope you get out sooner rather than later.",
            "[removed]",
            "I'm very sorry, but you're just the backup plan at this point it seems.",
            "He's putting the effort into what matters to him. Going to see her. You are merely an options. I wouldn't tolerate it and seek divorce. ",
            "He's just keeping you on the hook in case she ends up being a shrew or something. \n\nIf I were you, I would tell him to go and not come back. He's already made his choice.",
            "So, you are going to encourage this crap? I would tell him if he leaves for Denver he is not welcome back home. Get a lawyer and file for divorce, I think he may have used you because the only benefit you are to him is a Visa. ",
            "Ending it on your terms will be better for your mental health: you’ll feel in control of what happens to you and take charge of your life. Your self-esteem won’t crumble. Having him end it will likely trip you into a depression / have negative consequences on your self-perception and trajectory.",
            "Sounds like he wants to see how this works out with the girl and if it doesn't you're his second choice. Leave him.",
            "AFTER re reading I want to comment that It takes I think 2 years of being together to get the visa complete he is using you for the visa GET OUT NOW. He's going to string you along until February ",
            "Maybe you can fix things, but you’ve indicated you don’t trust him. My experience is once the trust is broken the effort to rebuild it is such that your better off taking the luck of the draw on the next random romantic encounter you have. ",
            "Ugh he wants to buy some time to see if the Denver girl works any better.  \nHe doesn't care about you.  \n\nDon't be his launching pad,  move on.  \nAnd don't do long distance relationships- unless it's already established in real life with no distance,  and for a short term. ",
            "If theres lying going on about meets with opposite sex ? Chances are its already over. Your jus the last to know.",
            "For your own sake, the sooner you end it, the better. ",
            "He obviously married you for the green card. End this ASAP!",
            "Pack his things and tell him to never come back from Denver.  You are better and you deserve better. ",
            "End the relationship. He's going to cheat for sure. The answer is crystal clear.",
            "Did your marriage give him US citizenship? If you haven't been married long was this part of his plan? Your gut feeling is screaming.  We as redditors are here just to give our opinions and support but your gut is smartest of all based on your post. Feel free to let the side chick know that you know everything and that she is 50% responsible for wrecking a marriage that you will ultimately choose to stay in or attempt to repair. I'm not married but knowing all this I'm pretty sure I wouldn't even let my bf go to Denver at this point. Could you ever let him go if you all consulted a therapist and rebuilt trust?",
            "He has shown that he cannot be honest even after you know he is lying. You have no reason to ever trust him again. Tryst is the most important aspect of a relationship, end it. You have no trust therefore you have no relationship. ",
            "One other thing that's occurred to me - if it turns out he *is* using you, he might well be using her as well.  Maybe save her contact info and consider contacting her once you've lawyered up.  For all you know he's told her a complete fairy tale.  If that's the case, he may have alluded to 'having money coming soon' in some way that might warn you of a con.\n\nAlso, how sure are you that he's from London?",
            "Situation aside, you answered your own question. \"He wants to work things out. I don't.\"",
            "Yea it's more than over. I caught my ex cheating with someone who lived pretty much across the US, my ex said they want to work on us, but still needed to take the trip \"To help clear their mind\". That's bullshit. He's going to cheat. You need to end it. ",
            "Leave him. You deserve better than that",
            "He's not going to tell you it's over, he's going to pretend it's a normal occurrence because if you stay together it will be.  \n\n\nGet rid of him.  Sorry things played out this way, that's sad and disappointing.",
            "End it immediately. I know this may hurt to do so, but it seems blatant that he was using you. Sorry homegirl, but I’ve seen this type of thing quite a bit and the story is all too similar. ",
            "*He wants to work things out. I don’t.*\n\nHere's your answer. ",
            "Don't fix it, he doesn't care. His still going to Denver kick him out. Respect yourself.",
            "Have him pack all of his things, and enjoy the time in Denver.\n\nNot sure what the divorce rules are in the UK, but - you might want to get that worked out before he leaves - talk to a lawyer ASAP. It's hard enough getting divorced with state lines in the way. I can't imagine how that works across an ocean.",
            "You're trust in him is completely gone and you don't want to work this out. \n\nThat's it. Leave. Do not pass go, do not let yourself be manipulated and strung along any longer. The quicker you pull the band-aid, the quicker you can put this behind you. ",
            "He is canceling that flight if he wants to save your marriage. Tell him if he wants to work things out the flight gets canceled otherwise no dice ",
            "This guy is an idiot and a serial cheater.  Idealizing women, pathologically lying.  Seriously, he sent a random woman no ey and booked a plane ticket to see her? He is delusional and crazy.\n\nEnd it. He will 100% continue to do this with other people even if he ends it with her. Hes got serious issues. Trust me, I dated a 'sec addict' and it never stopped and caused me so much pain. These people are sick and beyond help.",
            "Do not let him, stop every thing now or it is not going be fun for the next year. I know from my own experience.",
            "You're the back up, sorry 😑",
            "I’m so sorry. I feel for you bc my boyfriend has done similar things in the past. Staying up late texting other random women, sends them money even though they live in another state, and only admits bc I’ve been pushing it. I really feel for you. While he has shown attempts to become better at this, I still have a legit worry that he will actually leave me when the time suits him. It sounds like he already made his choice so I’d let him sit with an ultimatum. Indecision is a decision. Keep us updated please! Stay strong! ",
            "Hes a jerk, u deserve soooo much better than this",
            "  \"my trust in him is gone. I want to tell him to either leave now, or plan to relocate to Denver...\"\n\nYou already have the answer. You can't have a relationship without trust. Don't sit on someone's back burner, he can cut ties and try to make it work, or he can walk. If he wants to stay and try to make it work, you are still going to have trust issues.\n\n\n\n",
            "Hi, Sorry to hear your new marriage isn’t going so well. \n\nBut it’s very good that you are considering leaving your husband because a lot of people just live with cheating and the lies. It’s never right for anyone. If no one is happy, why continue to live together? I would encourage you to go with your gut feeling and be steadfast with your decision. Be prepared for what may come next. Be it the emotions you’ll feel or the attempts he’ll try to get you back. \n\nI believe that many people who cheat will do it again. In your case, if you really believe that something can change and you see your husband wants to work on the relationship with you, you should try to fix the marriage. But only give it one chance because you don’t want to waste a lot time and emotions trying again and again if he continues to be dishonest. \n\nHonestly, from your story it doesn’t seem like your husband is honest with you or trying hard. He doesn’t seem to feel guilty about what he’s done. You married him when you couldn’t know everything about him, so don’t feel bad that you didn’t see some parts of his personality.  \n\nI hope you will take right decision for yourself.\n\nBest wishes,\n\nElisa",
            "This sounds like he has a personality disorder...something isn’t right. Whatever his issue is, you won’t be able to trust him any more. I would tell him now that you want a divorce. Maybe he will stay where he is. ",
            "How long did you date long distance for?",
            "I think you are right. Cheating after marriage is more serious than cheating in a relationship.\n\nIt doesn't look like he understands that.\n\nNot sure why everyone says lawyer up. Sigh. If you can resolve it by yourselves, don't lawyer up. Save the fees and the drama for crying out loud.",
            "Go to Denver with him. You know...  a getaway so you guys can work on things. :)",
            "TELL HIM YOUR GOING TO DENVER WITH HIM - TO KEEP HIM COMPANY (OF COURSE)!",
            "[deleted]",
            "Unless you and he are willing to have an open relationship? What’s good for the goose is also good for the gander.",
            "I think he's trying to spare your feelings.",
            "[removed]"
        ]
    },
    {
        "post_id": "amspap",
        "author": "Thisisathrowaway6865",
        "title": "Update to: my(28) girlfriend(29) moved in and quit her job",
        "url": "https://www.reddit.com/r/relationships/comments/amspap/update_to_my28_girlfriend29_moved_in_and_quit_her/",
        "score": 3135,
        "num_comments": 376,
        "created_utc": 1549220657.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/ai95d4/girlfriend29_moved_in_and_quit_her_job/ \n\nWell last time I was here my girlfriend had to quit her job. But Had said she would still be able to pay rent with her residual income. The time came and she was late. And only paid a third of what she needed to.\n\nWell I can’t move right now. Luckily my name is primary on the lease. And She is legally subletting with me. I went over a new lease agreement. And it has a weekly amount she has to pay me to catch up on rent and continue paying rent.\n\nIf she preaches this contract in accordance with my state law. She will be evicted. She refuses to talk to me. She refuses to leave her room. I told her that I don’t hate her and I still deeply care about her. But she has to pay or else she has to leave and I’ll find someone else to rent the second bedroom.\n\nThe place we rented have rooms for each of us so that we could have a private space as well as time with each other. If she’s not able to pay I’m planning on affecting her and finding someone else to rent.\n\nMy heart is broken. With the planning this for over a year. And I know she’s depressed. But she could go back to work tomorrow and make double what I do a day. With a career she’s in she could still go back to work even after having quit.\n\nI loved her so much. And we had built detailed and amazing plans together. But she’s just stopped moving.\n\nI know she’s depressed but I don’t know what to do for her. I’ve tried talking to her I’ve tried offering to help her. I’ve offered to take her to a doctor. I’ve told her that I’m there for her. But I can’t do this for her. It’s like she’s just given up.\n\nAnd I love her, but this is not the agreement that we had together. If she was willing to go see a doctor I would at least be able to work with her. And find a way to make this work. But I can’t support somebody who sick and refuses to go see help. It’s been a month and a half since she moved and it’s been a disaster.\n\nI feel like there should’ve been warning signs but there wasn’t. It’s like a flip switched and she’s turned into a different person. I’ve lost my girlfriend. It’s like she’s dead and there’s this shell standing in front of me.\n\nI don’t know what else to do... i’ve given her all I can afford to give emotionally and monetarily and unless she’s willing to help her self I’m done.\n\nTLDR: girlfriend did not pay the rent she promised she would. And has severe depression. I’ve tried to help her and I have no more to give.",
        "permalink": "/r/relationships/comments/amspap/update_to_my28_girlfriend29_moved_in_and_quit_her/",
        "comments": [
            "The most important thing to know is that **you are not her therapist.** You are not someone who is equipped to deal with whatever issues she has going on. You are her partner, and frankly unless she agrees to go get help (visit a doctor, find a good therapist) you will have to either end things or be dragged down financially and emotionally. The best you can do right now is encourage her to get help and be willing to just validate her feelings and make her feel loved, while making sure she can function. This could be anything from depression to bipolar, only a doctor can say for sure. Best of luck OP, this is an awful situation to be in.",
            "You can't help someone who doesn't want to help themselves. You've done the right thing setting clear boundaries. I'm sorry you are having to deal with this. Stay strong. ",
            "Lived with a depressed gf for 3 yrs. I had to lose the person because she did not want any help and did not pay rent. I couldnt help her",
            "Have you talked to her parents or friends about anything? This sounds horrible. I really hope she's able to get help soon. ",
            "It's good to be understanding of mental health issues, but they can't be used as an excuse not to take responsibility. Not only is it unfair on you, but holding someone accountable for their actions gives them reason to seek help. If you enable someone with a mental health issues by not holding them responsible, they can be less motivated to seek help. Situations like these are heart-breaking, but you're doing what's best. Stay strong!",
            "[deleted]",
            "The damage may be too far done at this point, but, have you two explored the option of moving her into your room and finding another roommate for her old room? Does her mental health change how you feel about the relationship or is it just the financial obligations? ",
            "You sound like you feel guilty. You shouldn't. She's got to do this for herself. You cannot be in charge of other people's happiness. I'm sorry this happened. I hope she gets the help she needs and you find someone to rent. ",
            "Try reaching out to her family. Ask her more about the job quitting-did she really quit or was she fired? Sounds pretty bad if she had a good paying job, quit and is now acting uncharacteristic.  The same way you have laid out a plan to evict her, maybe you could lay out a plan for her to get help if she wants to be in a relationship with you and for you guys to live together.",
            "What if you both shared a room together and rent out the other room to another person? That way you can have 3 incomes. ",
            "This is fairly serious, OP. I would strongly caution her to consider therapy. Even so, you'll have to go through the eviction process. I'm very sorry and I hope you feel better or move forward though this tough time. It seems to me, and perhaps this is just my opinion, it's time to let her go.",
            "The majority of this thread just makes me sad. I really hope she is eventually able to accept the help she needs. ",
            "If she's medically depressed, find and call her parents. ",
            "i lost my friend because of her depression..granted, we both suffer from it..but it got to the point where she wouldn't have conversations with me, just send snapchats of her forehead  of her in the dark, or telling me how crap she felt. i gave her advice every time and she never took it let alone considered it. i havent texted her in weeks now, and she hasnt noticed. we havent hung out in over a year either...sometimes, things are done and its just time.",
            "Did she actually get fired? Or did something really horrible happen at work (like REALLY horrible, like sexual assault or something causing her to quit because the person who did it was facing no repercussions or was her boss?)\n\nIt’s hard dude. I know you’ve talked to her but try, really seriously, to explain to her all of this and how much you love her. Even show her this post maybe. Explain you’re not attacking her you just cannot afford to live, and you want to live life with her like you planned. You wanna see her happy and okay, and ask what she thinks will help (hopefully she agrees therapist). \n",
            "Idk man, I had a girlfriend do almost this exact same thing to me and I ended up screwed. Being a 22 yo in his last year of college with an eviction was hard. You shouldn’t feel guilty, you both made the agreement together.",
            "Is this the first month or so that she has been late on rent? Or the first major breakdown? Maybe she just needed a break and when she gets a job she can save a lot in case something happens. Depression is really hard. I usually cope well but I hit a low and had to be 2 weeks late on rent and I was a little bad at chores. IMO it would be immature if my boyfriend didn’t understand a one time slack, especially because I work so hard the rest of the time to deal with my anxiety and depression. Give her a small chance and see if she can go back to coping better again. ",
            "You learned a valuable lesson here. When in roommate situations we can both sign a lease if something happens we can find a new roommate. When dating someone you should never get a place that you can afford with just one income, because sometimes shit happens. I’ve been there. I don’t know her obviously so it could be more than just her not wanting to help her self as I saw another commenter mention. But right now you are now the only provider. Always have a plan b! ",
            "I just (as in 3 days ago but the final conversation was yesterday) broke up with my depressed BF. He switched meds a few months ago and has been declining since. I have outright said \"I don't think your meds are right for you. I've noticed you losing interest in hobbies, isolating and turning down social activities, you've stopped taking care of yourself and you have some reason why everything \"can't\" be done. That's depression and you need to go back to your doctor. I'll go with you if it'll help.\"\n\nCue non-committal noises. \n\nSome examples: he's been getting chronic, debilitating headaches. He's always had headaches since I've known him bit they're getting worse and more frequent. By a lot. He says they're tension headaches and chiropractic has helped in the past? Has he gone? OF COURSE NOT! He \"can't\" because his old chiro retired, he \"can't\" because he doesn't know which ones take his insurance, he \"can't\" because his work schedule is up in the air (it is to a point but he has EVERY MONDAY OFF). Instead, he just lets the headaches eat his life, calls in sick to work, cancels plans and complains. At this point it IS just complaining because he won't DO anything about them. \n\nSame with his teeth. He has broken teeth, cavities, a missing crown. I can't even kiss him anymore because I take immunosuppressants and I can't contact the infection he has. He \"found\" a dentist 2 months ago...... and never called. \n\nHe got new glases late last year and the RX doesn't suit him. He \"can't\" go back and have them remade, he'll just get new ones in January because he gets a free pair every year. It's now February. He's made no motions to do that either.\n\nI can't be his nurse and his mother. I loved him, I still DO love him, but I can't take care of him and I can't sit idly by while his health continues to decline. Ot can't be my responsibility anymore.",
            "[deleted]",
            "Are you sure she quit her job on purpose?  It sounds like, if she were truly a decent person, she might have fucked up somehow and gotten laid off, and is too ashamed to talk to anyone about it.\n\nSometimes lies spin out of control like that.  I would definitely ask her friends and family about this behaviour, see if she’s ever acted like this before or if they know anything about her situation.\n\nBest of luck OP, ;_; it sucks to see someone you love being too stubborn to help.  I hope it’s not a case of bad intentions at the very least!",
            "You are in the right here, if you’ve expressed your concerns and she cannot get the help she needs there’s no reason to stay or help someone that doesn’t want the help. Maybe this whole situation can be a wake up call for her. You don’t ever have to feel bad about this situation.",
            "Why can't she move to your room, and rent out the second room. There u can help here get all the help she needs. It sound more like u want her   out of ur life",
            "[removed]",
            "There arent always warning signs. I have a family member who got married to a woman and the day after they got married she just stopped. She stopped going to work, stopped leaving the house. Everything. They got divorced pretty quickly. He had no idea. It was like their whole relationship up to that point was her pretending. ",
            "She really needs help. My biggest regret regarding my depression was not getting help sooner. She sounds very avoidant, maybe she feels too overwhelmed and doesn't know where to start, or is skeptical as to whether or not things will help. Medication and therapy have made things a lot better, i'm still very up and down, but much more functional than I used to be. A GP can subscribe an antidepressant, and just making an appointment with a psychologist, so you can actually talk to someone about literally anything is actually a big mood booster. I always left feeling more confident and actually happy. \n\nMaybe you need to make an appointment for both for her, and then just drive her. If she refuses to go with you...well, that's all you can do. ",
            "Sadly, sometimes the best thing you can do for someone is let them hit rock bottom and figure their own way back up. If they just give up for good, then that's their choice. As hard as this is, you're doing the right thing by not enabling her and paying for everything.\n\nIf you can, alert her family that she's in medical crisis with her depression. But beyond that, you're doing the right thing. Look after yourself here, you won't save either of you if you let her drag you under. And I'm saying that as someone with clinical Depression.  I'm really sorry you're going through this.",
            "I was in an eerily similar situation a few years back.  Girlfriend moved to my state after having an LDR for several months.  I was 21 at the time, she was 18.\n\nI had a crappy entry level job at a call center and she snagged a job at the same place.  Things were pretty good for a while until my car died/was replaced and we moved into an apartment for just the two of us.  With 2 incomes it was relatively easy to make all the bills.  Then she quit because of depression, anxiety, and a lack of willingness to get help.\n\nMoney was tight, but she always wanted nice things like sushi, and stupid 21/22 y/o me was too stupid to say no most of the time.  When I DID say no with the reason of money, she would berate me saying \"MONEY ISN'T EVERYTHING\".  From that point on I didn't talk about money.  After several months in the apartment, I asked my dad for help and we moved in with him and I paid to break the lease.  In those months and the ones that followed, I ended up in severe credit card debt and took out perpetual payday loans (back before the APR was capped in NV, so it was like 800%).  Credit cards defaulted, went to collections, life was shit.\n\nI dealt with her for two more years.  My mistake there.  Eventually I realized how toxic she really was, and figured out how to convince her that it was her idea to leave (she didn't want to leave me in the debt she helped cause, but when she finally got and quit 2 other jobs she never helped fix it).  I let her go.\n\nAll I can say is that love is blind and stupid.  We all make mistakes but the best thing you can do is try to assess the situation early and cut out toxicity.\n\nBest of luck, kind redditor.",
            "I'm sorry, but a lot of people on here seem to not get severe depression at all. Yes, this situation might be problematic, but as someone else already stated: never move into a flat or house you can't afford on your own.\nYes, she probably should see a doctor. Rather: a psychiatrist. But she might have to heal on her own. Maybe she had bad psychiatrists in the past. And all this happening sure won't help. Might worsen it enough for her to commit suicide.",
            "Have you given her enough time? It sounds like it's only been a week or two. If you are able to cover the rent for this month why don't you do that and let her relax a bit without any threats to kick her out.",
            "Have you ever asked if what's bothering her? I sense that she needs professional help. ",
            "What the shit. Your girlfriend moves in, but rents a separate room? That’s weird.",
            "[removed]",
            "I dated someone with depression and I know how you feel. It was like the girl who I loved so much died and yet she was still there but just a shell of her former self.. she turned so cold and emotionless. It hurts man.. take care of yourself ",
            "What is your plan for evicting her? Lock her out? Remove her items? What are the legal steps you will take against the girlfriend that you claim to love? Make sure you know how to handle this legally. Eviction is a long process that must be handled properly.",
            "Honestly as someone who has crippling  anxiety I  commend your efforts! You did the right thing by establishing boundaries  and being upfront about what you will and won't accept. I would definitely  keep encouraging her to go to the doctor! Maybe offer to go with her cus its scary. You're doing a good job and I hope it all works out! ",
            "Make an ultimatum. Go see a doctor, get a job, or be evicted. Make it explicitly clear mooching off you any longer is not an option. It's the best possible thing you can do for her, even though it may be hard. \n\nIf you don't nip this in the bud right now, she will become complacent and stop taking care of herself completely. \n\nI suffer from off-and-on bouts of depression and and anxiety. I still have to pay bills and work. It's not an excuse to not do anything.",
            "It's sad because she is leaning entirely on you, and I was raised to never, never do that. Things fall through and people can flake. You have to make sure you're taking care of yourself. \n\nAnd she's not taking care of herself. It looks like she isn't paying rent. It looks like she is avoiding responsibility, but at the heart of it, she is truly not caring about herself. If she did, she wouldnt put herself in such a compromising position. I don't think she realizes that. \n\nYou can't let her drag you down the same path. You see that you can't allow everything to fall apart. Do what minimizes the stress. Rent the room if you need to. Get out of the lease if you can. Do whatever it takes to take care of yourself, only then are you able to care for others.  ",
            "True love right there",
            "Like people said in the thread you made before OP, maybe this is a sign that you \n\n1. can’t afford the house\n\n2. Should put an end to the relationship.\n\nSorry if it sounds harsh but you need to be with someone who pulls their weight (and doesn’t pull your emotional state down).\n\nBest of Luck my friend, things will get better! ",
            "I feel for you OP but I’m confused as to how you weren’t aware as to how your SO of a year was clinically depressed? I read your original post and you even said right in it “I’m not sure if she’s depressed, bi polar or lazy”. I understand some people can hide their depression well but after a year of spending (assumably) a lot of time together I would have though you’d pick up on her depression? Obviously we’re all looking at this from the outside so it’s not something I’m going to pretend to understand, and I mean no offensive by this comment. Just my thoughts. ",
            ">I feel like there should’ve been warning signs but there wasn’t. It’s like a flip switched\n\nThis is the part that makes me question if the issue is purely depression. It's like she was waiting until she got in this place with you and then felt like she could quit? I realize you weren't living together before, so maybe she could have hid just how severe her depression in, but the timing of quitting the job AND not telling you, feels off. I am a person who quit a job that worsened my depression. I was put on medical leave because I could not work. I had SEVERAL coversations about it with my SO before I took any time off.",
            "I’m sorry for you but this same thing happened to me with my last boyfriend and I ended up supporting a drug addict for 3 years. Get her ass out of there.",
            "Bunch of moron redditors here think because they were sad once or had teenage angst they understand severe crippling mental illnesses. Y'know, cuz if you experience a milder form of something, it's exactly like that for everyone else. ",
            "This is emotional blackmail. It's time to contact her family and make plans for her removal. You harm her by indulging her. Remember that.",
            "Good for you for setting reasonable boundaries. This may be harsh but it sounds to me like she didn't want to work upon moving in in the first place, and had this all planned. When you set boundaries and expectations, she faked depression to get your sympathy. \n\nI'm playing devils advocate, im not actually an evil person.",
            "i think you have to give her 30 days notice to evict her. it varies from jurisdiction to jurisdiction. you may want to post on /r/legaladvice. ",
            "It's sad that something like rent can ruin what you're saying you you loved about her. She needs help and that's what a relationship is. Sometimes you have to give more than the other person because they need you. At some time in your life you might need her to do that for you. And I guess your decision to leave her should ride on the question of if she would do it for you in your time of need. No one is perfect all the time and you're supposed to be her person.",
            "Is there any chance she was sexually assaulted? ",
            "Also, watch out because I’ve seen it happen too many times in where the girl will get pregnant on “accident” just to have the guy do what she wants. ",
            "I understand you are in a hard place but you also seem overly transactional. How do you go from in love to eviction? \n\nHow come she can't noin you in your room when you get a roommate? Why is the option eviction?",
            "She agreed to the conditions but then thought she could just fuck it off and you'd cover her cause, well, you're her dude! Why wouldn't you? But unfortunately for her, you didn't go for it. She was expecting a free ride and it didn't go her way and now she's using her depression as an excuse. You did the right thing, she just wanted to use you and failed. Cut your losses and get out before it gets worse. And it will get worse. Good luck.",
            "[deleted]",
            "You're doing the right thing. Stay strong.",
            "The hardest part about dealing with someone you love who has depression is the endless pit of energy you feel like you put into them and it's NEVER enough.\n\nThey never seem to make an attempt to help. \n\nOnce in a while they may ACT like they are trying, but it's half-hearted and lasts a very short amount of time. \n\nYou are doing all you can, but this is bigger than you. \n\nYou are not a professional therapist. You are not her husband, her parents or family members. You are only a boyfriend. \n\nThe only other thing I could think of would be to call her parents or a close family member (like a sister?) to see what they say. Or even a super close friend of hers.\n\nOther than that, keep up the pressure to make her pay her way or she gets tossed. That's only fair to you.\n\nGood luck OP.",
            "Sounds like such a romance!",
            "When she asks for a loan to pay rent give her a house paid off",
            "Feel free to do another update, ok? I would like to see a happy resolution, but I you don't owe us that. Any update would be welcome and you'll both be in my thoughts.",
            "Unsure how long you’ve known her but it doesn’t seem like it was long enough.   Not trying to kick you when you’re down, you mentioned you  ant believe you didn’t see signs.   Knowing someone for a decent gives opportunity to see ups and downs.   There are surprises, people change, for the most part we probably skipped things that were there but we forge ahead gambling.   \n\nHer friend said she’s always been up and down, I think it’s rather convenient as soon as you move in together she is too depressed to work, if I had to get I’d go for she’d be able to work if she didn’t think you’d pick up her slack.    ",
            "You can’t force someone into being responsible for their own mental health. And it shouldn’t be your cross. That’s just enabling her disfunction and unhappiness. \n\nMy bf has bipolar and depression. He has never tried to hide it from me. He has bad days. He has good days. And he has normal days, even with medication. \n\nBut he is always open with me about what he is going through. When he’s going through a rough patch, he makes an appointment to retool his meds. We talk openly about how to reduce his stress. \n\nI’m sorry for the loss of your relationship. That shit is never easy. Know you are doing the right thing for her and for you. \n\nUnless there is a history of abuse, try to contact her parents or someone close to her that can take her in and get her well again. \n\nBest of luck, OP. \n",
            "This is one of those trials that will make or break your relationship. Both of your actions and attitudes point towards \"break\", imo. It didn't read like a true partnership. Unless you all find a compromise-sacrifice situation you can both live with, there's no saving the relationship. She also has to be willing to contribute. That is her end of the sacrifice. You cant be sacrificing everything for her while shes unwilling to.sacrifice anything. This is exactly why you should always live with someone before you marry them. My husband currently owes me money for rent, I've been covering for him for months while he was trying to find a good job. I've made many sacrifices for him and for us, and he eased my burdens in ways he was able until he finally got a good job. Partnership means picking up the slack when your partner needs it. She also has to be willing to do that. It can't all be on you. Is she applying for jobs? Is she seeing a doctor? Those are the efforts she needs to be focusing on. I just wonder if you even love her as much as you say, or if you're hung up on the idea of love. You love all the dreams you have together, but do you love the reality of what you all already have? Are your future dreams as important as your money now? Does she contribute anything at all? Housework, cooking, does she, at the very least, make you laugh? You can't be her financial support and coping mechanism for her mental health problems. \n    \nLike another person said, if you can't afford it on one person's income, you can't afford it. I'd try to find a way out of that lease. What if you kick her out and can't find another roommate for a few months? What if your next roommate is just as bad or worse? You have a lot to consider in this situation and there's no right or wrong. You just need to figure out which path will lead you to happiness. ",
            "Good job OP. It is tough, but you’re doing the best thing for both of you.",
            "For sure. Maybe family can offer financial support and/or some more of her history to help them get over this hump.",
            "She’s cucking you, even if she’s depressed that is no way to treat someone, sorry. A man would\nget reprimanded for that type of action towards his girlfriend, so why is it any different now ? ",
            "kick her out, you’re letting her wallow and that’s the worst thing for the depression, she’s using depression as an excuse to not go to work ? then why is she not getting help from a real therapist if she’s so depressed, she’s just comfortable sitting there without your input, must even be tired of you, You’re getting fucked if you let her stay there without paying, you’ll lose all gained respect. Make the move wisely but be very real with her and don’t play games with that depression excuse, many people have had the worst of depression but i know they would never have just ignored everyone and just expected the people who depended on them to deal with it. ",
            "Does she have friends or family who can take her in? If so kick her out and that maybe the thing which wakes her up ",
            "Be thankful your only legal link to this person is your lease and not a marriage or something.\n\nSounds like, while it'll be an obviously difficult decision, separation might be best for your health.",
            "Please don't give up on your girlfriend. She's sick. She has a mental disorder, you have to understand that. Does she have a sister,  brother, or parent who can take her in? \n\nDon't get angry with her, and don't give up on her, please.  I'm hoping you still have the decency and humanity  to not throw her into the street. Do you think you'll ever be able to forgive yourself if you do?\n\nI hope you and her are able to come up with a good plan for her. I wish you all the best.",
            "Congrats. You’re her sugar daddy now.",
            "Talk to a lawyer. Even if you aren't married she could force you to pay her alimony because she is \"disabled\" if you let things go too long.",
            "You have to be very straight forward with her, don’t sugar coated, tell her how it is, maybe you are just going around the edges, be clear, say like is not your fault you feel this way , but is not my fault either is just growing up, and tell her she needs to talk to a doctor /therapist because is taking a toll in your life also.",
            "You have different rooms? ",
            ">And it has a weekly amount she has to pay me to catch up on rent and continue paying rent.\n\nGiven that she only paid 1/3 of the monthly rent, you and she know she's unlikely to be able to keep up a payment plan.   Give her a firm date by which she has to be caught up or leave  -- 4 weeks would be about 30 days.   \n\nIf I were in your shoes, I start advertising for a new roommate to move in the 15 of March and let her know that her stuff has to be boxed up by then.",
            "Don't burn out trying to keep someone else alight. \nHorrible situation. I really really feel for you. ",
            "How long has it been going on?\n \nYou are not obligated to be a doormat for her, but people who are in love someone tend not to make decisions within a month to kick out a partner due to depression. I waited for years to kick out my ex husband and I didn't even love him. Not saying anyone should wait years and I may be getting the wrong impression, but it seems like she has no real status in your life above a room mate or a business partner you made a deal with. \n\nNot saying her behaviour is okay, it's not, but I'd be feeling SO ridiculously alone if my partner was considering kicking me to the curb while I was having a breakdown. \n\nCan she not move into your room if money is such an issue? Nice to have your own space, my boyfriend and I have separate rooms too. We watch TV/netflix, cuddle for hours, have sex and then I sneak off to my bed to get better sleep for my own sanity. Plus I can keep watching TV and not keep him awake, and just have my own place to retreat and have alone time. But my bf owns the house. I pay him some rent but he doesn't need the money. I have anxiety/depression/exhaustion/chronic fatigue etc and I worry I won't be able to keep going forever. He 100% knew about it all before we moved in together. He says I don't have to work forever and he's willing to support me at some stage but I obviously don't want to cause that kind of stress in his life. It's nice to know that we could fall on each other if we really lost it though. That's life partnership though, compared to dating. \n\nSo I understand your situation from both sides. I had a very lazy abusive mooching ex husband who claimed to have depression (he was violent too) and now I'm depressed, anxious, exhausted and worry I'll break down and not be able to take care of all my responsibilities. \n\nI think maybe she needs some time. I wouldn't feel comfortable to talk to you about it if I sensed you were going to kick me out and get another boarder to replace me. I wouldn't feel like I was even in a relationship with you. I know she has messed up and broken plans/promises, but maybe she's dealing with sonething serious that you don't know about. \n\nIt's up to you how you want to live your life and up to you what you will put up with in a relationship and for how long. You just need to make sure you're honest too, make sure any partner you have knows that if they fail to meet financial arrangements with you or quit their job then it's over in X amount of time, that you expect 50/50 type of arrangements and you cannot/will not ever financially support a partner at all. Because it's actually not a bizarre thing in some relationships, so you have to be clear. Also she should of been very up front if this was a pre existing issue of hers. \n\nUltimately when you are planning to kick someone out, then the love is probably not there. It's very hard to love someone who's being abrasive and not contributing. Maybe if you had been together longer then you'd feel differently about the situation but it's only been around a year. This is why I waited 3 years to move in with my boyfriend, I just wasn't sure how I would go or how everything would be... Didn't trust myself, relationships or life in general, so I had to take it slowly. \n\nI may have missed some details but you said you wanted this nice new place, had you lived together somewhere before? If not, best you move into a cheap first place together so that finances aren't such an issue. You said you guys planned all this for over a year, and said you've been together just over a year. Moving in together isn't usually planned out in like the first week of a relationship.\n\nAlso \"seek professional help\" is always such a generic suggestion. I've suffered quite severe mental health issues for most of my life and I have tried countless psychologists, psychiatrists, GPs, medications, natural treatments, exercise, psychiatric inpatient treatment, etc etc. It annoys me if people claim I \"refuse\" to get help. I have done everything in the book to get help and it didn't help. Seeing a professional is not going to automatically fix or even help everyone. I tried again recently and the expensive psychologist said she doesn't think she can help me and thinks I'd be wasting my money to rebook. It's not the first time. It's not because I'm defiant in any way, I'm very receptive and try anything. It's when I keep returning and saying I don't feel any different, they eventually turn me away. \n\nGood luck, hope you both find what you need. ",
            "There is a difference between not being able to afford it on your own and not wanting to allocate that much of your income to rent (probably a decreasing the quality of living for both of you).\n\nI had a similar situation. The lease was in her name, and she was working two jobs in order for us to qualify for the lease. She had some physical and mental health issues, called off and and eventually was unemployed. I had to choose whether to move back to my parents house, save money, pay off my student loans. Or stay, struggle and support her.\n\nI stayed. Honestly looking back it was a terribly made and irrational decision, but I decided I was okay with a financial loss to stay with her. I didn't think I would be able to look my friends in the eye again if I told them I abandoned her.\n\nShe bounced back and forth a few more times. I tried to pay off the credit cards and save a bit when she was working, tightened the belt when she wasn't. Eventually my income was enough to buy a house. We got married. She's still the love of my life, and last year she gave up on working and focused on being a home maker instead. Money is still tight, but it's getting better every year, and I'm really loving not having to do dishes, laundry, shopping, etc. I never envisioned being a sole breadwinner, but here I am and it's not a bad life. \n\nSo my suggestion to you, as an accountant, is to evaluate the whole transaction of the relationship. Just because it's a financial loss doesn't mean it's a total loss. But you also are responsible for taking care of yourself. It comes down to- how much is she worth to you? Do you have faith that she will recover, or are you able to accept if she does not?\n\nThese are questions I suggest anyone asks before moving in together, because if you aren't willing/able to support each other moving in may be a bad idea. ",
            "I’ve been depressed and still worked 56 hours a week. Is she really depressed or using it as a reason not to work",
            "Turn off the internet or change the password. Once she’s paid the rent she can use the internet again.",
            "It really sounds like she could be bipolar. Not an excuse but if she really “flipped” a switch then that might be the case. ",
            "[deleted]",
            "[removed]",
            "[removed]",
            "[deleted]",
            "Every other guy is being abused by his girlfriend \"because she's depressed\". Ask around, you'll see. ",
            "[removed]",
            "Help her... she needs a way out in one or another... she must go for therapist... and spent a week at some new place for trip... ",
            "I feel like my husband could say these things about me, except that I do see a therapist and I do BJJ about 3-4x a week. It helps. My husband isn't emotionally supportive of me at all and often ignores me or seems indifferent. I had to quit a couple jobs because I have a son who is disabled. I have gotten a master's degree since we've been married, but I can't use it because I have to take care of my child. This is a son from my first marriage. His dad isn't around. I feel like a bunch of this shit is not within my control. We have 4 other kids. I am burned out. I know he is too, but fuck I do try. Hard. I ask for exactly what I need. I'm sure he's exhausted. I am too. I never withhold from him though. He would say I am like a child he has to care for. I don't agree because I take care of everything for the kids, basically, all cooking, cleaning, he doesn't do jack shit but the yard work. He does work hard. So do I. If I had more emotional support and attention I could do so much more for the family, but he's not willing to give more. I wonder what his perspective would be though. If y'all could read both sides. Who knows? All I know is this is different. If she won't even go to the doctor... Come on. I am actively trying to get better while caring for 7 people (including myself). People with mental illness need love and support and if you truly have nothing left to give you have to take care of you first and foremost, but if you're just unwilling because she's not trying...be honest. Because if you kick her out and you break up you at least owe it to her to be honest so she can find someone maybe who is even more nuturing than you are, and/or realize she needs real help and get it. I share my experience because I get how she feels. A lot. She probably is so ashamed she doesn't have the money. Even still, I wouldn't do nothing about it. I guess that's the difference. I just wonder if maybe you're not seeing it??? Why do you love her? You keep saying you do but you haven't said one nice thing you like about her. ¯\\_(ツ)_/¯",
            "[removed]",
            "Aside from whatever your gf is going through, it seems to me that you are more in the market for a roommate than a woman. Maybe I watch too much TV Land, but there used to be men who married the girl of their dreams then took care of her. My husband and I lived together before marriage, but he wouldn't give me a bill in a million years.  And if he did, I'd know I was with the wrong person.  \n"
        ]
    },
    {
        "post_id": "a2ekzp",
        "author": "HopefulRecover",
        "title": "Ex [21M] is angry that I hooked up with someone 3 months after he dumped me [21F]: UPDATE",
        "url": "https://www.reddit.com/r/relationships/comments/a2ekzp/ex_21m_is_angry_that_i_hooked_up_with_someone_3/",
        "score": 3131,
        "num_comments": 206,
        "created_utc": 1543768146.0,
        "selftext": "Update to the post from a few weeks ago, link here: https://www.reddit.com/r/relationships/comments/9zrhpj/ex_21_m_is_angry_that_i_hooked_up_with_someone_3/?st=JP73J286&sh=8deb62a8\n\nThank you to everyone who responded to my thread! It really meant a lot that you guys agreed that there wasn’t something that was wrong on my end. \n\nI met a couple of friends this past weekend from college and found out that my ex has been going around telling people about the nasty things he texted me. He apparently wrote a rap song too about me (should I feel honored or laugh at the time he wasted). I was really angry to begin with because I was still obviously hurt, but then I realized that this definitely would not have worked in the long term, and I’m glad he showed his true colors, even if it was almost 2 years into the relationship. \n\nI’m also going to start therapy soon just to deal with how much emotional baggage he unloaded on me, as well as coping with my accident. \n\nOnce again, thank you everyone for your support! \n\nTl;dr: Ex has been going around saying more things and now I know I’ve made the right decision staying away! ",
        "permalink": "/r/relationships/comments/a2ekzp/ex_21m_is_angry_that_i_hooked_up_with_someone_3/",
        "comments": [
            "Girl, I ran into the ex fiance 20+ YEARS after we broke up. Each of us were married 20 yrs. He had kids, ffs. He still 'had nothing kind to say to an adultress'. ' (Aka I found someone to date after a full six months of refusing to see him or say anything to him.). Crazy people be crazy. ",
            "I can't believe your EX tried to guilt you for not telling an him that you had sex with someone else. Does he think you need to keep him apprised of every intimate detail of your life still? It's none of his goddamn business what you do, or who you do it with. He's been nothing but an immature manipulative asshole. Glad you are finally over it, painful as it is to get there.\n\nNinja edit because poor wording could have been misinterpreted",
            ">\" He apparently wrote a rap song too about me \"\n\nOH MY LORD this is the best thing I've seen today. Can you get your hands on it?? \n\nTherapy sounds smart & healthy, good for you! Smashing it!",
            "I had an ex write a song about me. It’s on Spotify and I think it’s probably one of the funniest things that’s happened to me. I’d definitely laugh it off! But anyway, I’m glad you’re doing good for yourself!",
            "He must be a cringy person if he made a rap song about you. Yikes...",
            "My high school ex-boyfriend also wrote a rap song for me. When me and my friends get drunk we occasionally listen to it. SO CRINGE, poor guy.   The moral of the story is that in a few years OP all of this will be over (possibly funny) and you’ll be so glad you didn’t end up with him! ",
            "Girl you are so much better without him. What you do is none of his business, he does not have any right to know who you do or do not hook up with. Glad you're doing better! My advice to you is to block him from all contact ✌",
            "My ex got mad at me because I went hiking a year after we broke up. I guess she had claimed the hiking spot I went too. Very crazy reaction to something so simple.",
            "[removed]",
            "Next time write out your whole situation and read it as if your best friend were telling you his/her situation. Think of the advice and support you would give that person. You are strong and capable of handling it. Getting away from abusive people who are not capable of handling things maturely is healthy. You will get through it. ",
            "My cousin’s ex wrote a diss track about her on Soundcloud and me and my family made fun of it for months. It was catchy and he name-dropped her but we all just thought it was hilarious bc the guy was an ass and stole money from my immediate family. I’m glad you’re out of that situation OP, dude sounds crazy",
            "Everybody who’s commenting saying they have been the subject of a song, please, PLEASE leave the lyrics below,\n\nOp, it sounds like you are making the best out of this! Therapy is awesome and from my experiences, the garbage exes become funnier the further away from them you get.",
            "You might like to have a little read in /r/NarcissisticAbuse, OP. Even if it’s not exactly what’s going on here, he definitely employed some abusive tactics (holy triangulation, Batman! And a smear campaign, too) and I think it would be smart to study up on some of that so you’ll be better prepared for your future dating life. Best wishes <3",
            "Your ex is just fucking around with you for his own amusement. Please actually block him he’s beyond toxic ",
            "Fuck him, it's none of his goddamn business.",
            "So.... can we get a copy of those lyrics please op?",
            "Sounds a little narcissistic to me.",
            "I have an ex that I dated for off and on 6.5 years who slut shamed me for dating and sleeping with someone after he cheated on me and we had broken up. I also went to therapy for awhile to get over the shit he put me through. Good for you for getting on the right path for yourself. You’ll come out stronger. You go, girl! ",
            "Lol yeah my ex got super mad at me for starting dating again within a week, I mean I can see how that would bother you sure but at the same time you broke up with me and so get used to the idea of me moving on. Months later is DEFINITELY okay ",
            "Brah, read the whole thing and you honestly dodged a bullet. Rap? Seriously? What a tool. You guys are young and you will appreciate how cringy whole thing is in a couple of years but for now; Work on yourself, relationships feel like the beginning and the end right now but you are so much more. Take some time to be you and put the whole thing into perspective. You need to be a whole person on your own and re visit the steps that made you choose such this utter dumpster fire. Use this as a learning experience. You will be amazed how awesome you really are without this autist weighing you down! ",
            "Why are you still hung up over this? He broke up with you, theres nothing to discuss or feel guilty about. ",
            "LOL. Like if your not together its not cheating",
            "This guy sounds delightful! Seriously though, bullet dodged!! ",
            "I'm glad to hear that you feel validated by the comments on your first post. He clearly acted abusively and its really good you are taking some distance. And you have the absolute right to laugh at that rap song for eternity.",
            "Just chiming in because my ex also wrote a rap about me after we broke up and I was beginning to get physical with other people and move on. It’s a great reminder why I leave him in the past and just how petty and childish he is (while being four years older than me). It sounds like you’ve got some sane people who can see through his BS to support you. Keep your head up girl! ",
            "It took me five years. He too unloaded LOTS of emotional baggage on me and somehow convinced me that I was the problem. That o should be grateful he loves me so much he puts up with me. A class A martyr. I have no idea what he’s up to now. I don’t care. I found a wonderful man and am getting married in May. If ex has another victim, ahem I mean woman, I truly feel sorry for her.",
            "It's good that you're getting help and trying to turn things around. Going through manipulation and abuse at such a young age can really skew your perception of what's right and what's wrong. Let him wallow in self pity and just focus on your own health and moving forward. As much as all this sucks, it'll make you a stronger, smarter person in the long run!",
            "Oh man. I have this ex. Took YEEEARS to work through the self esteem issues he gave me. \n\nMine turned into a pathetic loser, divorced, working retail (noting against retail, just he used to feel superior to non-professional people), and living with his parents (at age 33).\n\nYou'll find someone better, but it's better to be alone than with this dumpster of a human.",
            "Glad you realised that there was nothing wrong on your end. You're a better person for not having to deal with this douchebag anymore. I'm especially glad to read that you've decided to go into therapy. It takes a strong person to take action like that. You're amazing!",
            "Yikes. My ex was a writer and he wrote a lovely lengthy poem about me a few years after we broke up. I saved it :) It makes for a good laugh sometimes.",
            "Keep moving forward.  He’s too young based on his behavior ",
            "He wrote a rap song for you tho.....",
            "I’m glad you’re getting help, congrats! I’m curious, what country are you guys in? ",
            "Is this Kelly from The Office?",
            "[deleted]",
            "All things aside, where's the rap song at? Lol",
            "Huge faker I called it out last time they posted this but their last account had posts saying they aged from 20-25-27 in like a few hours. Then they deleted their post history and now i guess their back to karmawhore.",
            "[removed]",
            "I have to be perfectly honest you sound like a terrible person.",
            "From your original post...I have to say...you invited this behavior by continuing a relationship with him. You basically have zero boundaries."
        ]
    },
    {
        "post_id": "4f5lph",
        "author": "reasonwhyimunemploye",
        "title": "I've [24F] been applying for jobs. My \"friend\" [26F] snuck into my computer and added \"fuck you\" into my cover letters. I've been unemployed for months because of this. Is there anything I can do about it?",
        "url": "https://www.reddit.com/r/relationships/comments/4f5lph/ive_24f_been_applying_for_jobs_my_friend_26f/",
        "score": 3137,
        "num_comments": 380,
        "created_utc": 1460875328.0,
        "selftext": "After college graduation, I got a job at a start-up in the tech industry. Unfortunately as you may know, many start-ups fail. After about 1.5 years working there, I was out of a job. My closest friend at that job was Beth. \n\n\nBeth and I decided we were going to make a team effort at finding new jobs, since we knew we were going to be applying at the same jobs anyway. We have very similar experiences and backgrounds.\n\n\nShe and I were incredibly diligent with our job search. I can't stress this enough. I had written six unique cover letters and resumes that served as templates--they highlighted my experiences in ways that catered to the jobs I was applying. Each template had a label and a description. When I applied for a job, I would read the description, match that to whichever template was the most suited, and applied, etc. \n\n\nBeth did the same thing with hers. We also were incredibly diligent at editing each others resume/cover letters for spelling errors. I know that I read mine over and over and over again, since we all know grammar mistakes are the quickest way to get your job application sent to the trash. \n\n\nSo, here's what happened. It has been six months. I've been incredibly unsuccessful at landing a job, while Beth got one almost immediately. Even though I was unemployed, Beth helped me all the time, reading over my letters, sending out recommendations on my behalf, everything. \n\n\nWell, guess what? Beth sabotaged me. In my cover letters, she snuck in a \"you're not really reading this, fuck you\" just smack dab in the middle of my letter. This was AFTER I had poured over every detail for spelling errors. Since I discovered this, I tried to confront her about it, and she has been avoiding me ever since.\n\n\nIs there anything I can do? I have literally applied for HUNDREDS of positions, and I'm worried that I'm just permanently blacklisted. I'm so angry and so hurt.\n\n\n**tl;dr** My friend, who was supposed to be helping me get a job, sabotaged me intentionally by sneaking in \"you're not really reading this, fuck you\". I haven't heard back from a single place because of this. What do I do?",
        "permalink": "/r/relationships/comments/4f5lph/ive_24f_been_applying_for_jobs_my_friend_26f/",
        "comments": [
            "Honestly, I suspect most cover letters go into the trash can. When I was a hiring manager, I never had one passed along to me from HR. \n\nEven if yours was read it was more than likely  tossed soon after.\n\nIf I was you I'd get a new email address to use, new phone number and use a different address. I might even start using a middle initial or my middle name. This way if they scanned your info into a database your entry will be unique and not linked back to your old resume. \n\nDo not call any places or contact them to explain what happened. Because, as I said, more than likely your snafu either went undiscovered or is forgotten. Don't risk calling more attention to it. \n\nAs for Beth, obviously drop her as a friend. Then spend a few hours daydreaming revenge. She's a rotten person. \n\nEdit: extra word.",
            "Right.\n\nI've been in high-tech for 20 years. I have compiled an extensive list of technical recruiter contacts that I can share with you. Reach out to them directly, ideally without one of your previous cover letters. \n\nI would also suggest phoning them first, establishing a rapport, and then after they agree to it, send them an email.\n\nPM me directly, and I can send it to you.\n\nMost of these recruiters handle world-wide, overseas contract assignments. Not sure what you're looking for, but it might be a fresh start.\n\nEdit: To all the folks asking for the list, I'm sorry, but I can't share it with all of you. \nIf OPs situation were not so dire, I'd never have offered. \n",
            "I don't even know what to say to this one. That's a really shitty, nasty thing to do. \n\nI'm ~~pretty sure there's no legal action~~ not sure if there's any legal action that can be taken, but the best thing you can do is try to repair your reputation. Do you have any other friends who work in the industry? If so, then start talking to them about jobs. You can explain what Beth did and see if any of them would be willing to go to bat for you. \n\nYou could also try contacting some of the places you applied to and apologize for the error - maybe explain that someone who was helping you apply to places altered your cover letters without your consent. You may never hear back from them, but it may give you some peace of mind. \n\nIn the future, never ever let someone send out cover letters/resumes on your behalf unless they're a headhunter or placement-type person. I'm not even sure if any of this is good advice, but you totally have my sympathies with this one :(",
            "OMG. I'm like, unreasonably, enraged angry. That is so far beyond acceptable I don't even know how to react. I hate her. I hate someone I don't even know. How is this possible?\n\nI spent nearly a year looking for a job and I want to pull Beth's hair out and feed it to her. And then hug you and eat ice cream together.\n\nHoly mother of God.\n",
            "She's not your friend. Remove her from your life and ignore all future attempts of contact with you from her.",
            "As an employer whose employee was possibly still on probation... I would LOVE to know that I had such an unscrupulous asshole working for me.",
            "I don't really have any advice for the Beth-situation, beyond burning that bridge with a vengeance. What a horrible person.\n\nAs far as the applications go... try reapply to different jobs, and even jobs you've already applied to. They may not remember your name, if they even recorded it or just put your resume in the circular file and wouldn't remember you. ",
            "I don't get it. Your friend said \"I made a couple edits, here's your letter back!\" and attached it... Then you sent all six versions along without reading then once more? \n\nThis story makes no sense... ",
            ">My friend, who was supposed to be helping me get a job, sabotaged me intentionally by sneaking in \"you're not really reading this, fuck you\"\n\nThat's **not** a friend. Distance yourself from someone who's obviously toxic and doesn't respect you. Employment is never something to fuck with, especially in the early stages when it's hard to get a break.",
            "I'd look into any HR related subreddits and post this question there, maybe they can let you know how to do damage control here. If it were me, that friend would be dead to me, I wouldn't even give her a chance to explain herself.",
            "Okay, Reddit has given me a good primer on the absolute worst of humanity, and yet I'm still surprised by how low people go.\n\nThere is really nothing more you can do than take the high road.  Tell her that her actions were horrible, you expected better from her, block her on all social media, delete her number (or, at least, keep a copy of it in an address book somewhere out of reach before deleting) and tell all your friends about the time you trusted somebody who turned out to be a snake.  Redouble your efforts on applying for jobs, write new cover letters from scratch, and hopefully you'll be able to get a new job.\n\nI don't believe in karma, but I do believe that nastiness like this has a way of catching up to people.  Even if nothing happens as a direct result of her burning you in this way, it does show a certain poverty of spirit that will mar all her relationships, not just this one, and eventually somebody will discover how petty she can be and will implement consequences on her.\n\nJoke option:  Send her an angry diatribe, write 'you're not really reading this, fuck you' in the middle of it.",
            "Um, can people stop giving OP advice on how to effectively write a cover letter? This post isn't asking questions on how to do that, it's on how she can deal with her friends sabotage in relation to her future employers and getting hired. ",
            "The best - and most professional - revenge on Beth would be to land a job in your field.\n\nThere's some really sound advice on here that I'm seconding, which is to re-write your cover letters and change your contact details. Do you have any opportunity to expand your horizons and apply farther afield, in a new city or even country?\n\nFWIW, I don't think you can be blamed for not checking your letters right before you send them. At the time of drafting, I would have checked the body of the letter, and at the time of sending, check that it's addressed to the right person. Sometimes you can go blind over-checking, not to mention that what Beth did is absolutely not something you'd be looking for. However, looks like this was a shitty lesson to learn for the future!\n\nEdit: You could maybe write to Ask A Manager about this one? She's a blogger with a lot of experience in HR, she might have experience in \"gross cover letter fuck ups\". ",
            "Fuck you, Beth",
            "Its a shitty thing to do but how could you not spot it sooner? Its still just a template so there is no way that you arenth pruning it to make sure it matches the potentional employers expectation and score you an interview. Most people are able to spot a template you are just shipping out with a company name change slapped on and throw it away.",
            "You know, most large employers don't have a human being looking at a resume until it ticks off all the boxes in their system. I am betting one of those boxes is \"no profanity.\" I think you can safely change your resume and cover letter a bit, then send out again. Even if a human being did see it, the chances of someone remembering your name after reviewing hundreds and hundreds of resumes are slim.\n\nChange your format and send out again.\n\nGood luck!",
            "> you're not really reading this, fuck you\n\nFirst off, stop talking to this person and stop associating with this person.\n\nSecondly, how have you not noticed this in six months of job searching?  You should be constantly looking at your resumes and writing custom cover letters for each job you apply for. \n\nShame on your ex-friend for being a bad person.  Shame on you for not paying more attention to your communications to potential future employers. \n\nLearn from it, move on, improve. \n\nGood luck on your job search!",
            "Obviously this is the opinion for down votes but I have to say it:\n\nShit friend yes.\nCut them out.\n\nWhat can you do?\nLearn a valuable life lesson.\nYou are responsible for your own applications full stop.\nThis is such a rookie move the last thing I do before I hit send on any application is sanity check it.\n\nFix it up.\nKeep applying.",
            "With regards to job application, if you're living in an area flourished with startups and big companies, I probably wouldn't bother calling back and explaining why there was a Fuck You. I'll cut her out and apply to hundreds more.\n\nLike most other commentors say, referral gets your resume past the screen fastest, so try them. Also, if you don't mind moving, move to a new city, NYC, SF or Seattle, for example, if you're in tech.",
            "Well it seems to me your friend just taught you a lesson about proof reading. A good job application should take you half a day to a full day and sending out pre-written stuff always stands out, is always noticeable and most likely won't get you hired. If you were tailoring your cover letters and application to each job you would have noticed almost immediately. \n\nDO NOT USE TEMPLATES",
            "Thank your friend for teaching you a valuable lesson in actually checking your own resume before you send it out.\n\n",
            "You could start by proofreading every letter before you send it out. You should be tailoring the cover letter to the job, so that shouldn't be very difficult. If it's too long for you to read every time you send it out, you can be guaranteed that the person on the other end who is getting another cover letter every 5 minutes isn't going to want to read it either.\n\nForget about Beth. She's a jerk. It happens. Move on.",
            "> This was AFTER I had poured over every detail for spelling errors. \n\nI love that there's a spelling error in the sentence about spelling errors. ",
            "Fix it, fade away from Beth.  Say nothing except maybe to a few strategically reasonable friends.\n\nThis is for the following reasons:\n\n1) It'll freak Beth out.  She's waiting for an excuse to make you look crazy to cover up what she's done.\n\n2) You need to look calm and professional now more than ever.\n\n3) It may take a long while, but the opportunity to get Beth back will present itself.  You just need to be patient and do it properly to cover yourself.\n\n4) If you confront her she'll just make you look like an idiot for not checking your cover letter. If you're going to pay her back for this it needs to be subtle.  It's best if she doesn't know you knew.\n\n",
            "Can you prove it?",
            ">Beth sabotaged me. In my cover letters, she snuck in a \"you're not really reading this, fuck you\" just smack dab in the middle of my letter. This was AFTER I had poured over every detail for spelling errors. \n\nWait, what? If you were really checking them properly, you would have caught this before they went out. It's a shitty thing for her to do, but nobody is responsible for your job applications but you. Sorry you had to learn this the hard way.",
            "* pored over ",
            "As someone who reviews hundreds of resumes, I can say that's not why you didn't get the job. If you were qualified for the interview, I'd certainly ask you about it there and if you explained yourself well, depending on the position of hiring, I'd still consider you. My point is, from a reputation standpoint, I don't think it's the end of the world. \n\nFrom a friend standpoint- find a new one for sure",
            "You stop, collect yourself, and say, \"well played.\" She got you. You trusted her. She made you regret it. Pick yourself up, dust off, and move on. Dirty, underhanded, selfish, and evil, yes, her actions were all that. But getting back at her at this point will only pull you away from what your primary objective should be: getting back on your feet.\n\nMake the necessary edits to your resume. Most companies don't keep resumes/applications past six months to a year. Start with the companies you first applied to. Find out how long they keep resumes. If you're past the time limit, resubmit. If you're not, and you think you'd have a shot, tell HR, \"I let someone edit my resume. I failed to check their work. Can you delete/throw away my old one and let me submit a correct one?\" Don't try to elaborate. It's not important. If they accommodate you, all's well. If not, move on to the next. And the next and the next. And on until you've recovered.\n\nCut off Beth.  No interactions. Don't attempt to get even. After you've gotten back into your industry, don't even bring up what she did. If, at a later date, someone asks you about her, tell the flat, plain truth. Leave it at that. If, by some outrageous chance of fate, you have to work with her again, refuse to do so. If they ask why, tell the flat, plain truth. \n\nIt sucks what happened. Really, that's horrible. But, even in the situation you find yourself in, you're trying to raise yourself up. And you can't get any higher if you're all tangled in someone's mess.\n\nGood luck.",
            "Why would someone DO this?\n\nIs it she was thinking it would help you?\n\nIs it she wanted to sabotage your chances of being hired?\n\nWas she trying to help you or hurt you?\n\nWe're you even on her mind what if she just wanted to use you to discharge her animosity toward the companies?\n\nSo she says \"you're not really reading this fuck you\" so maybe if we try the angle of whether or not she truly believed what she said first.\n\nIf she believed it, it means she wasn't trying to hurt you. She was just frustrated at companies. But the question next is did she do it on her OWN cover letter? If not, why use yours and not hers was it because on some level she thought they MIGHT read it?\n\nIf she didn't believe it, it must be purely to hurt you. Why? Did you do something bad to her? Does she see you as competition which means she's threatened by you ?",
            "As a former hiring Mangager I will tell you a phone call or email will do no good. It shows me that you relied on someone and didn't follow up on their work for you. Make sense? I would want to know how responsible you are and this proves that you are not . \nYour intentions are well but something like this needs to blow over.\nWrite up a different cover letter and resume and then in two weeks swing for the fences again.",
            "[deleted]",
            "[deleted]",
            "If this comment doesn't get buried, it's certainly going to get downvoted, but...\n\nWhat Beth did is a terrible thing and you have every right to call her up and tell her she's an asshole. Break off the friendship and don't bother with her.\n\nAfter that, you need to recognize you share responsibility here. No employer is legitimately thinking you intentionally told them to fuck off. I guarantee they all are aware, and rightly so, that a friend played a prank on you and you completely failed to proof read your cover letter, and that you used a mass cover letter.\n\nWhoever told you to do this to get a job was an idiot. You need unique cover letters for every job. NO copy pasting. EVER. If you want a job, read the job description/posting, research the company, and draft a new cover letter for every single job.\n\nYou're not unemployed because your friend screwed you over, you're unemployed because you used template cover letters and didn't proof read them BEFORE sending. That is a huge red flag to any employer.\n\nPlease, after telling Beth she's an asshole, revise your application techniques and take responsibility for not proof reading your cover letters before they get sent out, which you should do every single time.",
            "What a petty woman! She was so wanting to get a job before you that she sabotaged you. Man what some people do to care about their own self-image is downright psychotic. This is a powerthing, by putting one-self in a upper power position, in a friendship. Fuck that! Aint no one has time for a frindship dynamic like that. ",
            "Anyone else you know she 'helped' or might if they are in the same industry. warn them not to let her check work or covering letters. Or see if she's done the same for them",
            "If a letter like that (an obvious prank) came across my desk, I would have made it a point to contact the sender just out of human decency. No one did this or is this story just bullshit?",
            "Sorry OP but I think this is on you. You should always be the last person to read your own cover letter before sending it in. It's great to have someone else look at it, but your eyes should see the finished product. What your friend did was awful, but I'm stunned that you sent all these letters without giving them a final look.",
            " \"Trust but verify.\" \n\nAt best, you were the butt of a prank and the prankster never thought to check in with you. (Highly unlikely as jokesters want to know their joke was a success.) If this was a prank, Beth would have let you know months ago. If it was about ensuring she got a job first, she'd have let you know months ago, too. \n\nReality: you made a poor decision in trusting someone and an even poorer decision in allowing them to make revisions without your verifying and rereading the entire document. This went on for months. As a former HR admin, the best thing I could say was \"You let someone do your work for you and then let it ride for six months without even bothering to rework or revisit your efforts.\" Even though you were intentionally screwed over, you used the same templates without seeing the edit. That's all on you. \n\nHow do you handle Beth? You don't. She knows what she did. There's no salvaging a relationship if there's no trust. Do you think you're going to appeal to her and get some confession of guilt? She let this ride for half a year and willingly listened to you complain about not getting a job. If she gets any emotionally rise from you, you'd just be giving her more value. \n\nFix your cover letters. Don't ever contact her again. Learn your lesson. Move forward. ",
            "\"AFTER I had poured over every detail for spelling errors\"\n\nthat's some irony there.\n\nYour friend is a shit.  Other commenters have already had the same idea as me, to apologize to some/all of those you sent the sabotaged letters to.   As someone in IT who looks at resumes and interviews people, though, if I saw a resume that was a good fit which had a \"fuck you you aren't reading this\" in the cover letter, I'd assume 100% that the person didn't know that was there and let them know about it immediately.\n\nHave you been sending these all directly or have any gone through a recruiter?  They sure as shit should have caught it.",
            "I really doubt that there is any legal action for you to take. And even if there was, the cost of a lawyer could be prohibitively expensive for you, and give you rather diminishing returns. \n\nI would also recommend sending this to Alison at the Ask A Manager blog, she'll likely have good advice for you on how to go forward.\n\nAs for the relationship part: I hope you've cut this \"friend\" out of your life for good, and don't hesitate to tell anyone who asks why about what she did.",
            "Honestly, I would have already kicked the shit out of Beth.  Force her to pay me a couple thousand or I would kick her ass again until she paid it.\n\nEdit:  What's it called when you spread false accusations about someone?  Can't you get a lawyer for that?",
            "For months you didn't read your own cover letter?\n\nWhat she did is unforgivable in my opinion,  but what you did is dumb. Only you are responsible for your life and future, you should have read your OWN cover letter before sending it out to anyone. \n\n\nThis is ultimately your fault. ",
            "My question is why continue to sabotage you even after she got her position? ",
            "With friends like these, who needs enemies ?",
            "Hey, Bro.\n\nSecret: She's not your friend.\n\nYou need to remove that cancer from your life: Either surgically or with a scorched earth approach. Your call. I'm personally a fan of scorched earth.\n\nThat takes care of the interpersonal issue.\n\nJob hunting in the tech industry sucks. Consider the apps you've put out a lost cause. There's not much you can do about it. Edit your cover letter, and move on. It's a new day. Start fresh. Also consider contacting some of the consulting and recruiting agencies in your area. They'll eat you up.",
            "Let her avoid you. She's a prick so just cut her out of your life. There's no point in confronting her because nothing she could say will make you feel better or undo what happened. I would pass on the word of how much of a scumbag she is if you two have mutual friends though",
            "Friendship is over. Cut contact and move on with your life. Do not waste an energy trying to talk to Beth, trying to confront her or even to get revenge on her. Either tell her \"Fuck you\" and move on, or tell her nothing and move on. ",
            "FWIW, I've hired hundreds of people, and I don't think I've read a single cover letter.  ",
            "sorry, this isn't the reason that you're unemployed.  If your cover letter is more than a single sentence, I guarantee that at least a handful, maybe half, of the places literally didn't notice that sentence.  I wouldn't have.",
            "Beth is a psycho. The odds are high that this is not the only evil thing she has done to you without your knowledge. \n\n**She may already be in the midst of sabotaging your life in some other way.**\n\nYou need to get ahead of her before she can do more damage to your life. Reach out to everyone you know and tell them what has been happening. Meanwhile, document everything. ",
            "At the company Beth's employed, did you also apply?\n\nIf you did, I'd contact that HR apologizing for your cover letter and explaining to them an employee of theirs sabotaged it. Also, tell them in the letter that while this may not help employment at their company, that this situation, encountering a horrible person (leave out adjective) such as their employee, has taught you a valuable lesson about due diligence and trust.",
            "You mentioned startups so I assume tech? If so, and you live in Los Angeles, send me a PM and I'll connect you with people that can find you a position, or find you one myself. I've been in the industry for years.",
            "I think you got good advice, but you should also read over your cover letters AGAIN just before sending them to the position they're supposed to apply to. ",
            "Beth is not your friend. ",
            "\"friend\"",
            "[deleted]",
            "Just some general advice, you should really customise cover letters specifically for each job. If the ad has a name, add the name to the start of the letter. Slightly rewrite each cover letter to adjust to the criteria of each job.\n\nSix templates is not going to cover the requirements of every job, or most jobs even. It's possible you wouldn't have been getting much work anyway using such generic cover letters. Employers would probably notice you are just sending templates, it's a bit obvious.\n\nIf you apply for a new job with the same firms you've applied for, right at the top of the email mention that someone had previously edited your cover letters without your knowledge and hence the previous bizarre cover letter.",
            "Okay, any advice Beth gave you about writing cover letters or getting a job - discard that advice asap. Look up for yourself advice about these things if most of your strategy had been Beth's idea. ",
            "Well what a crap head Beth is. Cut her out of your life and move on.\n\nRewrite your resume and cover letter templates. Start from scratch with brand new files and new designs. Maybe create a new email address or get a new number if possible. \n\nThen work from those templates but always be super thorough and customize your response to each application. It's on you to proof before you hit \"send\". I always store my templates in Word and proof there. Then when everything looks great I PDF each document and the PDF versions are what I send. \n\nBasically you need to start over and act like it never happened. There will be no blacklist and honestly most companies get hundreds of applications for jobs so it's possible they never saw your application anyway.",
            "Although it's terrible I don't think it will be the end of the world. I would take your new cover letters and send them to all the companies you applied to before.\n\nRemember most tech organisations have HR staff that pour over received resumes and throw away the unsuitable ones pretty quickly. Most likely they would have seen the fuck you and just dropped your application without much care.\n\nWorst case scenario, they don't reply again. Best case scenario they don't remember you and you get an interview.\n\nAlso be wary of your \"friend\" at the very least warn any mutual friends you have and make sure she hasn't don't anything else that could have sabotaged you that you haven't noticed yet.",
            "All I can say for Beth is never speak to her again. Purge her. Block her from everything, don't rise to her level and attack. Awful people like her have a fantastic way of twisting things to make themselves the victim. If you attack her in anyway she'll justify her actions. If you block her and move on. She'll have to spend the rest of her life knowing she did a super shitty thing, and she'll have no good way of justifying it. At least that's how I've looked at it when people have done something horrible to me. ",
            "You got a lot of good advice re: finding a job. I want to say a few things about how to deal with Beth. My advice is to do nothing. Don't reach out to her, don't contact her, act as if she doesn't exist. There will come a time when you will have an advantage. Maybe not next year, maybe not 5 years from now, but that time will come, trust me. In my 20s I had some bad experiences with some coworkers/friends (although to be honest, nowhere near as bad as yours). I minded my own business and did my own thing. I'm pushing 40, but I came out ahead by so much, it's not even funny. Living well is the best revenge. I cannot emphasize this enough. Having a great career will be the best thing you can do for yourself. The rest will follow. I'm rooting for you.",
            "Who the hell does that?",
            "wtf?  why would she want to sabotage you like that?!?",
            "You should be writing a new, custom cover letter for every position anyway. If you're just shotgun-blasting your resume everywhere, you probably wouldn't have gotten any jobs or interviews anyway. I've spent anywhere from a half-hour to 10 hours per job application, customizing my resume and cover letter, and it always pays off. I've gotten interviews for every job I've ever applied for, and hired at 90% of them. As someone who's also been on the other side and has had to look through dozens of resumes, it's easy to spot the generic \"shotgun resumes.\" There's plenty of jobs out there, but people are looking for those who stand out, not those who just mass-produce applications and use the same generic cover letter.",
            "The fact that not a single company replied with a \"well, we WERE going to hire you until we read this part\" tells me that they actually *weren't* even reading it. ",
            "[deleted]",
            "Sounds like a light version of a car accident I came across along a two lane highway.  Two girls in a car.  The passenger unexplicably leaned over and pushed the steering wheel to the left into an oncoming car.\n\nThe oncoming car was smaller and had a mother and teenaged daughter in it.  Mom and daughter weren't able to move after the accident while the driver of the other car was telling the story of what happend and her passenger was walking around the scene telling people that she was involved in the accident and wondering why nobody was helping her.\n\n",
            "This is some serious shit.  You might actually need to move to a new area of the country and/or legally change your name type shit.\n\nI think you should ignore the bit about not pursuing legal action that is in the top response right now.  You actually have a fairly good shot at defamation of character, for one.  Don't go to small claims court, go directly to a lawyer.\n\nThis woman has done *irreparable* harm to your professional reputation and owes you, at minimum, 6 months of salary plus however many more months it takes you to find a competitive position.",
            "Get proof. Then get a lawyer. ",
            "There is nothing you can do. I presume you don't see Beth anymore. If you do still see her, tell her why you're never going to talk to her again.\n\n\nSend out all your applications again. Chances are, a 'fuck you' buys you a visit to a trash can, not a blacklist. Make sure to rewrite your cover letter so it doesn't ring any bells for the places you've applied.",
            "I feel like we're not getting the whole story here. Beth is an ass, but... this might be coming from a place of frustration. After all, the OP clearly *wasn't* reading cover letters. Six months. Geez. ",
            "I think not reading your cover letter and resume one last time before you hit send is the quickest way to the \"no\" pile. Networking is the best way to get a job. ",
            "I know it is easy to blame your situation on this but I recommend turning to the mirror in this situation.  \n\n- Your title may as well read: \"I haven't revised/proof-read my cover letter in months.\"\n\nThis is where honest and careful introspection needs to begin in this case. Also - you're friend is a dick but it was a joke that you should have caught fairly quickly.",
            "Sounds to me like she wasn't so much trying to sabotage you....but prove that you aren't as observant as you should be. SHE proofed your work and you didn't review to make sure she didn't made edits or changes? Not sure I'd be willing to admit to anyone I didn't check my cover letters carefully before sending them out to a potential employer. Template or not, not checking a submission before hitting the ok button can really cause some damage. \n\nI work in the tech industry...attention to detail is HUGE...I'd see what you can do to mitigate the damage to your career. But you need to consider this a huge wake-up call about trust and that while our friends are great help....we need to be our own advocates and watch ourselves first. I am constantly seeing issues at my office because people fail to check their work before they copy/paste  and deploy it... it sucks but you have to review something if you are going to own it.\n",
            "Guess that's how she reacts during stress.",
            "this is one of the most vindictive things i've ever heard of someone do",
            "Wow Beth is a legitimate sociopath. I wonder why she did something like that though. ",
            "Just drop Beth and create new accounts. You can always change your name a bit. You can also get a new email address. There are definitely things you can do to start fresh. Most hiring managers forget resumes and may have never even looked at yours. I would consider giving your resume and cover letter a makeover and remove yourself as far away from Beth as possible. I think the suggestion to explain yourself would tarnish your image. It is much more professional to pretend like it didn't happen and move on. You can always utilize a temp agency. ",
            "That's a really terrible thing to do to someone....I'm just sorry. I would maybe re write your covers and resume so it's less memorable the second time submitting it to these places. Then tear a strip out of Beth whether it's phone call, text or even snail mail, she needs to hear what she's done.",
            "This is so psychotically awful that you need to cut this person out of your life forever.",
            "Well first off you're going to need a shovel.",
            "I don't think I would call her a friend",
            "I don't think I've ever heard of such a horrible 'friend' in my life. Please remove her from your life IMMEDIATELY. And maybe hook up with her boyfriend/crush in front of her or something if you get the chance",
            "Makes you wonder what she was saying in her \"recommendations\".",
            "Beth is horrible! I am sorry that happened but you really should've read the cover letters before you sent them. ",
            "Your friend is an asshole - but you should be writing a different cover letter tailored to the job description with every resume submission, just saying",
            "I have zero faith in humans, first the MIL who would cut her sons wife out of the family and lied about a $10K vase, now this. ",
            "[deleted]",
            "talk to a lawyer, reputation tampering i bet has some weight in the legal world",
            "Goddam! This is the first time I've ever wanted to suggest someone to hit social media and expose that fucking sociopath",
            "First, you're not effectively using a cover letter.  The cover letter is your chance to tell each employer why you are **PERFECT** for that job, beyond your resume.  If you're just using a template, (even one of several templates) you're missing a chance to explain why you're a fit for that specific role.  Take the job description or posting and look at what they really need, what's the pain behind the job (is the business growing? do they need someone who is really good at working with the sales or creative teams, and so needs to be able to understand their needs and translate that into your work? etc.) and answer why you're a good fit beyond the *\"I did x for x years and I'm so reliable, dependable, and fast learning.\"*\n\nSecondly, now you've learned a valuable lesson.  Don't rely on anyone else for things like this.  You should have known that you'd be competing with Beth for jobs.  I would cut Beth out of your life.  She's a slimeball.\n\nThird, you need to connect with employers beyond hiring fairs.  I doubt you're blacklisted - in the tech industry, you've applied for a lot of jobs that the recruiter isn't likely to even remember your name.  Actually, people not reading your cover letters is still likely a bigger issue for you than the \"fuck you.\"  Can you do internships?  Fellowships?  Get creative.  Go to events in your industry - not just networking events but classes, conferences, etc.  Anywhere you can get in.  Use linkedin to research who your supervisor might be at the type of job you want and get in touch with them.  If there are recruiters out there who you offended, telling them that your friend sabotaged you when she was supposed to be applying for jobs for you is not exactly going to be impressive.",
            "Short of contacting her employer, a calculated risk which I support but a risk nonetheless, you're just going to have to eat this one, sorry. If you go \"scorched earth\" (contact all employers, put it on YouTube, lawyer up, etc.) you may take her down, while definitively blacklisting yourself. \n\nRight now, *maybe* a few places saw it, said \"fuck her,\" and have you on a persona non gratis list, but the rest either didn't read it or don't remember. That's an advantage you lose by drawing attention to it. \n\nSay you do go scorched earth, then what? Beth probably gets canned, true enough, but people will forget her looooong before they forget you. You'll be that (intentionally harsh here) idiot who didn't proofread her cover letter, let some jackal fleece her to get a leg up, then whined and lashed out. Some people will actually hold that against you much more than what she did because, warped as it may be, she looks like someone willing to do what it takes to get ahead; a winner. You would look careless and petty. \n\nJust cut ties, and move on. ",
            "So Beth is dead right? As in you went to her house and brutally beat the shit out of her? That would have been my first move.",
            "Is there anything you can do? Yeah, kick her ass.",
            " Lawyer up. This is a terrible thing your \"friend\" did. She has basically ruined your career prospects and potential earnings. I suggest you post on /r/legaladvice.  If there are legal consequences available, you should follow up on those. \n\nAlso, you might seriously consider legally changing your name, then rewrite your resume and cover letters so you sound like a different person. Fortunately, no one has met you in person yet. ",
            "Wow. Well first I would contact people who you sent your resume out to directly (as in with your network or someone your were put into contact with) and profusely apologize.  Say it was a very immature prank on behalf on a very immature friend and that is all, and apologize for the unprofessionalism. Don't elaborate. Don't attach an updated resume. Just an apology. \n\nSecondly, I can't even begin to imagine what kind of scummy person she is. I would tell her off once, and cut her out of your life unilaterally.  I would never condone doing something publicly, but dear god if you see her out I would call her out loudly and humiliate her. If not karma is a bitch.",
            "[deleted]",
            "Damn, this is srsly fucked up. Beth is obviously no friend of yours. If you can prove it, you should look into taking legal action. \nStill, since this apparently hasn't come up: Who doesn't double check his/her applications before sending them out? ",
            "i'd email an apology letter explaining the situation(as short and simple as possible) to every single company you sent your resume to, they will definitely understand the situation because no one does that when they're looking for a job\nmaybe one of them will even offer u a job :)",
            "Honestly? Try changing your name. ",
            "She probably did this to weed you out of the competition. Since I am a very petty person, I would have loved to ousted her out and tell whatever company she's working for what she did to you (especially if it's the same company you applied for). But that's incredibly petty and up to your discretion if you want to toss her under the bus. \n\n\nInstead, write a mass email to all the companies you applied to and explain your mistake. If you think you had a very good shot at some at certain companies, go buy some fancy stationary and write a hand-written letter of apology. Don't forget your contact information if they decide to want to contact you back. But for now, assume all those companies are a loss and simply start sending your new, updated resume to other companies you're looking to work for. ",
            "You know what I'd do? I'd call Beth's employer and speak to the hiring manager. I'd tell them exactly what Beth did and I'd provide evidence - a copy of all your cover letters sent out, with her 'additions' highlighted. And also any evidence you have that shows you worked together, or interacted regularly. ",
            "> had written six unique cover letters \n\nI have at least 30+ unique cover letters just from when I was applying for jobs last summer. Thankfully I got one from one that didn't even need a cover letter ",
            "Well, you kinda black listed yourself there. Start trying a new area and move away from your black list. And talk to a lawyer for the friend in the meantime. ",
            "Tell her company about what she did and hope they fire her",
            "Sue your friend.",
            "[deleted]",
            "You can get a new friend or drop that guy from you life. You don't go around fucking up peoples lives in ways like that. Its not cute. It's not funny. It seriously damaged your chances & ability to get a job. Let this be a lesson you go over the CV or resume each time you send it. That being said you can send letters to HR of the companies you applied to and explain the situation if you intend to re-apply to those places. If not then just fix your resume, apply to new places, and move on. \n\nAnother redditor on here said something to the effect of: 'The one thing you don't do is fuck around with other peoples jobs. Everybody has to work and everybody has bad days. Don't screw with people's livelihoods.'",
            "I mean I don't think legally you can \"do\" anything, you know? She didn't commit a crime here, technically, because you sent the letters out, she just added that in there, and there's no proof.\n\nHowever, it still might be worth your time to get a consult with a lawyer? Maybe take her to civil court and sue her? Even if it's just for a small amount so you can win and at least have that going for you.",
            "[deleted]",
            "Who writes and send cover letters!!?? \nI haven't in my close to 2 decades of career so far.",
            "[deleted]"
        ]
    }
]