[
    {
        "post_id": "brxhuk",
        "author": "yoyosoyllamoes",
        "title": "update: I [16M] got into an argument with my older brother [26M] and told him he'll never measure up to our deceased father",
        "url": "https://www.reddit.com/r/relationships/comments/brxhuk/update_i_16m_got_into_an_argument_with_my_older/",
        "score": 3107,
        "num_comments": 121,
        "created_utc": 1558577232.0,
        "selftext": "i though i would provide an update to my [first post](https://www.reddit.com/r/relationships/comments/azopg2/i_16m_got_into_an_argument_with_my_older_brother/). \n\nsomeone advised me that i write my brother a letter apologizing, which i did. i apologized for being mean and hurtful, and that I was wrong for doing that. i also got him a separate card and wrote a message thanking him for everything he's done for me. I went to his house with my letter and card when I found out he was home to go talk to him, but unfortunately when I got there he was gone already, so I slid them under the door. \n\nWhen he got back home he found them and read them, and then he called me to arrange to come see me. He came over here and I apologized in person for what I said. He was very straightforward with me and honest about my actions. He explained that the reason he had been avoiding me lately is because he needed some time apart because he was beginning not to like me. He said loved me, but I he didn't want to be around me sometimes.\n\nThat was pretty hard to hear. He said that lately I've just been not very nice, the comment about our Dad was by far the worst, but I make other snappy comments. He had tried to brush it off as me being 'just as teenager', but had now decided it was best to let me know. \"Being a teenager is not an excuse to be a constant asshole to everybody at home\", is how he put it. He gave a few examples and looking back he was absolutely right. \n\nIt was pretty upsetting to hear. I know he wasn't saying it to upset me, and I was thankful that he was telling me (or at least I'm thankful now). I promised that I would check my attitude, he said a little more thoughtfulness was all I needed, and that even though sometimes I act like an asshole he knows I'm not one. After we finished talking we hugged, he told me not to forget that he loves me and that I'm great. \n\nSince then I've been trying to be more considerate. I really am trying to follow the advice he gave me. It's been a couple months now, and I'm happy to say that it's working. Our mom told me a couple weeks ago that Im a joy to be around. In the car earlier today my brother told me that its been really nice spending time with me lately. so thats good news. \n\nTL;DR apologized to my brother for the terrible thing I said to him. he warned me that I was turning into someone that he didn't want to be around, even though he loved me. i've worked on fixing my attitude over the past two months, and today my brother told me its nice to hang out with me these days.\n\n Edit: wow, wasn’t expecting this to get big. Thanks for the advice, and for the gold. Much appreciated.",
        "permalink": "/r/relationships/comments/brxhuk/update_i_16m_got_into_an_argument_with_my_older/",
        "comments": [
            "Hey man, I had a similar experience - when I was 16 my group of friends essentially had an intervention and let me know my defensiveness and argumentativeness was driving them away. Now, nearing 30, I am beyond grateful that I had friends who had the guts to be honest with me and give me a chance. I asked them to point out when I was doing it and respected them when they did.\n\nNow I make a point of inviting quiet people to speak in groups because I am aware that people like me drown out important voices that may be too timid to speak up when a bunch of loudmouths like myself are arguing. That one conversation changed my life for the better. I am glad you are being given the opportunity to see how  your behaviour affects others from another perspective. You will slip up, but growing up is all about generally trending upward in behaviour, not being perfect!",
            "This is such a great update. \n\n  \nI was told the same thing as a 16 year old and I just decided to play the game for the people I needed to like me. \n\nIt took much longer for me to realise that genuinely being a nice person was actually an end goal in and of itself because when I was approaching the world from a nicer frame of mind, it responded.\n\nYou've learned something many people take much longer to learn and bloody good for you. Keep it up :)",
            "Hell yeah. I was awful at 16 and would not have owned up to my behavior like you are. You should be proud of yourself",
            "I'm always happy to hear these positive updates, good on you!",
            "We all make mistakes!! That's good that you apologized in person like a man!!! Your lucky to have a brother to talk to! I wish I did sometimes!!! sSeems like you are a smart kid,and turning your life around! Good job!! And it sounds like your mom is impressed and happy that you did ..and your brother is to!!!Keep up the good work!!!",
            "OP, as you go through life you will be right about some things, and wrong about others.\n\nYou will think you're doing good, when actually you're doing bad.  Or you will lose sight of yourself and have a desire to do bad, and maybe lie to yourself about it later.\n\nYou will find yourself in situations where it's impossible to know whether any of the above applies to you.\n\nThe only thing that can insulate you from all of that is to be who you are being right now:  A person who is willing to be honest with himself, willing to face truths even if they suck, and willing to change.\n\nRight now, you're displaying arguably the best of all human traits.  Your humility and good sense are things you should be proud of, even though there will be times when they feel like a weight around your neck.\n\nSo please, take some time to be proud of yourself.  You deserve it.",
            "very good! proud of you! keep it going!",
            "Good one man, imagine how high quality of a person you can become if you keep acknowledging mistakes and just bravely pave the road towards being better! Sounds like you are your bro are close, stay positive and it'll all be good friend!",
            "My kid is ten, and I would be proud if he was as mature and owning of his mistakes in life at 16 as you are.",
            "I don't know you, but I'm very proud of you.",
            "You're a good person OP. Seriously it says a lot about your character that you are able to listen and try to improve. It's a rare thing.",
            "Teenagers who are assholes to their families are SO COMMON.\n\nTeenagers who are able to sit down and hear the message \"these actions are not okay\" and take that to heart? Not as common. \n\nGood for you in making choices to try and repair things. Best of luck going forward.",
            "You do realize you made a important choice : you accepted that you had been wrong and you apologized. \n\nThat act alone can put you ahead of so many people out in this world of varying ages. \n\nGlad to read that your apology was accepted and you reconnected with the family.",
            "That's heart warming. Can you talk to my brother?",
            "Hell yeah man. Having people close to you, who genuinely care about you, call you out on your shit - it’s fucking great. It’s how you grow as a person, and it’s much more straightforward a process than having to realize it on your own (usually after a much longer time). Additionally, being able to hear and receive criticism like that - that’s a fantastic trait to possess. Good on you, man.",
            "Grief makes us say and do some pretty rotten things. I told my dad I hated him after my mol died and that I wished he'd died instead.",
            "I'm glad that things are working out for you and your brother. Your story brought tears to my eyes.",
            "I’m also the youngest sibling by 10 years. When my mom lost her battle with cancer, my older brother abandoned me. Tried to steal my tiny portion of the inheritance. Tried to claim furniture I didn’t have because he liked it better than what he already had. Told bold faced lies about me to family members so they would take his side. Which they did. \n\nI never did anything to wrong this man. To this day I have no idea where this came from. Regardless, he’s dead to me. I haven’t spoke to him in years. And hopefully I never will again. Though I must admit, I sometimes fantasize about him coming to me to apologize or better yet, be in desperate need of help. So I can spit in his face and tell him to go fuck himself.\n\nYour story about how your brother stepped up and helped you through a great time of need makes me jealous and sad. Make sure you always appreciate this person. Not because of some irrelevant blood relation. But because he sounds like a genuinely good person who really cares about you and will always be there for you. Don’t take that for granted.",
            "I'm so happy to read your update. When I read your original post it broke my heart to hear such things being said between brothers during such a time.\n\nSo glad you were able to speak with him in honest terms and move on from where you guys stood.",
            "That’s really great, a lot of people are threatened by reflecting on their character and actions but that’s the best way to grow :)",
            "I was a douche throughout my teens to my family, I didn't really realise until I was 21 and looking back on my behaviour I was mortified, so I apologised to everyone, and family forgives and forgets.\nI think everyone is allowed a little leeway in their teens",
            "I hope you know how difficult it is to take a hard look at yourself, recognize your screwups, and actively try to make changes. I've met people two or three times your age who can't do it, so good for you. You are lucky to have people in your life who will tell you the hard truth because they love you, but the fact that you are willing to listen and work on yourself says so much about you and the life you have ahead of you. I wish you all the best!",
            "Recognizing when you have messed up and turning your behavior around is one of the hardest things to do in life! You should feel good about the changes you have made and how you have been working to think more about other peoples' feelings. This update really warms my heart.",
            "man you're lucky to have someone who can check you like that. be thankful! and sounds like you're really taking his words to heart!",
            "Not to diminish your end of the issue but your brother sounds like he'll understand once you're over this phase. To elaborate on phase, being an asshole gets a point across for now that you'll fogure out an alternative and more efficient method for soon, by my assumption. It's hard and i don't doubt losing your father is unparalleled but your brother sounds cool and you're on here giving a fuck so you guys got this. You sound like a good fam",
            "Aww this is so fantastic! Good on you for changing instead of being defensive. Hope your relationship keeps thriving!",
            "That's awesome man. With family (as long as things haven't gone toooooo far), you'd be surprised how forgiving people can be if you genuinely apologize and change your behavior. In families we all see everything about each other — the good and the bad. Part of the frustration when you're angry with family is knowing how great a person can be when they are at their best and not getting that from them often enough. That lingering feeling that it \"doesn't have to be like this,\" but that it is like that, fuels that distance.",
            "Damn. Both of your posts made me cry, I can't imagine the amount of stress you both are under. I don't have much to say, but super happy for the both of you that you worked it out. That was very mature of you.\n\nSometimes grieving affects us in many different ways. Please remember if you're ever in need of help or feel like you've got too much on your plate, therapy is a good option. \n\nBest wishes to you both!",
            "Perhaps this can be a lesson for you and readers. \n\n\nThe is nothing that is ever a good excuse for being an ass to everyone in the household",
            "You could tell from your first post, because you were so clearly able to see that you messed it badly and it was on you, that in fact you are a good person deep down. As is your brother to do all those things for you, care enough to call you on your shit, and humble enough to accept a genuine apology.\n\n&#x200B;\n\nYou all, deep down, seem like wonderful people. I'm sure your Mum is very proud, and your dad would be too",
            "That’s so cool that you’re doing this and that you are able to reflect on these thing. Good for you! Good job.",
            "Feedback is a gift.  Letting you know about what you are doing is a huge help in life.  Remember to eventually thank him for pointing this stuff out to you.  \n\nCongrats on being able to recognize the truth and even more so on being able to apologize and grow from this experience.",
            "You handled this situation with maturity. Self-reflecting and making adjustments based on that is an invaluable skill. Good for you, and good for your brother for having a conversation that lead to a great opportunity for growth. Keep it up, you're going to go far.",
            "Changing your behavior can mean so much and make you so much happier as a person!\n\nIn elementary school, I was harrassed specifically by boys, but there were a couple girls who also treated me like shit and it gave me this pisspoor temperment where I would literally smack people's chests or arms if they got too close to me.\n\nI moved for middle and high school, and was not harrassed at all, but I was still very explicitly defensive and tired and struggling, and I realized within a few months that I didn't know why I was still responding that way; I didn't want to hit these people.\n\nEventually, a boy my age showed me platonic affection and I realized that I was really, really touchstarved for platonic love. My mood shifted entirely to be more compassionate and considerate so I could maybe get more hugs from people.\n\nI'm proud to say that the habit is broken, and I'm still giving hugs to anyone who wants them, male or female.",
            "Glad to hear this outcome. You are not alone in having to unlearn being an asshole as a teen. This is a huge push you've made towards being a kind and mature person both now and in the future. You will look back on this period in your life as the beginning of you truly becoming the person you are destined to be. Reminds me of my own teenaged years. Honestly tearing up a bit.",
            "i did the same thing when i was around that age. my dad pretended to not notice me being an asshole, hoping i would get it together myself, but after making my mom cry, he sat me down and gave me a similair talk that you got\n\nhe listed every asshole thing that i had done to my mom (not even including the things i did to my brothers), and then told me the aftermath of each of those actions, e.g., stopped eating, couldnt sleep, questioned her parenting. it was very tough to hear, and i couldnt look him in the eyes. i knew i was being bad but i guess i didnt really care\n\nthat talk forever changed me. in the moment its easy to justify your actions by focusing on their mistakes i think that sometimes you just have to hit that breaking point where it all hits you. i went through the same thing your brother did with my sister and it wasnt until i stopped talking to her that she realized how much she was fucking up too\n\nreally, your situation wasnt out of the norm for a teen but when you threw your father into it, it was taken to another level. its good that you were able to fix it. i know stories where they werent able to, and they never got as close as they once were",
            "im really late so will make this short and sweet and hopefully you will see it, we can make mistakes worth making if we learn something from them.\n\n i think this will really help both you and those around you in the future and frankly you sound like youve already grown from it so good for you for being so rational and mature about it.",
            "You know what, it doesn't matter how old you are, we all make snap judgements and say things we don't mean at times. I think you sound like a very sensitive and close family. It's wonderful that you can all be so honest and caring with each other and that at only 16 you have shown a wisdom and maturity alot of people will never achieve. You managed to turn an awkward situation around, you were genuinely sorry and you made an effort to change things. I think any dad would be very proud of this family.",
            "Kudos to your brother, remembering he is your big brother first and foremost, not just a friend.",
            "Try to be nicer to him and work your relationship up again",
            "Life is so hard my dude-I’m glad that you and your brother are communicating. Grief isn’t easy to navigate. Good luck with everything.",
            "I’m so proud of you that you were able to right your wrong and that you took difficult critique to heart to make a change. Your brother is very special and I am so happy that you both have each other in the strong relationship that you have-beautiful to read",
            "I'm glad to hear you're growing as a person. Most adults haven't grown into better people, I'm proud of you too. \\*hugs\\*",
            "Sounds like you did a shit load of growing up.\n\nSometimes in life your mistakes can be exactly what you need to get you to the next step.\n\nIf you had not said those things to your brother you may have continued to be that arsehole for another few years instead of a functioning person others want to be around.",
            "I’m so late to this thread, but I wanted to commend you for doing the right thing here. Grief manifests differently for everyone, and losing your dad right when you were hitting adolescence likely had a bigger impact on you than you think/thought. I went through some family-related trauma/loss when I was a couple years older than you are right now, and it turned me into an absolute asshole for a year or so, specifically to the people I loved the most - because they were safe targets, I knew they would never leave me. Doesn’t mean it didn’t harm my relationships with them, though, and making amends was so hard. It took a lot of courage to reach out to your brother the way you did.\n\nI don’t know if you went into therapy after your dad’s passing, or if you’re currently in therapy, but I encourage you to look into it if you haven’t.(There are a lot of online options now, which I’ve heard are a fantastic starting point if you’re not sure about going into someone’s office and sitting on their couch.) You gotta keep doing that hard work to make sure your grief doesn’t turn you into someone you don’t want to be.",
            "Let me do your TL;DR for you\n\nI was a nigger but my real nigger came through and now I'm a real street nigger",
            "Reading your first post I do think you have a problem with alcohol. I may not be normal but in my circles it was highly unusual for people to have been drunk 3 times by the time they were 16.",
            "A timely apology is a wonderful thing. So few people give apologies as if it weakens them to admit a fault.",
            "It takes a lot of inner fortitude to not just apologize but actually mean it. As well as listening and taking what you were told to heart to make changes. Good job.",
            "Aw that’s great. Keep it up. Being a teenager is rough and losing a father is too. However it’s not an excuse. Sounds like you have a honest and supportive family.",
            ">someone advised me that i write my brother a letter apologizing, which i did.\n\nI am so glad that you did.  Writing it down was good for you and him.  He will keep your letter forever as a reminder of how important it was to you to make up with him.   It's so good to hear that the two of you are true brothers again.",
            "You're in a good spot, man. Learning the difference between when you're being snarky/sarcastic and when you're being mean is a lesson that a lot of people don't learn until they're older, if they ever *do* learn it. It sounds like you have good people around you. Keep it up.",
            "OP you’ve done more than what some adults are able to do - you’ve reflected and changed for the people you love! We are all so very proud of you, and I’m sure Chris is too.\n\nOur actions, not our words or intentions, determine our character. You’re on the cusp of manhood - time for you to decide who you want to be.",
            "Hey, I just want to say its great that you're adjusting your attitude to please those around you but if you feel you had genuine reasons to be upset or if you are sad on the inside and just putting on a front then speaking to a therapist or school counselor is not a bad idea. I'm not judging you but honestly alot of the time young people myself included and im 27 need to vent out their frustrations, the problem alot of the time is finding the proper outlet to focus that energy. I hope you find yours soon and I'm sorry to hear about the loss of your father.",
            "Good for you being mature enough to hear this and your brother is absolutely right, teenagers should be expected to suffer the same social consequences as everyone else. It's not like anyone wakes up 18 and decides being an adult now applies to them and they'll do a 180 on their mood and selfishness. I'm glad your brother was open and honest and you guys were mature enough to settle differences. This situation will go a very long way into your adult life.",
            "Dude good on you for apologizing, and good on you to recognize that your behavior was wrong and hurtful. I do think that a lot of it has to do with you being a teenager, and I'm not sure if you fully appreciate what that means, but it's likely (and you might not believe me when I say this) that your behavior will mellow out as you grow. I was a complete dumbass as a teen, most of us have been. If you think you're regretting your actions now then wait till you're like 21-25 years old and you get like a flashback of your past actions and just embrace the amount of cringe and regret that it brings then.   \n\n\nAnd it's great you've worked on your attitude, most teenagers I know don't do that. My little brother was an asshole until he turned 20.",
            "Sounds like you did some growing.  Congrats. I know of grown adults who don't take criticism as well as you did .... And you also went to him as an imperfect human asking for forgiveness for what you did wrong.... That was very mature.\n\nKudos to you for not being stuck on stupid.  All we have is each other. We're stronger together. :)",
            "The beginnings of wisdom.  \n  \nYou'll get there dude. Keep doing your best.",
            "You did well. It is hard to own up to a mistake, but you did it. And you were mature about it. Some people would never back down from a mistake, regardless of age or maturity. They would double-down on it and make it worse and worse. You did the right thing, and now you are seeing the benefits. \n\nWe all have these moments here and there, and I am glad you resolved yours. Well done.",
            "We've all been there. Somehow it still amazes me how dumb and vindictive teenagers can be, but then I think back to myself at that age and realize I don't have a right to say anything.\n\nIt's great that your brother talked to you about this and that you listened. Especially at your age. Many people don't get that reality check until their 20s or never get it all. Glad you've started the journey of self-improvement!",
            "i think him being older he should be able to have enough insight not to take what you say seriously,well that's if his mature...because you are a teenager and going through puberty !",
            "You changing yourself so your brother finds you decent to hang out isn’t the best move to make. Your dad died. That’s traumatic and awful no matter what age it happens. Feeling like you need to change and adjust how you grieve so your family will still be a part of your life isn’t okay"
        ]
    },
    {
        "post_id": "464jtx",
        "author": "peeekaboo1",
        "title": "[UPDATE] My [22 M] girlfriend's [21 F] dad bought her a 10k watch for Valentine's Day.",
        "url": "https://www.reddit.com/r/relationships/comments/464jtx/update_my_22_m_girlfriends_21_f_dad_bought_her_a/",
        "score": 3099,
        "num_comments": 186,
        "created_utc": 1455656247.0,
        "selftext": "I was in a really tricky situation and was feeling doubtful about myself, and I'm so thankful all of you encouraged me to continue with my Valentine's Day plans because everything went better than expected. [Here is the original](https://www.reddit.com/r/relationships/comments/45hogk/my_22_m_girlfriends_21_f_dad_bought_her_a_10k/)\n\n\nShe got ready as usual in the morning, and hopped on over to our favorite breakfast spot. when we were done, she said something like, \"this is so thoughtful, how wonderful we get to spend this morning together. thank you, thank you\" which got me all excited because I knew she was expecting to go home afterwards, but SURPRISE! We get in the car and head further north. she was all like, \"what's happening?\" and when we stopped at ANOTHER coffee spot, she burst into laughter saying, \"oh my gosh are you serious MORE coffee? you really want to spend the day with a lunatic?\" to which i respond, OF COURSE.\n\n\nand when we get to seattle she's still giddy. we live close to seattle but hardly ever get time to just walk around and enjoy seattle because it's normally business, or we're just too busy ourselves to have a leisure day. we go to little shops and look around and she loses herself in some kitchen shop for a good hour and a half (seriously). and once again, she's like, \"wow, this has been incredible thank you for this amazing day\" thinking we're about to go home, and that's when I give her the watch! she starts crying and says that this is the most thoughtful thing anyone has done for her. and she LOVES our anniversary engraved into it. she even said, \"ah! I don't want to wear it because I don't want to hurt it!\" but put it on anyway. in fact i feel like she was flashing it off :) which she never does with any jewelry.\n\n\nand then, we were going to go to dinner but the restaurant goofed and didn't write down our reservation. she wasn't upset at all and suggested we go to *Chipotle* for our v-day dinner! so we went and she loved it because she said it was the perfect day where she didn't have to be \"on\" or \"too formal\" and \"boring\" with her family. she then laughed and mentioned how weird it was that her dad got her a watch and so did i, and that she's so grateful for me and our relationship & not to be intimidated by it all because she prefers \"this way of living\" (relaxed? i guess?)\n\n\nanyway, we got home later than expected, and she got me some sort of couples coloring book, a handmade card, and a batch of cookies. we colored and ate cookies until she fell asleep... SMILING. she fell asleep smiling. I'm the happiest man alive. Thank you Reddit for telling me to continue with my v-day plans. i never would of went through with it without everyone encouraging me. it makes me laugh because after everything was said and done, she said \"we spent the entire day together and it cost *nothing*\" haha. \n\n   \n**tl;dr**: went through with v-day plans, everything turned out better than expected. she loved the watch and the entire day. thank you to everyone who told me to go through with my plans. ",
        "permalink": "/r/relationships/comments/464jtx/update_my_22_m_girlfriends_21_f_dad_bought_her_a/",
        "comments": [
            "> where she didn't have to be \"on\" or \"too formal\" and \"boring\" with her family.\n\nHonestly there's something to be said for this. A lot of the time people will have masks or personas they have to use around family or specific friend groups, to help fill the niche or expectation they inhabit in that sphere. It can get taxing to have to keep up that image day in and day out.\n\nSometimes it's nice to just relax without any airs needed. You don't always have to be funny or prim and proper or what have you. You offer her a chance to just be her, and be appreciated for it. That's invaluable.",
            "Nice update!\n\nAnd as with most jewelry, you cant really have too many watches.",
            "This makes me so happy! And it's yet more proof that money isn't everything. A lot of people who grow up with unlimited amounts money around them often find security in us regular folk because we learn the true value of money and enjoy the smaller things in life. Not everything has to be flashy and expensive, and those who understand that are worth your time. ",
            "This is adorable :)",
            "You two sound incredibly sweet. Cheers for the happy update. I'm glad you went through with your plan.\n\nEven though you had a limited budget, it's clear that you put a lot of thought into your plan. Being thoughtful like that is the foundation for real romance, OP. She's going to adore the crap out of your watch because of the thoughtfulness you put into it and the memories of the lovely Valentine's day that go with it.",
            "/r/mademesmile",
            ">  thank you to everyone who told me to go through with my plans.\n\nYou've learned the incredible power of *actually knowing another person*, and you've used that power to make that person *happy*, which is an act of great moral courage, and yet also the easiest thing in the world. What could you ever have to fear from someone else's *money?*\n\nNothing.",
            "Great update OP. She sounds like a great girl. Keep up the good work!",
            "Totally doing the Kermit The Frog arm flail of happiness. So glad this worked out!! :)",
            "I didn't read your first post, but I want to say you made her day amazing and you should feel like an amazing boyfriend.  A lot of people assume the girl only wants huge, expensive dinners/things on Vday, but just spending time with the person you love can be the best gift ever. ",
            "Congrats! You did exactly the right thing.\n\nAs someone who is in the position of your GF's Dad (middle aged, with two daughters and reasonably liquid) the greatest thing you can give your GF is attention and thought, not material goods. This is especially true when someone has been fortunate enough to grow up in a well off family.\n\nI've been with my wife 16 years. During that period I've gone from a struggling student to a successful business exec and the things that she appreciates the most are the small things: home cooked dinners, hand made cards, flowers from the garden and the like. Don't get me wrong, she loves an occasional grand gesture (especially shoes and handbags!) but she would be incredibly angry with me if I bought something that I (more correctly we) could not afford because I thought it was expected by society. She love things that show that I have thought about what she wants and that's it.\n\nIt works both ways too. The best gift she's ever given me was a coffee mug with our daughters' hand prints on it. I fucking love that mug and it could not have cost more than 20 bucks but it's one of the first things I would pull out of a house fire.\n\nCheap does not mean worthless and expensive does not mean valuable. This is something that many people learn too late and it looks like you've got it correct right out of the gate.",
            "Haha, it's so hard to get a reservation in Seattle on Vday.  I just usually cook dinner at home.  Though we did go out to Bramling Cross and sat at the bar fine.",
            "I'm not crying, *you're* crying!\n\nSeriously, OP, this is so lovely. Time spent together doing fun, casual things is my favorite, too. You gave her some awesome memories and I'm sure she feels very special!",
            "This is a nice story, happy things are going well.  But this seems crazy to me.  Why are you so stressed out about potentially spending $500 when all she got for you were some cookies and a coloring book?  Like, either stop worrying about this kind of thing, stop spending money when you should be spending time.  There's no way you can ever compete with her family money, so thoughtful counts.  Try custom etsy gifts in the future!  Good luck.",
            "That's awesome!  Sounds like you have a keeper, don't mess it up :)  \n\nYou delivered what she wanted:  a day where she can be \"her\" and not have to fake things for her family.  I'm guessing that's why she cares for you...I'm guessing you don't look at her as some \"rich girl\" or judge her for being one and you're down to earth and real and she wants that.",
            "Cute :3\n\nPS- Am I the only one confused as to why the dad bought her a valentines gift?",
            "Awesome update. \n\n",
            "Awwww this is disgustingly cute. Good job OP. ",
            "If she enjoys herself and can spend hours in a kitchen store, you should take her on a date to the IKEA store in Seattle.",
            "good.  I've had people buy me expensive things and just give it to me.  Its kinda like \"that's nice.....ok...\"  But when people plan a day, try to make me happy by doing more than throwing money at me, it's such a happier feeling.  I'd rather feel loved than have jewelry.  You did good!",
            "So sweet!! Glad it went well :)",
            "She sounds really great.  Don't let her go!",
            "You are a lucky man.",
            "Awww",
            "also, people have more than one watch, just like they have more than one of other types of jewelry, shoes, jackets, bags, etc.",
            "Read your first post OP. Was going to say something along these lines and then I forgot. \n\nTruth be told, you sound like you hit every nail on the head. You guys are both lucky to have each other. Falling asleep smiling is like, sickeningly cute. Congrats!",
            "You two sound so sweet that it makes me sick! In a really, really good way! I'm glad it worked out!",
            "Fuck yeah man! She and you sound like a keeper. Best of luck!",
            "Nothing about the watch, but I think you should take her out to the restaurant you were supposed to go to sometime this week. I don't know why, but that struck me as something it would be really nice to do. ",
            "Stop chopping the onions!!",
            "As someone who grew up I guess upper classish and was just gifted a $400 pre wedding gift today, yes I'm very thankful and grateful! Then my roommate's sister came in with another present. 6 REAL EGGS FROM HER HOST FAMILY'S CHICKENS with different colors and spots! She knows how bad I want backyard chickens. I appreciate and love both gifts. The eggs just got a stronger reaction even though they were basically free. It doesn't matter the price point. I guess my point is that money doesn't always matter.",
            "Aww. This was such a joy to read! lt was almost as though I could *feel* her happiness. So glad everyone encouraged you to do it. What a wonderful date. Happy for you.",
            "I'm 45. When you said eat cookies and colored I swear got so excited. That sounds awesome ",
            "Her family buys her affection but you didn't have to. That means so much more to her, believe me it does. ",
            "Marry her OP. Marry her yesterday. ",
            "So glad to read this update! Sounds like you had a fantastic day together.",
            "Yay! You are both amazing!",
            "You're living the dream, my friend! And so it your girlfriend! I'd love a boyfriend that would colour with me",
            "Damn, this post made me lonely! Awesome though, I'm glad it turned out perfect for you guys!",
            "You know you have found \"the one\" when she suggests going to Chipotle... ON VALENTINES DAY!",
            "Awesome update! Seattle is so much fun to just wander in.  If the kitchen store was Sur La Table (right outside Pikes Place), it's easy to spend hours in there!  :) Good job OP. Sounds like a perfect day! ",
            "Props to you man. \n\nThis just goes to show, when it comes to a woman's heart the ones worth keeping will place thoughtfulness in higher esteem than cost of a gift. ",
            "Nice work playa!",
            "I hope y'all went to the Chipotle in downtown Seattle because the one on Broadway is just terrible. :)",
            "omg, you're awesome and she's awesome and together you're great and awesome, and happy valentine's day to you both. ",
            "Man you guys sound cute.",
            "AWH! This made me really really happy! I'm so glad for you and your adorable relationship and Valentine's Day!",
            "It's good to see that this turned out well.",
            "So sweet",
            "This is such an adorable update, you even ended the night coloring and cuddling that's some amazing relationship you have there to just enjoy the simple things, good for you man! ",
            "My god this is the most adorable update I think I've ever read here. Good for you sir. And good luck!",
            "go you!",
            "Gosh y'all are sweet—you had me at 'lunatic!'  \n\n I think it's a sign that you and her father both got her watches :) There are too many times to count that I've cooked something and my mother-in-law calls me that night or the next day telling me, 'Yella,' come pick up the food she cooked for us—the same thing I just made! ",
            "Yay! Happy ending, thanks for the update!! ",
            "I'm so happy for you. It sounds like a wonderful day.",
            "Yeay for love and reasonable people!",
            "This made me cry. So happy for you bro",
            "So when is the wedding? ;)\n\nSeriously, she's a keeper OP. ",
            "This made my day to read; you both sound like you love and appreciate each other so much! Glad you had such a magical day!",
            "Warms my heart :')",
            "You and your girlfriend are super cute together and I'm glad everything went smoothly for you guys! ",
            "> she got me some sort of couples coloring book,\n\nThis is a big fad atm, it's therapeutic.",
            "You guys are so cute omg",
            "Cute as fuck, OP. Congrats :)",
            "She's always going to be \"Daddy's Little Girl,\" so you should expect things like that to happen from time to time.  Don't worry about it, though, because if she's worth staying with then she'll be much more impressed with the time and effort you put into gifts than the price tag of the gift.  \n\nSeriously, if more guys understood that they'd be doing themselves a massive favor.  It's not the size of the gift, it's how you give it. ;)",
            "That's so cute! She sounds really down to earth, too! Don't try so hard to impress her financially from now on. Impress her with something that only you can do!",
            "Sounds like she has her priorities right in really appreciating your gift and the day that you had together. \n\nAlso am I the only one wierded out by her dad giving her a 10k watch? When did valentines become a day for father's to treat their daughters like Valentines???",
            "You are one of those couples where you both are perfect for each other. Just make sure \"life\" doesnt happen to you and enjoy many decades of happiness :)",
            "That is one of the nicest updates I've ever read here. She's a keeper.",
            "'she fell asleep... SMILING'\n\nTearing up like a wuss rn",
            "Your lady is lucky to have you. So happy this worked out!",
            "Had Nachos and Wings for our valentine's day dinner ourselves. Casual \"dining\" for valentines day when everyone is expected to be doing something fancy and spending lots of money is much more relaxing! ",
            "Damnit, I'm a grown-ass man tearing up in front of his computer because of someone else's love story. Way to go, man!",
            "This makes me happy. And hella jealous!",
            "Go to hell you people with your happy lives. Kidding, this made me smile so much my mouth is hurting now. Great way to go, wish you guys a happy life. ",
            "What a sweet update! ",
            "Me and my husband had Chipotle for Vday, too! We had free burrito coupons. :-)\n",
            "She is a wonderful lady. Tell her reddit thinks so. :)",
            "\"we colored and ate cookies until she fell asleep... SMILING. she fell asleep smiling.\"\n\nCongrats, bro!",
            "Great update. Sounds like you got yourself a good one. Reminds me of my wife, loves time together and the little things more than anything. \n\nWell done my friend. Best of luck with you and her. ",
            "omg this made me shed a tear. this is so cute! good job!",
            "Sounds like your gf wants love from you and not much more. It also sounds like you have a lot of love to give her. What could be more perfect? She may be accustomed to receiving expensive gifts from her father instead of love and affection. We all know which has more value, don't we?\n",
            "Awesome to hear man. I was hoping to see an update to this and it was a nice update indeed.\n\nyou get an upvote",
            "I hope your girlfriend gets terminal cancer by the time she is 25 xx ",
            "Ok so the closer I get to my wedding, the more sappy and emotional I'm getting (T-100 days and counting).\n\nThis update made me tear up a little :)",
            "It baffles me that people can wear something that's worth 20 times what my car is on their wrists. ",
            "Awww! Sounds like her love language is quality time :).",
            "just in case you were wondering, there is never such a thing as too much jewlery ;) Unless you had bought her a watch that looked identical, chances are she will love both and wear both at different times.",
            "Is her dad bill gates?\n\nI find it incredibly strange her FATHER got her ANYTHING for v-day, nevermind a $10k watch.",
            "It's 2016... who wears watches anymore?"
        ]
    },
    {
        "post_id": "g5ibwx",
        "author": "None",
        "title": "My(23M) older sisters are trying to control my life and ruin my relationship",
        "url": "https://www.reddit.com/r/relationships/comments/g5ibwx/my23m_older_sisters_are_trying_to_control_my_life/",
        "score": 3093,
        "num_comments": 768,
        "created_utc": 1587486228.0,
        "selftext": "I’m 23, the only son in my family, and I have 3 older sisters(27, 29, 30). They are all very opinionated, on everything. Right now they’re main focus is me and my girlfriend, of 4 months. They barrage me all day with texts and phone calls about how this woman isn’t right for me, flaws they see in her, advising me to break up, on and on. It’s weird, whenever any of them dated a guy, I never said anything, but, whenever I date, oh my god, stop the presses.\n\nIn the past, as it relates to their “ advice”, I’ve tried an “ I can handle myself, thanks though” approach, they don’t listen. I’ve tried, “ stfu and go away”, they get offended and but continue advising.\n\nThey hate this woman(23F) I’m with now. Personally, I’m the happiest I’ve ever been in a relationship. She’s more outgoing and talkative than women I’ve dated in the past, very pretty, very bubbly, very fun. They think she’s shallow, unintelligent, and image-obsessed, and I rebuke these claims all the time with them.\n\nI just want them to stop with the snide remarks and insults. When I try and stop it, whether it’s in a text thread or call or video chat or whatever, someone’s quick to remind me of the “pecking order” and told that “they have my best interests in mind” and want to see me with the “ right girl” aka one they approve of.\n\n&#x200B;\n\nTLDR: How can I get my older sisters to accept who I'm dating?",
        "permalink": "/r/relationships/comments/g5ibwx/my23m_older_sisters_are_trying_to_control_my_life/",
        "comments": [
            "I'm going to give you a \"Dear Abby\" kind of answer:\n\nYou don't have to listen to this at all and the solution is to tell your sisters you don't want to hear it. Whenever they start sending you texts, ignore and delete them. Whenever they call, the moment they start digging into your GF, tell them, \"I said I won't listen to this. Thanks for calling.\" and hang up the phone.\n\nIf you're in their presence and they start this, tell them, \"I told you I won't listen to this.\" and leave the room. If they persist, leave the house.\n\nThis becomes a lather, rinse, repeat, until they finally get the message. If they won't stop, no matter what you do, tell them you'll break all contact with them if it continues, and mean it. They'll get the message the more you do it.\n\nAnd if you have to make the hard choice to cut them off, hopefully, they'll realize they're pushing you away and apologize.\n\nI just can't get over how much they're bombarding you with this. It's almost pathological. I wouldn't even call it protective. It's just plain nuts.",
            "Do you live with them? If not just block them until they learn to keep their opinions to themselves.",
            "Tell them that every time they say anything about your girlfriend, you put a dollar in a jar. That's currently your engagement ring fund.",
            "I sent my oldest sister a text, she is engaged, laid out my boundaries, basically that the more they bring her up, the quicker they're going to lose me, said that their problems are their problems. I'm old enough to handle my own stuff, and that their comments are rude, their advice is unwanted. Threw in \" what if I said rude things about your guy?\"\n\nPer her response, I'm spoiled, rude, ungrateful, I'm betraying my family, and that the comparison between her man & my girlfriend isn't accurate because, her man has \" actually done things in life\"",
            "Hello sisters,\n\nI am sending you a message to formally ask you to keep yourself out of my private life. I am a grown man and I am capable of making my own decisions. Your problems with GF are just that, YOUR PROBLEMS. You are older and I understand that you think you know what is best for me. You do not. Full stop. It is time to let me make my own choices and decisions, and I am NOT open to your advice when it comes to my love life. I would however like to thank you. Your constant attacks on GF, and my constant need to defend her, have helped to highlight all of the things that I appreciate about her. \n\nMoving forward I am not interested in your advice and any further attempts to force it on me will result in you being blocked until you can respect that I am an adult my life decisions are MINE to make. \n\nI love you all, but I have had enough. I am not open to discussion about this effective immediately. If you cannot respect my right to be an independent adult then we have nothing to discuss.\n\nOP\n\nEdit to fix: spelling",
            "Short answer is that you won’t be able to get your sisters to accept who you are dating.\n\nYour sisters are not reasonable rational people and you cannot interact with them like they will respond to you kindly.  They have told you they are on top of the pecking order and you are the bottom and must obey.  They have essentially told you that they “love” you so much they must abuse you.\n\nThe only way to deal with people like this is boundaries and consequences.  You have told your sisters to stop commenting on your relationship with girlfriend.  Now you need to enact consequences when they do not comply. \nStop responding to your sisters when they start commenting on your relationship.  Do not respond at all to any negative comments other than “l will not discuss this with you.  If you continue I will not have contact with you for 2 weeks.”  Every time they bring up girlfriend you cut contact, after the first time and they still do not stop abusing you then you increase the time out to 4 weeks.  Then double it again if needed.\n\nSame for any video call or in person visit.  The moment they start with comments you tell them to stop.  If they do not you leave and put them in a time out.\n\nI am sorry your sisters try to control your life.  They don’t actually care for you, they just want to control you.  If they actually thought you were in a bad relationship they would have never brought up the “pecking order”.  They gave themselves away by saying that to you.",
            "Block them on social media and have you Gf do it too. They need to go on a information diet until they learn how to behave. Tell them that as well.",
            "A lot of people are pretty passive that’s how you should handle it, I’m a little more assertive honestly. My sisters tried this I made sure to tell them to shut the fuck up and mind your fucking business, I would tell them every time you start commenting on my girlfriend or my relationship I’m going to do the same to yours and I’m not going to be as nice. It took About a week, but after hammering them hard about their insecurities they stopped\n\nI got a feeling they’re jealous of how she looks, that’s usually the first time your sisters comment and if they are still stuck on how she looks it’s definitely out of jealousy. Maybe start focusing on that aspect.",
            "You’ve stated your boundary, but you’re not enforcing it. The next time one of them starts on about your girlfriend, state, “I will not tolerate anyone insulting my girlfriend. Change the subject, or I’m out.” If/when they continue badmouthing your girlfriend, you leave. Whether that means walking away, driving away, hanging up, disconnecting, or just putting your phone down. Leave the conversation every single time they start again. No exceptions. You need to send a crystal clear and consistent message that you absolutely will not put up with their behavior.",
            "Pecking order? The fuck outta here with that shit. You're a grown ass man and you need to act like one. You know, by telling mom.",
            "Best thing you can do is 100% ignore it. When they bring it up, say I don’t want to talk about this. Don’t reply or give them a reaction. Remove yourself from the situation if they don’t stop, and eventually they’ll get bored",
            "Like others have said, set boundaries.  Just send them an automated neutral message, \"Thank you for your concern but it is inappropriate to be commenting on my dating life.  Thank you for respecting my boundaries\", and ignore any messages after that related to your dating life.  Don't engage and don't feel like you have to explain yourself.  That statement alone is enough.\n\n> I rebuke these claims all the time with them. \n\nDon't argue.  Just respond with the message about boundaries.\n\n>  remind me of the “pecking order” \n\nThis is stupid, but don't argue against the pecking order, just ignore them after the boundaries message because there is no pecking order in your life.  It's just you making your own decisions, and they need to respect that.",
            "Is there some kind of strange insecurity here? Is she in better shape than them? My buddy has \"big\" family members, and his sisters used to talk shit about his gf for being very fit and physically attractive. She was also quite smart and humble, very kind, but they kept saying he's an adult and should be dating \"women\", not \"little girls\". They were very cold to her when they'd visit.\n\nJust laugh them off and ignore them. Don't let it get to you, they crave the \"power\" to affect your life. \"Yeah, nah\" is a good one. \"Lol you aren't going to change my mind\". If you treat them like they aren't even worth the effort to text they'll eventually get it. If not then you still get to ignore them. These are toxic people and have no business giving advice.",
            "i think i’ll be drowned in replies but, i had a boyfriend with two sisters like this. they’d text about me in the group chat & make comments about me. talk about me often. it was horrible. One time his mom went so far as to call me a prostitute.\n\nListen, I wished... WISHED my ex had been man enough to stand up for me or just put an end to it all but he never did. \n\nFor your girlfriends sake, tell them next time you won’t be speaking to them. Even if it’s just for a few days! Make them understand they don’t have the right! Bc if your gf doesn’t know yet, she will eventually.",
            "Take care your of your sisters or they might scare off your girlfriend if you don't have a backbone.",
            "It's time to stop engaging in these conversations with your sisters. They can shove their \"pecking order\" right up their asses.\n\nYou should significantly reduce your contact with them, and as soon as they start commenting on your girlfriend, end the conversation, and ignore other attempts at communication for a while.",
            "You can't control what they do, but you can control how you respond. If they text you about her, don't respond. If they bring it up when you are in person, tell them once that you do not want to talk about it. If they persist, leave. \n\nArguing just gives them more opportunities to try and wear you down. Deny them that.",
            "Let me tell you a story my grandfather told me. He married my grandmother and had my oldest aunt. Now, his family hated my grandmother. HATED. There were fistfights. Finally, one day at a family function my grandfather stood up and told his family, \"This is my wife, the mother of my children. She's my family, and if you can't accept it then you're no longer my family.\"\n\nI don't know what the future holds for you and this girl. But you need to stand up to your family. Let them know their behavior won't be tolerated and if they persist you'll cut them out of your life.",
            "OP, I'll just tell you about my aunt who ended up marrying a man with 4 older sisters who controlled everything. She had 3 kids with him and they controlled everything the kids did - where they went to school, how they dressed etc. Now my cousins are all messed up - not one holds a job because they all think they are too good for the world and their aunts support this madness. It's not just this girlfriend, it's your whole life. It's not about getting them to accept her, it's about being confident in your ability to make good decisions for your life. You'll be second guessing yourself whether you end up with her or not. \n\n Draw the boundaries. Learn how to get the respect you deserve. Read books on codependency that will help you break this chain and take control of your life.",
            "Honestly I think you should just stop being so close to your sisters if they treat you with this much disrespect constantly. Go low contact.\n\nThe truth is, even if they are 'right' ( and they probably will be, I mean most relationships end in heartbreak eventually ) their disrespect towards you and the way the try to control you is going to more negatively impact your life than any random break-up.",
            "Pecking order? \n\nThe person at the top of this \"pecking order\" in *your* life is YOU. \n\nI would let them know that from now on you'll be choosing to completely ignore everything they say about your girlfriend. Ignore their texts, and hang up the call as soon as they turn the conversation to your girlfriend. And stick to it. \n\nIf they get nothing back from you, they'll love on eventually.",
            "Some things that might help you deal with bullshit like this is www.CaptainAwkward.com.\n\nThe site gives stellar, actionable advice WITH SCRIPTS.  Highly, *highly* recommend. Don’t forget to read the comments where applicable, lots of good stuff there too. \n\nThese are some great terms to look up and will help you respond both in the moment and overall:  \nDARVO, gaslighting, JADE, love bombing, greyrocking, flying monkeys, FOG, golden child/scapegoat, missing stair, forced teaming, hoovering, sea lioning, extinction burst, narcissic personality disorder (start with the narcissist’s prayer - even if they aren’t narcs, it will help you resist and respond to their manipulation), codependence, and enablement. \n\nBook:\nWhy Does He Do That by Lundy Bundtcroft (he’s written it for the most common configuration he sees in the wild, but is clear it is for any relationship or gender).\n\nGood luck to you.",
            "Strangely enough this is actually something I can personally give you advice on. I'm ALSO the youngest and only male in the family with ALSO 3 older sisters. I also had this problem for a while as not only my sisters but my parents weren't accepting on who I was dating and got constant remarks and even online stalking of my girlfriend. Here is how I solved it.\n\n&#x200B;\n\nNow before I start. I want you to understand that later in life if you really want to take your relationship seriously is that your girlfriend will be beside you and know you better than your sisters do/will. My tactic took me many years, but the way I did it was by proving my Independence. At 24 I took a job in Alaska and left my home behind. I basically forced myself away from the family, after me leaving and disconnecting they started to see me on a different light. After I have returned I found out that my family APPROACHED my girlfriend for a way of talking to me while I was gone. A few months later I moved out and a year after I brought her in to move in with me. \n\n&#x200B;\n\nThe way I solved it was by focusing more on my relationship and my self independence over the family. They started to understand that I wasn't going to dump my girlfriend and that I was actually happy with her. It did take time, and yes it was very awkward but in the end they understood that I was happy with her. They also started to understand that I'm okay with not speaking to them or even caring much about the family and to keep me around they actually started to speak to me, and once I heard anything negative, I just would hang up the call or \"nope\" out of the conversation.\n\n&#x200B;\n\n&#x200B;\n\nAnyways, stay with your girlfriend. No matter what they say even if they accept her or not. Stay with her and maybe they will come around but even if they don't it won't matter as you will still be with your girlfriend. Good luck out there",
            "Your sisters are very opinionated and need to actually mind their own business. It is you dating your girlfriend, not the other way around. They honestly sound controlling and don’t care of your well being if they didn’t say the “pecking order”. Like all the qualities I’ve read of what you have mention in the comments, doesn’t make her any different than any one thats okay. You don’t go around judging their boyfriends/fiancés/husbands, so why should they! \n\nBut definitely think about distancing yourself from them for a while. They need to learn that it’s your life not theirs. Also if they cared about you as they say they do, they would actually try to get know her instead of full on judging her and try to see what you see in her. But also, I say just take into consideration, look into why your sisters are pointing out these things about your girlfriend. I hate to say it but sometimes sisters have a weird tuition of things not seeming right.",
            "Think all the advice re shutting them down every single time they try is good, but also letting them know how hurtful and rude it is also. Tell them it’s bullying, it’s disrespectful, it’s nosy and it makes you not want to have any sort of relationship with them if they continue to butt into your life. Let alone how shitty it must make her feel. Say that and then continue to say “I’m not talking about this and hang up” or not reply to messages etc. \n\nI see you say in another comment your dad likes her but your mom is more on the sisters side. I think you need to get your dad involved and try bring your mom around, as she’s obviously not as crazy as your sisters and knows her boundaries. They can have rules like no talking about GF when in their house etc, or something to ease the burden on you. It will be good to have them in your corner, they are a bit more removed and must know how intrusive the behaviour is",
            "If you're truly happy and there are no red flags to you (which you should take time to reflect and ensure you're not overlooking any), then you have to stand-up for yourself, your girlfriend, and your relationship.\n\nYou can be polite but firm telling them that you appreciate that they care but you've taken time to step back and assess the relationship and see no immediate red flags and intend to continue the relationship. They can either continue to act in the same manner and you'll limit your relationship with them or they can accept the relationship and you'll maintain your relationship with them.",
            "*internet hugs and external validation*\n\nThey love you, they say, so they don't want you to be loved by anyone else and they remind you of the pecking order. Let me guess, they are on top? They yell and make you feel like crap. That isn't love. I am so sorry. Some families sort of designate a member to be the spare tire; useful when necessary but needing to be secured away otherwise. It sounds like that might be your place. It took me more than half a lifetime to recognize that in myself. Believe me, it is not a good road to go down.\n\nWhat if you took two weeks and didn't talk to them? Two weeks isn't that long, but it will give you a sense of how they really are. Do they calm down? Do they go sulk? Do they go into Crazy JustNoMode? How do you feel when you ignore a call (sad? scared? anxious?)?",
            "there are two possible answers here 1) they are right; 2) they are jealous/misinformed/biased.  Either way you should do 3 things  1) listen but distance yourself- see what insights they have and then take their insights and make an attempt to follow through to see if their criticisms have any merit; 2) get to know her friends and family if she is of high moral character that is really important; 3) use protection if things have progressed to that level.\n\nDon't get caught in a situation that you cant handle when you are 23.\n\n  Too many people want to jump to the LOVE CONQUERS ALL screw your family conclusion.  However, women can detect BS from other women better than other men and as a man I know a lot better than other women when a man is full of BS.  Your father probably approves because he knows at that age what fun it would have been to have a really fun girlfriend.",
            "INFO:\n\nHave you ever said anything to make them feel comfortable talking about your gf this way? (Like discussed her lack of “serious” ambition etc)\n\nTell us more about your gf and the dynamic and why they may feel the way they do. I definitely think they are wrong. I’d just like more context. Why EXACTLY don’t they like her? What has she done or not done?",
            "OP, after having sifted through majority of the comments, I want to give you an alternative point of view as I've been in a similar position. If your older sisters see that you are totally blocking them out, they will persist even more so because they will assume you are being blindly stubborn. Instead, of telling them you will not listen to them, tell them to provide straight to the point reasoning for 'why she's not good for you', ask them to be concise and bring up exact examples of what she may have done or they saw in her, and why their opinion is such. Let them know that if their opinions are valid, you will take it into consideration as a potential yellow or red flag; however, if their opinions are not grounded in actual events and are just 'vibes', you have no interest in entertaining them and you will stop listening all together.\n\nI think this let's your sisters know \"I hear you, but I'm my own person with my own opinions and will do what I think is right in the end\"\n\nEdit: spelling",
            "TLDR: Maybe include some specific examples on what they say, this presents as \"my sisters don't like my girlfriend because reasons\". It lends the appearance of immaturity on both sides. Talk with your sisters, find out why they have these opinions, and if they truly are invalid seek resolutions and be prepared to accept that their opinions will never change.     \n\n\nI feel like specific examples need to be included in this, while i'm not certain what type of people your siblings are as the eldest sibling of my family I relate to their view points more without any sort of examples. I understand the urge to protect the younger siblings even if they are adults who can make their own choices. The question becomes why do they think she's shallow, unintelligent and image obsessed? Do they see how she treats you and think that she should treat you better?   \n\n\nI know that when you'r in a relationship somethings become normal and you don't question it. A red flag through rose colored lenses are just flags. Im not trying to say that you're stupid or that your blatantly ignoring red flags or that she is giving any. Im just trying to relate to your siblings point of view as well as your own.   \n\n\nIt's been my experience that people tend to present the story that best frames themselves as in the right and maybe examining your sisters reasons for not liking this woman can reveal the root of the problem.   \n\n\nMaybe your sisters are jealous, over protective, or just mean. But have they done this kind of thing before? Do you trust that they only have your best interests at heart?   \n\n\nIn the end a serious discussion is needed, maybe some group therapy, boundaries and consequences but in the end it may not change anything. All you can do is try.  \n\n\nand speaking as someone with estranged family, its not worth estranging your family for a relationship that hasn't even lasted half a year yet. Unless your sisters are truly toxic id advise that you try to maintain the relationship.",
            "Remind them of who has the balls in the family. I hope it's you.",
            "You can't reason with people like that. Emotionally and mentally distance yourself from them. Physically do so too if you can. Potentially block them from your phone and all your social media accounts, or take down your social media accounts. The goal is to stop caring about them and whatever they tell you and to stop being involved in their lives. Also tell them that they're not in control of your life. They may be your family, but they don't get to dictate what you can and can't do. \n\nIt sounds like they're psychologically projecting onto all the women in your life. Psychological projection is to accuse another person of engaging in one's own behavior. Your sisters are shallow and image-obsessed, and therefore think everyone else in the world is that way.",
            "That would make a lot of sense then. If they’re the opposite of them, they don’t have anything in common with her, so they may feel threatened. Or they just don’t know how to deal with the fact that not only are you an adult and your own person, but you’re attracted to someone who is the complete opposite of them. Subconsciously they may feel as though you don’t like them because the girl you like is nothing like them.",
            "[removed]",
            "So I don't remotely condone what your sisters are doing. They are being horrible. \"Pecking order\"?! Really?! \n\nThat being said... it reminds me of an old friend I had who's cousin did something similar about her boyfriend. Hated him, she should break up with him, etc etc. But like... no realtor REASON beyond \"I just know hes no good for you. I am family, I just know\".\n\nTurned out cousin knew boyfriend was into some bad shit, and didn't want to tell my friend. Either to protect her, or to protect himself (the cousin.. ) I am not sure. \n\nIs there aaaaanyway your sisters know something they don't want to tell you? Either to protect you, or maybe because it would reveal they snooped or something? \n\nThe only reason I ask is because you say they were cool with other girls, so it's not like \"no one is good enough for our lil brother\". Its specific  to her. \n\nGood luck!",
            "I could see my brother making this post when I told him that his girlfriend guilt-tripping him about not being able to hang out every minute outside of class was probably not someone he wanted to continue dating because it was resulting in his social and academic life suffering... she ended up threatening to kill herself when he finally broke up with her and getting kicked out of school. Then there was the girlfriend who was long-distance and wanted to talk every day for two hours and wouldn't listen to him when he said he needed to study. \n\nMaybe there's a reason that three women in their late 20s and early 30s all think that the women you choose are bad for you? Or maybe they're all crazy jealous bitches -- we're internet strangers and don't know any of you.",
            "I’m an older sister (26) to my brother (23) and I hated his most recent girlfriend and I made the same mistake of making it known that I didn’t like her... to the point where I alienated him. They recently broke up and I’ve since reached out and he’s been talking to me and hasn’t held it against me at all. I’ve dated guys that my family didn’t like in the past and they took the approach of letting me figure it out on my own which I’m grateful for because this approach that OP’s sister and the one I took just forces the person to stay in a relationship longer than one would (provided the significant other actually is bad) for the sake of proving the family wrong. Unfortunately, you can’t change what you’re sisters are doing OP, so just ignore them the best you can and continue doing what you think is right. But also try to understand why they may think your SO is bad, even if she isn’t. \nThey could just be trying to protect you, not saying their actions are right... but I dunno. You can’t change them, you can only change yourself.",
            "You can’t. \n\nStop trying, stop caring. \n\nMove on with your life.",
            "Is there any chance they're right? Could you be \"love blind\" and don't notice some bad behavior or red flags that they might? I would ask them to explain themselves in detail and really try to listen. Check your girls behavior and see if they're onto something. If you do that and end up completely disagreeing with them, then tell them that. That you took to heart what they are saying and took notice of it, but didn't come to the same conclusion. Tell them to leave it alone from there on out. If they don't, kindly tell them to piss off.",
            "They are probably jealous of how pretty and outgoing she is.\nI know I sound really woman hating but I lived with lots of older aunties and I observed a lot of critics towards pretty girls and most of then were far from the truth.",
            "you tell them you are an adult and know whats best for you, and if she IS the wrong person, then you will know when she proves that to you but she has yet to do anything that shows shes not right for you, now please stop talking to me about this or i will have to stop speaking to you for a while.",
            "Sounds like the relationship I just got out of but my ex didn't do anything. \nHis mom and sisters were/are toxic. I started to resent him for it. When I stood up for myself I was the stupid one. \n\nSet up boundaries or slowly distance yourself. They're petty and toxic and see NOTHING wrong with their behavior. I'd just cut them off tbh.",
            "When you compare your sisters to your girlfriend, is there a difference in social status, economic/financial status and/or education level? It could be that your GF might not be \"fitting in\" due to one of these three?",
            "I doubt they will ever approve a relationship. I am going to make a book recommendation. It is called “never split the difference”. It is all about negotiating with people. I feel like it might help. My reasoning is this. Your sisters behaviour is the “pecking order” is about control. It is not about the girl, it is about their perceived superiority due to birth order and an insecurity I cannot surmise from your post. They wish to infantilized you indefinitely to maintain the status of older=better.   What you need to focus on is not making them like your girlfriend; you must focus on making them respect you.  And I believe you will need to calmly expect and require respect, not to ask for or demand it.",
            "Fuck them. Block them. When they ask why you haven't responded tell them it's because they won't shut the fuck up or mind their damn business.",
            "Ot: Are you from afro american backgrounds?",
            "BLOCK THEM immediately",
            "Where are your parents in this argument? Are they agreeing/listening to your sisters?",
            "You'll decide if she's good for you. That's the point of dating!\n\n\nGood luck!",
            "I have younger siblings. My brother in particular has had some AWFUL choices in relationships. People he's fallen for with terminal velocity who are just not good people. Telling someone who they can and cannot love never works though. Collectively as a family we've just always been there to help with the pieces when it crashes and burns. \n\nIf you generally have a good relationship with your sisters you could try telling them that this is your personal journey. Their job is not to dictate where the road leads, but to walk along side and support you. The more they try to guide you the further they're pushing you away. Then *if* something does go wrong, you won't trust them to have your best interests and you'll be all alone with no support.",
            "stop talking to them. tell them until they can respect you as an adult, you won't have a relationship with them.",
            "There is no such thing as a pecking order. Tell them to stuff that where the sun don’t shine.",
            "Stop answering the phone. Seriously. You'll start talking to them when they learn to keep their mouths shut. If you don't firmly establish this boundary now, you (and any romantic partner you have) are going to be smothered and miserable forever.",
            "Block them. Make sure they understand what it's for. Cut contact entirely if that's necessary. It's not about your current girlfriend, it's irrelevant whether she's \"right\" for you. They are trying to control your life. Did they actually use the phrase \"pecking order\"? If so, even more fucked up.",
            "[deleted]",
            "Not enough objective info. Do what you think is best for you.",
            "[deleted]",
            "She is probably better than them and they're just jealous.",
            "Boundaries - your sisters need to learn about them...\n\nMy advice is simple: tell them no. \n\nThey won't listen, of course, so you'll have to tell them in a way that they will listen to. Here's how I would do it: \n\n1. Send a group email saying that you're not willing to engage in this constant criticism. \n\nTell them that you're sick of hearing their opinions, that they're not invited into your relationship with your girlfriend, that they've expressed their opinions and you've heard those opinions, and that you will not engage with them if they don't drop this one subject. Be very clear: \"if you bring up your opinion about my girlfriend, I will hang up the phone,\" or whatever sounds right to you. Use very short, declarative sentences. Don't include feelings or weasel words, just: \"I will no longer put up with your bullshit.\" But, because you love your sisters and want a relationship with them, make it a \"sandwich:\" first the good  - \"you're my sisters, I love you, I know you want the best for me\" - then the boundaries - \"I will no longer put up with your constant criticism of my girlfriend, this is not negotiable\" - and then another love fest - \"please understand that I will always love you, and love you for your concern.\" \n\nDo it over email so that you can't get sidetracked by them. \n\n2. Behave accordingly. \n\nIf they violate the terms you've set out, carry through on the consequences. Hang up the phone. Leave the house. Whatever. \n\nYou can't change their behavior, but you can change your response to it. \n\nGood luck!",
            "Stop talking to them. About your girlfriend but also in general. I assume it’s a little brother thing and not anything more insidious (like she’s a different race or religion or something) but even so they need to stop.\n\nSo tell them whether they like her or not they need to keep it to themselves if they want a relationship with you",
            "I feel like they are being possessive over their little kid brother and don't want another woman coming in between you and them?",
            "Is your girlfriend aware of this? If she is as fun as she sounds, why don't you two pull some old reverse psychology on them. Get you and her fake wedding bands. Go on the internet and get a copy of a civil marriage licence and fill it out. Find a stamp that looks like a notary and stamp it. Leave it where they can discover it, like the dash of your car. Next time they harass you tell them it's \"too late; that they better start getting used to her because she is now their sister (in-law). The fallout should be spectacular so keep the video running on your cell phone. Monetize the entire confrontation through YouTube and be sure to let us on Reddit know.",
            "Stop introducing your gfs to them , there's no reason they should know that much about your business if they're going to give you a headache, and if all else fails just gray rock them,",
            "I hate to say it, but sometimes family sees what we don't. There has to be a very good reason why all of them would say something. If it's usually just one sibling, it's meh. But all of them. My brother is 15 years younger than me. He was in love with this girl. I told him straight, she isn't for you. I hated being right. He thought he was happy, but something was off about her.",
            "I’m late to this so this comment will probably get buried but here goes. In my personal experience (noting I have no qualifications other than dealing with extremely difficult and complicated family myself) when family members behave like this it’s because they are comfortable loving you as they imagine you to be. It’s a possessive/conditional type of “love” which is dependant on you maintaining your place in the pecking order/persona. Once you step out of the box they’ve put you in there can be a severe reaction. Like when the family fuckup gets their life together, there can be a severe negative reaction - the other family members are comfortable relating to that person as the fuckup. But an independent, responsible adult?? The same thing happens in friendship groups - think when the “ugly friend” gets attractive. It changes the dynamic. It sounds like you - for whatever reason - have been designated “least intelligent” of your family, and just speculating here, your other family members have taken this as license to give you advice and play an important role in your life and relationships. There’s also the fact that you are only 23 and having caring, interested and engaged older sisters than you probably has been useful in many respects. Even unsolicited advice can be helpful! \n\nBut you’re an adult now and you’re dating a woman you click with who really makes you happy. IMHO you REALLY need to put your foot down with this. This is one of those make it or break it moments. Whatever happens with your girlfriend, this has got to be your decision, and even if she is wrong for you or whatever (though from the sounds of things I’d doubt it), this is your mistake to make.\n\nI think you need to be very clear with your sisters that if they keep on trying to interfere, it is going to materially damage your relationship with them, possibly permanently. If push comes to shove, and a choice has to be made, I think you need to make clear that you would choose girlfriend over sisters. (It’s not even really choosing your girlfriend- it’s choosing your independence and right to make your own decisions without being browbeaten). But you need to stand your ground here- this is probably going to set the pattern for how your sisters interact with your girlfriends/wife going forward. \n\nSincerely, good luck! This is going to be very difficult and it’s probably going to hurt your sisters and there will be backlash but you need to set these boundaries now or it’s not going to happen. It can feel like a personal rejection to overly involved  family members when as you grow up, you start to make choices which aren’t aligned with what they value -  and maybe it is in a way! You have found someone to love who is very different from your sisters and they probably experience that - rightly or wrongly - as a personal rejection. It’s part of growing up! And either you stand firm or you give in and live the life your sisters think you should rather than the one you want. \n\nAlso from personal experience with the constant calls thing - when that happens, text back and say sorry I can’t talk right now, will call back at 6.30pm if that’s convenient and then do it. And then keep the call shortish- 15 minutes is good. If there is a genuine emergency- e.g someone’s in hospital they will be able to let you know by text. But unless there is a GENUINE emergency you do not need to be returning calls immediately. I realise it will feel very strange initially, both for you and them, but it will get easier for you and they will get used to it. Also if they try to discuss your girlfriend with you, I would just say sorry I’m not discussing (gf’s name) with you and if they keep pushing it say I’m going to end this call and do it. They’ll get the message eventually. Good luck! You’re going to need it.",
            "I happen to be one of three sisters, very close in age. We have a little brother.\nThere’s no chance they are ever going to approve and not talk shit on who you’re dating. BUT, remind them you don’t need their approval, and you could be dating someone a lot worse, so if they have respect for you, they need to make nice with your life choices.\nIt makes me sad to hear this because you are so happy.\nMy sisters and I ALWAYS had something to say when my little brother had a girlfriend, especially if it seemed like she would be around a while...\nBUT WE KEPT IT TO OURSELVES because, what your sisters are not realizing is, you can easily push the ones you love out of your life by not accepting who they choose to love.\nHe married that girl, and she has always been great to him, and he’s happy. So no complaints here. They need to mature, and show you more respect as someone who they don’t want to push out of their lives.",
            "A wise man once said:\n\n\"You wouldn't ask for a fish's opinion on how to catch a fish.  You ask the fisherman\"\n\nDo what you feel is right OP.  Anybody can tell you what they want but the decision is ultimately your own.",
            "Have your  sisters explained the actual reason they hate her apart from those snide remarks? Ask them why they really hate her and their reason better be good enough like maybe your girlfriend did something to them. If it's nothing of the sort they're not worth listening to. They have their best interests in mind. Not yours.",
            "Bro Bro Bro. I speak from experience!! They are just being overly protective of their little brother. They know you better than any of us. I can even adventure on thinking they have motherly overbearing feelings towards you. I am sure they somehow feel they raised you too. \nThey are also women and they see things neither you nor I nor your dad see on other women. Call it a “woman’s sixth sense”. \nThey want the best for you. They want the perfect woman for you. They want you not to be hurt in life. \nMy approach to your issue would be to sit them all down (or THE one of them -you know which one I mean - the leader) and make her see you understand her fully, thank her for looking after you and express her how much that means to you.  But from the heart bro, with love. Listen to her reasoning about your gf and go deep into it, get to the bottom of each one of their points (dude, you might see truth in some of those points and it might help you avoid a heartache or at least help you reshape the relationship with your Gf for the better). \nOnce she got it all out -you heard it all with total disposition- leave the convo there. Give it a thought. Come back to her one or two days later and either say: you are right thank you for showing me what I didn’t see or, lovingly send her to fuck off and ask her to let you make your own mistakes in life and be hurt because that is your due process to grow up and build up character for the day you truly need to put a ring on it on whomever the fuck you feel suits your dick and mind the best. \nI think this is a win win for all.",
            "Hey I'm with these other people saying they're going too far, but I do wonder... Why are they so against her? I wonder if they're seeing red flags that you aren't seeing because you're biased. But then again, if they are seeing red flags and would like to advise you, they're doing it in a really poor way. \n\nGooduck!",
            "Too much to read here for me, however by and large, the amount of “do what you want” and “don’t listen to them” seems to be overwhelming.\n\nNow I have seen this before, there are women out there that \n\n1. Are capable of manipulating a man.\n2. Manipulate by subtlety and drive wedges between people you love in order to isolate you.  I guarantee if she’s good at it you won’t know, you have admitted you’re not as smart as them\n\nDon’t you find it odd that four people that have never had a problem with your choices before are suddenly and simultaneously so fearful for you because of your choice that they are willing to double down and risk the relationship with you to “save you” in their mind.\n\nI would seriously doubt your position on this. If one of them had an issue.. fair enough but ALLL of them and your dad “seems to like her”\n\nHe could just be supportive, as he knows you need unconditional support, it doesn’t mean he’s totally against what they are saying.\n\nAnyhow I can’t believe there isn’t some truth to what your siblings are telling you.",
            "I’m sorry to have to tell you this, but if I was with a man whose family behaved this way toward me and he didn’t put his foot down in a way that made it stop, I would leave him in a heartbeat. There is only so much space a woman will allow for the family of the man she wants to be with to be abusive toward her or to him before she is fully aware that they are both going to be abused for the remainder of their time together because he doesn’t have the balls to stick up for either of them. When you are old enough to choose a partner for yourself, that’s exactly what you’re doing, is choosing them, and that means setting firm boundaries and actually cutting people out if they continue to disrespect your partner. If you don’t get a handle on this situation she’s going to tell you to go fuck your self. No relationship is worth being disrespected indefinitely. My husbands father is a hateful, unstable nightmare. He blew up one time in my home and he hasn’t been allowed back. He does not see us and we do not speak, and if my husband had not chosen to defend me over the man who was calling me names, he would have never been my husband, I don’t care what their relationship is. Four months is long enough to sit in your partners family home while his sisters refuse to speak to you and snicker and call you names behind your back. If she’s as confident and amazing as you say she is, then she knows her own worth and I’m shocked she hasn’t already walked. She will soon. Stop responding. Stop answering the phone. Stop calling back. You can either choose to let your shitty abusive family get pissed off because you very rightly backed up the woman you say you love and quit allowing them to bully you both, or you can listen to them say they told you so when your girl hits the end of her rope with this bullshit and gets tired of the fact that you’re disrespecting her yourself by allowing it to continue. Your call.",
            "Tell them that their behavior is making you resent them. \n\nMy brother telling me that my boyfriend wasn't 'right' for me and that my boyfriend was just a road block. Not only ruined my relationship with my brother but also made me appreciate my boyfriend way more. \n\nIt's so unfair for your sisters to be like this. Maybe they're just possessive and protective bc they are older. But they aren't your parents, they can't tell you how to live you life, you didn't ask for any damn advice. \n\n\nMore power to you. Honestly I think you telling them to stfu and ignore them when they talk about it is the best option they clearly aren't respecting your boundaries or feelings. As much as I understand you not wanting to offend them, they are being EXTREMELY offensive, and you telling them to sod off is pretty reasonable given the circumstances. \n\nBest luck to you and your love btw, your happiness is more important than the opinions of your family.",
            "Maybe this'll get lost, but, I've drawn my line in the sand, laid down the hammer, whatever euphemism you want to use. Put it in the group text that I'm not putting up with their slandering anymore and that if they want to talk to me, we're not talking about the gf. \n\n&#x200B;\n\nGot the same results, They're \" trying to help\", they \" know whats best\",my gf is \" f&\\^\\*ing me up\", and I'm being \"childish\" and \" rude\".",
            "[deleted]",
            "My dad has three sisters, and likewise they did not like his girlfriend at all. Please try to shut this down now, before it becomes more serious. I'm an adult now, and witnessed my aunts being snide and petty towards my mum whilst I was a kid. They're still off with her and have never included her properly. And similarly to your situation, the main reasons they didn't like my mum included: her education (didn't go to uni), her age (older than my dad), her class (working), her lack of religion (they're Catholic).\n\nMy dad ignored them and stuck up for my mum. But he didn't see everything because they were careful not to treat her badly in front of him.\n\nOther than the girlfriend situation, the daily phone calls and berating conversations really are not healthy, and any distance you can introduce to set lower expectations would be good.",
            "Tell them you're blocking their calls and texts, and you'll unblock them when they apologize and agree to stop harassing you. Leave something like email open to them for this.",
            "One thing I would caution you - don’t let resistance to them galvanize you.  \n\nI once dated a girl I didn’t work with for simply because my family was this way and I didn’t know how to break up with her without letting them think they were right to berate me.  \n\nSo, if in the future you realize this is a relationship you don’t want to be in, don’t make the mistake of equating that with “I should’ve listened to my sisters.”  \n\nBy the way how does your girlfriend feel about all this?",
            "Make it weird , say something in the lines of \"whatever shall I do since there just isn't a good enough woman for me maybe I should just date one of you (as a joke of course )\" and once they get confused and probably grossed out  tell them- I get that you're trying to help and I thank you but as I don't do the same to you try not to dictate who I date .I'm more than old enough and capable and want to see for myself weather this person is good for me or not , I'd appreciate if you didn't ruin that experience.",
            "Different take here.  While, in general, my usual policy is to ignore and keep on course, regardless of what those close to me might say.  Now that I’m older I think it’s wise you do one thing before you tell them to STFU.  That would be to ask them if they know something about her that you don’t know.  Beyond the petty complaints.  Something you wouldn’t normally talk about with opposite gender family.  Since most of us know nothing about you, your family, or your girlfriend, our first inclination is to take the standard, “tell ‘em to mind their own business line.” You should ask one of them privately, “Is there some other reason you don’t like so and so?  I won’t hold it against you,” etc.",
            "After reading some of the comments, this is probably going to be unpopular, but your sisters care about you and they seem to have high standards for you.\n\nI can't believe people are telling you to cut off your family members over a girl you've been dating for *4 months* ... If she's really not what they think she is, let them get to know her. Invite her to your family functions. I'm curious how well they even know her given that you have been dating for *4 months*. \n\nHow much of what they know about her is what you have told them/social media stalking vs actually meeting her? If you're really into her, then bring her around and show that you're serious. And make sure you openly stand up for your girlfriend if they say anything slick so that she always feels supported when she's around your family and holds her head high. If they still don't like her, that's fine. They don't have to like her.\n\nBut remember that they are your sisters who you grew up with and clearly have a close enough relationship with to talk about your love life with. They are older than you and have more life experience. They are biased, you're the baby brother, and they grew up imagining what your life would be. So just take their \"advice\" with a grain of salt, and try to change the subject, and if you really think this relationship is so great, prove it to them by bringing your girl around them.",
            "I’d say don’t interact with it. Don’t justify it with a response, and flat out ignore them",
            "Given your age, I'd give them one warning she's off topic as a conversation. Then if they ignore you just mute their conversation. Don't block as likely they will go to your mum and dad. Just mute and there's very little they can do. \n\nQuestion, how successful are their relationships? Sounds like they are jealous tbh.",
            "They don't need to know anything about her. Info diet. Move on if they ask or don't respond when they bring her up. Grey rock the topic.",
            "You definitely got it right that they are trying to control that aspect of your life under the guise of \"helpfulness\".\n\nSounds like you've done a superb job standing up for yourself and your partner despite them trying to chip away at your relationships!\n\nYou can curb their behavior with time and persistence on your part by setting boundaries and sticking to them. Speak to them individually, remind them that you appreciate they are trying to do what they think is best, but at the end of the day it's your choice and relationship. A pecking order no longer applies here as you all are adults and deserve respect equally. You will need to come up with a list of boundaries that they should not cross and consequences for when the boundaries are crossed make them clear concise then stick to it.\n\nAnother comment recommended the justno sub and I agree it is worth checking it out.\n\nBest of luck OP ❤",
            "Start calling them out on all the things you think they are doing wrong. It'll probably result in a fight, but they might leave you alone. #immaturewisdom",
            "You're man. You get to make your own decisions. Let them feel that.",
            "I can't tell you how to handle this. My sisters are younger than me doing the same shit... I think it's Pinterest",
            "You can't make them like her, but you can certainly stop talking or texting with them when they bring it up. Just tell them you have to go, and walk away. If you are consistent, they might stop.",
            "Axaxa this literally my life i have 2 older sisters and they don’t like my girlfriend bc she not same race as we,",
            "Seconding the boundaries and consequences strategy. This is going to be a very tough road, but you have to stay strong, otherwise they will NEVER stop trying to control your life. You didn't mention your parents, but be wary of them being used as 'flying monkeys'.\n\nAlso, it might be a good idea to check out the r/raisedbyborderlines sub for some insight.",
            "Thats  Funny because I'm doing living in the same situation right now with 3 sisters and African American my wife and a young child you guys are all crazy and you're blaming me for insanity stop mooning blaives in relationships because in the long run the person that hasn't done anything will win in the court of law or the young child that's getting abused with my mom everybody's mouth who wants to be loved and not love and money can be taken from the individual who kept chasing",
            "They sound like my sister-in-law and her awful family.  Anyone fun is shallow and ignorant.  Anyone attractive is Satan personified.\n\nI would keep telling them off....It sounds like they are jealous, which I would bring up every time they said anything.  \n\nI don't really know what you are dealing with but if they are anything like my SIL and her horrid family, I would confidently place a large bet that they look like Cinderella's ugly step sisters.  😆",
            "Put them on an information diet - don't tell them anything about your romantic life. If they try giving advice, say, \"If I want advice I'll ask for it, but until then please keep your opinions on my personal life to yourself,\" and if they push back just end the conversation and only pick it up again when they learn to respect your boundaries.",
            ">How can I get my older sisters to accept who I'm dating?\n\nYou're asking the wrong question. They don't need to accept who you are dating. They need to respect you and your boundaries. Because clearly they currently don't. I seriously doubt this is the only subject that they do this with. \n\nWhen you tell someone to stop doing something, multiple times even, and they just completely ignore you and keep going, that is not okay. Your current relationship with your sisters is not healthy, and both you and they need to realize that. Now you can try telling them this, but judging by what you've told about them they'll probably just brush this off to.\n\nThis might sound extreme, but what seems most effective with people don't respect you or your boundaries, particularly with family members, is clearly stating your boundaries and cutting them out of your life until they respect them. You do not own it to anyone to put up with this kind of stuff \"just because they're your family\". You choose who you let into your life and what you put up with. That goes for them same as everyone else. \n\nAnd you really need to stand your ground with this if you do decide to cut them out for a while. Don't text them, don't call them, don't answer the door for them etc. When you do this, most people quickly get a wake-up that they need to change what they're doing. And once they do, you need to make sure those boundaries are maintained. Don't slip back into old habits.",
            "What part of the world do you hail from?",
            "this probably isn’t the most mature response but what if you chose something in their lives to pick on and choose how they should do it. i’m sure they’ll have the same response that you have of “thanks but it’s my life i want to chose for it to be this way” and then try it as a learning moment? otherwise i would just make sure you stand your ground with your gf cause i can imagine they’ll try and jump on any chance they think they have to get you to listen\n\nbest of luck!",
            "The 'pecking order' comment is the most telling thing here. They don't view you as an autonomous adult being. You exist in their hierarchy to satisfy their need for dominance and control.",
            "Block em for a month.",
            "\"I will not listen to you attacking this woman anymore, if you cannot respect that then I will block you.  If and when you show me that you can behave yourselves and acknowledge that I am no longer your baby brother but your younger brother who is an adult full capable of making his own decisions, then I will unblock you.  I will not ask for your approval nor do I need it\".  End of sentence, then follow through.  Or you can simply warn them \"If you say negative things about her I will hang up on you\" and then actually do it.\n\n\nYou don't need to argue with them, or try to rebuke them, simply stop tolerating it.  I'd suggest talking to all three of them at once at let them know that while they think you are making a mistake, it is your life, and if it is a mistake, (which you don't think it is) then it is your mistake to make.  That you love them, but it is time for them to start letting you grow up.",
            "Is this a cultural thing by any chance? Are you stuck with this? Or can you tell your parents to tell them off? Ignore them potentially?",
            "Honestly, you could try ignoring any conversation involving your gf. Change the subject or don't reply. If they keep pestering you about it then cut contact for a bit and just take a break.",
            "Are you by chance Adam Sandler from the movie Punch Drunk Love?",
            "Oooohh I have same thing with my s\nYear and half younger nosey married sister and she’s always wrong!!!  I’m so sick of her telling me what to do!!! I had to cut the chord!!! So I blocked her!!! And it’s my life back!!! Now I tell her when she gives me advice.   “Mind yiur own business!!!”  I really don’t care about my sister I care more about my love!!!",
            "I wonder if the tactic here is to try to make you miserable so you break up with her; like just make defending the relationship just too frustrating. Bc that's what it looks like they're attempting. maybe bring that up. I mean, you're only 4 months in...you say you're happy, and they're just shitting on it constantly. So what gives? Why are the three of them ganging up on you and her if you are happy? If she is happy? Instead of asking if you have problems in your relationship or if they can help make it potentially better? The open, collective negativity that has no direction and no  basis isn't helping anybody.",
            "They need to know you are living your life and they need to let you. That's the only way you'll learn what they think they know better",
            "So kind solutions like \"please stop, I'm happy with her\" Wont work. Make it clear that whenever they mention your girlfriend you will hang up on them. If its a text, ignore it. They should eventually give up you can even go to that point where you threaten to cut all connections with them... But again they are your sisters, they sure mean well.",
            "Ever seen Punch Drunk Love?",
            "If my boyfriends sister did this I would ask him for her number and text her myself saying that - if she has a problem with me she should say it to my face. \n\nSometimes people find it easier to shit talk others because they think it’ll never get back to them... Maybe if your gf is comfy with it, she could open up a dialogue with your sisters. This could be enough to scare your sisters into not shit talking her anymore and maybe even spark a conversation to end this matter.",
            "You definately need to go watch Punch Drunk Love.\n\nNot because you have anger issues but just so can commiserate with the guy.",
            "My mother and my stepfather are getting married. He cheated on her a year ago. My sister has hated him ever since even though we've all moved on from it.\nUpon hearing the news, she did the same thing your sisters are doing, sending her pictures of the woman he cheated on her with, etc. Really fucked up. Then she had the nerve to vent off to me about it and try and suck me into her negativity.\nBlocked.\nTold her when she's ready to drop the bullshit, we can talk.\nFamily can be toxic, too. \nI advise you to do the same.",
            "Short answer. You can't keep enabling them. If you allow them to keep doing this, they will. \n\nYou need to stand up for yourself. It will hard especially since they aren't used to you saying \"no!\" but you need to get used to saying \"No!\"",
            "You'll find a lot of tactics on how to deal with this type of behaviour at r/justnomil r/justnofamily and r/raisedbynarcissists\n\nIt sounds like you've become the scapegoat of the family. Since you're trying to become independent they hate every decision you make and talk down about the most important things in your life to make you give up. They're trying to cause drama and argue about anything and everything. And then they go down the love bombing road by claiming they love you and care. \n\nNot responding and not reacting is the best way but I know it's hard.",
            "Forgive me but so many of the comments come across as wimpy reactions to this cabal. \n\nInstead of reacting it's time to take the initiative. Do something that catches them off guard. Make a bold statement about your intentions. Assert yourself. \n\nBe sneaky. They have the upper hand now so divide and conquer. Find issue with something they care about and make it the topic. \n\nOwn the narrative instead of being a pawn",
            "“Sisters, I understand you think you’re coming from a good place, but you need to stop. When you disrespect my significant other, you are disrespecting me as well. If I need advice, I will ask. Otherwise, please stop all unsolicited comments and opinions about my gf. They are not well taken, they are rude, and they will not be tolerated further. Thank you for understanding.” If they continue, ignore them.",
            "You best bet is to cut them off.   Don't give them access to your life, and keep your distance for a little bit.  Obviously they won't like it, but hold your ground and explain you are not prepared to let them interfere with your relationships.  Then if they are showing respect, let them back into your life a bit at a time.  Go slowly.  If they go back to bad habits you cut them off again. \n\n It might sound childish, but what are the current consequences for their actions?  Stop, or I will say stop again?  It is a way to force them to respect your wishes.",
            "When this comes up again, end the conversation. Cut them off and say \"You've said all this before and my position hasn't changed. I will not be entertaining this topic any longer.\" Then change the subject. If they try to keep going or assert why it's their privilege and duty as your sisters to decide who you  date, click! If they bring it up again next time, click! If they're outraged about you hanging up on them, click! Either they will find something else to talk about, or you'll talk to them a lot less--either way, problem solved.\n\nWhen whatever other busybody gets involved: \"I'm happy to talk to them about anything other than how much they hate my girlfriend. I'll be right here waiting whenever they're ready to drop it and talk about literally anything else. They are completely free to talk with me whenever they want. But I'm not going to listen to them lambast my girlfriend, just like they did with the last one and the one before that; it's not fair to her and it's not fair to me. So if they want to make that our entire relationship, then I guess we won't have a relationship. It's up to them.\"",
            "Thank goodness the pecking order isn't legally binding!  There's plenty of good advice about boundaries here, and you can read some books and hire a therapist to help you shore up yours.  I absolutely lost it at the pecking order line.\n\nAdditionally, unless this GF is \"the one,\" (and it's awfully soon for that), be prepared for a never-ending litany of \"I told you so\" in the future.  You're allowed to make mistakes, and having a relationship that eventually ends - as most do - isn't even a mistake, but your sisters are likely to see it as such and use it as ammunition in the future.",
            "Sounds like they meed a boyfriend to distract them so you can enjoy your time with your partner",
            "Set boundaries. Until they respect you and the boundaries, cut contact. Why would the respect anything if they know there are no consequences and they will get away with it. You're the leader of your life, take your crown back.",
            "Block them in your phone and all social media until they learn their place. They'll try to guilt trip you with \"family first\" bullshit.Until they stop overstepping boundaries that's on them.",
            "Honestly, your sisters are terrible people. From everything I’ve gathered they’re stuck-up, self-centered, self-important people who think they know better than everyone else. I do hope you stop interacting with them as much, possibly even cut them off. They’re adding literally no value to your life and actively sucking value away with their constant attempts at controlling you",
            "As an older I get wanting to protect your younger siblings even from their own crappy decisions. What they are doing though is harassing you in hopes that if they shout at you loud and long enough you'll do what they want. But it's not their relationship. So my advice is be frank with them. Let them know that when they start coming with the drama you are not there for it. Go ghost on them if you have to. Because they have to get it",
            "Its one thing for them to make rude remarks occasionally or bash her at family gatherings. Still rude and unnecessary but okay, if they don't like her - that's one way to do it. It's really bizarre that they're messaging you every single day about this. That's a lot of time and energy for adults to be spending on anything. If you don't live with them, you need to pull away because that's not healthy at all. Really strange TBH. \n\nAlso you've got to understand that misogyny isn't just a man thing. Plenty of women hate women. It's ingrained in a lot of people. I don't know how much time they've spent with her but that's the first thing that comes to mind when you're describing their issues with her. Just being extra harsh on her based off appearances. \n\nIf you legitimately value their opinion and don't want to just push them away, I think they'll get over it in time and once they get comfortable around her.",
            "firstly I’m glad that you are able to live your life how you want even with all the bombardment of ‘advice’ from your sisters. I’ve known a lot of friends who let their family or other friends say one (usually uneducated and based on assumptions) remark on their relationship or life goals and bam, they just stop doing what they were doing even if it was making them happy. usually they would stop because they figured it was the only way to get their family/friends to stop bothering them about it. it always sucked to see. so I’m really happy that you haven’t done that and you’re standing your ground!\n\nI agree with everyone else saying that you NEED to lay down your boundaries and help them get the picture that 1. this is Your Life, not theirs and 2. if you’re happy then they need to either shush or be happy that you’re happy. you’re an adult and I’m pretty sure you know what makes you happy in a relationship and if your girlfriend is giving you that or not. tell your sisters that it’s insulting of them to assume that you don’t know yourself enough to know what’s best for you. it’s insulting for them to assume they know what’s best for you when they probably don’t. why do they even feel the need to constantly “advise” you on relationships anyway? y’all need to get some help on that part first because that’s concerning on their end and unnecessary on your end. :( \n\neven if you end up having to ignore their calls/texts/shut yourself in a different part of the house away from them in order to send the message home, do it. you’ve heard their advice, acknowledged it, and decided that it didn’t fit your situation and you will handle it on your own (make sure you say something along those lines otherwise they’ll be all like “he’s delusional!! he won’t listen to us because he’s delusional!!!! waaahhh!!” and that’s so annoying to deal with). they need to trust your judgment on your own life, stifling you and controlling you to this extent won’t help in the long run anyway. they need to let you do your own thing. they’re not in your relationship, YOU are! just because they saw something that maybe didn’t sit well with THEM doesn’t mean anything. it sits well with you and that’s all that matters. I hope this all blows over for you and your girlfriend soon!! :’( sounds so annoying",
            "My family is from an African culture were this occurs pretty regularly. One of my cousins got married to a woman and his older sister dictate everything from the beginning. The comments got to his wife since he was too scared to do anything about it and they had an ugly divorce. He isn’t allowed to see his two kids or contact them at all. \n\nFrom your comments and what you wrote, you seem to be doing way more than my cousin did in regards to standing up to your sisters. I would suggest going low contact and setting hard boundaries, but be prepared for a drastic change in family dynamics. \n\nGood luck to you.",
            "My answer is short and to the point.\n\nIt is not any of their business who you date, and I'd recommend telling them if they cant be polite about you girlfriend that they weren't welcome to voice those opinions to you. \n\nThat kind of extra stress can actually destroy a relationship.",
            "Theres comes a time in any peoples lives, not all mind you, where they make a decision to redefine the word family. It's a process that leads you to see your relatives in a more objective light, giving you the chance to see how they affect you, and also giving you the chance to get out. Sometimes, people aren't who we need or want them to be, and sometimes we cant change that. Sometimes the easiest, and healthiest thing to do is to accept that a relationship with these people isnt something you want going forward. I'm sorry that times are tough for you friend.",
            "I'll just put it out. This girl approaches life in the best way possible, I believe. We have a lot of fun together, and sometimes that involves drinking more than we should, and smoking a little more than we should, but, everything's fine and fantastic",
            "I think you should try the “I’m very worried about your guys’ collective behavior and think you should seek therapy. Until you work out your issues, I need to cut contact”. And then cut all contact until they come to realize their behavior is completely irrational. \n\nYou’re the only one that needs to feel comfortable about your relationship. My bro’s had a few girls and I’ve never given him any advice other then “you do what you feel is right”. It’s not my business to live his life for him, just like it ain’t your sisters job to “save you from your gf”. Their behavior is abnormal af.",
            "I wonder what they’d say if you told them that if this is a mistake, then it’s your mistake to make and all they’re doing is causing resentment.",
            "grow a spine and stop answering their calls",
            "You’ve got to get Melody Beattie best seller... Codependent No More. And read the chapter on Detach.,, you’ve got to let go of your stupid sisters",
            "Remove yourself from your sisters",
            "It’s not about your girlfriend at all and where she went to college.. this is about yiu.  Taking a stand and  being a man who’s going to make his own decisions in life..  it’s no one’s business but yours",
            "Go with Dear Abby advice. Your sisters are likely seeing her as a hot waitress with no brains. \n\nWhether that is her or not, is none of their business. \n\nAsk Matt Damon about marrying a hot waitress. Worked out pretty well for him ;)\n\nAwesome to see you standing up for your gf. Kudos. Many would crumble under the family pressure.",
            "Oh man....I’d just ignore them. Probably easier said than done, but nobody is forcing you to answer the phone or respond (or even read) to their abusive texts. Telling them once that you don’t want to hear this shit should have been enough.",
            "Because you’re the youngest sibling, you’re siblings will control you regardless because you’re showcasing something that’s they’re not used to. You’re girlfriend is a threat for them because she wouldn’t know how to “fit in” with them which is why they’re controlling you. You have to show / demonstrate leadership without seeking their approval or they’ll keep doing that to you. Your sisters still think you’re a “boy” in their perception. Don’t let this be brother.",
            "They're not going to accept it. Focus on your well being and the well being of your girlfriend. Tell your sisters that your relationship is not up for discussion, that you won't be talking about it with them anymore. If they press it in any way, hang up on them. If they still continue, block them.",
            "They have control over their actions, you have control over yours. You're not obligated to be barraged all the time with this crap.",
            "Might just be blowing smoke right now, but my gut tells me that they are jealous of your relationship. Perhaps they have recurring relationship woes and are acting under false pretenses... \"Trying to look out for you\" and all that. Maybe I am talking semantics at this point, but I wouldn't be surprised if this was the case. They are trying to help you because they have been hurt, but at the same time, they see things working for you and think it isn't fair. Again, I don't really know, but food for thought.",
            "Congrats on finding someone who makes you so happy. As to your sisters, I don't think anyone will be 'good' enough for them. \n\nIt seems they are going all out to protect their 'little brother' and are crossing all kinds of lines and boundaries to do so. Do they barge into other areas of your life? I'd put good money on it that they do.\n\nThey're refusing to see you as an adult, just a child who must be protected at all cost. (Try not to choke on the cotton wool they've wrapped you in!)\n\nEssentially it comes down to respect. They have NONE for you and your right to make your own choices. Look, you may be with this woman for the rest of your life, or it may crash and burn in the next week. YOU have the right to see that through. They should only give advice/opinions when asked for it. \n\nI think you should let them know respect is a two way street. It doesn't sound like you have much/any for them and you should tell them as such. The more they infantalise you, the more they are being pushed away emotionally/mentally by you. (It's natural to push away a cushion that is trying to smother you.)\n\nTell them to stop, cease and desist or they will do irreparable harm to their relationships with you. You have a right to make your own choices, SINCE YOU'RE AN ADULT NOW! \n\nWhen in doubt, no contact. (Oh! Hell! You're not stuck in isolation with them are you? Your message made it seem like you weren't.) I think it's the only way for you to maintain any kind of relationship with them in the future.\n\nI hope things settle and you can enjoy your time with your new girlfriend.  Try to think positive and test negative!\n\nCelticFaerieQueen xx",
            "Ignore them. tell them you will hang up if they bring up your relationship and follow through.  Stop explaining and justifying your relationship.  \n\nSend them video from NY Governor Andrew Cuomo, who in a Coronavirus press conference yesterday, for some reason decided to give advice on boyfriends: \"You can never say you don't like the boyfriend.\"  Works for girlfriends as well",
            "fucking leaen to ignore lmao",
            "In the eyes of your mom and sisters, nobody will be good enough for you. Always remember that. Since your the youngest, you will always be their baby.\n\nThe only thing that you can do is talk to them. Tell them that you love them, your happy with the things happening to your life, ask for their support in your relationship and ask them to give your gf a chance.\n\nAnd if your relationship goes south(and I hope not) ask them if they can still be with you and help build your life again.",
            "Idk if anyone’s said this, but could they just be protective or jealous? I mean, it could always be a motherly instinct as well and you ARE their little brother",
            "You are 23 not 13! Despite the \"pecking order\" you are all adults, so all deserve to be treated with respect. How did your sisters treat you when you were growing up?",
            "Yeah. See I'm a no bs kinda guy. If they do this to me I cut them out one by one. Explain why beforehand so you dont look like the asshole. If you want to you can tell them that their opinions aren't worth expressing to you anymore because you simply dont care. They enjoy having control over your life. That's why I wouldnt hesitate. I treat family and strangers with same rules",
            "I’m not sure if this will help, but I’ve been in the opposite position. I have a history of dating the all the wrong women. My family, two sisters, brother, and parents would say something at the beginning but I’d brush them off. After that they would let me live with my mistake and I’d come out of it wishing I had listened. (Yes, every time because I’m an idiot)\n\nI think that is the healthy way for a family to act. You have to be allowed to live and learn. Your sisters are way out of line. Personally in your shoes would totally blow my top and rip them a new one. Then after I calm down, I’d explain: “I know you have my best interests at heart, but I really like this girl. You can give me all the advice you want l, but I’m staying with her. If you keep pushing this, it is only going to ruin our relationship. I’m asking you to stop now before it get to that point.” \n\nNow keep in mind this come from someone who is super stubborn and also super bad at picking women. I’m 40 and still going for all the wrong women. I’m not sure this is advice, it is just how I’d handle things in your place. Probably not the best method, but maybe it will inspire you somehow.\n\nGood luck!",
            "Your sisters sound jealous.",
            "Remind them that you are 23 and your twenties are the time you are supposed to make mistakes. I understand, you don’t believe your girlfriend to be a mistake, but if that’s their argument, just run with it.  If she’s not hurting you, they should be able to accept the idea that you want to date around and the people in your life don’t require their approval.  Again, I understand you aren’t necessarily interested in dating anyone besides your girlfriend, but it might quiet then down if they think the relationship is more casual.  \n\nFYI: let your girlfriend in on what’s going on and how your talking to your sisters about her so they can’t go behind your back and undermine the relationship but telling her you said you should be able to make mistakes and that it’s casual.  Get on the same team with your girl now, united in the face of their pressure instead of trying to talk your way out of a situation later when the gossip has twisted the context and meaning all up.  \n\nThat, and reduce your contact with them so you can enjoy your days unencumbered from their drama.",
            "Post some pics and it sounds like they are jealous and want you for themselves and haters going to hate so chill with beef and get some chicken instead. Now go put that incest is best to the test x 3.",
            "Damn your sisters’ behavior is really trashy and toxic. Really un”woke” in direct conflict of their pride in being educated and having a nice living etc.",
            "[removed]",
            "You may need to cut them off until they come around. Perhaps warn them that they’ve driven you to choose and if they don’t back off you’re choosing her",
            "Next time when they call you, just dont let them talk and say \"get a life\" and hang up. Thats it, no need to explain anything! If your father really likes your GF you should really explain everything to him and tell him that you are ignoring your sisters and mother opinions about your GF from now on!\n\nYou need to explain it to him because people like that enjoy to twist things here and there, and eventually your dad might fall for it even if he likes your GF.",
            "Pecking order? Pecking Fu**ing order?\nMy (25m) brother (33) tried this shit as well. Telling me to shut the fuck up when he was losing an argument bc he was talking complete bs. I told him I'm an adult and he can't tell me shit. He's huge. The thing is, I'm rather big too. When he came in my face all threatening I told him that I'm not afraid but I can fu**ing smell he is. We don't talk anymore. Long story. But the point is, they don't get to walk over you and live out their Powertrips and controll issues just because they are a little older.",
            "This is how you get them to accept who you are dating: You slowly escalate and socially distance yourself from them.\n\n1. If they mention breakiing up, immediately hang up on them.\n2. Then put them on \"no alert\" on your cell phone. They can text you but your phone won't tell you about it. The messages are there but you won't see them unless you go looking for them. Also if they call you, your phone will not ring, it will take messages though. So you can always check you voicemail and call them back later. \n3. block them. \n\nThey want to control your life. You want to control your life, so if they don't get the message, start ignoring them.",
            "\"I don't care about any pecking order. Don't call me to talk about my girlfriend anymore.\" Then stop replying. Live your life dude. I barely text my gf a couple of times a day lol, stop talking to your sisters so much. Put that shit on silent.",
            "Just tell your sisters this- \"My life my rules.\"",
            "[deleted]",
            "Bro omg i am in the same situation. I have 3 sisters too and I’m the youngest and none of them approve of my girlfriend including my parents. They have never met her and judged her based on a normal text convo🙄. And some other really judgemental things. I love her and she is just amazing and I’ve never been happier but my family is making it difficult. Also it’s a ldr🥺",
            "[deleted]",
            "You've received plenty of advice, and good advice at that, so I'll just throw this in as an after thought:  \n\n\nThis will only continue for so long before your GF gets caught in the crossfire and ends up hurt over this. I have seen thoughtful, kind people turn in VERY insecure over family-of-the-partner treating them poorly. If you want her to continue feeling like the bubbly, joyful person she is, you need to get their attitude away from her.",
            "Yesxx cut them out!  They are way too controlling and you must be codependent to not see that they are way too much in your life.  I go to alanon meetings in my area and working the 12 steps doing that and with another person you respect is so great!!  Builds self character and rids you of unnecessary bad Chstsctet defects!!  It’s not anyone’s fault about your sisters invading your life but yours!!",
            "It sounds like the women in your family are jealous of your gf! I’m sure she’s wonderful, which probably makes them feel insecure.",
            "My husband grew up in a matriarchy-type household.  His mother/sisters never liked anyone he dated, including me.  In my opinion, they probably feel as though you belong to them, and resent the new female because their emotional power/control over you is threatened.  It's best to tell them that you care, but be firm in your boundaries.  \"I really appreciate that you care enough to share your opinions, but this is the person I'm with, and I'd appreciate if you would respect my decision/relationship.\"  Say it until it sinks in.",
            "You're still young, how are you going to live your life, learn and grow your character if they won't even let you experience it and make mistakes. \n\nTell them that you know that they want the best for you, but they can't judge your girlfriends by single encounters, they're not the once spending 24 hours with them. And unless you've ASKED for the advice then you don't want to hear it, give them an ultimatum that if they continue to meddle with your relationships and won't keep their opinions to themselves, then you'll go low contact/ no contact. \n\nSometimes family think that they know what's best for you, but sometimes they really don't, and it's okay if you're wrong, it's just a learning experience, and you move on. \n\nWhat about their dating experience and history? have they been in horrible/bad relationships?",
            "Is your family generally rude to people in customer service positions?",
            "I’m sorry for my judgment.. I think that is the only way you will have control of your own decisions and choices.. is to detach., my younger sister is so controlling and she doesn’t want to go to counseling with me which proves to me .,, she is ugly mean person.. you judge if your sisters sre of good intentions or not..",
            "If you've tried to tell them to stop providing advise, it seems like the best thing you can do next is to just start ignoring them. Not entirely, but just about things related to your girlfriend. Send them all a message to say \"I'm an adult, and I can make my own decisions and I'm not going to respond anymore\". Then just delete texts related to your girlfriend and only talk with them when it's stuff not about your girlfriend. If you stick with this girl they'll eventually come around either way, but this seems like the best approach in the short term.",
            "Yeszz my mom and grandma and sister and niece would gang up on me because I wanted my privacy., it was awful to say the least!!  That’s when you know something does not feel right.. yiu really need to go to alanon meeting for balance .. then yiu can save what family you hsve,  and still have your darling girlfriend that you love!!!💜. Therapy works well too.  Short term",
            "Ridiculously controlling on your sisters/mothers parts! Good on you for setting boundaries. \n\nYour girlfriend sounds wonderful. \n\nHopefully you shutting them down is helping, but I’m typical entitled fashion they’ll probably be salty for a while. Hopefully you’ve told your GF as well. From experience ppl like this tend to forgive their sibiling and put the entire blame on the S.O. If the relationship continues.\n\nIf you think you have a future with this girl, consider it with out your sisters. Because I can’t imagine the stress your gf is going through knowing her entire S.O.s family hates her.",
            "My mother tried to control what (how much) I eat. It ended in a screaming match, with me telling her:\"even if I ate 20 pizzas every day - I am a grown woman, it is MY decision, you have NO say in that - and I mean, absolutely NONE!!!\"\n\nMaybe let your sisters know, that it is your decision, and never theirs, and remember the advice to leave the room when they don't stop pestering you (or hang up!)",
            "Families shouldn’t interfere, sure advice it always good but why stick their beak in? All you can do is ensure your girlfriend knows you want her, if they say shit to her, let her know you have her back and you chose her. Tell your sisters to be nice but don’t be rude. Tbh my ex’s family wasn’t a fan of me but he assured me it was his choice and they’ll warm up one day which worked, it made me feel better. We just weren’t compatible in the end. \nAll the best! Don’t give up on someone who makes you happy because of your fam, it’s mature you notice it instead of going with what their saying and let it persuade you to leave her.",
            "\"You don't have to accept it but if you want to continue to have a relationship with me and my future kids, you won't say anything else about it.\" Then mean it.",
            "Do they gossip terrible mean things about everyone?  Not just the family but others too .. I really get annoyed because it’s totally mean and hurtful and dysfunctional",
            "You’ve had a lot of advice. I think this is a little different so I’ll post. Recognize that you’re not accountable for your sisters’ behavior (and they’re not accountable for yours). You’re in control of who you decide to date and also how you react to their judgment. Your sisters seem to have a strong idea of who you should date. This clearly doesn’t line up with what you’re looking for in a partner. It will take them time to change their perception of you and what they want for your future (if they’re capable of doing so). Be patient. Be clear about your boundaries. Be persistent. Don’t approach them with anger. Feel free to take space when you need it. Mute text notifications. Reduce the number of calls. Maybe they’ll have more to talk about if you don’t talk every day... This isn’t a one conversation fix. When you hang out together. Hang out with one sister at a time. This shifts the power dynamics slightly (1-1 instead of 3-1). And above all be open with your girlfriend. You’re in this together. She’s sticking around despite all this so she’s probably a keeper.",
            "If they are trouncing your boundries every day, they are being toxic.  Do what you'd do any toxic person -- block them.",
            "Just block their numbers? Sounds like the 3 witches.",
            "It might be helpful to say, \"you know what... Maybe she is wrong for me. But it's better I find out first hand. Let me learn the hard way. What am I supposed to do if something happens and you're not around to point things out to me? It's a skill I need to learn as an adult that you're holding me back from learning.\"\n\nYou're happy and they should just be supportive. Unless there is a real reason for them to get involved.\n\nAnd if they still won't listen, start inputting your unsolicited advice to all aspects of their lives. \"Really? You're gonna wear that hat?\", \"Pancakes aren't good for you, you know.\" And so on.",
            "This should be your response. Since you want to make decisions that affect my life I think I should get to decide yours.\" So don't talk to me about breaking up until you leave whom ever you are seeing.\" And if they are single then \"you need to go out and start looking a man.\" You live my life I live yours.",
            "\"I am with a hard working, interesting and kind woman. I am happier than I've ever been. Your snobbery is revolting. When you are ready to sincerely apologize we can talk, but until then I will not be responding.\" Be very careful that they don't try to split you up by contacting your girlfriend or her employer. She needs to know what they're doing.",
            "Put on your big boy pants and tell them to fuck off and leave you alone and if they don't then block them and ignore them until they stop being cunts.",
            "I'm going to tell you what my cousin did with his sisters: wrote them a long message saying \"I'm not interested in your advice and you need to stop. If you don't, I'm going to block you.\"\n\nThey kept on, he blocked them and told his parents that he was distancing himself from them (the sisters) for a while and to please not act as a go-between. My aunt + uncle were reluctant but respected him enough to accept his request.",
            "As a woman married to a man with 3 sisters, please take my advice...as the only sister in law it is impossible to break into a family of 3 girls and 1 boy.  I have several examples with myself and my friends.  3 sisters are like a click, like in high school, and 3 women raised in the same house will never let a 4th one into their group.  It is sad for me and for your girlfriend or future wife, but unfortunately I think it's the reality. Your job is to stand by your girlfriend and support her.  Make it clear who your allegiances are to.",
            "I can only second this. Make your boundaries clear, make it clear the consequence of them continuing to act this way is losing contact to you and it will be entirely their fault. If they continue, ignore, block, most importantly stop engaging. Do that CONSISTENTLY, don't back down from your and your girlfriends right to be treated for basic respect. It seems harsh at first, but it is sadly the only way to be deal with toxic family members like this.",
            "I'll be honest, at 23 I started dating a guy. When I brought him home for Thanksgiving the following year (we carpooled from several states away with another of my siblings), one of my older sisters was so relentlessly negative about him and to him that he *hitchiked in a rare snowstorm in Texas* to another city 200 miles away. At 4 am.\n\nFortunately my sibling's car had a CB radio (pre-cellphone days), and we were able to reconnect and picked him up at a truck stop--truckers are awesome, just saying.\n\nThe long and short of it was that I would have broken up with him in a few more months if she'd kept her mouth shut. Instead I stayed in what became an increasingly abusive relationship for another 5 years. \n\nWasted my time and energy on someone I shouldn't have, simply because she pushed me so hard and was so nasty directly to him that I stubbornly refused to see the red flags. \n\nLesson learned. And I was #4 sibling as well. \n\nYour sisters may have valid points, or not--but *you* need to live your own life and learn your own lessons just the same. They can't live it for you.\n\nYou have to set boundaries for the rest of your adult life by cutting out communication with them, one by one, if they don't stop with the opinions and attempts to control your life.\n\nGood luck to you!",
            "Break contact with your sisters",
            "They will have to stop on their own terms.\nYou should think alone for a bit if any of their advice is valid though, it's easy not to see flaws when love is involved. So make sure that they aren't truly trying to give good advice. If not, cut them out of your life for a bit just to see if it helps you. After a trial period, reconnect with them and let them know that your life got better (or worse) after cutting them out and that you'd like to rebuild a relationship with them, but with a firm understanding that your gf isn't going anywhere and that she is to be treated like family (as any other relative's partner would be).",
            "That sucks. Remember that you're the most important person in this situation (and your gf). I guess you can tell them from your heart how do you feel about her, but still it may be hard for them to understand this. Good Luck! and as I said you're the most important. You need to be happy. Just appreciate that you have a gf like her.",
            "\\>   She’s more outgoing and talkative than women I’ve dated in the past, very pretty, very bubbly, very fun. They think she’s shallow, unintelligent, and image-obsessed\n\nLet me guess - your busy-bodies sisters are single? They're jealous of your young, pretty, vivacious GF.\n\nYou're going to have to start ignoring them. Give them the adult version of a time-out. Block their numbers for a couple days. Then unblock when you think they've gotten the message. Rinse and repeat, with each interval of silence getting longer.\n\nThis sub always advises communication. That's not good advice here. The point is you want *less* of their damn communication. So stop trying to argue or convince them of anything. Just block.\n\nThey'll act like they don't know why you're doing this. They know. Do NOT give in to the temptation to explain this to them.",
            "Bro I'm gonna keep it real... Most women are salty with each other and alot of them hate each other for no reason. Your older sisters acting the way they are is because of jealousy and hatred. Alot of women hate to see us guys happy with another woman.\n\nThey're trying to subconsciously sabotage you're relationship with out any logical reason. When I was in a relationship with my ex, my older sister said she was shallow and full of herself but my ex was nothing but nice to my older sister.\nWomen think they know everything but they think emotionally rather than logically. If I were you and you saw potential in this girl, I'd ignore your sisters and move on.\nIt's toxic behaviour and no matter what woman you get with they'll always get involved.",
            ">They hate this woman(23F) I’m with now. Personally, I’m the happiest I’ve ever been in a relationship. She’s more outgoing and talkative than women I’ve dated in the past, very pretty, very bubbly, very fun. They think she’s shallow, unintelligent, and image-obsessed, and I rebuke these claims all the time with them.\n\nThis sounds like she's more attractive than they are which makes them feel insecure.  Crabs in a bucket.\n\nAre any of them married with children per chance?  If not you have a ready made devastating response whenever they pick on you.",
            "Let your sisters know how serious this relationship is to you and that they need to get to know her. Have you all did activities together or maybe your sisters and your girlfriend could have some alone time to spend together? They should at least try to get to know her. If they continue I would just ignore it and continue to tell them how happy she makes you and over time hopefully they will come around.",
            "Live your life the way you want it and fuck them.",
            "I know this isn't the 'mature' route but my advice would be to start giving them unsolicited advice too. \n\nAbout their jobs, relationships, personal choices etc. You don't have to be mean about it but definitely hide behind the whole 'I'm just looking out for you' umbrella to get your point across. \n\nYou also need to consider though that this may never stop. This need to be overprotective is something that tends to happen when there's a unbalanced gender ratio (you're the only boy out of 4 kids) so rather than pick at each other they unite together and become hyper focused on you. Part of it is because whoever you end up with is going to potentially become apart of their 'crew' someday. On Holidays and family meetups what usually happens is that the men stick together and the women assemble etc. So i think they're trying to cherry pick the best girl for THEM. \n\nI think it's also because they're used to seeing you as the 'baby' of the family. Whenever they give you their opinion on your gf try saying, \"i appreciate you looking out for me sister and i know you put alot of thought into this but I'm an adult now. Even if you don't agree with my decisions or think i'm making bad ones this is my life to live.\" \n\nBest of luck, OP",
            "“pecking order”  lololololol\n\nNo. There is no pecking order. Next time they do this, remind them that as an adult, you can choose who you spend your time with/communicate with, and if they don't start treating you and your relationship with respect, you won't talk to them. Then block them for a couple of weeks.\n\nTrust me, there is nothing else to be done other than blocking. Everyone who ever had this kind of extreme problem with family members that want to control your life always tries reasoning, pleading, arguing, crying, threatening - NOTHING works until they see that you're serious about cutting contact. And blocking for a time serves that purpose.\n\nAnd be careful. If you don't stop this now this may cost you a good relationship in the future. I wouldn't be surprised if a partner left because they were aware of your sisters constantly disrespecting her.",
            "Set boundaries.  I am very happy you're my sisters but you dont have the right to rule my life. I'll date who I chose. You can  have opinions but this is my life not yours.",
            "I was simply suggesting it is natural for older sisters to act maternally over a younger sibling.  Usually comes from a place of love.  Naturally I thought that could be understood.",
            "Quite frankly the best thing to do is ignore their comments. Dont respond to the texts or comments about your gf. Only text back if they ask you other things like hows work, hows school, etc. Don't disclose any other details or updates about your girlfriend. Stop caring what others think. Its your life you do what makes YOU happy. If you haven't already, get your own place. \nIf your sisters really keep pressing just say it's my business not yours and change the subject",
            "It just blows my mind that they're not happy that I'm happy, to me, that's part of being siblings, if your siblings in a good place, be happy for them. If they're down, do what you can to pick them back up.",
            "They can’t decide for you only you can even they think she isn’t right for you it’s you’re relationship tell them to stop because it’s none of their business",
            "Maybe this'll get lost, but, I've drawn my line in the sand, laid down the hammer, whatever euphemism you want to use. Put it in the group text that I'm not putting up with their slandering anymore and that if they want to talk to me, we're not talking about the gf. \n\n&#x200B;\n\nGot the same results, They're \" trying to help\", they \" know whats best\",my gf is \" f&\\^\\*ing me up\", and I'm being \"childish\" and \" rude\".",
            "Idk but you have asked them to stop and if my little brother asked me to stop with advice I would stop. I just don’t know why they continue when it hurts yiu and you’re perfectly capable of making your own decisions,,  yiu have to do what is right for you., have you talked to your girlfriend... is she upset about this??  Usually when someone asks you to stop doing something they honor your request!!!",
            "Have you guys tried going to therapy to see why your sisters are like this with you",
            "Just tell them that if they want to be a part of your life and future they will stop with the hate and comments against your girlfriend. If they don't stop then that is their choice to not be a part of it.",
            "Here's the deal. Women's intuition is a real thing.\n\nThere only two possibilities. Your mother and sisters are right, and they know something that you are blind to because of your infatuation with her.\n\nOR:\n\nThey are all jealous of her.\n\nThere's really no in between. You need to figure out which one it is. If it's the latter, you ignore them. If it's the former, you dump the GF.",
            "If they thought she was abusive then I’d be worried, but seeing how you said it just about her being a waitress who didn’t go to college is just fucking gross.",
            "Yeah your girlfriend is good .. and you’re good together as a unique couple.. I also think maybe your sisters are a little jealous you’ve got this strong relationship and you’ll move on to healthy life together with your girlfriend..marriage? Kids? You’ve got everything going for you.,, and the future is bright and beautiful!!! Good luck to you!!!",
            "I use to listen to my elder sister before. \nHowever i was young. \nAnd i lost 5 chances. \nAdmitting,  relationships only ruin. \nAnd make carrer first. \nLater i got busy as a refresher and could never date. \n😔"
        ]
    },
    {
        "post_id": "4bjldi",
        "author": "None",
        "title": "My (26/f) coworker (33/f) adopted a kid from the Ukraine a year ago. Now she's going around work asking us to adopt him and writing about giving him away on Facebook. What to do?!",
        "url": "https://www.reddit.com/r/relationships/comments/4bjldi/my_26f_coworker_33f_adopted_a_kid_from_the/",
        "score": 3093,
        "num_comments": 417,
        "created_utc": 1458683340.0,
        "selftext": "Update here: https://www.reddit.com/r/relationships/comments/4bov90/update_my_26f_coworker_33f_adopted_a_kid_from_the/\n\nSo, my co-worker is kind of a weirdo (I'll call her Mary for the sake of this post). Her and her husband are one of those people that have a ton of adopted kids (eight so far) and are super religious. To each his own. Mary enjoys telling everyone at work her business, so when she decided to adopt a kid from the Ukraine, everyone heard about it. She went with an older kid because it was easier for her and her husband (she says). This was two years ago.\n\nMary has asked me to babysit the boy a couple of times (I'll call him Tony), and it's never been a problem because I like kids. I didn't see any glaring problems despite Mary's constant dramatics about how awful the kid was and he seemed to like being over (it's just me and my boyfriend here, and our place is small but clean and really well kept. Mary's house is...disgusting for lack of a better word). Mary would harp constantly about how much Tony liked it at our house but I just chalked it up to the kid having a good time.\n\nLately Mary has been at work, talking to anyone that'll listen about how awful Tony is, how horrible he is to the other kids, and how she's going to get rid of him. She sent out a freaking mass email to everyone in our department asking if someone wanted to take her kid from her. She calls it \"re-homing\" and that its okay. I logged onto Facebook today and same story...she has pics of Tony posted to her timeline advertising him for re-adoption and to contact her if interested!! \n\nI haven't replied to her email yet, and I haven't commented on her post but I'm this close to ripping into her for what she's doing. She's crossed the line from weird into full blown psycho. Should I call CPS? The police? I don't know much about adoption and a quick search for rehoming gets me mostly results about animals. Any advice?\n\n   \n**tl;dr** Crazy coworker is trying to pawn her kid off to strangers in the office or on the Internet. She claims it's legal. What should I do?\n\nEDIT: Shit has hit the fan. There's mass insanity right now, but I'll have an update for everyone tonight. Most importantly: the kids are safe. ",
        "permalink": "/r/relationships/comments/4bjldi/my_26f_coworker_33f_adopted_a_kid_from_the/",
        "comments": [
            "You need to call CPS and the local police.  \"Re-homing\" international adoptees is actually really common with a certain sort of abusive adoptive parent, and it's led to many children's deaths at the hands of people who should never have had them.  It's a form of child-trafficking, and obscenely it's got a dubious legality in a lot of states.  You need to jump on this _now_, before the poor kid is shipped out of state.\n\nEDIT: For a real horror story, you can google Reuters' \"The Child Exchange\" and read the expose. Sick, sick shit.",
            "Call CPS.  That's not okay.  Take screenshots of the stuff before she removes it.",
            "Wtf!? How the hell was she allowed to adopt 8 children??",
            "As an adopted kid from Ukraine  (I've been here for 21 years with great parents) this is terrifying to me. I hope she goes to jail and isn't allowed anymore children. Keep us posted!",
            "Yes, call CPS. He is a kid, not a dog.",
            "CPS absolutely.  \n\nYou cannot \"re-home\" people and it disgusts me that anyone could be callous enough to even conceive of that.  Just disturbed.  What she is doing is almost certainly illegal and she should be force to face the consequences of her actions.\n\nDon't hold back on her OP.  She is a terrible person and deserves to be punished.\n\n",
            "Hey, I just wanted to say thank you so much for trying to help this child. I am Ukrainian and have been hoping to eventually adopt and stories like this just break my heart. If there is anything I can do to help, please PM me...making phone calls, even a bit of $$ if it will do some good. \n\nAlso wondering, how old is Tony? How is his English? Will he be able to communicate with the officials when they check on him? \n",
            "Call CPS. And for the love of God, post an update! It is vital that you post an update!",
            "Yes, call CPS.  ",
            "Here's some information on international adoption in Ukraine; if the adoption was legal, then there is an agreement with Ukraine on legal support and adopted children should be monitored for at least a year by CPS, and the child adopted from this country should be no less than 5 years old - that's what Ukrainian law says in general. I would suggest contacting CPS first and if needed they may contact Ukrainian consulate and police. \n\nPlease keep all the screenshots and everything that may be evidence of their intent of \"re-homing\" a child, and in case of illegal adoption which looks very much so (because the CPS should keep an eye on the family and interfere when the issues began to arise), you will do a huge favor to many kids. ",
            "The legal reality behind \"rehoming\" children is unfortunately very murky. To be on the absolute safe side I would file a report with the police or at the very least contact CPS so there can at least be something on record just in case there are more incidents down the line. Another user had recommended the Reuter's article \"The Child Exchange\" and I want to reiterate that suggestion now, as harrowing as the reality of the current adoption system is to read about, the article contains a lot of important information and might highlight some other questionable behavior that your coworker might exhibit without you noticing. \n\nGood luck and I hope everything works out for the child. ",
            "What the actual fuck? This woman and her husband need to be \"rehomed\" to a jail cell!! Children are not *pets*; how the hell did they manage to adopt so many?? \n\n\nPolice, CPS, the works! Screenshot and document absolutely everything you can. Report her ass to HR, because sending a mass email trying to *pawn off* this child... Definitely grounds to fire her. I'm pretty sure you are not the only one to notice her psychotic ways. And I'm willing to bet a couple are even willing to testify against her in court. \n\n\nJesus H. Christ, how can people like this even exist?? ",
            "CPS and the Police, NOW.",
            "Leaving reddit due to CEO actions and loss of 3rd party tools -- mass edited with https://redact.dev/",
            "Tony may truly have some problematic behaviors when he's with his primary caregivers that don't come out when he is around strangers. However...even if he is causing havoc in the family and she's feeling overwhelmed by his behavior, this is not the appropriate way to handle it. I'm glad that you care enough about that poor kid to try to intervene in this. Please do update us on what's going on. ",
            "Religious zealots do this kind of mass-adopting to \"save\" children, and when the children don't strictly adhere to the parents' beliefs or push back, they're typically abused if they aren't abused already. There are many children who end up dead because of this.",
            "Take screenshots of everything and call CPS and the cops! ",
            "Echoing the many replies you already got -- please call CPS and to be connected to other resources you can draw upon in your area, please also call the Childhelp National Child Abuse Hotline -- they are available 24 hours a day, and they will walk you through what else you might need to do in terms of reporting this. ",
            "It might help to call the pastor/church too. Since they know the family they may be able to help with the issues that are no doubt about to come up. Police first, though.",
            "This has abuse written all over it. Police, immediately.",
            "OP, PLEASE call the police immediately. Document everything you can. That child could be handed off to a predator and never be seen again.",
            "Looking aside from the legality aspect for a second, it's immoral and unethical.\n\n&nbsp;\n\nNow, let's look at legality.  This has actually become a hot topic thank to an investigative report in 2013 that brought the issue to light.  As a consequence of that news article, five states now have laws on the books: Wisconsin, Colorado, Louisiana, Florida and Virginia.  Regardless of whether you're in one of those states or not, I would call your state's CPS and advise that it's happening.",
            "How terrible! I concur about calling the police immediately! \n\nThere's a Criminal Minds about \"child rehoming\" S9E16 \"Gabby\". So for everyone who's never heard of the practice, the BAU will give you a run-down! ",
            "> She calls it \"re-homing\" and that its okay.\n\nOMG she's talking about this child like it's some random pet she wants to return to the shelter or give away. This is one of the most horrifying things I've read on this sub. :/",
            "Please hurry and screenshot her messages about rehoming this kid!!! You already know what you need to do, but please get all the proof you can so there's no question in anyone's mind this woman is SICK. ",
            "Update when able, please! I'm late to this, but I don't see anything about the police calling you back yet and I am nervous.",
            "Please call CPS and Police, immediately! \"Re-homing\" sounds just like child trafficking, and often lands the child(ren) in the hands of people that shouldn't be taking care of kids to begin with.\n\nHow in the world was she able to adopt **eight** kids?!",
            "Call child protective services NOW. He may end up in foster care, but it better than being rehomed. There are tons of stories out there about adoptees who were rejected by the family, they end up abused, homeless, without the documentation they need to become citizens so they can't get legal jobs or college financial aid. Please, call the authorities. ",
            "This is how child trafficking happens.  A \"nice\" couple will show up to take him off her hands and that's all it.  Call CPS asap.  He was probably so excited to be adopted and doesn't need to be put through this.  They will probably take a look at her other adoptions as well which is a good idea now that you see how crazy she is.",
            "While this is pretty bad and CPS would put a dead stop to her \"antics\" right away... i can't help but laugh a little at the situation. She's treating children like you can go to the local animal shelter and just pick out the one you like the most. \n\nand if you don't like them you can rehome them. I'm half wondering if she posts craigslist adds for rehoming her \"pets\"\n\n13 year old, 5'8 Ukrainian human GREAT HEALTH has all his shots! Looking to rehome to a great family. Rehoming fee of 100 bucks applies. Comes with his food dish, crate and toys! SERIOUS INQUIRES ONLY!",
            "Oh my god that's absolutely terrifying. How this woman was allowed to adopt to many children in her state is beyond me. Children aren't commodities to be bartered with to random people!!",
            "Ummm... She's 26 and has EIGHT adopted kids? Fuck me I can barely handle myself and my aging father. ",
            "Don't feel like you need to pretend this is OK or like you can't say anything. If she says something to you verbally, I think you should reply that you find her actions concerning and tell her about the Child Exchange article. Publicly shame her. ",
            "CALL CPS!!!",
            "This sounds really awful and disgusting. You should be really proud of yourself for intervening on behalf of the child. There are so many people who let evil happen by standing by and doing nothing - you are not one of those people and I wish we could be friends. \n\nWould you be able to foster him, even if it's just temporary?",
            "As a father of five, please please provide an update.... ",
            "Call CPS, and don't give me her address so I would not be tempted to go there and slap her. Your coworker is the shittiest kind of people, the same kind that adopts 10 puppies because they are cute and neglects them, and when they are not cute she returns them. Only that it's a kid not a pet.\n",
            "This will be buried and before I say ANYTHING no she is not justified and your perceptions of the situation is probably correct: calling the police is the right thing to do.\n\nHowever adopting from east europe.. this isn't the first time I've heard of the kids being a nightmare. Even with excellent, experienced adoptive parents, I've heard a previous story about a pair of siblings that had many mental and social problems that the parents were no where near equipped to deal with.\n\nIt's hard to know the situation beyond what you've told us. But.. without making harsh judgements, if I were in your shoes, I'd be sure to alert the right people to the possibility and hope I'm wrong.",
            "Call CPS. I'm not sure why you haven't already ",
            "And yet gay couples have difficulty adopting. Go figure. ",
            "RemindMe! 7 Days \"is Tony ok?\"",
            "I know someone who adopted a child and then gave him away. He was in middle school and adopted from Korea. When he interacted with my family and myself he seemed really sweet and I never understood why the parents would complain about him constantly. I stayed with that family for about a week and a half over the summer and I could see that the child was a master manipulator. He hit the other kids only when he knew he wasn't being watched. He would attack their dogs and provoke them for no reason. This kid had some serious issues. \n\nA lot of kids who were adopted internationally do have behavioral problems and so your coworker might be going through something really difficult.\n\nI definitely don't think how she is reacting is correct she should probably contact the adoption agency that she got the child from. It may be that in her mind if she can find a home for him she thinks he'll be more stable instead of just sending him back. ",
            "Screenshot and call CPS or the police non emergency line.  ",
            "Yeah,  you definitely need to call CPS or the police.  You advertise to rehome your old futon, not a freakin' kid. ",
            "There was an episode of criminal minds about this, I didn't know it was something people actually did though. Call CPS and the Police and report your coworker to HR. Also explain what it is to everyone else at the office so she has no friends left when this settles out. I hope she walks into a time vortex, gets send to the 1800's and somehow ends up getting keel hauled by pirates",
            "Wow...this is fucked up. That poor child. Get police or social services involved there is definitely emotional abuse going on there.",
            "For the love of Christ PLEASE turn her into CPS. Her house is disgusting and she's adopting kids to keep her \"savior\" appearance up, and not because she genuinely loves or wants to help these children. I would take that boy in a heartbeat to get him out of that vile home.",
            "Brewing a big fucking batch of popcorn.disgunnabegoooood",
            "It will be very likely that she gets fired for sending that email. At least you will not have to deal with her after that, but yes, do call CPS on her if you feel the need.",
            "I'm a little late, but I just want to tell you how awesome you are OP. I wish there were more people like you, seriously.",
            "RemindMe! 7 days",
            "This is actually a thing. You can read about the Christian movement to adopt kids, especially from war torn countries. There's a lot of peer pressure to adopt and it's presented as a rosy and happy thing. Then the challenges happen, and then the re-homing happens. Search for an article from *Mother Jones* about this phenomenon.",
            "What state are you located in? There may be some of us with connections that can help, depending on where you are. I work with the ACLU and can get things done quickly in the bureaucratic system  in Massachusetts. PM me for advice.",
            "Hey, OP, you got some sound advice and you're doing the right thing. You may have been asked to do so already, but can you please post an update in a few days? This post is worrying and I would really like to know what happens. Thanks for doing the right thing and going above and beyond for this kid.",
            "Please keep us updated about this poor child. \n",
            "Maybe allowing people to give kids up for adoption is beneficial to everyone involved.",
            "Rehoming is illegal and you should dall CPS like now",
            "this child is not a fucking dog. Please call CPS now. ",
            "this is fucking trafficking ",
            "RemindMe! 7 days",
            "That edit made me sigh with relief. I'm so glad the kids are safe. I'm so glad you contacted the police. Keep us posted. You're doing great!",
            "Wow. A religious nut job who is keeping children as pets. That is terrifying. She needs to be stopped. \"Re-homing\"?? Christ on a crutch, that makes it sound like it's a dog!",
            ">Most importantly: the kids are safe. \n\nParty.exe",
            "Oh my gosh, this is so sad. I'm so glad you spoke up and are doing something about it. Please keep up updated. I can't stop thinking about this poor kid. ",
            "My body is ready for update",
            "There is a hot space in hell for people who do this. This is a KID, a human being not taking 'him/her' back. \n\nI don't even like it when people do this with pets. When you comit to a kid or a pet it's for life. PERIOD. \n\nCall CPS but honestly I don't think they can do anything unless it's abuse. I call this abuse but sadly the law doesn't. Although someone needs to get this law going and we will have less retards adopting kids they can't handle. ",
            "Tell her she can legally leave him at a fire station. ",
            "Keep the emails or at least take Screen caps of the Facebook posts and emails.... To show cps/police if needed.  That's fucked up.  And how is it that she's not getting into trouble from work for this?",
            "You should follow everything other posters have said including the screenshot of the facebook posts and pictures, saving and printing anything related to this situation, and if you can try and log the dates and times she has made these passing comments about the boy. If you think she's a weirdo, you should forward the message to HR and you don't have to work with her anymore. Double win while the police investigation pends. \nEdit to add: The email she sent to the department. Send that specifically. ",
            "This makes me sad :(",
            "CHILD PROTECTIVE SERVICES they will be able to do more!!",
            "Thank you for calling. I hope he is safe. ",
            "This lady makes me sick. Thank goodness you are contacting the authorities. Poor kid :((.",
            "Remind me 3 days",
            "!remindme 24 hours \"SHIT HAS HIT THE FAN\"",
            "Whoa, definitely let us know! You are a good person.",
            "Such a sad, terrible story. Please post an update soon, OP!",
            "RemindMe! 2 days",
            "RemindMe! 5 hours",
            "Call CPS.",
            "Remindme! 3 days",
            "wow thats crazy",
            "We need an update on this. I spent over an hour last night reading the Reuters article referenced in this post.\n\nRemindMe! 1 day \"update on rehoming post\"",
            "RemindMe! 7 days \"is Tony OK?\"",
            "!RemindMe 30 hours",
            "[deleted]",
            "Thank you thank you THANK YOU for calling the police. You very likely saved that child's life.",
            "Thank you thank you THANK YOU for calling the police. You very likely saved that child's life.",
            "Mass insanity not-great, safe kids totally fantastic.  Looking forward to the update.  I'm only a random internet stranger, but I've been thinking about those kids and worried for them.  Good for you for doing the right thing!",
            "RemindMe! 10 hours",
            "Oh my word I want the update",
            "Oh my god! So glad you are there to see about this kid! An update is so needed! ",
            "RemindMe! 10 hours",
            "Remindme! 7 days\n",
            "RemindMe! 8 hours",
            "RemindMe! 7 days",
            "RemindMe! 1 day",
            "RemindMe! 1 day",
            "RemindMe! 7 days",
            "Remindme! 7 days \"is Tony ok?\" ",
            "RemindMe! 7 days",
            "You're not even supposed to re-home the cats you get at the humane society, so you totes can't re-home a fucking human being. Whatever this woman is doing, it's incredibly illegal, and horrifically cruel to that child. \n\nGet screencaps of all the Facebook shenanigans. Save any emails she's sent about it. Then, go to CPS. This kid needs someone to protect him from his clearly deranged mother. ",
            "Side note: It's Ukraine not the Ukraine. ",
            "Irrelevant, but I love your username",
            "This is perfectly legal in most states. ",
            "It is not 'The Ukraine' and has not been so for like 20 years. Please could everybody stop referring to 'Ukraine' with a definite article",
            "Be careful, think for the kid, the CPS will get the kid and than what? Maybe you should talk to the family first and try to help them. We talk about a human, a child without choice. "
        ]
    },
    {
        "post_id": "ih4r1x",
        "author": "ThrowawayAnxious444",
        "title": "My (32F) Fiance (34M) walked in on my therapy session, overheard, and is perhaps upset",
        "url": "https://www.reddit.com/r/relationships/comments/ih4r1x/my_32f_fiance_34m_walked_in_on_my_therapy_session/",
        "score": 3090,
        "num_comments": 183,
        "created_utc": 1598467604.0,
        "selftext": "**\\*\\*EDIT: I shared an update (positive) in comments section, as 48 hours must elapse in order make a separate update post. Thank you all for the thoughtful and compassionate responses.**\n\nBackstory: I (32F) have been with fiance (34M) for several years. I've been in therapy since 21. I am admittedly a \"work in progress\" as I always will be, though I would like to think that I try as hard as I can and have developed some strategies to utilizes when things seem to be spiraling. This has allowed me to have a stable home life, relationship turned engagement, and I've always been able to hold down a decent job.\n\nMy fiance does not have mental health issues, but often acknowledges that he wishes he was in therapy to deal with how he handles frustration and crisis situations. He has insurance, but can't seem to find the time to make an appointment for himself. He respects and is proud of me for going to therapy myself and when I become extremely anxious about situations (even about things related to our communication) he encourages me to talk about it (but not in a diminishing or gaslighting way).\n\nPrior to COVID, I (like most others) went to see a therapist in-person. Now it happens virtually, and I actually find it more effective for some reason. When I talk about really difficult subjects I'm processing, I tend to raise my voice and cry. Fiance and I live in a small apartment and it has happened so far that he has been out of the house during my sessions, so this issue hasn't yet come up.\n\nToday, fiance unexpectedly came home for lunch in the middle of a session. I knew that he'd come back at some point but wasn't sure exactly when. While on the phone w therapist, I was pretty viscerally upset and going off about some deeply-rooted, abuse related issues about family and ex. Fiance got home and walked towards my room to say hi and opened the door. He walked on me me speaking about something in abstract, and quickly left the room. He went into the living room and put on a podcast, maybe in an effort for me not to be worried that he was eavesdropping. So I figured he wasnt listening and continued to vent (about past resentment). Then But then I heard some shuffling outside my door in the hallway and when he coughed accidentally, it made clear how close he was. It was a super awkward situation all around and I'm not sure how I should have handled it.\n\nHe then left the apartment and I'm not sure if I upset him. I'm also wondering if I messed up by not warning him in the morning that I would be in an appointment later. I had a million other work related things to do today on the forefront of my mind. I texted him that I'm sorry I missed him, and no response for an hour.  If I did in fact upset him, not sure how/if to apologize, so any advice would be appreciated.\n\ntldr; fiance came home unexpectedly, most likely overheard me venting about serious issues unrelated to him, left abruptly and I'm afraid I upset him",
        "permalink": "/r/relationships/comments/ih4r1x/my_32f_fiance_34m_walked_in_on_my_therapy_session/",
        "comments": [
            "Why do you think you may have upset him? Your fiance knows you've went to therapy for years, regularly. He obviously realised you were in a session when he walked in. I don't think you did anything you need to apologize for, or anything that would've hurt your fiance.",
            "If it were me,  I may have coughed on purpose so that you knew I'd be walking near the room in case you wanted to keep what you're saying private from me. That was my first thought since he also turned on the podcast, possibly to assure you that he wasn't overhearing you. Definitely speak to him about it when he comes home though, and I hope whatever he has to say will ease your mind.",
            "**UPDATE:** \n\nSo as many of you speculated, I was being overly anxious. I didn't hear from fiance for awhile, but it turned out that he was busy. After coming home, everything seemed to be fine. He then asked how my day was, and I just blurted out what I outlined in the OP. I told him that when he got home I was in the middle of a therapist appointment. He said he figured that out pretty quickly after he first saw me, left the room and put on the podcast while making lunch in hopes that I wouldn't feel self conscious for the rest of the appt. I mentioned that I heard him in close proximity the room at one point and felt a little anxious that he may have heard something that upset him. He said that he did go to the bathroom (closer to the room I was in) and that he could hear me, but any words were inaudible. \n\nThe bottom line is that he wasn't upset, if anything, a momentary tinge of awkwardness. He said that he feels positive that I care enough about myself to try to work things out in therapy. From now on, he knows when my appointments are so will try to make himself scarce during these 40 minutes for my own peace of mind. \n\nOne thing I do want to address is that I have not been seeing one therapist for 10 years. In fact, I've seen a few, due to relocation, changes in employment/insurance coverage, and in one case it was a bad fit. It's not uncommon for people to change primary care doctors over the course of a decade and this isn't much different. As to why I posted on Reddit afterward: I was curious about what people thought. It's not abnormal to want insight from people in a non-professional setting. \n\nAs far as therapy not working because I've been going for a decade, and those who think my talking about ex means I'm not over him: the damage incurred by PTSD (in my case via physical/emotional)v abuse is something that will never be entirely \"fixable\" and I don't really know what to say to anyone who tries to argue otherwise.",
            "[deleted]",
            "I’m exactly the same in therapy. I think it’s normal and absolutely nothing to apologize for. Try not to jump to a conclusion about how your boyfriend felt or why he was acting that way. It sounds like you generally communicate well so just talk it through and figure out what happened.",
            "Being with someone for several years and your 30s I would hope you two have worked out a way to communicate with compassion and understanding.  If not then I would suggest that you two take a couple of classes or have a couple of sessions around that skill.",
            "Is it possible that he came to the door to say goodbye before heading back to work, heard you were still with your therapist, and decided to head out without interrupting? I know I've done that before.  Not really eavesdropping, just hesitating before knocking or barging in on someone, then realizing that they're busy, so deciding not to interrupt. \n\nOn the other hand, if he was deliberately listening in on your therapy, that's deeply uncouth so I hope he wasn't doing that.\n\nObviously, the best way to know what he overheard and how he feels is to talk to him, and to maybe offer some sort of context if he happened to accidentally overhear something that needs that background.",
            "Sounds to me like he tried to give you your privacy after he realized you were on a call, realized that the podcast wasn't cutting it, and left to make sure you had your space. Is the bathroom on the same hallway as where you were doing your call? He wasn't necessarily listening in, he might have just been walking by. \n\nMy advice is to not wind yourself up about this and talk to him when he gets home. It doesn't need to be a big deal conversation. There's every chance he was just trying to be considerate.",
            "this sounds like your anxiety more than anything, but you should communicate",
            "I'm doing therapy from home, too. Hiding while a partner is there is really uncomfortable. I think there's a chance he's embarrassed. He saw you in a way I'm assuming he hasn't before. It might take some time to figure out how to talk about it. Especially if he's not had much experience with therapy. Good luck.",
            "Is it possible he was just passing by the door and literally either just 1. Had a cough and it wasn't an accident bc he wasn't trying to eavesdrop or 2. Intentionally coughed to indicate he was close to the door and could hear you in case you wanted privacy. Honestly you kind of sound like you're expecting him to be upset and projecting that onto him",
            "Could be nothing the answer will be there when he comes back",
            "My husband sometimes has a hard time hearing about my past, it upsets him, not because he’s upset with me, but because it hurts him to think about me being harmed. \n\nMaybe he’s processing what he heard and he’s upset, but not *at you*.\n\nDoes that makes sense?",
            "\"That was a little awkward.  Next time do you want me to warn you if I have a session?\"\n\nThen let it go.\n\nThere's nothing here that warrants a major apology.",
            "So just checking... he came home for lunch, and then left again, and you haven't talked to him since then? So... you don't actually know if he's upset?",
            "Why not talk to him about this instead of reddit?",
            "Why not just... talk to him? Literally all people here can do is speculate. Like, “I noticed you left kind of abruptly. Was anything up with that?”",
            "Just talk to him. Honestly, I don't think anything bad happened here, but I do understand it makes you anxious. That's how anxiety works. At least for me it works that way. And his lack of immediate response causes this snowball. Stop and breathe and try to be positive. And talk to your partner. Everything is gonna be fine.",
            "As someone who also suffers from anxiety, your line of thinking is exactly what I do too. I worry about all the little tiny signs that *might* mean something is up and freak out about it for hours before confronting the situation. Just ask yourself what the worst case scenario is: he is upset about something he heard. If so, I’m sure you guys can discuss it and work through it together. It’s never the actual outcome that is the end of the world, it’s your anxiety and fear of the confrontation and possible problem that are messing with you! Best of luck in talking about this, hopefully it is just a misunderstanding!",
            ">  He went into the living room and put on a podcast, maybe in an effort for me not to be worried that he was eavesdropping... But then I heard some shuffling outside my door in the hallway and when he coughed accidentally, it made clear how close he was.\n\nSo, uh... that kind of sounds like he *was* eavesdropping? He made it seem he was listening to something in the living room and couldn't hear you, then came to stand outside your door and you only knew he was there because he \"coughed accidentally\"?",
            "I think you're overthinking this, your fiance was probably trying to give you space, and there's absolutely no reason why he should be upset.",
            "There's really nothing that internet strangers can help you with until you talk to your fiance and find out what's going on.",
            "Don’t worry today about what you can put off worrying about till tomorrow! Stop yourself now in the negative spiral of anxious thoughts. You don’t have enough information. No amount of thinking will give you more information. Talk to him and get more information. Then you can deal with facts, not hypotheticals.",
            "So talk to him, ask him if he's bothered and ask him to be honest with you about it and you be honest with him. \n\nIt's really that simple.",
            "If my wife was yelling and crying to her therapist... Well, I'd assume it was something I did.\n\n\nShe's nice enough to reassure me that it isn't.\n\n\nMaybe he's worried that you're upset at him about something and you're not telling him about it. But *obviously* he can't ask you, because he only overheard something during your therapy session.",
            "He may be feeling bad for not being there for you or not able to share your frustration and pain. I think maybe you should tell him staff that is bothering you.",
            "Hello 👋,  im new(er) to reddit. In this situation why not just ask him if he heard any thing and or was curious? This is worth posting on the internet? Hes probably sitting right next to you. My girlfriend loves reddit I guess it more of a sharing feelings anonymous thing online? Right.",
            "You don’t apologize. That’s a private session. If he is upset he should come talk to you about it. You can open a dialogue but don’t apologize for processing your feelings in a healthy way with a professional.",
            "It's not about him, he has no reason to be upset, and if he *is*, he needs to consider *why* he's upset after eavesdropping on a private conversation.",
            "It sounds like your anxiety is getting the better of you in this situation. Remember not to mind read — it is never helpful! Talk to your fiancé and go from there. \n\nOn another note, I have to say that it sounds like your therapy may not be terribly effective. I know that on Reddit we sort of normalize being in therapy for years and years, but there ARE treatments and providers who can help you with anxiety / trauma to the point that you can take breaks from therapy or be done altogether. These treatments are pretty different from what you’re doing now — you almost definitely wouldn’t spend years rehashing hard stuff from childhood. Of course, if your current treatment is what you’re looking for, disregard this idea! But if you’d like something more effective, consider looking into a CBT-focused therapist. There are other good options but a good CBT therapist should know about those as well and can help you!",
            "Wait what???? You have no idea if you upset him or not...just ask? Why are you even here?",
            "I haven't seen it but, you have nothing to apologize for. Please do not apologize for a therapy session that no one but you and your therapist is supposed to hear. If he did in fact continue listening that's a whole other thing and is not ok. If not and he is upset it isn't justified, talk to him but you shouldn't be feeling soguilty OP.",
            "If you are at all concerned about this happening in the future, then I’d recommend starting a shared online family calendar with him, and putting your therapy appointments in there, so that if he happens to come home unexpectedly, he’ll know not to interrupt during the session. (My husband and I do this with Apple’s Calendar app for all of our medical appointments, but it was especially helpful when I was doing teletherapy.)",
            "He doesn't get to be upset if he was eavesdropping.",
            "Sounds like your making a mountain of a mole hill. Has he done anything to make you think he was upset? The facts are he came home for lunch, went to say hi to you, interrupted your therapy for a quick second, listened to a podcast, ate lunch, and coughed by the door. I mean given corona that we live in that cough can be allergies, the cold, COVID? I would definitely work on the anxiety and believe me I saw someone for mine. I’m in a lot better mental state now that I can break down events to be like okay look at the facts only.",
            "If he’s upset, he can do something about it. Sounds benign to me. Just do you.",
            "I’m very curious how this turns out!",
            "He probably just felt a bit awkward.  Don't worry about it. And the best way to find out how someone feels is to ask them. So, just ask him.",
            "We are in a new world for now. Discuss it with him. Tell him that you need this total privacy for your sessions. Try and schedule them for a time when he will not be home. But then make up a sign that says “Session In Progress”. Then put the sign on the front door every time you have a session. But remember to remove it when you are done. If he loves you, he will honor that. Then ask him if there is anything similar that you can do for him to give him some private time.",
            "Is it psychoanalysis?",
            "You have a great fiancé and I am happy that you are still continuing to go to therapy. Hopefully, you will be able to resolve some of these issues someday!",
            "Your fiance, as you've described, encourages open communication. By assuming he's upset, are you implying that you have been keeping some things about your past private from him?",
            "Sounds to me like he was just trying to give you space and was being thoughtful! If he is upset you will find out and then you can ask him what he's upset about. Nothing you said sounds like something that might upset him so much he would refuse to answer you.",
            "I'm so sorry I don't have any good advice for you love...just wanted to say I hope you guys figure it out.<3",
            "I don’t see anything you should be sorry for",
            "I think you should leave him or talk it out. Think about it.",
            "Why would you need to apologise? He might have had a rude awakening as to why you're in therapy. If there's deep routed childhood issues that you haven't discussed with him (you absolutely do not need to) he might be upset that you had a hard time.\n\nWait until he comes back, sit down and ask him what's wrong. You can only go from there. But do not think you're to blame. He eavesdropped on a conversation that had nothing to do with him. He's in the wrong, not you.",
            "My ONLY thought as to why he could be even slightly upset, is that he came home during lunch expecting to spend time with you but you were in a session instead. Which honestly, is on both of you. He didn't let you know he'd be coming home and you didn't let him know about your session.",
            "I still talk every fortnight to my doctor who l first saw in 1991. After working on the big stuff she acts as a supportive listening person. I have a major role as a carer and l have someone neutral who knows my situations and can provide support when needed. I don't think you ever get used to abuse and emotional distress. You can band aid but its a part of you now. I find the phone easier as l can't say somethings when l am sitting opposite someone. I am sure he understands you and is a good partner. Best wishes for the future",
            "What was his response when he finally texted back?\nHow did he act when you saw him after work? \nI think he’s probably embarrassed cuz it seemed like he was eavesdropping...maybe he thinks you’re mad.",
            "Ehhhh, he was probably coming to say goodbye, and then thought better of it (when he heard you were stll in the session, and then just felt awkward). I would just bring it up casually with him when he gets home - it's probably nothing.",
            "Gotta love a happy ending, and you and your fiance are the people that deserve one. I 100% understand being anxious that your partner is upset with you, especially when your ex was abusive. I struggle with the same thing. Abusive ex trained me to walk on eggshells. You are amazing for working hard to overcome your issues, and your fiance seems supportive. *hugs*",
            "So he listened into a private conversation he KNEW wasn’t for his ears? Do not apologize. He went across a boundary of respect. You need to communicate and explain. It’s up to him to want to hear.",
            "I can’t believe I spent my time reading till the end just to read that you hadn’t even talked to him to find out if he was upset, and decided to ask Reddit instead. To see if we say what? How could we possibly know? We don’t know your fiancé and based on the info you gave we wouldn’t know either. God I was this sub was filtered sometimes",
            "I feel like 99% of the issues in the sub could be fixed by talking to your partner. I don’t think anyone on the Internet’s gonna know if you upset him. You can only ask him that question.",
            "Have you considered talking to him instead of jumping to conclusions?",
            "My girlfriend has been through some shit.  I'm not going to go into it.  But it's fucked up.\n\nAnyway.  She's told me the story a few times.  Every time I don't know how to react or how to handle it. \n\nMy advice is to sit down and talk to him.",
            "Hey, I just want to say, be careful with labeling yourself a \"work in progress.\" That label on yourself can be damaging to your self esteem and be a self fulfilling prophecy. We are all works in progress. You have your struggles and you are invested in self improvement. At the end of the day, we are who we are, and we can only try to be better people. I'm proud of you for striving for self improvement - but please be careful not to pathologize yourself, as it can cause more damage in the long run.",
            "So say he doesn't have mental health issues but can't handle frustrating or crises and also the fact he stormed out rather staying and talking about the situation tells me he has mental issues. Sounds like anxiety which can turn into anger very quickly if extreme pressure is presented. Also no one needs therapy for life. With a good therapist they should be able to help you with providing mechanisms for the situations that require it. I can tell you before therapy I was like your husband and now after I can now go into any situation and handle it a hundred times better. It's not like the pressure goes away but the mechanisms that were taught to me help me handle the situations without anger.",
            "Maybe he left to give you some private space with your therapist. And anyway, why should he take *your* therapy sessions personally? You might wanna examine why you asume the worst before getting all information (is it from past experiences). Why should the first thought be that you’ve upset him especially if you weren’t speaking about him? He already knows you go to therapy and as you’ve said, he’s supportive of that. Another perspective: have there been other instances where you were doing something for yourself and he got upset (if it has nothing to do with him he shouldn’t get mad). \n\n\nIt shouldn’t be upsetting to your partner that you choose to work through problems—they should commend you on it. Do you maybe subconsciously think he actually looks down on you for going to therapy? Is that a projection or fact? The only way to find out is if you ask him: “have I upset you? Why did you leave the apartment?”\n\n\nSending good vibes~",
            "Op, update? I'm hoping he wasn't upset with you, as he really has no right to be.",
            "Therapy for 11 YEARS and no end in sight?\n\nReally?\n\nSomeone's been taking YOU and your insurance company for a financial ride and making a whole lot of money off of you for **far too long**.  Since when does it take 11 years and counting to deal with your issues?\n\nHonestly.  Go to someone else. This one isn't helping you at all.",
            "You're such a kind soul. You have such a beautiful heart. \n\nI wish you, and your fiancee, a life full of love, sharing, and satisfaction.\n\nYour fiancee definitely heard more than you realize, but since he hasn't freaked out, let alone SAID anything... I think it's fair to assume that he just wants you to do whatever it is that you think will aid you in your healing process. \n\nYou CAN apologize, and I think that it would bring you two SO CLOSE!! \n\nYou don't need to talk about what you were speaking to your therapist about.\n\nYou don't even need to apologize at all, but if you feel you want to, it'd do nothing but bring more positivity into your relationship.\n\nYou don't realize how awesome you are. Yet. Keep going!",
            "Was probably just concerned about you and wants to know what your issues are at a more intimate level.\n\nThis is absolutely the wrong way to handle it and a violation of your privacy. He was likely in the wrong (unless he was leaving the bathroom or something before he had to head off to work). But it probably wasn't anything intended to be bad and he's likely not angry. That said, you need to have a serious talk about boundaries with him.",
            "If I was him I’d be ashamed that I had so shamefully and obviously violated the trust of my spouse by eavesdropping on their therapy session. I don’t see anywhere where you would have upset him unless you were speaking on important things he did not know about.",
            "If you're going on therapy for 10 years it clearly doesn't work and you're wasting money.",
            "You have nothing to apologize for.  He owes you an apology for eavesdropping.",
            "Upset him?  He was eavesdropping on personal information and he KNEW that you were in therapy at the time.  What he did was a HUGE breach of trust!",
            "11 years of therapy? Wow.",
            "Why are you worried about how HE feels?\nHE violates YOUR privacy and eavesdropped during your THERAPY SESSION. This is so so so wrong!!!! Do NOT apologize for anything!! \nAlso, the “he can’t find time to make a therapy appointment” is complete bullshit.",
            "[deleted]",
            "Tell him that in a relationship resentment can build up and even though it sounded like you were telling therapist about how awful he was, you were actually clearing that resentment so that it can no longer pollute the relationship."
        ]
    }
]