[
    {
        "post_id": "51fpp3",
        "author": "StolenFirstDance",
        "title": "My best friend/best man [24m] stole a wedding idea from me [23m]. My wedding is in a little over a week and I'm freaking out. Am I being petty?",
        "url": "https://www.reddit.com/r/relationships/comments/51fpp3/my_best_friendbest_man_24m_stole_a_wedding_idea/",
        "score": 3080,
        "num_comments": 486,
        "created_utc": 1473175366.0,
        "selftext": "Kyle and I have been best friends since junior high. I'm not going to go into massive detail about our friendship, but he's really important to me and we've been through a lot together.\n\nAnyway, fast forward a decade or so and Kyle and I both get engaged around the same time to two wonderful women. It's been really fun planning a wedding with another couple and my fiance, Kacie, and I love having them around.\n\nNow, Kacie is a bit of a control freak. She has mostly had final say on everything in the wedding, not that I'm complaining. She has better taste than me and the wedding is going to be really beautiful thanks to her.\n\nThe one thing she has let me have complete control over is the first dance. I was ecstatic. I really wanted to show her how much she means to me with this dance. I picked out Peter Gabriel's \"The Book of Love\" and edited a video of pictures of her and I growing up, meeting, and falling in love. And then I commissioned an artsy friend of mine to make a literal Book of Love with all our pictures in them. I've cried every time watching it. The whole thing is going to be a huge surprise for her.\n\nThe only other person who knew about this was Kyle. He kept saying how cool it was I was doing this and how he wished he'd thought of something like it.\n\nKyle's wedding was this weekend. And holy shit, their first dance was to Book of Love and he edited a video of their baby pictures and their relationship. My heart fucking sank like a brick. He wouldn't talk to me during the reception and hasn't responded back to any of my texts.\n\nWhat the hell do I do? I can't go through with my plan. Our social circles intertwine and I'll look like I stole his idea. Should I just tell Kacie and have her help me with a new idea? Do I tell Kyle he's not welcome at my wedding? Or am I just being silly and just go ahead with my plan despite how I feel?\n\ntl;dr--Best man stole my wedding idea a few days before my wedding.",
        "permalink": "/r/relationships/comments/51fpp3/my_best_friendbest_man_24m_stole_a_wedding_idea/",
        "comments": [
            "Yes, tell Kacie, show her the book you made to prove it was your idea. Now work with her on how to handle the wedding. You can be romantic, but practical. Maybe she can help think of a new song. Lazy Kyle didn’t do a book, and everyone does a photo montage anyway.\n\n",
            "I agree that what your friend did was shitty and pretty sad, but I think given that your wedding is so close you just have to let go of it for now. \n\nYou can still give your fiance the book and the video, I think she will love it and it's still an incredibly personal thing. They are your photographs and your unique story after all. She will always have it to treasure and to look at, it's not a total write off.\n\nI'd tell her the truth about what happened before the wedding. She deserves to know that you did put a lot of effort in and that it's unfortunate that your friend messed it up for you. She will still see how much you mean to her.\n\nTry to look at it positively, now you can choose a song together that you both love, something that is deeply meaningful to you both. ",
            "The fact that Kyle is ignoring you is a pretty clear indicator that he knew what he was doing wasn't going to be well received by you. Since he can't even be bothered to respond or give you any sort of explanation I would send him one last text stating that he's no longer welcomed to your wedding. At this point he should know what he's done.\n\nSome people may say that's too much but honestly he's ignoring you after copying something you put a lot of work into. Getting inspiration from you and asking your input is one thing...taking something that was personal to you is another.\n\n\nAs for telling your fiancé I think it's best to tell her before the wedding. I know it will ruin the surprise but if you decide to tell Kyle not to come chances are she's going to be worrying all day about what happened and wouldn't be able to enjoy herself.",
            "Full disclosure to your wife, and work on a new idea together.  \n\nShe needs to know, especially since you two were close to Kyle and his bride.  It can help aleviate her stress if they don't show to your wedding.",
            "[deleted]",
            "I would show Kacie the video and give her the book and tell her that you made it first and Kyle stole the idea from you. I would then tell her that you uninvited Kyle and picked another best man because you should considering that is a really shitty thing to do and he knows it. He's probably expecting it, honestly. I would probably still play the video but change the song since the wedding is in a few days.",
            "Your friend is an asshole. \n\nIt's petty maybe but he ignored you for a reason. \n\nI wouldn't want to be someone's friend if they stole ideas and ignored me to avoid admitting how shitty they are. \n",
            "Tell Kacie, she's going to be your wife and partner, show her what you did so that she knows that you aren't just pulling the plug because you didn't have a plan.\n\nHe knew he sand bagged you, dis-invite Kyle from the wedding, and your life.",
            "Make an announcement at some point saying \"I came up with this idea quite awhile ago and loved every minute of making it.  I finally finished it on (date) and am so happy to share it with all of you. \"\n\nYou could also add in a \"I really knew it was a great idea when BFF was so wowed with my idea that he did it himself.  He did a great job on his, but I must say I'm partial to mine as it features my beautiful new bride\".\n\nIt's okay to brag a little, you put lots of time and effort in to it.",
            "Is your first dance outside? If it is, then go to the closest party store and buy ALL of the sparklers and a whole bunch of lighters/matches. At some point, give them to someone you trust (cousin? Friend not in the wedding party?) and have them hand out sparklers to all of the guests. Tell them it's a surprise for the bride, and to light them during the first dance. Get the DJ/Band to lower the lights REALLY low at the start, so she is almost in the dark. Have everyone primed to light the sparklers as soon as the lights go down. Turn the music WAY up, so it's loud and dark and then the sparklers come on. You can still project the pictures, but instead of having them project onto a screen, have them project onto the whole wall if you can. Oh, and pick a new song. \n\nIf your wedding is inside, get a couple different fog machines and give out candles. Get the guests to make a ring around the dance floor (these directions can be given to them at the same time as the candles) or to take the candles off of the tables and surround the dance floor with them. Again, have the lights go down, candles go on, and fog machines flood the floor. Turn up the music and you can still project the pictures, but bigger. Against the wall. \n\nYou can do this, and you can do it better. And after you do it you tell him that what he pulled wasn't cool at all.",
            "I wouldn't change a thing, honestly. Your friend circle intertwines now, but that won't always be the case. You put a lot of work into this. Explain to your bride that your friend is a bit of a shit and stole your idea.\n\nAt the reception, before you kick things off, just announce, \"here's something I've been working really hard on to surprise my bride. Special thanks to my \"best friend\" for beta testing it at his own wedding last week.\"\n\nETA: I'd just tell Kacie beforehand about your friend's douchebaggery. ",
            "I'd recommend posting this to r/weddingplanning or r/wedding to get their feedback as well. I'm recently married and would be really pissed off and would probably consider not uninviting him but removing him from the bridal party. \nIt's totally up to you and your wife though. I think you should talk to her and get her input because that was really shitty of him, but you may not want to end your friendship over this either. Best of luck to you both ",
            "So pick something new (that will surprise your bride) and commit to killing it - then in private (and AFTER the wedding) admit to her that you had worked on something that you discarded because you felt like it was going to be viewed as a copy.\n\nOr ask Kacie if she'd like to plan any surprise for your wedding guests together... then later show her your work.\n\nKey point here is that to you this \"surprise\" has become tainted and you are going to be overly sensitive about it now.  You don't want to deal with that baggage on your wedding day - nor should you.  If you think it won't be - then who the hell cares if someone else used it.\n\nYou are the creative genius on this venture - so spin your own ideas and make it great.  \n\np.s. A really good one is to prepare loads of things/notes to string out on your honeymoon.  A card on her pillow for her to find after getting ready in the morning... or surprise activities.  That will be 100% for your bride to enjoy and that is who you want to impress anyway right?",
            "Well, your friend is a real asswipe for sure.  Here's what I would do:\n\n* Remove him from best man duties effective immediately. Explain to your fiancee that you guys had a disagreement and he's been ignoring you ever since. Work with her to ensure that the best man duties are covered by whatever replacement you choose.\n* I would not personally uninvite him to the wedding since his wife and your fiancee seem like they're probably friends? I also think there's a chance you might regret excluding him once your wedding and the feelings from this blow over, and I don't think you'll regret inviting him in the end. I'd stick him at table 47 with a bunch of strangers for sure though. \n* Set the video to a different song - I know this feels VERY personal to you but truthfully, I've seen about a dozen photo montages set to romantic music and no one will bat an eye thinking you \"copied him\". Hell, they probably wouldn't even notice if you did keep the music the same... but I think it will bother you so I'd choose a different song. Maybe there's something that's very specific or personal to your relationship with her? If anyone does bring up the similarities, I'd just smile and say, \"Yes, I showed Kyle my montage a few weeks back - he obviously thought it was a good idea!\"\n* I would then, during your honeymoon or another time after the wedding, present her with the ACTUAL Book of Love that you made her, explain what happened, and ask her to share the actual first dance you had in mind privately with you. Play the song and dance together. GUARANTEE this will make this all the more special, because it's a memory between just the two of you and not a show for all of your friends and family.\n\n(edit for formatting)",
            "Can you replace the song for the video? I get that it has a whole theme going because it's a literal book and the song is called Book of Love, but a scrapbook fits in with any song honestly. You can explain to your wife what happened afterwards, but I would actually say you shouldn't say anything beforehand, just try to switch the song last-minute. No one's going to think you copied him because you also did a photo montage because those are pretty common for weddings; in fact, they may even think that you two planned it to be similar.\n\nYou can still make the surprise work!",
            "The growing up montage video thing is actually quite common. I have seen it in several weddings. What is not cool is to choose that same song and he knows it, as shown by him avoiding you. And this really sucks because you put so much effort into it and even got the literal book of love to match with the songs. It's not as simple as choosing another song because there is meaning behind you choosing yours. All he needed to do was to pick a similar song. It's like stealing someone's ice cream, takes a bite of the waffle cone then say 'welp, I'm full' without even eating the actual ice cream! I would panick if I were you, too. \n\nI would tell him that he better explain himself or he's uninvited. Of course depending on his answer you can still boot him anyway. I doubt he can have a proper excuse though.\n\nAs for the wedding, being so close I think you can only choose a different song or brainstorm a new idea with your wife. However when you tell her what happened, I think you should still make it romantic and a surprise. Have a nice dinner, candlelight, whatever you kids do for romance. Tell her the fact that you've planned this for a long time then present her the book with the music. So the book can still be remembered as a special moment without being heavily associated with the betrayal of your friend. After the moment, tell her exactly why and discuss what to do as a team, like married couples do.",
            "Try really hard to come up with something else you can do, maybe even along the same lines. Then on your honeymoon, or on the night of the wedding, show this to your new wife alone - explain that you worked on it and that although kyle copied it you thought of it for her. She deserves to see it.\n\nYou also really need to get a good answer from your friend as to why he would deprive you of something so special for his own benefit. If he is avoiding you, he knows he wronged you. You need to hear why so you can decide how to respond. ",
            "I think you should tell her, but try to tell her in terms that won't ruin all of the surprise.  Mention that you told some of your wedding ideas to Kyle and he used some of them in his, but not all of them because you did plan some things on top of that.  The fact that you have that book is a big benefit, and really speaks to your planning.  Just wanted to say that it's very cool.\n\nAs far as Kyle, the fact that he's not answering says a *lot*.  I don't think anyone would blame you for excluding him; he might've excluded himself. ",
            "Could you replace the music on your video? it sucks that your friend screwed you like this so close to your wedding.\nI would NOT MENTION IT AT ALL and let him stew. get through the wedding and pretend you forgot completely about what happened. Tell your wife afterwards, she will tell his wife, your wife will know you are the romantic, his wife will know his 'touching gift' was a stolen idea that seriously hurt his 'best friend's' feelings. \n\n\n",
            "Out of the Blue by The Band. I always loved that for a wedding song. No pressure though.\n\nBut I do think you have to tell her that your friend is a lazy thieving single-celled louse. Because, man oh man, is that crummy. Like, the crummiest. He fucked you. \n\nUsually the whole people 'stealing my idea' thing is absurd--no, that's not YOUR baby name and yours alone, aunt Delores. But I'd be livid if I were you. And now he's ducking you like the truly sniveling yellow bellied worm he is.\n\nTell your fiancé, some version anyway, while salvaging what you can of your idea. And tell the worm that until you have an actual conversation, and maybe even afterward, his presence at your wedding is no longer a sure thing. And since he's dodging you, you just hate that you'll have no choice but to talk about this with his new bride.",
            "There's no wrong answer here--I would go with whatever you feel will stress you less. If it were me, I would probably present it to Kacie privately tonight--that's who this is ultimately all for in the first place. Yeah, it's really nice to impress your friends and family as well, but you did this because you know how much it'll mean to her. I'd preface it with something like, \"Kacie, I want to show something to you. I came up with this a long time ago and planned to make it a surprise, but after Kyle's wedding, I would prefer to do it now ahead of time.\" Maybe play the song and dance with her and then show her the video and book. Then, together, you guys can decide if you want to show it at the wedding or pick a new song, one that won't have the same association as Kyle.  \n  \nThat being said, even if you do show it at your wedding, your wife will know how much you cared about it and you can explain about the overlap afterwards.  \n  \nAs for Kyle, I wouldn't say that it's an automatic friendship breaker, but it's close to it. I would sit down and have a conversation about it (if he contacts you) to get to the bottom of it. If he doesn't...well, it's hard to come back from that. ",
            "make yours much better than his. Get excerpts of people talking about you two and how wonderful you are. Example from something mom might say \" I knew she was the one for him when I saw how he looked at her. I never met anyone so perfect for my son and we're blessed to be adding her to our family\" - This with the music going quieter and the pictures of you two... from multiple people etc. \n\nfuck him, rock your idea and make his rendition look like what it is - a 2nd hand idea",
            "He is your best man, the wedding is in a week and he is not responding. Send a message to both him and his wife telling them they are no longer in the wedding party and invited if they don't explain themselves tomorrow. \n\nDoes he intend to ignore you until the wedding day and show up at the last minute at the church or is he planning to ditch you  and your wedding all together?\n\n\n",
            "I hate to break it to you, dude, but this is not exactly an original idea.  Which is not to say that Kyle didn't swipe it wholesale from you, and that he's not an ass for doing so.  But unless you've got an alternate song that would work just as well, that doesn't mean you should change your plans.  If anyone comments on it, just grin and say, \"Yeah, I've been working on this for a while, and I guess Kyle was inspired by all the conversations we had about it.  You know what they say, imitation is the sincerest form of flattery!\"\n\nAs for what to do about his participation in the wedding, be clear that he needs to talk to you if he's still interested in the best man gig.  If he doesn't, problem solved.  If he does, and you don't wind up clearing the air before the wedding, you can keep his duties to the bare minimum, and either decide what you want to do about the situation later or just fade out.",
            "Your second problem is that your best man is ghosting you and I think you need to consider the possibility that he will not show up. For that reason alone you need to come clean with Kacie so that you can work together on a solution, which at minimum means you need a standby best man and standby reprints of the wedding program. ",
            "Go through with your original plan but use The Magnetic Fields' version of The Book of Love because it's THE ORIGINAL version of the song (I like it better anyways) and that will send a message that you're the original",
            "It's YOUR wedding.  Do whatever the hell you want.  This is about you and your wife and this special moment in your relationship.  Keep your plan.  Don't be more worried about people thinking you copied him than you are about your wife's happiness and the look on her face during the first dance.  You're allowed to be annoyed with him, but really, just let it go.  You don't need the drama right now.",
            "That's a big bummer and very rude of your friend. I would definitely be upset too.\n\nIf I was your wife, I would want to know that it was your idea and I would want to know how much hard work and creativity you put into the project.\n\nWhat matters is that you care and that you wanted to do this.\n\nTell her and ask her what she wants to do. But in all honesty, I would also go with your original plan. If anyone says anything, be honest...but more likely than not, people won't say anything.",
            "I think you need to talk to your wife. Show her the montage and the book you made and explain what happened. It can still be a special thing for the two of you to share (maybe on the honeymoon).\n\nKyle...is a dick, and he knows it. That's why he isn't speaking to you. I think the best thing to do there is speak to Kacie and discuss whether you'd rather have someone who'd do that in the wedding pictures forever and ever, or the drama of kicking him out of the wedding party.",
            "As everyone else has said, you absolutely should tell your (soon to be) wife what happened so she can see how much effort you went to and how seriously you took making this part of the wedding special for her. \n\nHowever, she's a week away from her wedding and is doing most of the organisation so be careful not to drop this in her lap like \"so, what do we do now?\"  Go into the conversation with ideas for alternatives so you're not putting another bit of planning onto her plate. Ask for suggestions but make clear that this is a problem you will address, with her suggestions if she *wants* to make them. But you will do the leg work, because she's got enough other stuff at the moment anyway. \n\nAnd Kyle is a massive asswipe. ",
            "In addition to all the advice you're getting here, when you tell Kacie what's going on, let her see the texts you sent Kyle asking WTF.",
            "If you don't have an alternate plan, then the official story will be \"great minds think alike\".",
            "Show your wife-to-be, uninvite the ex-friend, and then STILL DO IT at the wedding, with a preface that you worked really hard on it and unfortunately your ex-friend stole the idea.\n\nPublicly call him out, do your thing, and enjoy the wedding.",
            "Time for a new plan - you'll have to tell Kacie, but you can tell her and say that you still want to give her the gift. I'm sure she will still love it. \n\nThen, hopefully the two of you can come up with a better song to have your first dance to. \n\nI would send Kyle an e-mail or text message. Tell him that you're extremely disappointed that he would so blatantly steal your wedding idea and not only ruin your ability to use it at your own wedding, but to ruin a surprise gift that you were planning to give to your fiance. Ask him if he wants to talk about why he did what he did and apologize, or if you should just assume his actions were trying to tell you that your friendship is over.",
            "Dude. Fuck that guy! \n\nOne thing I regret about my wedding is that shortly before hand, a bridesmaid and I had a falling out (really she just kind of disappeared from my life and hasn't talked to me since). I kept her in the wedding anyways... and I wish I would have just not had her be in it. \n\nI'd say at the very least, bump someone else up to stand next to you as your best man. Bestman/Maid of Honor regret is real. It may seem stupid... but it's real. \n\nAs for the situation... I would give your fiance the book now and explain to her what happened. Explain how you were so excited about how special you were making it that you shared it with him and he stole it. On top of her knowing/understanding the truth in advance... she will also be able to help you out with deciding how to move forward with the douche nozzle. \n\nOh, and for the record: If this was my situation... I would uninvite him. But maybe I'm petty? It was just a really horrible thing for him to do. And it was calculated... not accidental.",
            "Why doesn't kyle throw himself under the bus for the best man speech?  \"Now when it comes time for the dance some of you may find it familure, and I have a confession to make about that.\"",
            "The original version from the magnetic fields is much better. You should go with that.",
            "I am in the middle of wedding planning right now and your story gave me goosebumps and literally made me sick to my stomach. The fucking nerve! I told my fiancé about it and both of us agree on what you should proceed with: Tell your Fiancée. Tell Kyle's wife. Tell your friends, your family, everyone you know that Kyle is a fucking snake and what he did to totally sabotage a very important part of your wedding. Unfortunately you'll have to change your plans after that, but everyone needs to know what the fuck this asshole did.",
            "Can you sub out the song and keep everything else? Your friend is an asshole. ",
            "Yeah, that is one heck of a shitty thing to do.  It sounds like you've been through a lot with this guy, but you've finally seen his true colors.  When he's in a panic and the stressors are there, he is not against the idea of throwing you under the bus.  If the two of you are running from a bear, he's going to hit your leg with a stick to slow you down so he can escape.  Maybe this is a little hyperbolic or whatever, but I don't think this is someone you should hold in high regard or work hard to maintain a friendship with.  \n\nYou should definitely show your fiancée/wife the video and album and all that, but come up with something a bit different for the actual wedding day.  It sounds like you're a pretty creative guy, and it's a bit of pressure, but that's what makes some guys great.  Obviously your friend failed to handle this kind of pressure you are now under.  Good luck!",
            "The surprise has already been spoiled by your \"friend\", regardless.  It's just what happened, it was a rotten thing to do and can't be undone. Talk to your SO and see what she wants to do about it.",
            "It is way too close to game time to be changing something so meaningful and that took so much effort. Go ahead with your original plan, and enjoy it. Your bride will. \n\nThose pictures, and that book, are about you and her and your love, and nothing else. Will some of your friends get a laugh over you and Kyle doing the same thing for romance, again? Sure. But that's normal for you two, so no one will think less of you for being the one who got the slightly later wedding date.\n\nI don't know anyone who wasn't freaking out this close to their wedding, including me, but try for some perspective. It's a good idea (your friend sure thought so!). It's still a good idea, and your bride will be touched. \n\nDon't lose that book. She'll want to keep it forever.",
            "Explain to your fiancé that you had this idea way before he did, but considering he did the same thing, you didn't want her to feel bad. Make it a special thing for her and give it to her before the wedding so that it's still special. ",
            "Kyle is ignoring you, so I think you're well within your rights to remove him from the wedding(and your life altogether).",
            "I have been through the wedding planning process before, and I know how stressful it can be even without scumbag friends stealing your ideas. What Kyle did was seriously messed up, and he damn well knows it. If he's ignoring you, I would send a message to his new wife both uninviting Kyle and telling her that she is still welcome. She would then indirectly know that Kyle fucked you over majorly. The person to tell her what he did should be Kyle himself, and he 100% deserves to be backed into a wall.\nI would tell Kacie what happened, show her the book and prove that it was your idea, and then either work together or think of another idea.. It's awful that he did that, and I'm sorry. I hope this works out for you positively.",
            "I would explain everything to Kacie.  I don't think you necessarily have to jump to a new idea, but you can explain the situation and decide together what to do.  Personally if you were my fiance it would be the gesture that would be most important to me and that would matter more than whether it was unique and whether someone copied it.",
            "Tell your wife exactly what happened and show her the book. She will see you out a lot of work into it and she will also be upset that the surprise was stolen. Tell your best man that he has to own up to stealing your idea in his best man speech, in front of your social circle, or he's not welcome at the wedding. If he declines... Then you get to explain to your friends why he's not at the wedding and acting like a petulant child.",
            "LOL. \n\nI thought petty at first until I read all the details. \n\nSame circle of friends, yeah, explain to your wife that it was your idea and move on - think of something even better. And rub it in Kyle's stupid face. \n\nAlso, I don't know how close you are, but bros don't do that to bros. \n\nDrop him a few pegs in bro status. He is less bro to you now.",
            "Your \"friend\" Kyle is a douche. \n\nAs per some requests in here I'd say you definitely should show your soon to be wife. Let her see all the effort you put in so she knows you were thinking about her. *ALSO* and perhaps more importantly, this is a time for you to confide in your partner something that is troubling you. So you get two bonuses, you get for your partner to see how much you care and you get to strengthen your relationship by working through a problem and finding an even better solution! \n\nNow as for Kyle...I'd say the dude just isn't your best friend dude, and likely...not your friend. The fact that the guy hasn't even been able to muster up an apology tells you exactly the type of person he is. I'm curious about your history with Kyle as well, does he have a history of douchebaggery or is this an isolated event? \n\nI mean you've got a pickle here for sure. I would completely contemplate outing Kyle just so he can get his just desserts, but I don't know how you would do that without coming off as insane. But man would the justice be sweet if it turned out \"his idea\" was theft. Make that happen OP. You owe it to all of us...for science. Fuck Kyle.",
            "Be a complete bad ass and use the original, by the Magnetic Fields.  Or go modern and use the version 2Cellos did with Zuchero.  Your friend is a tool.",
            "Tell your fiance. Tell your parents tell, anyone who will listen. I would throw that dude soo far under the bus. If your fiance is ok with it, I'd go ahead and use it, it came from your heart, it was authentic. Your pal copied, he didn't pour his heart into it. What a slap in the face of his fiance. Blab to anyone and everyone. \n\nOr you know, tell your fiance and let her decide. I would hate for you to have to change anything since it was genuinely  from your heart, but I understand wanting to change. ",
            "Well first, I think you should find him and punch him in the throat.  That was majorly uncool.\n\nNext, I would go talk to your FI.  I would tell her that you are devastated but that Kyle stole your idea and that you have been working hard on a \"book of love\" surprise for her for your first dance and that's been taken away from you, you still want to experience it with her.  Have the song and the slide show rigged up, light some candles, and dance with her in your home.  Then give her the book.  It will be very romantic and sweet and you guy can spend some time reminiscing about your relationship before your wedding.\n\nThen afterwards you two can choose a new first dance song together, but you can both know what the real plan was and can have a special memory associated with it.",
            "Your social circles intertwine so he should expect other friends to find out eventually. \n\nI, personally, would change nothing. I'd tell your fiance what happened, and maybe before the dance make a light joke about Kyle's \"dress rehearsal\" and how much he loved your ideas....\n\nThen do the things you planned. It's a memory for you and your wife and your families.\n\nI wouldn't tell Kyle what you plan on naming your children, just in case. ",
            "Came here expecting to call you a baby...but fuck this dude, your best friend didn't just take a song or a cool idea...this was a grand gesture your wife would remember forever....again fuck this guy, if he would do any less than throw himself under the bus I'd be done with him",
            "Take that best of man of your's off the wedding invite. You deserve a better friend if i'm honest.",
            "The Book of Love was written by a band called The Magnetic Fields. Maybe use the original version instead of the cover?",
            "You can totally salvage this.  Do the introduction for the dance yourself and say something like \"When I first told Kyle about this idea for a first dance, he thought it was brilliant.  He thought it was so brilliant that he did it at his own wedding last week.  But today is about Kacie and I and together we're writing our very own Book of Love...\" \n\nOr something to that effect...\n\nIt will seem sweet that you guys decided to do it \"together\" and will not tarnish the day for your fiancee.  Now privately, you can totally write off Kyle for being an asshat and whether you decide to tell your wife what really happened or not, is up to you.  \n\nAlso, Kyle could have handled this so much better! Because it would really have been nice if you two planned it together....but whatevs.",
            "I agree with all the other posters that said you should tell Kacie ahead of time. I'm sure she will appreciate everything you did to make your first dance special and will be able to commiserate with you on how shitty your friend was for stealing your idea. I would have some back up first dance songs in mind when you approach Kacie so it will still be the one thing you had a big hand in for the wedding, but you can also make the final decision together. \n\nIf you're looking for alternative songs, my husband and I chose Future Days by Pearl Jam. The song hasn't been out that many years, and it's definitely not a song that many people will have heard played at a wedding before. In fact I imagine most of your guests have never have heard it at all, but the message is really beautiful and it is a good pace for a slow dance and a photo montage. You should definitely still go ahead with the photo montage by the way, you put a lot of effort into it and it will not look like you copied your friend because it is something a lot of couples do at their weddings",
            "Welp, I know what my first dance is gonna be",
            "Tbh I'd be a dick and just be all \"well I hope you guys enjoy this, [friend] thought it was such a good idea that he did one for his wedding as well...\"",
            "Might be too short on time but instead, why don't you film some short scenes that represents you both? Like funny situations that brought you both closer together over the years I.e reenactments. Something people don't know about. Just an idea.",
            "I'd give it to her straight and ask what she would like to do.",
            "No, no, no.....Don't change  a thing.  No one could ha e 'copied' this idea in a week.  Instead, introduce it with a lighthearted (sounding)  I have bern working on this for months as I had confided in \"Jerk who stole idea.\"  I didn't reslize how mych he liked the idea until last weekend at his wedding, but baby, THIS was all planned just for YOU.\"",
            "Sir down with her tonight, she play her the video. Then give her the book. Then pick a new song for your wedding together. I particularly like Goo Goo Dolls - Come To Me. I think if you make a list of all the songs in this thread, you guys will have an easy time choosing one. \n\nAlso, this guy isn't your friend. You may need to arrange for a back up best man.",
            "Um, wow. I'd reveal the texts about the book of love on FB so that you can prove that it was YOUR idea and not your former scumbag friends'. Also I'd recommend \"Take On Me\" by a-ha for the song. If you've seen the music video it's pretty good. ",
            "Kyle should be out as best man. No question there. ",
            "Wow. Your friend is a jerk. If this wasn't your wedding, an event you don't want to take the focus from, I'd suggest doing the original idea and announcing beforehand what Kyle did, so he can feel like you felt, but worse.  I don't have a good suggestion but I wanted to say I'm sorry this happened. ",
            "Your friend is kind of a douche, but you know?  I'd just go forward with your plans and if anyone mentions it you can set them straight.  Word will get around.\n\nIn the scale of everything that goes on during a wedding day and reception, I promise you this is a small thing and in a year nobody but you two will remember it either way.  Don't let this ruin your day.",
            "Kyle is lazy, but tbh I've seen this song and this idea in at least three weddings myself and I don't even know you. Pinterest, man, Pinterest. Your idea is out there already.\n\nNo matter what you do, the book you commissioned for your fiancé is going to be beautiful and meaningful to her, damn the song.",
            "Tell Kacie what happened.  Show her your video and the book.  Yeah the surprise will be ruined but guess what, the surprise is already ruined.  At least by knowing now, you can decide together whether you want to proceed as planned or change the song.\n\nI would also disinvite your \"friend\".  The fact that he's been avoiding you shows he knows how shitbag of a move it was, not just some honest mistake, and yet was perfectly comfortable making himself look good at the cost of making you look stupid.",
            "The fact that he's not contacting you at all makes me wonder if he still even plans on being your best man.\n\nDo yourself a favor and get rid of the stress - uninvite him and pick a new man.",
            "I absolutely wouldn't let him come to my wedding. Let him explain to his wife why their invitation was revoked.",
            "Get a new best man and demote him to \"regular guest\". How could you trust him to have your back now after he stole your idea? \n\nAlso, tell Kacie so she can rearrange the seating plan in time.\n\nThe other Redditors have your new awesome idea covered.\n\n\n\n",
            "Corner him. Be positive. Say \"well asshole, you took my idea, so now I'm taking one of yours. Let's brainstorm this NOW.\" Be bigger, give him a way out. He may surprise you.",
            "Use it at the rehearsal dinner. \"Sweet wife to be, you inspire me, and I asked artist friend to make this for us, because you are the story of the rest of my life.\" Talk about how excited you have been about this idea and how your good friend artist worked with you to make it happen. Show it off to family, and just pick another song for the first dance.\n\nShe's going to be your wife. You made this beautiful thing. But let Kyle know he owes you BIG TIME. And that he's a shitbird.\n",
            "Just do the song!!! It's petty, it's literally the wedding version of \"she wore the same prom dress.\" \n\nJust use the damn song it goes so well with what you already did!!! Nobody is going to really think about it as much as you did anyways.",
            "Man, this is tough.\n\nFirst, Kyle is not your friend and probably does not deserve to be your best man. Second, talk to artsy friend of yours and brainstorm what you can do: make something different, something energetic and probably make it as dynamic as GoPro commercials -- change music and some pictures. The point - make it not about the history, but about what you do know and what you dream of -- or anything just different than what Kale came up with.\n\nThird, once you figure out what to do with your artsy friend, you should talk to Kacie and to other close friends. Kale literally sabotaged your work. This is considered a betrayal in my book.\n\nGood luck and congratulations with your upcoming wedding!\n\nEDIT: gather your closest friends who are invited to your wedding (and attended Kyle's wedding), your artsy friend and show them what you've been working on and how Kyle stole the idea. This way a) they know who Kyle is and b) if you don't finish something different, they would still know who stole the idea.\n\n",
            "Uh its not your idea. Every wedding has this.\n\nIt's like you're getting mad at him for having cake at his wedding because you think you had the unique flash of inspiration to have wedding cake.\n\nIts cool, let him have it.",
            "This will get lost, but can OP tell us who got engaged first? Did your friend propose to his wife right after you proposed? That would be relevant here.",
            "Pick a better song than the one from the end of Scrubs, this could be a blessing.",
            " As a female is about to tie the knot here my thoughts:\n\nAs your fiancé \n\n1. I would still love and appreciate your thoughts and efforts.\n\n2. I would want to know before hand\n\n3. I would be just as mad or madder than you\n\nAs his wife\n\n1. I would want to know.\n\n2. I would try to help any way I could.\n\n3. I would feel terrible\n\n4. I wouldn't want to loose my good friend and not know why.",
            "I don't know dude, showing a video of growing up and growing together pics during the first dance is pretty common.  We did that at mine nearly 10 years ago. We used Walk Through This World With Me by Tammy Wynette for the song",
            "wow-he really really sucks.\n\nIm very snarky so I would be inclined to post on his fb page \"Hy, I guess imitation is the sincerest form of flattery since you STOLE the Book of Love tribute from me. Kaci and I are sorry I shared my idea and creative process with you-She is sad that she won't get to experience what I planned for her on our wedding day and I never expected you would do such a shitty thing.\" \n\nThen I would ask someone else to step up as best man and pm him that he is no longer invited.",
            "You can steal my wedding song :)  Daniela andrade-la vie en rose. \n\nIf you need help coming up with a new song shoot me a pm as I'm getting married in a month and have listened to plenty! What your friend did was shitty and I agree with others you should do everything before hand and show her that he stole your idea. Maybe you guys can come up with something beautiful together. ",
            "Wouldn't be my best man anymore",
            "Have your wedding as planned. Not everybody will be at both weddings, and it'll be still original for your families who are guaranteed to be around a lot longer than the social circles you may have this decade.  The photo book will still be specific to you and your relationship.  If you want, you can mention it in a little speech how you were surprised that Kyle used your idea of the song and dance, but \"great minds must think alike\" (he's your best man, so he must be close to you) and just laugh it off.   Obviously he liked your idea, and if you really need to feel like you \"came up with it first\" you can mention it, but honestly in the long run, people won't care.  Especially in a few years when both weddings are old news. If your wife ends up upset that you copied somebody, then she's caring more about her wedding than she is the symbolism and thoughts behind the photos and experiences you tried to share with her, which is the bigger part of your surprise.\n\nThere's always the chance that she felt \"oh that's such a sweet idea\" and will like also being able to go through that experience herself.  A lot of people steal ideas from other weddings, it just might not be a few weeks apart.  (I ended up adding two ideas to my wedding that I saw from a wedding I attended a month before mine. Why not? I thought they were good ideas, and now they were part of my wedding, too.)\n\nBecause of the work put into it (creating the video and book) takes time and effort, it's obviously not something you decided to do last minute and put together in a week since attending his wedding.  I think that much will be obvious, and it'll still be a really nice memory for your wife and attendees of your wedding too.",
            "What a jerk! \n\nMy suggestion: change the song to another song with book in the title. I thought of \"Every Day I Write the Book\" by Elvis Costello. A quick google showed a wedding site with a list of the top songs for weddings with \"book\" in the title (not linking as we aren't supposed to, but you can find it by googling \"wedding songs with word book in title\"). Then you can give her the book, have the dance, and look like a creative and hardworking groom. A lot of people do the videos/photo montages so that doesn't look like copying.",
            "First you need to have a conversation with Kyle about what happened. There could be an explanation for what happened, even if not you still need to talk about it, it won't do any good to stew about it until your wedding. \n\nI think you just need to try and come up with something else that you can do at your own wedding. It sucks that your idea can't be used now, but there's no way to go ahead with it without dragging all your mutual friends into the drama one way or another. I wouldn't mention this to your wife-to-be until way after the wedding. The gesture was supposed to be for her mainly, having her help you find a replacement gesture would be my last resort. ",
            "Yeah, I'm going to go with pointing out that it took you a lot longer than a week to put together.",
            "Oh wow that's a dick move. Find another best man.",
            "Just have the first slide be 'fuck you kyle'. And then continue on as normal.",
            "Yeah, Kyle was a dick.  \n\nIf you are going through \"switching the song\" idea, I recommend Picture of You by Johnny Reid.",
            "If you're such good friends, go through with the original plan and tell everyone that you guys planned it together.\n\n\nLet your fiance know afterwards that he stole it. And find a time to ream him out for being an asshole and dropping you in it. ",
            "Maybe change the song to the video? South Park used that song for their CraigxTweek video so maybe send that to your friend like \"lol look at this\" and then find a different song. \n\nJust a suggestion. good luck!",
            "I wonder if you could have your \"artsy friend\" verify when exactly the book was commissioned as some kind of proof this was your idea first. Your friend did you dirty and personally if this were me I'd end the friendship over this betrayal. I'd also, because I'm petty, explain to everyone (with proof) that Kyle stole the idea. If I were his new wife I'd want to know what a scumbag friend/person I just married.",
            "You know I've been thinking about this for awhile now and here's what I'd do...\n\nI'd sit him down and tell him that he gets a freebie.  That you've been friends for a long time and you can see that since he didn't want to put the effort into his own wedding that you're willing to let him have this one.  You won't tell his wife that he didn't care to put his own effort into their wedding, BUT you're never trusting him with anything again.  This is an inevitable consequence of his deceit and you won't be able to share things with him anymore.  He'll never know anything about you that isn't common knowledge at this point.  You won't be able to tell him the names you're considering for your children, any jobs you are interested in, there will be nothing that he knows about you that you don't want taken from you.\n\nThen you have to actually follow through.  This will keep happening probably if you don't.",
            "Bro it up!\n\nDo yours anyways, if anyone asks, say you guys had the idea together. \n\nHe will know what he did, everyone else will assume you guys are even bigger bros than you are, and you will gain bro-points. ",
            "I would make this a rehersal thing, explain it to everyone there, and then make something else for the wedding.",
            "If I were you I would tell your fiance and come up with something different and also let Kyle know he's no longer invited.",
            "A friend who would fuck with what should be the happiest day of your life is NOT a friend.  Uninvite and ditch him.",
            "I'd rather stand by myself than with a best man who undermined my wedding plans.",
            "You need to find kyle in person, sit him down and patiently explain to him what a complete asshole he's being. How hurt you are that he would throw away your friendship like that. That's such a messed up thing to do to someone you care about. He's being an immature child by ignoring you, so you need to confront him and let him know that he has to deal with this issue if he wants any chance of remaining your friend. If at all possible get him or his wife to make a post giving credit to you for coming up with idea.",
            "You need to disown your friend. It will only happen more and more, cut the cord. ",
            "That's a real asshole move on his part, and he owes you big time (start thinking of writing him off only if he doesn't accept this), but for now put it in the rearview. I'd recommend either swapping out the music for something really similar and just showing it at the wedding, or better yet hold on to it until later in the marriage when it can really surprise her and give your relationship a booster shot.\n\nI'm sure 1000s of couples had their first dance to the same song and slideshow, so it might help to recognize that (at least to dampen some of the disappointment). I'd go the other way and make the first dance song something super catchy, or just something super fun that'll make everyone laugh. Some stupid song like Richard Harris's MacArthur Park or one that would seem impossible to slow dance to. A funny memory can be just as strong or possibly even stronger than a romantic sappy(in a good way) one. Especially if you guys plan it together and she's in on the joke too. ",
            "Wow.. man, I have no idea what to tell you because there's literally nothing you can do. Your best man is a snake and you need to cut him out of your wedding in a week?  Jeez.  I hope you have someone to step into his shoes NOW.  But you need to loop your fiance into it, NOW because she needs to know what's going on because there's no way you can have him stand up and be your best man now.  \n\nI doubt he'll even SHOW UP. How can he?  \n\nAs for what you can do, you definitely need to change the song, but I can't think of what to do, I know others have recommended other songs, and you can listen to those.   \n\nBut yeah you need to sit your fiance down now, and explain what happens because I sincerely doubt your \"best man\" is even going to show his face at your wedding and would you really want him there if he did?",
            "I think he went the \"it's better to ask for forgiveness then permission\" route, because he knew what he was doing is shitty :( Tell your fiance, un-invite him to your wedding",
            "Man I am so sorry. That's a very low thing to do and I can't imagine how it must feel. ",
            "Go ahead with your plan and tell your girl as it starts that it was your idea first and he stole it from you b/c it was so good. \n\nIt's not about the rest of your social circle and what they think or anything. Fuck them. It's about your wife and the happiness it will bring her.",
            "Hire a string quartet or guitarist to play one special song, check local guitar shops or maybe even call the local high school orchestra teacher to see if they might know of some students who want to earn a little pocket money for a quick, easy gig. When you book them explain the situation.\n\nKyle did a pretty lousy thing just to make himself look good at the expense of ruining what was supposed to be a surprise thing.",
            "1. Tell Kacie what you planned and what you put together (book, etc).\n2. Tell Kyle's wife what you planned and what you put together (book, etc).\n3. Tell Kyle he is uninvited to your wedding.\n4. Live a wonderful life with new wife.\n\n",
            "The petty side of me would just call him out at the wedding and tell all your guests you had the idea first and you have all the e-mails and time stamps to prove it, but tell your wife in private first.  I don't know if I would trust \"best man\" after that...That's a tough one.\n\n\nOr you can do the dance and everything better than him.  I wouldn't know what to do in that situation.  Sucks when someone close to you does something like that.",
            "Do like any friend does and punch him in the arm and call him a dick weed then adjust your video",
            "I would tell your fiancee about it so she is on the same page.\n\nThen just continue as normal, but when you give her the book make a show of it.\n\nGet on the mic, announce to everyone how much you love her, and jokingly make a comment how \"upset\" you are that your best friend stole your idea. \n\nIf you play it as a laugh, it won't seem petty but it will still get your point across.\n\nAs a bonus your friend might be a little embarrassed and learn not to mess with you again.\n\nGood luck man",
            "Man, fuck people like this. I'm so sorry it happened to you, OP. IDK if I could continue a friendship with someone as selfish as this. How awful :(",
            "Ok everyone, the relationship advice is good and useful. However, I think we should be focusing how to assist him to have an awesome first dance.  This is what is important right now.  He has a week!\n\n\nDude,\n\n\nYou came up with a really good idea for the first dance. You can come up with a better one. Adapted the idea you have, create a new idea around the book or do a new idea. An idea that is so amazing it will blow your first idea out of the water. YOU CAN DO THIS!!!!\n\n\nHere is an idea off the top of my head, feel free to steal it and adapt it. This can be done in a short time. Want to do a picture montage/book montage. What about a Music montage too? Create a list of music, from her past (contact her friends/family for help, raid her playlists) and your past. Play your music with your photos and her music with her photos. When you show photos of you together, play the music from when you first danced/romantic dance/ first met etc which ever you can find and seems appropriate. For the actual dance, choose a current song from this year, emphasising you are looking to the future now, together. You could even emphasize 'together' by talking about which song from this year is appropriate for the dance, without telling her why.  Hell, you could even find a cover band, tell them what happened, and see if they could assist in any way.\n\nOther ideas:  Did the art friend use a theme while making the book?  Can you find a song that goes with the theme?  Find a song that is personal for the both of you about coming together etc. \n\n\nTell your SO now or don't, I think you should focus on making the first dance awesome, with a new idea/changed idea.  I suggest if you tell her now, keep it brief and state that you are having to redo your first dance plans. Then after the wedding when you have time tell her all the details.  \n\n\nI would like to see kyle face at your wedding when it comes time for the first dance etc.  It would be priceless to then see him then be blown away by your more creative more personal idea.\n",
            "I would totally bring this up at your own wedding, like when you present her the book anyway because you spent so much time on it.  But I would definitely tell the fiance so y'all can brainstorm something fun still.  But don't let that fuck get away with this, call his ass out at your wedding, but do it in a jokey, passive aggressive way, \" Well I was planning on doing this whole routine, and I had prepared a book, but apparently someone else thought that was a good idea.  So I present this book to my wife, and blablabla cue whatever new thing you and her came up with.\"",
            "Keep in mind about a thousand weddings last year did exactly the same thing. No one cares. And anyone that would make drama out of it is looking to make drama because their life is so petty.\n\nI had the simplest of weddings short of going to city hall. Married a long time. Over the years went to a lot of big fancy weddings and pretty much all of them have ended in divorce.\n\nAnyways no one going is going to care about the dance and slideshow after the booze starts kicking in.\n\nAll that matters is that you love this girl and your starting off a new life together.",
            "This is one of the most common ideas for a wedding. I wouldn't really consider it a big deal since it's not exactly original. Just be flattered your friend thought it was so great it was worth copying.",
            "I say take the princess Bride route. Though for the collage, id have FIL maybe narrate it? Might be a good touch for the storybook feel. Then have it transition to the first dance song?",
            "This would be a friendship deal breaker for me. Tell your girl and pick another song. Dump that guy off your guest list. See how guilty he was that he wouldn't answer your texts? Fuck him.",
            "Absolutely tell her.  Brainstorm a new idea and show that motherfucker up.  Don't tell her about the book though, that way she'll still be surprised at the wedding with something.  After that, You wait until your wedding night.  You pop in the original video you did you never let her see, watch it together, and well, I'm sure you can figure out what to do next.\n\nThen get non mutual friends in on this shit and after the wedding have them publicly post on your Facebook pages about how your wedding montage was the best thing they've ever seen.  Yada yada  yada. Really play it up so there is no way the both of them don't see it.\n\nTHEN, if you're feeling extra vindictive, you have your wife subtly mention in a comment about how awesome you are at ideas and how you even helped a friend come up with his slideshow idea...even going so far as to put together an example slide show using the pictures you already had pulled together for your kick ass first dance idea.  And then mention how he played it for you non your wedding night in front of a roaring fire and how romantic it was...really sell that shit hard\n\nThis is your first test as a married couple.  You can wallow in self pity, or the two of you can show that idea stealing twatwaffle what a real motherfucking couple looks like.\n\nObviously the friendship is over.  Anyone who would jack your shit like that does not respect you or your relationship.  He deserves whatever karma had to offer in mu mind.\n\nCongrats on the wedding and enjoy stealing your ex friends thunder\n\nPS...the Mawwage...Mawwage is what bwings us together today scene from the princess bride would be a sweet and funny opening to a slide show.  Maybe cut in a few clips of wesley and buttercup talking about true love for good measure",
            "Use all that work you did! It's yours!\n\nBut insert a slide near the end that says, \"Created <date>, *before Kyle's version*. Thanks, Kyle!\"\n\nI'm afraid you will have to let this friendship go. What he did was a real slap in the face -- he let the friendship go at that point. I'm sorry you have to deal with this. ",
            "Absolutely tell your wife! That is such a sweet plan and it's super shitty he stole it from you. Honestly I could never forgive that. That is just such a terrible thing to do especially so close to your wedding!!! Sorry man. Enjoy your day and forget about him. Don't disinvite him but also don't engage with him. Deal with your shit afterwards. Try to forget it for now. Nothing else you can do.",
            "How about using the song \"Giving You The Best That I Got\" by Anita Baker?\n\nIt even has the line: \"I bet everything on my wedding ring, and I'm giving you the best that I got...\"",
            "Tell her about the song, but let the rest be a surprise. The pictures are a pretty generic idea and he didn't steal the book, but she deserves to know he stole your song. At least that will explain your mood towards him.",
            "I Don't Know Much by Aaron Neville and Linda Ronstadt!!  Listen to it!  It's perfect for your video!!!  Because it was perfect for mine 20 years ago!  Good luck and congrats!!",
            "He is a shitty friend first of all. \n\nSecond of all, pick a new song and surprise her on the day of the wedding by sending the book to her room as a pre-wedding gift!!!! The photographer will be in the room taking pics as they get ready so it will be really sentimental!",
            "If there were some non-pathetic way of letting Kyle's wife find out that he stole the idea from you, that would be great. Of course he's clearly no true friend either, so why would he be at the wedding?",
            "Definitely tell her what happened, present the gift, and uninvite him from the wedding... but not his wife.",
            "better together by jack johnson is a good song. check it out op\n",
            "Pretty dick move, but what he did/your plan wasn't that creative aside from the book, which Kyle didn't even make. Everyone plays Book of Love at their wedding, and a montage of pictures video is also pretty common (when you put them together, it's essentially the season 8 finale of Scrubs. \n\nI'd tell your fiancé why you're upset and decide what you want to do about a different song. There's a million different wedding songs, so it shouldn't be too difficult to find another unless either of you are huge Book of Love fans.",
            "most ideas arent original. sure, he took the song but whatever. make it special and dont worry about thieving kyle. ",
            "Since the big day is pretty close, I'd say just change the song and do the dance with her. Forget about the pictures. You don't want to add unnecessary stress to both yourself and your wife to be. Most people would focus more on the bride and groom during that moment anyway plus, give a few months no one is gonna remember anything. \n\nAs for your best man, it's up to you to decide what you want to do. I would still let him carry out his best man duty but after the wedding is done, I'll tell him he can suck on a chode for stealing the idea and won't trust him with any info again. ",
            "I can't say to or not to call off his spot at your wedding, but I do think that you definitely need to tell Kacie what happened. That was so dirty. If my husband had picked out something like that, I would've turned into a puddle. If his best friend decided to screw it all up, I'd still be so happy with what you had decided on, but I would still want to help since he did screw you over. If it were me, however...his ass wouldn't come to my wedding.",
            "Can you have your artsy friend help present the first dance/montage/book - as in over the microphone to everyone?  Have him/her specifically reference how you guys have been working on all of this together for months, reference dates, etc.  It will be obvious to people that you definitely did not copy from Best Man.",
            "Ask Kyle to give a little speech at the wedding saying how you gave him the idea for Book of Love thing or the friendship is over. It can be a cheery and lighthearted speech. No anger or tears. If he refuses, do it anyway, fuck whoever thinks you stole it.\n\nIt's just a wedding. Your wife is the only person there who matters.",
            "Don't forget to update us ",
            "Honestly, I would tell kyle's wife and show her proof.\n\nI just don't like it when people are being lied too.\n\nHis romantic gesture wasn't his, and his wife will believe that it was Kyle's \"Original\" idea otherwise.",
            "I'm getting married in five days. This would crush me. But you can't let it overshadow the main event. Your marriage is for you and your fiancée. If you have a similar wedding tribute, just be sure to make her know it was your idea of a tribute to her. It may have been mimicked, but it wasn't truly replicated. If she knows that your motivation was her exhuberance and that you plotted it such that someone else could steal the plan and make it their own, you should be golden. \n\nAlternately: play the slideshow with Salsbury Hill.",
            "You can choose another classic Peter Gabriel song \"In Your Eyes\". To replace the book of love that in itself is a wonderful. Wedding song. Don't let your lazy, friend bereft of ideas ruin your wedding day. And, you were NOT being petty.",
            "Tell your fiance and come up with something together. Revoke your ex-friend's invite and if his wife inquires tell her the truth. ",
            "Tell your fiancee so you two can fix the problem and find a new song for your first dance. That's the first priority. After that text Kyle and tell him he's no longer invited to the wedding or any other event in your life. What he did was just plain shitty. That's not a way to treat a friend and quite frankly what he did was childish and, for lack of a better word, uncivilized. He's not worth keeping as a friend IMO. Asking one of the other groomsman to be your best man might be a better option that trying to find someone else.",
            "I would definitely drop your best man from the wedding/life. ",
            "No, you aren't being petty.  Kyle was a jerk, stole your idea and now you need to scramble to come up with something else.\n\nI do want to mention another possible scenario - is it possible that Kyle mentioned what you were doing to his own fiance and she demanded that Kyle do that too because it was so romantic?  It doesn't make it any better, but unless Kyle has a history of stealing ideas, it might explain it a little.\n\nDefinitely tell your fiance what happened and brainstorm about a first dance.\n\nAs for Kyle standing up for you - That is your decision.  Base it on how you and your future wife feel about having him there.",
            "Shit. That's the EXACT song I wanted at my own wedding. :P",
            "The only idea of a wedding is getting married to someone you love. Rest is fluff. \n\n- someone who got recently married ",
            "What an absolutely scummy thing to do. Great choice of song though, Peter Gabriel is incredible. Maybe you could choose another of his tracks? 'In Your Eyes' is the obvious one, maybe a little cliche but still great. Alternatively maybe 'Secret World'? But definitely tell your fiancée, she'd appreciate all the hard work you went to.",
            "Op check out the song called At The Beginning by Donna Lewis. Its an awesome song and you can ask the friend who made the book to proove he stole it... ",
            "I don't necessarily think you should kick your friend out of the wedding if this if the first shitty thing he did.  \n\nTell your wife everything and give her the book, let her pick a backup song.  Or pick a different song that fits and have it play at a different time and give her the book then.  Mix it up slightly.   Book of love is pretty cheesy anyway, you might be able to find something better.  \n\nIs your friend on his honey moon?  Maybe he's actually busy, but he should definitely have replied... Give him an opportunity to apologise.  It's not like he ruined your life. ",
            "Let it go and come up with a plan B",
            "Go on without him there, that's a real shitty thing for him to do.",
            "You motherfucker!!! \n  I'm a girl and the book of love song I knew would be perfect for a wedding. It's so perfect and your wife will be overjoyed.\nPlease do it. You'll regret if it you dont. Ignore  him and now you do it and do it betterm",
            "[deleted]",
            "[removed]",
            "Kyle is a jerk. Holy cow. I'd call him one more time and tell him that the two of you REALLY need to talk, and that he knows exactly what about. Leave a voicemail if you have to. If he doesn't call you back...he's demoted (best man -> groomsmen). He knows he did a crappy thing, and that's why he's not responding to you.  \n\nAs for what you should do... Ask Kacie. Tell her that you had planned a wonderful surprise for your first dance, but that after telling Kyle about it he took it upon himself to do the same thing. Leave it general, and ask her if she would like to keep your plans as-is, or if she would like to do something different. Personally, I'd be embarrassed if this happened at my wedding, regardless of the fact that Kyle did a shitty thing. People aren't going to realize that unless you call Kyle out at the reception, and even then honestly some people will still think you copied him. Granted the wedding/reception is supposed to be for the two of you, but that's just my two honest cents. ",
            "Kyle is a butthead.  Share your original creation with your fiancé now.  Then, work together on a new, special first dance.  Personally, I suggest something choreographed and fun--  it would be so different from Kyle's, the guests will love it, and you'll have fun working on and performing it with your bride.",
            "Your \"friend\" is a backstabbing coward. I would reconsider who you consider to be your friends. He isn't one. Uninvite him from your wedding. As others have suggested, tell his new wife that she can still come if she'd like but that he will be removed if he shows up, and understand if she doesn't come for that reason. ",
            "You got this idea yourself from the finale of Scrubs. It's not super original, although it is nice.",
            "The idea overall is NOT that original, see if you can change the song... I like, I choose you-Sara bareilles.\n\nYes your friend did a shitty thing.\nI would personally keep him at the wedding and you guys can resolve your issues in due time.",
            "Is anyone going to point out you should tell Kyle's wife as well? This act on his part says a lot about his character. A lot of people seem to be of the consensus to dump him but obviously you two are close friends and its more complicated than that. You have receipts from the artist with dates, maybe texts to kyle with dates  on them as well- the evidence is on your side. Just make sure everyone knows.",
            "Definitely find some way to let your friend's wife know that he stole your idea. If you end up seeing them again just casually drop it into the conversation. ",
            "Uninvite him, tell his new wife what he did and tell your fiancé.  Come up with something new with her.  He's a SCUMBAG!!!  I would be livid!",
            "What a fucking douche",
            "Show her the book and tell her it was your idea first, also unbestman him and uninvite him",
            "It's a fucking wedding dude!  Nothing that happens on that day will have any impact on the success of your marriage.  It's just a silly little party that people do to make themselves feel special... even though like 90% of the population has one!!\n\nAnyway, it's not a big deal.  It was a dick move on your friends part, but if trivial things like this are enough to upset you to this degree then you probably need to evaluate your life priorities.",
            "Call him out at your wedding. In front of his new wife. \n\nTell your wife to be about everything in private, before the wedding but leave the actual video and the book as a surprise. Let her know that you had planned this and Kyle, unbeknownst to you, stole the idea. when it is time for that first dance, grab the mic, tell your wife she looks amazing and that you love her, and that you prepared this video and book to show your excitement for your future with her. Then add, \"by the way, (sarcastically) thanks Kyle for stealing this idea I shared with you in secret.\" People who weren't at Kyle's wedding, wont really know what you mean, but the people at Kyle's wedding will, including his wife (who I am sure has no idea that her new sweet husband with romantic brilliant idea at the wedding stole it from you). ",
            "What in the holy fuck!",
            "Do exactly as you planned, then the last picture in the show is The worst pic of Kyle that you can find with the Scumbag Steve hat.",
            "Jesus.  Who cares?  Just have a normal 1st dance.   No one is even paying attention to your first dance.  They are just looking for the beer and food at that time.   \n\nSeriously man.  You sound like a little princess.   "
        ]
    },
    {
        "post_id": "3tando",
        "author": "Iamjusttryingtohalp",
        "title": "[UPDATE]My [27/M] girlfriend[25/F] has had the flu for several days. Yesterday she had some serious hygiene issues that I happily helped clean, and today she is so embarrassed that she won't even let me in her room.",
        "url": "https://www.reddit.com/r/relationships/comments/3tando/updatemy_27m_girlfriend25f_has_had_the_flu_for/",
        "score": 3076,
        "num_comments": 247,
        "created_utc": 1447855719.0,
        "selftext": "Original :https://ud.reddit.com/r/relationships/comments/3t2ext/my_27m_girlfriend25f_has_had_the_flu_for_several/\n\nSo, holy inbox batman, logged into this account and had over 200 replies and messages.\n\nAnywho, went to her place yesterday and she looked a lot better, but wasn't feeling the best. Pretty much dragged her to the car and took her to our local clinic. They said she had something called Gastroenteritis, which they felt was caused by contiminated food. So yeah, wasn't the flu like a lot of you guys were telling me, but I am not the smart one, she is, I just work at a factory. She was sick, I assumed the flu, sue me.\n\nAnyways, they said she was over the worst of it, but that she was almost dangerously dehydrated, so they gave her a fluid IV yesterday. Afterwards they told me to get her to consume food and drink with electrolytes, so I have made her drink gatorade and eat bannas(What they told me) yesterday and today. They told me that if it ever happens again, to bring her in earlier so as not to allow dehydrataion to become that advanced. Good to know.\n\nAs to where to got it, she told me she ate from a truck stop heat lamp food stash last Friday, because she was in a hurry, so hopefully she won't do that again.\n\n\nThank you for all the kind compliments, I really didn't think I went above and beyond in what I did, I just know that I love her and she needed some help cleaning up. I have decided to take everyone's advice here and since our door talk, act as if it never happened, which she is doing as well.\n\nAlso, to the people who asked, no, I do not work in the medical field, I work at a factory. I did however have a grandmother with Alzheimer's that lived with us when I was a teen, and I had to help clean her and take care of her, because my parents were too grossed out most of the time, and too cheap to get a live in nurse or something like that. I am not new to bodily fluids.\n\nAnyways, thanks to everyone who advised me that she was just embarrased and I didn't do something out of turn. Also, thanks to everyone who showed concern about her health.\n\n   \n**tl;dr**:Wasn't the flu, you guys right, took her to clinic, she was dehydrated, doing much better today",
        "permalink": "/r/relationships/comments/3tando/updatemy_27m_girlfriend25f_has_had_the_flu_for/",
        "comments": [
            "You're a good bloke. ",
            "Just because you work in a factory doesn't mean you're not smart. I would have assumed it was the flu, too, if I hadn't known where she got the food from. \n\nYou did a good thing for her, and while it's embarrassing, I'm sure she appreciates you helping her out.",
            "1. Just because you guessed it was stomach flu instead of gastroenteritis doesn't mean you're \"not the smart one.\" You don't need to be self-deprecating about what you do or how smart you are. You're clearly a good man with plenty of smarts to have realized she needed to see a doc. Flu was a perfectly reasonable guess at first, until it went on and on. You did just great here.\n2. I think it's awful that your parents made you take care of your grandmother because they were \"too grossed out most of the time.\" What if *you* had been grossed out? I'm grossed out by your parents putting that sort of responsibility on their kid. But I'm glad it prepared you the way it has. Your girlfriend is very lucky to have you!\n3. Anytime someone has thrown up a lot or had diarrhea, there's a risk of dehydration, and re-hydrating is the most important thing when they're able to take fluids. Besides water and Gatorade, you can also use Jell-O for hydration, which is handy if you're dealing with a small child who doesn't want to drink anything - in the event you ever have kids. When she feels more like eating, you can follow the BRAT diet until she's ready to eat normally. Bananas, rice, applesauce, and toast.",
            "If that gas station thing had been in the original, I would have 100% said it was some kind of food poisoning.  Reminds me of an old episode of Scrubs when a guy had eschemic bowel.\n\nJD: Maybe you shouldn't have gotten sushi from the Gas 'n Go\n\nPatient:  What was I supposed to do, throw it away?!  It came free with the fill-up! \n\nYou're a good dude.  If she's still embarrassed, just remind her: Everybody Poops.",
            "Just a heads up as she recovers...she will soon be ravenously hungry and want to eat *everything*.  Tell her to take it easy on the real food and slowly work up to it, or she'll be back with diarrhea again.  It takes awhile for the bacteria in your gut to repopulate after a bad bout of food poisoning like that.\n\n(Also, avoid red stuff like red gatorade or red jello if someone is vomiting.  That way if they vomit up red, there's no question of if it's blood or red dye.)",
            "Yeah, involuntary diarrhea is generally a very bad sign and should always be assessed by a medical professional; food poisoning is the most likely culprit in the US. (In developing countries, or in cases where you haven't been careful about your water supply, such as while camping, giardia is another likely source.) Dehydration due to diarrhea and vomiting can happen very quickly, and can even be fatal, especially in infants and small children. As the doctors said, the best diet is heavy in fluids and electrolytes (Gatorade is excellent for this purpose, so is Pedialyte, a product for infants, and I personally think it tastes better), since a lot of nutrients get passed completely thru the system without being absorbed. \n\nWhat I always found easiest to eat during bouts of GI distress is soft, simple foods like apple sauce, white rice with a little salt, and thick, drinkable yogurt (sometimes called \"kefir\"). Maalox and other over-the-counter drugs that bind up your digestive track aren't really helpful, since often with food poisoning, your body is trying to rid itself of the bacteria or toxins it ingested. If you have diarrhea and must travel for an extended time, then it makes sense, but otherwise, with severe diarrhea, it is usually better to just ride it out and keep hydrated. Source: was Peace Corps Volunteer for two years, this was a very, very common issue. Not a doctor, please always follow medical advice!",
            "When I had pneumonia, I could barely walk. I just had no strength to, my legs would buckle beneath me. Every time I had to use the bathroom, I would literally have to crawl. Well, one time I didn't quite make it.\n\nMy boyfriend at the time came over to see how I was doing (I was living with my parents) and found me soaked in my own piss on the bathroom floor, sobbing but unable to cry because I was dehydrated, and couldn't even get up to the sink to get water. He put me in the bathtub, got me a change of clothes, and once I was cleaned up he took me to a doctor. Found out there I was actually seriously ill, but a massive dose of antibiotics, anti-inflammatories, and a sedative to help me sleep got me functional in record time.\n\nWe're married now. That day was hideously embarrassing, but for the first time I knew someone was there to really take care of me when I needed help. I hope that if he's ever in the same situation, I have the exact same fortitude he did.\n\nYou did a good thing, and you're a good man. A++ boyfriend.",
            "Pedialyte has more electrolytes and less sugar than Gatorade. It's designed for diarrhea related dehydration.  You  get it in the baby section of the pharmacy or super market. It comes in bottled form, powdered mix form, flavored, and unflavored. Read the back because you're supposed to drink a pretty large amount to combat dehydration.",
            "You rock! You're a keeper, she should marry you. If she's as smart as you say she is.\n\nA homemade chicken soup would be fabulous right now because she'll be hungry and still need fluids. It's damn easy to make. If you don't cook much, you can buy prechopped veggies (onion carrots and celery) in many grocery stores, simmer in broth of your choice until veggies are almost done, then add some diced chicken breast. Spice as desired, but no salt needed. A grain or pasta is good in that too, either pre-cooked and added near the end with the chicken, or cooked as the broth simmers cooking the veggies. \n\nOf course you can do a more homemade version, but this one is so easy and virtually fool proof. Please forgive me for the unwanted cooking advice if you are a cook.",
            "Good on you. I feel weird saying this, but your story totally resonates with me. \n\n\n\nI can't really share in my real life as I'm gonna need to wait till I'm old as balls for my wife to be able to laugh about it sharing with other people (we joke about it between the two of us) - so it was cool seeing your story here... My cousin was getting married. My wife and I had been dating a couple years by this point, and she was nervous about the wedding (my family is massive, and we all hold family as a big priority so we all do what we can to make events and it can be a little overwhelming for newcomers on the scene). We had been traveling, and she had nothing that day but coffee, doughnuts, and candy (we enjoy not taking ourselves too seriously). Once we got to the reception, her belly was full of junk, she was nervous, and she had a few glasses of champagne. She nibbled at the dinner, but her stomach was already upset and it was ruining her appetite. The sick feeling subsided, a little time passed, but then it came back. Hard. I was at the bar chatting with cousins I hadn't seen in a long time, while she was in the dining area (we had talked before and she told me she wanted time to mingle among all my relatives without me shadowing her the whole time). She, not positive what was up with her stomach, starts to make moves towards the bathroom. Before she gets out of the reception area though to the restrooms, it's too much, and she plops down on a swanky chair to avoid having a mess run down her leg. My uncle (who is the man) noticed the discomfort and panic on her face and goes over to see what's up. She's really embarrassed, obviously, but my uncle works in education and was a total pro about the situation. He brings his wife over (also in education) and he comes and tells me my wife (then girlfriend) needed me. I come rushing over (not knowing the details of what was up) and she was so upset / embarrassed, actually thinking back on it melts my heart in a weird way (we're mid twenties, so it was so strange and upsetting and in that moment you're just totally 100% vulnerable). We ask if she can get up to make a sprint for it. No dice. So then we quickly hatch a plan to find one of the folding wheelchairs every venue ever has and do a quick transfer. I briskly walk to the bar while my uncle gets the wheel chair to grab a handful of cocktail napkins. When he came back, he and my aunt helped move her to the wheelchair and I wiped the diarrhea off the swanky chair. I shove the cocktail napkins into my pocket and i follow to bring her into the women's bathroom. Before I can escape, my father comes up to me. He noticed my brisk walking and was wondering what was up. I quickly told him my wife wasn't feeling well and I needed to take her to the bathroom. He asked what's wrong, and he's a doctor so I knew he wouldn't be weird about it. He gave the very technical diagnosis. 'Dumping' - what happens when the body hits eject on that junk you ate. Anyway. So wedding, of course there's a ton of girls in the bathroom but whatever, emergency. We get her into the handicap stall and get her out of the dress and start wiping her down. Or I do the wiping. She couldn't really do much more than sit there she was so worked up. It didn't help having one of my younger cousins in the bathroom yelling \"oh my god, what is that smell? It's not human!\" (that cousin does not know it was my wife, and the vast majority of my family has no idea about this - we think)\n\n\n\nOnce she was relatively wiped down, it was obvious there was no putting that dress back on. Fortunately, the venue was close (literally same street) to the hotel - so I reassure her that everything is going to be fine and that i'm gonna run to get her another dress. I do. I sprint like hell back to the hotel, and come back to her in that handicap stall. We don't say too much, but we get her dressed and start making an exit, avoiding eye contact as much as possible. On our way out, of course, we run into my GRANDMA! She's chatty, even compliment's my wife's dress. I excuse us and we get back to the hotel. \n\n\n\nWife is mortified. She thinks my whole family knows. She thinks everyone is going to judge her. She says she's upset that I've seen her like this, worried that I will now not find her attractive. I tell her again that everything's fine. She showers up. I have a drink. We start talking. She says she just wanted my family to like her, and is in tears as she says something along the lines of 'and now they're just going to think of me as that weirdo that shat themselves at your cousin's wedding.' My wife is also kind of a bad ass, and I knew this then. I say something along the lines of \"Well, you know what would really impress them? If they knew? If we went back to the party and danced anyway.\" She thought about it, and amazingly agreed. She went back to the party with me. After shitting herself. After all that. We went back and danced till they closed the dancefloor. Impressed the hell out of me. I know I would never have made it back. I had considered it before, but that's when I knew for sure that I was going to marry her (this has lead to awkward moments and white lies when asked by people - 'when did you know?')\n\n\n\nYour girlfriend is embarrassed. That's to be expected, but it makes me happy that her trust in you when she was in need was well placed. Maybe share our story with her, might make her feel better knowing that it could have been worse ha.   \n\n\n\n*TLDR*: Thanks for sharing. Navigating the awkwardness that follows helping the person you're dating after they've unexpectedly pooed themselves is something I totally relate to. \n",
            "Good job, man! Your girlfriend will remember your kindness forever. Dehydration is really serious, I'm glad you guys went to a doctor.",
            "Tip of advice, which I'm sure you know, but I'm going to repeat just so it sinks in. **NEVER MENTION THIS AGAIN. EVER**",
            "she better put a ring on that.",
            "You are marriage material, my friend. She's lucky to have you.",
            "This is the \"in sickness and in health\" part that people blindly agree to when getting married before they experience it first hand (or at least seriously consider).\n\nRegardless whether or not that's in the future of your relationship, it's worth taking a moment to step back and realize you *nailed it*.",
            "Is it bad I kinda wanna accidentally shit my pants while I'm sick to see if my BF is as awesome as OP is? No? Ok\n\n*slides out of thread*",
            "You're a good guy.  I think she realizes that, it's why she's so embarrassed.  Good luck to you both in the future!",
            "Emergency physician here. She still may have had \"the flu.\" Gastroenteritis is most commonly by a virus, often called by lay people as the stomach flu. It is unlikely, though not impossible, that it was related to contaminated food. Food poisoning usually cause vomiting *or* diarrhea, depending on the type of toxin or pathogen, but not both.\n\nHaving said that, dehydration, whatever the cause, can be quite serious. Just because she was given IV fluids does not necessarily meant that she was severely dehydrated. I often give IV fluids if I'm already poking the patient for blood tests - might as well use the line. IV fluids tend to make you feel better more quickly even if you're not severely dehydrated. Oral rehydration is still the best and preferred form of rehydration.\n\nMost importantly, to OP: you did nothing wrong. Stop feeling bad about any of this. You took care of someone you love the best you can. To me, you're a healer just as much as I am as a physician. Good for you!\n\nEdit: Here's another argument against food poisoning. If the source of her contaminated food is from a food truck, more people would have reported the symptoms and it would make the evening news.",
            "Gastro can be caused by bad food, but it can also be norovirus (aka \"the stomach flu\").  So you weren't completely in the wrong.  Also, norovirus is VERY contagious, but has a few days incubation period, and you handled her fluids a lot.  So basically you might start vomiting in the next couple of days, so be on the look out.  But everyone should know that extreme vomiting for more than a couple days does need emergency rehydration.  It's good to keep some pedialyte or electrolyte powder in the house just in case.",
            "Reminds me of the Futurama episode where the main character eats a sleazy sandwich from a truckstop. But rather than getting Gastroenteritis he instead gains superhuman strenght.",
            "There seem to be a lot of people here who don't seem to understand that OP saying he's not the smart one is something he said as humor and also as an endearing comparison to his girlfriend. He's not berating himself for thinking he's a real-life Forrest Gump. \n\n\nAnyway, you did a good thing, OP. Sucks about your childhood family issues. \n\n\nAlso, all this talk about electrolytes and no mention of Brawndo? It's got electrolytes. ",
            "You may not work in the medical field but would be a good fit (if it's something you would like to do). Seriously, that level of compassion and caring can't be learned. You're a good guy and I wish you two the best! ",
            "Husband material intensifies",
            "Just remember to wipe front to back.",
            "You are what I call a \"stick around guy\"  The yucky stuff in life will not scare you off.  My husband and I have helped each other through some pretty yucky (and tough) things including cancer.  At this moment he is emptying my bedside potty.  I have a broken ankle and can't go as far as the bathroom. He has a form of CP and I help him on with his shoes and brace every morning.  Life is gross, messy, and often difficult.  The world needs more stick around people.",
            "I wanna buy you a beer",
            "My boyfriend and I are both disabled. When one of us gets sick, the other takes care. Yes, pooping and throwing up on yourself isn't fun, but a good partner will do what they can to keep their loved one healthy. You did good, OP. It can be embarrassing to have an accident on yourself; my SO and I have been together 4 years and sometimes we still get shy about accidents - but like you said, it's part of being alive. You're a kindhearted, compassionate human being, and I'm sure she is grateful to have you around. ",
            "you seem like a good natured and hard working dude. Do you enjoy working in a factory? Is that what you picture doing long term? Not trying to be a jerk, real questions, where do you live?",
            "Haven't been able to read all of the responses, but a similarly embarrassing thing happened when my husband and I were dating (and still in the \"Cloud 9\") stage.\n\nHe acted as though it was nothing. I was mortified. \n\nTime went by and, we both got really sick, at the same time, in tight quarters and with only one bathroom. After that, it was no big deal to me. We look back and jokingly recollect \"The Puke Shit Fest of 2012\" and the time when we both pooped the bed. Fun times!\n\nSo, once she's seen you in that condition, her embarrassment will probably fade. You certainly are a star!",
            "OP, you are a good man.",
            "I love you ",
            "oh my god. you're amazing.",
            "If she can, she should call the truck stop and report that she got gastroenteritis there. Most people don't contact the place where they likely picked up the bug, which means that the food continues to be prepared/served unsafely, leading to more sick people. She doesn't have to yell or anything, just let them know they might want to check on the expiration dates of their food or double check cooking and heating temperatures.\n\nSource: My dad was a chef when I was little, he said that a kitchen can't improve if they don't get feedback. My college epidemiology prof said the same thing, that his job would be a lot easier if more people did this. ",
            "Hey if ever you are concerned about dehydration there's this powder satchets you can get from the pharmacy called hydralite. You mix a packet in with water and it helps rehydrate you. They also make icey poles.\n\nIts also an excellent hangover prevention. One of those before bed and you will feel ok the next day.\n\nIf ever you get stuck though you can make a home made version that tastes bad but gets the job done. 6 teaspoons of sugar half a teaspoon of salt in 1 litre of water.",
            "I hope you have kids some day. You would be an awesome dad.",
            "You are a good person. Your guesses are all correct!",
            "I get gastroenteritis frequently and my boyfriend runs a mile every time... By frequently I mean like 2-3 times a year. He even cancelled an ambulance I called for myself when I became so dehydrated I couldn't stick my tongue out and was fainting. (No car, didn't want to throw up in a taxi as I'd have to pay £100 to sort it) I wish I could sit you down with him so you can teach him the ways lol",
            "You are a good partner and will be a good caretaker husband and/or parent in the future.",
            "Ahh there are some good blokes still I'm the world.  Good on you!",
            "You sound like a great guy.  Your gf is very fortunate.",
            "Good on you. ",
            "What you did was very sweet, and when she gets over the embarrassment I am sure she'll think the same, and remember it as a time you were the best boyfriend ever.",
            "You sound like a great guy. As I saw elsewhere, being sick is being sick - the details is for the medical people to know, you don't have to. You did a fantastic job. Others say you went above and beyond, which yea you kind of did, but as you assumed, you did what anyone should who truly loves the other. Keep being you",
            "Aw, you're a good boyfriend OP. I'm sure your girlfriend appreciates everything you do for her. ",
            "Kudos to you. I'd like to think I could do the same for my SO but can't say 100% i would :(",
            "You're a good chap, OP. You're also a really good catch and that makes the embarrassment all the more severe for her, but she'll see that there's no one that she'd rather take care of her when she's ill than you that makes you even more of a good catch. \n\nTake care and best of luck for the future.",
            "Factory workers aren't dumb, they built all my stuff!",
            "You are a great guy, your girlfriend is lucky to have you! :) ",
            "Great job OP. \"Gastroenteritis\" *is* the \"stomach flu,\" that's the common name for it, just like we say \"cold\" instead of \"upper respiratory infection.\" There are billions of cases every year.\n\nGlad your girlfriend is doing better.",
            "Gastroenteritis is no joke. Your girlfriend has my sympathy and you have my respect. I had gastroenteritis roughly three years ago and was shitting/vomiting violently for hours. My girlfriend (now fiancee) helped clean me up and take me to the hospital. So, your girl may be embarrassed, but trust me...she's grateful.",
            "OP you're a good guy. ",
            "You should look into getting her some brawndo.",
            "> she ate from a truck stop heat lamp food stash\n\n> gastroenteritis\n\nChecks out.",
            "I have had gastroenteritis before.  It SUCKS and is horribly painful.  It's definitely one of those wipes-you-out-for-a-week types of sicknesses.  She's lucky to have you!",
            "She better husband you up REAL fast before other women catch wind of this",
            "Oh man...I've had that exact same thing.  I feel for her, glad she has someone to take care of her.  I ended up driving myself to the clinic and passed out upon opening the door.  Its not fun.",
            "Man, my shyness towards my boyfriend went to zero after having explosively vomiting and crying at the same time of embarrassment for 2 days. ",
            "She ate a truck stop sandwich? Better check her for sentient worms. ",
            "Sounds like you're a great guy. She's lucky to have you in her life :)",
            ">As to where to got it, she told me she ate from a truck stop heat lamp food stash last Friday, because she was in a hurry, so hopefully she won't do that again.\n\nReminded me of that episode of Futurama where Fry gets worms. STOP EATING FOOD FROM TRUCK STOPS, GUYS.",
            "I'm 24F and my boyfriend is my age as well... we recently had a paralleled situation, of which I was both terrified and mortified. Background- I've known my bf for 10 years, we've been dating for the last year and some change.  \n\nRecently, I had become quite sick out of no where and my boyfriend was phenomenal at taking care of me as well. However, I have serious anxiety about like everything, and I got ridiculously ill all over his car and it was a hot mess. After everything was cleaned up and everything my bf asked me if I was okay, and I obviously wasn't because it panicked me to no end that I basically just got (though uncontrollably) ill and my anxiety led to embarrassment which basically led to me not taking to him for about 20 minutes until he finally just said, \"Look, I can tell something is wrong and I get that stuff like this happens and I just want to take care of you and open the communication because we need to talk about this.\" Which caused me to be more panicked but if he hadn't done that, most likely I would've been even more of a girl about it and avoided him much longer. \n\nI don't know if that is the best way to approach it on your end, but perhaps just something like that (in your own way and what is appropriate to your relationship) where you open up the lines of communication for her to speak and just let her know that you are still there for her when she is ready to talk about it. I think de-escalating the embarrassment is an important step in the process. I know at least in my situation, it really opened up a conversation between the two of us and we sat down and really discussed what I was feeling, what he was feeling, etc. (after I had calmed down because originally I kind of had a bad reaction because of my embarrassment and I yelled at him where it wasn't warranted). \n\nAdditionally, I think there is this idea that many women have (I know for sure I am guilty of it) where we don't like to admit that we get sick or have messy situations like that or whatever. I think a lot of that stems from socialization and the ways in which women are taught they need to be in order to have a successful relationship. I mean as silly as it may sound and as sweet as you were being, sometimes it's hard to admit that you need help, even if you're in an intimate relationship like that and more than anything it's absolutely terrifying to be so vulnerable and exposed and then with the embarrassment mixed in it becomes this mess of emotions. \n\nI hope that things are going better now and that she starts getting better and healing. I think that as others have mentioned you did the best you could with the knowledge you had, and working in a factory does not make you less intelligent. It was also very genuine and honorable for you to take care of her during a time of need, and hopefully having this experience will only serve to strengthen your relationship as well. ",
            "Bravo! You sir, are a true gentleman. \n\nAnd I'm glad to hear she's doing better. ",
            "We should all be so lucky to have partners like you, OP.",
            "The only way to make this right is to shit yourself and wallow in it until she is forced to clean you up as well.\n\n\nThank me later OP.",
            "You ptobably wont see it but as a guy who really loves his gf, what you did made me feel feels. Proud of you man! Youre a good guy and youre both lucky to have each other :)",
            "I had acute gastroenteritis once. It was terrible, one of the worst feelings I've ever experienced.",
            ">So yeah, wasn't the flu like a lot of you guys were telling me, \n\nmaybe people were \"telling\" you that because that was in the title of your post?  \n\nGreat update. You are a solid guy and she'll appreciate all of it once she feels less icky.",
            "If you have the time, I'd definitely stop by that food truck and let them know what happened, maybe contact your local health department too. ",
            "Just be careful OP. Don't use the \"Does a Lynx shit in the bed?\" joke too early.",
            "I've only just managed to convince my boyfriend of nearly three years to help me with the spots on my back, so you are a hero in my book. She's a lucky girl (or she will be when she's better, poor thing).",
            "You are a gem. ",
            "Use Pedialyte for rehydration! Much better than Gatorade, not sure which doctor would tell you to use Gatorade. :( But good for you guys, I'm glad everything worked out! ",
            "Gastroenteritis is doctor speak for stomach flu. ",
            "You are going to be the greatest father of all time. You are awesome.",
            "Between your gram and this girl, you're a goddamn saint.  \n  \nI went through a similar thing with my family not taking care of my grandmother and it's horrible.  I have a ton of compassion for people who have loved ones in bad shape.  It's one of the most overlooked areas of hard work in our society and largely goes unthanked.  So thanks for being a good dude.  \n  \n",
            "Hero !",
            "My best friend has been sick for a week. I've had a minor cold for a few weeks so at first we thought it was that. Then he got a fever, then he started throwing up, then he quit being able to eat much, and was just in pain and sick. I told him to go to a doctor because he didn't have the flu. He insisted he did but went anyway because he had already missed several days of work. Turns out he has an ear infection in both ears and bronchitis. It's normal this time of year to assume a flu or cold, but there are times when you need to go to a doctor. \n\n\nYou're an awesome person.",
            "If my fella was not as fantastic as you, I would ask if you had a brother.\n\nYou are a good person with a great heart.",
            "Way to go man!",
            "You are a prince. Seriously.",
            "This made my heart warm",
            "You are seriously awesome! So glad you got her to the doc and on her way to a full recovery! :D I love happy updates and this one was awesome to read! You're a wonderful man :)",
            "In solidarity with everyone else, you're an awesome SO. Your girl is lucky to have you. \n\nI was also wondering about the flu or not. I had basically what she has a few years back after some undercooked sausage at IHOP. I more or less didn't leave my bathroom floor for two days. Things came from everywhere in ways I never thought possible. I have never been that sick in my life. The one time I left the house was to take my then 1 year old to daycare for the day because I was alone and too incapacitated. I had to pull over to throw up 6 times on the way there and back to give you some idea of where I was. \n\nYou should try to make sure your GF has someone with her if possible. Even if they're not in the same room. That stuff is kind of scary. I hope she gets better soon! Definitely make her drink things, even if they come back up. ",
            "the BRAT diet: Bananas, rice, applesauce, toast. Awesome for coming around after vomiting your guts out.",
            "Bananas, Rice, Applesauce, and Toast for when people have diarrhea. No butter on the toast, no spices on the rice (salt is okay) and no cinnamon on the applesauce. You can freeze the bananas and put a stick in them if you want.",
            "Oh God! I was 24 and got struck with gastroenteritis at my best friend's house while visiting for the holiday.  I'm sure once your girlfriend will get over the embarrassment since you didn't treat her like it was anything to be embarrassed about, it will just be a funny story. \n\nIt is an awful and upsetting experience, and a little scary. My friend and I only see each other about once or twice a year since moving to separate cities. Sickest I've ever been in my life! I wouldn't wish that on my worst enemy. I felt extremely embarrassed because the same thing was happening to me as your girlfriend, and I locked myself up in her tiny bathroom for the night. My friend kept offering me water and asking if I was okay throughout the night, but I couldn't stand the embarrassment, and refused help. \n\nIn hindsight, it was so nice to be cared for! She took me to an urgent clinic the next morning after I had already vomitted over 24 times in twelve hours (God only knows how many times I had diarrhea...) and not getting better. We laugh about it now, and I'm certain you and your girlfriend will be able to one day, as well!\n\nAlso - you really weren't far off guessing the flu. My doctor did not say it was food poisoning, he said it was likely a virus and said it is colloquially called \"the stomach flu\".",
            "Gastroenteritis = Food poisoning.",
            "Well, I mean it is technically still flu, just stomach flu. I'm glad you knows know what was wrong now. No waiting around next time! ",
            "Electrolytes. It's got what girlfriend's crave...",
            "I just told my boyfriend about this story and this is what he said... \"if you shit yourself I would tell you to 'clean it up yourself, poopy-booty girl' and chuck toilet paper at you.\"\n\nRelationship goals.",
            "You're a great person. ",
            "You are a good guy and you did the right thing. Food poisoning is not joke if you get the wrong kind and dehydration is definitely what you worry about when you can't keep stuff in or down. Keep being a good guy!",
            "You are a wonderful person and she is incredibly fortunate to have someone so caring. ",
            "You're a lovely fella and a wonderful partner. She's lucky to have you.",
            "Hope she feels better, soon! Glad you're such a good person to help her out. ",
            "You're a keeper OP!",
            "What a d00d. I like u.",
            "You sound like a top guy, she's very lucky to have you.",
            "I'm so happy to know there is someone like you alive somewhere. Also, please don't trust Reddit on a medical diagnosis. I've recently had \"gastroenteritis\" and learned it can be caused by multiple things, including what we would call \"a stomach flu\". It's basically the same thing- it can be caused by a bacteria (like E. Coli) or a virus (like the noro-virus, or coronavirus), and the symptoms would be pretty much the same- puking and shitting your brains out (varying degrees of one or the other perhaps being the only difference). \n\nAnyway, all that matters is your girlfriend has an amazing person taking care of her. ",
            "I almost lost my mother to gastroenteritis when I was a kid; glad your girlfriend is doing better now, but I'd just like to tell you too to not take illness lightly. ",
            "Dude, your girlfriend pooped herself?",
            "First of all, I totally would have guessed the flu too. Definitely don't feel bad about that. A few years ago when I was still living at home, my entire family had it pretty badly and there was definitely a point where I was in your girlfriend's exact shoes.\n\nSecond of all, is that shirt you have on made of *HUSBAND MATERIAL?* You seem like a very awesome and loyal partner, and I wouldn't be surprised if this experience brought you two closer than ever.",
            "Good deal brah",
            "bananas? for potassium i presume? em, yeah, a recent research paper suggested that it would take upwards of 4500 bananas to consume enough potassium to actually overdose on potassium. you wouldnt be able to consume it fast enough to give yourself an arythmia. anyway, just my 2c.",
            "Throw out all her food"
        ]
    },
    {
        "post_id": "40n7s0",
        "author": "FrustratedWifeTW",
        "title": "[UPDATE] My[29F] husband[33M] is an overgrown child and I think I've reached my breaking point",
        "url": "https://www.reddit.com/r/relationships/comments/40n7s0/update_my29f_husband33m_is_an_overgrown_child_and/",
        "score": 3071,
        "num_comments": 213,
        "created_utc": 1452617797.0,
        "selftext": "Edit: Whoops, forgot to link the [OP](https://www.reddit.com/r/relationships/comments/3xe0ma/my29f_husband33m_is_an_overgrown_child_and_i/)!\n\n\nA few things first, I just wanna thank everyone who commented on my OP. I got overwhelmed with the amount of responses while on mobile (had no computer when I posted), and stopped replying, but I read every single comment and story. I've received a few PMs asking for an update and I'm sorry it's so late!\n\n\nThis update would be extremely long if I typed every single detail (and still is kinda long, whoops), so I'm gonna try and condense it. \n\n\nSo, I sat my husband down the night he got home from work after posting my OP and we had a loooong talk. Again, this would be incredibly long if I wrote all the details so I'm gonna summarize and go in the order of my points I made in my OP. Keep in mind, our talk didn't follow the order of my post, so I'm sorry if anything seems confusing, since it would have been discussed out of order:\n\n\nOn not knowing when to pause playtime - I told him that I know he loves playing with the kids, and I love that he loves playing with the kids, but that I really need him to work with me during bedtime. I also once again pointed out that their lack of sleep is making them grumpy and harder to manage in the mornings, and that they're growing and need their sleep. He's had a couple slip-ups since, but he's cooled it down around bedtime now and makes more of an effort to help me with bedtime. He's started reading to them instead (I used to to it) and is 20 times better than me at it because they love the funny voices he gives the characters.\n\n\nOn discipline - I told him its not fair of him to constantly make me feel like the bad guy. And that no parent LIKES disciplining their kids, but they need it to learn and grow into good adults, and that I need him to be united with me on punishments. He's having a little trouble with this one, but has been trying more. Which I appreciate.\n\n\nOn breaking their toys - I, again, told him that I know he loves playing with our kids, but he needs to stop destroying their things. That not only is it upsetting them, but it's causing us to needlessly spending extra money to replace things that we don't need to be. I took this part of the talk to suggest we finally get a full sized trampoline like we had been talking about for a little while, and that he should dig out his bike from the garage so he can ride with our daughter when she learns. We're both probably more excited about the trampoline than the kids lol. We talked more about this topic, but these are the most relevant points. He realized he goes a little too far after I described the scene I wrote about in my OP, with him riding around on their little cars while the kids are standing on the sidelines. I'm also happy to report he has stayed off our daughters new bike.\n\n\nOn making the kids play when they don't want to - He agreed that it wasn't cool of him to push just because HE wants to play. I told him our kids are people, and just because they're kids, doesn't mean they don't deserve to have their boundaries respected or time to themselves.\n\n\nAnd now on to the best friend thing - This was the first thing we discussed. Long story short, he was feeling hurt and generally having a little trouble accepting our daughter was growing up. This is really the first big thing shes done or said to show that she is, in fact, growing up. And he just wasn't expecting it and handling it very poorly, which he knew he did. I took a line from a comment on my OP and told him our children will have lots of best friends in their lifetime, but he will always be their only dad. This visibly comforted him, so thank you to whoever it was who wrote that. I took a suggestion from someone on the OP, and suggested that he call up his own parents and ask them for advice on how they handed watching 4 kids grow up and leave the nest. He really liked this idea and has since done so. I also showed him stories commenters on my OP shared about their relationship with their parents growing up. I told him that I'm not showing him them because I think he's going to become like those parents, but that I think it's important he see the children's side of things. These stories hit him pretty hard, which led into this:\n\n\nSo, I left something out of my OP that I didn't realize was relevant. Lots of people asked how my husbands relationship with his parents was growing up, and I answered that it was great. However, my own relationship with my parents was horrible. Long story short, I don't get along with nor even like my parents, and I see/talk to them maybe once a year. Growing up was miserable, to say the least. And it affected me for quite a long time where I was a huge ball of anger and resentment because of the way my parents treated me. I told my husband about all of this a few months after we started dating, so he was aware of everything from the start.\n\n\nMy husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them. Now, I started crying here and was a bit of a mess for a few minutes lol. It was honestly one of the most touching things anyone has ever said to me. I told him he *is* the best dad, and that I love him so much for it. Finding out that this was essentially the root of everything, it was a lot easier to continue on with the rest of my points.\n\n\nEverything has been great since. He really listened to what I was saying this time, and has made a big effort to help me out more while also cooling it a bit with the kids. Him and our daughter have been riding around on their bikes together every weekend. I've also started learning how to ride so I can eventually join. Again, I wanna thank everyone for commenting on my OP and helping me gather my thoughts. I thought a few things said about my husband were a bit extreme, but I realize that's something that happens when people give advice on a situation they only have so much info on.\n\n\n\n   \n**tl;dr**: Talked to husband. He's great. Made me cry. All is well.",
        "permalink": "/r/relationships/comments/40n7s0/update_my29f_husband33m_is_an_overgrown_child_and/",
        "comments": [
            "Great update!  Just a little fine tuning and you've got a happy home - and it sounds like, a pretty cool husband.  I think the fact that he's so into the kids and loves to play with them is amazing.  \n\nGood for you for learning to ride a bike!  ",
            "That's amazing OP, what a nice update",
            "[deleted]",
            "This rocks, and OP, if it helps your husband at all please read this to him directly:\n\nI am 24 and a guy. My entire life I've had best friends float in and out, but my dad will always be my best best friend (if that makes sense). \n\nRight now I found out he's coming to town for a day this coming weekend in between business trips and not only am I super excited, but I am calling out of work and telling my friends I'm not available in order to spend time with him. That's the way it's always been and that's the way it will always be. \n\nGrowing up, my favorite memories are our father son camping trips and the time he surprised me with a visit when I was stressed in college (I got a phone call from him and he was like \"what are you up to? I'm stuck at &lt;airport in my college town> and I need a ride\") and also the time he dropped in at the end of my study abroad trip and he and I galavanted (drunkenly) around Barcelona. \n\nThe point is, good dads are always appreciated. As long as your husband is a good dad, your daughter will adore him. My dad and I drive each other crazy sometimes and he definitely is my parent with all the rules and things that come with that title, but seriously, when your whole family agrees that you can't sit next to or across from your dad because you'll kick each other under the table and do really stupid stuff, it's pretty awesome.\n\nEDIT: I'll add another anecdote. When my folks dropped me off at college my mom was fine with it (no tears) and my dad busted into waterworks!! He didn't want to drive away. It was awesome and it let me know that he will always be there for me :)",
            "I love that three of the top four comments in the last thread mentioned couples counseling, psychiatric evaluation, and divorce. Clearly communication doesn't work ever.\n\n/s",
            "I seriously did not think this would have an update with progress. Someone needs to stop chopping onions up in here! ",
            "[removed]",
            "Is your husband Phil Dunphy?\n\nPS: Glad everything is alright now.",
            "I'm glad you two were able to communicate.  I only have one cautionary warning.  If you buy a trampoline, be prepared to lose your homeowners' insurance.  \n\nTrampolines are tons of fun for kids and adults, but they are also really fun for drunk teenagers, drunk adults, and neighbors' children who are unsupervised...it will call to them like a siren.  And they will break a wrist/arm/ankle/leg and you might get sued.  \n\nIf you get one, find a way to secure it when you're not outdoors so no one can be on it unsupervised by you. ",
            "This is lovely to read.  I was a little worried because some of the comments on here can be extreme (divorce! divorce! divorce!) and judge-y and not particularly helpful, so I'm glad you were able to take the best bits and leave the rest.  And perhaps you could try to play more with the kids and experience the happy childhood that you may have missed out on.  Better late than never!",
            "Your husband's making me cry too",
            "What a beautiful update.  Thank you.",
            "Really glad this was a great update. ☺",
            "Your husband sounds like a huge dork. Your kids are going to have so many good stories to tell people when they get older.",
            "> he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them. \n\nOmg. I legit teared up reading this. I don't have the best relationship with my parents either so I can only imagine how it must feel to hear that all of this has been him trying to be thoughtful (if a bit misguided). \n\nI am so glad he's been receptive to your concerns and that things are getting better. Best wishes to you and your family!",
            "That's so lovely ! It speaks well of your husband that he heard what you said and is working on his behavior. His love for his children is evident, and it's not always easy to realize that how one expresses one's love is damaging others and to learn to express it differently. It sounds like you'll all be fine, and like your children will have a wonderful childhood !",
            "This made me tear up!\nI'm so glad everything worked out - you two sound like amazing parents (:  ",
            "Lol.  Ctrl+f'd  the original post to find 33 counts of therapy and 24 of \"counseling.\"\n\nYou people need to calm down and maybe try suggesting that people try talking to their husbands instead of throwing money at therapists like they magically solve everything.",
            "Thanks for the happy update. Your husband sounds like a kind, caring, and fun guy. I'll bet your kids will be telling their kids what a fun daddy they had.",
            ">My husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them.\n\n*Looks around to figure out which of the officemates started cutting onions. ",
            "Wow, what a great husband. I knew he wasnt the crazy guy some of the commenters were making him out to be. There are always 2 sides to a story.\n\nIm happy he is trying harder. I remember one of the commenters saying to put him in situations where he is forced to discipline and be a dad (rather than a friend). Definitely, definitely do that and do not intervene even though you will want to! He will probably struggle with it at first but it will be a learning experience for him and help him to be an even better father.",
            "This is a really great follow-up. The most popular responses to  the original post all suggested therapy was required (not unusual on /r/relationships!) - but it sounds like you've made real improvements just by having everything out in the open. Worth remembering in the future. ",
            "Your husband sounds like a magnificent man that loves his children more than anything in the world. It sounds to me like he just got carried away with it. I'm glad everything worked out in the end.",
            "There are ways to discipline your child without having to punish them. Focus more on consequences and including the child in the discussion about their consequences. Even let them figure out what it should be. If your S.O. is having trouble with disciplining there are positive parenting articles and classes he can take that show how to parent without being \"the bad guy\" because you don't have to be. ",
            "Don't you love it when people effectively talk about things in a relationship and make it work? I love it. Even though things were extreme, be lucky you have a husband who is so loving and attentive to his children. Kudos to you and your hubby on confronting your issues head on. \n",
            "This update! <3 <3 <3\n\nAs a dad, this melted my heart :) \n\nShit it will probably melt everyone's heart.\n\nGreat work OP!\n\n",
            "> My husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them\n\nThat would've made me cry like a baby. Sweetest thing I've heard in awhile. I'm glad it worked out for you.",
            "I'm really glad it worked out for you! Just wanted to share my experience with one parent being the disciplinarian- it was always my mum who did punishments. Now I was a massively boring child and didn't get into trouble often (I'm not even joking when I say my rebellious thing was reading after lights out), so maybe that has helped things, but I 100% do not resent her for being the one to punish me and can't remember any time that I have for any longer than the 5 minutes I was actively being punished. So even if he never manages to get that one down, it doesn't have to affect your relationship with your kids!",
            "He sounds like the real life version of Phil Dunphy",
            "This is a great update. Considering the top comment in the last post was YOUR HUSBAND NEEDS TO GET A PSYCH EVAL (omg, seriously, you guys?) I'm glad you didn't go insane. It sounds like your husband is just like every other parents and has no idea what he's doing, but he loves his kids and he clearly loves you. I'm glad you guys worked it out. There are worse problems to have, surely.",
            "I'm a mum with a now empty nest and this lovely update gave me happy tears. Happy New Year OP :)",
            "Aw man, I've got something in my eye now, *sniff*.",
            "Your childhood sounds like mine, and when I eventually grow up and get married and have kids I can only hope to have a husband as wonderful as yours seems through that last exchange. So happy for you!",
            "This is an amazing update and I started crying at \"My husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them.\" as well. I'm glad things are working out for you and him, and many more years of happiness with your children :)",
            "This was a really sweet update. Thanks for putting a smile on my face.",
            "I like how in the OP the top comments were essentially:\n\n* \"He's a narcissist!\"\n\n* \"He needs a psych eval!\"\n\n* \"He doesn't love his kids he only loves himself!\"\n\nJesus Christ, this sub. Sometimes all you need to do is sit down and communicate like adults, instead of demanding the other party get therapy and then go no contact. This is the problem when you ask strangers on the internet for relationship advice.",
            "Forgive my asking, but was your not learning to ride a bike as a child directly related to your bad parents?",
            "It makes my very happy that two adult human beings were able to sit down and talk through their issues without \"counseling.\"\n\n",
            "From the OP, and through the update, it sounds like you and your husband are awesome people that cooked up some pretty awesome kids in the process! To be honest, with the way you described him, your husband kind of reminds me of Andy Dwyer from Parks & Rec. The lovable duffus that Ron Swanson can barely stand. That's the type of Dad I would've loved to have growing up... even if he did break my toys. \n\nLike you though, I didn't, and I still don't have a good relationship with my parents. As a result, I have no desire to have kids.  \n\nI think what you did was right and just. Especially to your point about bedtime. That's a big one. You asked him to pull back a bit though; change his thought process. From here on out, there's a good possibility he may make every decision based off that discussion. I'm not saying it's wrong, and I really have no idea about the dynamics of the relationship, but I do hope you provide him with a bit of latitude to explore his fatherly duties as your children continue to grow.\n\nJust my 2 cents. \n\nGlad it all worked out. \n",
            "Happy home updates are the best updates.",
            "That is so great.  Really happy to hear it, OP.  I feel like with parenting, the #1 thing to look for is that each parent actually has a goal, something they want to achieve with this child.  The worst parents are the directionless ones, who don't even know why they had kids, whose discipline and play and everything changes all the time and doesn't have any real consistency because they didn't even really want to parent in the first place.  The best parents aren't necessarily the ones with lots of discipline, or the ones who communicate the best, or anything -- it's the ones who love their kid and for whom parenting is an actual project, with targeted goals.  It sounds like, though your husband seems like he's all over the place with the playing, actually has such a goal and has something in mind when he's doing these things (as you said, to give them the childhood he knew you would have wanted).  So congrats on working this out.",
            "TL:DR(ead). I'm glad for you both. Talk it out, have sex, let each other be your individual selves, eat ice cream, cuddle and have raunchy sex.",
            "Sounds like you're making good steps! Make sure you keep up the progress though, don't let it slip into the old patterns after a while.\n\n>  I've also started learning how to ride so I can eventually join\n\nAs someone from the Netherlands, an adult that can't ride a bike is about the weirdest thing I've read today.",
            "Aha! What a twist to the tale!\n\nWhilst occasionally displaced or excessive, he was overcompensating his fathering to try give you and the kids what you (wrongly and sadly) never had.\n\nThis doesn't excuse the extremities of some of his behaviours (the crying re: best friend a particular low-point), but I felt a lump in my throat when I read that.\n\nAnd credit to you, more importantly, for being open and honest on here and also working constructively with him to refine some of the rougher edges of his methods (that are clearly borne of good will and love).\n\nIt's lovely to read this and I wish you all the best of luck into the future.\n\nWhat a lovely outcome, truly great to read this, thanks for the update.\n\nAnd wear a helmet!",
            "Great to hear there's improvement!  I still want to throw my two cents in regarding the situation and things to continue to consider. \nI think most parents want to be the best parents possible and it's admirable that he wants that bond with his children.  At the same time, just as it's unhealthy to expect a partner to make you feel better about yourself and take care of all your emotional needs, it's very unhealthy with a child. \nGrowing up my mother was a single parent and I was an only child.  I was her world.  To this day I have a hard time being around her when she'd upset because I feel responsible for her emotions.  My mom remarried when I was 8 and I have two have siblings.  Neither of them have this issue.  My mom changed a lot after that marriage.  She developed more friends, depends on her husband instead of her children, worked on her self confidence. \nUltimately I think that's one of the keys to being a good parent that a lot of people forget--having your own life.  Being your own self-sufficient person gives your children the space to be their own people and to change and fail and figure things out without totally shaking your world.  \nI think it might be good for your husband to work on having more time with friends, more time with you, more time doing hobbies.  It's great to spend a lot of time with the kids and have a close relationship, but enmeshment isn't really good for anyone. ",
            "Wanted to give you a quick tip on the trampoline. Try to get an in ground one if you can. We have one and it is amazing. It seems to cut down on a lot of the horrific injuries you hear about from trampolines. ",
            "I'm not even married but... I teared up reading this, which I know is silly. I love updates about people that are married working through things and loving one another. I want this one day. I applaud you guys for talking and working through this.",
            "I have to go against the grain here and suggest that perhaps there are still some issues and things have not been resolved like everyone is saying. \n\n1. Your husband sounds like he's a guy who can talk his way out of a lot of stuff This isn't to say he is consciously lying or manipulating. It's to say he's very good at rationalizing and saying just the right things. Again, it is not something pathological. It is a personality trait. **I am myself that way**. So while he might have made you cry from the things he said, the fact that he SAID these things does not in itself solve *anything*. \n\n2. The biggest red flag from your OP is that bit where your husband cried because your daughter said Emily was her best friend. The explanation that your husband gave here for his reaction simply confirms the problem. \n\nI don't know how anybody can think it's okay for a dad to be *that* attached to the idea that his daughter should stay little! I don't know how anybody can think it's okay for your husband to pressure your daughter that way to say that he is her best friend! \n\nYour daughter may stand her ground now, because she is 4 and doesn't know about hurting other people's feelings. What happens when she is a sensitive 6 year old who DOES know? How is a defenceless grade schooler supposed to hold on to her own self when her big, grown-up dad is threatening to cry if she dares to have some other best friend? \n\nWhat happens when wants to support a different sports team than his, or try out a hobby he can't \"get\"?  *Will she even be able to articulate it to herself that she likes something her father hates?* \n\nBecause let me tell you, I grew up with a mother who also insisted on saying she was my best friend and this has been my biggest problem. I was allowed no personality of my own. I was allowed no real friends of my own. My mother was supposed to be my world. I was indoctrinated on this from a very young age, and now, at age 34, I am still deprogramming myself. \n\nI worry for your children much more than I worry for you. A father is someone who is able to sacrifice his own needs and desires in order to let his children develop and articulate their own. A father who tries *this hard* to make himself the center of his children's universe, who clings *this hard* to his children remaining little... that's a terrible father. Not the best in the world at all. \n\nYour instincts were right the first time. Your husband is a manchild with serious issues. Seek help. \n\n",
            ">My husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted...  \n\nWho the hell is cutting onions?! ",
            "Sounds like you did a great job, OP! I hope things get better and worked out.",
            "This update actually brought (happy) tears to my eyes.",
            "I just wanted to write and say how touching this was. I love happy endings. I'm so glad that he took all of your comments to heart and is genuinely trying. I definitely welled up reading that he wanted to give your kids the childhood that you wanted/deserved. And full on tears when I kept reading. He is not only a great dad but sounds like a wonderful husband. Best of luck in your future together!",
            "you got a good guy op, its awesome to hear how open he was to trying to improve. thats a special thing to have in someone.",
            "When I first read the OP I was like, this father had potential and he cares a lot. Looks like a little fine tuning and it worked out all fine.",
            "Great update! :-)",
            "good to see one of these reddit things end in a great way, usually it's someone in the relationship being horrible and not learning and needing to get dumped.",
            "Aww, awesome update. Your family's gonna be just fine :)",
            "This is so, so wonderful! Gold stars in communication, both of you.",
            "Fantastic update! I'm so happy for you and your family! <3",
            "What a happy update! I'm glad everything worked out for you.",
            "It's so nice to hear stories about problem resolution when they work out.  Your husband sounds admittedly a bit immature, but he's got the most important thing you need: the ability to listen, communicate, and fix problems.  \n\nGood luck, OP.",
            "This is great, I'm so glad that you were able to get results just from sitting down and having a heart to heart.  I think there will probably be slip ups here and there but no parent is perfect and it definitely sounds like he's willing and cooperative, which is the most important thing.   I was worried from your OP that he wasn't open to reasoning but it's clear that his heart is in the right place.",
            "Oh my god this is such a happy update! I love happy updates. \n\nI'm so glad things are working out for you, OP. And you're never too old to learn how to ride a bike. ",
            "Everyone likes to call men \"big children\" or something like that in this sub when they are acting differently than you expect, doing something \"weird\"... this guy has a hard time accepting that his children are growing and he wont be such a big part of their lives forever.. how is that childish?",
            "fuck you, my dad is the best dad",
            "You mean you actually talked to him and didn't have him committed with psych evaluations and intensive therapy like all the internet Sigmund Freud's suggested in the OP?  \n\nGood for you.",
            "*So, I left something out of my OP that I didn't realize was relevant. Lots of people asked how my husbands relationship with his parents was growing up, and I answered that it was great. However, my own relationship with my parents was horrible. Long story short, I don't get along with nor even like my parents, and I see/talk to them maybe once a year. Growing up was miserable, to say the least. And it affected me for quite a long time where I was a huge ball of anger and resentment because of the way my parents treated me. I told my husband about all of this a few months after we started dating, so he was aware of everything from the start.\nMy husband told me he told himself he would be the best dad he could be, because he wanted our kids to have the childhood he knew I wanted, and wanted for them. Now, I started crying here and was a bit of a mess for a few minutes lol. It was honestly one of the most touching things anyone has ever said to me. I told him he is the best dad, and that I love him so much for it. Finding out that this was essentially the root of everything, it was a lot easier to continue on with the rest of my points.*\n\nwow. this was super touching. all of the sudden, it got dusty in my office.",
            "What an awesome update! I was so curious how things had gone. Good job! ",
            "So good to hear! You could also consider watching those nanny shows that were a normal reality TV thing, they actually had sme good advice!",
            "He sounds like he'd be an amazing husband and a wonderful dad. Good for you guys, happy to hear this great update!",
            "Yay, OP! Sounds a lot better now that he's realized he went a bit too far. I'm sure the kids are happier for it too. Good luck with baby #3!",
            "Your kids are the luckiest to have two parents like you. This is a great update, congrats on working it out.",
            "Kick ass! Congrats!",
            "PLEASE READ THIS.\n\nOP, I know your mailbox is filling with millions of comments, but I hope you will read this post because I think it's really important and I haven't seen this mentioned anywhere else:\n\n**Go google \"ageplay\".**\n\nIt's a relatively obscure form of kink (similar to furries, but less well known) where people as identify as children.  (Also, the majority of ageplayers play as infants, but a smaller subgroup focuses on young children.  It is often, but not intrinsically, sexual.)  \n\nA lot of what you are describing about your husband (in fact, I think a lot of the impetus behind people telling you to get therapy), sounds a lot like this could apply to him.  He may simply be a person who is psychologically different.  I suggest you go to some of these communities and ask about your situation there, they might give you strikingly different and helpful advice.\n\nIf I'm reading your posts correctly, there are two interleaving factors here:\n\nThe first is that your husband genuinely loves and wishes for the wellbeing of your children.\n\nThe second is that your husband is more comfortable in his own skin/mind acting/thinking as a child.\n\nI'm glad that conversation is working, but it sounds from your describing like moderate progress is taking a huge amount of effort from him.  So far, you're trying to leverage #1.  However, in order to make sustainable longterm headway, you'll have to tackle both.  \n\nYour husbands needs to explore both of these threads, unpack them, and most of all unpack how each situation interacts with one or the other.\n\nFor example:\n\nTaking kids to school-- mostly about caring about them, also wanting to spend time with them\n\nBeing your daughter's best friend-- mostly about identity\n\nHaving more children-- sounds like both!  How much is this about wanting a bigger family?  How much is it about staying immersed in the presence of children and childhood?\n\nOne sentence in your update also really stood out to me.  You said, \"My husband told me... he wanted our kids to have the childhood he knew I wanted, and wanted for them.\"\n\nI would explore what that means to him.  How much does he have a vision of childhood?  How does that vision interact with the personalities of your children and the childhood they want to have?\n\n\nIn conclusion, it sounds like your husband both wants to be a good dad, and explore what childhood means to him.  He can do both-- **but you guys really have to map this out on 2 different axes.**  Good dad vs bad dad, be childish vs not being childish.  If you try to make it one or the other (good dad vs childish, but because you care about him you'll make allowances and let him float in the middle), it will NOT work in the long run for either of you.\n\nPlease OP, go talk to an ageplay community.  Open the conversation.  :-)",
            "[deleted]"
        ]
    },
    {
        "post_id": "4agu71",
        "author": "Ohnonudes",
        "title": "[Update] Guy [M30's] I used to work with got a bunch of nudes off my phone and is threatening me/my boyfriend [M24] with them. What do I [F23] do?",
        "url": "https://www.reddit.com/r/relationships/comments/4agu71/update_guy_m30s_i_used_to_work_with_got_a_bunch/",
        "score": 3077,
        "num_comments": 154,
        "created_utc": 1458014181.0,
        "selftext": "[First post](https://www.reddit.com//r/relationships/comments/4a4h5g/guy_m30s_i_used_to_work_with_got_a_bunch_of_nudes/)\n\nIf I could afford to, I'd buy all of you \"GO TO COPS\" commenters a beer. Thank you all so so much. <3\n\nAfter I posted, it sunk in what a big fucking deal this is. I broke down and gave everything to my boyfriend about 5 comments in. He was pissed, but fortunately I didn't even need to prove myself. He immediately jumped to overprotective boyfriend mode, and said we were turning my phone in. We called the non emergency line and I was instructed to take my phone to the sheriff's department ASAP and not to engage with Sean at all (not that I was, I'd stopped responding)\n\nFrom there, my phone was taken and I probably won't be getting it back for a few more days so I couldn't really update immediately and I didn't really have much of one until today anyway. I don't want to give a bunch of information out for my own privacy, and also because I'm not supposed to, but Sean no longer has a way to contact me.\n\nHis phone, laptop, and his WIFE'S phone were taken when he was arrested today. Yeah, dumbshit is *married* with four damn kids. He's also been arrested for assault twice so I'm super thankful we went when we did. I don't know why exactly his wife's phone was taken, except the phone was also in his name. I was told it'd be at least a week before they could go through his computer or verify how got the images but as of right now he hasn't denied anything. \n\nSo it's obvious this isn't something that's going to be over and done with by next week, but I'm not scared anymore. \n\nA lot of people were confused by the dick pics. My phone auto saves MMS, so I had a few from my boyfriend. Sean had sent them to me with pictures of his own (much smaller...) penis saying shit like he knew I \"preferred daddy's big cock.\" Yeaaa ok. \n\nThere was a lot of really nasty shit he sent me that I didn't want to hash out in my post, but I do feel really bad that my boyfriend had to be involved. I'm really disappointed in myself for not protecting him better but he doesn't care that the detective saw his junk or that Sean did, and said it could have just as easily happened to him and someone got my pics off his phone. \n\nMy experience with the sheriff's department was honestly, awesome. I never felt like I was being judged and I was shocked because we live in a pretty small county with some pretty archaic ways of thinking. But it was fine. No one I had to speak with talked down to me, no one made it seem like my fault, nothing. Super respectful and genuinely tried to make me feel better about the whole thing. Even offered counseling services. Apparently this is SUPER common and something they end up dealing with when it gets really bad because people are afraid to tell anyone. \n\nAnd to clear up why my family wouldn't care and I wouldn't care if they saw them... They just wouldn't. I grew up in a very sex positive/open minded family. My uncle is gay and owns a drag bar. My aunt is trans. My mom did nude modeling in college. They will all be ready to kill this guy before being upset or embarrassed over my vanilla tit pics =/ I wouldn't send them out all willy-nilly but if Sean did post these online, and they recognize me, at most I'll get a, \"that lingerie doesn't work with your skin tone.\" \n\n**tl;dr: boyfriend didn't doubt me for a second. Went to sheriff's department, Sean was arrested today. Fingers crossed?**",
        "permalink": "/r/relationships/comments/4agu71/update_guy_m30s_i_used_to_work_with_got_a_bunch/",
        "comments": [
            "Congrats on nailing a sexual predator to the wall. I'm sure he's done this to other women before, and would've continued to do so had you kept this to yourself. ",
            "Justice boner.\n\nEdit: sorry this probably isn't the appropriate type of reply for this situation...",
            "You, your family, boyfriend and local cops sound rad. I'm glad this loser is going down. \n\nPerhaps that was a poor choice of words. ",
            " You did the right thing! I hope his wife makes the right decision too",
            "[deleted]",
            ">\"that lingerie doesn't work with your skin tone.\"\n\nThis really made me smile, your family sounds awesome. \n\nI was thinking before that I'd be really surprised if your boyfriend would have believed you were cheating instead of the truth of the situation. I'm glad that he indeed didn't need convincing, and your sheriff's department also gave a lot if support. Whilst it would have been better if Sean had never targetted you in the first place, this sounds like the best possible outcome.",
            "[deleted]",
            "Glad to hear that the cops were able to get involved and make an arrest this soon - please keep us posted!  I'd love to hear about what he eventually gets charged with, as well as what his sentence is :-)",
            "[deleted]",
            "Yay r/relationships community we helped somebody!!! And also congrats OP for going with the smart move, and it's awesome how supportive your boyfriend, cops and family were. I hope Sean steps on a Lego sometime soon ",
            "This is such a good update. You and your bf sound like a great team.",
            ">They just wouldn't. I grew up in a very sex positive/open minded family. My uncle is gay and owns a drag bar. My aunt is trans. My mom did nude modeling in college. They will all be ready to kill this guy before being upset or embarrassed over my vanilla tit pics =/ I wouldn't send them out all willy-nilly but if Sean did post these online, and they recognize me, at most I'll get a, \"that lingerie doesn't work with your skin tone.\"\n\n\nYour family sounds amazing. I'm glad all this worked out, and its so nice to see a family like that, that would be so open instead of shaming etc. And your boyfriend sounds awesome too :)",
            "So happy you went to the police and they are prosecuting. ",
            "*Victory dance* I am so happy. Happy for you, because you did the right thing and got exactly the right response, your boyfriend didnt even question you, and the cops were supportive. (Obviously this all should have happened, but I clearly spend too much time on this subreddit because a little part of me was expecting everything to go wrong!) I'm also happy for the other people you're protecting by taking action against a predator, who clearly gets off on control and manipulation. You're AWESOME, OP! ",
            "\"that lingerie doesn't work with your skin tone.\n\ncan we just appreciate your epic family ",
            "> I'm really disappointed in myself for not protecting him better but he doesn't care that the detective saw his junk or that Sean did, and said it could have just as easily happened to him and someone got my pics off his phone.\n\nYour BF is right. It's not your fault (or his) that Sean is a criminal and a predator.\n\nYour BF seems like a very cool guy BTW.",
            "I hope this dumb fuck's wife spends all their money on a top-notch divorce lawyer so he can only manage to afford a mediocre criminal lawyer.",
            "Whooooooooaaaaa! Go you! I know I'm not the only one here who thinks they're going to find more than just your photos on his computer. That guy is a sick fuck, who knows what other illegal shit he has on there. Definitely update again when you can!",
            "> I wouldn't send them out all willy-nilly \n\nI saw what you did there...",
            "GOOD FOR YOU for standing up for yourself!  ",
            "Congrats! Posts like this help to maintain faith in humanity.",
            "I'm so glad everything turned out so well for you even tho you shouldn't have had to go thru this experience at all. \n\nAfter I read your OP, I rethought my decision to not have my phone passcode protected. My \"risque\" pictures are hidden with the help of an app, but that was mostly to prevent any embarrassing moments when showing vacation pix to friends and family. ",
            "I'm glad you guys took care of this together.  If anything it will bring you 2 closer having a common foe.\n\nIt's scary how much more commonplace this type of blackmail is occurring.  John Oliver did a great segment about Internet privacy,  the amount of states that don't have laws protecting against revenge porn and situations like this is appalling.  Everyone protect yourself and you dick/tit pics",
            "Even though your family is open to sexual matters this is completely different to that. Your privacy was taken and not given.",
            "I've been wondering about you! Super happy that it turned out okay!",
            "Good on you, I'm proud of you for standing up for yourself. Your boyfriend did fantastic too, standing by you, supporting you and never second guessing you.\n\nYou're both great people and I wish you a lovely future!",
            "So great to hear that you and your bf are fine and that Sean is going down!",
            "Good for you, and good on your bf for protecting you!",
            ">He's also been arrested for assault twice\n\nHoly shit\n\n>My experience with the sheriff's department was honestly, awesome\n\nYou hear a lot of horror stories but I've heard many positive ones. Most cops have families, daughters, they take these things seriously. If they don't, speak to their supervisor.",
            "Glad to hear there's still good people in this world. Write the police a letter and thank them. For all the shit they put up with I'm sure they would appreciate it.",
            "\"that lingerie doesn't work with your skin tone.\" \n\nThat is fantastic! You are fortunate to have an understanding and compassionate family alongside you to support you in times of joy and times of distress and need! \n\nSeems you have a loving, understanding bf too -\n\n\nYou are so fortunate to have these people. Many do not :(\n\n\n*Nana internet hug*\n\nI wish you all the best to resolutely go \"after\" this predator. ",
            "Heh... Sounds like the Sheriff's Department is about to tear Sean's life apart.  Love it!",
            "GOT EM.!!!! Congrats!!! this dumb sack of shit has no balls to try and extort you like that. he is a pathetic excuse for a man/human being and what a cowardly act in trying to get some thrill. I feel bad for his family/wife though sigh. why does scumbag like this start a family. ",
            "you probably wont see my comment, but i feel for you. thereare some sick motherfuckers. you boyfriend is a good man for staying calm. i can honestly say i would beat the fuck out of someoen if they did this to my baby girl. but congrats. get that scumbag sometype of record and get yourself a job without the BS. good job op, best of luck\n\n",
            "I actually welled up a little hearing the authorities took you seriously, and they didn't shame you. I'm so, so proud of you for going to you boyfriend and to the police and so proud of him for not falling into the trap of blaming you. This is a fantastic outcome. ",
            "I'm so glad this is getting resolved, you are awesome for going to the police and it's great that they were so supportive and went to lengths to make sure you were okay. At least there are some sane people around!",
            "Man sounds like those cops were on it!!  Glad to hear your coming to a resolution! ",
            "Well done OP. Please keep us updated.",
            "Good for you!  I'm super glad you went to the police and got this guy, I only feel sorry for that prick's family, hopefully his wife sees him for what he is and leaves.",
            "Woohoo good for you. Glad everything is working out and I hope that sicko has the book thrown at him. I'd be so embarrassed to be his wife/kids. I doubt it's the first time he pulled this but hopefully it'll be the last. Keep us updated! ",
            "Awesome to hear everything turned out good. ",
            "**A+** response here, OP. I'm thankful and proud that you went to the cops and treated this like the important manner that it is - you make a great example for anyone else here who's had to deal with sexual predators. It makes a hell of a difference in making sure assholes like this are thrown the book rather than allowed to continue their shitty behaviour. Congrats on your bravery - and make sure to update again when there's more to tell, we all have justice boners here and you can't let us down!",
            "I'm so glad both the police and your boyfriend were supportive.  (I'm sure your boyfriend coming in with you probably helped with the police angle.)  Continue to stay safe. ",
            "I just love those happy endings when the mother fuckers go to jail xD",
            "The justice boner is huge right now. \n\nGood for you. And your awesome family. ",
            "I'm really glad to see this follow up. Every time someone learns how this goes, it takes away the fear of the next person turning someone in, and hopefully also teaches the would-be privacy invaders that it can have seriously bad consequences for them.",
            "So happy for you! Thanks for the update!",
            "I hope all turns out well for you OP. Sounds like things are getting better. Let us know how things turn out.",
            "I'm glad things went well for you. :)",
            "Ha I bet that didn't turn out like he thought, glad it's starting to get sorted! Also your family and boyfriend sound amazing :)",
            "And the world was set right again.",
            "Reddit! We did it!\n\nEdit: Actually the police did it... but yeah.",
            "HELL YEAH! */justice high-5/*\n\n",
            "I want my beer!",
            "> My experience with the sheriff's department was honestly, awesome. I never felt like I was being judged and I was shocked because we live in a pretty small county with some pretty archaic ways of thinking.\n\nYou are very, very fortunate.  Glad you got this resolved but for many out there this is not the case :(  Things are changing though.",
            "> Sean had sent them to me with pictures of his own (much smaller...) penis\n\nwait i thought size didn't matter!",
            "Thank you. Your post made my day! Love to hear such supportive family you have!",
            "Thank you for going to the police! Screw that guy I hope his wife leaves him.  In fact I expect a post here any day \"My husband is awesome and sweet except that he was arrested.  The police say he was charged with sexually harassing women by blackmailing them.  What should I do? ",
            "\"preferred daddy's big cock\"\n\nThat made me laugh... Then I shivered cuz that's really very creepy.",
            "**WE ARE SO PROUD OF YOU**",
            "So glad to see this update!! Hope everything continues to go well!!",
            "I know someone who was in a similar blackmail situation and didn't feel she could go to the cops. She's still in therapy over what he convinced her to do to avoid her husband finding out.\n\nYou did the right thing.",
            "Told you. Slam dunk. :)",
            "So glad it went well! ",
            "Thank you for doing this for yourself and in turn helping other women. Your man sounds like a keeper. Best of luck",
            "You handled this like a rockstar !!",
            "[removed]",
            "Really glad for you that everything went well! \n\nBut I also *really* hope you learned from that. Especially if you have nudes of yourself on your phone you should be more careful! I mean, I treat my phone like my firstborn child I I don't even have any nudes on it. A phone just contains so much private stuff, it should be looked after accordingly. \n\nGood luck with the rest of this case :) ",
            "[removed]",
            "[removed]",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "hro3xn",
        "author": "throwawayvr000",
        "title": "My (27f) boyfriend (23m) tried to throw out our bed so he could play a video game",
        "url": "https://www.reddit.com/r/relationships/comments/hro3xn/my_27f_boyfriend_23m_tried_to_throw_out_our_bed/",
        "score": 3064,
        "num_comments": 482,
        "created_utc": 1594821752.0,
        "selftext": "Me and my boyfriend have been living together for about a year now and for a while he's been really interested in virtual reality. Now the problem is that our tiny studio apartment isn't big enough to jump around in. He knows this, I know this, and we've had multiple conversations about how it's a shame we don't live in some huge house where we could dedicate an entire room to something like that.\n\nI went out yesterday for a walk and a picnic yesterday and came back to my boyfriend dismantling our bed. I assumed something had broken and asked what had happened. Nothing was broken. He'd managed to order an oculus quest headset and had made the executive decision that we could swap our double bed for a Japanese futon??\n\nThere is no fucking room for this. Even if we lived on the ground floor (which we don't), and I was willing to sleep on the floor (which I'm not), the room just isn't big enough. It would dominate the entire room. Am I supposed to crouch in the kitchen whilst he plays? Our entire home is being compromised for what is effectively a video game.\n\nI honestly don't really know what to say. He thinks he's being entirely reasonable to do this without involving me. I don't even know what to say to him here since the whole thing seems so ridiculous and he's so obviously being unreasonable yet is oblivious and keeps saying I'll really enjoy vr and it'll all be worth it. I told him I was worried he'll damage the TV or my art supplies and he is convinced it won't be a problem as they have sensors for that.\n\nI love my boyfriend and he's always been entirely reasonable and level headed until now and we always discuss everything. How do I get through to him about this? If it wasn't so difficult right now I'd be considering moving out or leaving. I told him I'd throw it out the window when it arrived unless he was going to sit down and have a serious conversation about this but he just won't take anything I say seriously. \n\nTL;DR My boyfriend bought a vr headset and wants to remove our bed to play it in our tiny studio apartment and can't see this is unreasonable.",
        "permalink": "/r/relationships/comments/hro3xn/my_27f_boyfriend_23m_tried_to_throw_out_our_bed/",
        "comments": [
            "Tell him he better be able to get a virtual girlfriend on it to sleep on the floor with him",
            "he was dismantling the bed when you were away so he could finish the job before you got there, so that you’d be powerless. he doesn’t care about your opinion enough to talk about it with you..or enough to use his own common sense!? he definitely needs a good shake up, you’ve got to give him an ultimatum cos he’s acting like a child so he needs to get treated like one really. because currently it seems like he thinks his actions don’t have consequences, so you have to show him they do.",
            "Sounds like you're dating a child. Is this the first time he's selfish done something like this?",
            "Oh honey, I get you. My boyfriend got an oculus rift when they very first came out, I think he even preordered it. For 6+ months it was non stop VR is going to change our lives/the world, soon EVERYTHING is going to be available in VR etc. then it came, he put it in the living room originally, all the furniture had to be moved when he wanted to play, plus it’s wired so try not tripping over everything when your playing. I hated it, but his house that we live in is large enough to get away from it if I needed to, it doesn’t sound like you have that option. Thankfully he eventually realized that it was incredibly cumbersome and in the way and he moved it to his office. I can’t remember the last time he used it, but I’m betting it was at least a year ago if not more. \n\nI know he still loves VR but the tech just isn’t where he wanted it to be and as soon as it is he will be back on it and we’re going to have to make sure that it’s not dominating a shared space, we’ve talked about finding a house with a basement so he can have a gaming space that is also able to have guests easily hang out in. \n\nI would just have a conversation, tell him you’re not attacking his hobby but that you’re not willing to change your life drastically for it. He’s really young and probably hasn’t had to be very considerate of someone else to this degree before and he’s gotta learn now that he doesn’t get to dismantle a shared space without approval of the people sharing it. If he takes it poorly and insists well then it’s in your court, do you want to be with someone who unilaterally decides important things? (A bedroom setup is pretty important). You’re not his mom, you don’t get to tell him what to do but both of your should be trying to work it out while taking the other persons wants into consideration. It called compromise and your both going to have to do some of this if the relationship continues.\n\nHe has to understand if he doesn’t have access to a space that’s just his he doesn’t get 100% say.\n\nAlso don’t throw it out, destroy it etc. that makes you a way bigger jerk, you have no right to destroy/give away his property. The only leverage you have is your willingness to continue a relationship with him. I know you think you’re stuck but you’re not. It’s hard to leave without support but what happens if he hurts you? Cheats on you? Stops bathing and hordes 50+ cats? You need an exit plan always. \n\nStart looking into rooms for rent and other housing options. It’s not impossible to even find a room to share not just rent on your own if money is that tight. Being free of a bad relationship is worth the hardship it takes to do it. \n\nThe worst thing you can do for yourself is to let the other person know that you have no choice but to stay. Once they know that they know they can do a bunch of not ok stuff because you aren’t going to leave. Never let anyone think they have you on their hook no matter what. You are probably a wonderful person who deserves love and respect and shouldn’t settle for someone who only gives you one of those things. \n\nRide or die is only for people who truly have your back and are willing to work out whatever comes along, not just one dictating how it’s going to be and the other person has to fall in line.",
            "> Am I supposed to crouch in the kitchen whilst he plays? \n\nIf you let this go, yes. Imagine that. He'll be in a VR headset, completely dead to the world for hours and hours at a time, dominating your entire living space while you crouch in the kitchen. How is your apartment set up? Could you walk around him while he's playing? Leave, go to the bathroom, come home, etc? How will you live while he gets what he wants? Think about that, and then think about how he doesn't care about any of that. He doesn't care what you'll do, he just wants what he wants. Your comfort and home be damned. Is that really the kind of relationship/living space/dynamic you want?",
            "The thing that really gets me about all of these posts is when people say they love their SO and they’ve always been totally reasonable, but just this one time they went too far and dismantled a studio apartment for a VR system...you’re telling me there have been NO HINTS BEFORE THIS.",
            "He wants what he wants. And he is happy to completely ignore you. You do not exist. Because you seek to get in the way of what he wants. I think the one regret I have is continuing to struggle to \"get through\" to someone who just did not care. Just only cared about himself and what HE wanted and needed. Don't go through that.",
            "My husband has a VR headset. Not Oculus but similar. \n\nYes it does have sensors, but it's still easy enough to accidentally go outside of those bounds especially if you're in a small area. We each have accidentally tapped the wall or ceiling fan (low ceilings) while playing.\n\nIf it were just him in the apartment it would make sense for him to set it up, no problem. \n\nHe doesn't seem like he is thinking about you at all in this, which is a big warning.",
            "He will do this forever without therapy. I am divorced from my ex husband due to what I didn't recognize as untreated gaming addiction (a long with a bunch of other shit that I saw and ignored because I was a dumbass). Tell him you need to end the relationship unless he gets treatment because making big decisions without you that prioritize a game over quality is life is a deal breaker for you. Also be prepared to follow through and leave, no matter how embarrassing you think it will be. I wish I had just been embarrassed and moved back in with my parents after that first six months of living together instead of getting married and then divorced... And still moving right back in with my parents except as an older person lol.",
            "[deleted]",
            "I've been in your boyfriend's shoes, at around his age as well. He's wrong. He needs to understand what it means to listen to the needs of another person he's committed to. Having a partner is a trade of freedom for both people in a relationship, and no two people think exactly the same. You are going to disagree, and sometimes either of you will have not to compromise, but capitulate. This is one of those situations.\n\nI don't know how to make him realize that, though. I was fortunate enough to learn that lesson in much less stressful setting.",
            "> Japanese futon\n\nMy back is screaming in agony just READING that. Oi....\n\nYou say you 2 have a pretty stand up relationship aside from this where hes being rather pigheaded.  I saw some comments screaming ultimatum, threaten to leave him, etc. Those, imo, are last ditch efforts when the bed starts making its way to the curb (I am curious, who bought the bed? If you did then he has no right to remove your property)\n\nAside from talking whilst dismantling, have you tried sitting down with him and talking about it? When he has nothing else to focus on but you? Have you told him how youll both be crippled in 6 months from a god forsaken _futon_ ? Have you thought about proposing a savings plan, to save up for a slightly larger apartment (if that is plausible)?\n\nThe above is ofc only if you havent tried a sit down. My SO can get rather distracted by things so sit downs where hes not doing anything and has to focus on me are beneficial. They dont happen often, but the odd time its needed so we can refocus. Sometimes I have a hard time starting these sit downs and will send him a text laying out my grievance, my thoughts behind it, my reasons for feeling the way I do, and ask of we could arrange a time to talk later that evening.",
            "I'm a bit overwhelmed at the amount of responses right now so I'm not going to get a chance to reply to everything but I am reading through all of your comments thank you.\n\nIt hurts a lot to see so many people saying he doesn't seem care about you at all but it's definitely eye-opening. Our relationship obviously is a lot more complicated than I can ever present in one post but I think that my boyfriend has been struggling a lot with feeling isolated at the moment.\n\nThe fact I can't get through to him at all and he's in complete denial this is even a negative thing for me and he just everything I say down with \"but vr is so great don't worry about it\" is really scary and a lot of your comments help a lot. I don't quite know whether I'm going to present him with an ultimatum but I'd rather have a more neutral discussion if I can.",
            "Therapist here.\n\nI see plenty of couples who are in the same philosophical boat as you. One or the other does something so astronomically selfish and unreasonable that I cannot believe that it actually happened, but it did. In every single instance, one or the other (or both) have been genuinely terrible at communicating - their feelings, their thoughts, their opposition. As it happens, that is how this situation will resolve, to whatever end.\n\nAs others have said, you need to lay out to him in respectful but in no uncertain terms exactly what his doing this communicates to you, how it makes you feel, and what questions it calls to mind regarding the longterm viability of your relationship.\n\nThis was a very childish and disrespectful thing for him to do. You say it is out of character for him, and I'm not going to doubt you, but it is *possible* that there have been seeds planted along the way that point to this sort of behavior. That is something that only you can discern, but it may be worth sitting down to recollect. Something this big and boneheaded doesn't come out of left field.\n\nOne thing is absolutely true: we teach people how to treat us. This is your opportunity to teach him something he has forgotten, or else to clear up any misconceptions he may have formed previously in the relationship - that you deserve respect.",
            "> have sensors for that\n\nLOL, I doubt you can find a single Quest owner who hasn't punched a wall, knocked shit over, kicked a cat, etc. \n\nGuardian isn't fast enough to prevent it. Its just there to let you know if you're walking too far. \n\nSo even ignoring the issue of the bed, he's absolutely wrong about the Quest and how well it works in a constrained space.",
            "This is nonsense. The Quest uses a wireless tracking system that doesn't require a computer or a permanent setup location. Most games and experiences will support a stationary boundary setup where you can play in a small location while seated, at least to a certain extent. He doesn't NEED this space, he WANTS this space to play a specific subset of roomscale games. If his room isn't roomscale, he needs to play at a smaller scale. He's using your unfamiliarity with this system to make unilateral, unnecessary decisions and pass them off as a requirement to do anything with his new Quest. Perhaps his next relationship can be one entirely in VR Chat? \n\nSource: VR developer living in a tiny apartment",
            "Well, your boyfriend is extremely selfish. He thinks it's okay to make unilateral decisions that harm you, for his own selfish reasons. Taking apart the bed unilaterally is a deal breaking behavior. I would tell him that his behavior is making you want to break up and move out. If he just fundamentally doesn't care that he is hurting and upsetting you, what's the point in staying with him?",
            "This is what happens when you date someone at a wildly different stage in life.  No, it's not about the age gap in early to mid 20s relationships - it's about life experience.\n\nYou're 27.  You've presumably been in the adult world with real responsibilities for half a decade.  This kid is barely out of college.\n\nI bet this isn't the first time something highlighting the maturity gap has come up, it's just (hopefully) the most egregious.",
            "So the handy thing here is that he's already dismantled the bed, but you'll need to let the movers know that you want it reassembled in your new place.",
            "He won’t take your right to a bed seriously. \n\nHe won’t take your right to space in your apartment seriously. \n\nHe needs to get the game and keep it at a friends home who has space. \n\nYou don’t. He chose to live with someone meaning your opinion has to matter to him. \n\nSee if you can stay with a friend for now.",
            "Are both your names on the lease?  Do you split rent?",
            "Have you guys been in extended lockdown? It’s possible he’s experiencing some mental health issues and obsessions related to the isolation ~  the VR could be an outlet.  ESP if he sees the future as being bleak. \n\nif he doesn’t have a history of crappy behavior like this - id def consider that as a possibility.",
            "So throw it out when it arrives, and buy a single bed just yourself (the last part was a joke, unless you've got some spare money).  It's completely unreasonable, he has no right to make this desicion without you and you are entitled to reacting quite dramatically since he refuses to cooperate. Act as unreasonable as he is, give him a taste of his own medicine.",
            "Is there anyone else you can stay with?\n\nYou've done the thing you had to do: You told him straight up that his awful, unacceptable behaviour was threatening the relationship. If he still wouldn't hear you that this is a dealbreaker (and it should be) then you need to start taking steps to break the deal. \n\nNot because he'll come around -- if he didn't hear your words, he probably won't respond to your actions -- but because that is where you are now. You need to be prepared to end this. \n\nGood, honest ultimatums aren't designed to get someone else to change.\n\nThey are meant to be clear to someone else that if they don't change, the consequence will be that you will change. You will change into someone who is single.",
            "leave him, hes too immature for you.",
            "Listen, I know there are other posters who have asked you to exercise caution in this regard, but your boyfriend's behavior is pretty fucking crazy. \n\nAt its most innocuous, the behavior is immature. If it's just momentary immaturity, he could perhaps be woken up with an ultimatum. Such as: you'll move out if he doesn't change. \n\nAt its most harmful, the behavior indicates complete disregard for your comfort, feelings, and happiness. It also indicates a flagrant insensitivity around the harmony of your living space. Pretty much a degradation of your relationship from all sides. I know you say that this is the first bout of unreasonable behavior that you're seeing from him, but don't kid yourself, if you stay in this relationship, you will absolutely encounter this conflict again. Maybe with different details, but the core of it will repeat. That's just human nature.\n\nGauge his reaction to your ultimatum, and then make your decision. It will be easier for you that way because you won't have any regrets when you decide what to do. Maybe he really is a good dude and will turn it around. I can't feel super optimistic for that, but that's my perspective. If he doesn't see this is crazy from the outset, you're probably not going to be able to convince him. I had similar conversations with my ex husband to make him stop reacting with extreme anger to every disagreement we had. I tried for years, but he was who he was. So I left. But you can avoid wasting that kind of time. Just be honest with yourself about whether or not you're actually willing to deal with this crap. I wouldn't be.",
            "\"No, I don't want to. That's the end of it. That's the price of admission for living with me: I have needs and you need to take those into account, not make decisions that affect both of us within even asking me.\"",
            "I worked as a VR facilitator for the better part of a year, and I can assure you no amount of sensors will stop him from accidentally hitting a wall or something. But he doesn't need to dismantle your apartment to make space, he just needs to get an Oculus QUEST and not a rift. The quest requires less space and doesn't need a computer so he could even play it sitting on the bed, in the other room, or even outside as it is fully portable. I'd recommend you steer him towards that while standing firm on not comprising on your bed.  \n\n\nAlso VR is super fun and you will most likely enjoy it but your apartment is a living space first and a gaming space.... second? Third? Fifth?",
            ">I love my boyfriend and he's always been entirely reasonable and level headed until now and we always discuss everything.\n\nSomething is off. When you say that you guys discuss everything do you really mean it? Does he have any history at all of buying things without consulting you or making large decisions? Either he has been doing this kind of thing on smaller scales without you fully noticing or he has an issue with  video games. People tend to underestimate how addicting video games can be to certain people, especially virtual reality. It's actually fairly similar to a gambling addiction. I think you need to figure out if this is an ongoing issue or if it is isolated to video games, and then have a discussion with your partner.",
            "Tell him to grow the fuck up and cancel his order. There is no room and you cannot compromise. If he wants to play he can do it elsewhere.",
            "Yeah fam, this would be a dealbreaker for me. \n\nHe has the emotional maturity of a teenage boy. \n\nI know you’ve grown really comfortable and close with him during the time you’ve been together, and the thought of moving back in with your parents seems embarrassing, but your life is only going to get more difficult and frustrating the longer you stay with him. \n\nSeriously, a month or two after you break up with him, and your mind is able to look at this relationship more objectively (without emotions clouding your judgement), you’ll be kicking yourself for not dumping him sooner.",
            "Just because you love him doesn’t mean you have to live with him. Why compromise your comfort and needs to live with someone who has zero respect for you and your wants?",
            "People make fun of the advice to “just break up with someone” is like reductionist or doesn’t allow for communication.  But listen:\n\nThis guy has bad instincts.  That’s not something you can shake.  Sure you can keep the bed but he’s an idiot right now and you’re not some kind of dog trainer.  Break up with him and sleep in a human bed.  You deserve it.",
            "Honestly the quest can be set up anywhere thats its whole appears! so I'd be telling him if he wants to play he can head to his friends, a local park or even your apartments parking lot 🤣",
            "He is 23 and acting his age. He has no forward thinking about it. I don't think it was ill intent but just immature and selfish. This is who he is. He will make other choices like that down the road without you. Consider this the wakeup call.",
            "Can he even afford this? An impulse purchase of a futon and an expensive VR kit (AND throwing out a perfectly good mattress) while you’re still living in an apartment. Is he always this reckless with money and property?",
            "Men are fucking delusional.",
            "It does sound like your boyfriend is being inconsiderate, I'm curious about the art supplies you mention though. How evenly do you divide the space in the apartment more generally, and could this be contributing to some of the tension between you?",
            "You create a guardian space so he won’t damage anything, but he’s not allowed to make unilateral decisions that materially affect your comfort like this. \n\nI have a  quest & I love it, but the joy of it is it’s untethered so can be used sitting down in a chair, he can use it sat in bed. I play in our recliner. \n\nHe doesn’t need to affect your comfort to do this, it’s really unreasonable and to do it whilst you’re  away is incredibly childish and unfair.",
            "So I’m just going to say that my husband and I have an Oculus Quest. It’s definitely fun, but not life-changing. I’m going to just give you some basic info about it so that there’s maybe a compromise somewhere in here? Your boyfriend completely discounting your thoughts and trying to throw out the bed (things very important to you!) without your input looks really bad. I don’t want to discount the seriousness of his actions because you need to think long and hard about whether this is the kind of man you see yourself spending the long term with. But for right now I understand that you love him and you really want to try to make things work, so I’m just hoping for the best for you and going to give you what I know. An oculus quest does not need any wired connections or special parameters to set up like older versions did—it’s just a headset and 2 controllers. It needs space to work, but not a dedicated space that can’t ever have other uses. The battery doesn’t last long enough to just stand there and play for hours on end like he’s hoping. If you guys have an outdoor space in your apartment complex or a nearby park, he can likely play any games that don’t require an active internet connection outside (like Beat Saber after he has downloaded the songs he wants to play). You can draw the parameters for your play field smaller than what’s recommended by the game, so depending on your available space, he may be able to play by moving smaller furniture than the bed. You guys need to sit down and have a conversation in which you explain that he needs to respect that this is your space too, and that you’ll work together to try to come up with ways for him to play without dismantling the bed and possibly scheduled times he can play so that you’re not totally crowded out when it’s especially inconvenient. I hope that helps!",
            "Have you outright said \"no, you cannot throw out our bed\"?",
            "“We do not have space for this in our studio apartment. I will not trade our bed for a futon so you have room to play this at home. You are welcome to go somewhere else to play. If you get rid of the bed without my permission, I will get rid of the headset without your permission. The bed stays, no discussion, end of story.”",
            "> he's always been entirely reasonable and level headed until now and we always discuss everything.  \n\nUh, you sure about that?",
            "Why would you, at 27, live with a 23 year old? It’s not part of your question and I’m sorry for being blunt but he sounds very immature. \n\nUnless his job relies on him playing video games, this is a completely irrational request and if he doesn’t realize it on his own.......well.....there’s no point in trying to convince him.",
            "So he won't take anything you say seriously, he won't talk to you about a decision that impacts both of your lives, and he makes these decisions without you? Are you sure he is a good match for you?",
            "You don’t actually need any advice on this, right? You know that your next move should be to move on. If you make a decision that affects another person in your life due to a personal interest like video games, you are a piece of shit. Period. When I was in my mid-20’s, I made a decision to ditch video games to have a meaningful relationship. This schmuck should too, but it doesn’t sound like he will.",
            "There's plenty of VR games that you can play sitting in place too, so I don't even understand it from that angle.  Like yea, some require standing and moving, but if you don't have space for that you gotta stick to the sit down games. \n\nDude could've played Skyrim in VR for 100+ hours easy sitting on the bed, but he goes \"I WANNA PLAY THE STANDY GAMES TOO\" and dismantled your bed after you specifically said not to, while you were away. Shady + selfish.",
            "If he wants more space, he can either pay more rent for a bigger place for the two of you or live alone. He’s being ridiculous. I know quarantine is affecting people but this is beyond normal.",
            "I find this funny because with the quest you can set your virtual boundary as reflexively as possible. Lol you can literally play inside an incredibly small area designated by the user and manage to not bump into anything.",
            "Damn.  Is he an only/golden child?\n\nNo hate to the many self-aware and considerate only children out there.",
            "He'll have more room once you're gone, sis. You need someone who will build you a bed with his own hands, not someone who'll sacrifice your comfort for a video game.",
            "If you are living independently from your parents, ie an adult life, tell him to bloody well grow up and be a man not a boy.",
            "Why did you tell him you are worried about the art or TV, but you didn't say you're worried about the obvious impact it has directly on YOU? Or worried that he thinks it's ok to make a decision like that without concensus?  Maybe he thinks you don't ever mind anything and will be cool with it because you don't ever speak your truth?  If you love him, you should trust him with you true feelings, instead of pretending like the art supplies are in trouble...",
            "I feel like he might be goading you into breaking up with him.",
            "When a person tells you who they are, listen the first time.\n-Maya Angelou",
            "He sounds immature and unreasonable as he tried to dismantle it behind your back. \n\nIs he 5 years old or just inconsiderate of the fact that he shares a living space? I would have a real problem with that as he should be only fling things that don't inconvenience either of you",
            "Sometimes karma needs vehicles.",
            "I've seen this episode of Black Mirror.",
            "I was extremely wtf until I saw how old he was.  OP.....it's time to lay down some expectations.  Absolutely not should this happen.  Why can you not leave?",
            "He's crazy, but I have to admire his level of dedication.",
            "23 and needs to grow the fuck up. You're still young, try dating someone closer to your age or a little older. 23yo me was an IDIOT",
            "Sounds like he made a choice about what his priorities are. It’s not like he forgot to include you in the decision or didn’t think you wouldn’t have feelings about it. He didn’t care. I don’t think a conversation will make a difference in him having what he wants. I think the only thing he will notice is if that his priorities and not caring about anyone but himself has consequences. Sorry if that is hard to hear, but you should find a place where you can be comfortable and respected.",
            "Every relationship hits a point where \"deal breakers\" are discussed, if they aren't discussed beforehand.\n\n&#x200B;\n\nNot having a discussion about what decisions are acceptable to make about the home you share, and the consequences of making unilateral decisions is one of those very essential conversations that is worth drawing a line in the sand over.\n\n&#x200B;\n\nForget whether or not he's being reasonable about the VR system for a moment. There are ALWAYS solutions for problems. Maybe he can figure out how to make your bed fold up into a wall. Maybe he can plan for it to be setup in a smaller space. Maybe he can use it when you aren't around so that you aren't impacted by it.  \n\n\nThese \"maybe\" solutions and compromises are all well and good, and might come up if you two discuss it like adults that are trying their best to live together, in spite of different interests and priorities.  \n\n\nThe real PROBLEM is that he's not willing to have a discussion where him not having a VR system to play is a potential agreement that he would be happy to make for the health of the relationship you are both in. He is just...\n\nNot participating in the relationship. He is not communicating with you about how you two are going to relate to each other around this disagreement. His method for relating to you is to shut down and avoid this conversation.\n\nWhich, that's cool, I guess. \n\nMy wife has tried that with me too. I don't let her. Instead I have drawn the line - \"Either we discuss this for the health of our relationship, or there is no relationship.\"\n\nThat's it.\n\n&#x200B;\n\nSeriously. What is the point of a relationship if you can't share your feelings and cooperate on solving problems with each other?",
            "... any adult man who prioritizes video games over his relationship is not fit to be in a relationship.\n\nI know you probably won't, not yet, but please kick him out or get out yourself. I was in a relationship like this for ELEVEN YEARS. I kept thinking he would grow up and actually give a shit about me. But the truth is video games can be just as addictive as drugs - and the addict will do anything to get his fix.\n\nIt had nothing to do with my worth as a partner, and it has nothing to do with yours.",
            "I can actually relate to this as a 26 year old man. Hear me out. \n\nWhen I graduated college I took a job I hated. I worked long grueling hours with an asshole boss  through the Minnesota winters living in a tiny studio apartment, because that was what I could afford. I felt trapped. I had no idea that this was what life would be after college. To me, dorm life was supposed to be a temporary thing, and it crushed me to realize I may spend many years living in small, cramped apartments. \n\nMy mind wandered CONSTANTLY and I latched on to the few things in my life that truly made me happy. For me one of those things was rowing (I was a rower in college and high school and as soon as I graduated I no longer had access to the boats, gym, etc.). \n\nAnyway, somehow I got it into my head that rowing was happiness. I didn’t know it then, but that was depression talking. I became obsessive over it - constantly searching for ways to somehow afford to join a club or watching pov rowing videos late into the night, scouring craigslist for anything that remotely resembled the $10k boats I was accustomed to rowing, despite not having a garage or a lake to use it on, let alone the money. \n\nAnyway, six months into this obsession I bought a rowing machine and placed the damn thing in the middle of my living room. It was completely out of place and made my kitchen table unusable but I didn’t care. I HAD to do this. My girlfriend obviously got in fights with me about it (we didn’t live together but she was over all the time) but I still didn’t really care. To me, the rowing machine was all I had. It was the closest thing I could get to my dream. \n\nNow, after a few months I had to face the facts and sell it. I had made a mistake. The rowing machine didn’t fix all of my problems or somehow make me happy. I still longed to be out on a lake, I still had a shit job, and still lived in a tiny apartment. Finally having this thing I put so much of my expectations for happiness onto made me realize this. I quit the job, make a career change, and moved to the burbs shortly after. \n\nPoint of the story is, depression can make people go to extreme lengths to try to correct it. What your boyfriend is doing sounds very illogical and much like someone who is depressed like I was but probably doesn’t even realize it. You should talk to him about it. Be supportive of his hobby but gently remind him that it’s not practical to not have a bed for the two of you.",
            "He's tossing your bed. Your bed. Just because he really wants VR doesn't mean he gets to toss your bed. Just.. to give you and him the option of compromise, me personally? When I got VR, I didn't have a bed setup of any kind, just a matress on the floor, which I'd lay sideways as I pushed it into the hallway. That didn't bother me, I never minded it, but if that isn't a solution for you, it you need a bed frame and a regular bedroom solution, tell him exactly that and why it bothers you that he didn't take that into consideration. VR is awesome, but if he's taking that value beyond you, you need to end it and get out.",
            "This is completely besides the point, because this is a clearly an issue of trust, control, and thoughtlessness. But FYI you can use a fucking quest outside or on a roof",
            "He may be too immature for a serious relationship. If he really wants a mancave of a studio apartment then maybe you should take the bed and find someone who will include you on major decisions. He just sounds like he’s still in a teenage mentality.",
            "The real problem was dating a guy much younger than you. Sure, age wise the gap isn't bad but mentally, a 23 year old male and a 27 year old female are completely different. I'd leave.",
            "Can anyone explain what this thing is? Why would a headset take up a whole room???? I don't understand this.",
            "Why are so many posts right now about adult men ignoring logic and responsibility for video games? I swear the economic spear will be up to the women if this keeps up.",
            "First of all oculus quest is portable and he can walk himself somewhere to find space to use it. He doesn’t need to throw away his bedroom for it. Secondly are you literally dating a child?",
            "Two thoughts: Communication is key. Obviously he is not communicating effectively. Having said that I'm going to differ from others and not read ulterior motives in his action.\n\nNever ascribe to malice what can easily explained by ignorance: In a perfect world he should have known this was not a thing he could make a unilateral decision on. But he's so very very hyped about this new thing he hasn't considered the implications and that included making poor choices that affect you. This is the sort of thing (hopefully) partners need to learn not to do to each other.\n\nBonus Thought: Is there something going on in you guys living situation that might have made him think this was ok? You mentioned if you wanted to move out you'd have to move back in with your parents. Are you both paying your fair share of the rent/expenses? I'm not saying that would make his thought process right by the way a fully realized partner would understand the implications even if they were paying all the way, but a person who hasn't had those \"growth opportunities\" or came from a household where they had no autonomy because their parents just made arbitrary changes on them might think that's the norm.\n\n&#x200B;\n\nNext Step: Talk to him and explain how this has affected you and explain why it's a no go. Try and find some way he doesn't have to give this up or maybe talk about what it would take and what time table to get more space. From the way you described it he's a great guy and this is probably just him making a mistake albeit an alarming one. But if he is a great guy a little communication should make this an easy fix.",
            "And there's no chance he's actually surprising you with a nicer bed and mattress or something?\n\n(Being that it's so out of character for him) ?",
            ">I told him I'd throw it out the window\n\n>but he just won't take anything I say seriously.\n\nAre you...not seeing the correlation?",
            "Wow\n\n\nHe doesn’t get make executive decisions. I would throw out the boyfriend and take it the bed with me.",
            "He shelled out the money for an oculus while you’re living in a studio apartment? He ought to return the damn thing and put it towards savings for an apartment that’ll actually have the space for it. That said, is there no way for you guys to stand your bed up against a wall or something while he’s playing? It’s not like he’ll be using the VR 24/7",
            "What I see a lot of here \"this couldn't happen unless this was a bad relationship! \" And what I hear from you \"this is actually a great relationship but this is something really weird\".  So oneside is exaggerating. Frankly this sub likes to jump on the \"bad relationship, you need to leave\" bandwagon. \n\nSo what could actually be happening?  Have good relationships had issues where one partner made an unfair decision for both?  Here's my take:\n\nI once wanted a dog. A lot. I'd been looking into it for a while and suddenly I found the perfect one and I loved him and my husband said \"yeah maybe, that's an ok dog\" so I got it. Well, \" yeah maybe\" isn't the same as \" yes let's do it\".  At the same time my husband's opinion and happiness are super important to me. Why did I jump the gun??  Two things. The first small thing is that I love projects, I always need a project to work on and focus on... Might not become a hobbey and it might only stay in research phase, but it brings me happiness. A dog is a project!  The bigger issue...I was having issues with helping raise some family members and having them act out and run away, all the stress of a teenager with an addiction.  This was affecting me deeply and I wanted a way to help insulate my kids from this drama also. Getting that dog, latching onto it, was a way to have unconditional love, acceptance and control. I was hurting emotionally and this dog \"solved it\".  \n\nWhat does your bf have going on?  Have things changed for him with the pandemic?  Does he seem to need to escape?  \n\nIf you can approach this as a team while still standing up for yourself, it's going to be better regardless of the outcome.  This situation doesn't necessarily mean he doesn't respect you and your space,it can mean he's struggling.  Or he is just being selfish possibly. But here's the thing, life is always going to throw you challenges. Usually and hopefully they're not of your own doing (or bfs fault like right now) but your ability to work through these is crucial. Approach this like it's fixable, like it's an opportunity to grow as a couple. Stand up for yourself and your bed but I actually suspect you'll find a solution.  \n\nLastly. I have an occulus quest.  It doesn't actually require a crazy amount of room.  I stand with my arms out and turn in a circle.. that's all the spacei need.",
            "I haven't got a solution but just wanted to say this situation is hilarious.",
            "Funny enough you actually don't need a lot of room for vr. Sure it is easier with a lot of room, but you don't really need it",
            "He’s absolutely an asshole but if you’d be want to make this work why don’t you guys get a Murphy bed as a compromise?  If he’s willing to pay for the entire thing (decent ones are expensive) and be responsible for assembly that could minimize the issue of floor space.",
            "Leaving another comment to say that it doesn't have to be this way. My husband now knows the difference between a hobby and real life, and makes time for me whenever I want it. You deserve better!",
            "Aside from how completely insane all of this is, it's also so unnecessary. There are plenty of Oculus games that don't require you to move your feet/that you can play sitting down. He's not just prioritizing his desire to play VR over your whole life, he's prioritizing playing certain VR games he *prefers* over your whole life. \n\nMy bf can get a touch of this \"but I wanna\" (only a touch, and it didn't come up nearly as much until COVID), but if he tried this I would absolutely lose my shit. (And vice versa.) This is a hard no. You have to be willing to break the deal, because this is a deal breaker.",
            "The Quest is entirerly wireless and could be used anywhere - can't he find like... any other room (not in your tiny apartment) to get his VR kicks in?",
            "The Oculus Quest? That thing is a standalone headset he can use outside. Sure he cant connect it to a pc there to play the top quality pc VR games but he can use it in a park or some shit. Tell him to go play outside like to a 10 year old kid lol",
            "He has priorities but unfortunately you’re not one of them.  Act accordingly.",
            "Take any of his current systems and hide it in your car.  When he asks where they went, tell him he wasn't being serious with you.  Let's see where his head is.",
            "Not that this is related to the actual situation but just want to point out the oculus quest takes up no room. It’s just the controllers you hold and the thing you wear on your head. You only need room for play area which you can get away with surprisingly little of.",
            "Honestly, I think it just may be an issue of maturity. But yes, threatening to leave is n effective way of convincing a guy to actually talk about things. It works on me, lol.",
            "How the hell would he expect you guys to ever have sex in a studio apt that's 75% video game stuff??? \n\nY'all need to have a come to Jesus talk now, or start packing.",
            "As someone who has and enjoys VR, your boyfriend is being ridiculous. It takes a ton of space, and can be dangerous if there are other people or objects around. There are NOT sensors that will stop him from hitting the TV, or your art supplies, or even you. \n\nObviously the big issue here is that he’s not listening to you, but I think this is worth mentioning as well. r/VRtoER",
            "Take it from some one who religiously uses VR. there's no way you can totally prevent hitting things or knocking things over. you can be careful but there's always gonna be those times when you hit something. Your damage concerns are legitimate.",
            "> If it wasn't so difficult right now I'd be considering moving out or leaving\n\nUnfortunately, it sounds like your boyfriend knows this; he's not worried about the consequences of his actions, or how they impact you, because he's sure you're just going to put up with it anyway. \n\nIt also sounds like isolation is getting to him and he's desperate to escape this reality for a new one. \n\nReally, *really* look at your other options. You need sleep. If he's going to force you to forgo sleep and/or sleep on the floor so *he* can bounce around in an imaginary world (has he bought two headsets? I'm guessing not), you're going to be MISERABLE and the sleep-deprivatoon will make everything that much harder. You might as well make plans to move out now - trying to plan a break-up/move whilst also battling sleep-dep sounds like a nightmare.",
            "It seems like he might be having an emotion he can't process and is therefore making huge, rash decisions because he feels like that will get him back in control. I would ask him if there's anything else going on before threatening anything.",
            "VR got the best of him , best of luck bc that shit is the next world of warcraft, it’s just too good",
            "sounds like a real case of a guy who loves to play video games",
            "I'd just say \"boyfriend, I need you to understand: this is the first time I've had serious doubts about our relationship, and your unwillingness to look past your short-term wants about this VR thing and consider my perspective are making me question whether this is actually the partnership I thought I was in.\"\n\nThen basically just see what he says and if can actually walk it back and convince me that this isn't a breakupworthy series of actions/justifications.",
            "Did he get the bed out?\n\nTake a picture of the room as is and tell him that if he tries to get rid of your property again without your permission you’ll report him, and be ready to follow through on that threat.\n\nLet him know that his behavior is damaging your relationship. Stop worrying about the difficulties if you break up, and start worrying about the difficulties if you reveal you’re willing to stay if he treats you like garbage.",
            "You both seem to have a problem with communication, it’s obviously not alright for him to dismantle the bed you both sleep in, it’s not his alone, I’m assuming he doesn’t pay 100% of the rent though and you two live equally? It’s also equally not alright for you to threaten to destroy or throw away his property because you are frustrated, though I can understand your frustration.\n\nBoth of these things are equally red flags and it’s obvious you both have a hard time being told no. This doesn’t warrant breaking up over, you don’t have to listen to what everyone in this subreddit says and just end it. That being said what you DO need to do is admit that you handled it poorly as well and try to reopen the conversation maturely. Or not, it’s your relationship after all, good luck!",
            "I'd chime in with one thing. You said he's been pretty level headed and reasonable up until this VR thing. Maybe ask him why this is so important to him? It seems like this VR thing is such a big deal to him that's he's willing to do anything to get it. It sounds stupid to us, sure, but maybe he has some valid reason as to why it's so important to him? Not saying his behavior excuses anything, but it seems like it's out of character for him, and we humans do things like that when something is extremely important to us (or we think it is). Just an angle to maybe consider.",
            "Do you guys live in an extremely expensive area such as NYC for example? Bc I feel like that’s another major issue at play. If the two of you can only afford a studio together, then shouldn’t your priorities be more focused on saving rather than spending on things that you don’t really need? Don’t get me wrong, splurging every now and then is okay. But it’s one thing to splurge but it’s a completely different to splurge on something that you really can’t even use. His priorities sound very messed up.",
            "I would stop contributing to rent if my partner unilaterally decided to dedicate the entire studio to VR.",
            "Okay if he’s going to all that trouble maybe you should make him sleep on the floor \n\nHe kind of sucks right now",
            "Unfortunately, you're with a boy not a man. In this predicament, I would insist you put your foot down. Your bed is MORE IMPORTANT and it's essential in a relationship if you know what I mean. Otherwise, tell him to kick rocks.",
            "Okay he’s so in the wrong. What about a Murphy bed though?",
            "i think you should take some comments that say what he's showing with his actions, and try to tell him exactly what they show and make you feel in this situation. it's important that your partner cares about your feelings and takes tjem into account in their actions. \n\n- him making this decision while you were away, \ndismantling the bed, ordering the oculus -  trying to make it official without your say in it\n- him not taking you seriously and disregarding what you're saying - not valuing your opinion in an important living agreement\n... \n\nyou said you had conversations about how cool it would be to have the rift and try it out, but you two just don't have the space for it, and he STILL went and bought it.\nit might be just childish wants and stubbornes, so you have to make him hear your wants.\n\n- you can move out (temporarily or permenantly you'll see his reaction that'll determine that) \n- you two can try to find a space for you two to play the rift in (renting a room or at a friends or parents house...)\n- you can convince him to talk to you about not keeping it (he needs to hear you out as a partner)\n\nwhatever ultimatum you choose, make sure that you STICK TO IT. otherwise it doesn't work, and he won't take you seriously, because your words don't describe your actions. \n\nif he won't listen or try to find a solution, then i don't think that's a life partner you want.\ntry to remember if he ever got you to think that you two agreed on a thing and then did a complete 180 on you and pushed you in a corner like now. that's manipulation and shouldn't be tolerated and you are lucky if you recognize this behaviour early in the relationship.",
            "Google the Sheelzebub Principle and thank me later.",
            "You said he's been a reasonable feller except for this single thing.  \n  \nMaybe... He got too psyched and focused on the VR headset? Just give it a bit of time and he'll get bored of VR.",
            "He sounds more like a child than a grown man. Removing the bed to be able to play games is a very irresponsible childish act. \n\nFor a studio, they sell Murphy Beds. It sits on the ground and then folds up against the wall when not in use. They don’t need to be in a huge expensive cabinet. They have some cheap ones that is basically a bed frame with a hinge at the headboard. Attach a rug or comforter to the bottom so that it hangs down as a cover when the bed is up. This would be a very logical solution that could be discussed BEFORE changes were made. \n\nBut his little boy games are a clear sign that he is not ready for a relationship. Leave, or ask him to leave, depending on whose name is on the lease. If it’s in both names, notify the landlord of your intention to leave at the end of the month. Then leave now.",
            "What he has done is really disrespectful, and also unnecessary. \n\nThe quest is a portable headset. He can go play it in the park just fine. \n\nAlso you are absolutely right to be worried about your TV etc. They have sensors but they arn't magic",
            "NTA - Consider getting a murphy bed ?",
            "I love video games including VR, but no way I would expect my girlfriend to be okay with that. I would never have the audacity to even ask, especially if we lived in a studio apartment. It’s incredibly selfish and not fair to you. Don’t put up with that, he’s not being reasonable AT ALL.",
            "He just spent a lot of money and is unable to admit that this item doesn't fit into his lifestyle very well. He just wants to play his new games, common sense be damned.\n\nHe should have realized this before purchasing...",
            "LOL at these replies what a bunch of looonies. There is no way your BF will play VR for hours. I promise you its simply not reality. He will end up realizing  its fun but not something you can dedicate hours a day too. There just isnt enough content and its not comfortable enough for extended play. He is wrong to dismantle the bed im literally laughing out loud\n\n. Hes just really excited to experience it because to guys like us its truly amazing tech but hes not being  realistic about it at all. VR is not worth uprooting your whole living space fir and sadly he will eventually realize that if he goes through with it.  \n\nI have had VR setup for almost 3 years now and have played and own almost all the content on SteamVR. I haven't played my VR in weeks. I play when something new comes out. Even when I was heavily playing it was max a few hours a day and for short sessions. It is really fun but its extremly tiring and not something you can just do for hours on end. \n\nAlso you dont need a large space to play. BF will need to compromise and not use room scale movement which he will realize wont work in a small area. Many people including myself play on a small comfort matt and as long as I stat on the mat I avoid moving around my room. Im pretty sure you will have roo for that no need to move the bed. The mat I use is very small 3x 5 feet max and stores under my bed pr anywhere. Within 6 months he be barely using it once he gets through the available content. If hes not willing to compromise you probsbly got some red flags you gotta deal with as it will continue in other areas.",
            "Lol just let him do it lmao whats thw big deal? Just a bed",
            "It doesn't sound like you actually love the guy if you are ready to leave because of your first disagreement that could be easily talked through. Also about 50% of games on the quest  dont require more than 2 feet of space but he must not know this yet.",
            "So you’re dating a 5 yo. Stop it.",
            "The immaturity levels of your boyfriend are astounding.",
            "OP I know you think your relationship is amazing outside of this but I can assure you.  Hindsight is 20/20.  Once you break up you will start remembering things, and you will be like wait a second what the FUCK\n\nIf he is this inconsiderate, if he shows this much lack of respect for your opinion, it’s going to show throughout your relationship in little ways you forgot",
            "I say ditch the looser and get you a real man who would rather be having sex then to be playing video games",
            "either he is showing his true colors, or this a quarantine coping mechanism. you should really talk to him about it. the fact that this is the first time something like this has happened is telling. i know when i got a vr i really wanted to find enough room for it, but this is definitely excessive",
            "Multiple questions.\n\n1.) Is the bed put back together now? If so, that's good. Make it clear if he dismantles the bed again or dramatically rearranges the space without asking you that you're going to hire or find a mediator. Whatever process he wanted to go through should be completely paused by now. Draw a clear line in the sand OP. If he's not getting the message, and you feel frustrated enough to cry, do it in front of him. I know  some really don't like crying in front of others, and I'm not saying you should fake it, but he needs to realize what he's doing to you. If frustration doesn't make you cry, then honestly, raise your voice. Get physically in between him and whatever he's trying to do until he sits down and has a conversation about it. You need to push, and if he isn't taking you seriously you need to push harder. \n\nSitting with him and talking it out like the reasonable people you say you both have been up to now is key. The only way I see this working out well is if you can have this serious, considerate conversation, so you need to make it happen. The best case scenario is that he became temporarily very unreasonable for some hopefully semi-justifiable reason, but realizes it isn't in the cards and gives up and goes back to being the reasonable person you know he is. He should absolutely still apologize at some point for not taking you seriously or discuss it with you.\n\n\n2.) Do you split rent? Are you both on the lease? If not, well then you probably already know that's why he thinks he can do this without consulting you. It's still not right or considerate to do this to your partner though, it's still fucked up. But it might be playing a part into his logic and so you might be able to use it to get him to sit and talk with you.\n\n\n3.) What is he normally like as far as gaming habits, other hobbies, friends go? Is he very social, active? Are his friends with bigger spaces also getting the VR headset? Try to get to the core of why he wants to do this at the sacrifice of everyone's personal comfort. I know a lot of people are having a difficult time getting enough socializing in, and if all his gaming buds are getting this, than maybe it's driven by a fear of missing out on one his only covid-safe social opportunities. It might also be a way of trying to cope with a degree of cabin fever. Its still impossible in a studio apartment. I have a VR headset in a 2 bedroom apartment, and it's still basically impossible to use it standing. I've basically given up on using my headset until we move into a house with a basement I can set up for it. It would be miserable to try and use it in a studio apartment that I share with someone else. Maybe if I lived alone, but honestly VR is still not at a place where I'm going to rearrange my entire home every day so I can use it regularly.\n\nI empathize not wanting to throw away an otherwise really great relationship so far, and asking him these questions to figure out why he's not even considering waiting to get a VR headset is what I'd do if I was committed to getting through this no matter how annoying I have to make myself to him to get him to listen. You still have a right to be frustrated, and you by no means are obligated to put in this much effort. He's not meeting you halfway and you're having to deconstruct all of what's going on with him by yourself, as if you're pulling teeth, so you and him can talk seriously and considerately about it. That kind of behavior and unreasonable selfishness is enough for a lot of people to walk away from a 1 year old relationship. \n\n4.) Don't know where you live, so it might not be an issue if it's somewhere with absurd apartment prices, but where did the money for this come from? VR headsets are crazy expensive. Mine was like $800, with limited accessories. A brand new high end rig can be up to $2,000. Is he able to afford that comfortably? I'm lucky to have a good job in a metro with lower cost of living than some, but it was still a huge purchase for me that I deliberated for weeks and discussed with my partner multiple times before purchasing.\n\nIf it turns out that he's spending that kind of money when you can't afford it in any way, than this takes on a whole new level of fucked up, and if I was in a position like that I'd demand they return it and commit to leaving if they don't. He's decide entertainment is more important than financial security at that point which is super fucked.\n\nI'd be interested in seeing an update for this. I hope he realizes his mistake, takes you seriously, apologizes, and goes back to his normal behavior. You deserve better. He's being absurd. You're not being unreasonable in demanding he postpone all VR until y'all have the room for one.",
            "I don’t know if anyone else has mentioned this yet, but futon don’t normally just go on the floor unless you have tatami. I’m guessing you don’t have tatami, and he was so determined to buy this that he didn’t do any research. \n\nMy bf is also a few years younger than I am like you and yours. He also loves video games, but thankfully we don’t live together. If he were to do something like this, where he doesn’t respect me enough to even consider my opinion on a shared space, I would likely breakup with him as others have suggested to you already. Try to explain why this is an issue and how thoroughly disrespectful it is, but if that doesn’t work be prepared to leave asap.",
            "why doesnt he just play it on the roof?",
            "My girlfriend and I built a whole second living room in order to play Kinect games. We only ever ended up playing Just Dance. It's definitely not a decision you make on your own. He doesn't seem to get that you're a person with your own interests and he has to include you in decisions that affect you. I'm not saying just dump him, but there will be way worse problems if this isn't nipped in the bud.",
            "You are dating a child...",
            "obviously idk what the apartment looks like but putting locking wheels on the bed could be a good compromise so he could roll it over when he wants to play",
            "Length of relationship? Trying to determine how much time you've wasted?",
            "has he tried VR yet? 10 bucks says he gets sick of it in a week. Sounds good on paper but the tech just isnt there yet.",
            "He's a fucking idiot. Firstly, a majority of VR games don't require you to be standing and flailing like an asshole. You can sit in a computer chair. Secondly, he bought a Quest, which is designed to be portable since it's wireless. He could go play that shit literally anywhere other than your house. He's incredibly inconsiderate.",
            "Y’all ever consider a Murphy bed?",
            "Also just to add on to my previous comment. He's 23...there's ya problem...you're dating an infant",
            "My boyfriend ends up doing things like this because he assumes that I'll agree with him on it, so he makes the decision executively by himself. It took a lot of talking about not making any changes especially within our apartment without us both discussing it first. No exceptions.",
            "You don’t make a unilateral decision like that when you live with someone.\n\nYou two need a serious talk.",
            "the oculus quest is portable, just tell him to get a gaming laptop and go play outside lmao",
            "OP is this your studio apartment that he moved into? Is there anything in the lease about destruction of furniture or belongings (did the bed come with the studio) some are furnished which is why I’m asking. That way you can kick him out on a violation of lease. \n\nRegardless, this is a shared space. Your bf seems to prioritize a video game over your comfort which is unacceptable. If he insists on giving 0 fucks like a child then he should live on his own by himself. OP you are a 27 year old woman, is a studio with a VR obsessed boyfriend really your endgame?",
            "Tell him the men of reddit think his behavior is that of an impractical jackass. If he was his toy/ reward he is gonna have to work for it. I say this as a man who loves gaming. I gave it up for years so I could go to school and get a good paying job that allows me to play my game when I want when ever I want for as long as I want. He can have it he just has to work for it",
            "At 23, I don’t think I could do all of that without talking to my SO, just out of respect.  \n\nIf he wants you to respect his gaming time and space, he should also respect your comfort in the home, and your sleep. Sleep is important lol\n\nIf my girlfriend wanted to remove our bed for a bigger makeup desk/area or even a video game and did it without asking me, I would be upset and talk to her about it without hesitation.",
            "You know what gets people to take you seriously? Follow through.",
            "He isnt ready for a real relationship.",
            "So I don’t know if you’re looking to compromise, or what the budget looks like, but there ARE comfortable and nice beds that fold up into what looks like a cabinet when you’re not sleeping in them. Some even are a desk when folded up.",
            "Your boyfriend is a loser",
            "[deleted]",
            "No offense OP, but i’m questioning the “this is so out of character for him” comments i keep reading. \n\nThis IS in character for him. Because he just did it. He just never had to make a decision that yielded such an opportunity to disregard you until now. It’s easy to say someone is great when they’ve never actually been tested.",
            ">I told him I was worried he'll damage the TV or my art supplies and he is convinced it won't be a problem as they have sensors for that.\n\n\nas someone with a VR headset; he's going to break the TV and your art supplies with that attitude.",
            "Does he have a brain tumor? If they answer is idk, it might be something to check lol. His decision making skills seem severely compromised if you say he has never been like this and always talked things out",
            "[removed]",
            "Hell bath no fury like a woman scorned for Sega.",
            "This guy is being really selfish for changing the bed situation without you. However, it sounds like he's really into this game and wants to share it with you too. He needs to apologize for his selfish and inconsiderate behavior. If he can't see what he did was selfish, then call it quits.\n\nIf he does realize how shitty he was, maybe compromise. I've seen some pretty cool Murphy beds the fold up into the wall. They have a real mattress, and stow away when not in use. It sounds like space is tight, and maybe you'd both like more space for activities you enjoy when the bed isn't needed.",
            "1. Important decisions that involve you both should be discussed by you both. Your quality of sleep affects your entire life and futons are not \"equivalent\" in any sense. It really concerns me that he'd do anything to change your bedding unilaterally.\n2. I'm a huge VR enthusiast and I live in a tiny room so I got a bed that folds up against the wall to make room for VR. It's still a full bed. This is the option he should have proposed to you, not this massive downgrade of a futon. If he can't afford it he should've saved up for it.",
            "Can't he just play outside? The Quest is not limited to the home.",
            "So he didn't get his way, went behind your back and got caught...\n\nYeah this isn't looking good.",
            "If this is completely out of character, you might want to explore the possibility that this is an onset of a mental illness. It almost sounds like a manic episode the way he is just gleefully forging ahead, completely deaf to anything you say. Early 20s is a common age for these things to come on, as I understand it.",
            "Wow. I would expect this behavour from a 15 yo, but not someone in their 20s. He is obviously not mature enough to be in an adult relationship.",
            "His response about not damaging anything because of the sensors is a 50/50 on how he uses his oculus. My bf recently got the oculus and although it has sensors, you could still potentially hit over the sensor if your too sucked into a game and the lines don’t show. On top of that, I agree w other uses, he dismantled it while you were gone. Didn’t give you a say in this yet you both are living together. He’s being very unreasonable. The only time he needs the space is when he’s using it, Try to talk to him again see if you guys can compromise on rearranging which furniture goes where? Good luck",
            "Sounds like there’s a serious power imbalance here. He made that decision without you because he knows he could. He knows he’ll get away with it and he knows you won’t actually do anything. \n\nPersonally I’d throw the whole man out at that point, I mean you’re only 27- plenty of men out there. \n\nBut if you want to try and make it work he needs a VERY serious wake up call. And not one- you have to hold that boundary- forever. Because sounds like the type of guy where if you give and inch he’ll take a mile.",
            "Tell him room-scale vr is esentially dead, and as long as he can stand in place with extended arms and turn around, thats enough. I have tuhe same space issue in my place, but i didnt dismantle anything and can still make it work.",
            "Christ. It’s too bad you can’t give him an ultimatum at the moment but he needs a damn wake up call. \nMaybe if he reads all these comments about what a selfish, foolish move it was to unilaterally make such a big disruptive decision about your sleeping arrangements it will help? idk. Does he even have the futon yet or are you supposed to sleep on the actual floor until he gets one because he’s already dismantled your perfectly functional bed?",
            "This is funny, sry 😂",
            "You not wanting to get rid of the bed is the most extremely reasonable boundary I can think of. Asserting yourself on this position is absolutely the right decision. I do see one thing that I'm finding concerning, though. Your point that he is normally extremely reasonable and that this is the first instance of him behaving like this has me wondering if this is related to something else entirely going on with him. Does he have any mental health history that you know of? Has been been in a period of fixating on ideas and spending money he normally wouldn't? You know your relationship better than anyone, and it's entirely possible that he's always been like this and only seemed reasonable so far because you just haven't actually come across it yet, or it might be possible that he's in a manic or similar mental health state impacting decision making processes.",
            "How about a system that blocks the bed in a vertical position?  He would be able to play... would this create enough space for all activities?",
            "I think it's perfectly ok to make changes to the house to allow room for VR space. For example, you could swap some furniture for fold-outs, or get stackable or transforming furniture. There are so many creative options. He loves his hobby and that's a good thing!\n\n... Until he starts making changes to the house without your input. You BOTH live there for Christ\"s sake. He can't just swap out furniture without your input. He should have talked to you about this. If your finances are joined he is an EXTRA asshole for not talking about these major purchases with you.\n\nYou need to have a conversation about this. Let him know that what he did was MESSED UP and super selfish and unreasonable. He needs to apologise for undermining your joint authority and comfort in your own home.\n\nIf he apologises you can maybe talk about swapping other furniture for his VR space or maybe looking at homes that would allow room for his hobbies without infringing on your comfort.\n\nIf he doesn't, I suggest you take photos of the whole house as a record of furniture you own. If he throws out anything you paid for or partially paid for, make him pay you back the value of what he stole. And move out, or kick him out.\n\nHe needs to respect the people he lives with. What a sneaky, rude thing to do.",
            "If he's gonna do somethin without your consent then he's not worth it.",
            "Tell him what you told us, that you love him but he’s being completely irrational and inconsiderate of you and that you’ll move out and leave him if he doesn’t come to his senses about this. Tell him he needs to return this game and put your bed back together or you’re done. End of story.",
            "Just wanted to let you know that Vr doesn't take up an entire room's worth of space. There are a lot of games that allow you to play sitting down in a smaller area, and while it's a little more limited, you absolutely do not need to be able to swing your arms like a windmill to have fun. There was absolutely no need for him to remove your bed to be able to play VR, he could easily *sit on the bed* against the wall. And let's be realistic here - I'm someone who lives in a single room in the basement of a student house and I still have enough space for a full sewing machine setup, computer desk, crafting station, bed and mini kitchen (rice cooker and instant pot). It just takes a little more effort and organization but nothing has made it so I had to throw out a whole ass bed to make something fit.\n\nquickedit - like fuck, he could have gotten one of those extendable beds at the very worst from ikea. Sleeping on the floor? Cmon.",
            "Devil's Advocate, maybe he thought the futon would be just as good as a bed? And wanted to go \"tadaaa! we can still sleep here, and there's room for VR! I solved our problem!\".\n\nPretty tone deaf tho.",
            "Keep the bed, throw out the boyfriend.",
            "Although it is really a \"no brainer\" situation at first read, I'm gonna dive a little bit deeper on the bed problem. What it really sounds like is you need to cook 10 packages of instant ramen and dump them on the floor in the middle of the studio. \n\nAlthough you might get the point across if you mix different flavors, he won't be able to deny your point if you choose all 10 packages of the same flavor. I would suggest that you go with the Maruchan \"creamy chicken\" flavor, cooked and strained as \"dry\" style ramen. (Dumping the ten packages of broth on the floor will undoubtedly just make a big mess and not add to your point in any significant way.) \n\nOnce you've cooked 10 packages of instant ramen and dumped them on the floor, I think you and your boyfriend will come to a much better understanding.",
            "Yeah as a gamer if there's really no space then that's pretty bad. If not, you can try it out set it up then if it sucks then take it away",
            "Time to start thinking of the pros and cons of the following:\n\nHaving a partner that makes a major living arrangement decision without consulting me\nConfined to a corner of a kitchen when home\nSleeping on a futon\nLiving with parents as an adult, saving money and moving into my own place again in a few months\nKicking boyfriend out and finding a way to live alone\nKicking boyfriend out finding roommates with new living  arrangements \n\nUnless he comes to he senses these are your options.  Honestly I think he is showing you who he is and what he values.  Believe him.",
            "Move. Studio apartments are for single people.",
            "Since leaving isn't a desirable option, I'd suggest raging at him day and night until he learns or having his mom (provided he has a reasonable maternal figure he respects) do it for you.\n\nI think it's pretty clear from your description that he's struggling mentally (not an excuse, is a reason), is it possible to go on a hike or picnic or something? This has elements of cabin fever.",
            "threaten to break up with him.  give him a reality check",
            " not ro repeat what everyone already told you, but what he did was a blatant disrespect to your basic well-being. if you're not comfortable moving in with your parents, could you try a temporary stay at a friend's, maybe? if no attempts at talking get you anywhere, i truly believe only leaving will get through his head that he has done something wrong.",
            "Some guys don’t show their true colours until they think they have you trapped. There’s a pandemic going on and you can’t/won’t move out. And it’s like a switch flipped with him: he’s suddenly stopped caring about your input completely. \n\nThe fact that he’s not even taking seriously that you’re threatening to throw it out makes me think he’s assuming he can just overpower you. Which is extra not good.",
            "The real problem is he didn’t involve you in a decision that affects you both.  \n\nIf he had, I would have recommended a Murphy bed.  \n\nMy husband and I put one in because our room became so small after we sacrificed some space to build a baby room.\n\nEdit:  Just to add—we live in Japan and it is a Japanese-style room with tatami mat floor and we still didn’t opt for a futon because they are a hassle.",
            "Does he ever leave? Reassemble the bed. Or get a bigger bed? Idk how couples survive double beds, which makes me fear how small this futon is. You have three options, new boyfriend, new place, or a Murphy bed. Are those still around?",
            "Do you both pay the bills?  I’m not saying that that should be the determining factor. Who moved in with whom?  The current quarantine makes most of us a bit crazy. It can be really hard on relationships. I have to say the age difference might be a factor in his unilateral takeover of your shared living space.  \n\nA roll up futon could be a good solution to making the place less claustrophobic.  But the VR thing sounds awful when you are both trapped at home.  \n\nJust some random thoughts.",
            "Time to tell him that he might need some help with his addiction. If he seriously thinks that it’s okay to get rid of your bed so he might have room for a game, then he needs a reality check quicksmart.",
            "yet another story reminding me why i refuse to ever date anyone who plays video games. sounds like you need your own apartment and no boyfriend",
            "Please stop dating people just for sexual attraction and actually find common shit you both like... It's so annoying. Even marriages break because after sexual attraction they realize they have nothing in common. This is your case.",
            "Isn't the quest shit?",
            "it sounds like hes giving you either good D or you depend on him financially because hes prioritizing a video game over you  and you'e still dealing with him. So your'e not really that important to him.",
            "[removed]",
            "Is not reasonable for him to do this without involving you. It’s also reasonable for him to want to adapt his living space for his hobbies, but this is also your place. \n\nYou guys need to talk and find a compromise that’s fits you both. He suggested Japanese futon, you’re not ok with that but what would you be OK with? Maybe setting the bed up so that it can be flipped and rested on the wall for a play session? Smaller bed? What would you be able to compromise?\n\nHe shouldn’t gave done that without you, that’s a given, but just think that to you it may seem he’s willing to ruin a relationship for a game, to him it might feel that you’re willing to ruin a relationship for a bed. It sounds like he’s looking for alternatives and you don’t offer anything other than “my way or the highway”\n\nThis sub always jumps to “this person is horrible, dump them immediately”, but that’s not how adult relationships work. They work on communication and mutual compromises",
            "Have you tried the VR system?? Some of them are incredible. You can probably find one that simulates a better bed that you had!"
        ]
    }
]