[
    {
        "post_id": "41fvu4",
        "author": "angryangryfuckfuck",
        "title": "[UPDATE] My [25F] boyfriend's [27M] best friend [27M] cheated on his girlfriend of 5 years numerous times. Today I found out that my boyfriend knew about it & actually helped his friend cheat.",
        "url": "https://www.reddit.com/r/relationships/comments/41fvu4/update_my_25f_boyfriends_27m_best_friend_27m/",
        "score": 3028,
        "num_comments": 232,
        "created_utc": 1453070643.0,
        "selftext": "**Original post - https://www.reddit.com/r/relationships/comments/3ub78m/my_25f_boyfriends_27m_best_friend_27m_cheated_on/**\n\nI was initially going to see my Sami just a few days after I found out what happened, but canceled on him. I took the weekend to think, talk to a few friends & read over the comments to my original post. After a bit of thinking, I decided to break up with him. Sami lied to me, lied to our mutual friend Lauren, covered up for cheating, and knew full well that his friend Jon was having sex with multiple girls and doing it \"raw\". He basically decided his friendship with a cheater was more important than Lauren being exposed to STDs. That was the deal breaker.\n\nI called Sami on Tuesday and asked him to meet up with me in a public place. When we got there, I told him what Lauren had told me. He initially denied, denied, denied. But I think he could see from the look on my face that I wasn't about to be fooled. He literally looked me in the eyes and said, \"To be honest, wouldn't it be worse if I was the kind of pussy who didn't cover for his friends? Don't you want a man who is loyal?\"\n\nGod help me, I was upset talking to him but he said that I burst out laughing. What he was saying was just so ridiculous but he said it as though he was a martyr. I stopped laughing after a second but the look on his face changed completely. He leaned in and said \"You stupid bitch, you think Jon was the only one fucking around?\"\n\nHe's never cussed at me before or said anything with so much anger, especially not with the intent to hurt me, but for some reason I just didn't care. I thought so little of him at that moment that his opinion didn't matter to me. It was actually kind of a comfort that he said that to me because it proves that he's a fuckboy. \"When people show you who they are, believe them.\"\n\nSo I just got up and left. I picked up Chipotle then went home and watched \"Making a Murderer\". A few hours later I called Lauren and explained to her everything that happened. She comforted me then advised me to get tested for STDs immediately. She ended up coming with me for support to get tested and then a week later I got the results that I'm clean (and so is Lauren btw).\n\nAnd that was that.\n\n**tl;dr - My boyfriend who was helping his best friend cheat ended up being a cheater too. Both relationships are now ruined, but the two girls ended up becoming even better friends.**\n",
        "permalink": "/r/relationships/comments/41fvu4/update_my_25f_boyfriends_27m_best_friend_27m/",
        "comments": [
            "\\> \"don't you want a man who's loyal?\"\n\n\\> cheated on his girlfriend\n\nThat's actually amazing. ",
            "> He leaned in and said \"You stupid bitch, you think Jon was the only one fucking around?\"\n\nBirds of a feather flock together.\n\nYou did good OP! Dodged a huge bullet and didn't sink to his level.",
            "Make sure you get tested again in six months for HIV.",
            ">I picked up Chipotle then went home and watched \"Making a Murderer\".\n\nRIP OPs Ex.",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Wow.  You handled that well.  I'm sorry both your boyfriends turned out to be so...I'm struggling to find the right word.  Awful?\n\nI hope you and Lauren go on to find men much more worthy of you. ",
            "My god my god your ex is scum. What I am saying next might not be looked at with much favor, but whatever. Make sure people know that this is the kind of person he is and that they could be spreading stds. Seriously, you might just save someone's health. ",
            "You decided not to date someone who hurts others, and that protected you from dating someone who hurts you, personally. That's got to be some kind of good karma. Stick to your principles, girl, they are working for you!",
            "Well done OP.\n\nI read the original post and read a lot of people saying \"look it's a guy thing, you may not approve of what your friend is doing but you've got to be loyal to him\", blah blah blah.\n\nAs a guy, I say: FUCK. THAT. NOISE.\n\nThe company you keep says a lot about you.  If you are willing to lie to aid and abet shitty behavior, you are a shitty person.  Period.\n\nCongratulations on getting out of a relationship with an asshole, and humiliating him in the bargain.  That burn you gave him laughing at his ridiculous justification for his awful behavior should be something he remembers for a long time.",
            "I would recommend still getting tested 3, 6 and 12 months after the fact. Not trying to scare you, but that's what I did after I found out my SO cheated on me. Best precaution.  I hope you and  Lauren find wonderful, loving gentlemen. Not those scumbags.",
            "You: 1. Fuckbois: 0.",
            "Margaret Atwood once said that men's biggest fear is that women will laugh at them. Hope he feels that burn for a while.",
            "Get tested for HPV by keeping up with your pap smears for at least 3-4 years without fail.",
            "Best response. Glad you found out his true colours before you got even more involved with him.",
            "You handled this in the best way possible. You're amazing! Good riddance, you can do so much better 👌👍",
            ">  \"To be honest, wouldn't it be worse if I was the kind of pussy who didn't cover for his friends? Don't you want a man who is loyal?\"\n\n..\n>  \"You stupid bitch, you think Jon was the only one fucking around?\"\n\n..\n\n> He's never cussed at me before or said anything with so much anger\n\nYou're fortunate he let his mask slip as it removes any lingering doubt about his nature.   \n\n2 years without this side of him being exposed?  That's some expert-level sociopathy right there.   But better finding out after 2 years than after 3, 4 or being married.\n\n> Both relationships are now ruined\n\nPerhaps you can reframe the relationships as being flawed from beginning by these mens true hidden character and you merely  recently discovered they were *always* going to be doomed.\n\nGood on you for being so firm and positive with your response.\n",
            "> He leaned in and said \"You stupid bitch, you think Jon was the only one fucking around?\"\n\nJesus christ, this made my blood run cold. Like I've been on here a while and abusers are everywhere and that's scary. But that instantaneous flip of the switch is horrifying. People who can't hide who they are don't scare me, but people who can completely hide this whole other person like this do. I'm so glad you left him, because that would have made me lose my breath. I figured he would deny it, or beg you not to leave or cuss at you, maybe hit you of anger if he was a total ass hole.\n\nBe holy god, fuck that.",
            "What is a fuckboy? ",
            "You handled that like a fucking champ.",
            "I remember your post.  I'm so glad that you handled it like a rock star!",
            "Rarely in life do you get such instant validation that you made the right decision. ",
            "What a sociopathic asshole!!! He's going to hurt other people later. Glad you got out. ",
            "Holy crap! I didn't see the op until today, but good on you for the analysis! I'm so glad you and \"Lauren\" are both free and clear and I hope you both stick together, you sound good for each other! :)",
            ">I picked up Chipotle then went home and watched \"Making a Murderer\". \n\nOP, you're awesome. KEEP ON BEING AWESOME! :) Your ex is a fool. ",
            "How are you liking Making a Murderer though?",
            "Glad you guys are safe. ",
            ">\"You stupid bitch, you think Jon was the only one fucking around?\"\n\nClearly you didn't think that Jon was the only one sleeping around, after all you were breaking up with him (at least in part) because of that suspicion. What a stupid piece of crap, congratulations on being newly single. ",
            "Thank you thank you for the update. I had been wondering. You are so smart and beautiful so I'm so happy for you that you got out of that relationship. And to be honest, you sound like one of the nicest friends I've ever met via internet. I have a big group of girlfriends and we are always there for each other so it's a breathe of fresh air to hear about another honest female helping out another female. God bless It sounds like you will move on ",
            "F U C K B O Y S\n\nU\n\nC\n\nK\n\nB\n\nO\n\nY\n\nS",
            "Ugh good riddance to both, I had to check the ages since they are acting like frat douches. ",
            "It's so refreshing when OPs are able to identify and react properly to a fuccboi. I feel like half of my comments in this sub basically amount to \"can't you see he's a fuckboy? Who cares about his shitty opinion.\"",
            "Yep. My ex got really close with someone that cheated, would encourage the other guys in relationships to cheat. I didn't let myself stress about it because I figured if that's all it took, then good riddance. I want a man that can handle himself.\n\nEventually, he cheated. He really wasn't the type, confessed immediately, and seemed more upset about it than me, but fuck that noise. I'm sorta thankful to the (shitty) friend, actually. ",
            "The ultimate \"you are what you hang with\".",
            "I remember the first post from ages ago, so glad to see you've dumped his ass. I laughed at that whole 'would you rather be dating a pussy' thing aswell because yeah i'm down for being a good friend but HOLY SHIT did your ex have a vested emotional interest in his mate's penis. Top stuff. Totally normal O__o",
            "Jesus, has he tried to contact you since?",
            "Wow, I can't believe the 180 he did speaking to you like that showing his true nature. Vile people the pair of them. Hey at least you got a friend out of it!",
            "You're amazing. I try to explain this logic to so many of my fellow ladies but they just cry about how they love the dude and become a doormat. Kudos to you for staying true to yourself and getting the heck out! ",
            "Damn, sounds like you dodged a HUGE bullet. What an ass. Glad you are clean and don't have to worry anymore.",
            "Are you in the Chicagoland area? I'd like to take you out for a fucking drink. Well done, OP, you're a champ.\n",
            "Am I the only person who took \"do you think Jon was the only one fucking around\" to mean that Sami thought Lauren was cheating on Jon, rather than an admission that Sami was cheating on OP?\n\nI mean, he sounds like a dick anyway, but I'm not sure he's saying what everyone thinks he is.",
            "Aaaaaand we all saw that coming. What a jerk. Glad to hear you're not too torn up about it. I wish I were as brave as you. \n\nStay strong! <3",
            "> You stupid bitch, you think Jon was the only one fucking around?\n\nAm I the only one who interpreted this to mean Lauren was also cheating? Seems like everyone is assuming Sami was cheating, but that's not obvious to me?\n\nNot that that excuses the insult or the lying of course. I'm just not clear \"ended up being a cheater too\" is definitely the case?",
            "Asks if you want loyal man then tells you he's been sleeping around also. That's not what the word loyal means but at least the guy is out of your life. Plus still got friend! ",
            "Well, like, major duh.",
            "My ex's BFF was a serial cheater on his GF on 7/8/9? years and this guy would bring girls around his friends and kinda flaunt his cheating. It always made me uncomfortable and my ex would blow me off. I shouldn't have been surprised that my ex cheated on me twice and both times went to this friend for advice on how to deal with the fallout after I found out. We were already broken up when I found out but it was still super shitty.",
            "OP, I'm proud of you.",
            "That's really fucked up dude. I don't know how I would feel about that besides extremely pissed. ",
            "I was going to say, if he covered for his friend like that, there's a high chance his friend was covering for him too. This fucking \"always have your friends back, even though he's a total asshole fucker\" is on the same level of dumbass \"you can't hit girls no matter what!!\" Mentality. ",
            "I've never understood this. Who are these people fucking?? Where do they find them?? I just don't get it. \n\nMost people I know have to work really hard to find a relationship and these people seem to meet and fuck on the way to the grocery store. I sincerely do not understand. Drugs? Alcohol? What is it? ",
            "I don't believe any of this, I mean, who still eats at chipotle?",
            "bullet = dodged - you go girls!",
            "You did the right thing! Good for you. \n\nI also just started 'Making a Murderer' and am already hooked. I have only heard good things about that show. ",
            "Major bullet dodged. What a douchebag. Make sure you get tested again in another 6 months just in case. ",
            "Wow! Good for you for not buying into his bull. You will find a man who actually knows what being loyal really means.",
            "What an asshat.  When I read the original post I kinda had a feeling he also cheated. Im happy your out of that relationship but you have a great friend out of it. ",
            "Good on you, OP. If someone helps someone cheat, they're doing it too. Thankfully you don't have kids mixed into the ordeal.",
            "Good for you OP!! I was in a similar situation in the past and being a dumb bitch I was in high school I helped my friend cheat because I just wanted to keep her friendship since I was only close to her at my new school. \n\nLater I realized she was a complete cunt. and I am happy to say I have remained friends with the guy she cheated on and have apologized to him for not saying anything before. :) ",
            "The underlying attitudes are clear, even before his admission.  If he would empathize and cover, he's okay with the idea of it.  I am glad you are clean, I am sorry for the circumstances.",
            "GG. Good thing you found this out now and not further down the road. Hope everything goes your way!",
            "The relationships aren't ruined, just over. You both escaped from awful people by having honest communication.",
            "Awww. A happy ending! Have fun with your burritos and netflix and lady time. :)",
            "Good on you OP! Fuck Jon and fuck your ex. No wonder they are friends.. what absolute dirt bags.  ",
            "> \"To be honest, wouldn't it be worse if I was the kind of pussy who didn't cover for his friends? Don't you want a man who is loyal?\"\n\nOh God. I CANNOT believe he said that. Disgusting.",
            "Thanks for the update and fuck that guy. Totally figures.",
            "Nice one! Lauren sounds like an amazing friend!",
            "Worth telling any other friends with a boyfriend who is friends with them to be wary - he may not have just meant himself.",
            "You. You need to teach a class. Seriously. There are people who need you. You are a hero and there are people who would not have the courage to do this.",
            "I would hope that my cheating friend would not use me as an excuse or alibi. If it happened, I would tell them once; \"do what you will; but leave me out of it\" and then never lie. If asked by a friend's SO I would simply say \"not with me and I don't know where he is\". It almost sounds like OP expected her boyfriend to actually give a fuck about the other girl; IMO, my friends' girlfriends are not my concern. Keep in mind, this is coming from someone who has had a lot of male friends cheated on by their female SO's ... so no love.",
            "BRAVO! You handled that like a boss.",
            "That isn't loyalty. I am glad you found a friend in this. Hugs!",
            "Bullet dodged,  true friend found,  I'd say this one worked out.  ",
            "Well done on being so strong. You and Lauren did nothing wrong in this situation and you're going through better off for finding out. Now you've gained an even closer friend :D",
            "Scary how people show their true colours when they're cornered. Good riddance. ",
            "The conclusion to this story was perfect and you handled it heroically. Knocked him down a peg or two.",
            "What episode of making a murderer are you on? This show's crazy!!!",
            "You, my dear, are... Such. A. BOSS!!",
            "I almost wish he had given you some treatable STI so you could have sued him with reckless endangerment.\n\nBut anyway, congrats to you for knowing your worth. It's so infuriating when people try to give their unfixable SO a chance to \"change.\"",
            "I hope to never be in his situation. I'm 20, and have known my best friend since I was 4, I mean I probably wouldn't help him cheat but there's a good chance I'd know about it. On one hand I can see how that's incriminating, on the other hand is hope my SO would know I'm not that easily influenced by my peers. I have a hard time imagining cutting contact with literally my lifelong friend and who my family considers my brother, over his actions towards his GF. I realize this story is different, all 4 of you were pretty tight, he lied to you, etc, but still, it makes me wonder what I would do in a similar situation. It's easy to say you'll take the high road, but most IRL situations are never that cut and dry. \n\nYou ex was an asshole though, so good on you OP for getting rid of him. Had he been honest with you from the get, or at least talked to you about it, I'd feel a little for him, but he turned out to be an ass anyway. ",
            "[removed]",
            "[removed]",
            "Please explain the term fuckboy\n\nEdit: wow who knew asking someone nicely to explain something was a horrible fucking thing. Thanks people!",
            "Chipotle? \n\nYou should get checked for norovirus when you did the STI tests. ",
            "[deleted]",
            "[removed]",
            "I called it so hard."
        ]
    },
    {
        "post_id": "m1ak1z",
        "author": "goblin_nite_",
        "title": "My (17F) sister (15F) smells really bad and every time I try to tell her she takes it as teasing",
        "url": "https://www.reddit.com/r/relationships/comments/m1ak1z/my_17f_sister_15f_smells_really_bad_and_every/",
        "score": 3032,
        "num_comments": 307,
        "created_utc": 1615308514.0,
        "selftext": "\nSorry for any errors, I’m writing this on mobile.\n     So my sister has never been one for good hygiene. She didn’t take brushing her teeth seriously until she got two cavities and to this day refuses to brush her tongue so her breath smells bad (I sometimes get on to her about it but she’ll lie and say she did). She’s never really taken care of herself because my mom has always babied her.\n      \nAnyway, her bad habits have extended to her room. One of our dogs like to stay in her room, and because of that it will poop and pee on the pee pads we had to start placing. One of her only chores was to pick up the waste and keep her room clean, but she doesn’t. She will literally leave the poop there for days and rarely changes the pee pads, and it’s to the point where I have to go in daily now to do it. Not only that but she never cleans her mattress (we tried to once together and brown stuff kept coming off the mattress but it’s still not clean) and rarely washes her sheets. Because of all this and more, she smells terrible and I can’t stand the smell of her room (our rooms are right next to each other too so when my door is opened I can smell it). \n      \nI have a really sensitive nose and some sensory issues so the stench always sends me into a sensory overload episode and I can’t really stand to be around her anymore. I try to tell her that she needs to wash her sheets and keep her room clean, but she just does the whole “no you” routine because she thinks I’m teasing her. \n      \nI don’t know what to do. I’m going to college in a few months so I won’t be able to pick up after her and I don’t want this to keep going into her adult life. Does anyone have any advice on how to get her to listen to me seriously?\n\nTL;DR: My sister smells really bad because she doesn’t clean her room up and takes any advice from me as if I’m teasing her. I don’t know how to get her to listen.\n\nEdit: I want to clarify that the dog is a chihuahua and her room isn’t like covered in poop or anything. It’s just that there are small areas where the dog will poop and she’ll just ignore it while she does something else. Also, she usually smells fine after she takes a bath, the problem usually rises when she gets out of her room in the morning until she bathes again (because we generally stay in the living room and hang out in the evenings so she doesn’t really go back in there).",
        "permalink": "/r/relationships/comments/m1ak1z/my_17f_sister_15f_smells_really_bad_and_every/",
        "comments": [
            "You should say all of this to your mom and your mom should speak to her and make her accountable for actually doing her chores and keeping herself/her room clean. \n\nIf your parent(s) will allow her to be disgusting that is not something you can fix.",
            "“I’m going to college in a few months so I won’t be able to pick up after her and I don’t want this to keep going into her adult life.”\n\nI think you have partially answered your own question here. Your parents don’t seem too concerned about holding her accountable and she doesn’t seem too concerned about getting better. \n\nI’m not one for giving absolute advice most of the time, but to me it seems like the only solution here is accepting that it’s not your job to parent or fix her, nor are you able to. Let it go and go to college. She will grow up, or not, on her own time. But sheltering her and trying to fix her problems for her isn’t going to do anything but shield her from the consequences of her lack of hygiene. \n\nYou’re going to meet plenty of people in your life who you will feel the need to fix, and often they will be people you deeply care for and don’t want anything bad to happen to. But this is a dangerous path to follow for yourself. Learning when to let others help themselves is a vital skill to learn in order to not end up in codependent or abusive relationships. \n\nSo the takeaway here is you can only help your sister and yourself by not helping. Easier said than done, but it’s possible.",
            "This might be an obvious question, but have you brought it up with your parents?",
            "[deleted]",
            "Its not normal for people to not care if they smell or if their room is covered in feces. Has she been to the doctor to check for any mental disorders or severe depression? Her natural instincts should be going OFF about literal feces in her room, and the fact that they're not is a huge warning sign that she's going through something that is bigger than \"she smells\".\n\nIf it's this bad and your parents aren't checking and making sure that she is washing, brushing, and cleaning her room EVERY DAY, despite knowing the situation, they are criminally negligent. She's clearly either not being raised, or has mental health concerns they're not addressing, and either way they're allowing their child to live in a room full of feces and pee so they're not meeting the basic requirement of a safe environment... A call to CPS or a conversation with a school counselor may not be out of order.",
            "Talk to your parents. This is not your job as her sister.\n\nAlso, take with you or put into secure storage anything you particularly value of your possessions, because your sister is going to spend the next few years letting the dog shit on everything you leave at home.",
            "Your parents are neglecting her (and you, and your dogs) terribly. Like “get CPS and/or Health & Human Services” level neglect. I don’t care how busy they are, their primary responsibility, legally, ethically morally, etc. is to ensure the welfare of their children, and they are failing her spectacularly, setting her up for a lifetime of poor health. And you, feeling the need to take over the most basic task of providing clean, healthy housing for your little sister, is a tragedy. It probably feels normal to you but it is not.\n\nI’m so sorry you’re going through this. PLEASE talk to a trusted counselor or teacher at school. I know it’s terrifying and probably feels risky and sort of like you’re betraying your parents, but your family needs outside help.",
            "Rather than getting stern with her, I think you should sit her down and be genuine and earnest. “sis, I’m really not making fun of you. you smell really, really bad, and that’s with me helping by cleaning up the dog mess in your room. I’m really worried about it getting even worse when I leave. it’s got to be bothering the people at school, and I don’t want you to be ostracized or made fun of.” \n\nMake it clear that you’re not nagging her about doing chores, or teasing. That there’s an actual problem that you’re worried about.\n\nAnd then honestly you’ve got to drop it and leave it up to her.",
            "Is the dog old or mobility-impaired or incontinent? Or is it using pee pads because it's stuck in a closed room with your sister and nobody lets it outside regularly?\n\nIt seems like your family has a case of pet neglect or even abuse going on.\n\nIf your parents aren't being responsible animal owners, maybe you can start taking the dog outside regularly. Get it into the habit so it will go to the door instead of shitting inside. I know it's another chore you didn't ask for, but instead of picking up old nasty pads you're spending some quality time with a dog who needs some actual love.",
            "Your sister has issues but your parents are incredibly neglecting. In what world is it okay for a 15 yo to let the dog pee and shit in her room? That's neglectful to the dog aswell! \n\nYour sister is still a minor and while your mom is not her maid, it is the adults responsibility to provide an healthy environment.\n\nThat includes getting rid of the dog, if no one in your house can properly take care of it. Adopt the poor thing!",
            "Why is the dog shitting inside the house? Do you guys not take it outside on walks ever? What the hell. Peepads too? Is the dog like disabled or what? If not, it's serious animal abuse.",
            "Info: is it possible that she’s being abused? Like sexually abused? Being “gross” and intentionally avoiding hygiene is sometimes a coping mechanism-either because the trauma happens in the bathroom/when clean, or bc they want to deter the abuser by being too gross for them.",
            "Can you have a sit down talk with her, just her, and be like, \"Look, sis, this is SERIOUS. I'm not kidding and I'm not teasing. I say these things to you because I'm scared for you. Poor body care and mouth hygiene can make you sick and even damage your heart. You probably don't notice the smell because you're used to it, but it's REALLY bad and I'm worried it may cause you a lot of social problems if you don't learn to deal with it. I don't want to hurt your feelings but I'd rather take the hit than have a date drop you in a few years and spread rumors about you being diseased. I'm doing this from a place of love, but another person may use this to hurt you, bully you, and abuse you. I don't want that. I promise I'm not judging you, I want to help you. I understand that a lot of this can be overwhelming, but you can talk to me about it. Anything you need, it can stay between us.\"\n\n\nDon't enable her by doing the work FOR her but if she needs taught how to do things or guidance getting organized, or emotional support you can help her. \n\n\nSome ideas that she might find may help (from myself, an adhd depressed potato with chronic pain!): \n\n\n1. Laundry stripping: mix equal parts washing soda (not baking soda), borax, and oxyclean. Fill bathtub with hot water, add laundry and soap mix. Soak laundry for 8 hours, stirring every hour. When done, run through the washing machine with just water, then dry like normal. You can do this with blankets, bed linens, pillows, clothes, curtains, stuffed animals, area rugs, etc. It will take a TON of the built up residues out of her room. (Also its satisfying AS FUCK.)\n\n\n2. If she can't remember to take the dog out regularly enough, and alarms don't help her remember, see about litterbox training the dog so its waste is more contained and sanitary. \n\n\n3. Borrow a high powered shop vac. Sprinkle the mattress generously with baking soda, let sit for as long as you can but at least half an hour, then vacuum. Flip it over and do the other side. Then use Nature's Miracle dog pee treatment to spot treat any stains on the mattress. (Even if they're people stains, the stuff helps break down the smell.)\n\n\n4. Get allergen-barrier pillow protectors and mattress protectors for her. \n\n\n5. If her room is carpeted, see if your parents are willing to switch it for something less odor absorbing and easier to clean (I switched my carpet to LVT vinyl tile and its so SO much easier to keep clean).\n\n\n6. I find it hard to keep my room clean if stuff is \"put away\" so I use either open shelves, clear bins, or wall hanging to keep my stuff organized in a way that doesn't leave me ripping everything out of all my drawers trying to Find The Thing. \n\n\n6. This sounds dumb but certain types of light make it harder for me to function and increase my brain fog. She may want to test out different types, colors, and brightness of bulbs until she finds one that feels right. \n\n\n7. Make sure her room has a couple different trash cans and hampers for dirty clothes; it's easier to remember to use them if you have several which are easily accessible. \n\n\n8. The tongue scraping thing may be a lost cause, but I find grooming is easier to do if it's fun. I'm a 36 year old adult brushing with a Lion King toothbrush, using kids watermelon toothpaste, and using alcohol free strawberry mouthwash. I only started scraping my tongue regularly when i got a pretty, shiny rose gold scraper that feels nice to touch. You might suggest that to her. It's better to do the thing than do the thing how boring adults want you to do it.  ;) \n\n\n9. I keep a clear plastic tote in my room for dirty dishes. That makes it easier to keep them contained and remember to take them to the kitchen. \n\n\nBeing 15 is hard. Just do your best to let her know you're on her side and want to empower her to succeed. This isn't your responsibility but your mom is treating this as a discipline issue and not using her problem solving skills to figure out what the issue is.",
            "This is absolutely a neglectful situation. I feel horrible for you, your sister, and the animals in the house. This hurts my heart. I hope you and the other innocents in this situation can get out asap.",
            "I think a lot of people have given good advice, but I'm going to give you another angle for this.\n\nYour parents suck. I'm sorry to say, but they're neglecting your sisters and your needs here. Neglect is the most common form of child abuse, and it's very clear from reading your post and comments that this is what's happening.\n\nThis is the point where you have a chat with a guidance counselor or trusted teacher and tell them everything: your sisters issues, your parents being mental health deniers, how all of this is affecting your quality of life and ability to function.  Tell them you are worried about your sister and don't know who to turn to. You can also tell them that you don't want them to disclose that it was you who came forward. Your sisters hygiene is probably very clear to her peers.\n\nIf CPS becomes involved (which they should be) they won't apprehend you or your sister, but they will offer support and get a social worker or child advocate involved to help your family get on track.",
            "This is abnormal. I saw you talked to your mom about it but she brushed it off, but might the conversation be a little more productive if it were framed as a mental health issue?\n\nI’m a special education teacher, and the things you are describing sound like executive dysfunction. You know that little motivator inside you that keeps you focused and let’s you know when it’s time to do something, how to prioritize tasks, and the steps to doing tasks? Your sister’s doesn’t seem to be functioning properly. Depression, anxiety, ADHD, or many other issues could cause this. People with healthy executive function don’t choose to live with poop in their room any longer than they need to. Getting your sister some mental health care will help.",
            "It’s good that you care about your sister but this really needs to be coming from your parents. Surely they’ve noticed the lack of hygiene or are themselves not very clean? Do they not pay much attention to your sister to the point that they don’t care?\n\nIt’s probably a bit late for your sister’s current mattress, but always use a mattress and pillow protector. (Never stay in a hotel that doesn’t use them).\n\nFirst step is to discuss your concerns with your parents and get them to step up. If they won’t, then you’ll need to talk to a teacher about your worries. As your sister is only 15 she’s a child being left in filth which is something child protection services will concern themselves with as it’s neglect.",
            "[deleted]",
            "Just want to add that usually it’s social pressure that makes kids want to change this behavior. Does she have friends? Any romantic interests? Any one she hangs out with outside of school? Once kids reach high school they expect their peers to grasp basic hygiene, and tend to ostracize those that don’t. I’d assume this is affecting her socially.",
            "When I was your age, had the same problem. I was 6 years older than my sister, however. She refused to shower regularly, refused to brush her teeth, refused deodorant. Instead of dog shit, it was rotting food. She would eat and eat and hide food, wrappers, plates through her room. She got bullied in school for her smell but our mothers solution was to just homeschool her. Her reading, writing, and math abilities took a nose dive. Our mother refused to discipline her, and they just got used to me being \"the bad guy.\" I'm not her parent, so I just stopped. Our mother yelled at me, and I would just give her a blank expression and ask why she doesn't do it herself. \n\nMy younger sister never got better, and I left at 16. They know exactly what it is they're doing, and you can't change it. Your sister needs to realize on her own how to do these things, and it may never happen, but that's not your problem.",
            "Is it possible your sister is suffering with a mental illness? Perhaps that approach with your parents might help or if you tried to talk to her in an neutral way out of concern? \n\nI’m really sorry you have to deal with this OP.",
            "Where are your parents? Didn't they teach you basic hygeine? Why did they quit with her?",
            "Have you ever seriously sat her down and said: I'm not joking. Please change your habits. Currently your behaviour has <effects> on me and if you can't care for yourself for yourself, please try to do it for me. I'm not going to pick up after you anymore.\n\nAlso stop picking up after her, you're enabling her bad behaviour. And if possible rush moving out a bit.",
            "I’m so sorry for your situation - seems like there’s been some brilliant advice so far! I just wanted to add, it’s very important that dogs are let outside to pee and poop as their waste is very harmful to human health especially if it’s in the bedroom. That is becoming an animal and child welfare issue and is something that you also may need to emphasize with your parents if possible.",
            "You've tried to help and change your sister's habits. There's no magic trick to \"making\" anyone else do something. I would suggest having one last conversation where you seriously but lovingly (if appropriate) tell your sister how her smell makes you react.\n\nProbably a bigger pice of advice I'd offer is for you to practice coming to terms with the idea that you are not responsible for how other people behave. When you get to college, I hope you have a compatible roommate. I can almost guarantee you'll encounter people with even worse hygeine/habits in the dorms.",
            "I'm surprised no one at school has told her she stinks. Usually that's how most people figure out deodorant.",
            "There are a few red flags here. This could be a symptom of depression. I am really concerned that her mattress is brown, that sounds vile. Does she have a therapist? If so, your mom should talk to the therapist about self care issues. No matter what you should stop cleaning up for her and frankly pee pads shouldn’t be in a bedroom. You can also say something to your doctor or your school counselor, I’m assuming you have the same ones. Last resort, call CPS.",
            "It’s not your job to look after your sister, it’s your parents’. If your parents either refuse to do it or just blatantly don’t see the problem, then that’s neglect. Do what you can to convince your parents that this is a serious issue before you leave for college, but if this doesn’t stop then you might want to think about calling CPS.\n\nMaybe stop cleaning up after your sister for a while and see if either she or your parents take notice of the situation.",
            "Something we say to patients who have no insight into their condition (or who are mental health deniers like your parents) goes along the lines of “If you don’t want to frame this as a mental health issue, that’s fine. But we have to collectively agree here that this set of experiences and behaviours is not healthy and is not serving anyone. What can we do to address this?”",
            "Write her a letter about your concern for her health and all of this shit and leave it in her room or under her door.",
            "This is a situation I can relate to. My parents were fairly checked out when I was a kid and I often felt responsible for my younger siblings and the general cleanliness and tidiness of the house.This got worse as an adult because I literally would feel responsible for everyone and everything. \n\nThis situation is heartbreaking with regard to your sister. Your parents should be keeping things in check with her and follow through on consequences if she does not take care of things. They are failing her as parents.",
            "It is a job of parents to notice medical issues with their minor child, such as behavioral, mental unwellness, etc, and to attempt  to get professional help. You are a sibling, not a parent. You don't have parental duty to your sibling. \n\nYou can have a serious talk about issues with sibling, and they may or may not make changes.  You may inform your parents that sister may need to see a behaviorist etc, but they may or may not schedule an appointment. \n\nGo to college and make a good life for yourself.",
            "Buy a gas mask (also known as a full face respirator). It’s a refuge from almost all smells...I have a sensitive nose too and if my neighbor is smoking at all, I can smell it. It’s a godsend. They aren’t too pricey, maybe $100. \n\nAs a bonus, it ought to send the message...still, my sister had the tooth brushing problem also. It was horrible. We tried for years...she often wouldn’t even wash her hands. She refused to get braces since she wasn’t willing to do the additional hygiene for them. To this day she has some of the worst teeth I know of. It’s crazy how obvious it is... yet I’m pretty sure she still doesn’t care. \n\nYou just have to let them face the consequences at some point. You’ve done your part.",
            "Where are your parents in this?\n\nI'll be honest with you, if I were a family friend I would have already called Child Protective Services(or whichever equivalent applies if needed).  \n\nThis is disgusting.",
            "Honestly it sounds like she's depressed this kinda similar to what I went through when I was super depressed and just didn't want to do basic hygiene and things like that",
            ".... why wont you take your dog out to do it's business?? Who let's dogs pee a sh*t inside?! That would counts as animal cruelty in my country.",
            "This kind of behaviour is definitely a huge sign that something is wrong. Your sister’s room is so disgusting that no one else would possibly want to be in that space. Sounds useful if you don’t want visitors. However, it makes me worried that she’s doing this to protect herself at night. Childhood sexual abuse victims will often do things like wet the bed if they know it will keep their abuser away.\n\nYou mentioned that your mom didn’t want you to bring this up with your stepdad. So...what’s his deal?",
            "You mentioned that you are hypersensitive to smells and some over sensory issues, I’m wondering if your sister is hyposensitive. A quick google search describes hyposensitivity as:\n\n‘Hyposensitivity, also known as Sensory under-responsitivity, refers to abnormally decreased sensitivity to sensory input. Hyposensitivity is especially common in people with Autism, and is mostly seen in children. Those experiencing this have a harder time stimulating their senses than normally’.\n\nOf course I, nor know one else here can diagnose, but it may help you to understand the problem if you can try looking at it from other angles.",
            "Where is your mom in all of this? Why hasn't she punished her for not cleaning HER room?\n\nIf she lives that way, your mom should throw out her mattress, bring someone to disinfect everything in her room and wash the sheets a couple of times. \n\nAsk any of your friends jf you can temporarily move in with them if your mom does nothing to help with the situation. It's really not healthy to live like that with all the bacteria. Seriously let your mom and sister figure this shit out. Your mom is clearly neglected her job of being a mom by allowing your sister to do all of that.",
            "Is it possible she has depression?",
            "I was in the same shoes as your sister. She could very well have depression. My sister and I went through separate depression stages but we both had depression nests where clothes would be every where in our rooms.Hers even got so bad you couldn’t see the floor and there were wrappers in drawers . My room never got that bad but in the pits of my depression I didn’t shower enough, brush my teeth and I only wore sweats to school. Its hard to care about how you look when just getting through the day feels like a lifetime of work. And she may be playing it off as teasing because she doesn’t want to think about why she is acting that way.The thought could be if I acknowledged I have an issue I would have to address that issue or saying to yourself my issue isn’t that bad, no one could notice something is wrong. I would approach this from a different angle and talk to your sister about how she feels. If it is a mental health issue then the hygiene issues will clear up as her mental health does. If she seems resistant to talk to you about it I would just tell her “you don’t have to tell me anything but if you ever want to talk you can come to me and I will have 0 judgement”.I wish you both the best and my heart goes out to both of you",
            "My teenage sister went through a multi year phase of not showering, she’s 19 now and still won’t shower, we’re talking like goes into the bathroom, turns the shower on but won’t get in \n\nI’ve theorised everything from her being abused in a shower etc but haven’t been able to fix it \n\nNot sure if it’s the same thing",
            "Your parents can speak to her as well, but at the end of the day, kids her age are brutal. Another kid saying \"ew you smell!\" may be the best deterrent for her. You may end up having to just wait and let her be told by someone else that she needs to be clean.",
            "Are your parents divorced?",
            "It's not your responsibility to make sure your sister grows into a good adult, it's your mom's. I give it two months tops after you leave for college before she realizes she fucked up.",
            "Maybe this is a bit extreme, but one way that's kicked my parents into gear when they're slacking on certain thing is to invite someone over who's opinion they care about. Whenever my mom's parents would come visit us after we'd spend time feverishly cleaning, my grandma would comment on a spot she missed and then clean it herself. If you could somehow engineer a friend or family member to visit you, and either prime them or let them openly comment on the state of your sister, that could kick your parents into gear. Best of luck to you in this situation.",
            "in addition to all the advice in the other comments to deal with the core problem of figuring out why she does not take pride in hygiene, it also helps to do some harm reduction.  Someone can buy a mattress cover (a good one that zips entirely closed), a good garbage can with a lid so she can easily throw things away, and maybe a hamper with a lid so her laundry can be away. the problem needs to be handled from a number of different angles.",
            "You're enabling her by cleaning up her mess. This teaches her the opposite of what you want: that she can continue to do fuck all and someone else will take care of it. You should immediately stop enabling her. In the short term, the mess will indeed get worse.. but frankly, this is what you want because it will become a forcing function. Eventually it will get bad enough that your sister will take care of it herself. Or, more likely, one of your parents will finally step in (you're enabling them to inaction by cleaning her mess as well). \n\nTL;DR: knock it off, OP. Your intentions are good, but your actions are having the opposite effect from what you want.",
            "Get real direct with parents. \n\n“She is 15 and capable of ensuring she cares for herself. I will no longer clean after her or the dog. She is not clean, her living  space is not hygienic and this is your responsibility to resolve. This is not normal and I am concerned. She will miss out on opportunities and friendships. I expect you to manage this as our parents”",
            "Your parents need to get their shit together, stop babying your sister, and do whatever it takes to get her ready for adulthood, even if it means hiring an occupational therapist to resolve the issues. My oldest daughter is autistic, and it took years of deliberate parenting, OT, and patience to help her become proficient at personal hygiene and basic chores. It can be done, but it needs to start NOW.",
            "> She’s never really taken care of herself because my mom has always babied her.\n\n> She will literally leave the poop there for days and rarely changes the pee pads, and it’s to the point where I have to go in daily now to do it. \n\nYou may not want to hear this, but you're doing exactly the same thing as your mom.\n\nYou're going to college soon, so this will stop being a problem for you. For the future, you need to understand that you cannot control what other people do, only what you do in response. If your sister wants to grow up to be disgusting, that'll be up to her. It likely won't be the case as soon as she wants to start dating, mind you, but is still a possibility that you have no control over.",
            "Just leave it. Once you are gone, she will have to deal with the natural consequences of that disgusting state on her own. When she goes to school smelling like dog piss and shit, the other kids will make fun, and maybe that will be the way she learns.",
            "[removed]",
            "Firstly.. does your sister possibly have depression, ADHD, or maybe some other issue that could be the underlying cause of this? It’s not normal for people to live in filth and be okay with it when they’re perfectly healthy. I have a suspicion that this is more than her being “spoiled” per say or just not caring.\n\nI have ADHD and it is enormously difficult for me to to do things like change my bedsheets or clean out my cats litter without medication. It’s like there’s a wall between you and the task. \n\nI wasn’t diagnosed until I was 23. I had braces at 14 and not great dental care habits due to ADHD and I’m paying for it now (literally $$) because I need multiple cavities filled and a cap on a front tooth. \n\nI would just totally forget to brush my teeth, but I also had a sensory issue with it. I don’t like the way toothpaste feels or the way it tastes. This could be part of her issue so not just brushing her teeth but maybe even body wash, or even just the water itself. It reminds me of a quote I saw somewhere “Before I take a shower: I hate it in there, the wet world is a bad place. While in the shower: I remember now that this is a good place, it is the dry world that is the enemy.” Showers can be sensory overload.\n\nMaybe it would help to offer to get her a toothpaste she would like - unflavored, bubblegum, cinnamon, etc. Or maybe a fancy toothbrush! Or a Bluetooth speaker in the bathroom so she can listen to her music or podcasts. Maybe even just getting her some bathroom stuff she enjoys, if she doesn’t already have that, could even help. Having my bathroom set up the way that I like it and having towels in my favorite colors or prints helps me to get over the imaginary wall. \n\nMaybe some kind of incentive even would help... it may sound childish but make it like, okay if you shower, you can do/have/eat something you want. \n\nThe same idea with a body wash or soap maybe. I was using the same Dove Sensitive Skin bar soap since I was a little kid and suddenly when I turned 24, idk if it was me changing or the soap formula changed, but it felt like it left a film on my skin and I had to switch to the Aveeno Moisturizing bar. \n\nIf it’s the water itself, and you have hard water, you could even go so far as to get a water softening attachment for her shower head.\n\nIt sounds like your parents aren’t super helpful, and I would honestly see if you could turn to a counselor at her school that could assist. A counselor could reach out to your parents and maybe solidify that this *is* a problem. \n\nIt may be worth it to actually sit your sister down and say “Hey, this is a problem, Im not trying to embarrass you, I’m worried about you and I want to help.” That may help get through to her rather than her just thinking you’re teasing or being her annoying sister.\n\nThat all said, it’s really sweet of you to worry about your sister. If you can get through to her and get a good start on it, great! Then you can just keep in touch with her when you go to college to support. BUT don’t allow it to keep you from your life. Go to college. But don’t let this weigh on you while you’re there.",
            "Medication, now. She sounds very ill and not just lazy.",
            "Oh god i misread some of that and thought your sister was sh*tting on the pee pads and got really concerned XD\nBut seriously you should let your parents know about this, if they don’t already. I am the same age as her and at that age she should really know better. Has she been taught proper hygiene growing up? Is she depressed, maybe she finds it difficult? \nEither way you shouldn’t have to run around after her, she’s old enough to handle these issues herself. I suggest having a proper chat about it to any adults in the house and her to try and figure something out, good luck",
            "Are you sure your sister isn’t depressed? Simple tasks like making your bed seem impossible when you’re suffering from depression.",
            "Is she ok?She isn’t depressed is she?I know she could just be lazy but is there a possibility she’s going through depression?Sometimes,depression hits us and we just don’t want to do things that we usually do.Showering,picking up after oneself,not listening to others.I would look into that.",
            "Hey Op. I have worked in prisons and I have had dealings with sexual abuse victims. The absolute best way to stop anyone and I mean anyone going near you is to smell like absolute shit. Both groups I mentioned above would use this tactic to stop any and all interest that some one would have in them. Obviously your sister is not in prison or is she a sexual abuse victim. But there may well be some underlying reason as to why she wants to smell? Maybe bullying maybe some mental health problems who knows. But reaking of shit is not normal and something really needs to be addressed probably on a professional level",
            "Girl, its clear you love your sister, that's wonderful! You're also going to college and will be able to make your own choices freely, which is also wonderful! \n\nYour sister may need a scrubbing, and one day  she might meet someone she likes and they say, \"whoa, soap exists you know?\" then she might start to change her mentality about hygiene. \n\nWe all grow up and you as her sister have done your part so far in loving her enough to tell her to shower. And when it's time for her to learn, she will come to you cause she knows you support her and don't judge her and just want her to be healthy.",
            "I saw that you said she’s been evaluated, but her behavior is so abnormal, that she *has* to have some sort of mental illness. The fact that your parents don’t seem to care sounds like neglect. :/ CPS is normally called when parents allow their children to sleep in rooms full of urine and feces.",
            "[deleted]",
            "Your sister needs a parent or has some sort of depression",
            "Wait it out. Go to college. \n\nwhen you come back on holiday or break, let your sister complain that she doesn't have a boyfriend and then repeat with the brushing the teeth and showering routine.",
            "Collect it all and leave it in her bed. When she gets cross say your meant to pick up it stinks and is disgusting I've asked you. And you ignored me so I was forced to result in shock tactics to get you to clean up the dog crap. \n\nBuy her a wash basket to get her to put her clothes in. \nDon't do her laundry \nGet your mum on board and tell her to not do it. \nSee if she will do it if someone else mentions her hygiene at school. Bet she will take better care then\n\n\nBuy her tooth paste and electric tooth brush mouth wash ect. And tell her it isn't pretty and genuinely stinks. Just like big edd on 90 day fiance. \n\nBuy her body wash and shampoo ect makeup for birthdays and Xmas to continue to drive the point home",
            "Oh girl, I’m sorry. \n\nIf mom and sister aren’t receptive to your plea, then I guess just wait it out until you move for Uni and the cards will fall.",
            "It's not your job to parent her. Ask your parents to handle it, and if they don't, it's their problem when you leave.",
            "Bathing every day isnt good for you btw",
            "When she starts to get interested in guys/girls, then she'll come around.\n\nEDIT: Why the downvotes? Nobody wants to hangout/get intimate with someone who smells",
            "I know this might be a really hard one to do, but maybe for a week stop cleaning up after her. Maybe she’ll notice and realize how messy and unhygienic she is. It may be hard to do this with your sensory issues though",
            "do you think she could have depression? Often times that's a symptom because basic chores can feel like climbing a mountain",
            "It’s not your problem to fix. \n\nOne day her bad hygiene will cause embarrassment, and *maybe* she will change her ways. \nYou’re not her parent, she’s not your responsibility. \nGo about your business and let her be gross. 🤷🏻‍♀️",
            "Start gagging every time she gets near you and tell her she needs a shower when she stinks. Wave your hand in front of your face and tell her to back up with her stank breath. Complain loudly, \"ugghhh your room still smells!\" when you do a fly by lysol spraying into her room. \n\nIf this petty stuff doesn't annoy her over time to start cleaning up, she just doesn't care. Maybe depression, maybe laziness. Who knows? Just spritz her with perfume when she's near you. Or on yourself where you can cover up the smell a bit. Just do your best to get a good odor reducing spray and some candles while you are still living there. \n\nI have a really sensitive nose, too. I can smell it on people's breath when they haven't eaten food all day.. Smells almost like vinegar. And people with kidney problems smell kind of like ammonia. Stinky things are one of my biggest pet peeves. How can someone think it's acceptable to smell like shit? Ugh.",
            "So I’m gonna start out with saying you’re a good sister for even caring enough to be worried about this. The older she gets the less kind people are gonna be about it, and they are a lot more blunt/rude then you could ever be. \nI used to be in your sisters boat, at that age I always thought “well I’m just a kid and once I get older I’ll make the needed changes.” What I didn’t realize back then is it’s harder to kill old habits then it is to make new habits. It took my brother sitting me down and explaining it in a less then kind way. I’ll give you some examples you could use later. \nSomething that helps me is leaving notes around the house. A simple post it note on the bathroom mirror will help her remember to brush her teeth and hair. For her bedroom if she always keeps her door closed put a post it on the outside of the door that says “clean puppy pads” and also put another one with the same wording right by her light switch. You can also put brush your teeth on her door and light switch. Constant reminders like that kinda drill it into your brain.\n\n\nThe best thing for you to do to really get through to her is be completely blunt honest with her. Sit her down and tell her that this isn’t meant to degrade her but to help her understand that personal hygiene can go a long way. Even though she can’t smell her breath(but honestly she probably does because of the masks) doesn’t mean that the people surrounding her doesn’t. Even with a mask on you can still smell it. Remind her that you are being adamant about it because you know how the real world can be for people like her and you are trying to make sure she doesn’t get attacked/degraded by some stranger all because she has bad breath. Strangers are mean and they don’t care if they hurt your feelings, but you care. That’s why you’re trying to help her realize that a little change can go a long way. Not only will it open the door for her to be harassed by strangers, kids at school, and even in the work place (which she can be written up for and lose her job) but it will make having a love life virtually impossible. Nobody wants to kiss someone who has bad breath but also has a gross looking tongue. Also when kissing you can tell when someone has plaque buildup on their teeth which is another huge turn off. Enough about the bad breath. You should also remind her that the poop and piss smell is soaking into her clothes and is beyond hard to get the smell out. Everyone in a ten mile radius can probably smell it and is looking for the cause of the smell. The smell of piss and shit isn’t something she wants to be remembered for. \n\nIf talking to her doesn’t help and if you’re able to you should talk to her school counselor. Because talking to family doesn’t always do the trick and something in our heads tells us they are just being mean for no reason. If she gets called into the counselors office she won’t see it coming and it might be the kick she needs. \n\nSorry for the novel, I couldn’t figure out a way to keep it short and simple.",
            "Is your sister depressed or has any form of mental illness (highly functioning depression, anxiety, etc)? Maybe this can be laziness, but even laziness stems from the fear of not being perfect/failing. There might be a bigger issue-it might not be a disorder, but there’s something definitely going on.",
            "I have a friend just like your sister. She was diagnosed as an adult with ADHD, anxiety, and executive function disorder. Her parents live in their own reality and she was the middle child so it all just kind of got neglected and overlooked in her childhood. When I met her in college, being filthy and smelly in dirty clothes and living in a filthy dorm room was her normal state. She didn't even really understand how bad it was because her parents just...let her be like that. If her siblings tried to talk to her she'd brush it off as them being, you know, siblings. It wasn't until she was out in the world around 'normal' people and saw how other people lived that it started to dawn on her and even then it took *years*, like well into adulthood, for her to get any better about her cleanliness and habits. She's now married with a kid and their house is still in a general state of filth that would drive me absolutely nuts, but it's just...normal for them. My point is that you can't fix what's going on with your sister. Talk to her all you want but she's past the age where this can be corrected with a conversation. She's going to be a dirtmonster until she figures it out on her own and honestly it might never even happen. But hey, maybe she'll luck out like my friend did and meet another dirtmonster and they will live happily ever after!",
            "Does your sister go to school in person? If teachers see that she's smelly or see signs of neglect, they're obligated to contact Child Protective Services (depending on where you live, but I'm sure that's the case in most places). You should stress to your mom that if she doesn't help your sister, both of you might end up taken away. It's a very real possibility",
            "Even if it's just a small spot and a little bit... If she ignores the poop, I'd consider her room is covered in poop. No reason to have poo laying around.",
            "This isn't normal.  Your parents should have a doctor look her over and yes if you stink it will follow you into your adult life.\n\nI'm not even talking about her romantic life though that will happen too but no one wants to hire someone who refuses to bathe.  \n\nThe fact that your parents themselves don't seem to care is worrisome.  If you were all in school I'd suggest talking to the school counselor and telling them your concerns and your fear for your sister's future.",
            "It's really not your place to be adressing your sisters hygiene and behaviour. As a sister a quiet prompt to use some mouthwash or something might be appropriate but you have done that and she had rejected your input.\nOutside of things that directly affect you, anything else COULD be seen as teasing as you are not her guardian (I'm assuming).\nYou need to speak about this to your parents and ask them to step in. I'd do that at a time when your sister  isn't around so she doesn't feel ganged up on. You can tell your  parents it means you are taking on the whole chore of looking after the dog pads so perhaps they can give your sister a different chore they can supervise OR make sure she does it on her day so you don't feel like you have to.\nIf the smell  is really bothering you and this can't be resolved, get some febreeze and give her room or the hall a quick spray.\n\nHaving said all that... is it possible your sister is depressed? People who are depressed often have trouble taking care of personal hygiene and general cleanliness",
            "Okay so I was in a very very similar situation with my brother. I am now 23, I moved out around a year ago because of this problem. My brother is autistic (I think, my parents refused to tell me his exact diagnosis, don't ask lol) but at the very least is severely learning impaired/socially impaired. He's 18 but acts more like a 14 year old. A big problem we've had with him is his hygiene. He's a big kid, super tall and pretty heavy, and a teenage boy. He would fake showering (turn the water on and not actually shower), not wash his hands, and not brush his teeth. He would smell sweaty/sour/unwashed and has rings of dirt around his neck. He also wouldn't change clothes and would not wash his sheets, at one point there was a huge black mark running the length of his bed on the wall just from his dirt rubbing on the paint, and when they moved his bed they found a mountain of trash and food wrappers he had been throwing under it. My parents have \"tried\" kind of, and this became a big point of contention in our relationship as I have ocd, and am also very sensitive to smells/certain sensory things like you. Hygiene and cleanliness/germs are a big trigger for me, so him sharing food without handwashing was a big issue. All I can say is, talk to your parents about it seriously, like an adult to an adult and share your concerns. I tried with my parents but it really just didn't work out. They claimed he was \"too old\" for them to do anything. Our relationship deteriorated to the point where I had to leave the house in one day because I couldn't take it anymore. But a year later I am in my own apartment that is clean and smells lovely. My relationship with my parents and brother are great now, because I can just leave whenever I need to. Hopefully you can work things out, but just be assured that it is not your job to work things out, so if it comes to the point where the best thing you can do for yourself and the other people around you is leave, then it's okay. Good luck, OP.",
            "This throws up flag of mental distress to me. I would encourage your parents to try to get her into a therapist, or to at least start talking about her mental health.",
            "I haven’t seen anyone else mention this, how is her mental health?\n\nDoes she seem to be suffering from depression? When I was a teenager I had awful depression and couldn’t handle taking good care of myself or of my room. My parents just nagged me and it only made me feel worse. \nI think addressing her mental state and perhaps taking her to a therapist or counselor will help get to the root of the problem.",
            "Self neglect....is an issue. If she wont listen to you or your mom. Idk if she has any close friends or other family members?",
            "Could it be medical? If not, you'll have to tell your parents. If that's doesn't work, sorry, but you'll just have to leave it alone. Teenagers don't like to listen. You were like that too, but you probably won't realize until you go to college.",
            "Is it covid safe where you are? If so invite your friends over and embarrass her into cleaning it. Give her a heads up and then let them tell her what they think of her hygiene. Honestly it can be better coming from someone else who they think their opinion holds more weight, more often than not it isn't family.",
            "Tough loving. Tell her that she seriously needs to wash her ass, that her hygiene is repulsive along with her room. No more playing it nice. Time to tell her how it is.",
            "I think this maybe a lession she'll have to learn and it'll probably be the hard way",
            "OP first thing is first you guys NEED to get her off that oozing mattress no ifs and or butts, because if she’s sleeping on that I can only assume it has got to be the first thing to go for her health and the smell. You also need to stop doing for her what she needs to be doing for herself you cannot allow her inaction to allow you to break on this (I understand about the whole sensory episode if I’m in public and someone is wearing an overly strong perfume, I get a massive migraine) but for now keep your door closed hang deodorizers. I have had to do with roommates in the past after their refusal to change habits as well after NUMEROUS talks. They only change after bringing home girls/friends, and they either changed or never brought people over again.\n\nIf I'm being completely honest, I think the best course of action as of right now is to go to your school counselor or some paid professional mediator and set up a shared meeting between you and her and potentially the rest of your family to discuss this because at that point she can't call it teasing it will be a safe environment for you to BOTH vent concerns and feelings and maybe figure out the route of the issue. I highly recommend that your mom attend because somehow, she has been able to ignore or coupe with what your sister has been doing and she needs a wakeup call too.",
            "Poor hygiene and wont clean her mess, it sounds like shes depressed. Maybe look into that first",
            ">Edit: I want to clarify that the dog is a chihuahua and her room isn’t like covered in poop or anything. It’s just that there are small areas where the dog will poop and she’ll just ignore it while she does something else. Also, she usually smells fine after she takes a bath, the problem usually rises when she gets out of her room in the morning until she bathes again (because we generally stay in the living room and hang out in the evenings so she doesn’t really go back in there).\n\nThis edit is not making this sound better. There's not really *any* volume of dog shit that's acceptable to have in your room.",
            "This girl needs therapy. IMMEDIATELY.\n\nAlso, how did she get through school before this? Like, if she's the smelly kid in the living room, how has she not had an incident in class? Kids are SUPER FUCKING MEAN in middle school, and I find it hard to believe nobody has said anything to her, and not a single staff member, including guidance, has pulled her aside.\n\nI bet if it happened, or the sent a notice to the parents, they have not confided it to you.\n\nYour parents should be very disturbed. They need to be made to understand they can be held responsible for this, in a case of CHILD NEGLECT, via CPS. \n\nStop cleaning up for her. Dollar stores have really good, cheap, aerosol air fresheners. Get some incense, and light it last before bed, in addition to spraying your room. It will ease you into sleep and you probably won't be aware of the smell until morning.\n\nThe smell on her and her belongings will eventually trigger a call from CPS once school starts again. Everyone will be super sensitive to the odor, being in an 'unfamiliar' environment after being home for so long. It's only a matter of time. You will also want to talk to whomever intervenes and explain that this has been an ongoing problem for years, and you cannot get anyone in the family to take it seriously, not her OR the parents, and that it's been acknowledged by everyone. \n\nHas in person school started for her yet?",
            "Call child protection services. You are forced into parentification, which is abuse. Your sister is raised to not take care of herself to an alarming grade. Your parents failed you both",
            "Wait\n\nPeople are supposed to brush their tongue?\n\nAsking for a friend obviously",
            "Call CPS, you can do this anonymously.  She and your Parents need a wake up call or this behavior on both sides will continue.  Living like this is not only disgusting but also dangerous to the other people living in the area.  Since this is not just affecting her but you and the rest of the family she needs to learn to keep it under control.  \n\nA less drastic move would be to suggest therapy for both your sister and your Parents.  She needs to hear from other people how her behavior is not ok, not healthy and will isolate her as she moves toward becoming an adult.",
            "Could your sister be suffering from depression or any other mental disorders? Depression can make it almost impossible to take care of yourself, likewise ADHD/ADD can make it really hard to get things done.",
            "It sounds like something else is going on with your sister, for instance, she could potentially be depressed. Nagging her because of your sensitive nose will accomplish nothing. Work with her and/or your parents to identify the root cause and help and the good hygiene habits will follow suit. No one truly wants to sit in a room in their filth and dog shit without something bigger going on.",
            "Pee in her room and show dominance~",
            "You should talk to your parents about having your sister see a therapist. Oftentimes quirks like these are symptoms of underlying traumas. For example, my cousin has always been a picky eater, all her life she only ate rice, spaghetti and fries. Now she’s talking to a therapist and she’s starting to try new foods.",
            "As a former teenager who didn't take good care of myself, it took getting away from the bullies who made fun of me no matter what I did for things to improve. I gave up trying to not get made fun of, and it took the life out of me for a lot of years.\n\nWhen I moved away from home twelve years ago, I had to learn how to like myself enough to care about my appearance and such. \n\nFor the chores, it sounds like the dog shouldn't be allowed in her room until she realizes what a health hazard she's creating for both the animal and herself.",
            "Hey OP, I've been in an almost identical situation and I'm sad to say that there's not much you can do. If your sister doesn't want to improve her hygiene, and you've had a very serious talk to her about it, there's not much you can do except ensuring she keeps her mess localised to her room.\n\n&#x200B;\n\nMost people would expect your Mom to be able to step in and do something, but I've had the same experience with my Mom being an enabler of this behavior. Sadly part of growing up is realising that you can't do anything about some people's behavior, even though it's frustrating because you think you're trying to help them. This might be disheartening, and probably not what you wanted to hear but sometimes you just have to accept it and focus on what you can do:\n\n* Making sure she keeps her mess to her room\n* If you experience overloads then try avoiding her before she's showered (or practice taking timeouts when you need them)\n* \"I’m going to college in a few months so I won’t be able to pick up after her and I don’t want this to keep going into her adult life\". Again, you're just going to have to accept that the only person who can break the habit is her, despite how hard you try if she doesn't care there's nothing you can do. Your sister is still young, there's plenty of time for her to change by herself. But even if she doesn't - it's unlikely you'll have to live with her again so you should just accept that's how she is and move on.\n\nI ended up moving out of Mum's house partially because of the bad hygiene as well as a bunch of other reasons. It was a great decision and being being able to live in a clean and tidy home is something a lot of people take for granted but I'm thankful for every day. You should look forward to being able to reclaim a clean home when you move - just make sure your roommates have similar habits to you!",
            "The answer is shame. \n\n\nIt’s not nice, it’s not fun. But you need to shame her. Because that is disgusting and if nobody sets her straight, she will be one of those disgusting hoarder cat ladies in 25 years.",
            "Can you drop her in an oil drum of clorox bleach? Otherwise she'll end up living in a homeless encampment and no one will notice.",
            "Apparently, I smelled bad when I was around that age, maybe a bit younger. My mom told me no one would want me to be their girlfriend if I smelled sour. That did it for me. I still have days when I don't shower, but when I have to go out in public you better believe I smell fresh as a damn daisy!\n\nAlso, and this may or may not be relevant, but I thought I'd throw it out there, just in case. Your sister may be dealing with something like ADHD, depression or something similar. Might be worth looking into. I wasn't diagnosed (ADHD) until much later in life, but it has made a huge difference for me. I wish I had known when I was still young.",
            "She should get evaluated for ADHD",
            "Make a big INTERVENTION sign for her in her room and explain why it's bad to have poo in the room. It might work, or it will make you the bad sister if she takes any offense. \n\n\nYou need some prep work:\n\n\n Make sure the poo stays there for a while like 1-2 days. Make sure tour room is clean and smells nice. Show hwr your room. Stay and talk about something for like 15 minutes and once her nose has adjusted to the clean air take her to her room.. \n\n\nI have to say that with four dogs the house will have its own doggy aroma. Like if the room of your parents is a bit smelly don't expect your sister to be any different about it.",
            "You could house train the dog......",
            "You have to break through the teasing deflection. You need to raise your voice and say “I am NOT joking. You smell horrible. Your room is disgusting. No boy will ever date you, no person will ever be your friend if you continue this behavior.”",
            "Maybe if your whole family doesn’t care then you should just let it go. Let them live the way they want, you will soon be off to college anyway. It’s an important part of growing up to accept that you just cannot change people if they don’t want to change.",
            "She might have tonsils stones",
            "Are there any other adults you can use as resources in approaching this situation? Is there a social worker in her school or a youth advice center? Are you in the US? \nThere is something going on in her life that needs addressing. She needs professional, psychological support. \nAlso, the poor dog. Why is she allowed to keep the dog in her room if she is not caring for it properly? It definitely would create a conflict but seems like a fair line to draw. Maybe this is an angle you could take to reduce the smell and your quality of living until you are able to move away.",
            "I think this is called neglect. Your sister deserves help for what she’s going through. Why the hell is this normalized. It’s not your job to handle this but she’s lucky that she has you to even notice her.",
            "Write her a letter, with everything you've written here. Tell her you're worried about her health and her future. \nVery best of luck with your sister and college!",
            "Stop cleaning up after her stop going on at her , your her sister not her parent if your mum won’t parent her it’s not your job to do it leave them both to deal with the filth",
            "Sounds to me like your parents have failed you both. You cannot fix their problems.  You're moving out soon, my advice, don't ever move back.",
            "I went thru this with my step sister. I was 1.5 years older than her/a grade a head of her. She was that way due to her mom. Her mom was OCD about her own hygiene, and a petite person. My step sister was the complete opposite - only showered after her mom/my dad got onto her, never cleaned her room, never brushed her teeth, & would hoard food in her room. Her room smelled disgusting! I hated visiting my dad's on the weekend & would stay at my grandparents house whenever I could. I remember they had a house built & being so excited about getting my own room. Unfortunately, it wasn't long before her room was back to being a smelly pig pen! My grandma would buy me those plug ins from Bath & Body, as my room was right next door & I was scared my room would start to stink. We tried talking to her about smelling. All my friends made fun of her, so her mom hated my friends & they were never allowed over. My dad & her mom would eventually get fed up & clean her room, yet it would go right back to being gross. They would get on her ass about showering; her mom would even smell her hair afterwards to make sure she showered. We all went to Florida but my dad stayed home for work. He tore her room apart while we were gone bc he was tired of the smell & this is what he found...\n\n*WARNING: VILE INFO FOLLOWS*\n\nMy step sister had been shoving her used underwear all into her top dresser drawer. She would shower, but apparently would put her underwear back on until God knows when - then she would just shove it into her top drawer. I'm telling you, it was the most disgusting thing I've ever seen! I didn't even know underwear could turn that color! So even though she had been showering, she would just put on dirty underwear; we think she would just put a little bit of soap in her hair, but not really scrub her scalp or anything. She was just extremely lazy and I guess did not care.  Our grandparents bought us both new bedroom furniture sets, for our new bedrooms - she had been hiding food under her mattress & in this like small cubby that was built into her bed. There was even grease stains from chips and stuff, on her bed!\n\nMy dad ended up divorcing her mom, about a year later. So I didn't have to continue dealing with her. My half sister tells me things about her sometimes, as we share the same dad & she shares the same mom with her. She never ended up changing. Her hygiene is still the same. She's even had 3 kids with 3 different guys, plus a few abortions. I don't know how she even got a boyfriend, but the \"boys\" aren't exactly winners either. They are just as gross as her. She actually had her rights terminated thru the state bc her boyfriend beat her unconscious & held her oldest son hostage one night while the cops were trying to arrest him. CPS found out that she was living with him & ended up filing TPR. It's pretty sad, as they were all homed separately. Her teeth are like a green/black color, covered in a fuzzy substance. They look rotten. She's about 31 years old now & it's been a few years since my sister has even seen her - so she may even have lost some teeth by now. \n\nYou can't change your sister. The person who said you're enabling her, is completely right. Your parents can only do so much, too. Maybe she will change down the road? I'd just keep your distance. Maybe she will eventually miss you hanging out with her & realize that you weren't just joking with her.",
            "Straight neglect from the parents. I believe I live similarly, clean, to the sister. I have a little dog who used a pad in my room, I also have a rat cage, and 2 fish tanks. Difference being I keep everything clean. Ignoring stench and dental health is straight up abnormal - as after getting a toothpaste I liked I hate the texture of plaque or gunk on my teeth after a long day. \n\nI think its self neglect and parental neglect. Buildup of waste creates a chemical called ammonia which can cause lung damage over long periods of time, or severe damage if exposed to a strong amount of the odor. It's not only damaging for herself but her dog too.. if she cant have a mature discussion on the matter or with your parents, the best bet is to tell her its affect on her future and those around her.\n\n\nThings that matter to her like... if she really cares for her dog, she needs to clean it up. If she wants a future lover, she needs to clean it up. Bring up what matters to her, and have a conversation.",
            "Don't worry about it,  she will notice when people start avoiding her. I had a classmate like this in collage and everybody was trying not to smell him or talk to him (because his breath really smelled bad),  nobody said anything to him because it's an uncomfortable topic but he noticed and stated to take care of himself",
            "Your mom has completely dropped the ball and is failing your sister. That mattress is not sanitary and must be replaced with a brand new one and she needs new bedding. If her room is carpet replace that as well. YOUR MOM needs to deep clean her bedroom so your sister can start fresh and your mom needs to check that she keeps it clean. And your mom needs to check that your sisters hygiene is where it should be. \n\nAnd the dog is not housebroken and should not have run of the house. He needs a crate and needs to be crate trained. Thats fine if he prefers to sleep in your sisters room with her but his little butt will be in a little bed in a crate. That is disgusting to have an inside dog pooping and peeing inside your house. No one should ever live like that. \n\nYou have to remember you are her sister. And you are being a really good sister. But these problems need to fall on your parents. Your only 17 and your getting ready to go to college. If you are not seeing any changes when its time for you to leave or it gets worse call CPS and report it. Maybe that will give them the wake- up call they need.",
            "Looks like parental neglect where you are the responsible adult in the family dynamic. \n\nIt is not your job to parent your sibling, as much as it seems the right thing to do. That only enables the real parents to keep neglecting AND take pride in the fact they have such a grown up, clever older child. The more you step up to do their jobs, the more they will pat themselves on the back for raising a kid to do their job for them.\n\nDo not have your sister move in with you when you go to college. You are not her mother, nor her legal guardian. You’ve still got so much of your own living and growing to do.\n\nDon’t make the same mistake I made, thinking it was my only option to make sure my little sister was ok. I was 20 and was no way mature enough to deal with a teenager.",
            "Just be straight up honest with her. No one wants a sister that smells like shit. Sometimes they just need a slap in the face of reality",
            "Deppressed people are ignorrant",
            "If a girl is smelling really bad that's a yeast infection in her vagina. It needs an immediate medical attention. \n\nAlso it could be a bacterial infection from poor hygiene. Girls should always wipe their ass backwards not forward because poop could be deposited in the vagina and it could culture the bacterial growth in the wet warm vaginal cavities.\n\nGirls especially should change the underwear more often but if they can they should stay away from wearing underwear all together to let vagina to breathe.\nThongs, tight pants are the worst.\nWear only cotton absorbing material undies.\n\nYour sister should start drinking lots of water. She should stop drinking sugarly drinks or anything acidic.\n\nPlease don't embarrass your sister, but let her take care of it before it ruins her reproductive organs permanently.\n\nAm a single Dad with a 15 years teen. Learn from experience.",
            "My siblings had such bad ADHD and didn’t bathe or clean for weeks.  Finally I found a method that worked with them and that was using role play or incentives for them to be interested in the story or chore.  To be honest, they hate caring for themselves.  However, I know that isn’t their fault because of their naturally low dopamine level by having ADHD.  \n\nUsing activities, incentives, sticker chart, etc. will help.  Try cleaning with them! That helps so much when my little sister lets me tell her what to do and we clean together.  She’s really good when someone else is there.",
            "Please please please get the room cleaned. You have no idea the amount of bad bacteria including e coli thay could be resent from the feces\nI watched a dog trainer not long ago and a girl has the same, small dog pooping and peeping all over her room and it not being cleaned.\nThe bacteria results that can back from the lab were crazy and so so dangerous",
            "Honestly sounds like she is dealing with something internally. I was the same. Exact same as ur sister. I was dealing with depression and my room always mirrored my feelings. Yes it could be that she is only lazy but please try and talk to her, offer help and be sensitive and don't pressure her. \n\nGood luck",
            "For bad breath, I find that flossing in addition to brushing your teeth is important. Flossing gets those putrid little bits of food that smell bad out. I don't even know if brushing your tongue is all that important.",
            "Sit her down and tell her she is a disgusting human being. Gentle words don't work with her. Hopefully this one will wake her up.",
            "Unfortunately the surest way for people to learn things isn't to be told, but to suffer the consequences themselves, and decide to change or not. She'll get to the point where it effects her social life, friends, lovers, etc., and she will either decide to make a change, or not.",
            "I have a sister like this. By Im 26f and she is 24.once she caught an infection under her armpit that was so big that laying down her arm sat up at a angle instead of parallel to her body. We had to puncture it and press out all the putrid pus(it was alot about 8oz). She doesn't have insurance so I tried to drill in her that her hygiene plays a role in her health. She does nothing but stay at home as she works from home. But even before COVID, she was like this. She would go to work hair unwashed with dog and cat hair in it.(she never detangle or brushed it) she would put a scarf over her head and that's it. She wouldn't bathe for weeks. Her room smelled of her. Although the room stayed clean(clean room but dirty person?), her actually body permeated the space. That's also meant that it permeated the entire space around her wherever she went.\n\n We had many talks about it and she would simply shut down as you lecture her. she had no actual reasons for why she did that with her health. We ask if someone touched her and as a response she stopped bathing herself. She said no. We asked is there anything that is emotionally causing her problems, she said no. My sister is the definition of introverted. So she home all the time. Not interested in relationships or anything she might be asexual. So I never say anything about being with someone smelling like that. It would have negate what I was trying to instill in her. She never got like this until she became an adult.\n\nOnly after the infection under armpit did she start to bathe on a regular. She still from occasion not bathe for 2-3 days and won't wash her hair for a month or two but the maintenance had gotten better. I rarely smell her anymore. But I'm comfortable enough to tell her to bathe or wash her hair. There is no offense in it. Her health is serious tell her in a serious conversation. Sit her down and talk about it. Good luck.",
            "She's leaving poo in her room for days? Sounds like she needs to speak to a mental health professional\n\nBut given how little your parents care she could just be that slovenly",
            ">I try to tell her that she needs to wash her sheets and keep her room clean, but she just does the whole “no you” routine because she thinks I’m teasing her.\n\nOP, she doesn't think you're teasing her, she is teasing you with the whole \"no you\", as in \"no you do it\" routine because she **knows** that you'll eventually do it for her! You need to stop cleaning her room for her; you are unwittingly continuing/perpetuating the babying that your mother does. I know it will be hard because of your sensory issues, but the cycle will not stop until **you** stop it. Your mother will eventually reach her breaking point. Your sister may even reach her breaking point when a boy she likes at school makes fun of her for her stink.",
            "Her having good hygiene is an important skill to have, but usually the lack of it tells about a deeper problem than just her being lazy. Sure teenagers were messy, but from my experience the state of ones room and lack of hygiene is a reflection on their mental health. Do you know if she's being bullied? Struggling with school? Does she have friends? Does she have anyone close that she opens up to? \n\nI'd keep a close eye on her situation and if she needs professional help.",
            "Did someone there consider cheching her sensitive sense of smell with a doctor? She may not feel the smell of the poop, which may explain why she isn't bother at all (aka \"not observing\" it)...",
            "This isn’t “bad hygiene,” this is bad mental health. These are fairly in the nose examples of someone who needs help.",
            "Have you considered she might have some sort of autism? And that it's not a hygiene issue but a kognative disability?",
            "Where are your parents in this?! Sounds like you are being her mom (not in a bad way). What parent lets poop be uncleaned in her child’s bedroom for days?? Your sister did not wash her sheets at 15? I may have been babied too much but I never washed my sheets myself that age. My mom would give me the new bedding to put on it. But she made sure they were washed. This sounds like child neglect to me. It’s also unhealthy that you have to check whether her sheets are washed or not. Even more so that you can actually notice that they are not for a long time.\n\nHow is your sister doing mentally? Sounds like she has given up. I could imagine her being overwhelmed. Because it is a lot to deal with being a teenager already, now being a teenager during covid. And in her case, be responsible for things that parents are for.",
            "People have been asking about depression and other causes of why your sister doesn't care about the smell... Can your sister smell at all or is it possible that her sense of smell is impaired?\n\nMaybe a small lego piece or other toy / figurine got stuck up her nose as a small child and has never been removed or she has lost it or has it impaired for a different reason for a longer time.",
            "You state that your mom babied her but it also sounds like you are doing the same. Your doing her chores, cleaning for her etc. I would stop babying her and hope she gets that living like that is gross. Maybe when you tell her to brush her teeth or something get more serious/mad so she knows your not playing around",
            "Obviously talk to your parents, but if your sister keeps dismissing your concerns as teasing, I think you need to be far more serious when you address this. Use the language you use in this thread-- you're moving to college in a few months and worried about her developing habits that will seriously impair her adult life. Like actually put aside time and have a serious talk with her, not necessarily just in reaction to something gross she does.\n\nYou'll rock the boat this way, but I think it's important it comes from you, as opposed to her having a future roommate or friend saying it first. Tell her that mom is sheltering her from reality and that you don't want her to have habits that will embarrass her in front of other people. That these are not normal habits and your parents are failing as parents in correcting this. Ask her how she would feel if she had friends come over and attempt to hide their disgust when they smell her or her room.\n\nThey're harsh points, but they need to be said.",
            "sometimes people won't take care of themselves because they're struggling with depression or other issues. maybe try talking to her about that, ask her if there's another reason she can't find the will power to clean up herself or her space. If she is feeling this way, she may need to talk to a therapist or counselor.\n\nBut also; it isn't your responsibility to take care of her to this degree. Don't get down on yourself or feel like you need to do these basic things for her. You have your own life to live, and you're going to  be dealing with a lot of change in the next few years. Don't try to be her parent, you're her sister.",
            "The dogs need to be rehomed. My god.",
            "You could have your parents take everything out of her room. They could clean the room that one time and then they could force her to pick out a few clothes for the week but before she gets other clothes she has to give the first set back fully clean. I saw a video of a mother doing it and it seemed the really help. Sad to say but have your parents force her to bath before they give her her phone for the night.",
            "Honestly, super poor hygiene habits like this set off “abuse/trauma” sirens for me.\n\nLike.. having a mattress *that* filthy? That’s far beyond the mess from any sort of “normal” use, and sounds more like the result of someone making themselves “filthy” for a reason.",
            "Honestly your sister sounds like she has a developmental disorder - this is NOT normal behavior. Most humans find the stench of urine and feces abhorrent and will keep it away from their living spaces - on a primal level, the instinct to avoid filth is pretty deeply engrained to prevent disease and decay. \n\nEven if the dog is a chihuahua - there is no reason to justify it eliminating in the house on a regular basis; does she have a physical disability that prevents her from walking the dog? If so, can anyone help her or does she have any mobility aids? Is the dog still a puppy and needing training pads, or has not walking the dog regularly gone on for so long that the dog has simply been trained to go inside instead of outside? I would encourage your mom to tell your sister that the dog cannot stay if she won’t clean up after it; that might get her to change her behavior if only in relation to the dog. Also - the mattress should have a waterproof mattress protector on it too...\n\nDoes your sister act immaturely or incapable in other areas of her life as well? Does she have any friends? Have other people outside the family noticed and/or commented on her smell or lack of hygiene? Has she been teased or bullied for it? Was she home schooled? Is it possible your mother is enabling her because she doesn’t actually believe she can do better? Does your mother also notice the smell? \n\nI ask all this because a family member of mine has a developmental disorder and he just ignores filth to the point that his bathroom gets so disgusting that you would never want to use it, let alone clean it for him.\n\nI don’t mean to sound insensitive but there’s not much you can do short of getting her a diagnoses and/or taking her to some life skill teaching courses. Other than that, it’s not your responsibility and you can’t force anyone to do anything. I would just focus on going to college as soon as possible and doing well so you can afford your own place and never need to live with her/smell her room again."
        ]
    },
    {
        "post_id": "4dmdc2",
        "author": "MarriedABaby",
        "title": "I (33F) went to sleep a year ago with my wonderful new husband (40M). I woke up next to a stranger in his body. I can't be two people.",
        "url": "https://www.reddit.com/r/relationships/comments/4dmdc2/i_33f_went_to_sleep_a_year_ago_with_my_wonderful/",
        "score": 3029,
        "num_comments": 769,
        "created_utc": 1459958330.0,
        "selftext": "Reddit, please help me. I'm at my wits end.\n\nThis is going to read like \"we see what we want to see\" but I assure you that's not the case. My husband and I have been married a bit over a year, we were together for 4 before that. Not long distance, normal relarionship, moved in together at around the 2 year mark.\n\nHe was damn close to perfect. Really he was. Even after the honeymoon phase wore off, damn close to perfect. \n\nHere's the guy I married:\n\nAttentive, sensual and comfortable with his sexuality, brave, honorable, honest, communicated well, respectfully told me when he took issue with something I had done and accepted criticism gracefully when I was upset with him, then we worked out the issue together and it STAYED fixed. A great mix of social and alone time - he didn't want to go out to much or stay in too much which was great for me because I'm very introverted with a touch of social anxiety. Nothing too bad, I'm just one of those people who never wants to go out.... then has a blast when I get there. He had a great job and goals and we were planning a great future. He was supportive of my career development (I was a late starter, went to college late). He was proud of me and always walked around like a preening peacock with me in public. We were That Couple, guys. \n\nHis ONLY faults were that he sometimes did what his mother wanted, even when it was more than a little unreasonable, but we set some boundaries with her and that got better, and he could be a little scatterbrained/inconsiderate in the way of he wouldn't ASK me about plans, he would TELL me the day before. I fixed that one by saying he was welcome to go alone, but if I made other plans and he hadn't told me, I was sticking with my other plans. \n\nThose are pretty minor things in the grand scheme of things.\n\nAll out friends told me I finally got it right, half of them would have happily dated him if we broke up. Not in a creepy way, just a \"You're super lucky, he's awesome, I've always had a little crush on him\" way.\n\nAnd then we got married.\n\nI have no ue who this man is anymore.\n\nWe nearly never have sex. He acts like he's asexual. Before, it was sexts and jumping me as soon as I walked in the door. Now its one position, with the lights off, once every 2 or 3 weeks. It's like he's self conscious and afraid of sex now. He stopped communicating. He hates everything about me. I'm Buddhist, he's agnostic, but he used to be interested in what I had to say about my beliefs. Very interested. I never tried to convert him, it's just a part of my life I value. He used to love intellectual and philosphical discussions about Buddhism, now he just tunes out or says \"ok\". That's his go to for anything. My needs, my thoughts, my feelings, my concerns, my likes and dislikes are all met with \"ok\". \n\nWe never go out anymore. I mean NEVER. I still sometimes go to events with friends, he isn't interested. \n\nHe quit his job without telling me because he \"hated it\" and took a job as a delivery driver for Amazon. This was like a $40k yr PAY CUT. There is no money for the training and class I need for my career. But yet he finds money for his collectibles and whatever he wants. If I ask, he says it's my problem. I need to fund my own advancement. Which would be right, to a point, except it would advance US. And he HAD been helping. He had agreed to continue to.\n\nHe does nothing around the house anymore. I was away for 4 days and came home to find stale food in the cat's dishes that had sat there since I left and they had no water. The younger is half Siamese and he was yowling anf going stir crazy because he hadn't been played with. He used to adore those cats and snuggle and play with them all the time. No laundry was done. There was a sink full of dishes. \n\nThe mommy issue is back. She says jump and he asks how high. Period. He spends entire days with her morning to night for days in a row. She has no health issues, this isn't a caregiver situation. When I've talked to him about it he says I don't \"understand\" what it's like to have family (I'm NC with my abusive mother, my father passed when I was 11, I have a brother who lives in another country). It feels personal. Like he rubs my nose in his family.\n\nHe's no longer a gentlemen. He no longer has my back and stands up for me. We have jerkwad neighbors who leave crap in our yard, are loud and obnoxious, and just generally assholes. One day I got in an argument with one of them because they were having a party and PARKING IN OUR DRIVEWAY and where my BF would have shown a united front, my HUSBAND told me to \"stop being hormonal\", looked at the neighbor and said \"You know how women are\" and HAD A BEER with him.\n\nReddit, I don't know this guy and I don't like him. Is this who he really is? I LIVED with him for 2 years and saw none of this. I wouldn't have married this asshole. He makes me feel like shit about myself and like I'm less than. I feel like I have a bratty teenager and not a husband. \n\nBut yet I saw nearly none of this. Like I said, just 2 minor issues. He was amazing. And now that I'm married to him I don't know him. Can someone really fake a personality 24/7 for 2 years? So well that none of their true self bleeds through? I don't want to spend my life with someone who hates me and everything about me, who is either zoned in front of the computer or at moms, who acts like I'm dipped in shit when I try to touch him. I wouldn't have married that guy. I thought I married an adult partner.\n\ntl;dr Husband did a total 180 after wedding. Why? What do I do?",
        "permalink": "/r/relationships/comments/4dmdc2/i_33f_went_to_sleep_a_year_ago_with_my_wonderful/",
        "comments": [
            "It sounds like he's either suffering from depression or did the bait-n-switch. Either way, I think you should two-card him. Tell him you're absolutely miserable and confused in this relationship and you're either calling a marriage counselor or a divorce lawyer, but something has to give.",
            "None of his changes even seem to benefit him. A lower paying job? Not going out? Not having sex? It's not like you said he changed and now he travels the world without you or something else where at least he's benefitting. Maybe it's something medical like a brain tumor or something. Maybe this is what his parents' marriage was like and he thinks he should be this way because of how they were? I'm very confused for you.",
            "Honestly, it sounds like your husband is suffering from depression or some other similar mental disease. Has he been to a doctor at all about this major change in personality?",
            "Oh god, I fell for this too. I was with someone for years, and while we had issues, he was an all around great guy. We get married and *bam!* he's a whole different person.\n\nThere are a few reasons this change happened:\n\n1. He's depressed - if this is the case, this change should be temporary and therapy would help. However, it's only going to work if he's willing. \n\n2. He faked it - your relationship was a complete lie up until the point that you got married. Once you were legally tied to each other, he stopped having to pretend to be interested, because he assumes you are stuck with him forever. \n\nSadly, my situation was an \"option 2\" where the moment we signed our marriage certificate, he dropped the act. \n\nMy recommendation would be to:\n\n1. Talk to him about the change and suss out if perhaps it is a depression issue\n\n2. Ask him to attend marriage counseling with you\n\nHowever, if he refuses counseling, or it becomes apparent that he is really just a jerk, then get out as quickly as possible. If you're stuck with an \"option 2\" guy, I can promise you it's only going to get worse. ",
            ">One day I got in an argument with one of them because they were having a party and PARKING IN OUR DRIVEWAY and where my BF would have shown a united front, my HUSBAND told me to \"stop being hormonal\", looked at the neighbor and said \"You know how women are\" and HAD A BEER with him.\n\nwhat the fuck.",
            "I've seen a lot of people positing possible reasons why he's changed like this, but the bottom line to me is that it doesn't matter--you're fucking miserable and have reached a breaking point.\n\nI'd honestly show him this post, and let him know that it all needs to change or you're going to walk. If he's operating on the assumption that marriage has \"trapped\" you with him, this'll dissolve that notion nicely. I wouldn't even try counselling. He knows how to treat you well, he's chosen not to do it. It's ultimatum time. Oh, and if you do this, you must follow through if he doesn't turn things around. ",
            "The big thing that sticks out for me is the job change. Are you sure he quit? My money says he got fired for something he won't discuss. Taking a job like a delivery driver after a much higher pay job does not say \"I just quit because I didn't like my job.\" It says \"I can't use that job on my resume now so I have to aim low.\"\n\n\nMaybe getting fired caused some of the behaviors you are seeing? He may be lashing out at you for not feeling supported in this issue he isn't discussing. (Yes, some people think you are supposed to just know when they need you.) \n\n\nYour relationship was good without conflicts. You should try talking to him about what made him \"quit\" a good paying job. Him getting upset when you mention not being able to pay for school could be a poor reaction to guilt. \n\n\nHe is running to his mom because she is his comfort zone in his depression. Open up, don't run for divorce. The dude is going through some shit and likely trying to \"be a man\" about it. ",
            "[deleted]",
            "The sex is the key here. It is difficult to fake a high libido for four years and then have it decrease so drastically without an underlying problem. As someone in the mental health profession I highly suggest you consider that he be depressed which may be caused by a testosterone deficiency. All of the signs are there, a hormone imbalance really can effect you emotionally and behaviorally. I would really recommend you get his hormones checked and to see an endocrinologist if you can. Wish you the best, hang in there. ",
            "This text-book happened to me. Turns out my gonads turned off and my adrenals fatigued to the point where they turned off too. My entire personality changed and I started making very odd decisions, treating people poorly, and I stayed inside and slept 20 hours a day (sometimes more)\n\nSometimes it's a mental problem, secondary to a serious physical/chemical/biological problem.",
            "OP, I have depression. I've seen depression. I'm going through a massive depressive phase as I type this. And I STRONGLY disagree with everybody calling \"depressed\" here. Depression can do a lot of things, but this is a complete and utter shift in his personality, especially seemingly overnight. Depression hits fast, sure, but you see signs prior to: moments of lethargy or anger that he otherwise couldn't explain, periods where he'd be sad or touchy or moody for no reason, SOMETHING. A personality shift this severe probably have a root cause somewhere else--some other ailment that's causing these symptoms. Some folks have said brain tumor. I'd drag his ass to a doctor. Whatever happens, I'm hoping ti works out for you both, somehow. ",
            "How much does he drink? Check around the house for hidden liquor bottles. Check the trash. \n\nThis sounds a lot like hidden substance abuse to me. More than depression. He takes the neighbor's side in that argument, even making a comment about women? Why... because he was just looking forward to that beer. Everything else in the moment could be brushed aside. \n\nThis might not be it, but it seems plausible. ",
            "This crops up in this sub a lot. A poster describes a situation in which they have a wonderful partner who changes after some sort of huge commitment has been made. A commitment like marriage, engagement, pregnancy, birth of a child, signing a lease/buying a house, moving a great distance, etc. Presumably, the SO who changes was probably always a bad person, but waited until they had the poster in a position in which they were firmly committed.\n\nThis is absolutely a thing that happens. You aren't crazy or over-reacting. Please take care of yourself. ",
            ">Can someone really fake a personality 24/7 for 2 years? So well that none of their true self bleeds through? \n\nYes. Happens All the time. And it stops hours after the wedding.\n\nSorry for your loss. Bail, this will not improve.",
            "I know a guy whose a racist, angry pervert who thinks women are trash. To his wife he is the sweetest guy, who doesn't cuss and acts like a total gentleman.  It's like she doesn't even know him. She doesn't know the real guy. It's an act. And he's never dropped his guard with her in years. It's SO creepy.",
            "Are you *sure* he's \"at his mom's\" all day every day for days in a row? ",
            "I don't have any advice about your husband but PLEASE don't leave him in charge of your cats again if you're away! ",
            "Personally, I don't think this is depression. Sure, he may not resolving some issues he has, but I wouldn't call the white coats just yet. I mean, why would everything be pretty decent and then he spirals out of control down the depression tubes? Has he gone through something traumatic?\nI've dated my fair share of 40-something men. I see a lot of this 'lazy asshole' syndrome in them. Coincidence? I'm not sure. Don't get me wrong, I've dated some great guys, too. But I've also had boyfriends go from 'superb gentlemen' to 'sexless negative nancies' within a matter of weeks. It's complacency. They're angry at themselves and blaming you for something. It's lazy assholeness. The shit your husband says and does to you is rude. It doesn't mean necessarily that he has a brain tumor or hard core depression. Many depressed people I know, myself included, don't change their entire persona and target one person to be the center of shit in their lives. He's just lazy and rude now. He bait and switched you. It's that malaise I see a lot of men get (not every one, mind you, but I see this a lot). He's not treating you right, end of story. Who cares why. He just is.",
            "Sounds like you fell for a classic two face. Marriage counseling should be mandatory. Immediately. If he refuses, you need to bail before you get knocked up and drag kids into this garbage fire. Shit happens. ",
            "> Can someone really fake a personality 24/7 for 2 years?\n\nYEs, my ex faked it for 2 years until we got engaged.  \n\n>  So well that none of their true self bleeds through?\n\nIt does bleed through, but since we love them we put it down to a \"bad day\" because everyone has those.\n\nSome people are pointing to signs of depression, and it could be, but as someone who lived with an abuser who did the bait-and-switch, and as someone who had 9 years of depression, I don't think it's depression.  Some of the actions you listed are too pointedly barbed and intended to hurt...too calculating.  Like telling you to stop being hormonal and having a beer with the neighbour who was cussing you out.  That's not depression, that's deliberately putting you down for being a woman and deliberately rubbing it in your face that he was siding with the neighbour.\n\nI think you need to issue the \"counselling NOW\" ultimatum.  I'm actually scared for you, because this could easily turn physical.",
            "How does his dad treat his mom? It might be his internalized \"role\" of what a husband is that's messing him up. ",
            "No one has mentioned personality disorders.  The fact that this is a sudden development right after marriage is a clue.\n\nSeveral personality disorders (psychopath, borderline) manifest in relationships as \"I love you/I hate you.\"  They alternate between the \"attraction phase\" of a relationship and a \"rejection phase.\"  \n\nIn the attraction phase everything is wonderful, they are on their best behavior, they are trying to draw you in.  In the rejection phase they have succeeded at drawing you in and they are feeling secure (marriage), and so the rejection phase begins.  This will continue until you've had enough and begin to move away.  This triggers a return to the attraction phase.  The cycle repeats until you leave.\n\nIf I'm right, he will become that loving man again as soon as you file for divorce.",
            "Divorce. And quadruple up on birth control meanwhile.\n\nPeople will say marriage counseling. You are welcome to try it. My issue with it would be, say it works and your boyfriend is back and married to you, and doesn't think you are poop. Yay! Would you *ever*, even 20 years later, be able to go to sleep next to him without worrying who you will wake up next to? I wouldn't. I'd be waiting for the other shoe to fall. You are 33. He is 40. That might mean 50 more years together. 50 years is an awful long time to walk on eggshells waiting for the other shoe to drop and never being certain where you stand in your relationship.\n\nBut if still have some feelings for that other guy and want to give him a fair chance, you can try counseling to find out what happened. I can't image an explanation that would make sense to me, but if there is one and it makes sense to you, you can go from there. Without a *reason* for the personality switch, and a *reason* why it will never happen again, you cannot continue this relationship.",
            "Hidden in some comments below is the suggestion that Traumatic Brain Injury could cause these symptoms. The timing is definitely suspect, but if (and this is a big if) he could have been hit in the head, gotten in a car accident, etc... around the time of your wedding that would be something to consider. Additionally, if he has any history of concussion, minor impacts that would not normally cause symptoms can cause re-injury. I tend to agree with the other posters that depression or something else is more likely, but just in case.\n\nI've had two concussions and for me they temporarily (1-2 months) caused some pretty severe changes, including depression, anxiety, lack of motivation, nausea, headaches, memory problems, etc... For some people, these changes are much more permanent. With the second one, I never would have known the issues were from a concussion had I not been to the doctor for the first one, because the impact was so minor. \n\n",
            "Sorry if this has already been suggested ... early onset dementia crossed my mind. A few people start losing their faculties tragically young, and the uncharacteristically mean, sexist comment to the neighbor *MIGHT*be a sign of personality change. Some people do get mean, rude, foul-mouthed, etc. Call his doctor and describe EVERYTHING. Something mmight be up neurologically.",
            "[deleted]",
            "IMO he was playing a role, had to think through the \"correct\" response to everything, and now got lazy and complacent. This is the real him. You don't need a bunch of excuses to get a divorce - be happy it wasn't a horrible event like cheating or beating, and move on. Good luck!",
            "I would show him this post, honestly. ",
            "Hypothyroidism. seriously. \n\nLook it up and look at the testing controversy. Severely undiagnosed and rarely suspected in men. ",
            "Have you spoken to his mother? It seems that if he's spending so much time with her - she should know. She may even be encouraging this behavior. ",
            "No one here can diagnose him. But it sounds like he is depressed.",
            "Nobody wakes up clinically depressed. There had to be warning signs or an underlying condition that led to this. Stroke is a possibility but if he is not interested in treatment there is nothing you can do.  \n\n There is no benefit to staying with a guy who has turned to the dark side and would let your cats go days without water. Take the cats and leave.  File your papers and move on. He's got his Mommy and I'm sure they will be happy together. ",
            "Could it be that he was actually fired and didnt choose to quite his job?\nSeems pretty insane for a guy to drop his salary by 40k to drive a delivery truck. I mean, it's not like he left it to chase a dream, he took a job that basically has 0 requirments.\n\n\nMy hunch tells me he got fired, felt too ashamed to tell you and just couldnt handle the feeling of being a disappointment in some way. Kinda fits in with the whole mommy-issues he has going on.\n\n\nSit him down for a talk, and I'd honestly start at the day he \"left his job\" and what the hell actually happend. Hope this helps.",
            "I'm gonna go out on a limb and say mommy has a role here. Not sure what you should do about it but in my experience letting a parent back in previous to a meltdown leads back to the parent.",
            "Whatever the reason for his behavior change - he's got a mental illness, he's a liar, he's got a big secret he's not telling you, anything at all - what matters is **he is not a fulfilling partner to you** and hasn't been for some time. That means something has to change.\n\nTell him you are unhappy in your marriage. Tell him you feel neglected and ignored, you feel left out of major life decisions, you feel sexually unsatisfied and you feel like he's changed. Ask him if he sees these things, as well. Whether he does or doesn't, tell him you want to work these issues out in marital counseling, and if he's unwilling to do that, then you'll be looking at divorcing him.",
            "Honestly I feel like a divorce is called for regardless of the cause.  People say \"depression this\" and \"mental illness that\". So what?  This is who he is now. A mental illness doesnt give you a total free-pass on terrible decision making.  It doesnt mean you, OP, should stay with him, miserably, indefinitely.\n\n",
            ">Can someone really fake a personality 24/7 for 2 years?\n\nYes, absolutely. Two years really isn't much time. This seems like an extreme situation so I'd want him to get evaluated by professionals (a physical exam as well as a psychological one) but honestly... that story about his interaction with your asshole neighbor makes me highly doubt this is depression. It sounds like he's an asshat who somehow managed to hide his true self from you for a long time. Depression (which would explain his loss of libido, decreased social life, etc) doesn't make you say things like \"stop being hormonal\" (!!) to your wife and then having a beer with her bully. ",
            "Oh hey, I was married to this guy. It was all a act. As soon as we signed the papers it was like the real him showed up. He became a jerk, told everyone I was insane if I got angry with him over some of the stuff you complain about etc.\n\nLike your husband to everyone else he was perfect, but they never saw the Mr. Hyde I lived with. Some people are like that. He used to brag about how cleaver he was, and how he could get away with messing with people and making them see something that wasnt there. In short, he got off mind fucking people.\n\nThis is what I see here. He gets a kick out of messing with you. He was never a good guy to start with, he played the long game, now he is enjoying treating you like crap just to see how far he can push it.\n\nIf you want to stay with him, tell him therapy now, no excuses, no delays, otherwise its your lawyer with no delay. I bet you if you bring up divorce because of his actions, its either gonna be your fault, or his mother told him so. \n\nAnd batten down the hatches, because he is going to try to take you in the divorce, once these peoples masks get stripped off and they dont need to be \"nice\" anymore they become the most horrific people to deal with. Prepare yourself.",
            "How soon after the wedding did he change? Was an immediate change or did things happen bit by bit?",
            "If he pretty much changed right after getting married...I hate to say it but he might have just stopped caring once he got the end prize. It really seems the most logical. I know it's not easy but you really have to stand up for yourself on this one, confront him about all these issues. Someone already said to tell him it's either a counselor or a lawyer, and I couldn't agree more. I'm so sorry you're going through this, best of luck. ",
            "quitting job... depressed/unhappy... in his forties you say?   sounds like it's at least possible that he's having a genuine midlife crisis. not that this excuses anything... but maybe it's part of what's going on..  Maybe the relationship and marriage was something he thought would insulate him as he drifted over the crushing existential midway point... and, of course, it's not something you can really use others as a shield against..   \n\n\nthat or there are some interesting ideas in psychoanalysis about mother / father complexes and how some people have problems with their mates after a change in \"categorization\"... eg,  a man who can no longer see his wife as sexual after having a child because she's now \"a mother figure\" in his mind and he has hangups about that...   there could also be hangups that kick in when you shifted from \"hot girlfriend/fiance\" category to \"wife/possible mother\"..  From what you wrote, he sounds like he's got some mother-son power/boundary relationship issues...\n\n\nmy two cents.. \n\n\n",
            "Honestly? This might sound far-fetched but he might have had a stroke, a brain tumor, some neurodegenerative disease, traumatic brain injury or something of the sort. These kinds of events can cause rapid personality changes. Go to a doctor. You might get to see a neurologist. ",
            "I just want to tell you that you are not alone. My best friend is going through this after having her second child with her husband. She says that it seemed like he changed as soon as they were married. I wish I had an answer for you. She says she has told him that \"he his on his way out of her life\" and I don't doubt it. ",
            "My mother's not ex-husband pulled a bait-n-switch: he was an amazing partner and father-figure up until they said \"I do.\" The night of their wedding he flipped, and it was Hell on Earth from there.  \n\nHopefully this isn't the case, OP... ",
            "Get into couple's counseling immediately if you want to salvage this marriage. Although your list of negative changes is lengthier than the \"man he used to be\" section, the fact that you're posting means there is some part of you that wants to at least try. Find a counselor that you can visit alone if you need to for the first visit. You might think that an ultimatum is not the best approach, but to save your marriage - I don't see any other options. If he isn't willing to join you for counseling, then he's not willing to work on the marriage. Therein lies your answer and you've done everything you can. ",
            "What makes you think that your husband changed? It's more than likely this is who he always was and you married someone who was putting on an act. ",
            "This happened to me except I was the husband. I later found out that my body stopped producing hormone, specifically testosterone. I always felt like shit, was lethargic, didn't give a shit about anything and escaped through video games and tv. Once I was treated, I felt like a new me. It's hard to explain but it just felt like I was in a constant haze the entire time.",
            "I can give you some insight as your husband sounds like a mirror image of me down to every detail of your relationship , including  setting boundaries on mum , wifes friends thinking she married the perfect guy.  \nFirst 4 years into the relationship we were still literally inseperable constantly saying how lucky we were to have each other, around the 5th year my wife broke down crying \" i want my old xeroes7 back\" ,we went through a rough patch, i can say it was due to me changing without realising but i was lucky enough to have financial freedom at 32 and had time to research into psychology , although i knew my problems nothing really changed untill something i had to experience. Im 36 now and we are still happily married\n\nI dont think its depression as others have suggested as he wouldnt be in the mindframe of \"how high\" if mum asked him to jump but i could be wrong.\n\nAnyway before i go any further, do you find he always makes a good first impression on who ever he meets ? Goes out of his way to be especially nice to others that are not so close to him and the closer you get to him and the more he trusts you, he becomes less and less considerate of your feelings? Finally does he have any siblings or shared any stories of childhood emotional abandonment ? Im not talking about teenage hormone emotions , im talking about young childhood as in 7 yrs old. \nIf so, give me a pm as i can give you a insight, if not than we leave the conversation here as some one else will be of more help =)",
            "It sounds to me as if something happened. He got bad news. He found something out. Something in his past that he thought he'd left behind came back to haunt & taunt. I don't know. You make it sound like the first guy was a happy person, in love with you & enjoying his life. Whereas the person he is now doesn't care too much about anything. I'm suspicious of his mother. Is it possible he got fired from the first job rather than left it? Have you tried to talk to him, to explain that you are confused & upset by the changes you see in him? He's obviously not happy now. And neither are you. The big question is what happened? Ask!",
            "I don't think he quit his job. I think he was fired. ",
            ">Can someone really fake a personality 24/7 for 2 years?\n\nYes, there seems to be a lot of that on here\n\n>I don't want to spend my life with someone who hates me and everything about me\n\nYou don't have to.",
            "Jesus this sounds exactly like my ex-husband.  If you haven't heard of borderline personality disorder, please look it up.  I have the exact same story as you.  First two years of our relationship were literally perfect. He was attentive, polite and we got along better than I had ever gotten along with anyone in my life.  My mom literally told me that she'd disown me if I didn't marry this man.  \n\nWe got engaged and slowly things started to change.  We had a relatively short engagement, so there wasn't time for him to truly start showing me the red flags, but looking back, I can see where he began cracking.  Three days after our wedding, he was breaking dishes we got as wedding gifts just days before. Three months after our wedding, he trashed a hotel room on our belated \"honeymoon\" because I had the audacity to tell him that it was the perfect time to try for a baby (something we had both agreed on before the trip).  There was pretty much no sex in our marriage.  The one time in 3.5 years it happened, my son was conceived. \n\nWe were married a grand total of 4 years, together for almost 7. The four years we were married were the most mind-twisting, abusive times of my life.  No matter how much support I provided, it was never enough.  He was always the victim and everything was always my fault.  Like your husband, whenever he didn't like his job, he'd up and quit -- no notice and without telling me.  I was expected to support him for months on end when he decided he didn't want to look for a job.  Yet I had to go back to work from maternity leave over a month early because he wouldn't help out on the bills because I had used all of my savings for maternity leave paying for his bills the 6 months he was unemployed prior to our son's birth. \n\nAnd mommy issues?  Ugh, yes, I'm familiar with them as well.  But in my case it's both parents.  It actually just reared its head again this weekend! \n\nThere were numerous times I told him I was leaving.  Especially when he became violent after our son was born.  But every time he'd turn on the sane, loving husband act and fool me into staying.  He couldn't hold the act very long though.  Finally a year ago I said enough and our divorce was final the end of last year.\n\nPlease look into BPD and see if it matches what you're going through. If it is, I would recommend you begin seeing a therapist on your own to help you decide what you want to do next.  There are some great subs on here as well for loved ones of people with BPD if you determine that's what's going on with your husband.  \n\nHugs to you.  It sounds like you need it. ",
            "Maybe he started reading TheRedPill or he wanted to trap you. Either way, I am an optimist, so he might just be too comfortable now that you're married. Have a conversation, and tell him face-to-face that you didn't marry him to be his second mother and to feel lonely.",
            "Brain tumor?",
            "I would guess he didn't quit his job, he got fired and is ashamed to say why. This would cause all the other problems.",
            "Serious question: has he suffered any head injury(ies) that you are aware of? \n\nI agree with others here that a thorough medical exam would be a good idea to rule out physical and mental issues. \n\nI wish you both well and hope for a positive update soon!\n\n\n*Nana internet hug*",
            "Not to jump the gun but to check off all possibilities, are you sure he's visiting his mom? It seems as though he's pushing you away. ",
            "Have you actually had a sit down with him and discussed it with him the way you've laid it out in your post?\n\nLike \"Honey, things used to be so good with us before we got married but now something drastic has changed with you and we need to seriously discuss it if our marriage has any chance\"",
            "Sounds like major depression, its kinda of making him hate himself and that hatred is leaking out on to you. ",
            "This doesn't sound like depression, which comes and goes as far as I know. Were it depression he would have his good months and bad months, this just seems like constant bad months thats been going on for a while.  This does sound like a text book case of frontal lobe injury though, were a person after suffering a head injury/ brain tumor completely changes who they are as a person. If it's that then it's most likely irreversible, I'm sorry. If this is a case of brain injury the person you knew is very likely dead, the damage is permanent and irreversible. If it's a brain tumor the personality shift is the last thing you have to worry about. Or.... he was simply pretending to be such a great guy, but that seems strange to do so after all that time. Any way, talk to him and be frank say \"either you go into the doctor or we have a divorce\" ",
            "Sounds like depression and low testosterone. Have one of you started gaining weight? ",
            "This happened with my husband. It was like a switch clicked and he woke up a different person. In my case he lost his job, turned suicidal and abusive, and basically went crazy.\n\nIt turned out to be bipolar disorder. Years later he is still trying to find a way back to his old self but I don't think it will ever happen. The kind, creative, intellectual I loved for six years is dead. This was a man who stopped to help turtles cross the road who now snaps at his son to fuck off. \n\nI don't know if this is whats going on with your SO but if it is my advice would be to mourn the man you loved and leave because he isn't ever coming back. Don't spend the rest of your life grieving for what was lost and living miserably. Bipolar is manageable but when you've known them from before it manifested it just becomes too hard because they are a completely different person than the one you loved.",
            "I hope you give us an update!",
            ">You know how women are\n\nWow. You are patient. I probably would have walked out while he was having a beer with the guy. \n\nHas anything happened since the wedding? Any major life events? Mid-life crisis? Has he seen a doctor lately for a checkup? I *hope*, for your sake, that this is just some temporary situation. Regardless, you need to offer an ultimatum. This behavior is a deal breaker for you and he needs to work on it. Get him into either personal or couples therapy because that level of change is concerning and his behavior towards you is unacceptable. ",
            "Really analyze your memories near the wedding, before and after. \n\nAlso consider maybe getting his brain scanned? Tumor with ridiculous timing??\n\nIdk, this is super weird",
            "I agree with the \"show him this posting you did..\"  and then have an open honest talk about \"Perhaps we both made a mistake after all and we can end this now so we can both get on with our lives\"  But...CALMLY..no hysterics!  No whininess and try darn hard not to cry!   \n\nYou need to talk about this together!!",
            "The fact that he became totally different as soon as you two got married shows that this is probably what he saw growing up with his parents.  People often have their ideas of \"dating\" versus \"marriage\" and for some people, the two are very different scenarios.  Also, he probably felt like he needed to try hard and be on his best behavior when you two were dating for the end goal of tying the knot.  That's the problem, though: he saw it as an end goal, not a lifelong journey together.  Once he got married all effort stopped because there is nothing more to do, in his eyes.  He also probably feels resentful because now he is \"tied down\".  I doubt much of his behavior is that conscious, though.  It sounds like it is mostly due to patterns he has learned.  \n\nI'm sorry to say this, but its highly unlikely he will change.  He sounds very set in his ways and with the unconscious patterns he's displaying, he will probably never recognize just how f'ed up he's acting.  Even if you manage to get him to change some of his behavior, he will still be overall the same.  By the way, I've noticed these tendencies more in men who are wrapped around their mommy's finger--it's as if they can only be loyal to one woman and that will always be mom.",
            "I don't have any great advice, but I can totally sympathize.  I'm going through something similar with my husband of 6 months (together for 10 years prior to marriage).  It's like the act of marriage exposed a pod person. ",
            "Losing sex drive, quitting his job, not taking care of the house and pets, no longer getting enjoyment from the pets, or other things he used to enjoy, spending long periods of time with his mother out of nowhere\n\nSounds like depression or some other mental issue to me. I'd be calling a doctor before a divorce lawyer, and getting couples counselling too. If he refuses or things don't change, then yeah, I'd get out of there.",
            "Wow. I am almost one year married and I have to say this spooked me!! Quite the mystery you have and I am so sorry OP!! I truly hope it is some sort of medical issue and not a bait and switch! ",
            "This post legit freaked me out. Like I turned my lights back on freaked me out... I'm going to be wondering forever now if the people I know are really who they show themselves to be.",
            "I bet you could get the divorce annulled or something.\n\nPeople keep saying it's depression by honestly it sounds like he played you. Honestly I wouldn't bother asking him to go to a doctor, I'd just bail. Even if he does have a mood or personality disorder you will struggle with this and him for the rest of your life.\n\nA semi close friend of mine just got married after 8 years with the same girl. It was a kind of rocky start but nothing major, he was diagnosed with a personality disorder and once they married, literally that month, he snapped and tried to change the whole thing. Wanted to open the relationship, quit his job so she coudl support him, forced her to take care of his sisters kid even though he promised her that wouldn't happen. Now SHE is depressed, broke, lonely, feels like she is going to lose it, works all day and cares for his niece all night. She's gained weight and become majorly depressed.\n\nI asked her why she stays and she said, \"I can't abandon him because he's got mood issues.\" \n\nUnbelievable. She's resigned to being a prisoner for life to a totally different person than she had spent 8 years with.",
            "You don't have kids, you have an easy out.\n\nBut this seems so drastic that it seems like there might be something wrong with the guy, emotionally or physically.  The change in sexual behavior is the strangest of everything.  Any chance he was molested or raped or anything like that?  \n\nWhat you're saying is mind bogglingly weird.",
            "Do you think there's a possibility he's seeing someone else? Maybe he isn't always with his mom... ",
            "Does he have any friends you can talk to?  A conversation with one of his long term friends will let you know if his behavior has changed in general or just with you.  If he's still normal around his friends at least you can rule out physical or mental illness and deal with it solely as a relationship problem.  \n\nNow if he doesn't have any friends that have been around for any length of time... well, then he's probably just an asshole who tricked you.",
            "Sadly my first husband changed the very day we were married. I took it at first that he was stressed, but I was so confused. It truly was like living with a stranger. Get out while you can. I stayed 12 years and when I finally got the courage and help to leave he tried to kill me. If I wouldn't have had help and support he would have finished the job. After the divorce he spent years stalking me. There truly are people who are psychopaths and or narcissists who will play you like a fiddle until they feel safe that they \"got\" you now. They will destroy your self worth (that is the goal) to keep control. Every day spent with someone like that is another day they suck the life out of you. Eventually you think there is something wrong with you. I repeat- get out now.",
            "It could be mid life crisis or depression. You should take him in for a neurological check up just in case. It may be low T or this is the real him and he has been very good at deceiving you for the last few years.\n\nThanks to Obamacare, annual wellness check up is free. (Just got mine.) He should at least have some basic labs done.",
            "Was it literally an overnight switch the day after you married or was it not toooo long after or something? Because, perhaps if it wasn't legitimately overnight, he found out about some type of serious medical issue or something with either himself or his mother and he hasn't told you because he's having a very difficult time dealing with it? Only other potential besides him just hiding who he truly was to tie you in to a marriage [which doesn't seem like there's any reason for him to do that as it doesn't sound like you have a wealthy family or anything for him to necessarily gain from - not to sound rude or anything just that you sound like you are holding your own but somebody lying about themselves for that long would probably do so for a large gain in the end], is that perhaps he's having some *serious* health issues himself that he *doesn't even realize yet* neurologically. I think, as other users pointed out, you should definitely tell him your feelings and how unhappy you are and that *something* needs to change - balls in his court whether it's divorce or counseling. If he instantly goes for divorce, it will be difficult and probably won't feel like you are getting the closure you want, but at least you will know his thoughts and where he stands. Perhaps he thought he wanted marriage but, in actuality, didn't and freaked out and has let it change his whole demeanor instead of just talking to you honestly about it? Best of luck! Hope you get some type of answer from him around this as it doesn't sound like a happy and healthy way to live.",
            "i remember a thread that was quite similar. turned out he had a brain tumor in that story.",
            "I agree as someone that studied clinical neuropsychology I saw a lot of change in people that where ignored. Later turned out to be tumours. But he can also just be a douche. You have to look at the intensity and duration of the change in his behaviour.",
            "> He quit his job without telling me because he \"hated it\" and took a job as a delivery driver for Amazon.\n\nWhen did this happen? Are you sure he actually voluntarily quit his old job and wasn't let go/fired?\n\nThis could have triggered some form of depression.",
            "1) I bet he actually got fired from his job and is humiliated and depressed.\n\n2) He is at least depressed regardless the reasons.\n\n3) Notwithstanding his depression his behavior is unacceptable.\n\n4) Marriage counseling.\n\n5) Honey I love you but you have become an entirely different person than the one I married.  Something serious is going on.  Id like us to go to marriage counseling bc I want us to have the best possible marriage.",
            "Sudden personality change can be a symptom of *many* physical illnesses, not just mental illness. Please get him to a doctor. ",
            "Get the fuck out. \n\nDo the standard, counseling talk to friends try and work it out but if he's this allergic to marriage he's not going to get on board with that.\n\nGet the fuck outta there. I don’t really give a damn what his problem is. Marriage is a team sport, if he won't tell you what the hell is going on you can't help him anyway. ",
            "Well, you're married to the guy. This isn't just a \"break-up\" situation. You made a life long commitment and I'm sure you want him back the way he was. There is middle ground....move out for awhile. You don't have to divorce him, although I think if it was me I would cover my butt with a legal decree of separation. Let him live with himself for awhile, see if he comes around. Cleans himself up and maybe gets some counseling. If he asks why you're leaving I would just keep it real simple an say \"hey, I don't know who you are, but let me know when my husband comes back\".  If not....you might have gotten faked. Idk, that just seems so weird though.  \n\nAlso, u/hopewings mentioned doubling up on birth control....no kidding! Do it! If you got faked, the next attempt might be getting you pregged up. Be careful. ",
            ">The mommy issue is back. She says jump and he asks how high\n\nAhh FUUU. You have my sympathy. My soon to be ex wife, was exactly the same. She had major mommy issues, and I still think that caused a massive issue in our marriage..\n\n>He no longer has my back and stands up for me\n\nDouble F!ck. Don't want to say it, but when I realised my STBXW didn't have my back, I knew my marriage was doomed... \n\n",
            "> Can someone really fake a personality 24/7 for 2 years?\n\nYes. Absolutely. Abusers do it all the time. If you look into some cases of abusive marriages, the abusive spouse is *perfect* until the day after the wedding. Then the abuse starts and the abused spouse is manipulated into feeling like they're the crazy one, which is why it is so tough for them to leave.",
            "Heres a possibility that I havent seen mentioned. He may regret getting married. No matter how much he loves you and wants to spend his life with you, the realization of the permanent committment he made to you may be freaking him out.\n\nI say this because this is how I felt when I married my first husband. Granted I was very young, I was content with being with him for the long haul, therefore marriage was just the thing to do. I was so happy to get married, until the moment I signed the papers. Then regret hit like a ton of bricks. What if this isnt the person Im meant to spend the rest of my life with? If we dont work out, breaking up is no longer as easy as moving out of the house. It just felt so final, I hated it. I immediately hated being legally attached to someone.\n\nTry to talk to him, and let him know how you feel about his actions. He may need some counseling by himself to figure out what triggered his complete personality change and what he needs to do to fix himself. Good luck, and I hope everything works out for both of you.",
            "Here's the thing... I just kind of went through this with my girl. We're kind of broken up now. Anyways, we were together for 30 months or so. About month 20 or so we started having issues. I was changing and not treating her like I used to. Come to find out I had low testosterone. I was very pessimistic, no libido, lack of energy, and just overall felt like crap. Unfortunately, my relationship suffered because of this. I was normally such a high energy, optimistic person. I didn't know who I was. Come to find out I had low T. Doc put me on some meds and I felt like my old self again. Unfortunately for me, it was a little to late with my girl. She was fed up. Felt unwanted, unappreciated, etc. Anyways, another aspect you should look in to is you. Are you an anxious person? Do you deal with depression? These kinds of things also can add tension to the relationship. I understand your frustration with your husband. But take a look from the outside in and analyze your behavior as well. Good luck, don't give up. ",
            "He may be depressed and need help!",
            "Agreed. It sounds like depression, or less likely he really did manage to con you for 4 years. I would take him to see a doctor and mention everything that you did in the post. The low sex drive, the loss of interest in things he used to enjoy, the career change/loss of motivation and energy, all of it are textbook symptoms of depression.",
            "Definitely depression. You both need to seek some help for him.",
            "This reads as familiar to me.  I was married to a person who moved heaven and earth to be together... after the wedding however that changed.... I think they believed I would never leave them and stopped trying.  I honestly believe that a little fear of losing someone causes us to be our best and to put our best foot forward to our partner.  When that disappears, the effort disappears too.  My advice is to tell your husband that this isn't working and that things cant stay this way of you two are going to stay married.  Good luck.",
            "sounds like there is something wrong with his health",
            "I'm actually worried for your husband. \n\nUnless he's a master con man, this is too drastic of a change to be normal. Sounds like something is really wrong. \n\nEither way, he either needs to try and work on it with you or you divorce him. Give him that ultimatum and see what happens.",
            "Did you talked to him about his personality change? Because you do not mention that in your story. \n\nIf you haven't asked him why he is behaving so differently since the wedding, ask him. If you already talked about it, talk about it with him again. \n\nI think you have to tell him that his 180 is affecting you and the relationship badly, and that you don't understand what has happened to him since the wedding. Also tell him (if he truely doesn't know why he is acting like this) that you are worried about his mental health, and that you want him to go to a doctor.\n\nIf he has a bad response, like he says 'I do no longer care about us' and 'It is stupid to see a doctor,' I think you know enough. If he admits that he is acting like an asshole and he wants to go to a doctor, there maybe is some hope. ",
            "tell him We will be calling a marriage counselor, or a divorce attorney.  Decide.",
            "He might have some internal issues he hasn't worked out or depression.   Depression can totally change one's personality, I speak from experience.  Needs medical attention.",
            "Drug addiction! \n\nIt is easy to hide an addiction, until you lose your job because of underperformance or dont have the ability to feel any emotion except anger anymore. Lack of sex drive? Check that off the list too.  His brattiness might just be a self-defense mechanism to get you to leave him alone. The mom situation doesnt add up to me either.",
            "What was his job before he quit?\n\nMy partner (who I am now on hiatus with) was a lot like what you describe during the many years I knew him before the last few.  He's been in an industry for about a decade that has slowly embittered him and brough out the worst qualities in his disposition and led to many behaviors similar to what you're describing.",
            "I have no advice for you other than saying that DAMN this is my worst nightmare. How can people be so fake just in order to gain security?! AAAAHHHGGG. Other than what everyone else is saying about the depression stuff...standard r/relationships advice is to demand therapy and see how that works or GTFO of there. He's clearly only caring about #1, so you should too",
            "I'm saying depression as he's hit the big 4-0. ",
            "It doesn't really matter what caused this change. You'll never be able to trust this guy again. \n\nYou're actually lucky: No kids. Divorce should be relatively easy.",
            "He sounds depressed. Perhaps he's lost his reason for living. I would encourage you to talk to him about his behavior lately and see if you can get an answer. \n\nHe is of the age where the term 'midlife crisis' is suitable. Perhaps he's suddenly overwhelmed with the prospect of his own mortality and the fact that half of his life is gone. ",
            "Could his mother be drugging him?",
            "Fuuuuuuck man. Last ditch effort. Divorce or counseling. ",
            "[deleted]",
            "My only advice to you would be to talk to him about this kind of behavior. What seems like a very well off relationship until you guys got married, is something that I can understand is a woman's worse dream. My only advice to you is to fully go into deep conversation with your husband, and give him an ultimatum. Obviously, you aren't happy, and neither is he. Seek counseling, seek some kind of help that allows you to express your views. Maybe then, he too, will finally let go. I find it weird that he fakes a relationship for so long, acts like the perfect guy, then does a complete 180. All in all, it sounds like you love this man , but find to hard to understand why he is not the same anymore. Talk to him, and figure out what is wrong. Update us and I wish the best of luck of you!",
            "We fit to our environment. You and he changed it. Both of you have no doubt changed. Him in ways you don't like. Sounds like the context of your relationship needs to change again.",
            "Is there anyway you could talk to his mom and ask her WTF she thinks is happening? I mean she must have noticed he's there all the time.",
            "Have you approached the topic of kids?\n\nAlso sounds like he might be living out his Mum's plans, once he got you then he started spending more time with her again and focusing less on you.",
            "Wow, A lot of what you said sounds familiar to me.  A couple years ago my partner just sort of stopped and changed.  The self sabotaging, rudeness, and distancing(emotional/physical) that you are experiencing really hits home with my situation. \nWe never really fought and were both private people who got along really well.   It all starting turning bad after we had our first real fight or disagreement of our relationship.  We resolved the issue at that time but it seems he just sort of stayed turned off emotionally.   He has agreed to couples and individual therapy so we shall see how the next few months/weeks pan out.   I think I might bring up depression next appointment.  He wont believe it as a possibility but maybe our therapist might be able to talk about that.\nI really hope things get better for you cause it's a really shitty place to be.  ",
            "How are the finances? Could he be hiding a drug addiction?",
            "I wonder if this guy is cheating on you? Changed behavior can be an indicator of that. One giant red flag is him spending days at a time \"with his mother\". Can you confirm that's where he really is?",
            "I don't see this mentioned, but he should check his testosterone, thyroid, and other hormon level. That's the first thing I could think of.\n\nPeople could change drastically if their body is imbalance.",
            "Has your husband made any new friends recently? The stress of the job and everything else can be upsetting, I'm thinking he found a friend, labeled him as a role model for how He wants to live his life and now he acts like his friend who just is an asshole. \n\nDeep down, I feel he does love you, but he is so screwed in the head he doesn't understand that what he's doing is wrong.. \n\nMixture of mental illness plus friend that's an asshole sounds fitting.. \n\nOr\n\nHis mom is pressuring him to get away from you. \n\n",
            "Any stark and sudden personality change warrants a medical exam with this information given to the doctor. Please have him see one before making any decisions about your marriage. ",
            "Get him to a doctor. ",
            "Either the man you married is gone, or he never existed. Either way you are still young enough to mourn your loss and move on. Quickly. Don't waste your whole 30's on him.  \nSomeone suggested talk to his long term friends to see if his personality has changed with them too, that might be a good idea just in case he does have a brain tumour, but mostly....leave.",
            "Is there a mental or physical illness that's not been diagnosed?\n\nIf not... get out.  Now. \n\nThere is also the chance he's having an affair.  A guy's sex drive doesn't typically diminish like that.  If he's getting it from somewhere else, that may be why he's not getting it from you.\n\n\nNot that I mean to be personal or blame this on you, but have you changed?  Put on a lot of weight? That could be an issue.  Not assuming it is (I assume you would have included that in your narrative), but I know a lot of people who get in relationships and the SO puts on weight and they lose interest fast.  Not bringing that up to be rude, just turning over every stone.\n\n\nHas there been any deaths in his family?  Does he have erectile dysfunction?  Has *he* put on weight?  \n\n\n",
            "My first thought when reading was \"something happened/something he's not sharing with you\". Counseling seems like a good idea.",
            "Couples therapy, individual therapy, ultimatum. Basically what you need to do. His reaction should reveal whether it was a bait & switch or genuine and he's going through some shit. \n\njust need to say, I totally missed the 'next to' in your title and read it as 'I (33F) went to sleep a year ago with my wonderful new husband (40M). I woke up a stranger in his body. I can't be two people.'\n\nI WAS SO CONFUSED. ",
            "I agree with the others that this is\n likely a neurological or psychological issue. But, I would try to give a call to his brother. Ask him if he has seen any if this behavior in his brother before. He could provide some valuable insight, and maybe help you find a way to tackle the problem. You need someone else who knows this man well, and is also concerned about his health. ",
            "It sounds like something is wrong with him, either depression or maybe a chemical imbalance.  He needs to see a doctor, if you think you can get him to go.  If you have to, get his mom involved.  Tell her you're worried about him,  that he's not acting like himself.  He will hopefully listen to her if not to you. \n\nThere is also a possibility that he changed because of getting married.  How was his parents marriage? It could be that he has an idea in his head of how a marriage should be based on how he grew up, and he's playing that out now. ",
            "This happened to me years ago, except it was with my fiance at the time, and I called off my wedding just one month before.  I was so thankful I noticed the changes PRIOR to the wedding.  We had been together for only 2 years and it's like his entire personality changed after we got engaged.   It was the hardest thing I've ever done, but I have NO regrets calling off the wedding.  I lost thousands of dollars but know that a divorce would have been more difficult emotionally and financially.  I'm sorry you're in this situation.  Since you are already married, I would do my best to save this relationship through communication and counseling.  If it doesn't help, there is no shame in moving on.  At least you've tried.  And it may damage you, but you will re-heal and be much better off.   Best of luck!",
            "How do you do the thing to get the bot to notify you when there's an update?",
            "Sounds like depression or another mental issue. Is anyone else aware he's changed? ",
            "That sounds like a bait and switch. It sucks. ",
            "[removed]",
            "Sounds horrible. Sorry you're going through this. \n\nHave you confided in friends who also know him? Have they noticed a change too?\n\nIt does sound like depression. This can be tricky to navigate because until he wants to get better, he won't. You may have to give an ultimatum and follow through with it before he ever gets help. \n\nFor your own sake, I'd recommend counseling (individual and even marriage if he'll agree). You are mourning and grieving the loss of a wonderful relationship. It could be rebuilt, but will take work on both sides. If he's not willing to work, then you have to move on for your own sake. ",
            "OP,\n\nIt is possible that he got fired from his well paying job and lost confidence in continuing in that industry. And now feels bad about where he is in life.\n\n\nOr yeah, possibly the bait and switch.\n\n\n",
            "d-i-v-o-r-c-e",
            "This is going to get buried, but in reading your post I did not come across too much mention of what you used to do for him, and how that might have changed over time. It's tempting to think that he might have some medical issue or that he might be a psychopath, but have you considered that you have a roll in any of this? Perhaps he is passive and just did everything you wanted him to do, and then just got burnt out from pretending? I see a lot of \"me\" in your post which is why I ask. Just throwing it out there. Sometimes it's tempting to thinks we're victims of circumstances because the alternative, that we are partly accountable, is very scary (though very natural and human...)",
            "WOW! What a sexist momma's boy asshat! I can't believe he said that to your neighbor!!\n\nYou have a lot more to offer in life than him. You are currently in a mismatched relationship and you should tell him that. You are ambitious and love life, he seems to hate it.",
            "I might get downloaded for this but whatever. \n\nIs it at all possible that may be something within the relationship dynamic changed? \n\nPerhaps the changes that are occurring have something to do with changes that he sees in you. \n\n\nYour story sounds very one-sided and I can't help but to think that there may be something on your end that you're omitting.",
            "> There is no money for the training and class I need for my career.\n\nOut of curiosity, what classes *and* training do you still need for your career at the age of 33 that your current employer isn't covering? ",
            ">Husband did a total 180 after wedding. Why? What do I do?\n\nCan you elaborate on this a bit? Exactly how and when did this change occur? Was it like, the day after your wedding he was completely and totally a different person? Was it a slow gradual change over time starting after your wedding day? Was there some other event or conversation shortly after or before your wedding that might have triggered this change?\n\n\n>I don't want to spend my life with someone who hates me and everything about me, who is either zoned in front of the computer or at moms, who acts like I'm dipped in shit when I try to touch him. \n\nI'm sure I don't have to tell you but this isn't normal. You do hear stories of people changing after they get married but usually they have a clear motivation/explanation for why they changed. For example, if someone married someone else for money they might change their personality after they're married and the wealth is 'secured' so they can drop the act. \n\nThis doesn't seem to be the case here. Some people are suggesting mental issue/depression, and that's one possible explanation, but another one is that his opinion or perception of you may have changed after the wedding. So I'm gonna go ahead and ask, did **you** change in any way after the wedding? Does he have reason to think of you in a different way? Because this line:\n\n>who acts like I'm dipped in shit when I try to touch him\n\nSuggests to me that he resents you. Any idea why that might be? Has anything about YOU changed since you got married? Here's some common situations where you might see a reaction like this:\n\n* He no longer finds you attractive. Maybe you gained weight and he's mad that you 'tricked' him into marrying you while you were pretty then let yourself go.\n\n* He suspects you're unfaithful but doesn't want to confront the problem, instead he's simply harboring resentment and treating you poorly in the meantime. Is there anything you could have done to make him suspicious? You mention you were away for four days, do you spend time away from home regularly?\n\n* He resents the financial burden you're placing on him. Are you sure he quit his job intentionally? Is it possible he got fired or otherwise let go and moved to the Amazon thing out of desperation? And now he resents you because of the cost of your education? How long after the wedding did he 'quit' and was his personality change evident before that point? If so how long before?\n\nI'm just throwing out ideas here because there's lots of possibilities. My money is on him being fired and not wanting to own up to it and thus shutting you out while drowning in self-loathing, but that's just a guess.",
            "Coolidge effect, you are \"locked down\", he doesn't feel like he has to impress you anymore.",
            "Honestly, this is the kind of post where more than ever, we'd need to hear guys side of the story. Go to couples therapy, don't listen to anyone here, because we don't know what's going on. Work through this together.",
            "I would say the Mommy/family issue is the biggest indicator that something was wrong from the start.  Unhealthy attachments and toxic dynamics with parents don't emerge out of nowhere in adulthood, and he did a superb job of hiding the full extent of his issues before you got married. I know it's a cliche, but whenever someone has a fucked-up relationship with their Mom or Dad, it often bleeds into their relations with partners of the opposite gender.   Put into this context, his \"you know how women are\" comment to his neighbor isn't really out of the blue.\n\nOther than his mother and your obnoxious neighbors, does he have any close friends or family members that you feel comfortable discussing these problems with?  Other people who are close to him might have either noticed drastic changes in his personality (which might point to the depression/psychotic break theory others are having) or confirm that this has been his personality (to one degree or another all along) and his mask has finally slipped.\n\nPerhaps I'm overly suspicious or cynical, but whenever someone describes a partner as being completely perfect and there are never any arguments, it makes me think that the partner is either being viewed with rose-colored glasses or one person in the relationship is completely repressing his or her true self and feelings.\n\nI'm sorry you're going through this.",
            "My father did a lot of this stuff with my mom when they were married, down to spending his money on collectibles. \n\nHe's now a convicted felon. \n\nI'm not saying he's a criminal, but I am saying he's hiding something. He's either hiding something about himself (or was) personality wise, or he's stressed out about something he's not forthcoming about.\n\nMy father was stressed out, lying, and depressed for a long time while he was hiding his real life. A lot of that came out in behavior.",
            "Seek marriage counseling ASAP. If he refuses to go then file for divorce because he's obviously checked out of this marriage.",
            "Divorce the d-bag",
            "Hoo-boy, that's a drastic 180!  What would he do if you told him you wanted a divorce?  And laid out the reasons?",
            "Have you talked to him about this? What has he said? \n\nLet him read this post. You've done a great job illustrating the situation. Ask him to explain each point. ",
            "I want an update to this one. You don't have kids?? Late! ",
            "I definitely suggest depression here. I have severe (almost schizophrenic) depression and it has put a small strain on my relationship. We work our way through it but I can safely say I'm much more aggressive than I usually am and I hate who I occasionally become. I'll turn into a monster for an hour or two and then when my SO tells me how I'm acting, I bite my tongue and usually that fixes me again. I go into another world it feels like when I get that way, she pulls me back into reality though.\n\nAs someone who is severely depressed, look into that. My inbox is open if you need help on the subject. I might not be much help but I can try.",
            "Maybe ask his mom if he's been acting differently, or any of his friends. You should also check if it's not a brain tumor or anything like that. Maybe if you can get a little group together to tell him you guys are worried about him and how he has changed drastically it can get through him and he might go see a doctor or a therapists or anything. 4 years is a long time to fake your true colors but it could happen. ",
            "You were wrong about him being great even after the honeymoon stage. You have now discovered the truth.",
            "Maybe he realised that he doesn't like being married? That's what changed everything. \n\nSome people just don't like marriage. Perhaps he's pushing you away so you don't have to be married anymore. ",
            "He was using you to get married. Happens all the time.",
            "I really just want to hug you. I'm so sorry you are going through this. I cannot even imagine the confusion and heartache that you are going through and how emotionally drained you must be. \n\nDo you have mutual friends or family that you can talk to who know him? In addition, I don't usually like ultimatums, but you need to put your foot down and stand up for yourself. You deserve the world, and he has stopped respecting you in the way that you deserve. There is clearly something else going on here. You need to know what that is so you can move forward, with or without him. ",
            "Sounds like he's pissed off about something.  Has there been any old infidelity issues or anything that he's mad about?  It would be tough to fake not being an asshole for that long.  This sounds more like built up resentment than depression to me.  Tell him all you said here and see if he won't open up.",
            "I don't know if OP will see this or not but 4 years is a LONG time to fake it. I kept thinking throughout your story that some kind of trauma happened to him. And then I thought maybe something neuro. Have you talked to him about it at all? Does he acknowledge that things are different now or does he seem to think it's the same?  I definitely think a visit to a doctor is warranted. Do you think you'd be able to convince him to go? ",
            "Sounds like depression.",
            "it sounds like you hate each other",
            "Might have missed this in all the comments. Assuming the ages are real, do you think this has to do with him turning 40?",
            "OP i salute you for expressing it and if you need to talk you can PM me.",
            "I think the biggest thing to know is that your feelings about this are totally valid. You wouldn't have married this person and you don't have to be married to this person. You can take what steps you want to give him the opportunity to discuss, change, be a caring partner again, but whether the change happens in him or to him, you don't have to be married to \"that guy\".",
            "This brother of his, are they close? Maybe, if your husband trusts and respects his brother, he's more likely to listen to him than to you? Call this guy up and explain your situation, if nothing else you can try to find out some more about what their parents marriage was like, maybe he's just taking after them? If this fails, go to a marriage counsellor or psychologist (without the husband) and explain in detail what's going on with your husband, maybe they've seen this before and can help you. If not, maybe they at least have a more information-based opinion on whether or not this is medical or not. ",
            "Sounds like Don Delillo's novella, The Body Artist. At least, that's what I always thought it was.",
            "Leave now! While you're young and your injuries heal quickly!!",
            "Sounds like he's spending time with \"mom\"",
            "Either he has some ailment like a brain tumor or he's an asshole who can't handle married life responsibly. If he goes to a doctor and nothing is wrong with him then we know the answer.",
            "My mother's ex held up a persona he never was for 8 years. One day he left and had been cheating for who knows how long, and no one saw it coming and we lived with the guy.\nIt sucks but some people are just really awful to their core and damn good at hiding it.",
            "When  you got to the job quitting part, I think you began to provide your own answer.  He lost motivation and/or simply wanted to sit back and do *way* less on many fronts.  We hear about this all the time in marriages.  Not just that there's a bait and switch, but that marriage itself is a kind of goal that appears to reset brain switches (or bring up latent issues).  Marriage is serious business for some people - and many people seem to change or absolutely do change after marriage (happened to me, first marriage).\n\nPart of it can be that the game changed.  Rules of courtship provide gamification of the relationship.  Once that's gone, some people deflate (even get depressed) and settle into a long haul mentality.  I think that's awful, but it does happen.\n\nAll the usual advice applies (counseling, etc) but OP, you need to also be thinking what you'll do if it doesn't change.  I think the sex issue is both a cause and effect of everything else, it could be worked on separately.  A sex therapist would probably say that any less than once a week is not good (biologically psychologically) and would require the lower libido partner to commit to initiating once a week (and keep track).  This has worked for thousands and thousands of couples, to restore some kind of intimacy, but also to reveal further problems (including if one partner is actually asexual - which it sounds like he is not).\n\nSeriously, this is a relationship on life support - and that's what you should tell him.  He's the only one with any clue about the answers.  ",
            "Social worker/therapist here: he sounds depressed. Sometimes depression manifests itself in ways most be people don't expect.",
            "Just a thought:  Could Mother be trying to break you guys up?  I've seen it happen in incredibly subtle ways, pressurizing and splitting loyalties until someone breaks.",
            "Could he suffer from Depression?",
            "A question. What were the circumstances of your marriage? Could he have felt pressured into it, by you, his mom, the community/friends around you? If so, it might be passive aggressive resentment and he's doing it on purpose."
        ]
    },
    {
        "post_id": "6uetli",
        "author": "toolstick88",
        "title": "Me [31F] with my friend [39M], been good friends for two years. I have cancer and am not going to live a whole lot longer. Should I tell him I have feelings for him even though nothing is going to come of it, probably?",
        "url": "https://www.reddit.com/r/relationships/comments/6uetli/me_31f_with_my_friend_39m_been_good_friends_for/",
        "score": 3022,
        "num_comments": 206,
        "created_utc": 1503021889.0,
        "selftext": "Chemo is very, very not sexy.  So it's not like I think I'll tell him and he'll be like \"oh god, let's bone right here!\" or he'll make some grand gesture about having a relationship with me til my time comes.  That isn't what I want, nor why I want to do it.  \n\nI get really sad when I think about dying without telling him how I feel.  We've always had ridiculous chemistry, we were just never single at the same time while I was still healthy.  \n\n\ntl;dr: Should I tell him I'm in love?  How?  And since I don't think there's going to be a lot of time left or that he would want to be with me anyway...is this a good idea?\n\nETA:  Obligatory 'this blew up' comment and thank you guys for taking the time and being so, so kind  It occurred to me this a.m. that he has probably read this by now and figured everything out.  So maybe you guys did my job for me?  Thanks!\n\nI won't see him for a couple of days, but I'll update.  Promise.",
        "permalink": "/r/relationships/comments/6uetli/me_31f_with_my_friend_39m_been_good_friends_for/",
        "comments": [
            "Beyond having lost some folks to illness, I don't think I (or anyone) have the right to suggest anything, but here it is:\n\nLet it fly. Tell the guy you like him.\n\nTell everyone which Spider-Man movie is your favorite, or that you don't give a shit about Spider-Man.\n\nLet people know when you think they've been shitty.\n\nDo absolutely everything within your power to let the world know that you've been here and you have an opinion about it.\n\nYou are beholden to no one. Do you, and do it proudly and obnoxiously.\n\nWorst case scenario, the guy doesn't reciprocate your feelings and it's awkward for a bit but you move on. Best case scenario, he likes you back, you guys have a lovely time while you can, and the world is better off because people loved each other for a bit.\n\nIt's unfair that you're leaving us, but it's spectacular that you're here. Be here as loudly as you can.",
            "yeah. you should tell him now. just tell him the truth in whatever simple honest words you can come up with. don't beat around the bush, just tell him what's going on. it might be important. there's also a chance (however high or low) that you might survive and make it and end up having this be the start of a new life with this guy, or at least a good part of your life before it ends. ",
            "As a former hospice worker, I've spoken with hundreds of people about their lives, their choices, and what they wish they had done or regret. It's true what they say, we tend to regret what we didn't do, not what we did. In your case, and if I try to put myself in your shoes, if you have feelings, I suggest sharing them. This goes for people who have terminal diagnoses as well as people who may die in their 90s.  I wish you all the best and strength to be courageous!",
            "For you, OP, my favourite quote:\n\n\"Life will break you. Nobody can protect you from that, and living alone won't either, for solitude will also break you with its yearning. You have to love. You have to feel. It is the reason you are here on earth. You are here to risk your heart. You are here to be swallowed up. And when it happens that you are broken, or betrayed, or left, or hurt, or death brushes near, let yourself sit by an apple tree and listen to the apples falling all around you in heaps, wasting their sweetness. Tell yourself you tasted as many as you could.\"  - Louise Erdrich\n\nTell him how you feel, and taste all the apples in your life.",
            "[deleted]",
            "I don't see why you can't tell someone that you love them, especially in a situation like yours. It might be a bit problematic if he is currently in a relationship but I would still do it because I wouldn't want any regrets. \n\nI'd try not to make it a depressing moment, though, and just focus on the good memories and being grateful for having his friendship and support. I'd also make sure to verbalize to him why you are telling him now, and what expectations, if any, you have for him by giving him this information. He might not be expecting it and may be confused about what he should do.\n\n\n\n\n\n",
            "[deleted]",
            "I have a stage 4 cancer. No idea how much time I have left. The thing I've learned the most in the past couple years is to stop giving a fuck what other people think. I try to not be a dick, but it's my life. I interviewed for a new job in a new city yesterday. I told them about the cancer (not all the gory details), so that if they hire me, they will never feel that I was dishonest with them. My suggestion to everyone is to live the life you want. Don't wait for cancer to teach you a lesson.  To the OP, do what you want to do. If you want to tell him, go for it. It could result in some amazing times in your remaining time. If he doesn't reciprocate, so what?  You haven't lost anything. If, in your heart, you think it's wrong to put some kind of pressure on him, then follow that path. It's your life. You get to choose. ",
            "I was flipping channels earlier this evening and saw an old favorite on Turner Classic Movies. 24 hours of Rosalind Russell movies. *Auntie Mame* was the film. \n\nSo why am I bringing up some old movie? Because to me that film is all about just grabbing the life we have by the balls and living it through love, lost love, illness, and poverty. One popular quote from the movie is: \"Life is a banquet, and most poor suckers are starving to death!\" Highly recommend this movie if you haven't seen it. \n\nTell him. It may or may not turn out as you anticipate but you'll have lived some more on your own terms!\n\nGood luck. I hope life is long and healthy for you and you can fight this to win!",
            "You get sad about not telling him because you are holding back from living. \n\nYou will regret it if you never tell him. \n\nIt's in those words and in those feelings when we are truly alive and living great lives.\n\nI know you're sick and dying but you still wanna live while yer alive, right? Jesus, yes!! Tell him. \n\nIt's all any of us have got. \n\nFuck it if it never comes of anything ...thats not what its about any way ... tell him with your voice .... your words ... the words you choose to say to him .... show him what's in your heart with your eyes when you express the way you feel about him. Own them feelings and your love!\n\nI'm happy for you :) ",
            "Love is the reason we are here!  My sister lived 2.5 yrs after her cancer diagnosis.  In that time, an old boyfriend from 10 yrs prior showed up, and they became engaged.  They couldn't resolve their prior issues, so they broke up.  Out of the blue, platonic high school friend shows up, whom she kept up with on FB but hadn't seen in 25 yrs.  He always secretly loved her!  He became her bf and stayed at her side the last 1.5 yrs of her life; she died in love.  I consider her bf to be my BIL, really; we can rely on each other and he shows up for me.\n\nLove is the gift that gets better when you give it away.  Either way, he should know that you love him.  Be true to yourself, no matter what.  Best wishes.\n\nEdit: wording",
            "The ones you love will hurt once you're gone. \n\nThey will hurt no matter what. It's because they love you that they will hurt but that love won't disappear. \n\nMy best friend died without saying goodbye when I was 16 (not her choice). Her uncle gave her belongings to her friends and I found her letters where she mentioned she was too afraid to tell me how she felt for teenage reasons. \n\nI wish she would have told me because I loved her too. \n\nYour situation is different, I understand that, but you have nothing to lose. If you tell your friend you are in love with them now, they will carry that the rest of their lives as something beautiful and untouchable. Incorruptible, regardless of how they feel. \n\nLike another poster said, you only really regret the things you didn't do. I wish 16 year old me had had the courage to admit I was falling in love, but now I won't ever have that chance. \n\nI still think of her often, fifteen years later. The knowledge she loved me is beautiful and calming (totally just how I've come to cope). \n\nEven though I realize, at 31, that it wasn't \"love\" as I know it now. It's still something no one and nothing can touch. \n\nI will carry it forever and I am happy to carry that. ",
            "Listen here, I say fuck it.\n\nAnd I'd pretty much say fuck it to anything you asked. I wish you the best in all of your current endeavors.\n\nAlso, godspeed on the fuck it",
            "This might be an unpopular opinion but I don't think you should tell him. Yes you will feel good telling him but you will be gone and he will be left with this. What kind of emotion will he then carry with him for his life? Regret? Not being able to be with you? Awkwardness? He doesn't reciprocate and then his memory of you with tainted by this. \n\nI think you should tell him how important his friendship is to you but maybe not go further into the feelings. I'm sorry you're going through this. ",
            "Thread saved so I can easily find it for your feedback! Pls deliver lol.\n\nI've gone through chemo, had a double mastectomy now I'm going through radiation so while i don't understand everything I get enough. Tell everyone every single idea and thought you have. Build and burn bridges because really who the fuck cares. Be braver then ever before because you can only lose your pride for a while!",
            "It is okay for OP to tell him how she feels as long as she stresses how she doesn't expect anything in return. OP can tell him, \"I like you. If I were not sick, I would like to know you on a deeper level. I guess we will be friends only.\"",
            "We are, all of us, from the moment we enter this world, merely on borrowed time.  What we do, how we live, the mark we leave, that's all that we can do with whatever temporary moments we are given.\n\nNone of us, not you, me, or any of us here should waste any of that time regretting the choices we did not make.  In the end,turn by turn, our time always winds down, and our temporary stay on this dirt and sand comes to an end, and nothing remains other than the impact we made upon it.\n\nLeave your mark OP.  Leave a mark so deep and so wide that when your stay here comes to its end, that everyone who had the fortune to cross paths with you will know, undeniably, and irrevocably, \"she was here\".",
            "Doesn't it go - better to have loved and lost, than to never love at all? Tell him. Don't have any regrets. ",
            "Being loved so deeply isn't a small thing at all. I think you should tell him even if it's not reciprocated just so he knows how much someone cares about him and admires him. I fell deep in love with my current boyfriend while he was still in the closet and I had accepted he was straight, but I still confessed to him because I wanted him to go through life knowing how much someone had loved him and cared for him. I mean, he ended up not being straight which worked out for me. But I was completely fine at the time knowing that we would not be together. I wish you the best of luck my friend. I hope you find comfort and lots of love. ",
            "My situation was a little different but i am the one that lived. It's been very difficult for me over the years. I would really encourage you not to do this. All you'll be doing is giving him an extra burden to carry. He's already going to mourn you, if you do this he'll be mourning the could have been too. It's not right dude. If you truly care about him, spare him that added suffering. ",
            "To put it bluntly, you really don't have anything to lose by telling him at this point. And it may be that he feels the same and is struggling with whether to tell you as well (based on your comment about having \"incredible chemistry\" with him). So yes, I would tell him if I were in your position. But I can't tell you how to do it specifically. My advice would be to find a way that is personal to the both of you, though. Maybe while sharing a meal with him at a restaurant you both like? I know that sounds a bit cliché, but I figured a generic example might help illustrate what I mean.",
            "I recently started dating a guy while he was going through radiation. He also doesn't have very long left, but I couldn't live with the regret of not having shared special moments together before he's gone. \n\nHe asked for some time to focus on working and recovering a bit, but I'm still waiting because it's hard to convince my heart otherwise. ",
            "You better update OP! It's gonna be great!",
            "If I may, my story is not about love, but friendship. I had a friend who I really liked and respected. Wasn't really sure if she felt the same way about me but we kept in touch 2-3 times a year while we lived in different parts of the world. A few years back we happen move to the same neighborhood, within walking distance. She told me she had late stage cancer, and that she was going to live the rest of her life the way she wanted. She started to include me in that life at a very intense frequency. I appreciated her friendship, and from her family's point of view, I was her best friend by the time of her funeral. \nThe hole she left in me was huge. It took me more than a year to get over. I have trouble forming close friendships now, and am very picky with people I hang out with. But the time I was able to spend with her knowing we were bound by a very tight friendship was priceless. No regrets. I am so appreciative she included me in the close circle of people she wanted by her side. \nShe was picky, she was choosy and If she wanted someone, she told them and put the onus on the other side because she didn't have the luxury of time. And she taught me to dot the same when the time comes. \nWishing you all the luck and love you absolutely deserve. ",
            "Tell him, and similarly to how you told us. You're not looking for any response, but want to be honest with people in your life. You seem to have a great attitude. Your post made me cry, and I wish so much for you. ",
            "I can't believe so many people are saying \"Just tell him.\"\n\nNo! Don't put that evil on him! Is fucking cruel! If he likes you, you've just condemned him to a life of \"what-if\", and if he doesn't he may feel obligated to say he loves you back when he doesn't!\n\nJust because you are dying doesn't give you license to be selfish.",
            "I sometimes think about a scenario where my world is ending and I question whether it's worse to love someone and not have them with you or to have never loved anyone at all. \n\nI always go with the first one, because at least I'm sure I will die in peace knowing I expressed my love, even if it's not returned. \n\nBe honest, for your own peace of mind. There is nothing to lose but time. ",
            "Which would you regret more?",
            "Its ok to be whistful and say I always thought you were cute I should have asked you out ",
            "Most everyone here is telling you to do it and I also agree. Who knows, maybe you'll kick cancers ass and have a beautiful relationship on top of it. Which I hope happens, because this world doesn't deserve to lose another beautiful soul.\n\nYou know, in a way we're all dying, so I don't think any of us should ever leave this world with regrets. Be as honest as you can be and live your life to the fullest, because you never know when death will show up at your door.\n\nTo end this, here's a quote from one of my favorite movies - \"get busy living or get busy dying.\" Just because you may pass on, doesn't mean you shouldn't start living now.\n\nCarpe diem and I wish you the best.",
            "I'm not crying, you're crying",
            "You should tell him.\n\nI went through chemo and radiation last winter.\n\nYou're right, it's the exact opposite of sexy.\n\nBut he really should know how you feel regardless.\n\nI'm sorry about your prognosis.",
            "My eyes don't stop leaking! ",
            "Good luck, whatever happens, OP. ",
            "I have not much help other than heck yeah go for it! And I also wanted to say I hope that every day treats wonderfully. I know you didn't come looking for any sympathic but best of luck to you for the rest of your journey.",
            "God bless u sweetheart\n",
            "my girlfriend has cancer...i worry about this daily...",
            "I've never been in this kind of situation, though going through a separation and divorce is what I'm currently facing what'd I'd like to tell you is this with confidence it's what I'd personally want to hear...\n\nTell him. Don't lie. Don't hide it. Be open. Others stated about the burden he may potentially bear, life will gives us burdens that we all must bear, that is a fact. Truthfully as odd as it may sound I'd personally want to know because, if not only to make someone else's life awesome; it'd make me feel like I done something right. Which is selfish sounding but, knowing I made that kind of impact on someone would be awesome. I've learned a lot from the 7 year relationship that's now ending and one of them being that no matter what...always communicate. \n\n\n\nAlso....here is a poem that I've always enjoyed and it may be something to pass along to those you find dear...\n\n\n\n\n\nDo not stand at my grave and weep \nI am not there. I do not sleep. \nI am a thousand winds that blow. \nI am the diamond glints on snow. \nI am the sunlight on ripened grain. \nI am the gentle autumn rain. \nWhen you awaken in the morning's hush \nI am the swift uplifting rush \nOf quiet birds in circled flight. \nI am the soft stars that shine at night. \nDo not stand at my grave and cry; \nI am not there. I did not die.\n\nby Mary Elizabeth Frye\n\n\n\n\n\n\nEdit: Formatting/Spelling",
            "You should. That way if you (god forbid) lose your fight you'll have no regrets and it'll be easier to make peace with things. Explain you want no sympathy or pity or anything, only to just get it off your chest. Maybe a FWB type deal or something. Choose to LIVE. If you do end up leaving this world, at least you'll have had fun. Who knows, maybe some love can help make you stronger! Good luck and I wish all the best and hope you beat this. ",
            "OP. Tell him how you feel, and I'm so unbelievably sorry about your situation. Life is so unfair. X",
            "Even if he doesn't return your feelings, it's nice to be told you're loved.",
            "I think this song lyric sums it up best: \"I heard about a woman once who did everything ever asked of her / she died last week and her last words were, 'it wasn't worth it.'\"\n\nTell him.",
            "Damn all of you. This is the most beautiful thread I have ever read.\n\nHope for humanity is somewhat restored.",
            "Do it, and I demand an update.",
            "> I get really sad when I think about dying without telling him how I feel\n\nIn my opinion that is more than enough of a reason to tell him.",
            "Even if you weren't ill, it's never good to hold love back. The worst is that you tried. The best is your love is reciprocated. I'm so sorry you're ill. I wish you happiness in your time ahead. ",
            "Well I agree with everything the top comment said except for the obnoxious part. Trust me OP, people knew you were here, everybody's here for a reason and I am sure you touched hearts and minds in your time here. I am sorry about what's happening. God Bless You always. ",
            "OP, your story made me tear up a bit, and I'm so sorry that you have to go through this, but look at it this way; If he is truly a good friend, he will stick by you through treatment, through the thick and through the thin, but there is the other side to this. He might not share your feelings at all, and he maybe a total jackass about it, how you chose to do this as you were dying, but this is your life, and you can live it as loudly as you want, and you have every right to live it as you choose. May your candle burn brightly and burn long into the night, and may you live with no regrets. \n\nCancer in a relationship is like a grenade, it destroys everything in sight, but if he stays, love him deeply and love him for all its worth. Give him something happy to remember when your gone, and tell him it's ok to move on, and to not let his memories be the sad ones. Tell him not to remember you with no hair, tell him not to remember you in your last days, tell him to remember you as you were, and how you always should be; happy, healthy and living your life out loud. ",
            "Everyone regrets most the \"what ifs\" of their life. Sure, people regret things that didn't go to plan, but that unknowing feeling is worse. Plus maybe he would always want to know if you did like him.\n\nDo it. You have nothing to lose. Tell him how you feel. Tell him how you don't expect anything in return.\n\nDo whatever you want, this is your time and don't shy away from doing anything you might later regret not doing.",
            "Yes. Tell him you don't expect anything, and that the prognosis is grim, but that you needed him to know how you felt. ",
            "I have two friends (guy & girl) who have been best friends for 6 years, completely platonically, and even refer to each other as brother & sister. Just a couple days ago, the guy told the girl he has feelings for her. She doesn't know if she can see him in a romantic light, so things are a bit weird but she isn't freaked out or upset. It's a nice compliment and it makes sense that after being close friends for a while, romantic feelings can come about. \n\nThat being said, if he was able to do it, you should do it too! And with your situation, all the more reason! Life is short in general, but if you know pretty much around the exact time period you're going to pass, then you have all the more reason to kick life's ass while you still can! \n\nI wish you peace & happiness, my friend. Btw, if I may ask (off-topic), do you believe in life after death? ",
            "1) Read 'A Fault in Our Stars'\n2) Cry \n3) Tell him you love him. \n"
        ]
    },
    {
        "post_id": "jk7rde",
        "author": "throwaway1298249002",
        "title": "Final Update: My (19F) bf (22M) doesn't trust me anymore. How can i get him to trust me again?",
        "url": "https://www.reddit.com/r/relationships/comments/jk7rde/final_update_my_19f_bf_22m_doesnt_trust_me/",
        "score": 3015,
        "num_comments": 177,
        "created_utc": 1603968294.0,
        "selftext": "Oh my gosh, thank you for the awards everyone. I feel overwhelmed. I’m so honoured by everyone telling me their stories, I’m saving this post forever to look at if I ever think I should go back. \nIt’s crazy that strangers on the internet have showed me more support in two months than my ex (that feels weird to say lol) boyfriend has in a year is crazy! Thank you kind reddit friends for making my day. \nOh, everyone is saying I should block him. I think I’m going to listen the first time this time and do it! i never thought of that but it’s probably safer for me and my growth... thank you again to everyone, I love you all!\n\n[Previous Post](https://www.reddit.com/r/relationships/comments/ios1a2/my_19f_bf_22m_doesnt_trust_me_anymore_how_can_i/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\ntl;dr: i broke up with my emotionally abusive bf.\n\n\nHi everyone. I posted this almost two months ago, this is been the worst year of my life (with most people I’d imagine lol) and these past two months have been hard too. I just wanted to update and say I broke up with him yesterday. After having a month of space from him i realise that I can’t be in a relationship where I feel like nothing I do is good enough, bc I’m just not good enough for him and I never will be. Idk if anyone would ever be good enough for him tbh. The thought of being single is really scary, and I do feel empty and I do think i’ll always live him, but for my sake i think it’s for the best it ended. Being without him is better than constantly feeling bad for just existing, i think.\n\nHonestly, the scariest thing is before I posted I didn’t even think anything was particularly wrong about our relationship. And I thought if it was it was my fault bc it couldn’t be his. \n\nSo I just wanted to thank the people of this subreddit for waking me up. I was in denial at first but you guys were right. I’m so thankful for everyone who helped me. \n\nStay safe everyone \n<3",
        "permalink": "/r/relationships/comments/jk7rde/final_update_my_19f_bf_22m_doesnt_trust_me/",
        "comments": [
            "Thanks for the update. So glad you have recognized that you deserve to be treated with respect even though being single is scary. Take time to be proud of yourself for making the hard choice.",
            "Emotional/verbal abuse typically escalates at some point. I recently left my abuser and your story reminds me of our early years. In the coming weeks and months, there may be moments you miss him. Stay strong and remember you deserve better! So proud of you!",
            "[deleted]",
            "Just read your whole story... you are so strong for deciding to leave. I wish I had done it when I was your age back when I was with my emotionally/financially abusive bf. It just took me so long to realize that he wasn’t going to change no matter how many times I tried to explain to him my feelings and what he says/does sometimes hurts me. The part where you had poured your heart out and then he ended up making you cry which he then called you “childish” just brought me back to so many times of my bf doing that exact same thing.\n\nI was so numb the first few months after the breakup but then I realized things hurt because I was numb for so long and now my heart had room/time to defrost. Now I am with the sweetest guy who not only is patient when I am emotional/insecure but constantly gives the reassurance I needed. Not saying that having a person makes your life complete, but I am saying that the person you think doesn’t exist is definitely out there ready to treat you the way you deserve. They won’t care about what you wear and will encourage you to be who you want to be. Just gotta figure out who you are and what kind of person you want to be with. Don’t settle for anything less",
            "I am SO PROUD of you for getting out of that situation.",
            "Just read your original post, yeah you 100% did the right thing. Go enjoy (in safe way) exploring your sexuality. Dress how you wish and do what you wish (consenually) with whom you wish. As you grow you will hopefully learn that what you had wasn't love.\n\nMy SO never tells me how to dress, never calls me names, never goes through my phone even though they know all my passwords. \n\nEnjoy college life.",
            "What did he do when you broke up with him?",
            "There is such thing as being surrounded by people, and still feel alone. A partner is meant to enhance your life, not to complete it.\n\nI am glad you got out of it. Take this time as an opportunity to grow as a person, and fill in whatever gap you may have. That way, it will be easier for you to walk away when the next guy comes in, and acts like a jerk.",
            "Good for you! It feels hard now, but years from now, you will be glad you got away. It will get better. You won't feel like this. When you feel tempted to go back, just keep looking at the future and moving forward for yourself. \n\nDon't sit around feeling bad and thinking about him. Throw yourself into a new hobby, or school or career training. Do something for yourself, to make yourself better, for you. \n\nI would encourage you not to jump into another relationship. Being in an abusive relationship warps your sense of what's ok and what's not. You need time and hopefully therapy to help you heal from that. If you can do therapy, please do. ETA: Your school probably has a counseling center with free or low cost sessions.\n\nGood luck! You can do this!",
            "Oh thank god. I was worried about you. Halfway through that original post I was yelling at my phone. Under no circumstances should anyone be yelling at you, calling you names, and intentionally triggering your anxiety. Behavior like his only escalates as you try to do more and more to balance their fragile emotions and get things back to the way they used to be. Good riddance to him.",
            "Thank you for the update, please know this was 100% the right decision, he was a horrible boyfriend, please know there are so many good people out there in your future!",
            "Being single is hard yes but staying with someone emotionally abusive is far worse. It's better you left before he put it in your head you'd never find anyone else, nobody else will want you, etc. But he's wrong. You're only 19 you will find someone else. And if he tries contacting you telling you he's changed and wants you back. Don't. He will pretend to change and be nice to lure you in, let your guard down, then he will start again but worse. Just don't reach out or contact him. You're strong you can do it and you will find someone else which will show him you've moved on past him. Best of luck. <3",
            "He's the one who's not good enough to be in a relationship.",
            "It was textbook abuse, good for you to leave! I can guarantee you will not always love him. You’re 19. When you’re old like me and have found someone who truly loves you, you’ll struggle to even remember this loser. Just relax and take things easy now!",
            "Because it seems like this still needs to be said, the problem is that you are too good for him.",
            "You are SO strong, I’m proud of you for breaking up with him - that’s always the hardest part!!  You’ll be ok - it’s ok to cry and feel sad. I felt that way when I left my abusive bf. You can grieve, but please don’t go back.  I didn’t know why I was crying when he was gone. I felt guilty. I felt like I invested a lot. I got over it pretty quickly and realised it was tears of relief that this cycle was over and he was out. You’ll be ok!!!",
            "I just want you to know that it's not that you weren't good enough, and it's not that no one will be good enough for him. He was a controlling partner, and will always try to be with someone he can control. He was telling you how to dress and that you couldn't hang out with friends. That has nothing to do with you, and everything to do with him. You are good enough, and one day you will find someone who will be overjoyed to get to be with you as you are. \n\nI was also the shy, boyfriendless loner in high school, and I figured I'd die alone as well. I'm 25 now, have had a small handful of relationships since high school (some good, some not good), and am now with a wonderful fella who loves me for who I am in my entirety.",
            "Oh my dear. I just read your original post and update. I'm so sorry all this happened. I am SO glad you got good advice and were able to realize how he was abusing you. \n\nIt's hard to end a relationship. Be proud of yourself for being strong enough to see it was toxic and taking that hard step. \n\nYou're young. Be free. Love yourself and find someone who loves AND respects you. \n\nBe well.",
            "You absolutely did the right thing.\n\nI was with my abusive ex for 7 years. I didn't realize how bad it was until I was out.\n\nHave you thought about going to therapy? I would be very surprised if you didn't have don't serious, life-long scars from him.\n\nAlso, maybe explore why you put up with that nonsense for do long? Your first post said that he made you feel loved for the first time. \n\nWhat was your home like life? Do you have a healthy male role model?",
            "That's how toxic people get to you. 0% of this was your fault, but somehow you has yourself convinced that you should do more to make it okay. I am happy to hear you're out of such a bad situation.",
            "I left my emotionally abusive ex 8 years ago. I was so unsure just after the breakup, but I promise you’ll reach a point where you don’t even think of him anymore except to thank your past self for caring for your future self enough to leave.",
            "Good luck, work on your self esteem and self love. You’re only 19, plenty of good lovers in your future now you know what a bad relationship looks like",
            "Congratulations!\n\nYou are very young and have lots of time to find a guy who a real man and not abusive.  Someone who can make you feel like a partner and make you feel even better about yourself than you'd feel without him, rather than make you feel worse.\n\nMy goal from the time I started dating my wife, well over 40 years ago, to today has always been to let her know I appreciate her and how great a woman she is.  That's because I truly love her and that's how you treat someone you love.  There are plenty of us out there.",
            "Way to go! I'm proud of you- though I, luckily, didn't live with my controlling and manipulative ex, it took me a long time to figure out i want being treated right, and even then I didn't get the strength to break up with him- he left me.  Thankfully I realized it before going back to him. That was years ago now, but I'm so much better off- those were the hardest months of my life since I'd built my future around him and loved him deeply...but honestly once I figured things out and learned to be myself again, I'd never been happier. I was single for a while and met my (now) husband when I wasnt looking for someone- but he was sweet and he's never once called me names, doesn't disrespect me or distrusted me- I have a bunch of friends that I can talk to happily now, and honestly he'd trust me to hang out with even my guy friends alone (I'm straight). We both could look through the other's phone whenever, but he doesnt ask me to because he knows I wouldn't do anything. I waited for MONTHS for the other shoe to drop, for him to show some sign that he was going to get controlling or mean if I did something he didn't like... and it never happened. I go out, I have hobbies, I go to work, I have friends we share and friends that are mostly mine, and behind it all I have a husband (and a toddler now!) who support and love me and want me to be happy. We've been married 8 years now.\n\nAnyway, that's just to say that I can't wait for you to find out how awesome you are without him,  and then one day to find someone who treats you with the unconditional love, trust, and respect people should get and everyone deserves to have. It'll blow your mind just like it did mine :)",
            "Don't think about being single,  think about the new person who will love you how you deserve.",
            "Happy to hear it. You deserve to be loved for who you are TODAY, not tomorrow. He likely has deep emotional problems and it’s not your job in a relationship to be a punching bag for anyone. I’m happy for your future :) as I typed this, the sun came out from behind the clouds for the first time all day. I think the world agrees too 🥰",
            "I’m really really proud of you. I left my emotionally abusive ex this year too and it was terrifying. I went into a pandemic not knowing where I was gonna live or if I could find a job to even support myself. \n\nI got lucky and found my partner and holy hell does he make me happy. He’s kind and respectful, understanding of my boundaries, he listens to me, and above all else I matter more than ANYTHING to him. When I do something that upsets him, I still feel all the love and affection from him I normally do. \n\nI’m also bi and this was something my ex took advantage of. He was on tinder “looking for a girl for a three way” that I didn’t consent to, he would get mad at me when I didn’t want to have a three way with someone else. My identity was a toy to him that he would get upset when I’d withhold. My current partner celebrates my identity and never makes me feel like he’s using it. We’ve also talked about three ways, but I’m involved in the conversation and have my own voice in the discussion. I asked if I can go all out and decorate our front yard for pride and he enthusiastically said yes. \n\nI say this to let you know that there is someone out there who will be the partner you deserve. Someone who doesn’t vilify you for being bi, someone who trusts you to wear a crop top outside, and doesn’t need to search through your phone. I was 25 when I found my partner. It may take you some time but don’t settle for anything less than everything you want. There’s so many people out there that will love and celebrate you exactly as you are. Good luck 🍀",
            "Are you wearing your hair differently or something?\n\nYou look .... taller.",
            "Hey don't get back with him.  I broke up with a guy for the same reason like 15 years ago.  We ran back into each other 8 years ago and got back together.  I thought he changed, he did not.  There is this saying I truly believe \" A woman gets into a relationship hoping to change the man.  A man gets into a relationship hoping that the woman doesn't change.  Both realize how gravely mistaken they are.\"",
            "It gets better, I promise. I left my emotionally abusive ex for similar reasons, I just wasn’t good enough for him and never would be because I couldn’t fit to be who he wanted, and that’s okay. We’re still in occasional contact and we’re both working on ourselves, but we’re happier apart. \n\nI’ll be honest, you are definitely going to feel like you love him for a long time. You may even want to go back to him and just “fix” things and make everything “normal” again, but you know you shouldn’t do that. Time will heal it, time will take the love away. If you ever start to doubt your decision, just know that when thinking of him you’re likely only thinking of good memories and if things were that good, you never would’ve broken up in the first place.\n\nBest of luck. <3",
            "Become your own person. At this point you may not know who “you” is because so much of your formative years have been spent centered around this person but you will find it in time. Don’t obsess over finding someone else right now, just take the time to do things that you wholeheartedly enjoy and hang out with the people that truly bring you joy. Become comfortable with yourself and take the chance to be selfish! This is the best way to heal. Don’t let him manipulate you into going back to him. He just wants his emotional punching bag back. You WILL find someone who loves you for you! There are so many men and women who only have love in their hearts and are itching for someone to give all that to. Stop saying you gave all your life to him, your life is just beginning. It’s going to be so beautiful.",
            "Oh good for you! So many post here for advice about clearly bad situations, and we never see updates. That tells me they stay stuck. I’m so glad you listened to everyone and your own intuition and left a relationship that sadly became toxic. He’s not the only person you’ll ever love. For starters, there’s you! Always love yourself the most.",
            "well done you! getting out of an abusive relationship is so hard, but you will get over it and be stronger before you know it. \n\nFrom my experience you always think, \"oh after \\*this thing\\* they will be nicer to me\" over and over again but trust me it wouldn't have happened. People like this are a disease and they rot you from the inside out. You are 10000x better off without him!\n\nI always think to myself, I wish I never went through my abusive relationship, but it does mean now that I can always see the signs whether it's me dating someone or it's one of my friends talking about the same thing, or about someone their friend is seeing etc., and hopefully can help them see it before it's too late.",
            "Good job to you! No one deserves abuse and it was right for you to get out of that relationship. Stay strong, stay away from him, and improve yourself!\n\nAdvice for the 'blowback'. Likely because you two just broke up, and abusers are going to be more shocked by the lack of control than anything else, he's going to try to get you back under control. Block him from all social media and block his number. Tell all your friends and family they are to not tell him about you regardless of the reason. And then avoid him, sometimes meaning changing your schedule to deliberately avoid him. \n\nIt's better to be alone than to be with toxic/abusive people",
            "You are much much too good for him...",
            "Thanks for the update, and wishing you the best. To be clear - it’s not about anyone being good enough for him. His issue is not with the caliber of the people he dates, but with his own insecurities, his misperception, his anger issues. You are good, and you are good enough, and you never need to change who you are for someone else. Ultimately, he had a problem with your personal (and bodily) autonomy. Autonomy is the most important thing we have as individuals, and no one has the right to take that away from us. Anyone who thinks their own feelings are more important than your bodily autonomy is not a person who deserves to be with you. ❤️",
            "Go on the web and google healthy versesbunhealthy in a love relationship to get a good idea of how it should be.  We all have no clue what we are doing.  But if we look for answers there are much better ways to run a relationship than trial and error.  Start asking the questions to get useful answers.  And ask is talking the same as communication in a relationship, it is not.",
            "I'm so glad to see this update. I was in a relationship for 6 years that is eerily similar to yours and getting out of it was one of the hardest things I've done. It probably doesn't mean much coming from an internet stranger but I'm really proud of you. \n\nIf you're open to advice, I highly recommend that once you get everything out of the apartment and take care of any leasing things, don't tell him where you are. Block his number, his social media, everything. Change your passwords, tell your friends and family that he is not to have any of your contact information. I made the mistake of telling my ex where my new apartment was and didn't block him for a while and he would show up randomly at my apartment and reach out begging for me to take him back. It was terrible and hard and not something you should have to go through. \nAlso, if you're not currently in therapy, I highly highly recommend trying to find a therapist to talk to. There is going to be a lot to unpack in the coming months and years, and there will be things that only a therapist can help you work through. 3 years later and I'm still discovering unhealthy things that I do that are a direct result of long term emotional abuse at a young age / first relationship. \n\nWishing you all the best. If you need someone to talk to, just let me know.",
            "I'm so happy for you. I know it's hard now, but you can only heal from here. Block his number. Block him on social media. He'll try to come back, and baby don't let him. \n\nMy ex started like that and eventually escalated to hitting me, and when I broke up with him he started soft stalking me. Please be safe, and surround yourself with people who really love and care about you. Blessed be, I'll keep you in my thoughts love !!!",
            "That's wonderful.\n\nI want to point out something that you may have realized yourself, but I'm going to mention it just in case because I didn't see it brought up in the last thread:\n\n>now i'm resenting my bisexuality because it caused a series of events that lead to me ruining the only good relationship in my life and i don't even know why. i wish i just kept it to myself.\n\nIf you feel isolated and alone and like no one will ever love you, it's because your boyfriend convinced you to think that way. He was the one who told you not to hang out with other males, and also started questioning you when you hung out with females. The only reason why he was \"the only good relationship in your life\" was because he forced you to cut off *all of your other good relationships*.\n\nAbusers isolate their victims. He did this to you SPECIFICALLY to make you feel like he's the only one in the world who will be there for you. He makes this true by convincing you that you don't need anyone else. It is a self-fulfilling prophecy. DO NOT LISTEN TO THIS LIE.\n\nGood men do *not* do this to the women they love. They encourage their partners to go out and make connections and have full social lives.\n\nI am constantly introducing my girlfriend (who is also bi) to all of my friends (including other men) and encouraging her to hang out with them, ALONE, WITHOUT ME. I know she's loyal. She has no limits, because I trust her (and also because she's an adult and not my property lol). I want her to be happy. And I know that I cannot be the only person in her life.\n\nThis is neither revolutionary, nor spectacular. It does not make me a great boyfriend. Because this is the BARE MINIMUM STANDARD that you should expect from your man.\n\nThis is what trust looks like: not snooping through your phone, not having access to all of your social media, not telling you to cut off your friends. But letting you do as you please, knowing that you are loyal.\n\nPlease go out and reconnect with all of your friends that he forced you to abandon. And never let another man (or woman!) stand between you and your friends ever again. You deserve to have a rich life full of friends and love. You do not ever, EVER need to rely on a single person for this ever again.\n\nNow go out there and thrive.",
            "I am so so glad that you moved on from this relationship. In know way do you or anyone deserve the stress that he seemed to have put you through. No girl ever should be called a slut. EVER! By any many. Even if she is technically a slut she should never ever be called that. It is the most disrespectful term I can think of towards a woman and you are blessed that you don’t have to deal with a guy who does that. \n\nBreak ups are really hard even if you are the one who broke up with him. In time you will get used to the feeling of being single. The best way to get out of break up depression is to make sure you accomplish little tasks every day. Like you can tell yourself, “today I am going to watch my lectures.” Or other small task that we usually find really difficult to do when we go through a break up.\n\nNow that you are single you can focus on yourself. Work on you. Work out more, read a book, do really well in all your classes. Remember that you are an independent woman and you do not need a man to make you happy. So live your happy independent life without a man that will pull you down.",
            "Dude I keep hearing this damme story, I HAD this same story which lead to me breaking up with my first ltr. What is with the distrust of bisexual people?? My ex was furious with me having queer friends and seriously policed my friendships and me bc in their paranoid straight mind, it threatened our 'straight' relationship. Granted, I did say I wanted to lose my virginity to same sex, but I meant it as a \"what a delightful turn of events!\" My ex read it as \"I want to be gay and cheat on you and your genitals aren't enough.\" On the contrary, I hear another route that's taken: My friend came out to her bf and the next (and thankfully last) year was composed of him following her around like a gnat in her face, begging for a threesome, because yeah, that's appropriate, I guess, somehow? If I squint way way down and take enough acid, maybe that will start to make sense. I'm glad you left him.",
            "Wow I just want you to know how absolutely fuccckkkingggg impressed I am with your ability to remove the veil and your feelings from the problem and realize what the right thing to do and how wrong he was for treating you this way. Especially with all the factors added in to it being your first love, losing your virginity, first kiss, being young, ect. Not saying that age has anything to do with these factors because I'm 26 and you're handling this so much better than I'd be able to!! \n\nAs much as you're saying that people on here have helped you through this rough time, just know that this has touched me and I'm sure will reach so many other people. You're strength and ability to listen to your head over your heart when you didnt even realize at first how toxic and wrong the self blaming was .... just chefs kiss!! I dont know you but I'm so proud of you. \n\nI hope you never underestimate how powerful and strong you are. Whenever you're struggling please come back to this to remind yourself how much of a queen you truly are. Like I said, I'm 26 and I wouldn't have been able to handle this situation like you have now nevermind when I was 16. I have a lot of ... insecurities and growth to do with learning to love myself and believing in myself from never receiving that growing up. I can realize problems and know it's not just my fault or anything I'm doing, but I still will accept disrespect or have accepted it because of that lovely trait I have called co dependency 😏😉\nI've now been with my boyfriend who was the \"nice guy\" who I would never before have even given a chance because I just loved being treated like shit.... lmao but giving him a chance was the best thing I ever did. Weve been together for 7 years and hes never called me a name, not saying we havent had problems or issues but, that being said hes never made me believe that theres something wrong with me. That I'm not good enough or that he did such and such because something's \"wrong\" with me. \n\nAnyways, I dont want to make this about me or my suitcase of problems. I just wanted to unpack a little to let you know why this touched me so much. Its so much easier to tell someone what they should and shouldn't do when it's not your relationship with your bu lls hittt savior complex getting in the way. We alllll know what we should do but it's not as easy to go through with it. \n\nI've written soooooo much now so I'm gonna shuttupp.  I literally just made my boyfriend pause his xbox so I could gush about how much of a rockstar you are. Btw he totally agrees! Thank you for posting this. ❤\n\nEDIT: Oh and baby, I completely forgot to touch on this.. we don't slut shame in this house!! Girls are allowed to do anything a man can and even if you have been with 20 guys and went outside in some booty shorts and under boob showing tshirt on with no bra..... youd look bad as shhh-ttt and anyone who says otherwise, just say \"baybeeee your insecurities are showing\" be who you wanna be and dress in whatever makes you feel your best. Sleep with however many men or WOMEN you want to. Anyone who has anything negative to say is just showing a reflection of their insecurities. && if and when you meet someone new, your past is none of their concern. It was before them and they have no right to be mad with what you've done with your temple before them.",
            "Please can you read \"Why Does He Do That\" - it's a guidebook to abusive men and how to spot and avoid them. You can find it online as a pdf.\n\nAlso, I want to put a really fine point on something. This is in no way a case of you \"not being good enough\" for him, his dissatisfaction is with himself and nothing to do with you.",
            "Glad you did it. I’m sure the empty feeling will heal after not too long. Have you thought about staying single for a bit, seeing what it’s like living with just yourself?",
            "You are still in denial.\n\nYou THINK it MIGHT be better to be single than feel bad for existing?\n\nThis needs to be glaringly obvious to you to make sure you don't repeat the mistake.",
            "Wow. That’s horrible. Not far off what my GF does to me so I know how hard it is.",
            "LOwkey itDoesnt sound like your saying the full story",
            "Man, I know your post and in one of the replies you mentioned he was there for you in your high school or whatever iirc and now I understand that he's not ideal but have you tried to help him in any sort of way to try and show him how he behaves and why it is not right? I mean I understand why people just wanna quit relationships but I really hope you gave it a shot after learning that he needs help. Most people with controlling behaviour don't actually know what they're doing to the other person. And it's sad because they either end up alone or cause unhappiness to the person they're with due to situations when people reject them because it reinforces their beliefs. I understand that you don't wanna be with him anymore but I would kindly suggest you try and help him in anyway you can. A shrink is nice but whatever.",
            "I hope u did the right thing becouse so.etimes signals you receive are interpreted wrong. His sadness at seeing the letter could have turned on a defence mode inside of him we really dont know and we interpret things way wrong sometimes. My ex left alot of things unsaid and I interpret the way I feel or see that and I'm sure it's wrong but trust is very hard and it's very complicated if my ex would have trusted me then she would have known I loved her and all I needed was the \" truth \" I could have overcame any of it....its the finding out on your own by accident that hurt me...the finding of her hidden secrets myself by accident...when all honesty i would have still been there and accepted it becouse of my love and i would have been pretty happy becouse i knew she trusted me yet she trusted others whom i believe were wrong to trust... she trusted her ex more than me as it seems so I'm out back... just dont read into things ask questions and those answers will tell your heart the truth... I ask for the truth and got ignored that gave me my answer...good luck and hope it gets better",
            "[removed]",
            "I had a relationship like this. Good for you for being courageous. Part of all the put downs is it destroys your confidence to leave. You’re going to be alright and you’re going to meet someone who truly values you. I did, and I ex-bf is still alone more than 3 years later.",
            "You are young, so you will bounce back. Don't be afraid, trust me. I know its scary especially when we don't know what the future holds but I do believe you will find the right person for you. You are only 19, you got a long road ahead of you, so I think reflecting and getting to know yourself and love yourself would be best. \n\nBe safe out there and good luck :)!",
            "People that cant be single cant be in a relationship.\nIf you being alone constantly trying to get peoples attentions, trying desperately talking to people these are signs you dont like yourself and spending time with yourself. Without own passion, hobbies etc. You wont find a good match as youll try to make other person your passion or hobby.. and people are not that useful",
            "Just found this and read both posts. God damn, well done you for realising what's going on and making a change for the better. It shows incredible strength on your part doing this. Don't worry, it's not hard forever and you will eventually find someone who deserves you. In the mean time, enjoy some you time and all the best ❤️",
            "It takes a whole lot of bravery to leave someone that you’ve been with for so long, even if you know it’s time. I had to do the same thing almost four years ago, but it was truly the best thing that ever happened to me. I’d always thought that he would be the best relationship I’d ever have, but the second I started a new one with my current partner, I realized how wrong I was. \n\nI know it hurts now, and I’m sorry that you’re feeling that. But I promise, you are going to feel so, so much better in the long run! \n\nSO proud of your bravery.",
            "I'm really glad you've gotten away from him. It took real strength to do so",
            "I’m glad you recognized that this was not a good situation and left. Take as much time as you need to heal and focus on yourself.\n\nI was also 18/19 when I was in an abusive relationship with my first love and while it hurt like hell when we broke up, it was the best thing for me.",
            "Yess!!! Omg I am so proud of you!!!",
            "Stay strong! Your situation sounds so so similar to mine so I really am feeling for you! I just want to say, in the future, make sure you are not completely reliant on your partner, it makes it so much harder to leave. He isolated you from your friends for this reason. Get your own driver’s license, make sure you have your own money. You gotta be able to get out of ANY situation if shit goes down. And definitely take a break from dating! My emotionally abusive relationship from 5 years ago still pops up and triggers me. Please feel free to DM me if you need to talk. Sending lots of love!! And again I am SO proud of you for ending it!!!!",
            "Hey, I'm really proud of you.",
            "We are all proud of you.\n\nYou learned a few very valuable lessons here. You learned that your love can be manipulated. You learned that relatinships aren't always what they seem, and that you need to ignore your heart and listen to your head every once in a while. You learned that your best friend really IS your best friend. \n\nAnd you learned that you have it in you to stand up for yourself, even if it means ending the only relationship you've ever known.\n\nUnfortunately, some of the most important lessons in life are also the most painful.\n\nBut you learned them, and you are better for it. Because you won't let someone gaslight again you into thinking things are your fault when they aren't. You will see the red flags before you get overcommitted. And you learned you have the strength, courage, dignity, and self respect to not let this happen to you again.\n\nAnd with that comes a sense of confidence that can't be faked and can't be taught. And that kind of confidence is a VERY attractive trait for others. As long as you hold potential partners to the same standards you will now hold yourself, you will do very very well in relationship life moving forward.\n\nI know it hurts. I know it's scary. I know it's sad. But those feelings will fade over time. And you will be left feeling a sense of pride that will carry you forward.\n\nWe are all very proud of you, and on behalf of all of us, please give your friend the biggest hug in the world. She's one of the good ones.",
            "I read your update on your original post and - what the fuck is \"histrionic\"?\n\nDoes he mean \"hysteric\"? Because, girl, find yourself someone who reads other books than just facebook\n\nIf you are looking for the bright side on this shit-cloud, take it from me who stayed for 3 years in a phyiscal and emotionally abusive relationship. It is better you learn it now/one day, than never. Because you will never live up to his expectations - because there is nothing wrong with you. It's their problem and they are too proud to see it.",
            "You are worthy. You were out here to feel and give love. Take your time to find yourself again.",
            "When you first posted you were feeling hurt and scared, but all the old adages are true: Things will look different before too long.\n\nYou think you love him so much right now, that you'll *always* feel that way, and yet the truth is, you won't. \n\nIn some period of time, which could be weeks, months, or years, you'll think back and wonder how you could have placed so much importance on what this guy thinks.\n\nYou're so young, and you still have so much growing to do. 18-25 are some of the biggest years for change in everyone's life; we do an incredible amount of maturing in those years. \n\nI hope when you look back, you'll appreciate this relationship for what it is: Your first love, your first commitment. \n\nIt is almost inevitable that young love grows apart; the ones that don't, the ones that stay together for the rest of their lives, are very rare and both partners work *very* hard to keep it. I can only think of two couples who met in high school and stayed together. (I'm OLD!)\n\nYou will think about it, ponder it, and learn from it, but remember that love is always waiting. Whether it's the love of a partner, a friend, a child or a pet, love is part of this world and will always be a part of you in some way.\n\nCherish the experience but learn from it. Most important, love yourself and learn to be *alone* with yourself. \n\nBeing alone isn't nearly as scary as it first seems, when you start realizing how many *other* people in your life love and care about you, and that they are still there for you. Your friend has made that clear!\n\nAll the best of luck to you!",
            "You’re doing the right thing. This is so similar to a relationship I was in and I know it’s difficult leaving someone like that. He’s likely not going to make it easy for you to leave and he’ll probably try to manipulate you into getting back together. Stay strong because you are better then the way he treats you. Reach out to your support system as much as possible. Best of luck",
            "I am so happy for you and proud of you for realizing that you're not being treated the way you deserve.  \n\nHow did he take the breakup?",
            "I read your original post and it sounds like guilt maybe?\nHe maybe cheated and wanted to deflect it into you and treated you badly and called you names because he did it?\n\nBut I'm glad you got rid, I'm so sorry for everything you went through.\nIf you need someone to talk too message me xx",
            "I’m sorry you had to go through this, but in a way I’m proud of you too. I also had a boyfriend (6 years older than me) who would try to bully me and call me names when he was upset or insecure to put me in my place. I stayed with him for quite a while until I lost all respect for him and left. I kept going back when he told me he would “change” or “improve” but it was always the same shit. I recommend to never go back, true love has no place for violence, verbal, emotional or physical. I hope you’re doing well.",
            "I read both post. I am a girl myself i would like to give you some advise. \n\nAt first, you are beautiful. Don't let any boy/girl or boyfriend/girlfriend tell you otherwise. \nAt second, you are always allowed to wear the heck you want. No matter how revealing, your bf/gf can tell you they find it too revealing but never change if you think that ain't true. They don't control you. \nAt third, i think it is very stupid that he wanted to look into your phone so much. If any bf/gf ever ask so much to look into your phone, they don't trust you and talk to them. Communication is key. If you can't talk a normal conversation with them. They don't deserve you. \n\nAnd as last. This will hurt and i am very sorry. But it will fade, i promise. And in the meantime, eat icecream, watch movies with your best friend, they are there for you, you just have to ask. Do fun stuff. And don't rush into another relationship if you ain't ready. I read he was your first, that is totally fine. But even with your second, third fourth, etc. Dont rush yourself into doing something you dont want to do. Or you are not comfortable doing with that person. Your opinions/dicisions matter. \n\nWith love and many hugs.",
            "Being single is the only way for you to make room in your life for the man who WILL treat you with love, respect and kindness.  Stay single for a while and get some therapy if you feel like you're still internalizing the horrible things he made you believe about yourself.\n\nAt 29, I broke up with someone who treated me the same way.  I left him just 2 months before our wedding.  IT was scary to be single but I decided to stay single for at least 2 years, get therapy, and really REALLY learn how to love myself and set better standards for how I want to be treated.  I met my husband at 33 and we married when I was 37.  I am SO glad I made room in my life for him by dumping my abuser.\n\nHugs to you.  You are brave and strong",
            "I’m so proud of you OP!! I was about the same age as you when I first wrote in to Reddit about an abusive relationship I didn’t realize was abusive. \nWhat you did wasn’t easy, but I PROMISE it’s the best thing you did for yourself. As for the loner thing, you’re in such an amazing time in your life where you can build yourself to be who you want to be. You no longer have to carry the identity of a loner. \nWho do you want to be? It’s your choice :)",
            "I’m so happy for you!!! \nI did NOT do this when I was in abusive relationships and wasted so much time! The only thing you get from staying in relationships like this is life crippling PTSD (if they don’t severely kill or hurt you)) \nThey do not change, they only get worse, and your mind only gets more fragile as they completely dismantle all of your self worth. \n\nSo happy for you that you did this for yourself!!!!!",
            "Oh I am so glad to hear this. I got shivers reading your original post. This will hurt for a while and feel strange but oh what exciting and wonderful things await you!",
            "Good job! It gets so much better! After settling for less throughout my life, and a toxic marriage, i stuck to my guns and landed an amazing guy who loves me the way i want to be loved, has never raised his voice to me, doesn't struggle with alcohol, is absolutely the man i want to spend the rest of my life with, we still haven't had a fight. Those types exist!",
            "Honestly good for you, that’s not easy to do. My last relationship was *exactly* like this and I promise after you have some time and the rose coloured glasses come off, you wont be missing him much.",
            "Thank goodness. I only read your original post because of this update. I’m thankful you’re in a physical safe place and able to distance yourself from him, especially thankful you removed yourself from an unhealthy relationship.\n\nIt’s good you recognized that deserve respect. Being single can be scary, especially when you’ve been in a relationship for a long time, but take this time to get to know yourself, what you want, and what your interests are.",
            "I was abused for a year before I realized that I'd rather live alone than the way I was living.  Why is being single so scary to so many of us?   In the end I loved being single.  I had no one to answer to.  I did what I wanted when I wanted and I learned that when someone makes me think I'm not good enough, it's not me that has the problem, it's them.  \nHe had low self esteem and so making me feel I did nothing right made him feel better because that's what he felt like and misery loves company.\n So he wanted me to feel as low or lower than he felt so he could feel better about himself.  \nSomeone can only make us feel bad about ourself if we allow them to.  By staying and trying to make them love us only feeds them and gives them what they need.  You become their scape goat.  While  treating them with a gentle heart is attractive to them, but they can't maintain the relationship, because they need to feel better by making someone else feel bad too. \nThese people need therapy to help them, we think showing them love and affection will help them, but it doesn't and we can't.\nYou deserve better.  When you're not happy in a relationship it's time to ask yourself why.  Being single should not be scary for us.  We should all be able to be single.  Do you have family and friends?  If so, you are not alone.  A bad relationship is not better than no relationship.  No relationship is just temporary, and in the meantime, you'll learn important things about who you are, what you want in a bf/gf.  You'll learn how to recognize true love, because we don't really love someone that abuses us.  How many people end up staying with the first person they ever felt they loved?  Some, but not many.  Dating is like trying on clothes, you take a lot of things you think you like into the dressing room, but find that they don't all fit in a way that makes you look your best.  You don't buy them all, you only buy what fits perfect and makes you feel happy when you wear it.  It's even more important with a SO... Marriage should be for life.  It takes 2 years to really know if you love someone.  You could be infatuated or obsessed with them, but that's not love.  \nYou did good, I'm proud of you, I know it's not easy, but you took the first step to finding your path to happiness.  We need to be happy with ourselves and not depend on other people too make us happy.  No one should expect that from anyone.  It's no one's job to make us happy.  The happiness in a relationship, comes from being with someone that brings us joy when we're with them.  We should not expect it from anyone,  and no one should expect that from us.  That's how we get disappointed. We expect things we don't get, we become disappointed.  We have to learn not to expect anything, then whatever is given is a gift\nWhen I got divorced I was afraid to be single again, but I was happy, because think of it this way....if every time you saw someone they hit you in the head, then when they are gone there's no more headaches and that alone makes you happy.  \nSo I hope you find your happiness in being single.  We all need to learn how to be by ourselves.  It's a great life lesson!",
            "It’s not that you’re not good enough for him. He’s not good enough for you. You deserve way better. You’re also too young to be scared of being single; being single allows you to discover who you really are and it’s a great adventure. I wish you well and I am so damn proud of you for breaking up with him!",
            "Good for you!!\n\nLeaving a relationship is scary, and painful at first because it’s hard to adjust to having constant companionship to suddenly having a lot of alone time. And, I know going through that during COVID adds an extra layer to it. But, I hope you’ll soon learn that being single isn’t anything to be afraid of! \n\nSpend some time feeling your emotions, and then focus on doing what you like to do, wear what you want, see who you want, and spend every day the way that you want to (if that’s spending “too much time” online or just being out and about, or napping, who cares!)\n\nNobody has a right to dictate how you live your life, whether you love each other or not. This is the most important thing to take away from this experience. \n\nIn a healthy relationship, you don’t have to tiptoe around because the other person is doing work, or being worried that you spending time online is annoying. It’s not. It’s your time and your life. \n\nI really urge you not to jump into another relationship anytime soon, even though I know it’s tempting when the opportunity comes around. You don’t even know what you don’t know yet. Give yourself time to learn it, to experience the world without someone else’s criticism or commentary, and then find the person who fits with what you want from life - and who doesn’t expect you to bend over backwards to suit them. \n\nGood luck, OP. You can do this and you’ll be amazing! I’m so excited for you.",
            "Am man, he was not a cool guy, you did the right thing.",
            "I agree with the last sentence of your first apragraph. I feel better when Im not around abusive assholes I met in school as well",
            "The right thing to do isn't always the easiest. There are lessons learned and you are heading in the right direction. You will get through it and more importantly, better than where you started. \n\nTake back that control he had over you. But don't be too afraid to love again in the future. Life is messy, you are experiencing that right now. We all are. Again with lessons learned, you'll be better and one day, find happiness not only with yourself, but with the right partner.  Good luck and be safe. You finally be you.",
            "Being single feels scary at first, but it’s really great in a lot of ways! You get to learn more about yourself and feel confident in who you are. Then when you start looking to date again, you have a better sense of what you want and what your boundaries are. Best of luck!",
            "Also depending on the type of person be careful with a block could cause crazy ideas and serious abuse just dont read or respond and he will never know the difference be careful",
            "In the next few weeks and months you’ll probably be seeing a lot of his behavior in a new light and coming to more realizations.. I’m so sorry this happened to you. I hope you’re able to heal swiftly from this and please don’t hesitate to reach out for support. There are some subs like r/justnoso that might be helpful and supportive. 💙",
            "I'm so glad you're out of that horrible relationship. Now you have time to explore yourself as a single person. Maybe you'll find a really good gf/bf in a few years but for now just enjoy your single , uni life 🌺. Oh btw how do you know you are bi if you have only committed sexual acts with one person ( a male).  Just curious.",
            "From one bi girl to another, it's not worth dating anyone who sees our sexuality as a negative thing. It's not even worth dating someone who ignores our sexuality (acts like we're straight / lesbian depending on who we're dating).\n\nGood on you for advocating for yourself. There are plenty of fish in the sea that will love you for who you are, not what they want you to be.",
            "Thanks for the update. He can live with his perfect self. 🙄 Don’t let him shame you into taking him back. Shut the door and lock it. I went through the same. I didn’t look back. Although I’ve had many realizations since.",
            "I'm so happy for you. There will be a lot of decoding in the coming months and years. When I started dating again, there were things that I did and ways that I felt that were at odds with the the person I was with and how they felt. I realized that these behaviors were remnants of my relationship with my ex. One example being feeling extreme guilt for \"noticing\" other people. When I confessed this to the guy I was dating because of how horrible I felt he was very confused. Turns out healthy and well adjusted men understand that crushes and attraction to other people outside of your committed relationship is normal, healthy even! Who knew? \n\nMy advice to you is to always be asking yourself: am I happy? Am I healthy? If I had known to ask myself that (truly ask myself, and not lie about) I would not have been in out of that toxic relationship wayyy earlier. If you ever answer no to that question, the next step is to do something about it. You are a strong and beautiful person. Don't entertain any leeches!",
            "I'm glad you got out of that abusive relationship, it was definitely doing you more harm than good. \n\nHowever, as a fellow nineteen year old, I feel I should stress to you please don't feel afraid about being single. You have your whole life ahead of you, and it's not a bad thing to have some time to work yourself out. Everything will work out for you in due time ❤️",
            "Good for you! This is a brand new chapter and you have the chance to start over and learn and grow and do amazing things all for yourself! You’re going to do great :)",
            "Wonderful news! Keep on going, you can do it!",
            "I’m so sorry you went through that but you deserve a partner who loves you and supports you not hold you back and manipulated and belittles you",
            "Proud of you. Seconding the STD test, you can't trust this guy. In case no one's posted it, you may want to read the lingo at r/raisedbynarcissists to prepare yourself for how he may escalate things in case he can find you still. Some tactics are pretty common in men with women-hating psychological issues, though the sub is primarily based around narcissistic families, which it sounds like he may have grown up in. Don't let that make you feel sorry for him though. Any attempt of him being sweet now is likely to backfire into a vocal barb at best or a theft/assault at worst. A lot of women are most vulnerable the following months after they leave an abusive partner so please be safe OP.",
            "Yeah his trust issues are on him, not you, to fix.",
            "you are good enough. HE isn’t good enough for you. you are more than enough",
            "I felt so bad when I read your first post. I'm glad you're in a better place now!",
            "Being single as an adult is a scary prospect but I just want to tell you that **you’ll be okay**. Don't be afraid to be single for a while. I understand the need for companionship but after a long relationship, it's good to take some time for yourself. Keep your heart open but don't rush into anything.",
            "I'm so glad this story had a happy ending(:",
            "As soon as I read the snap at you about \"not seeing your ugly face...\" clincher. Anyone that actively punishes others for trying to help them is beyond approach. They want a miracle, magic tricks every day without disappointment. Either they change themselves or they fester like a boil",
            "I’m so glad you got out OP. You did really well to do so and really hear what other commenters were saying, because your boyfriend was controlling you. Basically abuser 101 textbook in the way he was isolating you, controlling what you wear, not letting you have friends etc. And it would only have escalated the way he was talking to you.\n\nYou deserve so much better, good luck 🥰",
            "Oh my god so proud of you!!!!!",
            "Here’s a silver award.",
            "Your original post had so many of the markers of abusive behaviour - his failure to take responsibility for his emotions, his desire to control your time, body/clothing and other relationships, his expectation that he should be able to do things like police your phone, his unreasonable and constantly changing goalposts... and even the small stuff which might mean nothing when taken individually, like the fact that you did ALL the chores, and he doesn't like your only friend (classic isolation behaviour),  So glad you've got out. This stuff would have only escalated!"
        ]
    }
]