[
    {
        "post_id": "vbmdcu",
        "author": "florarae",
        "title": "My husband is reluctant to be intimate with me after I was in a major accident…. An Update",
        "url": "https://www.reddit.com/r/relationships/comments/vbmdcu/my_husband_is_reluctant_to_be_intimate_with_me/",
        "score": 7027,
        "num_comments": 143,
        "created_utc": 1655154162.0,
        "selftext": "A link to the original post: https://www.reddit.com/r/relationships/comments/uw5mvv/my_husband_is_reluctant_to_be_intimate_with_me/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nHi everyone. First of all, I want to say I was absolutely blown away by the outpouring of love and support I received on my first post. I never could have imagined it would blow up like that and I received so many thoughtful and kind comments and messages from strangers. \n\nThat being said, when I wrote that, I was in a weird place. Physically I had mostly healed but I was determined to shove down any emotional trauma because I was so exhausted from the previous months of work trying to heal my body. I wanted to be alright, and I wanted my marriage to be the same as it was before the accident. \n\nMy husband and I just attended our third marriage counseling appointment and I’m very happy to report the exercises and worksheets we’ve been given are helping rebuild the husband/wife relationship instead of the caregiver/patient relationship which has been present for the last 5 months. My husband just had his first individual therapy appointment a few days ago and I have mine next week. In short, we’re putting in the work. \n\nWe’re also having sex again! Like, *a lot* of sex! I feel silly bragging about that to the internet at large, but it makes me so happy that we’ve figured out that part of all this. Prior to the accident and really throughout our whole relationship we’ve been so ridiculously into each other, it was rare we even skipped a day. I missed having that connection to him and he was clearly hurting too. \n\nAnyway. I just thought everyone deserved an update ♥️♥️♥️♥️\n\n\nTL:Dr- we’re getting better!",
        "permalink": "/r/relationships/comments/vbmdcu/my_husband_is_reluctant_to_be_intimate_with_me/",
        "comments": [
            "I'm so so pleased to hear this. Reading your first post made me tear up a little and I'm thrilled you're doing better (and getting all the sex!). The kind of love you have is the kind poets write about. I wish you and hubs all the healing and happiness.",
            "Brag away! I'm glad you guys are doing well; thanks for the update. ❤️",
            "Hey OP. I've been thinking about your post. I am so, so glad to hear you guys have reconnected.. It varies for everyone but I understand intimacy being a huge part of your emotional needs in your relationship.\n\nI'm curious what you'd care to share about your husband's perspective/breakthrough/etc on this?  I think it'd be helpful for some to hear whatever you care to share and if not or too private tooootally understand.",
            "I mean this not at all ironically - congrats on the sex!",
            "Rereading your first post, your edit to update that first post, and then this update, and I have to say that I am SO happy for you two. It is amazing how you are healing physically, and how you both are healing mentally, and especially how you have been able to do it **together**. Sudden changes in life can be terrifying to the point where we subconsciously hide our trauma to the point where even we ourselves don't realize it. \n\nI am so happy that you have each other, and am sending you all the good vibes, albeit as a random internet stranger, to you both. Much love, random stranger! Keep healing! \n\nEdit: fixed typos, \"thw\" to \"the\" and \"qhere\" to \"where\"",
            "I am so happy for you! Thank you for the update ✨",
            "So glad to read this update! It is inspirational to read about you two putting in the work and getting back into it [pun intended]. Cheering you on this journey!",
            "Was so excited to see this update - keep on keepin' on!",
            "This is the heart warming /relationships post of the day.",
            "Yay! I don't know what else to say but that's cool beans.",
            "This gives me hope ❤️ I’m currently a caregiver to my fiancé after serious illness that had him in the hospital for 3 months and still recovering at home as we approach a year since hospitalization. Caregiving is hard and I’m still working through the trauma of watching him bleed out in front of me, but I still feel guilty that I can’t give him what he wants. He’s so patient and understanding, but I haven’t been able to explain why. I think I’m just not mentally safe yet. Your post has given me the worlds to explain why to him. Thank you.",
            "You treat each other like partners, taking care of that partnership, giving each of you the space to grow there. You're both brave enough to reach out not only to each other, but third party help (pro counseling) to help things along with supplemental nurture if needed. Cherish your time together. I've lost two loves (meningitis and cancer), great partners, and the best part of the time with them is not taking them for granted while I had them, we took good care of what we had while we had it. That always seems to be the hallmark of the great loves, you appreciate what you have so much while you have it.",
            "I am so happy for you! To a lesser extent my fiancé saw me faint and pass out and hit my head a week or so ago in the shower. When I came to he was literally shaking and would not let me go. He kept apologising that he couldn’t catch me right so I still hit my head. I kept telling him I was fine but he was so shaken he took me straight to the ER. I genuinely believe that for me it was fine a “shit happens” moment but for him truly traumatising. From what he said he thought I had an aneurism because I was out for a solid minute. He is still treating me like I could break at any moment. Annoying but I totally understand it. It’s super scary to see someone you love, who you believe will be with you for the rest of your life have a human moment which proves the fragility of life.",
            "Followed the original story.  Thanks for the update!",
            "Ah damn it's raining on my face.",
            "How someone can be through something so traumatic(the accident) and maintain such an upbeat attitude and positive outlook on life is something hard for me to understand. You have a gift and I admire you. Good luck on your recovery! 👍🏻",
            "This is such a lovely update to hear. I'm so happy for you both!\n\nThe therapy is a great idea and it's wonderful that you are finding your way back to one another.",
            "Awwwwwww. My husband and I have the same age gap. 15+. I cried with your fist update on your first post. So happy for you guys 🥺🥺❤️❤️❤️",
            "I’m so happy for you both! This is the best kind of update. 💕",
            "Delightful. May you both enjoy one another for many more years to come.",
            "I teared up a little reading this, it’s such a sweet story",
            "Reading your original post and update brought tears to my eyes. This is the sort of love and commitment people dream of finding. I'm glad to hear you are getting better physically and that you are both working through the trauma together and separately ♥️",
            "I only just read your first post (upon seeing this one), but I'm so glad to see everything turned out okay! Your husband deserves a \"best husband of the year\" award or something. You really caught yourself a great one.",
            "In the past six months I've read close to a gazillion stories on Reditt and virtually all of them end with commenters suggesting NC and divorce.\n\nIt's so good to read an update like yours where there's such a wondrous turn of events.\n\nBrava to you.  And get your rest because it sounds as if maybe someone may be trying to make up for lost time.",
            "Glad to know you are getting absolutely railed again.",
            "Any way you could share those worksheets?",
            "I remember your post. Glad y'all are doing well.",
            "That’s awesome! I’m glad that you both went into therapy with an open mind and have found it helpful in rebuilding emotional/physical intimacy. I always love seeing positive updates for stories like these",
            "That is wonderful news! My very best to you and your husband.",
            "Yay! I remember your post and felt so bad but read how much he loves you!",
            "I am so happy for both of you! Thank you for the sweet update.",
            "I am so happy for you!! Congrats to the both of you for working together to fix your relationship!",
            "Reading about how much your husband loved you in your update on the original post almost made me cry. Blessings to you both.",
            "i remember your first post and my heart hurt so much for you, i’m soooo glad to see things are turning around !!!!! hope your health is well too, of course !! yaaay we love a happy ending :’)",
            "Happy Ending Trophy for you both!!! 🏆❤️",
            "Aw happy for you OP! Enjoy all the sex and everything else as well :)",
            "AHHHH, a sigh of relief. There's nothing better than a \\*good\\* update. Happy for you and your husband. :)",
            "YAY!\nOh joy, a glorious update to hear! So glad life is moving forward for you.",
            "It makes me very happy to see the two of you improving!",
            "I am glad he is getting help to deal with the mental trauma. Glad you guys are thriving.",
            "Yay!  I remember that and I’m really happy for you.",
            "After a really rough weekend health wise, I spent today kind of feeling “bleh” about everything.  Reading this just MADE MY DAY, and I can’t tell you how happy I am to read that relationships like yours still exist and how beautifully you two seem to be overcoming your hurdles.  And hell yes, brag about the sex!  It’s a huge win and must feel really wonderful for both of you to be blossoming in this part of your connection again.  So so happy for both of you, and I hope you both feel proud of how significant the steps are that you’ve been taking.  Bravo!",
            "I AM ACTUALLY BAWLING I LOVE THIS SONG",
            "I am so happy for you and your hubby!Both the physical and sexual healing",
            "I'm so glad to hear things are going so well. Sounds like you've both taken really responsible, healthy steps in recovering from the multiple traumas you each went through. It'll always be different, but therapy will give you the tools to approach, handle, and accept those differences and thrive in spite of that.",
            "I’m so happy for you both, the original post left me teary eyed but I’m so glad this has such a happy update. Wishing you love, happiness and lots of segggggs 😉",
            "Thanks for the update, and congrats on the sex!!! Your first post made me cry, because you two have both been through so much. I’m so happy to know you’re both on your way to healing individually and as a couple 💕💕",
            "I remember you! Congratulations",
            "Good for you 🙂\nThis story made me smile today",
            "I’m so happy to hear this. Congrats on the sex!!",
            "Oohh! I actually remember your original post and I was hoping to get an update (didnt realize there was an update on the original as well lol). I'm so so glad to hear things are better! It was obvious from your original post that you both deeply love and care for each other and I'm so happy to hear you are working through it! I wish you all the best!",
            "Awwww <3 I'm so happy for you that the physical and emotional connection is back! One of the great things about an anon forum is that you can brag about your sex life and we're all here to applaud!!",
            "Im happy for you guys!",
            "Girl go look at Rihanna line of stuff. I bought me some peak covid and it gets me right everyday 🤞😂 have you feeling like the baddest in the world im telling ya",
            "Hell yeah! I’m so happy for you, your husband, and your marriage!",
            "im so happy that you two have gotten better now! I have been wondering how are you doing, well, good day to you!",
            "I remember your original post and this makes me so happy!!",
            "This was the joy that I didn't realise I needed today! \n\nWhilst not an accident, I (34F) have MS which was diagnosed two years ago and have a level of disability associated with it. \n\nWorking through the grief and emotions surrounding it with my husband (33M) has been such a difficult but wonderful journey and it's so refreshing and just plain beautiful to have read your story. \n\nYou go girl; writing all the things and getting all the sex! I'm so proud of the both of you =).",
            "I am elated that you and your husband have talked things out gone to therapy and life is getting back to normal for the both of you. I wish you and your husband the very best for the future",
            "Awww what a happy update. Different but similar caregiver/taker scenario and had success doing the same thing. Therapy works wonders people!",
            "I read the OP and the update and it’s not often reading Reddit posts evoke heavy emotion for me but your original post did.\n\nSo glad you’ve made such strides on your physical therapy progress that you can start addressing the mental and emotional trauma that comes with a major [near death] accident.\n\nYour husband is one of the good ones 💗",
            "Thanks for updating us OP.\nIt's great to hear that you're healing on an \"all-round\" level and you can start to enjoy your partner in that way too.\nKudos to him for putting in the work and being honest about how he felt.\nWish you guys the best ❤️",
            "Thank you for the update!\nEnjoy your life and always try to accommodate. \nGood luck in life!",
            "So nice to read a good story here for once",
            "I'm so happy to hear this!!! I remember that last post! Very happy for you both, there was never a doubt about his love, and it was clear there was some kind of shift that needed to happen!\nWell done on therapy.",
            "This hit me right in the feels",
            "Yessssss, this update is wonderful!\n\nGood on both of you for putting in the work, this is a true team - loving this.\n\nAll the very best with your continued recovery!",
            "I'm so glad you updated this, I'm super happy for you!!!",
            "I saw your original post, OP, and I hope you don't mind me saying that I've not been so happy to hear that someone's getting laid in a long time ^_^ Enjoy your life with your husband, and stay happy!",
            "So happy for you and the hubby <3",
            "So glad to hear that! Congrats to both of you! ❤️",
            "I'm so happy that you two are still putting in the work! I cannot imagine the trauma of hearing that unfold...",
            "i'm so happy for you! congrats OP, not just on your amazing recovery, but on your wonderful marriage to an amazing partner :)",
            "Wow its one of those updates that make me happy. YaY for sex! Seriously happy for you that you are working through this as a team!",
            "Oh wow. I remember your original post well. Life stories that turn out like this are wholesome to read. You found each other and faced so much together already. It is so great that you also have that physical part of your connection again. \n\nThey way you write about him and what you tell us about you just makes me feel happy that love like this exists. Treaure it, cherish it and have a great life together for as long as it is possible.\n\nGood luck, much love and health to the both of you.",
            "Yes I love reading these! Keep the updates coming!",
            "gah - thanks so much for the update.  So happy for you guys and it's a nice change to hear some good news these days!!",
            "Saw the title and instantly remembered your other post. So happy to see the update for this!",
            "God bless the modern practice of therapy, and the training, education, and knowledge that good therapists have about human behavior and how to overcome mental obstacles.\n\nI can't imagine that job.",
            "I’m glad it worked out in the end. He clearly loved you very much",
            "Omg what a wonderful update! I’m so thrilled for you guys. Fucking shout out therapy oh my god I wish everyone could have therapy it’s such an incredible resource",
            "Woo! Amazing to hear! Would you be comfortable sharing the type of worksheets the therapist had you doing? Myself and my partner are on a couple waitlist for couples counseling for something sort of similar (limited sex life after severe depression and self injury). The depression has passed but our sex life is lagging way behind the emotional and physical affection.Having some things to try in the meantime would be fun!",
            "This is very good news. Your story before this update made me feel so sad to both of you. It is great that the situation is finally turning around to the positive.",
            "hey, just stumbled across your story and I happy to hear you guys worked everything out and after reading your original post that you made a fu recovery. wishing you both all the best ❤️",
            "That is so heartwarming.",
            "These posts have made me cry many happy tears. 🥰😍😭",
            "I teared up at your first post",
            "Dude I have never been so excited that a stranger on the internet is having sex. good for you!!!",
            "I’m sooooo late to this but I’m soooooo soooo sooooo happy for you!!! You and your husband deserve all the happiness!!",
            "So I just came across this. I'm so happy. I read the original first and I knew he was worried about hurting you because he loved you so much. When I read the update I was praying to God you guys got therapy and not a divorce. Hallelujah. (Yes I know I'm 2 month late but still happy about this update. I'm going to go looking at your account hoping for another positive update. That would just be icing though. This would be the cake.",
            "I love you two so much! All the very best in your recovery and wishing you both a lifetime of happiness and good sex!",
            "I enjoyed reading these 2 posts. Almost started crying at the first update where you told him \"if you need to cry then cry\". This really showed how we bottle up our emotions until the very last moment. Your husband is my new idol.",
            "the original story and updates gave me tears.  hope you are both doing well.",
            "Wow your relationship sounds like a fantasy. How did you two meet, if I may ask?",
            "I’m late to the party but congrats to you both",
            "this post is truly beautiful"
        ]
    },
    {
        "post_id": "cvblpb",
        "author": "Greyhound_Throwback",
        "title": "UPDATE: I [24F] am at the end of my rope with my wife [27F].",
        "url": "https://www.reddit.com/r/relationships/comments/cvblpb/update_i_24f_am_at_the_end_of_my_rope_with_my/",
        "score": 6987,
        "num_comments": 234,
        "created_utc": 1566755065.0,
        "selftext": "Hello, everyone.\n\n[I wrote here two months ago about my relationship with my wife.](https://www.reddit.com/r/relationships/comments/c3ms1o/i_24f_am_at_the_end_of_my_rope_with_my_wife_27f/?utm_source=share&utm_medium=ios_app) She was a hoarder and had a litany of other issues that were above my pay grade. I asked Reddit if I should leave by July 1, and it was unanimous that I absolutely should.\n\nI didn’t leave July 1.\n\nI left the night of June 30.\n\nThe cleaning didn’t get done, surprising literally no one. We were driving to our apartment and I told her that I was really crestfallen about July 1.\n\n“Why? Is that a bad date for you or something?”\n\nI was furious, but kept it to myself. I told her how I felt, and I reminded her of my deadline. I told her that I was moving out and that I was done.\n\nShe cried and cried and cried, and begged for a week to clean the apartment to “show that she was committed to this marriage”. I said that she was free to do it, but I wasn’t going to sleep there during that, and I moved in with my friend. We agreed to reassess the condition of the apartment Sunday morning. \n\nShe told me how spiritually edifying it was to clean. I was really optimistic for a bit. \n\nWednesday comes and my FIL calls me, frantic. He’s like a dad to me. He tells me that my wife emailed him (which she never talks to him unless she has to), and I asked why. He told me that she begged him to tell me to ‘come back home’. He remarked that it was bizarre, but I was incensed. “No, FIL, it’s not bizarre, it’s shitty. She’s trying to leverage you though our relationship to get me back.”\n\nSaturday comes and she sends me a message on Facebook saying “you know, it doesn’t look as good as I wanted it to physically, but I feel like I’ve made a lot of progress emotionally and *isn’t that what matters?*”\n\nI told her that such progress would have been appreciated two years ago, but I had to walk- I couldn’t do it any more.\n\nShe spent money online with our card without informing me on yarn and we had a disagreement about it. I told her that I wanted the bank account closed, but she “couldn’t bear to see me in person”. I redirected my checks to a new account instead.\n\nIt had been weeks and I finally went back to get my things and it got a lot worse. There was a water leak in the carpet, the litter boxes weren’t taken care of since I took care of them the day I left, and she managed to move the microwave into her bedroom. The latter was particularly surprising because she refused to move anything heavier than 10 lbs because of a cited rotator cuff injury for years and yet got a 40 lbs microwave into her room.\n\nI reported the conditions to my MIL, who co-signed the lease with us. She called me back to bemoan “what am I going to do about my daughter? You don’t understand how hard it is to have to think about how to take care of her!”\n\nI snapped at MIL about her nonsense. She asked me what she should do about my ex-wife, feeding her histrionic personality. I told her that I had no idea, but she signed papers 27 years ago that made it her responsibility and not mine.\n\nI’m happily living with my friend. Her and I are currently figuring out what we are, but we’re being supportive of each other and making each other lives easier. We both just celebrated birthdays (happy quarter-century!) and that was perfect. \n\nI’ve been told that my ex-wife has had a much more rigid and stoic affect since I left. MIL told me that she didn’t even say she missed me. “It’d be nice if she came back.”\n\nI heard from FIL that they’re mad that the car I have is in my name; it was given to me as a graduation present, and was an old family car.\n\nI start my new job tomorrow. I’ve been getting ready all last week and I am so nervous but so excited.\n\nI’m really glad I left.\n\nTL;DR: My wife begged me for her last second chance, still didn’t do anything. Tried to get her dad to bend my arm to come back. She wrecked the apartment even more since I left, so I notified MIL. MIL is more concerned about herself than her daughter. I’m happy with my friend and I start my big girl job tomorrow, and thank God.\n\nEDIT: I made this clarification in the comments, but it needs to be said- I was estranged from my friend when I got with my wife. I was disowned for being gay by my family and had to immediately leave college and sought refuge with my ex-wife, and my friend and I fell out of contact. We got into contact again this year when I was interviewing for jobs in the area where she lived, not knowing that she was there. I’m trying to figure out how we’re going to be roommates in the long-term, and for how long, etc. Logistics.",
        "permalink": "/r/relationships/comments/cvblpb/update_i_24f_am_at_the_end_of_my_rope_with_my/",
        "comments": [
            "You need to close the bank account you own jointly. If she overdraws and doesn’t pay, you will be just as responsible even if you didn’t make the charges! It only takes one person to close a bank account so you shouldn’t need to get her there.",
            "Can you call animal control for the cats? Good for you for moving on! Best of luck",
            "> She called me back to bemoan “what am I going to do about my daughter? You don’t understand how hard it is to have to think about how to take care of her!” \n\nOkay, this irked me.  You're the one who had to freaking live with her!  Now her mom is heaping guilt trip on you because *she's* overwhelmed.",
            "“Currently figuring out what we are” Be careful op if you are still legally married in case your wife somehow finds out until the divorce is settled. Depending on what state you’re in and what you both agreed on (doesn’t sound like your wife agreed), it might have ramifications despite the clear hoarder situation.",
            "Good for you OP!!! This hit hard for me - I'm 9 months in on therapy for hoarding. It is a hard fight with my own brain every dang day, but I WANTED to change and be better. It's a huge rock to crawl out from under and I hope your ex can do that for herself, because it seems like she was just trying to drag you under the rock too.\n\nYou deserve a good life. I wish you all the happiness in the world.",
            "You should get the cats. They don’t deserve a horrible life in that apartment full of cat shit and garbage.",
            "First of all, congratulations on taking the steps to leave, and good luck on your new job!\n\n\\> She spent money online with our card without informing me on yarn and we had a disagreement about it. I told her that I wanted the bank account closed, but she “couldn’t bear to see me in person”. I redirected my checks to a new account instead.\n\nI feel this should be dealt with, I don't know if you have a LOC or overdraft, or any way for that account to accumulate debt, but I see no reason to keep the account as a potential liability at all. I am not sure where you are in the divorce process and if there was any division of assets, what is in the account etc, maybe speak to your lawyer, but you should be able to close out without your ex present.\n\nGood luck OP  I hope your life continues on the upward trajectory that you are working so hard on!",
            "Ok, but your fuck up is that you haven't legally separated from her. All money and debts and contracts (lease) are still jointly bound and she is dragging you down too. You needed to speak to a divorce attorney before your July 1st deadline.",
            "> “No, FIL, it’s not bizarre, it’s shitty. She’s trying to leverage you though our relationship to get me back.”\n\nTelling your father-in-law straight up that his daughter is a lazy manipulator who's using him as a pawn to recoup the marriage: one of the bravest and most adult things I've read on this forum. Well done, OP.\n\nI'm proud you didn't let your in-laws guilt you and gift-shame you into returning to their daughter's awful arms. The car was put in your name because it was a no-strings-attached gift, and they were wrong to harrass you about it. \n\nThey raised their daughter and know her, so they should be mad at her shabby treatment of you, not the other way around. Her behavior after you left is all the evidence one needs to conclude she was in the wrong.",
            "I feel like I need to clarify the comment about my friend.\n\nWe were estranged when I got with my wife, so the “figuring out what we are” is figuring out what bygones are bygones.",
            "Really happy that you're moving forward with your life and not letting her hold you back. Stay strong, friend!",
            "You can't save someone who refuses to make any effort to help herself. You have to do what you got to do keep yourself healthy. \n\nI read the original post and do think it's bullshit that her doc won't prescribe antidepressants because she's fat. Even if she is depressed because of her weight, she would likely benefit from meds. I wouldn't be surprised if she was offered meds but just didn't want to get better.",
            "Congrats on making the break. Best of luck to you on your new life and new job!",
            "Why the fuck would you have a microwave in the bedroom?!  That’s utterly bizarre",
            "[deleted]",
            "You're doing the right thing for you. Especially considering she wasn't very concerned about your mental wellbeing while building an entire world that revolved around hers. She needs help, the kind of help you're not equipped to offer. Good for you for out of there, and i'm glad you have support.",
            "I know things are still hard right now, but it takes a very strong person to remove that toxicity from their life. I hope  your days get easier from now on.",
            "Freeze your credit and close all joint accounts. Speaking from experience.",
            "It sounds like you’re uhauling. I see you’re trying to justify the “figuring it out comment “ but it seems obvious from your wording that there may be romantic feelings there.\n\nFurthermore, if this were written from a male perspective, you’d be roasted. Cutting off your emotionally unstable wife financially is not okay. No one forced you to get married, and as the primarily breadwinner, you’re going to have to realize that you will need to provide some form of spousal support, and that unilaterally emptying the bank accounts is NOT legal.",
            "I'm so happy you're out of that situation. I hope all the best for your future.  ❤",
            "> “What am I going to do about my daughter? You don’t understand how hard it is to have to think about how to take care of her!”\n\nExcuse me?! You know EXACTLY how hard it is. YOU did it. That remark is absolute BS.\n\nAnd why exactly are they upset that YOUR car is in YOUR name?\n\nI’m so glad you’re out of that situation. You have your life back and now you can find a partner who loves you, not a child who loves the convenience of you.",
            "Have you done anything legally to protect yourself with the apartment? She sounds like she's on her way to an eviction. You don't want that on your record.",
            "That happened to me with an ex. He kicked me out and my pets were still there. When i was able to get everything at once I went back and the littler boxes were full completely. I felt so bad for my cats. I had 3 litter boxes for each cat and I also had ferrets. 3 ferrets and numerous litter boxes. The ferret poop even had mold on it.",
            "Get those cats out now. Poor things. They don't deserve to be tortured by this person. Now.",
            ">\"You don’t understand how hard it is to have to think about how to take care of her!” \n\nUm... You *actually* did the caretaker thing for years, but she has to *think about* the caretaker thing.",
            "Good for you, OP! It’s great that you figured things out at such a young age. You have you whole life ahead of you!\nUnfortunately it sounds like your ex will continue as she is with her parents enabling her.",
            "Of all the things in your post that seem really great, i’m pretty disappointed to see this:\n\n> I’m happily living with my friend. Her and I are currently figuring out what we are\n\nYour need to end your marriage and you need stability. figuring out “what we are” with a new female roommate is very much NEITHER of those. The optics are just so bad and will only make ending your marriage worse and messier. \n\nBe nothing but a roommate to this gal or get a real roommate and legitimately date this gal when you’ve divorced...\n\nYou only made your first serious good decision to end a bad relationship month or two ago. Don’t get cocky or just succumb to what’s easy and feels good, i.e. flirting with tour roommate.",
            "Good for you for moving forward. I hope you are able to go back for the cats at some point.",
            "OP this could have been me 5 years ago. Like everything was just like you said down to the her family being upset the car was in my name (she didn't even have a driver's license). You're doing well. Eventually my ex wife got her stuff together, but I moved on. I sometimes feel like I could have held on but after 10 years, I realize that the only thing I could have did is what I did, leave.",
            "as someone who also has bipolar disorder with psychotic features i'm very impressed that you were able to make such a clean well thought out exit. if you haven't already done so, you need to talk with a divorce lawyer. if you're looking for some additional support it might help for you to go to dbsa or recovery international meetings.\n\ni've seen a few comments where people are confused about the nature of your relationship with your friend. please consider adding an edit to make it clear that it's not a sexual relationship. not that there would be anything wrong if it was as far as i'm concerned. however some other people think that it's the wrong thing to do.\n\ni hope your first day at your new job goes well.",
            "Good job! I would have grabbed the cats so they didn't have to shit on their shit but, you got out of there and the cats can shit on her carpet for all I care. Fuck her and her anchor ways, pulling you down. I'm glad you left and are trying to be happy.",
            "TL:DR If the rope starts to hurt you, let go of it",
            "If the litter boxes aren’t being taken care of you should take the cat(s). It is unfair to them to live in that place alone with the mess (and likely dangerous) but the litter boxes are a health hazard to them as well as your ex-wife. They in the very least need to be temporarily taken out of there or temporarily re homed. Their care right now is considered animal neglect/animal abuse.",
            "Have you hired an attorney? She can help cya with bills etc. \n\nYou may be on the hook for spousal support since you had a job and were supporting her. Best of luck on starting your new, clean life!",
            "If your ex wife has pets, please take them from her possession. It seems by your post that she at least has a cat. It's not fair for the animal(s) to be kept in that situation. They would probably be better off going to the shelter and then being adopted by another family. \n\nI think you're doing the right thing by getting out of there. Living with a hoarder is draining and unhealthy. You're lucky you have the choice to leave. The animals on the other hand, do not.",
            "Excellent update! We exchanged some comments on your last post, and I'm so glad to read this. Hoarding is one of the toughest mental illnesses to treat, and she's not even willing. It is so, so sad, but she will either one day snap out of this and want to get help, or be reliant on her parents forever. She's being beyond cruel to those cats, but *this is what hoarders do*. She doesn't SEE a box full of cat poop! She doesn't smell what must be atrocious! If you said to her, 'WTF, change the damn litter box,' she'd probably look up from her computer and blink at you. It just doesn't register with her. But I'm soooooo glad those kitties are going to FIL! Hope it's today. \n\nIt's like what I was saying last time, how it's unreal the crap (NPI) we can get used to. She doesn't see the hoard. You got used to all of her issues. We just sink into...complacency or resignation at our shitty circumstances. \n\nBut you got out! Happy dance! But you feel guilty. You're being manipulated by her and her parents. How fricking exhausting. But you are out, and you are moving forward! I hope you can better manage *your* mental health issues, now that you're not managing hers and being brought down by hers. \n\nNew job! Rekindled friendship! How's it feel to not be walking through hip-level piles of garbage?? 😁",
            "Please go back and get the cats! Don't leave them there to suffer with her...",
            "How big is your microwave lmao 40 pounds!?",
            "What a manipulative person she is, Jesus... and she even doesn't care about you. Please, get the cats!!! And congrats on everything you done, you did it right. Good luck and have a happy life with someone who respects you!",
            ">I start my big girl job tomorrow, and thank God.\n\nPutting on those Big Girl pants since June 30. Hurray!",
            "> I’m currently living with a friend, her are I are currently figuring out what we are...\n\nThis comment is the real reason you have moved on. You should respectfully divorce your wife before “figuring it out”.",
            "I cant help but think there was something more between OP and \"friend\" before he moved out. He moved out for good reason but I dont think it was the sole reason. I think there was a romantic connection with \"friend\" pulling him as well...",
            "Wow that sounds exhausting. Go live your life and don't regret  putting yourself first, you've dealt with this for too long!",
            "I'm so friggity-diggin proud of you!  This had to be so hard... so so SO hard.  And you did it!  You got out, and you're getting to take care of YOU.  YAY!  I wish you nothing but happiness and success.  You did the right thing.  Future you thanks you. :-)",
            "Glad that you left an obviously toxic situation but also....you moved in with a friend and are now dating them?",
            "Legit exact same experience as you, leaving in the coming months will feel wonderful.  I had same issue with cats and dog left behind.  Animal control will speak to her but not much else.",
            "So glad you made the right move to do what was best for you. Good luck on the divorce.",
            "Good on you for sticking to your guns and removing yourself from that toxic environment.  Hopefully she eventually learns how to adult and MIL pulls her finger out and supports (and educates) her daughter. Wishing you the best of luck!",
            "Good for you! Good luck with the new job!!!!!",
            "Good for you OP! I am sorry that ultimately it had to go down that way. At least you find yourself in a better place than where you are at now.\n\nGood luck at your new job! :D",
            "So happy for you!! I’m glad this ended up working out in a way that wasn’t destructive or hard on you. Hopefully your ex and her family can take you leaving as the needed final straw in realizing they all need to change and get better, so that way signing the papers comes very quickly! Love to you always.❤️",
            "Good for you for leaving. I know it's hard and I'm sure that you really care about this person, I mean how could you not? But sometimes that's not enough and I know I couldn't live like that either",
            "Brave but necessary. Best of luck moving forward!",
            "I read you first post and this down, and I think you totally did the right thing. Like how the hell did she even think of raising a baby in a situation like this? Thats atleast a good thing, that you just couldn't accidently put a baby in her and made things worsr for you and your then future baby.",
            "Are you goin to have to pay alimony?",
            "I'm sorry this is happening to you. Divorce is really tough, especially when you are compatible with someone but they have issues that make it impossible to stay. You're not obligated to stay together and let her drag both of you down.",
            "You mentioned litter trays - is there anything you can do to save the cats? It sounds like they’re going to get severely mistreated and neglected. I wouldn’t besmirch you for stealing hem but failing that maybe contact an animal charity or local services to have them taken away (and not put down)?",
            "Hard as it is hoarding issues rarely get better. I left mg ex wife a year and a half ago for similar reasons. She still refuses to admit she has a problem despite watching hoarders and having literal piles of unorganized junk in various corners.\n\nLiving on my own has been hard. The bed is lonely. The first person I dated after her turned physically abusive. But I'm dating a great girl now who is in many respects very different than my ex wife and I'm happy and infinitely less frustrated with clutter issues. It was the right decision.",
            "This isn't a comment about your post so sorry about that, but what does the \\[24f\\] mean?",
            "Have watched the Hoarders show. The animals suffer just as bad as u did. Thank God ur a dressing the cats. No creature deserve a to live in filth and downright nasty. Ugh it is a mental disorder but most won't seek help. Good luck.",
            "Good for you.  A lot of red flags in your first post, especially the one about putting the responsibility of a suicide risk on someone else.  I take that shit very seriously.",
            "[deleted]",
            "Glad to hear you stood your ground. I hope your ex-wife gets the real help she needs. You just gotta love her from afar. Good for you.",
            "Honestly sounds like this woman wanted a caretaker not a wife. Sounds like similar attitude to those people on My 600 Lb Life.\n\nI'm happy for you that youre looking out for yourself.",
            "I find it interesting that so many gays have chronic mental conditions / neuroticisms",
            "> I’m happily living with my friend. Her and I are currently figuring out what we are,\n\nJust so we are clear... that means you are cheating on your partner, right?",
            "Good for you for getting out of that situation, but also take it easy. You shouldn’t get involved with someone else too quickly.",
            "Whoa, Wait, What? You're gay and you used your wife to run away from your parents? Now,  you left, but it's not because she's messy, it's because you want to get flirty dirty.",
            "Have a good day folks",
            "Felt good for you. But your vocabulary is good.",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "hfwaxf",
        "author": "Daria12982",
        "title": "UPDATE to “I'm unhappy with how my (24 F) boyfriend (26M) treats me, but he won't listen to me for long enough for me to get my point across”",
        "url": "https://www.reddit.com/r/relationships/comments/hfwaxf/update_to_im_unhappy_with_how_my_24_f_boyfriend/",
        "score": 6818,
        "num_comments": 126,
        "created_utc": 1593126507.0,
        "selftext": "Here is the original post:\n\n[https://www.reddit.com/r/relationships/comments/grls25/comment/fs2iubn?context=3](https://www.reddit.com/r/relationships/comments/grls25/comment/fs2iubn?context=3)\n\nTldr: confronted my bofriend about how he treats me after asking for advice on reddit. He cried and talked about his issues, we broke up. I'm much better for it. \n\nFirstly, thank you to everyone who commented on my original post. I got so much from it, and seeing so many supportive comments really helped me. I learned a lot, so thank you all so much. I realised through reading your comments that I was in an emotionally abusive relationship. It wasn't communication tips I needed, I needed to get out. \n\nThe past month has been so up and down but I wanted to share an update. After a pretty weird “stepping on eggshells” kind of morning, I confronted him about his behaviour and mood swings. I prepped myself for a huge argument and honestly it didn’t go exactly as I expected. First of all he started to deny he was doing anything wrong, but for once I stood my ground. I don’t think he was expecting that. I had lots to say (many of your comments came in useful there), and I tried so hard not to back down. \n\nAfter a while he kind of… changed. He got upset. He then started saying all sorts of things, that he was sorry but he didn’t realise how his behaviour affected me (though I’d brought it up many times). A little later on he said that he had been thinking for a few months that it was his fault my doctor said I had depression. So that’s a huge contradiction?? He said that for a few weeks he had been thinking about breaking up with me “because it’s my fault that you are this way and breaking up sooner would have been the noble thing to do”, but that he was so torn for ages. He said that’s why he had been even more awful to me lately, that his frustrations were just coming out. Again, contradicting what’s he said about not realising how his behaviour affected me. He said he has never cheated but I’m really not sure if I believe that. Maybe it’s best if I don’t know.\n\nThen something really unexpected happened, he started to cry, the first time I have ever seen him cry. He told me that he had been texting a work friend over the past few days about our relationship. He even showed me a message she sent to him which went something like this: “you have a wonderful, textbook girlfriend and you are fucking it up because you are being an ass. This is why everyone at work thinks you’re a psychopath. You are so cold and bad when it comes to feelings”. So I guess it wasn’t just me who found his behaviour not normal??\n\nHe cried even more and said that he doesn’t feel close to people, that there’s only a handful of people he lets in and he doesn’t know why he does that. He said that even being around his immediate family was cold and formal and he doesn’t know why he is like that and can’t connect with people, and that’s also why he throws himself into work so much. I told him that if he didn’t get help, he would end up a very lonely old man. In that moment I felt pretty strong and proud of myself.\n\nSo as you may have guessed, we broke up. Part of me for a while even thought about trying to save it and work at it, and now that I look back I can’t believe I was ever even thinking that. He kept saying “I just don’t know what to do for the best, should we break up or not?” But doing so was absolutely the right thing. I’ve since had many friends coming forward saying they didn’t trust him, something was off etc.\n\nRegarding the girl I talked about, his ex who he cheated on his other ex with- I could see on her brothers Instagram a video of my ex smirking at his phone and the caption was “he’s thinking about my sister ;)” to which he replied with another winky face so… what does that say. But I’m not looking Instagram at this stuff anymore. On the day we broke up he packed some bags and left, he told me to stay with a friend. It turns out that that friend was his exes brother, and he’s been living there for a month. I will be moving into a new place in 2 weeks and even though he has gone to stay with his friend he is still paying his share of the rent, he just swings by to pick up some stuff every now and then when I’m at work, I haven't actually seen him.\n\nFor the past few months I’ve been feeling really low, with barely any energy. I’m picking myself back up again and though it’s a slow process, I’m coming back into myself. I’m determined that I’m not going to let anyone make me feel like that again.\n\nI’m not sure if I needed to write all of that and if you guys needed all of those details, but writing this was quite cathartic. I guess I would just say, to anyone who is reading this and my original post, who is in a relationship that they feel horrible in, just leave. It’s hard, but please leave. You will feel SO much better.\n\nThanks again, Reddit.",
        "permalink": "/r/relationships/comments/hfwaxf/update_to_im_unhappy_with_how_my_24_f_boyfriend/",
        "comments": [
            "I'm glad you got out! That situation sounds like it would have just escolated over time. You're young and have much better things to do than try to fix someone who hurts you. ❤️",
            "Now his ex can deal with that baggage. You’ll find someone more compatible for you when you’re ready- win/win",
            ">I could see on her brothers Instagram a video of my ex smirking at his phone and the caption was “he’s thinking about my sister ;)” to which he replied with another winky face so…\n\nI'm sorry but this bit is really really weird, it seems like Ur ex surrounds himself with strange people who have very questionable emotional barriers.. really happy for u that you got out and all the best :)",
            "~2k votes with 0 comments? That's unusual",
            "You are so brave. You reached out, you accepted the advice,  and you followed through. You my lady are no coward. You deserve a brave and honest person. Keep going and seek it.",
            "I’d suggest also doing some therapy as well, it can be really hard to untangle the emotional damage of an abusive relationship and if we don’t do that hello  for ourselves we may find ourselves in similar relationships or with similar types of people over and over.",
            "You are brave! You are powerful! You are healing!\n\nYou took a huge action—you looked at your life and realized something had to change, you addressed your worries about making those moves, prepared yourself, and reset the whole motion of your life. The ball is rolling in a new direction, one that makes sure you're taking care of your own needs and giving yourself space to grow and be happy.\n\nProud of ya.",
            "Hi, I went through something similar in my last relationship. Your comment about telling him to get help or he would end up a very lonely man really hit me hard, because that was one of the things I said as I was breaking up with my ex as well. I’m happy for you getting out of this relationship. You’re going to be so much happier and someday find someone who treats you right. Best of luck. :)",
            "Good for you. Watch out for ways that he will try to return to your life. Cut him off, no matter what he says. He will only hurt you more. \n\nNext, hold on to that “coming back to myself” feeling. It might be like your are resurfacing after being underwater. There will be lots of feelings and changes. Be gentle with yourself-it might be hard. \n\nLast, decide how to take what you learned forward. It’s going to come with you anyway, so you need to know that this will impact your relationships going forward.\n\nYou’ll be okay. Stay strong.",
            "Breaking up was the best decision of your life. Is not your job to fix him. Is good that you love yourself enough to leave him. You'll get better, don't worry.",
            "Good job!! So much better to be alone and happy than in a relationship and unhappy!",
            "Well done for being strong and getting out of the relationship with him. You will feel a lot better once you have your own place and have no ties with him.\nYou deserve so much more. Try to block him off and not check pages on social media. I know it’s hard but. Try doing small things for yourself. Join a new activity or group to learn something new and meet new people. Time to build yourself back up.",
            "i’m right there with you sister. finally broke free of my emotional abuser of 4 years today. you rock, we got this. only up from here 💛",
            "Omg I had to scroll up and see when this was posted to make sure I hadn’t posted it myself and forgot about it :O\nI’m so sorry you went through this but if it’s any consolation- you are not alone! Every single thing your boyfriend said, the crying about not having connections, the reaching out to an ex girlfriend, the friends and family coming forward and telling you they always thought something was “off” the coworkers making comments - it’s crazy! I honestly feel like we are soul sisters based off this post not gonna lie.\n\nI know it’s so hard. I broke up a little over a month ago and it’s been about 3 weeks since I moved out. It is going to have its ups and downs but you for sure did the right thing!!! I also highly recommend therapy. I just started going and even the first session was tremendously helpful.\n\nStay strong, we (the internet reddit people lol) are all so happy for you and rooting for you! You deserve the best in life- all you have to do now is go out there and get it. <3\n\nEdit: just wanted to add I read your previous post and I’m SO SO GLAD you got out!! I stayed for 3 years and didn’t have the guts to leave until he got physically aggressive not once, but twice in the same week. I’m so glad you left while he still had his aggression aimed at the wardrobe and not you. \n\nI am so so proud of you and you should be so proud of you! I don’t even know what else to add except I’m very relieved to know you’re going to be safe now and, eventually, truly happy again. Please don’t ever go back as he will try to come back into your life and love-bomb or future-fake you. You are so much better off without him!",
            "WAIT... He comes over and gets things WHILE YOU'RE AT WORK?!? NO. Nonononono. Pack up ALL his stuff, put it on the lawn/porch/sidewalk and text him to come get his shit before the trash collector does. And change your locks. This guy seems unstable - the kind who would take or ruin important things. OR if this thing with his ex fizzles out, now he has an easy way to get in and see you. Don't give him this kind of access.",
            "More power to you. Take your time and you’ll heal. Im so proud of you 💕",
            "Breaking up is way, way harder than the movies make it seem. Thanks for letting random internet strangers in.",
            "So the whole thing about thinking about breaking up but not actually doing it, my ex did that.  And he was emotionally abusive.  I guess when we stand up for ourselves they just give up because they have no more power.  \n\nThank the whole universe that my cardiologist said I no longer had to restrict sodium and fluid because my brain was all sorts of messed up for the two months from my heart attack.",
            "I'm so happy you saw your self worth and broke up with him. Best to go no contact for a while once all his stuff is out.",
            "Good for you for standing your ground! You are so strong, believe me. And I bet you’re going to feel amazing once he’s completely out of your life. It might take a while because people like that always come up with a fun way to stick around after losing their death grip of control over you.\n\nReading your first post actually made me dizzy and nauseated because it was so SO similar to my ex. Everything! But I always caved when he’d flip out the waterworks card. We even went to couples counseling. I was with him for almost 4 years and WHAT a waste of good years.\n\nReally focus on yourself! I live alone and I’m planning some solo traveling for the first time ever. Next weekend I am going camping in the mountains with just my dog. Two nights! I’m so excited! You can now do whatever you want, be friends with whoever you want, etc. without having that dark cloud hanging over your head.",
            "Him: Dude I went to see X and Y on saturday AND saw Z today, boom.\n\nFriend: Spent too much time with your gf already have you? Are you going back to your old ways, naughty!\n\n- \nUh, did any guy not highlight this point out from the original post? Ur ex cheated right in front of you and it went right over your head. C’mon men of reddit, I thought you would tell the poor girl. His message to his friend was boasting about seeing 3 diff girls in one weekend. If he was just at the park with regular friends he would never bring that up to another guy. Like.. I don’t share who I see to anyone else unless I got some showing off or relevant experience to share. Plus the fact that his friend is aware of his previous naughty behavior shows u he had a track record being a cheater/player.\n\n1. He went to have a 3 some with his ex and her gf. No one invites a guy over to spend time with 2 bisexual girls alone. \n\n2. He then proceeded the next day to drive to an ex fling’s place 3 HOURS away. No guy drives that far just to grab coffee and catch up with a female college “friend” \n\n3. Another incident is when he went to that party that u weren’t invite to and spent the night with his ex. \n\nPlus the telltale sign is your dry sex life. This guy sounds like he has more pent up sexual frustration over the year of on and off sex with u rather than any real emotional vendetta. He took his anger and resentment out on u instead of breaking up. Prob cuz u both relied on each other emotionally at first so u stayed longer than u should have. \n\nA nightmare situation all around.",
            "I'm so glad you left. You don't need a guy like that in your life.",
            "Bloody brilliant ending things now. You did well and you should be proud of yourself!",
            "I’m really glad you got out of this. Are you taking good care of yourself right now in terms of diet, exercise, and continuing the emotional healing journey? I’m sorry you’re feeling low and my instincts are that you could use a little more self love. Also wanted to recommend a book called “your ex factor” that’s meant to be read while you’re going through a break up. It really helped me a few years ago get through a really tough break up I was feeling very abandoned and angry about",
            "I came in late, so had to catch up on the first post, before reading this. Definitely a bullet dodged. You are incredibly strong and courageous. (I heard once that bravery and courage were two different things. Bravery was acting during tough/stressful/bloody awful times. Courage is being scared shitless but acting nonetheless. \n\nI understand about tearing up when major feelings are occurring. (Possibly due to my depression and Major Anxiety Disorder (I prefer it to a Serious Anxiety Disorder as I'd prefer to think of myself as MAD than SAD!) But it can also be disarming. Other times, when I'm understandably angry etc a bit of a bugger but I still get my point across. \n\nSo glad you're out. It's classic abuser workings, a flare up, than ever so apologetic and then slowly downhill again. Slow but definite, make no mistake. \n\nTherapy can help, but I think you've found a brilliant measure to deal with things. WRITING THINGS DOWN! It helps to calm you and also, because you have to set things down, you're applying order to chaos. Its an incredible help. You don't have to show anyone this, it's your private thing.\n\nBlessed be,  CFQ",
            "Best wishes to both of you. I hope he finds a therapist,  or someone to talk with, it sounds like he is needing one.",
            "GOOD FOR YOU OP! You did something that many people don't have the strength/courage to do.  I'm happy for you and hope you find a partner who will treat you with respect and love.  And you seem to have great friends.",
            "Wow you're a good writer. The way you conveyed your feelings and ideas was so precise and tight. It all flowed together.\n\nGlad you got rid of that weight in your life. Wishing you better days",
            "Congratulations on standing up for yourself and doing the hard things that will make you happier! Change is good, Don't settle for anyone who doesn't care 100% about how you feel and how to work with you to build trust.",
            "I'm glad you wrote it out. It's always inspiring to see someone empowered to take things into her own hands, and get better. Sounds like he didn't take much accountability for anything, and tried everything from gaslighting to guilt tripping you, none of which is a constructive, healthy approach. Sure, he might need help, but you're not obliged to be there along for the journey, to your own detriment. If he wants to get better, he's got to do that alone.",
            "Wow. I don't know you, but I'm so proud of you. Well done. x",
            "Well done for being brave and getting out. I am glad we helped. Abusiverelationships are never good and they don't improve.",
            "I'm glad you stood up for yourself",
            "Proud of you. I recently went through the same thing, with a man that sounded extremely similar. You did the right thing. Go live your life now, not in fear, and there are so many more people out there willing to give you the love and treatment you deserve. Besides the inevitable grief, remember it's also an exciting time. You are free now 🤍",
            "I am so proud of you. You're so strong, you're healing, and you have the whole world ahead of you.",
            "I am so proud of you!! Take some time before you date again if you feel you need it. Enjoy your new life! <3",
            "You did great OP we are proud of you 😊",
            "Amazing update, the tears and depression are so familiar with the times I tried to break up with my emotionally abusive ex, I was a sucker back then and did go back a couple of times thinking I could \"fix\" him, I did a fist pump when I read you broke up with him! \n\nIt's not easy and you may always have questions, two years later I remember things and realise I was being gas lit/ didn't need to feel guilty about something but soooo much better to be out that situation!\n\nProud of you and best of luck for the future!",
            "Damn girl!! You're a bamf, good for you!!!!\n\nThat is all... keep being wonderful- you got this!!",
            "Hang in there. This next part is tough. But that because change is tough. \n\nYou just changed your entire life. I'm proud of you. You took a step that I should have taken 10 years earlier by ending that relationship.\n\nYou are amazing.",
            "I AM SO PROUD OF YOU",
            "You are so incredibly strong. I was in a similar situation, except even after that realization, I STILL stayed and things got so much worse once he knew I’d put up with his shit. I wish I had had the strength to get out at the same point that you did. I’m free now though. You rock and you’re going to find someone much better. Seriously what an inspiration!",
            "Honey, I was in a relationship like this when I was young. I thought, \"my love can change him.\" You cant be a savior and belive me, he will not change. I married the guy. GET OUT now. My ex husband who was my bf when I was 16 and I married him at 17. Divorced by 24. Sick of the lying,cheating and emotional abuse that turned into physical.  I nearly lost my life to him.iterally. It ended with him placing a shotgun in my mouth. Men like this control you, convince you that you are worthless, make you feel like you don't deserve to be treated well, and then ruin your life if you let them. That is the main point. Never let anyone treat you like that. Someone who loves you will make you feel like your best self. They will listen to you because they care enough to hear you out, and they will not show a tendency to violence because love is kind. \n\nIn abusive relationships, it always starts out with a charming and charismatic partner that knows exactly what to say to you until they feel that have a clutch on you. I see that in everything you said. \n\nYou are worthy of love. The kind of love you give. You do not deserve that type of abuse. Get out.\n Learn to love yourself and you will find somone great who loves you. That is what i had to learn. Good luck sweetie and God bless you.",
            "Thanks for sharing that, I recently went through a similar breakup and it sounds like a very similar situation - it was really helpful to hear how your ex opened up to you - I suspect mine has some similar issues but he wasn’t really able to express them as articulately, hearing a pretty similar explanation would a little more detail is just helpful for me to wrap my head around.  Reading your original post it sounds like almost the exact same situation including the ex stuff.  Yeeesh. Good on you for standing up for yourself and getting out of that situation. I know it’s shitty.  But I thank you for sharing, I know it wasn’t for anyone else but it was actually really really validating for me to read a story so similar to my own.  Sending good energy your way. You’re strong and your life will get so much better as you move on",
            "You go, girl! Hope you get well soon! Enjoy your own company, after all theses bad situations, it's the best you can do to learn about who you are and what kind of people you really want in your life. Good luck 🍀",
            ">He even showed me a message she sent to him which went something like this: “you have a wonderful, textbook girlfriend and you are fucking it up because you are being an ass. This is why everyone at work thinks you’re a psychopath. You are so cold and bad when it comes to feelings”. So I guess it wasn’t just me who found his behaviour not normal??\n\nWow. It must have been validating to see that.\n\n>I told him that if he didn’t get help, he would end up a very lonely old man. \n\nYou're right.\n\nI'm so happy for you that you ended the relationship, and I know you'll remember the things this one taught you in the future.",
            "Man, he has some issues.  I agree with others who recommended therapy for yourself.  It would be good to process all the stuff that happened and try to heal and move on healthily.  \n\nAnd also agree on trying to stop checking on him on social media, best just to try your best move on.  And please pack all his stuff and have him take all at once.  Preferably not meeting in person and get the key back.  \n\nReally sounds like he might have antisocial personality disorder.  Try looking it up and see if it sounds familiar.  I had an ex that I believe had it.  Therapy can help heal the wounds.",
            "If you are still in contact with him, I recommend that you tell him to go to an abuser's group. He was abusive towards you even in his tearful apology. (Apologizing for your depression?? Exaggerated self-flagellation for things that clearly aren't their fault is a manipulative tactic abusers use to make you feel like you're in the wrong. )\n\nThen I would cease all contact with him, including and not limited to blocking him on everything, changing locks and switching up your routine for a bit (is there a coffee shop you usually stop by before work? Drive a bit further to a nicer one!). You could even stay with a friend for a bit! I hope this doesn't seem condescending, you're clearly a very capable person. I really hope you stay safe and there's no telling what suggestions you havent though of yet!",
            "Not listening to you doesn't bode well for a long term relationship.",
            "Dont marry him. You'll be unhappy",
            "You did a very brave thing. I'm sure your courage to get out and get out quickly gave strength to others going through similar situations.",
            "Communication is one of the key parts of a relationship. If he won’t listen to you and really try to understand you then you might want to reconsider why you’re still putting up with it",
            "I'm glad you walked away, as I am that he seeks help.Hang tough .\nNot to make fun or light of what you have gone through, but there is an hysterically funny video of a 3 year telling his Mother to listen to him while he won't listen to her. It may remind you of someone!  It's on YouTube called \"Listen!Listen! Linda!\" Have fun!\nBest wishes, Dear.",
            "Sounds like the best for you overall. Your ex needs some kind of serious help.",
            "Hey! I feel you so much girl! I broke up with my BF of five years a couple months ago. It was such a gut wrenching break up because of how well i understood that he was hurting and why...but it all came down to the same thing: he not only didn’t get himself help. He even did the same “i’m not sure” dance with our relationship for months—and the main reasons for being unsure was me and my behavior. \n\nWell, i finally broke it to him that he can’t expect me to be at my best when he has done everything to make me unsure and uncertain of the future. It’s a tough lesson for some people to learn that not making decision and not taking sides is not neutral and has consequences.",
            "Oh look a thread showing why the downvote exists!",
            "\"In that moment I felt pretty strong and proud of myself.\" \nRemember that feeling, and hold on to it. Hold unto it whenever you miss him, or the next time a man tries to disrespect you. You are strong as you've proved to yourself, and you can tap into that part of yourself when you need it. Take some time from dating, don't rush into the next relationship that comes your way. Focus on yourself right now and building yourself into the person you want to be. Ask yourself why you put up with his behavior, and how to work on those things so you can avoid similar men in the future and more importantly, live your best life. I'm really happy and proud of you.",
            "Since this has been unlocked, I really really really feel the need to repost this here, Please OP be careful\n\n> Oh God, I just read your update post and I'm glad youre leaving this sack of shit.\n\n>However, the whole thing he did where he called himself the worst person ever? That is literally textbook abuser tactic to guilt trip you into saying \"oh its not so bad,\" and to stick around to \"help\" him. Dont be surprised if he tries to regain you with messages about how he'll improve and/or the opposite direction about how you're a piece of shit. Never ever go back. He will not change. _This is who he is _\n\n>Also stay safe, most women get hurt or killed in abusive relationships when they try to leave.",
            "I remember the day I realized my ex was being emotionally abusive. And the day I left and never went back. Even now it's hard to convince myself that it really was bad enough to leave like that. I feel bad for hurting him but he has no idea how much he actually hurt me. Thanks for reminding me that I felt all those feelings and their job is to make you feel crazy. Unfortunately, they do too good a job sometimes.",
            "I AM SO FUCKING PROUD OF YOU",
            "Please stay aware if he is continuing to enter your space as well, even if you are not there when he does. Maybe even especially because you're not. Some people who are like him will do just about anything to try to keep their hold on someone. Just... Stay alert, and be careful. As soon as you are able to cut him out and off for good, do it, and make sure he doesn't know where you are.",
            "You are very strong. I’m in the exact position as you but I haven’t been strong enough yet",
            "*wipes tear*\n\nOP, you are a goddamn superhero. Every step you took was correct and just flawless execution!",
            "Well it's very simple don't make it too hard on yourself.\nHe is amtur man he should know that work is something different than a relationship.he should not act stupid in relationship because his job is too hard.he can not just bring up excuses to hurt your feelings and also he should listen to you and also just he telling I love you is not something he really mean if he meant it he would have show it to you in real life not just words.\nWords are just to make people stay around you but actions are that make people come around you and really love you and you are actually doing the best you can to save the relationship be he is not.\nYou just need to clarify your needs and he needs to be honest with you cause I think he is not honest with you at all those thing he says just are excuses and you should not fall for excuses.",
            "[deleted]",
            "[removed]",
            "These updates are pathetic attempts to farm karma. Change my mind.",
            "Then say it directly. Us men don’t speak womanese. We don’t have the attention span to wait 45 minutes while you explain something that could have been summarized into ONE FUCKING SENTENCE! That’s not how we are wired.",
            "That's a looooong ass story",
            "> \"This is why everyone at work thinks you’re a psychopath. You are so cold and bad when it comes to feelings”. \n\nHoly shit that's rude as fuck man. That's just straight up bullying\n\n>He cried even more and said that he doesn’t feel close to people, that there’s only a handful of people he lets in and he doesn’t know why he does that. He said that even being around his immediate family was cold and formal and he doesn’t know why he is like that and can’t connect with people, and that’s also why he throws himself into work so much. I told him that if he didn’t get help, he would end up a very lonely old man. In that moment I felt pretty strong and proud of myself.\n\nWhy would you be proud of that, that's honestly just rude, he tells you his true feelings of something he's struggled with his entire life, something that he probably is letting someone know for the first time, and you punish him for it."
        ]
    },
    {
        "post_id": "b8hwh8",
        "author": "precisodeumconselho",
        "title": "UPDATE: How do I [26F] talk to my SO[21M] about needing him to keep my room tidy when he's staying over?",
        "url": "https://www.reddit.com/r/relationships/comments/b8hwh8/update_how_do_i_26f_talk_to_my_so21m_about/",
        "score": 6797,
        "num_comments": 128,
        "created_utc": 1554203963.0,
        "selftext": "&#x200B;\n\n&#x200B;\n\nOriginal post:\n\n[https://www.reddit.com/r/relationships/comments/8lvvkg/how\\_do\\_i\\_26f\\_talk\\_to\\_my\\_so21m\\_about\\_needing\\_him/](https://www.reddit.com/r/relationships/comments/8lvvkg/how_do_i_26f_talk_to_my_so21m_about_needing_him/)\n\n&#x200B;\n\nI thought I would update on what’s happened since my post one year ago.\n\n&#x200B;\n\nShortly after, I chose an appropriate time to talk to R about the situation. I explained how it makes me anxious to come back home to a messy place and would rather keep it tidy as I go, specially if It’s when leaving the house and I’m not late for any commitments.\n\n&#x200B;\n\nI also brought up that I thought it would be good for him to live by himself before we could consider living together. I explained that I used to be very messy when I first moved out of my parents house but with time learned the value of a tidy and clean space in which to feel relaxed. He thought about it and a while after said he thought I was right and he would like to have a go at living by himself, saying he was very excited even thinking about it.\n\n&#x200B;\n\nIn the days after the talk his attitude changed completely too. At times I would leave for work and he would stay at my house to do some other chores or come and pick me up earlier and take the bins out. He started spending more time at my house after this and we became much closer in the following months.\n\n&#x200B;\n\nIn September R started a new job and for logistical reasons we could not spend the night together unless we were both on a day off the following day (he works Monday-Friday and I work 4 shifts on 4 off). We would go a whole week without seeing each other for more than an hour or two, which was really abnormal for us. We started to make a big effort to meet up at any spare 15 minutes between our jobs and other commitments. Sometimes one of us would drive to the other one after work just to say hi for 10 minutes and then leave. It really showed how much we cared about the relationship.\n\n&#x200B;\n\nAround this time I was looking for a new house as i had a raise at my job and could afford to live somewhere on my own as opposed to a shared house. I went to see a flat that was perfect for me. Ticked all the boxes, including budget. The only thing was that as soon as I saw it all I could think of was how it wasn’t to be just mine but mine and R’s.\n\n&#x200B;\n\nThat evening we sat down and I told him about the flat and what I thought as soon as I saw it. I explained how the efforts we had both put in the relationship over the last few months proved to me that we had a relationship worth cherishing. He asked me for some time to think about it and eventually said he too thought we should move in together. R said he didn’t feel like he needed to live alone to “discover himself”. We then sat down and wrote a list of things we would look for in a place, including a budget and how much we would need to spend on furniture, etc.\n\n&#x200B;\n\n**( edit:** this note now hangs in our bedroom wall as a sign of how we dreamed this house, planned it and accomplished it together. )\n\n&#x200B;\n\nBy this time I had decided to forget about the perfect flat I saw and we decided to look for another place together. A few weeks go by and the agency calls me to say the flat I had seen a month before was still available and the landlord had lowered the rent. We went to see it and R loved it as much as me.\n\n&#x200B;\n\nOver the last 5 months he has surprised me everyday. He has taken this flat and looked after it in a responsible adult way. R has been busy fixing everything that needed TLC in the house, spent time decorating the bedroom, he even started to cook and now makes delicious meals. His parents visit often and are super proud of him too.\n\n&#x200B;\n\n**We are two happy peas in a happy little flat.**\n\n&#x200B;\n\nThank you all for your advice.\n\nSpecial shoutout to /u/baffled_soap for [this comment.](https://www.reddit.com/r/relationships/comments/8lvvkg/how_do_i_26f_talk_to_my_so21m_about_needing_him/dzk3jod?utm_source=share&utm_medium=web2x) It made me realise that maintaining a living space is a life skill anyone can learn.\n\n&#x200B;\n\n&#x200B;\n\n**edit 2:** thank you everyone for all your kind words. I plan to show this post to R when he gets home from work. I should probably add that when friends ask us how living together it's going he says he's the clean one. Cheeky.\n\n&#x200B;\n\nTL;DR: we talked, R respected my space, 5 months after the post we moved in, having the best time in our little beautiful flat.",
        "permalink": "/r/relationships/comments/b8hwh8/update_how_do_i_26f_talk_to_my_so21m_about/",
        "comments": [
            "So happy for you OP! \n\nAlso thanks for sharing to show that what adults should and can do - put effort into making a healthy, sustainable relationship work in the long run. This is especially important considering how many people have been in abusive relationships and don’t realize that yet. ",
            "Wow, what an unexpected and happy update. It goes to show that hard work, communication, love, and a change of mindset (plus whatever else you all have going on) can lead to a positive change! Thanks for sharing :)",
            "\\>  **We are two happy peas in a happy little flat.** \n\n&#x200B;\n\nI turned into a heart-eyes emoji when I  read this. ",
            "Why is a lil update on teaching a guy how to clean getting all these feels from me ",
            "This is one of the cutest relationship updates I’ve ever seen. You seem like you truly care for each other and will do anything to make it work. This is perfect news!",
            "Aww you lovebirds! You’re both keepers! ",
            "[removed]",
            "What a wonderful ending! Ironically, my husband and I have the same age difference as you two. He's also had some growing up to do and I've had to express how important a clean house is as well. He's done well to learn as we go. Myself as well. I've never been a good house keeper, but I'm getting more organized as I go. I'm also working much longer hours now, so we both realize that keeping the house clean is much easier and a lot more fun than spending our one day off together... Cleaning. I wish you two much happiness! Enjoy that new space together! ",
            ">We started to make a big effort to meet up at any spare 15 minutes between our jobs and other commitments. Sometimes one of us would drive to the other one after work just to say hi for 10 minutes and then leave.\n\nOkay, I will date either of you. That is SUPREME effort and so, so sweet. \n\nAlso, someone put away the fricking onions. \n\nYay for OP!!\n",
            "I like how someone made a comment who got only 3 upvotes really helped Op to improve her life, now I have proof that when I comment it might not be totally useless.\nCheers to you Op, I hope you and R continue to have a great relationship!",
            "Damn dude that's awesome. Makes me want to be more like R.",
            "It's the /r/relationship unicorn!  Healthy adult communication and positive change.  Nice update OP.",
            "This is something worth reading... Happy for you OP\n\n&#x200B;",
            "I feel like crap for expecting this to have a bad ending when I clicked on it. But you really brightened my day with this! So happy for you! ",
            "I appreciate the update. It encourages me that I can learn this skill. I often get in a rush when getting ready and just don't pay attention to things that need picked up. Eventually it gets overwhelming and I can't do it.\n\n\nIt was a concern of my ex when she would come over also. She either got anxiety when there from the mess or spent most of her time cleaning it. It wasn't why be broke up but it was an area of strain on our relationship.\n\n\nI went from living in a large house to a small room in a shared living situation. I keep the common area clean but the tiny room gets cluttered quick. This has lead to me picking up more frequently and seems to help me develop a better understanding of how important it is.\n\n\n",
            "Congratulations! Made me smile, a rare type of post in this sub. ",
            "This is the kind of update we love to see. I'm so glad he put on his adulting pants and not only respected you, your space, and your wishes, but took it many steps further to become better for himself too. You two are growing together, hearing each other out, and are respectful of one another. This is the kind of relationship people want to have. I'm so happy for you both! ",
            "I’m so happy for you both! This is the best possible ending to this story xxx",
            "I'm 47 and still m only just now learning how \"adulting\" through cleaning and neatness can be soothing. My mother, a narcissist, cleaning control freak, was so brutal and made cleaning so miserable I always rebelled and never recovered.\n\nIt's never too old to change and I'm so happy to read his good habits have stuck, it gives me hope for my own \"recovery\". \n\nBTW, my husband never complained much because I've had some chronic illness issues for a long time but he's visibly happier with my new habits. \n\nEdit: rereading your post I think you approached it wonderfully. Great communication skills! ",
            "That's great!  I wish I had done the same before I got married, my gf went from living with her parents to living with me.  They had hired help to keep their place tidy.  Even after we got together she didn't understand why it was important to keep our home tidy when hired help was a snap of the fingers away.  \n\nCommunication is key, it's great you knew what you wanted from him and how to communicate it.  Even better was that he could see your point and was happy to accomodate.\n\nWhen we separated she went back to living with her parents (again with hired help).\n\nI'm glad your story ended up with a happier ending than mine!\n\nThanks for sharing!  ",
            "This is such a happy update! I’m so glad things are going so well for y’all!",
            "This was such a healthy and wholes update it cleared my skin and folded all my laundry thank you OP",
            "The amount of respect and love you guys have shown each other makes me a little misty-eyed. It's really nice to see people discuss their issues without resentment, especially in an instance where one person is 'technically wrong' (messy) and 'technically right' (tidy in her own space). You both did great.",
            "This is cute.  Congrats.",
            "I just wanna say that my partner and I are nearly the same age difference and we are living together happily as well! It’s the first time living with a romantic partner for each of us, (not first time living away from family though) 3 years in & we are loving our lives and shared home more and more each day! Wishing lots of love and happiness to you!",
            "Okay I'm ugly crying in the bathroom at work. I'm so happy for you two!! Way to go on both your parts. ",
            "This is so so heartwarming to read. I'm glad things worked out for you both :)",
            "This is such a lovely update! I love seeing people who can work through their problems and come out stronger in the end! ",
            "I’m so happy you guys have a happy ending 😊 I hope your relationship stays forever perfect and you grow old together ",
            "I’m so happy you guys have a happy ending 😊 I hope your relationship stays forever perfect and you grow old together ",
            "I’m breaking my long running lurking and never commenting habit just because I love this so much. Very happy for y’all! ",
            "Gosh it's nice to read something so wholesome here. So glad things worked out for you two!",
            "Awww that is so nice",
            "He sounds wonderful.  Gives me hope that will happen for me ",
            "[deleted]",
            "Awww, this is the kind of update I really love to see :) Doesn’t feed the drama llama but puts a real smile on my face. So happy things worked out so well for you guys! ",
            "This makes me smile, OP.  Thank you for sharing!!!  ",
            "These are the happy updates that I love. So happy for you both! ",
            "I’m glad things worked out for you, I ended a relationship because of how messy he was. His parents were borderline hoarders who didn’t know what clean was and he inherited some traits from them. Obviously there were other factors but the messiness was just constant stress for me. Moral of the story, Don’t move in with someone when there are obvious red flags",
            "I love this post so much...",
            "Such a great update! Sounds like a fantastic dude you've got there!  ",
            "Good luck with that! When I married my husband he was also 21. Now he is 28 and still inconsiderate when it comes to cleaning and tidying up.\n\nI hope you are more successful in your attempts than I ever was in over 7 years! :(",
            "This is a lovely update. It shows that communication can work if both parties are willing to hear it and see it as an opportunity to grow rather than as a personal attack/adversarial situation.",
            "Congrats to you guys !!",
            "I love he says he’s the clean one now haha!!! This was such an uplifting read.",
            "What a wonderful story! I love it. Happy for you both.",
            "Hey that’s me & my post! I’m very happy to read this update. Congratulations on moving in together!",
            "Reading this made me cry... ",
            "this is so adorable. congrats OP! i hope you two remain very happy together. ",
            "Dump him, call a lawyer, hit the gym.",
            "I'm so happy that he took what you said seriously and made sincere changes. What an excellent guy!",
            "Thank you for sharing your update. now a days we don't hear a lot about positive change and  healthy relationships. you really made my day.",
            "Is a flat a house where you live?",
            "You are both destined for a happy life, beautiful too hear.\nSteve🇦🇺🤗",
            "Congratulations! I'm glad that things worked out for you.",
            "Especially* not specially",
            "I never read the original story but this popped up in my notifications. This is a pretty nice story I congratulate u guys. Have a long happy life!",
            "Be direct. Be concise. Don't overthink it.\n\nYou spent an hour and almost a thousand words telling Reddit your story. You can tell your flatmate what's up in 4...\n\n\"Clean up your space\"",
            "[deleted]",
            "If he needs to be told, kick his ass out. You dont need to baby sit. \nIf hes already been told and still doesnt tidy/clean up, kick his ass out. You dont need to babysit."
        ]
    },
    {
        "post_id": "9yhlte",
        "author": "dumbthrowaway843",
        "title": "UPDATE: girl (20s F) in my DND group post (20s M)",
        "url": "https://www.reddit.com/r/relationships/comments/9yhlte/update_girl_20s_f_in_my_dnd_group_post_20s_m/",
        "score": 6789,
        "num_comments": 213,
        "created_utc": 1542640455.0,
        "selftext": "Hi everyone, so a few days ago I posted [here](https://www.reddit.com/r/relationships/comments/9xoy6k/this_girl_early_20sf_in_is_tearing_our_dnd_group/?sort=confidence) about this girl (Sam) in my DND group who everyone has a crush on, and how it's causing a lot of my friends to turn on me cuz they think she has a crush on me.\n\n&#x200B;\n\nTL;DR at the bottom.\n\n&#x200B;\n\nSo I wanted to thank everyone for all the great advice I got, and it led me to take some action over the weekend. So on Sunday (yesterday), I was txting with Sam and I decided to bring up and ask her how she was feeling about our gaming group. She confessed to me that she's been feeling really stressed out lately because she feels that Jake and Dave (our DM) have really been ostracizing her, because she's been getting closer to me. She told me that Dave would send her private angry or rude messages, saying mean things about me to her behind my back. I was shocked and honestly kind of defeated to hear how these guys who I thought were my friends treated me behind my back. She said she was so cut up about this and that she didn't want to come to DND anymore because she didn't feel like it's any fun anymore, and that hurt me the most, having her lose something she loves because of some dumb guys.\n\n&#x200B;\n\nSo, based on the advice I got here on my last post, I did two things after getting this knowledge. I called up Dave, and told him that he either needs to grow up, and treat her with the respect she deserves, or she will leave the group. He was backpedaling, but eventually came clean that he has a thing for her as well and was just jealous of the attention I was receiving from her. He said that it's not her fault and it's not my fault and it's just something he needs to work through on his own, so at least he was able to be cognizant of that. The second thing I did was talk to Sam frankly about us and our relationship. I told her that I really liked her, and asked her if she liked me as well, which she said she really did, and had for a while now (which made my heart want to explode out of my chest). I asked her if she wanted to be my girlfriend, even with all this drama going on, and I told her that I was on her side and would support her whatever she wanted to do with our gaming group. In the end, we've decided that we are dating now and we'll both be taking a break from DND for a few sessions before we go back and tell everyone. I am just so happy to have her in my life, and if my friends can't get over the fact that we're dating, she and I will start a new DND group with people who can be adults about it.\n\n&#x200B;\n\nAnyway, thank you all for your help, and I'm glad I bit the bullet, I couldn't be happier right now!\n\n&#x200B;\n\n**TL;DR: I asked the girl out, she said yes we're dating now :) I called out our DM on his BS and he apologized and said he would cut it out. Looking forward to brighter DND days with my girlfriend!**\n\n&#x200B;\n\n**EDIT: 1.2K?? I never expected this to blow up so much! Thank you again, everyone, for your kind words, thoughts, anecdotes, and advice. I've talked to Dave again today actually and told him that Sam and I were officially together and we want to be able to come back and play all together again, but my respect for Sam's feelings overcomes my want to continue playing with them. Dave told me that he was really sorry for being such an ass before and that he is happy for Sam and I and doesn't want this to come between our friendship. I am hopeful that we can move past this! Also -- to those who suggested Sam invite a female friend to our group, she reached out to one of her best friends from high school who still lives in the area, and she is interested in joining! I think Sam will feel more comfortable, and it'll take some of the spotlight off our new relationship if we invite a new player into our group. Anyway, wanted to update and thank everyone again for all your kind comments.** ",
        "permalink": "/r/relationships/comments/9yhlte/update_girl_20s_f_in_my_dnd_group_post_20s_m/",
        "comments": [
            "A natural 20 on a Charisma check!",
            "That’s awesome!! My husband and I just  started playing D&D together a few months ago and love it! \nSorry your group got stupid, but hopefully now that you are a couple, they’ll get over themselves. \nMaybe not playing characters that are a “couple” also will help keep them more friendly. And if not, I hope you guys find another group of good people. Maybe more couples... haha. ",
            "I hate to say it, but the stereotype of \"gamer\" culture exists for a reason. I have had similar issues with gaming groups in the past. No matter what, drama that exists off the table will find a way to sneak into the game. I'm glad for you that you and your girlfriend are able to come together in the face of what could have been a pretty unfortunate situation. ",
            "Nice job being frank with Dave.  DM's who get that way with players are a worse than players who get that way with other players. They can make very unfair rulings to either try and court favor or as \"revenge\".\n\nIf you start a  new DND group, try and get some other female players. Maybe Sam has a friend or two who'd want to play?  A lot of women never even try DnD because of situations like this. Often stories alone are enough to keep some away.\n\nSource: I DM a game with players only from a particular small fandom, most of whom had never played before because of fear of just this situation, and having a selective pool of potential players made everyone a lot more comfortable.",
            "Aww you guys are so cute. Glad it worked out.",
            "It's a shame it went that way with your friends but hopefully they'll get over it in time. I've seen stuff like that happen before; nerds can get ridiculous about girls sometimes. Like \"she plays *video games*, she's my soul mate!\" type of shit.  \nThey'll grow up and knock it off, with any luck.",
            "[removed]",
            "Funny. My name is Sam and I met my boyfriend David in a pathfinder group. Spooky. ",
            "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA I AM SO EXCITED FOR YOU GUYS!!!!!!!!!!!!!!!!!!!!!  :)",
            "I've been the token nerd girl all my life, started playing chess and DnD at 7 years old with my father. Your work is only just starting. I get that you feel things are resolved, but i dont see this kumbaya ending you do. I just see WORSE red flags popping up.\n\nRemember the shock you felt finding out who these guys really are. Let's be honest - you already knew they felt entitled to her, ask yourself why would it shock you that they acted on it by being rude and sending her aggressive messages? **They havent even seemed to have apologised, it looks liek they just justified their behaviour to you in a way that you can get where they're coming from. It totally minimises how fucked up they were behaving. Have they even apologised to Sam, or did they just talk to you?**\n\nDon't forgive any of these men. Why the fuck are they still your friends if they treated your GF liek this? They're just mad they got caught, they still actively chose to behave the way they did and i bet they've done it in the past and i can bet they'll do it in the future.\n\nCall out misogyny and entitlement every time you see it and don't remain friends with people who display this behaviour. Even if they're nice in every other way, if they're weird or \"off\" or downright rude & hateful towards women, they're not nice. You are the company you keep and if you keep these guys in your life, Sam really deserves better. ",
            "OP, you rule.  Lots of people talk the talk on supporting women who are being harassed and ostracised, but you walked the walk, and that's cool as hell.  It's not easy to call out a friend!  Glad that it sounds like everything is working out for you.",
            "No advantage needed on that charisma role. Congrats dude, you handled this really well.",
            "Awwwwwwwwwwww! I'm very happy for you!\n\nMaybe you guys can find another couple to play with? Not sure if playing with your friend who admitted to having a thing for your girlfriend would ever feel completely free of weirdness, at least I know it would bug me. Even if you played with other guys, entering the group as a couple sort of sets ground rules from the start. Wishing you guys a very happy future!",
            "Yikes. \n\nIt's disheartening but not surprising that this is still happening in the nerd world.  I used to deal with it before I stopped larping / playing in games of mostly straight cis men.  This was everything from the creepy \"hey\" every day unanswered for a year to unsolicited details about fetishes to straight up stalking. \n\nIt hurts on so many levels.  Not only do you have to deal with crazy jerks who can't take the no but then the good memories of gaming are tainted.  I would not be surprised if they continue to send her hurtful messages or even escalate. \n\nI'm only in two regular games now,  one on roll20 with good,  old friends,  and one that's all women/nonbinary except for the male DM (and it's hands down the best game I've ever played! We even do themed potluck foods for regions we visit in game) Maybe instead of rejoining the drama game put up a want add for female players sick of getting creeped on. I bet plenty of players would jump at a legitimate safe space. \n\nGood luck to both of you. ",
            "This is so nice and sweet, I’m glad things worked out well for you both ",
            "[deleted]",
            "AW YES, CRITICAL HIT! Er, I mean, glad you updated, and looks like you handled things admirably. ",
            "Congrats man!  It's always super exciting to realize things are reciprocated! ",
            "Is your name Ogden Morrow, by any chance?",
            "/r/rpghorrorstories (except with a happy ending for a change)",
            "As a lady who plays D&D (and dealt with the same troubles in my twenties): **Thank you for pulling the guys aside and calling them out on their behavior.** \n\nI've had to leave gaming groups because there was no one actually on my side, even though many of the guys were interested in getting into my pants. Of course people can't control who they fall for, or are attracted to, but people can control their behavior, and I think it's important to hold people accountable for that. \n\nGlad things worked out for you guys. Taking some time off was probably wise. Sometimes things just need to blow over, and people need space, then things simmer down and people get over themselves. Best of luck.\n\n&#x200B;",
            "Kudos to you, man. I hope your group steps up and gets over it and you and Sam do well~\n\nI've been in this situation before sooooorta on the otherside. Twice in the past decade I've introduced gals I've liked to my gaming group, they've fit in, and fallen for people in our group (who are NOT me). Both times it hurt, but I got over one easily enough because they're both good people. The second went a bit rougher because both parties THAT time kinda used me and abused my emotions (it's a long story, but my crush was using me for emotional support while she started secretly seeing the guy who was my confidant concerning my feelings for her... all while he was seeing someone else... neither gave me a heads up and both asked extreme favors that took a lot out of me before breaking the news). \n\nAnyway, enough of my drama. I think you handled your situation very well and I'm glad you and Sam are going to give it a go! I hope for much happiness for both of you!",
            "This is literally my favorite update I've ever read. i didn't even see your original post, but congrats!!\n\nPersonally, I don't think things are gonna get much better with your friend group, but time will tell!",
            "As someone who loves both love and DnD, you are clearly a mature human being and I wish you and your girl all the best! :) If you happen to live in Winnipeg, Canada, you can totally join our campaign! ",
            "I'd be prepared to find another group regardless. Especially if you're going to keep this from them for a while, they might react badly when you do come back. ",
            "Still, I think you need to think about how you worded your first post. This girl did nothing to \"year the group apart\".she isn't existed. As a gamer girl that aggravates me hugely!",
            ">Dave told me that he was really sorry for being such an ass before and that he is happy for Sam and I and doesn't want this to come between our friendship. I am hopeful that we can move past this!\n\nheres hoping that now the ambiguous nature of your relationship with her has been solved things will be a lot easier for everyone.",
            "Skip the old group; it's time to find better friends!",
            "Congrats man.  I knew you could do it.  Way to go!",
            "You did all the right things, and things worked out! I'm so happy to read this update!\n\nIf you guys still want to play D&D, you can run a solo campaign.",
            "Congrats!\n\n\nEven though it took a while, props to your friend for realizing (with help) that he was acting really shitty. A lot of people have a hard time with that level of self reflection, especially when confronted directly with it; it was probably a realization he really needed and hopefully he will be better in the future because of it.",
            "This is such a happy update! I'm so glad you two got together :) and hopefully things will work out okay with the rest of the guys. I LOVE playing DND too and I've also often been the only girl in the group. I've never been in as tough a situation as you guys found yourselves in though so I don't have much advice other than don't let it stop you from enjoying the game.",
            "Good for you, you did absolutely the right thing talking to Dave directly. Here's a little story for you that you might appreciate:\n\nWhen my husband A and I started dating, another guy named J was already sniffing around. J and I had met for drinks and a hang out here and there but never touched, never held hands, never kissed, etc. and he never even told me he liked me (I could tell but still). J and A worked together. I met A one night while at their place of employment and there were instant sparks. We went out a few times and it was clear we wanted to get together officially, so we talked about how to tell A.\n\nOne night, A and J finish work late, and A gives J a ride home. As he was parked outside J's house, he turned to him and straight up said, \"hey man, I think UliKunkl is pretty cool and I want to start dating her. I hope you're cool with that.\" - J looked sad and stammered that he guessed it was alright... (sadface). They shook on it, he thought all was cool. A told me later what he'd said and J's reaction (A scored major points here, no man had ever done that for me/us before).\n\nA and I get together and all was great but at their work, I was getting angry vibes from their female coworkers. It took some digging but it turned out that J told all those ladies that he and I had been hooking up. Painting me as a hussy and A as the guy who swooped in and \"stole\" me away from J.\n\nYou did the right thing being stand up about it, even if it all ends in a way that's not great. Keep doing what you do.",
            "These guys' reactions to a girl liking someone else shows they aren't ready to date.\n\nI play tabletop RPGs and this drama can ruin the opinion of collaborative story telling. It's sad.",
            "You had her back.. make sure she knows you had a go at ur so called friend you chose her welfare .\nI hope It works out for u .. u built a solid foundation for it to start by defending her and being adult enough to Remove you and her from the environment. \n\nFrom every chick out there who's had guys stand up and support them (* my husband included) thanks you guys rock",
            "Awesome update dude, just make sure your friends don't go full neanderthal all over again for this new lady!",
            "> and if my friends can't get over the fact that we're dating, she and I will start a new DND group with people who can be adults about it.\n\nDon't forget the hookers and blackjack.",
            "Female tabletop gamer and LARPer  here. It fucking sucks sometimes. I regularly sit down and talk to younger women who join the scene and have to give them the talk on who's genuine and who's a manipulative ass.",
            "Guys are so stupid sometimes lol. Nothing like watching a group of men turn on each other over a woman who both doesn't want that from them and also didn't ask to be the centre of a huge shitshow. Generally I find women don't appreciate that kind of behavior and I suspect your maturity gave you some points in her book. \n\nIf its any consolation, I've been in your situation before and I find people usually get over it. This kinda thing doesn't usually break up solid friendships, those feelings are generally temporary and hopefully there's a solid bedrock there to fall back on. \n\nAlso, congrats man! Nothing beats that new relationship feeling, so enjoy it and don't let the jealousy of nerds get you down!",
            "“There are all kinds of courage,\" said Dumbledore, smiling. \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.”\n\n10 pts for Gryffindor!",
            "Sounds like you did a great job of everything.",
            "You handled everything really well",
            "You handled this situation exactly as you should have.",
            "This is a good story! Good communication and the guy got the girl!",
            "Hell yeah! So happy for you guys. ",
            "Good job. Your friends will be back. They are just jealous and will have to work through it and accept it. It will be up to you if you want to let them be your friends again. Congrats",
            "Isn’t this pretty much the subplot of stranger things?",
            "My fiance and I game together! Best of luck to the both of you!",
            "Aww! I love how this turned out!",
            "Adult results make me happy (:",
            "Great job handling it OP super happy it's working out",
            "What kinds of characters do you each play?? I am strangely intrigued to know.",
            "Hell yeah, OP. Congrats on your new relationship. I can def see solidifying your relationship with Sam and having those clear boundaries established will restore some harmony to your group!",
            "Glad it worked out between you and Sam. That’s some petty shit your friends were doing. Anyway, use protection",
            "Aw this is nice! Didn’t see your original post but it sounds like you communicated clearly and respectfully to get this outcome.  Good work!",
            "That’s a great story! I really like how you handled thing in a mature and sensible way!! Congratulations with Sam! From what I read, she’s a keeper!! I also like how you don’t put bros in front of you, but balancing between both Sam and your friends. Well done!",
            "The only dnd story with a girl on reddit that ended well",
            "Attaboy! Hope you two manage to find some awesome adventures in the future, both on the tabletop and IRL. ",
            "This is almost exactly what happened to Oz and Halliday after creating the Oasis.",
            "Congratulations! I hope you and Sam are happy together! And well done on handling this with maturity and grace.\n\nNatural 20 :) ",
            "Happy endings are the best ",
            "fuck you op i want a cute love story\n\nbut in all seriousness good luck to you both! prepare for some passive aggressiveness from your friends when you announce you guys are dating though.",
            "I honestly had a really terrible day today but reading this has somewhat cheered me up. It'll be a really adorable story (minus the DND dude drama) if you guys stay together long term, which I'm hoping you do ☺️ Congrats on getting the girl, man!",
            "Wow this is so heartwarming. Good for you for plucking up the courage and asking her to be your girlfriend outright! It can be tough to have a frank conversation about your feelings when you're dealing with an awkward situation like the one you were in. Best of luck to both of you!",
            "Wholesome nerd post is wholesome",
            "This is such great news!  ",
            "So glad to hear you and Sam are starting a relationship.  With luck  your D&D group repairs relations and grows from this. \n\nAs for Jake and Dave they owe you both a full apology.  Part 3 is the most important.  Forgiving does not mean forgetting.  Just means you release you own pain in this situation and move on.  It does not mean you put up with more abuse or things stay they way the were.  Forgiveness is for you, not the offenders.\n\nParts of a full apology:\n1. Expression of regret\n2. Explanation of what went wrong\n3. Acknowledgment of responsibility\n4. Declaration of repentance\n5. Offer of repair\n6. Request for forgiveness",
            "I'm a sucker for cute love stories. This warms my heart. Happy for you OP and best of luck with your new DnD group. ",
            "That is amazing! Congratulations!I'm glad things worked out for you both",
            "i’m in the exact situation right now, wtf lol ",
            "this turned out so cute. i’m rooting for you guys.",
            "Grats!  Good for you for standing up to your friends and being the adult! Happy it worked out so well!",
            "This is so heartwarming. Congrats on your new relationship and standing up for what’s right! I hope things work out in the group dynamic. :)",
            "Hey yeah man i bet if Sam invites some of her female friends all your boys will ease up and forget about whatever you and sam have going on in a heartbeat lol. Anyways im glad everything worked out for you great story to tell your kids one day!",
            "I have a strict \"no dating within the group\" policy.  The only exception I make is if you're *already* dating and you bring them in, but if you break up, you're both subject to the rule.\n\nNips this shit in the bud and people *are* free to ignore it knowing they'll lose group status of they do.  If it means that much to them...then it was meant to be.",
            "I want to see you both in a picture",
            "I love this update; way to go, dude! This was refreshing to read and make me want to go hug my husband, lol. ",
            "People who shit talk you behind your back once will happily do it again, and again, and again. I learnt this the hard way, after more than one lesson on it. \n\n&#x200B;\n\nWatch out.",
            "\nGreat work OP and congrats!!\n\n\n>Also -- to those who suggested Sam invite a female friend to our group, she reached out to one of her best friends from high school who still lives in the area, and she is interested in joining! I think Sam will feel more comfortable, and it'll take some of the spotlight off our new relationship if we invite a new player into our group.\n\nWho knows, if she is also single, you might end up getting one of your other buddies a gf as well :)\n\n",
            "Ready player one in real life. So cute.",
            "You go buddy! I met my girlfriend through DnD as well. Good on you for being direct and confronting the issue on all sides instead of letting it fester to the poiny that DnD was ruined for her and/or for you. It happens way more than it should, especially to girls in her position. ",
            "The ending is so cute! Congrats, OP!",
            "Damn, this is like the best news i've heard all day! Well played, all around, especially backing her up and being direct with yr mates. \n\nI'm fighting the urge to make a joke about you having high Charisma. But it's true, nonetheless. Happy for you both, and hope you can get a new group going or things smooth out with yr old group. ",
            "I’m a grown man and I just cried a little. Congrats!",
            "This made me so happy to read, congrats dude. Nerds rise up !",
            "Wait a minute are you living in Dublin?",
            "I'm so proud of you, man! You did good!!! Congrats to both of you!!!\n\nHehehe, this takes me back. This is actually how I really got to know my now-fiance. He invited me to spend time observing their Star Wars rpg--I'd always wanted to give role-playing games a shot, but never got the opportunity. I could tell how much he really liked me, but I was super uncomfortable because that seriously never happened to me like that, and I was somewhat deluded about who he actually was as a person. So, I shot him down before he could even make a move.\n\n...Yeah. Not terribly proud of that one. I was texting him at the time; apparently his closest buddy at the table that night was worried he was so distressed he'd drive into a tree.\n\nBut, while I don't always reccomend it as a general move, he kept trying. (Rightfully) convinced me I had some very wrong impressions, and I started to see him for the kind of man he really was. I love him to pieces--he's perfect for me in all his geeky ways. We play Pokemon and share all manner of video games, and he's DMing  another session of Stars Without Number tonight for me and some of our friends.\n\nSo, I'd like to propose a d20 toast in the lucky couple's honor. May your rolls always be high, and your enemies' rolls low!",
            "a girl in your D&D group....marry her and get new friends. ",
            "Nice. Even without a formal date, you took your shot to ask her to be your gf and she agreed.\n\nGranted, the gaming sessions are kind of like the time you spend together, but gj on asking her to be gf.\n\nGL to both of you.\n",
            "Hate to say it man, sounds like those guys are the typical \"nice guys\" that feel they are entitled to a girl just because she happens to share the same interests as them. I see this kind of crap all the time the cosplay world ( and I have seen girls act this way towards guys too). Sounds like you definitely need to find a new D&D group. When someone acts angry that another person doesn't want them, not sad or disappointed, but angry, that's an indicator of a real problem with seeing other people as having their value as individuals. I recommend trying to find a group that already has a girl in it, because there's a much higher chance of not finding that kind of behavior there. Other than that, congratulations on finding someone new in your life!",
            "Good for you! Love a happy ending, especially one where people admits their fault and move past it together positively! ",
            "You are a very kind and forgiving person. I'm not sure if I would have the heart to forgive a friend for talking bad about me just to go out with someone they haven't known long. I'm proud of you and happy for you both :)",
            "Pretty sure this was the plot of an iZombie episode.  Glad nobody died in yours!",
            "Dammit I love a nice update. ",
            "Awesome! Communication rocks!  \n\nI was in a similar boat before where all my friends liked the same girl but none of us knew that each of us liked her.\n\nHad a big party, I made out with her, then my friend caught us and kicked me out of the house and he ended up having sex with her.  That was his one and only one night stand he has had in his entire life.\n\nHe called me up crying and apologetic and told everyone that we shouldn’t talk to her anymore because our friendship is more valuable.  \n\nI still talk with him, despite that asshole move. Neither of us talk to the girl anymore though.",
            "nice dude. congrats on the sex",
            "Awwwwww!! Yay!!! I'm so happy for you two :)",
            "Got here after your first edit..\n\nDave, if honest, sounds like a pretty good guy. He seemed to handle everything well, so that's awesome. Best of luck!",
            "Keep the updates coming, I expect the next one to be of holy matrimony; and another of baby after years of wedded bliss. Congrats on the girl! "
        ]
    }
]