[
    {
        "post_id": "6v2xd3",
        "author": "throw-away-9834",
        "title": "UPDATE My (M/42) GF (F/36) of 2 years; she says she likes to be \"taken\", I've more of a mutual consent type",
        "url": "https://www.reddit.com/r/relationships/comments/6v2xd3/update_my_m42_gf_f36_of_2_years_she_says_she/",
        "score": 2997,
        "num_comments": 84,
        "created_utc": 1503322389.0,
        "selftext": "[Original post] \n(https://www.reddit.com/r/relationships/comments/6tntf0/my_m42_gf_f36_of_2_years_she_says_she_likes_to_be/)\n\n\nWhen I made my original post, I was feeling at an impasse and thinking I was going to end a relationship I valued, only because our sex life was starting to slacken.  Initial responses were confirming this fear \"oh you have a dead bedroom... bail on that\"\n\n\nThen I got a few comments about our poor communication, which I kindof knew... but also about how my perception of what my GF was saying she wanted (being taken) was in fact me being stubborn about what I thought it would make me to fulfill that role for her.  \n\n\nI think, being my age, I get prone to thinking I know a lot.. but in some aspects, I'm as stupid/innocent about things as it can get.  \n\n\nPrior to the post, I was pretty strict about \"anytime someone utters no, that is full stop\".  I haven't changed the spirit of this - but the comments also lead me to understand that sometimes knowing that you drive a person so crazy they just can't keep their paws off you, lead me to realize I do in fact feel that way about my GF - and that I was intentionally suppressing something that she likely really wanted to feel.\n\n\nSince the post, the next time we went out, I intentionally was oogling her and telling her ways I was attracted to how she was behaving, looking.  I also took a quick second to tell her that I've been thinking about our bedroom issues and that I decided upon a safe word that she could use later if needed... I told her the word, then went back to smirking at her as I looked her up and down and... she was just radiant about it.  She lit up with smiles and I literally could just tell I had said exactly the right thing to her.  \n\n\nI'm a \"physical touch\" person and I just notice when she gives more than not - but her contact frequency with me has been outstanding since then (it had dwindled).  Our bedroom situation has shifted to zero complaints for me as well - but our general connection just seems to be a complete reverse from where I felt it was.\n\n\nI don't think my original post gained much attention, but I wanted to post an update to thank those who took the time to respond and help me out.  This literally took the best possible direction for me - better than I had hoped for in fact.  It wouldn't have been possible without those who took time to respond.\n\n\nAs for me, I already knew there are things I'm ignorant about, but it was another good lesson to realize I can be a stubborn asshole and become too entrenched without realizing it.  The next time I feel like I'm facing an impossible issue with someone I care about, that is going to be one of the first things I take a serious look at.\n\n\nAs people had pointed out, she was telling me what she wanted (if not 100% direct, she was communicating it).  I also think she wasn't listening to me either - but there was enough there to align us back together to where now I'm very happy with us again.\n  \n  ---   \n  **tl;dr**: Just an update on where reddit helped uncover some of the issues I was dealing with and now I'm rounding out to a week of \"back to great\" with my GF - thanks Reddit!!!",
        "permalink": "/r/relationships/comments/6v2xd3/update_my_m42_gf_f36_of_2_years_she_says_she/",
        "comments": [
            "> It was another good lesson to realize I can be a stubborn asshole and become too entrenched without realizing it.\n\nA lesson literally everyone could do with reminding of from time to time\n\nGlad for this happy update.  ",
            "Good for you! Safewords are the key here - they retain the spirit of \"no means no\", but allow you and your girlfriend to explore feelings of desperate lovemaking without worrying about whether somebody is feeling uncomfortable. ",
            "I am so glad this worked out for you...well done. \n\nI don't want *anyone* to ogle me and objectify me and manhandle me: I want my *boyfriend* to do it. When he tells me I look hot and is kinda handsy when we're out and is beaming at me from across the room at a party, it makes me feel SO good and excited to get home and rip each others clothes off. \n\nLadies, men deserve this kinda treatment too (assuming they want it, of course)!",
            "Hooray! Glad this turned out so positively for both of you. The biggest breakthrough in communication my husband and I have had is realizing how stubborn we both are. It's a huge deal that you're thinking about that now!  Congratulations on everything from this Internet stranger. ",
            "this is such a positive update - well done to both of you for sorting your shit out!",
            "Congratulations. I've come across this issue myself in relationships and it goes back to how I was raised, you treat women with respect and also having two older sisters who pounded in my head that girls don't want to be looked at or spoken to except by a gentleman. \n\nOut in the real world having relationships with women who want to be ogled and taken and all that it can be difficult. Finding your way with the one you are with is the best thing. ",
            "Being a human being is so goddam complicated sometimes. This could have gone the other way so so easily, great job and congrats on the personal insight. I'm 35 and am guilty of thinking I know way more than I actually do, constantly.",
            "I read your first post. It bothers me how passive she is. Yes, it's fine now, but you need to probably have more common and frank conversations.",
            "> It bothers me how passive she is\n\nI, too, have trouble communicating my needs in a blunt way, especially to someone I love. I grew up in a household where if I raised an objection, love was withheld from me until I relented. That was bullshit, but it made me skilled at subtly stating needs. My husband has no trouble understanding \"Eh, maybe we can get tacos another night\" to mean \"I don't want tacos tonight.\" It's not that I'm incapable of stating a need, or that I don't know what I want. I just use more diplomatic words than \"EW TACOS.\"\n\n> She sounds insecure to the point of not being able to handle a relationship. He's doing most of the work it seems.\n\nCould be true. Then again, in my 6-year relationship with my husband, we've had periods where one or the other of us has had to perform most of the \"relationship work.\" When I was depressed because I couldn't find the job I wanted, he encouraged me and made money for the both of us. When he's upset about his job and has taken it out on my, I try to be patient and steer us through fights, trusting that this is him not at his best. Relationships aren't equal all the time.\n\n**As someone who's sexually aroused by submission and \"being taken,\" I thought it might be helpful to share my perspective-- I think it's a lot more complicated than someone being passive. I can't speak for all folks, nor am I part of any formal dom/sub community, but this is how it works for me. I hope others chime in.**\n\nIn my daily life, I'm an assertive person. I generally get what I want, or have ways of making it happen. I was raised to associate success with this behavior, and passivity with being weak and not worthy of love. Not surprisingly, I have some control and boundary issues-- I can be controlling, and I can push people away too quickly if they do something I don't like (preferring to shut them out rather than sort out a conflict).\n\nMaintaining these behaviors takes a lot of energy. When I assume a submissive role during sexytimes with my husband, I get to let all of that go. He dictates my pleasure-- what I feel, when he teases me, when I get off, etc. Giving up control is extremely cathartic. And sexy. After a while, I enter this brainspace where it's like I'm at the bottom of a warm sea, looking up, barely aware (and yet hyper aware?) of the physical pleasure I'm experiencing, and my husband's voice. He talks softly to me, often narrating what he's doing or about to do, or what I'm feeling. He reiterates how he's taking care of me and that I'm safe, and that I don't have to do anything but feel. It's so relaxing. I feel like I can stay in that space forever. Sometimes after I get off, it takes me a few minutes to  \"come back to reality\" and assume responsibility for my own body again. My husband usually cuddles me during that time. \n\nWe didn't start off this way; I think we'd been dating for over a year before we stumbled into this dynamic, and we've been refining it ever since. I knew I liked to be pushed up against walls, or to be on bottom, etc., but I'd never dated someone I loved and trusted as much as my husband, so it was never able to evolve to the point we're at now.\n\nIt works because we trust each other. I trust that he ultimately wants to make me feel good and would never hurt me, and he trusts that I'll tell him what's working and not working for me. I should clarify that we don't do very rough things-- it's more about light bondage and mind games-- but I think the principle is the same. To trust someone this much is incredibly fulfilling to me. In terms of my boundaries, I'm able to let someone in way farther than I'd usually tolerate, all while still feeling safe. I'm also able to authentically express my sexuality and needs, and have that be accepted (and encouraged!).\n\nAs for my husband, he's turned on by seeing me feel good, no matter the context. I've never put the issue to him, but also I suspect that he enjoys being a bit dominant, too. He's more passive in his daily life, to the point that it frustrates him, especially at work. I think his being dominant with me sexually reminds him that he *can* have his way and get what he wants. It's almost like he taps into this totally different personality-- one that I find devastatingly attractive.\n\nWe don't get into dominant/submissive play every time we have sex, either. It depends on our mood. But the dynamic is almost always present. \n\nTo me, OP sounds like he's off to a good start with communication and safewords. I'm sure there'll be stops and starts, but if you really love your partner, you're patient and hope to grow from it. \n\n",
            "You really really really sound like a nice person. Thoughtful and caring. I wish you and everyone the best!",
            "I guess I'm the only person who read this and thinks this is a little messed up?\n\nShe doesn't tell you what she wants for 8 months and lets your relationship deteriorate. You hit your breaking point and finally talk to her on it and she basically offers up nothing but a vague idea of what she's interested in. You're left with no options and are forced to do something you're clearly not comfortable with, with no support from her. Then establish a safe word without any actual discussion of boundaries and went forward with it. \n\nDon't get me wrong, I'm glad this is working out for you right now, and I hope everything can continue to improve. Just the overall situation and how it ended up getting resolved seems... not really that healthy?",
            "This is a great update, yay!",
            "I think you did great op! \n\nOur safe word is potato. Because it's amusing to us. ",
            "Oh, man, I'm so glad to hear that. Communication is the way, huh?",
            "Awesome! I'm happy for you both 😊\n\nIt's crazy how we can all help each other out on this sub so often! It makes me very happy to be part of the community! 😊",
            "Well done both of you. ",
            "Love this update. It sounds hot too. The commentators who took the time to point this out deserve lots of props because I'd also have got stuck on the communication point. Clearly it was obvious that communication wasn't working, but I don't think I'd have realised how to fix it.\n\nGood update!",
            "Great outcome! I'm 42 too and still realising how much I don't know also. ",
            "Since you're entering a relationship with an extremely submissive person.  Safe word is the easiest to remember \"safe word\" to use.  Or using the green/yellow/red system.  Also you two need to have a discussion of each of your soft and hard boundaries.  Yes, including things you don't want to do to her ever.  It's okay for you to have limits as well.  You both should do a bit of reading about S&M and safe, sane, legal.   ",
            "I'm glad you figured this out! I read your OP and was sad for your girlfriend when I started seeing the responses because I have been there. ",
            "You sounds so much like my bf who often gets wrapped up in his own thinking and  believing that due to his experiences be often knows so about a topic or gets so caught up in his own ways of thinking he has blinders on. He has come to realize this a bit more often but it has caused a rift in our communication at times. He is 35. As a man who is coming to great terms with this, is there anything you think your gf can say to you to help you snap out of it sometimes and open up your mind a bit more? ",
            "Hang on... so you're saying that people on this subreddit were quick to jump to \"your relationship is doomed, cut her out of your life\"? I for one am shocked!",
            "Don't get too cocky, you changed for a week.  The real test is to keep it up and keep her happy.",
            "I've seen so many positive updates today. I'm so glad you worked it out and got back to a happy place! Congrats to you, your lady and your revived bedroom!",
            "I'm happy for you two! Glad you could work out your relationship troubles.\n\nI do have one question, though.... did you go ahead with \"Clam Chowder?\"",
            "Thanks for the reminder that no matter how old I'm going to get, there are things I should learn!  I appreciate your humility.",
            "[removed]",
            "[removed]",
            "> I also think she wasn't listening to me either\n\nNext step in improving your relationship, when you take responsibility, take it fully. No weaseling out. That statement above is weaseling out."
        ]
    },
    {
        "post_id": "i4nbdc",
        "author": "Intelligent_Ad3412",
        "title": "My (28F) boyfriend (32M) told me a “white lie” for almost 3 years and I’m not sure if it‘s a red flag",
        "url": "https://www.reddit.com/r/relationships/comments/i4nbdc/my_28f_boyfriend_32m_told_me_a_white_lie_for/",
        "score": 3001,
        "num_comments": 252,
        "created_utc": 1596698944.0,
        "selftext": "\nTL;DR: my boyfriend of almost 3 years told me a series of “white lies” that to me, seem more serious. Can’t tell if I’m overreacting or if this is actually indicative of a bigger problem.  \n\nI’ll try to make this as short as possible but it’s going to be long as hell because there is so much lying going on. My boyfriend and I have been dating for almost 3 years, living together for 2. We have a pretty good relationship, obviously with ups and downs but we make it work and are happy. \n\nA little background on me/my boyfriend for context: \n\nI come from a single-parent home. My father was absent. My mother was/is by no means perfect, but she did her best with what she had. We were poor. Life was never easy for us but we had each other. Since I was pretty young, I’ve wanted to pay her back someday. I’ve worked incredibly hard to be able to do so. I help her financially as much as I can and regularly pay her bills/send her cash. I’m also her only living child now as my brother passed away 5 years ago which basically left me to help her. I don’t care, I love my mother, and the right thing to do is to help her when she needs it. But is is stressful. \n\nThis is relevant because my boyfriend described coming from a somewhat similar past, and it is something we have bonded over. Having the mutual experiences seemed to bring us closer. He told me he also helped his parents financially, and we would often vent to each other about the stress it brings. I am not one to confide in many people, so having someone who I felt like actually understood me, was meaningful to me. \n\n\nSo here is where the lies come in and I need someone to either tell me I’m not crazy and this is fucked up, or that I am crazy and this isn’t a huge deal. I’m fine with either. \n\nWhen we met, my boyfriend lived in a condo in a pretty swanky part of the city (I live in the US northeast). He told me he owned that apartment/condo. I found this to be interesting/odd because he was 28 at the time and I know this property is upwards of $650,000 on the low end and he was in an entry-level job for only like 2 yrs so the numbers just didn’t really add up. Whatever, maybe he’s good at saving? \n\nBut then, since living together, I never once saw a piece of mail for a mortgage payment, electric bill, taxes, nothing. Not for 2 whole years. Very odd.\n\nAlso, when we started living together, he didn’t have his room rented out in the former apartment yet so he was still responsible for that portion of the rent. He would send a Venmo payment to his mother on the first of every month for his portion. I don’t own property, but I can’t think of a scenario where I would Venmo my mother to pay the mortgage on a property I supposedly own. Getting more odd. \n\nHe would then go to his parents house for an afternoon and come back really upset. Usually when I would ask why, it was because they were having financial problems and he needed to help them out. I totally understood this and supported him. He literally has cried on my shoulder about this many times. \n\nHe tried to start a company years back and ended up getting into debt somehow. He told me this debt was $17,000 and that he paid it off. I’m confused because I met him only 2-3 years after the supposed debt accrued/company dissolved and it was already paid off? He told me when he moved back home after the business failed, he was $17k in debt and living at his parents house working at a minimum wage job. How someone with a minimum wage job pays off that much debt in 3 years, I’ll never know!\n\nWe got into a fight a few weeks ago and I finally had enough and confronted him about these things. Long story short - he doesn’t help his parents, they actually pay his phone bill, and this was all a lie. He doesn’t own that apartment, he didn’t pay off that debt from his company (he initially told me his parents helped pay it off and then like 3 mins later “came clean” and said that his business partner paid it off so I have literally no idea what the truth is there) and if anything, in my eyes, his parents are the ones who are financially supporting him.\n\nSo now, I’m dating a 31 yr old man who doesn’t pay his own phone bill, was lying to me and/or completely fabricating aspects of his life for 3 years, and then when confronted about it, continued to make up lies and then came clean about them 5 mins later. I’m obviously concerned that he could lie for this long, about fundamentally important things like our values, and so on.\n\nI sincerely thought I would marry this man, he seemed to understand me like no one else and to be a truly caring and genuine person. Now I’m having a hard time rationalizing actually planning a life around someone who would not only lie about their background and family etc. but also financial aspects. Aside from that, I now can’t tell what is the truth and what is a lie. I’ve also noticed other things he has lied about, called him out on it and he has denied it outright to my face. I see this as a form of gaslighting as I KNOW I’m not wrong but he is trying to convince me otherwise.\n\nAm I overreacting? Is this a white lie that went haywire? Or is this actually a series of complete and utter bullshit used to manipulate me? And also, is it insane for me to actually consider a life with this man? Any advice is appreciated.",
        "permalink": "/r/relationships/comments/i4nbdc/my_28f_boyfriend_32m_told_me_a_white_lie_for/",
        "comments": [
            "This isn't a white lie, this is a huge web of lies on which he's built the foundations of your relationship. I would forever be wondering what else he's lied about. Get out.",
            "My hard won advice would be to walk away because I predict/fear there are more lies.\nI got married to a woman who for the first 6 months of our rs made me believe that her best friend sometimes lived at her house when she was in between places. Her best friend turned out to be her ex who still lived in that house but would leave every weekend when I came over.\nHer reasoning for lying; she was scared I wouldn’t date her if I knew she was living with her ex. Back then (I was 25/26), I truly wanted to believe in second chances and also tried to understand the lie, and I ended up marrying someone who lied about so many things, all the time, big and small, and justified cheating on me and treating me like crap all the time. It took me years to build trust with a partner after the divorce and I still don’t really, am in therapy for it.\nThe thing about your partner lying; what he basically did was forge a connection out of something he knew would touch you in some way; my ex wife did the same thing. I was vegan, of course she was vegan. I was straight edge, of course she never drank either. I loved reading and poetry etc, of course she was into the exact same things. It seems like small things to lie about, but what happens is that you fall in love with someone that doesn’t even exist. Who is your boyfriend when not the person he made you believe he was?\nSomeone financially not very responsible? Someone who you may not be attracted to in the long run because he determined what your core values are, realized he does not match up, thus created a persona you would like?\nWhat’s more concerning, he lies, keeps lying and seems to show no remorse or deeper reflection on what prompted his behavior in the first place. I don’t see him do much to earn your trust back at this point.\nI would put pause on this relationship, call it a break or whatever if you are not ready for a full on end just yet, and think about how this all effects you and how things could go forward from here. What would he need to do to prove he can be a trustworthy partner?\nI think he probably won’t do much, and a pause or break will bring up more things that were not true, but I’d also like to be wrong about this for your sake. \nFor now, I would seriously reconsider building anything serious with this man, and building your future around him. He is 32, not a teenager. If a grown man does not know at this age that lying like this is the worst base for a relationship,  it may be better to let him go. It might save you a world of (financial and emotional) trouble.",
            "None of these are 'white lies'. White lies are harmless lies that make social interactions go smoother. This is a man who's had no problems lying to you for three years about his financial situation, and who only came clean because you're not an idiot and realised the numbers didn't add up. If you hadn't questioned it, how long would he have kept lying to you? And you already *know* this isn't just a 'white lie that got out of control', you say in your post that he lies to your face about other things! So no, this isn't a small issue. You're dating a guy who literally lies to you all the time about everything, including things that really affect you and your future. So yes, I think it is insane that you're still considering life with this man.",
            "[deleted]",
            "This ain’t no white lies. They’re just lies. And yes those are huge red flags flying in the wind. Leave now, it’s good y’all aren’t married yet. All the best.",
            "WHAT ABOUT THESE LIES ARE \"WHITE\"?!  A white lie is \"Yes, of course I lie your haircut.\"  This is a years-long running web of deceit and you still don't know the truth.",
            "If he’s still lying there’s no recovery from this. \n\nIf he’s owning his faults, being sincerely apologetic and willing to go to therapy, I think it’s possible to continue this relationship. Living together you’ll need total transparency in your finances.\n\nI can somehow understand why he lied in the start but I can not understand why he would continue to lie when the cat’s out of the box.",
            "To me these are not ‘white lies’. A white lie is if he said he didn’t eat the last cookie but he did really. It’s a trivial unimportant lie. These lies he has told you are not trivial. They are huge and have led you to question his integrity and personality. \n\nI think you are right to reconsider whether he is the right partner for you, maybe some therapy would help unpick some of this.",
            "These are major lies. And if mommy and daddy are bank rolling him what will happen if they stop or die? You are going to have to financially support this lying man baby possibly for life. You should nope right out of this relationship asap. He isn't a partner, he is a burden. Right now he is a burden on his parents and he is looking to be your burden next when the parents are no longer a viable option.",
            "Forget about the whole past thing and getting to know you and focus on the lie itself. He lied about serious financials. Its not a little thing like missing a payment once in a while. When you're in a serious relationship eventually your finances come together and do you really want to bear his burdens as well as any other things he'll lie about. For your mental and financial health I'd advise you to find some who doesn't lie about their financials to that extent. Just know that people out there exist as this is a reasonable expectation and you don't have to settle for this.",
            "Pathological liars create nothing but pain. Firsthand experience, still dealing with the trauma. \n\nGet. Out. Now.",
            "Nah... this is unacceptable. If on the first date if hinted he didn’t have much money and it never came up again, then maybe that’s a white lie. \n\nIf you’ve had multiple full on conversations about the how stressful it is to be in your financial positions and he actively contributed to the conversations and built on the lie adding false detail and pretending to feel certain emotions to “bond” with you. Then he’s just a huge damn liar and shouldn’t be trusted.",
            "The person you thought you knew doesn’t exist.",
            "I'm sorry to say this but this dude that you love doesn't really exist. Someone made him up so you would get close to them. It's highly disturbing and I think you should detach from this man as safely as possible. This is a stranger.",
            "I don't see any white lies here OP. Sorry, but this man constructed an entire web of lies, misled you on what type of person he was, manipulated you emotionally, and continues to lie about it. What else is he lying about? Is this someone you can really trust? \n\nGet out of there OP. He lied with such ease for years, he has no problem lying to you.",
            "That's not a white lie, that's a series of ongoing, escalating lies.\n\nYou're dating a very dishonest person.\n\nIt's not really gaslighting, fyi, unless he's doing it to win the argument by making you think you're crazy.  You're not super specific but gaslighting would be if you said, 'I paid this bill,' and he answered, 'no, *I* paid that bill, babe, you're going crazy.'\n\nIf he's just saying 'I paid this bill' when in fact mommy and daddy paid that bill then he's just a regular old untrustworthy shitty liar.",
            "OP, you are being groomed.\n\nYour (hopefully soon to be ex) bf saw your sensitive area and chose to take advantage of it by fake commiserating with you instead of respecting that part of your history. He appears to care for no one but himself by accumulating debt and living off of others’ hard work. He knows this is not acceptable behavior and hides the truth from you because he wants to live off of your hard work, too. He won’t be doing any hard work for your relationship. Look deeper, is this the only issue or can you find a pattern of childish actions and unwillingness to truly help you be the person you want to be?\n\nHe hides his past. He hides his present.\n\nDon’t lose your future.\n\nLeave.",
            "Follow your instincts, believe your gut ! And run ! Fast !",
            "Too many layers of lies on lies for too long. This is a dishonest person. Don't build a life with him. You can not trust him to be honest and there will be consequences down the line that affect you. Maybe you two buy a house together, he does the finances, you don't find out he's not paid the mortgage for months until you'll get evicted. Or he's messing up insurance, or whatever. Just no",
            "> a harmless or trivial lie, especially one told to avoid hurting someone's feelings.\n\nso tthis harmless/trivial lie, whose feelings was it to protect?\n\ncause that's the definition of a white lie. what he's lying about? yeah. that's not a white lie. he basically lied about his identity, his history, hee lied about his ability to function in society. so yeah.",
            "I read your post three times. I see major problematic lies, but I can’t find the “white lie” to which you are referring. \n\nYour partner is capable of and willing to lie to you about serious things that impact you, him, and your life together. Your partner also has terrible financial planning/ management skills and is content to borrow money on the basis of a lie to cover those up. Your partner shows no inclination to change and has you convinced these are minor issues rather than relationship ending issues. Even when caught her doubles down in a way you see as gaslighting and keeps lying to your face. You now know all these things. Proceed forward at your own risk.\n\nEDIT: you’ve posted this on multiple subreddits because you say you don’t like the advice you’re getting here and you keep getting the same advice (to end it or just accept you’ll get used, lied to, and manipulated in ways that will cost you emotionally and financially and will only get worse over time/ as you further bind your life to his). What does that tell you? Even in the best case scenario if his only goal early on was too relate to you he still intentionally lied, mislead, and manipulated you into believing all sorts of problematic things in order to get what he wanted from you. There is no way to look at this where what he is doing isn’t a major problem and cause for concern. \n\nYou can keep dating him if you want/ are determined to do so (though I doubt anyone with your best interests in mind would advise you to) but you need to do it with your eyes open. Expect everything that comes out of this man’s mouth to be a lie calculated to use you. Don’t ever trust him. Accept that your relationship will always be fundamentally unhealthy and built on a cracked foundation. And recognize you ignored the giant flags being waved right now and the many people (on multiple subreddits) telling you to get out. Plan for a life of financial problems and a partner who you may well discover is lying to you in other ways overtime.",
            "There’s nothing wrong with being a 31 year old whose parents pay for everything. That just makes him lucky. The fact that he lied about it is definitely wrong. \n\nIt sounds like when you guys first met you identified a lot with the fact that you have to take care of your parents and he saw that as an easy way to connect with you and have something in common, which obviously worked as a dating strategy. You put a lot of emphasis how important this is for you and he possibly felt ashamed of having it easier than you and didn’t want to make you feel bad. It makes sense for the short term and he possibly didn’t think you would be a long term thing, which is also a red flag. \n\nNow you can’t change what he said in the past and you can’t change his financial situation or blame him for having it easier than you. You have to make a decision for yourself whether you think he can truly change or not and fully trust you and whether you can forgive him or not.",
            "He’s what I call a chameleon. He just creates a fabricated persona that he thinks would appeal the most to whoever he’s around, and anyone I’ve known like this, I found them to be very unlikable underneath the guise.",
            "These are not harmless white lies. This guy has fabricated his entire life. You do not know him at all, and now you know that you can't trust him to ever tell you the truth. It's time to move on.",
            "When I started my 4+-year relationship with my now-ex, I found out a year or so later that he’d told me some white lies. For example, we both talked about how we hadn’t slept with anyone in forever (when in reality, he hooked up with his ex a few months prior to us talking). When I found out the truth, he later found a way to spin it into me being obsessed with his sexual history, when, in reality, I was obsessed with the fact this guy A) lied to me B) put my sexual health in danger. After our breakup, he actually rebounded to this SAME person (he shit-talked for years). I still tried to make things work with him after that because I loved him and I know everyone (including myself) makes mistakes. It didn’t work out for various reasons, but he’s actually the one who got the ultimate say that he didn’t want us anymore. Sometimes I feel shame over that, but other times I just accept that I truly loved him and it was the first time I was ever willing to work through things like an actual adult with another human being.\n\nSometimes people lie because they think it’s the only way they can have you. The lies might seem minuscule in the grand scheme of things, but the fact they lied will eat at you unless you can completely forgive and release. Only you can decide if you’re capable of moving past the lies, the outcome of those lies, and what the things he kept hidden mean for your future.\n\nWho knows why he lied exactly, other than him.\n\nIt’s up to you now to decide if your relationship can handle this. Best of luck.",
            "These aren't white lies. He's structured an entire fabrication for almost his entire life background. This guy is a pathological liar. It is a character flaw that goes to the core of who he is and cannot be changed or fixed.",
            "It sucks but it's over. Even if he flipped a switch and became the perfect person you thought he was tommorow you still will never be able to trust him again.\n\nStaying in it will only lead to a slow determination of your mental health as you question every aspect of your reality, as well as an ever worsening relationship that will eventually turn very ugly. Cut the cord swiftly and go.",
            ">  I sincerely thought I would marry this man, he seemed to understand me like no one else and to be a truly caring and genuine person.\n\nYeah.  He seemed to understand you because he's a lying liar who lies all the time.  He's a chameleon, always changing to blend in.\n\nYou mention near the end of your post that, \"I’ve also noticed other things he has lied about, called him out on it and he has denied it outright to my face.\"  \nYou will never be able to trust anything this man says to you.  Even when he's being truthful you *will* have that little kernel of doubt because **you know** he's a deceitful person.  Don't go on to make a life with this person.  Trust is crucial to long term bonds and you cannot build it alone.",
            "He lied to you about a HUGE PART of his life. \n\nRed flag 1:\n\n>he doesn’t help his parents, they actually pay his phone bill, and this was all a lie. He doesn’t own that apartment, he didn’t pay off that debt from his company (he initially told me his parents helped pay it off and then like 3 mins later “came clean” and said that his business partner paid it off so I have literally no idea what the truth is there) and if anything, in my eyes, his parents are the ones who are financially supporting him.\n\nRed flag 2:\n\n>when confronted about it, continued to make up lies and then came clean about them 5 mins later. I’m obviously concerned that he could lie for this long, about fundamentally important things like our values, and so on.\n\nRed flag 3:\n\n>I’m having a hard time rationalizing actually planning a life around someone who would not only lie about their background and family etc. but also financial aspects. Aside from that, I now can’t tell what is the truth and what is a lie. I\n\nRed flag 4:\n\n>I’ve also noticed other things he has lied about, called him out on it and he has denied it outright to my face. I see this as a form of gaslighting as I KNOW I’m not wrong but he is trying to convince me otherwise.\n\nHe's manipulating you to not talk about the lies he made, and denying them to continue living in his false narrative. That is abusive and controlling. You honestly would never know when he is telling the truth. He has lied to you repeatedly, and lacks any sense of humility. Relationships are about trust and honesty, and I don't know how you could rebuild trust with this constant dishonesty. Take a deep breath, and ask him why he is denying the lies? \n\nAlso, in any case he shows signs of aggression, I would advise discussing these matters in a more public setting for your own personal safety. \n\nHe seems to lack character to learn from his mistakes, and this will not help you build as a person. This relationship was built on lies. It's on you to make a decision how to move forward, but does any of this sound like it would make you happy?",
            "It needs to end, and it will be for the better.",
            "I have advice and remember it, if roots of your relationship is based on false,lies. It won't give you a good fruit in end. I know that 3 years means alot but you only think if he has been lying from 3years  won't he lie in future?",
            "Remove the colour. “My boyfriend lied to me for three years.” Yeah mate. That’s bloody huge.",
            "These are not \"white lies.\" He fabricated his entire life story, on top of lying about his finances to you. As to why? Only he can answer that question. Best case, he thought you would think less of him if you knew that his parents paid for everything and wanted to bond with you. Worst case, he's a pathological liar and will continue to build this web of lies. Either way...you can never trust him again, so having a life with this man has gone out the window.",
            "Going back to basics, trust is one of the most important things in a relationship. Can you trust him after this? You’re talking about marrying a man who you’re wondering if is gaslighting you, and you’re confused about the whole situation and don’t know what to believe anymore. If you think you can work it and want to, try going to couple’s therapy. Give it a shot. You might get over it and trust again, and you might not. It’s just hard because he’s been lying for a long time about a lot of stuff, so can you really trust him? Even if the lies weren’t meant to be hurtful or were lies that got out of hand? At the end of the day, he was dishonest and deceitful. He might be a good guy, but sometimes it’s not worth the risk. A healthy relationship consists of being open and honest with each other, especially about finances! If you’re going to marry someone, you have to be upfront about everything, and clearly he was not. Him saying he owns a house is a very big and serious lie. I’m thinking about the healthy relationship examples I have in my life, and the men would NEVER lie about something like that.",
            "He's been conning you for three years",
            "These are huge lies. Even without the context of making up a background to emotionally manipulate you, lying about your family, history, and finances just isn’t a foundation on which you can build a life with someone, regardless the rationalization. The fact that you’re even entertaining the notion that these are “white lies” speaks to how he’s manipulated and gaslighted you. If your friend gets a hair cut and you don’t love but you say it looks great, that’s a “white lie.” This is damn near fraud.",
            "From experience, if you can't differentiate the true from the lies and you can't just assume everything he says as a truth, you should NOT be with him.\n\nIf you stay your mental health, your confidence and your self worth will drop, he'll keep lying and making you believe that you're just overreacting. \n\nHUGE red flag....leave, you deserve better.",
            "Good god woman please do not marry this moron",
            "You realize that you have no idea who this man is, or what the truth is, right? You'll never know what the truth is because he's a proven deceptive liar to get what he wants (you). You need to run.",
            "OP, to add on to what others have said, this is definitely NOT a white lie\n\nA white lie would be something like \"Oh, I actually don't like the color blue. My favorite color is red. I hate blue.\" when your favorite color actually is blue but you're in the wrong part of downtown L.A.\n\n&#x200B;\n\nYou already feel like you can't trust anything he says now. If you were to get married, would you trust him when he makes his vows to you?",
            "White lies are small and do no harm.\n\nYou found out your 32M bf can’t support himself.",
            "I used to be in a similar spot. Dated a guy that would always just lie, like it was easier to lie then to tell the truth. He was also an expert at making me feel like I was the crazy one when I would catch him in lies. When caught he would always just shrug it off and say what's the big deal it's just a small lie. It took me years (which I'm not proud of) to finally realize that if he could lie that well then there must be a ton I didn't know. I caught him cheating on me and all he could say that making out with someone else wasn't cheating so that is why he didn't tell me. Please don't stay with someone that lies so easily because later on you'll question everything and rightly so. I hated the person that he turned me into and as soon as I dumped him I smiled, never even cried.",
            "He sounds like a pathological liar. You will never be able to trust him. I’m sorry. You should leave him. That sucks that you had to go through that. I hope you can find someone worthy of your trust someday after you’ve healed from this.",
            "These are not white lies. This is a string of deceitful lies with no underlying good intentions.",
            "These aren't \"white lies.\"  These are big lies, and more importantly, it doesn't seem like he would feel a NEED to lie about them.  Have you considered that he may actually be a compulsive liar?  It's natural for someone to fabricate a story when they feel like the truth will get them in trouble or bring about negative consequences - that's not to excuse that type of lying either, but self-preservation is understandable as a basic human instinct.  It's something else entirely to lie in situations where it doesn't seem to provide any discernible benefit.  \n\nYou're definitely not overreacting, BUT you're not insane to still consider a life with him.  It sounds like he's been incredibly supportive of you, and as someone who also has trouble opening up to people, it's a special thing to find someone you're that comfortable with.  On the flip side though, you want him to feel that same comfort in return.  I wouldn't ignore his lies or dismiss them as harmless because his deception was part of the reason you opened up to him in the first place, but I would insist on sitting down and having an honest conversation about WHY he felt the need to lie.  \n\nMaybe he felt embarrassed and wanted to downplay his financial dependence on his parents because he's comparing himself to you and feels inadequate when placed up against someone else his age who's managed to become self-sufficient to the point where she can also help support someone else when he isn't even fully supporting himself.   I think the \"why\" here is crucial.  I wouldn't just write him off.  We all make mistakes, but I would make him understand that your willingness to stay in this relationship is 100% contingent on his ability to be honest with you.",
            "This is definitely not a white lie.",
            "Lucky to find out now. End it.",
            "These are not white lies.\n\nNow that you know this , you don't have to stay with him, thinking that they're just some little lies that the two of you can get over with love",
            "A white lie is a little lie that you say to not hurt another person's feelings, such as telling them that yes, you did like the weird gift they picked for you, and no, that stain on their shirt was not noticeable. Lying about one's whole life is not a white lie.",
            "I don't think you understand what a white lie is.",
            "This is not a white lie. It’s hella lies. It shows his financial responsibility or lack thereof... It shows his integrity- which is not great here. It may not feel like a deal breaker but honestly I feel it is. Like what the hell else do you lie about on the regular? Do not marry him and especially don’t join finances with this dude. I know first hand that can star it up ruin your life and future. Take a step back and think about what advice you would give your nest friend in this situation.",
            "Leave. He is not worth the constant second guessing you’ll need to do from now on just to protect yourself from being impacted by his lies.",
            "to me being on the same page financially is a really important.  These seem like a massive red flag.",
            "Do not marry him. If he respected himself and respected YOU at all he would have never done all this. You will regret it for the rest of your life if you legally tie yourself to someone this dishonest when you had the option to cut and run.",
            "They are not white lies, they are whoppers & huge red flags. You should not continue your relationship until he gets therapy for his lying, it’s a habit for him, how can you ever know if he’s telling you the truth or a lie.",
            "Uh, \"white lies\" are untruths (usually by omission) that act as social niceties in low stakes situations. In what UNIVERSE do these things qualify as \"white lies\"???",
            "Baby girl, you gotta run.. now 💜",
            "You said yourself at the start 'there is so much lying going on'.\n\nIt's not good, he's severely broken your trust and only came clean when you found the courage to press.\n\nNot only that those values you thought you shared and based your relationship on lies, all those shared moments of stress were him lying. And instead of him being upfront and helping you when you were upset and stressed he joined in in a kind of poor me too! Which makes it worse IMO. \n\nHe also isn't financially intelligent. Do you want to tie your wagon to a 30+ year old who isn't even responsible for his phone bill and gets bailed out left and right by parents/business partners...\n\nHow you have helped your mother is admirable and you deserve someone honest and with the same integrity and honor as you have. Plus now with broken trust so you want to go through life second guessing everything? This wasn't one white lie, it was sustained, continuous and lots of lying. Cut loose and start over please.",
            "I don't want to be one of those redditors that always jumps to the most extreme conclusion.  Buy read through your own post, including the info in your responses to what others have said. This guy is a compulsive liar about issues both large and small. (I can pretty much guarantee he has some sort of personality disorder). Why in the world would you want to build a future with someone you absolutely cannot trust???  You don't even know who this man really is. Don't walk away- RUN!",
            "Time to leave - regardless of what you think of your relationship, it was a fabrication built on lies. For 3 years. And it sounds like he continues to lie and gaslight. How does he afford a swanky apartment on his own, but needs his parents to pay his phone bill?",
            "I read this twice, where's the white lie(s)?",
            "You aren't over reacting. I would dump his ass really fast. He's obviously a codependant manipulator.",
            "To me this actually seems like a small lie gone haywire. If you see him as a person that loves and cares for you, then I don't see why this one financial lie is going to end your relationship. I feel like he was maybe trying to hype himself up to you for awhile, and then realized he couldn't go back. Since this lie isn't about him doing something bad and lying to cover it up, it's just about making him look better, it shouldn't be a big problem moving forward.",
            "I'm gonna be very honest with you. Just leave. These aren't small lies, this is something else entirely. You're an intellegent woman, you caught him in his lies. You can't believe he won't do this again, or if this new story is the truth. I think he's not worthy of you, you deserve way better.\n\nWhatever you choose to do, best of luck! It will be hard, find support in those who matter to you.",
            "If he'll lie about this, he'll lie about other things, as well.",
            "Reread the way you summarized that. \n\n> Now I’m having a hard time rationalizing actually planning a life around  someone who would not only lie about their background and family etc.  but also financial aspects. Aside from that, I now can’t tell what is  the truth and what is a lie. I’ve also noticed other things he has lied  about, called him out on it and he has denied it outright to my face. I  see this as a form of gaslighting as I KNOW I’m not wrong but he is  trying to convince me otherwise. \n\nDoes that sound like a **white lie**? No. You're reacting to it seriously because it is serious. He lied to you about both his financial status and his background. In several respects, you've been dating a figment of his imagination. \n\nWhat you do with that information is up to you. I might understand one big lie, if he was the one who came clean first and he had a really good reason for it. But this - I would find it difficult to forgive such large lies, trickled out over a long time.",
            "Size of the lie aside, he is continuously lying. That is not ok. How can there be trust in the relationship when you can’t tell what the truth is anymore,",
            "To answer your questions:\n\n1- No. You are not overreacting. If this was your husband, he will not be honest with finances and commit financial infidelity(this is real, and is a cause for divorce) to you on a regular basis.\n\n2-This is manipulation. How else did he get you to stick with him in the first place? He used your situation, and your past, to get what he wanted from you.\n\n3- I wouldn't consider a life with this man. Eventually, you will grow too old to hold a job. You will need money, and this guy is lying to you over it.\n\nYou don't trust the man on two of the 5 basic things you need to be on the same page to maintain a happy marriage. He  not be honest with money, and he will not be honest in communications with you.",
            "This isn't a white lie. A white lie is a \"oh yeah man, your singing is great\" \"Yeah I took out the trash\" not lying about his home life, where he came from, everything. For 3 years he lied to you. You don't even know what is true or not. This isn't a red flag though.\n\nThis is a red strobe light with a fog horn attached.",
            "Where is the little white lie. This looks like three years of sustained lying and outrageous deception.",
            "Run. Run far. Run fast. He’s manipulative and incapable of accepting responsibility.",
            "These are not white lies. White lies are relatively harmless mistruths that are susually said to protect someone feelings or maintain privacy ... not to completely mislead people about your character, upbringing, status, etc. \n\n>he seemed to understand me like no one else\n\nIt's not real. Every word out of his mouth has been a lie. I strongly urge you to walk away from this relationship right away. He's not only a shitty liar but also shows no remorse for completely misleading you. You had to completely corner him for it to come out. The man you fell for doesn't exist. The man he actually is, is a total mess and should not be in a relationship with any one until he gets his life and mind straight.\n\nRelationships only work with trust and he has obliterated any hope of you being able to trust another word out of his mouth, any financial decisions he makes, or feelings he claims to understand.",
            "He lied to you about BIG things, important things. I wouldn't be able to marry, let a lone trust, someone who told so many big lies.",
            "He obviously isn’t in the same place financially as you are and I see him only dragging you down into his money pit when/if y’all marry.\n\nYou help your mom financially and he needs help financially. I don’t see this being a good scenario in the end.",
            "Deal breaker. You fell in love with someone who held the same moral values and financial ethics as you. HE IS NOT THAT PERSON. The person you love is a saver and supports his parents. This person is a liar who leeches off his parents and is probably in debt. There’s more lies here. I know it. End it. I married a liar and it’s my biggest regret. I question the validity of the most basic things",
            "Of course you bonded over fantasy, because he told you what you wanted to hear the whole time. And that's not a white lie, that's super dangerous behaviour because you can't trust people who don't earn your trust but manipulate you into it.",
            "If anything you are underreacting. He lied to you to make himself look better *and* he sounds irresponsible with money.",
            "You, though you started out poor, are a very competent person taking care of yourself.  He on the other hand is not.  Maybe he was infantilized growing up.  And he is ashamed.  He isn't strong or capable enough to take care of himself but he doesn't want you to know that.\n\nHe also may have a level of paranoia there of the \"if she knows I come from money she will then only love me for what I can buy her.  I should lie so she doesn't think she can use me\".\n\nI suspect those are the main causes but whatever the reason it's clear that you really know so little about this man or his true life that there is no way at all to plan a future with him.  This is not a 'white lie\" it's a total lack of information.\n\nAnd I'm a little surprised that in 3 years you haven't met his family.  If you had some of the lies would probably have unraveled.",
            "Have you not met his family after 3 years?",
            "Girl, I say you could give him the chance to come clean about everything and get his life together, but if he can't or won't, get out. I know it's hard because you love him. If I were in this situation I would not be able to trust them ever again so if it were me I'd need to leave. You know yourself best. But I strongly recommend to leave this relationship and find someone you can fully trust. If nothing changes and you are further down the road with kids and financial responsibilities and something happens you're in a really bad spot. Good luck girl",
            "If your finances are commingled in any way, you might want to start separating them.",
            "This is not a white lie. This is too much.\n\nHe totally manipulated you and used this completely fake scenario to make himself look good and to draw you to him and help him bond with you. It's gross.\n\nPeople who lie like that about one thing (building lie upon lie and being what I call a \"fast-talker\" when caught out) are, in my opinion, always going to lie. It's built into their makeup. I think often it is nothing more than a really bad habit they have but they aren't people I want to be around. \n\nAnd with this guy it's more than just a really bad habit, because he used it to misrepresent himself to you and to manipulate you. Plus--he sounds like a financial disaster that you will end up supporting when that money should go toward your mom!",
            "I’m going to chime in here to agree with everyone else....these are not white lies, they add up to a serious misrepresentation of who he is. You say you bonded over common experiences...well those experiences simply never happened on his end. So your bond is built on a lie.\n\nOf course you know yourself best but if it was me, well, this would be a complete dealbreaker. I would never be able to trust a thing he said.",
            "Series of red flags not white lies. They are huge lies to be telling and don't let him downplay them.",
            "Oh F no. This man gets off on playing you for a fool. He likely plays his parents. He will use you and your funds. This is a con artist. Have you even met the parents?",
            "The reason for the lies is as important, if not more important, than the actual lies themselves. I think you said it perfectly when you spoke about stealing valour. This is something you can’t really tell about someone with words across the internet; usually you sense it better irl.\n\nIf it’s as you describe then there’s no hope for the two of you. People like that, who take shortcuts to emotional gains instead of earning them, I call them psychologically lazy, only tend to truly change through major crisis, and definitely not within the framework of a stable relationship dynamic that delivers what they need. \n\nMy words sound harsh, but Im honestly not judging him in terms of good/ bad; Ive met people who function in the same way and I can understand how they got there. Im not perfect either.\n\nBUT, as they are, people who function like this are impossible to live with unless you want to be forever forgiving them, explaining away their behaviour or waiting for them to change. Or, worse, pretending not to see it. It will slowly kill your spirit to do this and I dont recommend it. There’s no good reason to do it either right now, except for trying to preserve this idea of what you thought your connection was. \n\nThe fact that he tried to cover up even in the midst of talking about it with you shows imo just how unready he is to be honest with himself and you.  He’s heavily invested in his lies, and even if he intended to change for fear of losing you, it’s not that easy. He only knows how to lie at this point in his life, and it’s very likely he’s been lying on a major basis well before he met you",
            "A white lie, no, big lie getting bigger, yes, you know what to do. Now what you may ask yourself, is it \"him\" that you want, or is it the idea of him? Once the lying started, the relationship on some level is over, and what you have left is only an illusion that looks like someone you want.",
            "He has no issue lying to you, for years, and isnt the person you thought he was.\n\nI'd run personally. You might as well marry his parents.",
            "Run. If he is that age and doesn't pay his own bills, then that is a huge problem that will never get better. Also, those are big lies. You deserve better",
            "Your instincts are correct, this is a huge red flag. I had similar problems with my ex, and I would forgive him every time I realised his stories didn't add up. Figured he was just really insecure about his lack of independance from his extremely  wealthy parents, and I've never wanted money to be THE dealbreaker... until he ended up secretly siphoning money from me to keep up the illusion that he was financially responsible. Man babies deserve to be alone, dump him!",
            "You are not over reacting. You should take this as a huge caution sign and truly think if you can trust him again. I’d encourage you to leave and save yourself some heartbreak, but I don’t know you. Think about your financial future and what you want out of life. I am certain where you are isn’t what you want for your future.",
            "I think he will lie to get ahead. Even when he's falling. I would say make your decision quick. Because furthering this relationship as is. Will ultimately leave you miserable. He will then wein off you in the long run. Just my 2cents. Take it or tell me to fuck off. Either one is ok. Good luck",
            "You are dealing with a ”Peter Pan”. He is clearly looking for a new mommy.",
            "That isn't a white lie at all.  He is a liar and a loser.",
            "Be thankful you dont have kids with this man.  What a mess.",
            "Girl that’s not a red flag. That’s a ticker tape parade of lies and deceit. \n\nHe built your relationship on a web on lies. Presumably because he thought you wouldn’t be with him if he told you the truth. \n\nCause he must’ve known this house of cards would come tumbling down at some point. If he didn’t, He’s stupid and negligent on a horrific level and you should run. \n\nOr he wasn’t invested in you and he may have thought you wouldn’t be around long enough for the truth to matter. That shows a dubious moral compass in which case you should run. \n\nEither way, you cannot trust this man. \n\nAnd as a side note, I’d check your credit history and go get tested for STD’s. There’s no telling what else he’s lied about.",
            "You are under-reacting honestly.  OP....YOU HAVE NO IDEA WHO HE *ACTUALLY* IS.  Think about that!  Run, run fast and run hard.",
            "jeez, none of these were white lies, this guy straight up catfished you.\n\nwhat in the actual fuck do some people have instead of a brain up there? (talking about the bf not op)",
            "Lying about finances is not a white lie. It should be a dealbreaker.",
            "Who knows, but know that the consequences of the lie and reasoning might have nothing to do with your value system. Maybe its to score points with you or his own psyche.\n\nBasically, remember that's more unknowable than you'd like. Even HE would have to be perfectly self-aware to fill us in. Are you? And equally: is it reasonable to say its your job to wait around for clarity?",
            "Break up with him. He's built an elaborate web of lies over THREE YEARS and tried to cheapen what you do for your mum. I also worry that he could convincly and comfortably pull this lie of for so long. Youre better of without him.",
            "I think you already know that this is a series of serious, relationship changing lies, and that you can no longer trust this man.",
            "NOT a white lie. Lying and gaslighting should be enough to end up. Especially lying about such serious things and for so long. RED FLAGS!!!! Leave!",
            "I think that people on Reddit are always too excessive. Ok lying is bad, won't tell you otherwise. But if you really love, you have to go deeper. Maybe he lied because he never loved someone as bad as you and he feared his financial situation would make you flee. When you start to lie, you can't get out, you need to stick with it. And that's what he did. I would not be so fast to say wether you need to get away from this man or not. \nIn the other hand, you need to have a serious conversation with him, about why he lied. If he doesn't answer, now that is a sign that he doesn't feel close to you and that he's not willing to (at least) apologize for all the lies, which is a more serious matter, I feel so.\n\nBeware of people that tells you that lying is a straight \"no no\". Life is always more complicated than that. Everyone has a reason to do anything. To figure out your next move you need to hear this reason and ask yourself what you feel about it, regarding values, how you were raised, how you developed as a person. If the reason could not have had a place in your moral and social way of thinking, or if you can understand his behavior but he should have come and tell you sooner, what you will decide in the end tells more about yourself than it will about him. I wish you good luck !",
            "There is never just 1 lie.",
            "This is a series of complete and utter bullshit used to manipulate you into being closer to him.  It worked.",
            "The likelihood of you marrying this man and him running you into the ground with debt is high. I wouldn’t risk it with so many red flags before marriage. Look up YouTube videos of callers on Dave Ramsey’s podcast about financial infidelity...",
            "With the best will in the world; a person's background fundamentally affects who they are and how they interact with the world. And he lied to you about all of it for 3 straight years. Get rid of him, there's nothing lost, it was all lies anyway.",
            "RED FLAGS ALL OVER THE FIELD ! He didn’t lie about one or two little things BUT big fundamental items, y’all’s relationship were built on these lies that he spun and the relationship like a house is only as sturdy as the ground it was built on. Now he has to accept the consequences of his actions good or bad he has nobody to blame except himself if you do break up with him do it as safely as you can.",
            "Take some time to heal. \n\nThen start fresh with someone that EARNS your trust. Not someone that ruins it.",
            "At the end of the day, he has shown you he is not a reliable person. Do with that what you will.",
            "So many red flags. So, so many...\n\nFirst of all, there's no \"little white lie\" in this anywhere. He's outright lied to you about a lot of things.\n\nWhile I'm loathe to diagnose anyone because I'm not a psychiatrist, therapist, or doctor of any kind, I was married to someone like this for over 20 years and once the truth finally came out, I left the marriage immediately.\n\nThis one really jumped out at me, as it's what narcissists do (remember, I was married to one - diagnosed by both a psychiatrist and our family therapist):  *he seemed to understand me like no one else and to be a truly caring and genuine person.* \n\nOF COURSE he did! It's how they trap you into being in a relationship with them and loving every minute of it! Until they know you're hooked, and then they turn into another person entirely and it's someone you never knew them to be. Being everything you want them to be is part of the façade! They will, then, spend the next 10 or 20 years dangling \"just enough\" of the \"old loved one\" to keep you hooked, all the while, they are abusing the fuck out of you, either physically or mentally or emotionally or a combination of all three.\n\nTrust someone who's been there. Get. Out. Now. Before. It's. Too. Late.\n\nI learned much too late and I wish, Oh God, I wish someone had warned me before I married him and had kids and a mortgage with him.",
            "As someone who was in a longterm (10 years) relationship with a chronic lier, RUN!!!!!!! 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩Dont waste more time and energy on this kind of person. You will spend so much time trying to figure out the truth and they don’t care how you feel in the long run. \n\nYou are worth more than that!",
            "Damn 31 and can't pay his own phone bill lol shit i thought my life was sad but his is very sadder.",
            "I have dated someone who would make up weird, obviously false lies like this. These are not \"white lies,\" these are the lies of a compulsive liar. After massive lies like these, you can never trust him to be truthful with you again, even with very important things, unless he gets intensive therapy to help him start telling the truth.\n\nAnd you are not obligated to stick around while he receives this intensive therapy.",
            "Those are some pretty big lies that are apart of the foundation of your relationship. Chances are he will continue to lie. You need to do what's best for you.",
            "I'll cast a slightly different take on this. I've had two marriages fail.  After lots of therapy I realised that I was choosing to marry, for the sake of keeping this short, gold-diggers.  My family has assets and businesses and it looks like we could be wealthy. While we kinda are, we live frugally as there are more assets than cashflow.  Like I'd be able to buy a house, but then I'd live frugally the rest of time. \n\nSo when the money didnt shower down from out of the sky all the time, the wives got sick of waiting and left and took what they could get.  Getting back to your boyfriend, the outcome of all this I am very gun-shy when it comes to talking about money and finances with women when I start dating then because I want to try and avoid the golddigger trap again.  Is it possible this is how it started with him?  That he didn't want to be just seen as someone that had a wealthy mummy and daddy?  I do think that the lies went on too long but maybe the original reason was genuine.",
            "You know what you need to do,  you need to find an honest guy who can take care of himself and not mooch off his parents.",
            "This is \"second wife/other family\" level lying. Big red banners and liittle red flags lining the streets. Liar liar pants on fire bad. Drop that lying sack of cheese and find someone who isn't so fond of prevarication.",
            "The financial issues are themselves probably not a big deal, but the long campaign to lie to you is. There's no way you can ever trust this man.",
            "There's so many people on this earth, there's probably one for you who won't lie",
            "Not a white lie. There's no shame in not owning a home, and I'd argue not even in your parents paying your phone bill (it isn't universal but isn't unusual either). The lying though...those aren't white lies, a white lie is telling you the spaghetti sauce you made is good when it's actually bland. Not lying for years about his financial situation. Be very cautious, he's actively been deceiving, who knows what else is a lie.",
            "You’re definitely not overreacting. This is all seriously concerning. Lying like this, and for so long, regarding important things like finances... is a huge red flag. I wouldn’t just walk away from this guy, I would run. Who knows what else he has been lying about, and also you’ll probably never be able to trust him. Financial issues tend to put a strain on relationships as is, so marrying someone who isn’t even remotely honest about his finances will guarantee a lot of anxiety-ridden episodes for you. All in all, a recipe for disaster, in my opinion",
            "**White Lie**; Noun - a harmless or trivial lie, especially one told to avoid hurting someone's feelings.  *I told Karen a white lie, that her new haircut looked good.*  \n\nThis isn't what he told you.  He did it to save face, to look better, to avoid exposing the real him.",
            "That’s not a white lie!! That is more than one major lie!!!",
            "White lie = “Your lasagna is my favorite lasagna” when they actually prefer the lasagna from a restaurant \n\nTo me this is actually one of the worst kinds of lies - misrepresenting who he is on a deep level in order to make you like him more. I do not like. Whether you feel you can rebuild trust with him is up to you, but it sounds like he’s also really bad with money. And it sounds like you’re pretty good with money. So that’s something to consider.",
            "Being 31 and having your parents pay for your phone bill isn’t an issue at all. My older sister is 31 and makes almost half a million dollar as a doctor but my lower-middle income class parents still pay her cell phone and car insurance bill because we’re on a family plan and she never changed from it. She’s otherwise completely financially independent though so that doesn’t really speak to much. (Now that I type that out I’m actually kinda pissed that I set up direct deposit immediately after college to my dads account for my portion of the cell and car insurance bills and my sister hasn’t.)\n\nHim lying about all that stuff kind of stuff is a big deal though and you’re completely in the right for feeling hurt, betrayed, and lied to. The only time I would possibly see lying to your partner about your net value and it being acceptable is if you’re filthy rich/came into a lot of money and you don’t want that to be known early in a relationship as the excess money warps peoples expectations and perspective.\n\nIf you think your relationship is worth salvaging then have a serious discussion with him about why lying to each other is not the way to build a trusting partnership. If he responds well and you can see true effort and change happening, then continue to repair the relationship. Understand that small mistakes can be made as you two iron out your paths and expectations, but he should improve. Also that doesn’t excuse any other major lies. In my opinion, he should be on a very short leash though if you do want to try fixing the relationship.",
            "As others have said, none of these things are white lies. White lies are like telling someone the food they made is good because you don't want to hurt their feelings. This is either compulsive lying or pathological lying. It sounds likely you don't even know this person at all because if he lied about all that what else has he lied about? Something very similar happened to me, but I didn't find out the extent of it till after I broke up with him. In my situation he said he had similar traumatic experiences growing up. Turns out that's not true at all. I'm slowly unraveling all the lies and finding out that likely less than 5% of what he told me is true. His ex-wife contacted me after I broke up with him and all the things she's told me that she knows about him have revealed all the lies. I had some suspicions while in the relationship, but he would just lie more or refuse to answer my questions. But I never guessed the massive extent of the lies. It's really scary to find out this person you thought you knew lied about almost everything. The thing is these type of people usually don't change. My ex lied to and gaslit his ex-wife all the time, had other relationships before he met me, and continued to do those things. Actually he got worse between her and me. It seems he lied very little about his past to her. His lies with her were about everyday life and such. I also had a friend who dated a guy for awhile and found out he lied about his entire life including what he did day to day. He lied to everyone about everything constantly. He was so good at lying she only found out by complete accident. My advice would be to get out. People like this seem to lie about everything and they're often good at it and get better at it over time. I just don't see how you could be with someone when you'll never know what's the actual truth. Trust is important in a relationship and you'd never be able to trust him after finding out he's a major liar. Also in my experience, when they lie about everything you realize you don't know who they are at all. The person you thought you knew turns out to be a complete facade. I'm so sorry you're going through this. It's really horrific and awful finding out the person you thought you knew is really a stranger who lied all the time.",
            "Is he the one calling this white lies or otherwise downplaying them? Cause he sure doesn't seem to understand the problem - and then there is no hope of change...",
            "This is more than a white lie.  This is a deal breaker for any long term relationship unless he really turns over a new leaf on honesty.  \n\nOne of the biggest reasons for divorce is money.  Whether the couple doesn't agree on finances or saving/budget OR someone deliberately lied or concealed their financial state, opening their unsuspecting partner up to liability.\n\nYou aren't even married and he's been lying to you from day one about his finances.  It'd be one thing if it was a hobby of his (like he made three tables with his woodworking habit rather than two or four), but this is HUGE.  $17,000 dollars of debt and he tells you it's already taken care of?  Imagine if he had gotten into $30,000 in debt, hid the debt and the reason why, on a credit card he took out with both of your names on it if you got married!  (For the record, this happened to a friend of mine.  She found out about it only because she opened the wrong drawer in his desk, trying to find the wedding \"thank you\" cards he claimed he finished.  He didn't finish the cards.  He also secretly got a credit card in both their names and racked up $30,000 in debt buying Warhammer figurines that he planned to build, paint, then sell).\n\nI think the more insulting part of this is that he lied and the lie isn't even a good one.  If he's acting this way before your finances were joined and when he might have MORE reasons to cover his ass (i.e.: \"Oh, if she finds out, she'll divorce me.\"  \"I don't want her to be mad that I can't actually afford a car so I'll take out a secret loan and not tell her.  It'll work out.\"), then I would be concerned what he'd do once the stakes are higher.  \n\nWhy did you not confront him on this sooner?  Did you believe he would just lie more or did you just like him so much that you didn't want to face the fact that he was lying?   \n\nYes, I think the fact he lied about such a big thing is a bigger deal than you're making it, especially with how many marriages collapse over financial issues.  However, I also think you need to look at yourself and decide why you were willing to ignore all the inconsistencies and other things that didn't add up until you literally could not anymore?  What were you waiting for?",
            "This is a HUGE deal. It sounds like you've been lied to and manipulated so much that you can't even trust your own judgment anymore. That alone is a deal breaker, if you ask me.\n\nA marriage is a partnership between two people. You need trust, respect, love, mutual admiration and the ability to communicate respectfully. Without these things, it's just not possible to have a stable, healthy relationship. Why even bother entertaining the idea of marrying this guy when that's not even the case for you all? Not to mention if he lied to you for this long about something so huge, what else is he/could he be lying about? I'd cut my losses while I still had the option, if I were you. This is a divorce nightmare waiting to happen if you marry this dude.",
            "So I didn’t read your entire post BUT I’d say, if you feel uncomfortable with it and makes you second guess your relationship, stick with your gut feeling. Nobody is living through this relationship but you! No one is going to know exactly what it’s like to be you in this relationship so I would view every advice you get here with that mindset.",
            "There are few things I'd never be comfortable working through in a relationship. Elaborate lies about financial issues would be very high on that list though. I would never trust this man enough to marry him after this, and make his problems, which are so obscure, my own.",
            "Long time lurker and this is my first time to comment. I had a similar situation and my experience was that there was many more lies. My ex of 5 years had always told me he owned a house in a different suburb... same story.. never any post, no contact with the theoretic tenant, nothing ever needed fixed, got cagey any time I asked about it.\nWe broke up when I discovered he had been cheating on me with sex workers the whole relationship. After the break-up one of the many things that came out was that the house did not exist and was based on a sense of inadequacy. My view... if he’s lying so intrinsically, this is likely the tip of the iceberg.",
            "Broken trust aside, the issue with habitual liars is that they've normalised this behaviour. They will assume that you're lying just as freely, projecting their own bad behaviour onto you. This makes problem resolution in long-term relationships impossible, and you'll find yourself accused of random things which is infuriating at best. By way of example, my ex used this logic to avoid helping me, even after surgery, assuming I was exaggerating my pain. If you have kids, he'll lie to them and hurt them as a result. That'll break your heart. This is a road to pain. Long-term partners need to he honest and reliable to enhance your life. Without that, you're better off alone.",
            "This is more than a white lie. He just kept piling more lies on top of more lies on top of more lies. It is really concerning that he would lie about this stuff. I get maybe he was embarrassed about not being where he wanted to be in life or whatever, but these are some huge lies. It would start to make me wonder what else he could lie about.",
            "These are not white lies. \n\nIf you stay with him you will never, ever know what the truth is. If you join finances with him, he will expect you to clean up his financial messes the way his parents and partner did. \n\nHe is living life like a teenager. You're dating a teenager. \n\nHe lied because he knows the way he's living his life isn't admirable. So instead of changing, he doubles down on it and LIES about how he's living his life to make it look better. How long did he think that would last before you found out?",
            "I'm not that this in any way makes his lies right, or that you should stay with him, but I think its good to understand the reasons behind his lies. Maybe he made up this background to try to relate to you better... you said that having someone with a relatable past made it easier to talk about and find comfort. Perhaps the lies got out of hand, and he didn't know how to tell you the truth, but they started out with the best of intentions.\n\nEven so, lying to your significant other for 3 years about your past and financial situation is fishy, and I wouldn't be surprised if that was a sign that he has been dishonest in other areas of his life and your relationship.",
            "I say sit down and talk to him about why he lied so much and what was the point of it. It seems like he’s at least trying to make a start for himself with the businesses even tho they ended in absolute failure. It’s wrong that he lied to you about all that stuff but it seems the fact that he hid that all from you could be he didn’t want people to know he came from a wealthy background. I hear all the time of kids coming from wealthy backgrounds pretending their middle class or lower so they won’t be used by others. I could be stretching this by a lot but it’s worth a thought. If you still love him and see a future with him I’ll say real talk women to man and base your future off that talk. If he continues to lie to you then leave him and never look back but if he comes clean and has a heart to heart talk with you then it’s worth saving.",
            "How are any of there white lies? These are incredibly serious.",
            "White lies are usually used when telling the truth would cause more harm. What your BF did was a huge Red Flag. He lied to you about his upbringing, financial history and the main basis of your relationship. He is 32??? and still relying on  his Mummy and Daddy to pay his bills. He's not independent, lies and is not financially wise. The whole relationship is based on lies. Why would want to stay when all trust is gone?",
            "He sounds wildly insecure. Pathological lying to make himself look good and get what he wants. And he's still covering shit up so he's not truly remorseful. I would tell him,\n\n\"I will work with you to rebuild this relationship if you stop lying and we both have an honest financial talk with your parents\" \n\nThen see if he is remorseful or you catch him in any more lies.",
            "These aren’t white lies, they are emotional and financial infidelity. Money issues/disagreements are the #1 reason for divorce. This is just bad news all over.",
            "Here is what I think: You should have put the white lies in the TLDR. You could have said \"He claimed to own his condo when he actually rents it, and still has $17k in debt he claimed was paid off\".",
            "Run! These aren’t innocent white lies. This is major deception about fundamental core parts of who he is (presented as) and in which you built your relationship. People make mistakes in relationships all of the time but intentional deceit is pretty unforgivable.",
            "If you read this post in a week OP I think you’ll see the gargantua list of red flags. P.S it’s probably in your best interest to end that relationship and cut all contact.",
            "Ok but girl he LIED about DEBT. In what universe is that a white lie? Genuinely this is like a few steps above affair level lying and you need to get out of there if he is so willing to lie about so much in your relationship for YEARS.",
            "\"I’ll try to make this as short as possible\"\n\n&#x200B;\n\nthis is a fuckin novel",
            "Also I want to acknowledge that he took advantage of your trauma. You were vulnerable with him in opening up about your adversity, and he used that info to spin the web and catch you in it. That is extremely manipulative and so unfair to you and all that you've put into this relationship!",
            "Yeah I could not marry a man relying so heavily on their parents regardless of the situation he should of sorted it out instead he became a (f)lying (s)mooch.",
            "The truth is being revealed to you now, don’t gaslight yourself.",
            "A “white lie that spirals out of control“ is saying you don’t know what a potato is as a joke but carry it through out of embrassement when your girlfriend’s parents take it seriously. \n\nThis is not a white lie.",
            "These aren't white lies, these are screaming red flags. A white like is something like, \"Your new hairdo looks great on you,\" when no it doesn't or \"I didn't hear the phone in the other room, sorry,\" when they totally did but didn't want to put down their game to go answer it. What you have bluntly put, is a pathological liar. And a financially irresponsible one still dependent on his parents, who hid that from you and is likely going to expect you to foot the bill for everything when you all get married IF you are foolish enough to go ahead and do so. \n\nSeriously, does this guy even work? Does he pay bills on anything? \n\nAnd yes, if he lies to you about those things oh hell yeah, he is so going to lie to you about everything else. You've caught him in other lies too, not just the financial one. That's why I say pathological. Most people if they start out on a whopper like he did will break down sooner than later, confess all and not lie about anything else. What you detail is someone who was able to compartmentalize and keep the lies going to get you to build a level of affinity and trust over \"shared backgrounds\" that is to the point of being frightening.\n\nIt would be a dealbreaker for me. Trust is everything in a relationship and something like this? Yeah, I don't see any amount of therapy being able to fix this. You  really are going to have to decide if you'd be happier sticking your head in the sand and pretending he isn't lying whenever his lips are moving or to leave him and find a normal person, because what you detail isn't normal. At all.",
            "Even if they are white les,  they add up. It turns into a web and both of you get caught. Nothing good will come of it, do I suggest at the very least, getting your own place, living with your mom while he gets his fucking life together. By no means do you have to actually keep dating him if you don't feel secure anymore.",
            "Compulsive liar.  Next question.  💯",
            "A little white lie is like saying you aren't hungry when what they cooked looks appalling. \n\nFinancial lies in the terms of hundreds of dollars (let alone thousands) isn't little.",
            "Nope, you’re not crazy, these are some very serious falsehoods.  Honestly, it’s probably better that you split and try again, if he lies to you like that for 3 years, he’s not a good partner.",
            "Lived together for three years and now out of the blue all of this is an issue?",
            "Dude is still lying to you if he says his parents only pay his phone bill. Find a BF who doesn’t rely on his parents and his GF to fund his life.",
            "Was this some kind of weird test to make sure you weren’t after family money? Still messed up he let it go on this long at some point he should have come clean without you pushing it. If I were you I wouldn’t try to work through it bc people like that have a different personality and lifestyle than yours (no offense).",
            "Sounds more like red flags then white lies. You can't have a real relationship without trust. \nOn a side note, helping your mom is amazing and sweet. But don't do it so much that you are stressed or struggling.  Unless there is a medical reason she can't support herself. \nI wish you the best of luck with both relationships",
            "These aren't white lies. these are red flags. He's deceived you for 3 years. His entire history is fabricated. Run. Get out now. Consider ghosting him.",
            "A lot of people have explained why they weren't white lies. But I'm curious why did you think they were.\n\nDid he try to excuse himself saying they were white lies? Because if he did, that's even worst.",
            "This is a web of lies and you should be dumping him immediately",
            "Break up. This one is pretty obvious.",
            "These aren't white lies, damn. These are all serious breaches of trust, about his family, his backstory, his finances and his basic trustworthiness.\n\nHuge red flags. I would not even contemplate staying with someone that thought it was OK to lie about these things. \n\nHe will obviously say anything he thinks will make him look good or get him what he wants, regardless of the truth.",
            "Why would you mary a liar? For me, it is inconceivable. This is not a white lie. A white lie is when the guy says you look nice in a dress he doesn't really like, or the cake you overcooked still taste good. The lies he told you are not acceptable, in my opinion. I could never trust him again, if it was me. Money management is a really big part of a relationship and a family. I would definitively not start a family with a man like him, he isn't mature enough.",
            "Op you sound crazy, seriously. \n\nHe fabricated a completely different lie and presented him as someone he is not. He is literally a completely different person than who he presented himself to be. \n\nIn what possible way is this a \"white lie\"? Would you call it a white lie if he has a family on the side?",
            "If this is the only lie then I say give him another chance. Ask him to come completely clean to start fresh and ask him to be 100% honest. \n\nIf even then it turns into lies red flag. \n\nBut to be fair I can see how a man would tell a white lie that then gets out of hand and it seems his intentions for lying were good. To bond AND embarrassment.",
            "I think you need to have a think into his *intent* for the lying. I don't think he was trying to \"mess\" with you, \"hurt\" you or be a shit person.. It honestly sounds like you're a pretty stand-alone person when it comes to money, and are pretty proud.. It sounds like he's intimidated and has his own shortcomings about his own situation and can't own it, therefore lies about it to make it seem better. I think he's really just embarrassed and insecure and that's something he needs to sort out personally (outside of your relationship) before you two could move forward (if you would want to in a continuing honest way). As it sounds to me like you always had an inkling about this stuff, but maybe didn't push the trigger on asking him about it - as maybe your subconscious didn't want to make him feel embarrassed. Once you know he's working on his insecurities, you'll be able to move forward in a more honest way. Wish you the best.",
            "Reddit is always super fast to say leave him...do not listen. I was raised by a lier so I had always lied about things, I learned not too more and more as I got older but there were still a few dumb ones that I kept up. My GF found out one of the lies and confronted me, I came clean and told her the “why” behind the lie and even though she didn’t agree with lying she did understand and we moved past it, we are now happily married.\n\nIm not condoning lying, if he is a habitual lier then walk away but if its a few white lies then its something yall just need to work on",
            "I’ll put it simply for you though I’ll probably be downvoted for this. You fell for it. You are the one to blame for the situation you’re in. Where was your reason back then?? This is a lesson to teach you to follow your gut instinct. Your gut instinct told you that stuff was fishy with this guy. And what do you do? Ignore your gut feeling. You should have removed him from your life “yesterday”! White lies...hahaha. Honestly, are you that gullible?!"
        ]
    },
    {
        "post_id": "4j1690",
        "author": "ahdjashdkahds",
        "title": "UPDATE! Me [25 F] with my bf [26 M] of nearly three years - he wants to \"open our relationship for him\". Not sure if I'm in a position to say no.",
        "url": "https://www.reddit.com/r/relationships/comments/4j1690/update_me_25_f_with_my_bf_26_m_of_nearly_three/",
        "score": 2999,
        "num_comments": 332,
        "created_utc": 1463066391.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/4iamsf/me_25_f_with_my_bf_26_m_of_nearly_three_years_he/\n   \n**tl;dr**: I broke up with him. \n\nLong version: Thank you all for your comments. It helped me get from the sad and confused stage to the angry stage. The final straw was finding *his* post he made about half a year ago, talking about breaking up with me when I was in a very hurt and vulnerable state. \n\nI then spent two nights at my sister's place to clear my head and told her about everything and she was shocked and disgusted and we talked for hours and it was all really freeing. I then decided to break it off with Jack. Jack and I lived together but the apartment was rented in his name, and I just always gave him my half of the rent. So I hired a moving truck and got all my important stuff when he was at work yesterday and left a note that said: Congratulations. Our relationship is now ~~open~~ over. I felt bad for not having the courage to tell him face to face but honestly, I just didn't even want to face him even for one minute. \n\nHe kept calling me non-stop yesterday and leaving lots of messages, some of them saying how much he misses me and loves me, some of them saying how glad he is that it's over and how he has been cheating on me for the past year. No idea if that's true. I'm staying at my sister's for now and looking for a new apartment. I'm still sad and angry but thinking about Jack coming home to a half empty apartment (without a bed, that one was mine) makes me smile. Thanks again, internet strangers, you really opened my eyes! \n\n",
        "permalink": "/r/relationships/comments/4j1690/update_me_25_f_with_my_bf_26_m_of_nearly_three/",
        "comments": [
            "> saying how glad he is that it's over and how he has been cheating on me for the past year. No idea if that's true\n\nWhether it's true or he's looking for the worst possible way to hurt you, it just confirms you're well rid of him.  (Probably couldn't hurt to get an STD test to be on the safe side, though.)",
            "Good for you!\n\nOn a side note, I find it hilarious that he thinks women would be lining up to provide him with BJs. ",
            ">Congratulations. Our relationship is now open over.\n\nThis is a thing of beauty.  You are legendary.  Now go enjoy your Jack-less life!",
            "I'm so thrilled that you took the bed! I legitimately cackled at that point. ",
            "> some of them saying how glad he is that it's over and how he has been cheating on me for the past year\n\nIsn't it awesome when your ex immediately validates your decision to dump him? It's like he's helping you get over him quicker",
            "> (without a bed, that one was mine)  \n\nbravo. Onward and forward :)",
            "You did the right thing.",
            "Giiiirrrrrlll I just made an account just to say fuck yeah! Good job! Loved the note. Loved that you Steppes up. Go have some fun and be merry <3",
            "> Congratulations. Our relationship is now open over.\n\nYou're so awesome. That note was perfect.\n\n> some of them saying how much he misses me and loves me, some of them saying how glad he is that it's over and how he has been cheating on me for the past year.\n\nHe's just using any tactic (being nice and being mean) to get you engage with him in anyway. Don't fall for it. Keep ignoring him. And get a full STD panel just in case.",
            "Well-done on getting shut of him block his number and get a STD screen. You can do better than that turd sandwich and you will. Chin up and look forward to better things to come",
            "Good for you! I know it's hard but seriously, it sounds like you will be SO MUCH better off without him. ",
            ">I'm still sad and angry but thinking about Jack coming home to a half empty apartment (without a bed, that one was mine) makes me smile.\n\nAheheheh.",
            "It does not matter if his cheating the past year is true or not. The fact that he is going there is enough to know you made the right decision. ",
            "Good to hear you could move out so quickly!\n\nAnd awesome that you got to take the bed.",
            ">and how he has been cheating on me for the past year.\n\nPlease get tested just in case.",
            "> saying how glad he is that it's over and how he has been cheating on me for the past year.\n\nGood riddance then! \n\nThis reminds me of something my ex did. I discovered that he had been posting on Craigslist for casual m4m sex (I am a lady, had no clue he was interested in men at all). When I approached him with the evidence he didn't feel bad or apologize, he just told me he would sue me if I told anyone. 🙄",
            "Time to get tested. ",
            ">He kept calling me non-stop yesterday and leaving lots of messages, some of them saying how much he misses me and loves me, some of them saying how glad he is that it's over and how he has been cheating on me for the past year\n\nEven if this is 10000% bullshit, you can now rest assured that you made the absolute right decision. What a tool. That was the biggest gift he could ever give you. Think about that anytime self-doubt starts to creep back in.",
            ">I'm still sad and angry but thinking about Jack coming home to a half empty apartment **(without a bed, that one was mine)** makes me smile.  \n\nFlawless victory. ",
            "Good choice.\n\nI have a bit of experience with open and poly relationships.\n\nPeople have wants and needs. Relationships also have their own needs.\n\nViewing multiple relationships as a way to fulfill personal wants and needs is dangerous territory. I'm not saying every want and need has to be filled by every relationship, but if you can't be happy in one relationship without adding more to fill in the gaps, that relationship isn't going to work well.\n\nFurthermore, treating people as need fulfillment machines is shitty to other parties. Expecting to get oral from a partner without contributing to any of their desires is selfish and objectifying. Let's be real, very few people want to be a blowjob hookup side piece with nothing in return.\n\nThis guy didn't give a shit about your feelings, and didn't care enough to think about potential other party feelings either.\n\nHe's not a catch. He may be able to manipulate his way into getting what he wants, but until he fixes his issues, he's not going to have healthy, mutually fulfilling relationships.",
            ">I'm still sad and angry but thinking about Jack coming home to a half empty apartment (without a bed, that one was mine) makes me smile. \n\nWell done, OP! Best revenge ever. Hey Jack, I sure hope that couch is ~~filled with broken springs~~ comfy, ya putz. ",
            "Great Job!!! leaving him was the best thing you can do!! And block him. Lose his number? Don't check up on him! Go! Move on!\n\nHe will try to contact you, he will say all kinds of things! Don't listen to them. He's trying to hurt you because you are moving on.\n\nHell...My ex hit me so I kicked him out of my house..He then told everyone in his life I \"Made him homeless\"",
            "You go Glen Coco! Kicked his ass to the curb :D But in all seriousness, good for you, this is a good day. You made a positive change in your life and you'll be happy you made this decision. You deserve more than mostly great! Sending all the happy thoughts your way :)",
            "While I'm glad this subreddit has empowered you to end a relationship with a toxic partner, I can't help but feel you could at least link to the post you say he made 6 months ago for further elaboration and context.  ",
            "Incredibly happy to hear that you are moving forward! Make sure you avoid contact so he can't try to sweet talk you back (not that it would work anyway). \n\nI only wish you'd taken a picture of the note and/or the bed being removed.",
            "Awesome update. You did the right thing in the right way, and you are much, much better off without him.",
            "Please call him back and say you're willing to get back together as long as you can open your relationship to men who are more well-endowed, or can last longer, or can do pretty much anything better, because he is unable to satisfy you. \n\nNot seriously.",
            "Damn, I love a good update in the morning!",
            "If I had two working hands I'd clap.",
            ">I felt bad for not having the courage to tell him face to face\n\nDon't. Feel. Bad.\n\n**He** didn't have the courage to do what you did do. You don't make unilateral decisions in a relationship. He ended it when he made one. ",
            "Hi, breakup buddy! I just ended a 3 year relationship too. The feels...",
            "Just read the original post and as soon as I got to him saying you deserve it for snooping, I knew he was a trash bag. ",
            "Congratulations on getting rid of the dead weight. No more losers for you!",
            "What a f&*n as*&hole. Now you see his true colors.  It's terrible, but just remember: that's HIS shit.  Not yours.  He created this mess, you tolerated it and now you're free.  You're free! I know it will be difficult but I'm very glad you stood up for yourself.  This will seriously be a tough but important time for you in your life.  It's a perfect opportunity for you to really tackle your past traumas to understand and break this pattern.  You're so young, you have your whole life to lead and it can be fantastic. But I urge you to do the work on yourself now.  Don't let this sit.  Good luck to you. ",
            "Goooooood! You go girl. ",
            "Good for you! I think that note was perfect. I also hope that Jack's obsessiveness about oral, pressuring you into giving him oral when you did not want to, and constant comparing you to his ex hasn't diminished your interest in it forever!",
            "Congratulations on this exciting life change! You are very gutsy and brave and I, an internet stranger, am so happy for you. I wish you the best going forward and remember to be kind to yourself and allow yourself time to grieve the good times. You're going to be great. :)",
            "Happy for you OP. Glad you got out of the way of this asshat. You seem to be doing pretty well also which is great. While I'm sure it'll be hard to forget about and move on, just know it's for the best. \n\nGood luck with everything. ",
            "I am so sorry that things have had to end like that for you. However, it is good that you've done all of this NOW instead of letting it fester, especially when you deserve to be treated waaaayyy better.\n\nThank you for the update, was reading his old post and it sounded too creepily similar to not be the same guy.",
            "He is an insensitive turd.  Please get yourself checked for stds and throw him back so he can grow up.",
            "So did he confirm it was him who posted?!",
            "Best break up ever. You're a star!",
            "Even if his texts of cheating aren't true, it's definitely a shitty thing to say to someone to whom he's also texting that he misses. ",
            "Doing the right thing via any mode is what matters. Good for you.  ",
            ">he has been cheating on me for the past year\n\nEr, go get tested for STD's and HIV.",
            "[Think I found Jack's post](https://www.reddit.com/r/relationships/comments/3pylx5/me_25m_getting_pretty_frustrated_with_my_gf_25f/)",
            "This makes me so happy for you! Although it's still kinda shitty that you ended up in a situation like that. I think you made the best decision.",
            "What a fucking douchebag. If you weren't satisfying him sexually he should have had the balls to break up with you like a decent human. Best of luck getting over this pratt. ",
            "I just read this and the original thread for the first time... and yet again, I am shocked by how clueless some of my fellow men are capable of being. He held it against you for being hurt by sex videos that he shouldn't still have, and his solution to you being hurt was for him to have sex with other women?!?!?! He is a selfish asshole, and you are better off without him. Hopefully you breaking up with him teaches him a lesson, but sadly, it probably won't. ",
            "Best wishes to you on moving on, but it appears you're well on your way towards that.",
            " PRoud of you honey :) You deserve MUCH better than him!!! <3 ",
            "Seems like Jack has issues. Good for you on leaving him! ",
            "Amazing! So glad you were able to do it and I hope you are feeling better now!",
            "Good job. He's such a loser. Don't go back to him ever!",
            "Even if he was joking, make sure to get checked for STDs. Better to be safe than sorry in the case that he was cheating after all.",
            "Badass note, dude.  Congratulations on your freedom.",
            "Glad to hear you left the idiot! Better things for you in the future!",
            "Good call, also don't feel bad about not breaking up to his face, I think most people break-up over text or phone now anyway.",
            "I would get yourself tested for everyone under the sun.",
            "Glad it worked out for the best! ",
            "OP, remember to get tested! Get a full panel; urine screen for gonorrhea and chlamydia, blood for syphillis, HIV, and herpes (specifically request herpes). \n\nDo a follow up in a few months for all, in case you get a false negative during the incubation periods; three months should be sufficient. Even if his cheating jibe was just a jibe, you can't be too safe with your help! ",
            "Good for you! That was a highly toxic relationship, from your post (and his)! I saw your comment in the other thread about worrying that you couldn't do better. Please put thoughts of relationships with guys out of your head for now and focus on building a better relationship with you. Work on your own self esteem so you will never be in that position again. \n\nI speak as someone who stayed in unhealthy relationships for way too long, finally going into an acute depression when I got dumped by someone I should not have been with anyway, who criticised me frequently (as well as being lovely at other times), was very angry and controlling. (I later came to see I'd been emotionally controlling too in manipulative/passive-aggressive ways - no blame here! We were both immature and unhealthy.) \n\nI finally realised how damaged my self esteem was, tho' I thought of myself as confident, and did a *lot* of work on that. I changed my life completely, am in a healthy, 4-year relationship based on mutual respect, honesty and trust and I can't really believe some of the unhealthy behaviours I used to display/be on the receiving end of in my younger relationships. Needing to be loved by someone else and the fear of not being loved by someone else is a projection of a lack of love for yourself. Putting up with being disrespected (or worse, abused) and trying to please others/prove your worth to them is a projection of a lack of respect and liking for yourself. We're all flawed, and we're all loveable anyway! :) Also, what I'm describing is so very common, unfortunately. I'm a life coach now (and a trainer in confidence/assertiveness) and most people have some level of self esteem issues that they're either working on or have yet to discover. Childhood f***s you up in myriad subtle ways, even if you're one of the luckier ones. :) But as soon as we become aware of unhealthy beliefs and mindsets we can start changing them - there's hope for us all!\n\nBe proud of yourself for standing up for yourself, going to someone who respects you for support (lots of that, please!) and standing on your own two feet. Keep that going and keep working on loving and respecting yourself more and your next relationship will be infinitely better - and you'll appreciate it all the more for what you learned from this one. All the very best to you!",
            "Wow, I am really sad and heartbroken after reading your story. You didn't deserve any of that. You will be okay even if you don't feel so great right now, but just know that you are strong and you should never settle for a man that hurts you like that again. You deserve the WORLD. I respect you for being so strong. ",
            "Just wishing you the best and congratulations for standing up for yourself.",
            "Now might be the time to make a list of everything he did and said that lead you to believe that the best you could hope for was this guy. Then you can read it when you feel the need to go back to him. Yo can also use it as a checklist of warning signs for the next guy. \"Compares me to the ex--check. Says derogatory things about my sexual ability--check.\"\n\nTime to learn some boundaries. I'm not going to participate in the celebratory circle jerk (said with humor) because kicking him out was the easy part. You now have to realize that you deserved better than him in the first place.\n\nGood luck.",
            "Good for you! He sounds really immature in that linked post. Go no contact with him and give yourself space and time to find someone who is a thousand times more worth it. ",
            "Nice one OP. Bullet dodged.\n\nGod, the bile that comes out of these douchey people when their SOs break up with them! It's actually a gift: it's total confirmation that breaking up was the right thing to do.\n",
            "It's a painful choice for sure but one that I think you'll look back on and say was completely worth it.",
            "AWESOME farewell note. Applause.",
            " Please know that this is such a strong step. Emotionally \"put together\" people do not conduct ths way, so i hope this jack-*ass* didnt ruin relationships for you.\n\ni was in a relationship like that, except the ex was a long distance internet thing?????(THEY NEVER MET!!!?) now, years later- i laugh at how pathetic this person was/is",
            "I am glad that you had the strength to break up with him! ",
            "DUMP HIS ASS!!\n\nI've been in the same position with a girlfriend multiple times. Don't waste your time on a asshole like that.",
            "Kudos to you for having the courage to move forward. It's always difficult in the beginning but EVERYTHING improves with time. Now focus on refreshing your aura and cleansing his energy/influence from you. Get back to happy, re-visit the people, places and things that you may have put on hold because of this toxic relationship. It's a new day, be glad in it!",
            "lol, the bed. nice move. hope his conscience hurt him as much as his back after a night on the floor :)",
            "The only winner in this is him.",
            "Kind of rude to break up with someone of 3 years via note, even if they are assholes.",
            "Two idiots are better off alone then together",
            "I'm sometimes Jack. You did the right thing. People like us are bad for you. Feel no guilt. We will send you polar messages."
        ]
    },
    {
        "post_id": "eus9hn",
        "author": "mks93",
        "title": "UPDATE My (26F) ex boyfriend (27M) and roommate (25F) are still hanging out and it's bothering me.",
        "url": "https://www.reddit.com/r/relationships/comments/eus9hn/update_my_26f_ex_boyfriend_27m_and_roommate_25f/",
        "score": 2993,
        "num_comments": 327,
        "created_utc": 1580150638.0,
        "selftext": "Here is a [LINK TO ORIGINAL POST](https://www.reddit.com/r/relationships/comments/epmnay/my_26f_ex_boyfriend_27m_and_roommate_25f_are/) In summary, my ex and my roommate decided that they will continue to hang out together. \n\nSo, the past week has been really hard for me. I am thankful that my boss is giving me 2 days off to recover and get back on my feet. Forty-eight hours after the breakup, I talked to my roommate and she said that while she understands how I feel, she will continue hanging out with him. I also talked to my ex and told him how uncomfortable I feel about the whole thing. He also said he understands, but thinks it's controlling of me to ask them not to hang out. Last week, they hung out for 5 days, for hours on end. They did respect my requests not to come inside the house when together, which I appreciate. \n\nMany posters suggested that they were having an affair. My ex claims that he did not break up with me to get with her. I did believe him at first, and maybe it was somewhat true, but I now think that something is going on and was going on. I found out that my roommate had a crush on my ex, while were were dating, yet still continued to hang out with him alone (while we were dating). I asked my ex while we were still dating if we could hang out just the two of us a little bit more, and I was accused then of being jealous and controlling. Turns out I was onto something. I suspect they are now trying to hide their relationship from me, though I cannot be sure.\n\nTwo days ago, I told my roommate that I no longer think it is healthy for me to live with her. She was fine with this and is asking around for places to stay. I will also consider leaving if she cannot leave. The most crushing thing about all this is that the two of them were people I considered best friends. This is also happening LESS THAN 2 weeks after the break up. It feels weird and rude to me. Of course they are within their rights to do whatever, but I feel like I was betrayed, even before the relationship ended. Maybe in time I'll be happy for them. \n\nTLDR; Ex and roommate hanging out still, I suspect something is going on and now they're hiding it from me.\n\n\nEdit: you all are so kind! Thanks for the words of encouragement, tough love, and shared experiences. I am staying with a friend tonight and am hoping that the move-out situation goes smoothly. Living apart from my current roommate is the only viable option for me, moving forward. I will also be cutting contact from both of them as soon as the living situation is settled. \n\nI am going to therapy tomorrow, and went last week, so I’m hoping that helps. I am so thankful I have off from work. It’s been nice to just be able to rest.\n\nEdit 2: roommate confirmed in a convo today that they are “more than friends.”",
        "permalink": "/r/relationships/comments/eus9hn/update_my_26f_ex_boyfriend_27m_and_roommate_25f/",
        "comments": [
            "Damn, that's pretty fucked. Can pretty much guarantee one of them will fuck-up again once the honeymoon phase ends and they meet someone mildly interesting.",
            "[removed]",
            "Sorry for your break up and how they are both treating you.  As soon as you can, go no contact with them.   This will help you to heal and move on with your life.",
            "I usually am not a fan of the people around this sub who's initial reaction to any relationship issue is to come and scream \"Divorce! Cheating! Dump him/her and do you!!\" Unfortunately, it's sounding like those people were right, after reading your last post I was with you that it seemed like things were innocent and nothing nefarious was going on. It sounds like while there may not have been physical intimacy between them, there was an emotional connection between them because you were right in your first post also, dumping someone generally means that you're also dumping their friends too. Them hanging out for hours on end day after day is not the \"friend of ex and ex behavior\", it is budding relationship behavior. In the end, hopefully, the roommate split goes quickly and cleanly and you can rid yourselves of these negative contributors. Good luck OP",
            "Everyone likes to think of their self as the hero of their story. Currently your roommate and EX are playing out their fantasy of being lovers against all odds. You’re now the villain in their “epic love story” merely by advocating for your own needs.\n\nMoving out and leaving them behind is your best move. Do that.",
            "I've been there. My ex and best friend of 11 years decided they wanted to be together 2 weeks after we broke up. I tried to remain her friend, but alas, they are now married and we no longer speak. Maybe a sporadic text here or there, but I wouldn't consider us friends any more. Hang in there. It does get better.",
            "Block them on everything and try to move on with your life. If he did cheat on you, then he is untrustworthy and know it will probably always be in the back of her mind. As for the roommate, she obviously showed her true colors even if they didn't cheat- by being a terrible friend! They aren't worth your time. You deserve better.",
            "They both sound like world-class gaslighters. Save yourself the mental anguish,  remove yourself from this situation, and leave them to each other. What comes around will definitely go around.",
            "Sorry, this must be pretty hard to deal with.\n\n\nI really hope your roommate does the right thing and moves out, she has disrupted your life enough and she should be the one leaving and fast. \n\n\nIf they are in fact seeing each other, they could have at least kept it on the down low for a while longer. It sounds like they were completely inconsiderate and selfish.",
            "I'm sorry, OP. I was in a similar situation once, except we dated for almost 5 years and lived together. He was an aquaintance that slowly worked his way in under the guise of befriending me. Their attraction was obvious but she denied it to the very end. \n\nTwo weeks after she'd broken up with me AND I MOVED IN WITH HIM, I found out through a mutual friend they were already secretly dating. It destroyed me for years.\n\nMy advise, like everyone else's, is to cut them out. But I would also add letting them go emotionally as well. 'Forgive' might be too strong of a word, but see if you can completely detach them from strong emotions, as if you were thinking of a random old aquaintance from school. Time heals all wounds.",
            "It feels weird and rude to you because it IS weird and rude!! I would say one of you needs to move ASAP so that you can move on. I’d also suggesting going no contact with the both of them, they obviously did not value your friendship the way you did theirs.",
            "I remember your first post, especially when you said that the 2 of them were more athletic than you and that they hung out together solo without him telling you. \n\n\nHonestly, it sounds like they were cheating together and are now dating. That fucking sucks but the upside is that it's easier to get over someone who pulled such an asshole piece of shit move than it is to get over someone who is basically decent but you're just not compatible. \n\n\nIt's going to hurt, but keep reminding yourself that they're simply not worth grieving for. They both betrayed you, and in so doing betrayed who they really are. You've rid yourself of 2 people who were ultimately untrustworthy, and would have been toxic to keep in your life.\n\n\nSorry you're going through this. it's going to suck for a while but keep reminding yourself - you're only losing them because they suck, not because you suck. You're only losing them because they are traitors, not because you are a traitor. You're only losing them because they proved they don't deserve you, not because you proved you don't deserve them. \n\n\nOther than that, standard break up advice applies (ie more time with friends/family, work out, focus on hobbies/career/projects etc). Best of luck",
            "i mightve missed this op, but why did he break up with you out of nowhere? what did he say his reasoning was? Frankly, i like to think people can be that cruel, but i do think they may be hiding a potential relationship from you. if they are hanging out for 5 days straight for hours and hours, it's safe to assume that they have something going on as i imagine they probably have other friends and family they couldve spent time with but instead chose each other. i think you are doing the right thing by asking her to move out. break ups are tough, but at the end of the day, we grow from them",
            "The way you feel is normal. You did the right thing speaking with your roommate.\n\nHopefully she will soon find somewhere else and you can take time to heal and decide wether you want to keep the friendship or not.\n\nIf you do want to keep friends with your roommate perhaps you cold offer to help her look for a flat? It can be hard.\n\nI would suggest for you to start looking for places for yourself just in case your friend does not follow through.",
            "It's like she is trying to escape because living with you means she would have to face her wrongs. Otherwise, why would she have a reason to actually leave the apartment ??\n\nSorry you were done so dirty.",
            "\"I was accused then of being jealous and controlling\"  \n\n\nThe boyfriend doth protest too much, methinks. You were asking for more one-on-one time with him and that was his reaction? Oy. It sounds like they both have some serious soul-searching to do regarding how they treat others. I'm sorry you were the recipient of some pretty terrible behavior from folks who were supposed to be your friends.  \n\n\nAnd yes, I just made that \"doth protest too much\" line up all on my own.  \n\n\nSigned,  \n\n\nevil\\_mike Shakespeare",
            "They're fucking. Sorry girl. He out of the blue dumped you and has been hanging with your roommate? Fishy af. Move out if you can.",
            "My ex moved in with a close friend and even though I had moved away and he had no interest, shit stung. He even kept in touch telling me how lucky I was to have left her and how he was desperate for a roommate but it's still kinda crap. Out of sight out of mind is the best way to do it.",
            "They are the ones who will lose out here. What kind of BF does that to his S/O? A piss-poor one. And chances are, this is a pattern of his, so it's not if he does the same to her, just when. And what kind of friend does that at all? A fake ass one. I don't know, but for me, regardless of how close I am to a friend, their exes are almost extensively off-limits, and if something does start to happen I'll get their explicit go-ahead before anything happens well after they've broken up and quite some time has passed.  \n\n\nI know it hurts now, but count this as a blessing, you dodged two major bullets. This is where you get to lift up your head, be the bigger person and say \"Screw 'em\", cause you deserve better. You deserve to be happy. And most of all you deserve honesty. Don't ever let these two back in your circle, you deserve so much more than what they offered. I know this doesn't make it easier, but it was their faults that caused this, not your own, so please do not blame yourself. They are the ones 100% to blame here, and the hell with them, if they want to be that kind of person, then they can go be that type of person alone without dragging you down. Find someone deserving of your love, both friend and lover alike.   \n\n\nMoving may be the best option, and if you are able to be the one to do so, it might do best so the scenery changes and old memories don't just keep popping up. Get a fresh start, go be you, the best you that you can, and enjoy your life. Misery loves company, and those two miserable wrecks deserve each other and the pain they'll bring to one another. You deserve honesty and integrity.",
            "No advice but have been in a similar  situation and wanted to say you will feel shitty and betrayed for a while and then it will fade (as you no doubt know). In my situation I wondered a little if the relationship flourished because it was taboo and gave them a thrill. It certainly didn’t last long afterward. Not that you should spend time figuring it out! A clean break will be much better for you, even if you want to know. \n\nJust wanted you to know someone else out there can kind of understand what you’re feeling.",
            "To be blunt, the people you are hanging out with will vanish by the time you are 36.  They seem valuable to you right now, but they aren't.",
            "I feel your pain! This exact situation happened to me a few years ago and you are totally justified in the way you feel! The best thing you can do is leave and cut contact with them as everyone has said, good friends don’t do this type of thing so your doing yourself a favour by cutting these toxic people out of your life.  I know it hurts now that you lose your boyfriend and your friend but you don’t want to drag this out for yourself. The best thing to come out of the situation for me was that now I always trust my instincts with people, and don’t allow myself to be gaslit, if I think someone is flirting with my boyfriend or the other way around I’m gonna trust my gut, and we shouldn’t accept this behaviour from anybody.",
            "I'm so glad you and the roommate will cease living together.  This is one of those situations where you are absolutely justified in feeling betrayed and hurt and angry, even if they are not technically in the wrong, but you 100% need some distance.\n\n&#x200B;\n\nMy further advice: Don't try to be friends with either of them.  That doesn't mean nurse a grudge, or try to stop mutual friends from liking them.  It doesn't even mean avoiding seeing them if they are going to be somewhere you want to go.  But it does mean that in my experience, it is trying to put the cart before the horse to assume that you will be friends with your ex or your ex's new girlfriend someday.  Maybe you will.  Maybe I will strike up a friendship with a celebrity someday.  But I ought not to count on it, or go out of my way to try to make it happen, and neither should you.  You had defined, formal relationships with both of these people: boyfriend, roommate.  It is likely that, absent those defined relationships, plus the baggage of this break-up, you'll never have a close friendship with either of these people.  That is one of the things you mourn during a break-up. It hurts, but it generally hurts more to try for a friendship that isn't actually there.\n\nBest of luck.  Time really is the only thing for it, as much as that sucks.",
            "It was very clear from the first post you made that your ex broke up with you to date your roommate - you can pretty much disregard anything they say to you about the matter.\n\nThis is unfortunately something that is relatively common and will be very painful for you to sit through. \n\nThe fact that your roommate was willing to bounce so quickly says it all. They will be official before you know it. To minimize pain, you should part ways and block all contact with these two as quickly as possible - if you don't do this, it's gonna hurt even more. Sorry this happened to you.",
            "Not to be the kind of person that relishes in someone else's misfortune, but maybe it makes you feel better to know that your roommate is going to get dropped abruptly for the newer model too.  I don't understand people that get into relationships in this manner and expect different results.  Especially if this cheater (emotional at the least) and gaslighter (you call him out and he called you controlling) took no time at all to work on himself.",
            "Nah they are terrible people. If they were your friends they wouldnt  date each other without your consent and they certainly wouldn't do this in just two weeks. Anyone who thinks that's insane, let me ask you, what do you think the bro code is? It's respect for you homie and if you are unsure then you must ask. You also must respect the decision they give. No one considered how awkward it would be for OP either. Find better friends. Don't feel bad though. We all had to do it at some point.",
            "I just read both your posts and feel so gross. What nasty shameless manipulative selfish people they both are. You were clearly the only decent person in that relationship and unfortunately two scummy people you thought were also decent found each other. Honestly, they belong together from the sounds of it and you have dodged not one but two bullets. \n\nSeriously though, take care of yourself and don't let these people walk all over you anymore. Work your way through these feelings (which you're already doing by posting here), practice some good ol' self care and in time these feelings of hurt and betrayal will slowly fade until you can laugh about it one day.",
            "Similar situation. I'm (28M) and my \"best friend\" (27F) for over ten years decided it was totally okay to hang out with my ex (24F) because it's \"hard for her to find female friends\". This is after my ex was talking to other men and hanging out with them behind my back, lied about having an STD, and was pretty much emotionally abusing me (one actual friend even said she was gaslighting me) the entire time. It hurt so much to not only lose a partner, but my best friend. But I distanced myself heavily from my so called best friend and have been focusing on me. Life is so much better without all the drama. It's been over a year and I do not GAF anymore. Hurt a lot, therapy helped me move on from that chapter. It's gonna keep bothering you until you realize you cannot control this. I know it's hard but you need yourself right now. Try to reconnect with old friends and if you have family try hanging out with them. Good luck",
            "My best friend of 11 years married my abusive ex. So yeah. It's a shit situation. Ruined our friendship and though 6ish years later we've somewhat rekindled our friendship, I will never be at a point where I feel totally comfortable with the situation. She did not and still does not understand that what they did was shitty. Granted, he and I had been broken up for a while at that point but I introduced them. Furthermore, she knew all the nitty gritty about our super toxic relationship and still pursued him, which just felt like betrayal. From what I can tell they are happy and I am happy in my own relationship with my SO but it took me a while to stop being pissed.",
            "Yo fuck your ex and especially fuck your roommate. couple of slum lords",
            "See? This is why i have so much trust issues :/ i’m sorry you are going through this! I hope you can have better people around you and can get rid of these toxic beings from your life!!!!!",
            "Wow they’re assholes. What a selfish, cruel way to treat someone they consider a friend. \n\nSure they’re both single and can do what they want, but there are consequences to every choice. And the choices they’ve been making are directly causing you emotional distress. They know this and are making those choices anyway. \n\nMy heart goes out to you. Hoping better things come your way soon and that the karma monster gets them.",
            "This exact same thing happened to me and guess what? They were sleeping together for MONTHS prior to him breaking up with me and continued sleeping together after we broke up. She is not your friend...and he is trash. Get out of there and never speak to either of them again.",
            "[deleted]",
            ">My ex claims that he did not break up with me to get with her.\n\nYour ex is a lying scumbag. What he's done to you is terrible and it's a shame you're having to go through this. Your roommate is an awful friend too. On the bright side, these toxic people will soon be out of your life so at least you can look forward to that.",
            "Way to make a clean break! You are strong, your intuition is on point, you are thoughtful and a good friend. Best of all... you just offloaded a lot of bullshit.  It might not feel great right now but this internet stranger is proud of you!  Take a moment to celebrate the victory of not being in a shitty relationship in your 20s (said by someone who was in one for most of hers). ❤️",
            "I'm sorry you're going through this. I hope you're able to get past the whole situation quickly. Good luck. 💐",
            "Another suggestion is if you have any other friends you could invite over when the ex is at the apartment - just having a social buffer might help.",
            "Can I ask what the deal with the apartment is? Like lease? Who’s name is on it? Etc.\n\nI really think she should have to leave and I think you should start looking for a new roommate. Maybe give her a date that she needs to be out by because someone else is moving in. Obviously that also depends on legalities of lease agreements which is why I asked. \n\nThey did a super shitty thing. You didn’t deserve this. Hold your head high and don’t give them the satisfaction of seeing you upset or emotional. Make her feel ashamed to be in the apartment because you didn’t do anything wrong. Hopefully she leaves without incident and her guilt pushes her out sooner rather than later. I’m sorry you had to go through this.",
            "Seems you’re doing all the right things for yourself in creating distance between you and them. That’s the healthiest thing you can do.\n\nAlso, as someone who went through a similar situation last year, the ex jumping to one of my graduate program friends, a thing to keep in mind going forward is that neither of you owe the other anything. Meaning, they’re entitled to do what they like with whoever they like.\n\nIt’s a hard way of looking at things, but once I saw things from that perspective, which IS NOT EASY, it made moving on a lot more manageable. \n\nWhat you outta consider doing now is to create an environment for yourself that stimulates your soul and occupies your time. You’re still grieving, being mindful is incredibly important at this stage, but also get out so that you’re not dwelling. \n\nIt’ll be slow, it’ll be tough, but with the right amount of distance, you’ll come out of this better for the experience in a few months or more. \n\nBless.",
            "I know your pain , I watched my ex of 4 years hook up with my friend a month later and all my friends that I introduced her to hang out with her and talk to her over me so I know the pain. The positive way I try to look at it is that it showed their true colors and we don’t need that. Better now then later but still hard for sure but we’ll get through this.",
            "This is more of a sign that a new beginning is all you need he was this person before you met and it just came out. I’m going through a new beginning phase right now. My whole life is going to change and I’m gonna be losing people and gaining people through the process. The pain is temporal and as humans we have to choose positivity and just adapt life isn’t over even though it hurts rn be strong. Easier said than done! Best of luck! oh yeah... move out! Just leave there’s always a way!!!",
            "OP this totally sucks and probably hurts so incredibly much right now. \n\nI was in a similar position where a guy I was seeing ended up dating my best friend quite quickly after we ended. I was devastated and felt betrayed by both of them, her especially. I was convinced they wouldn't last and that made me feel better for a time. We tried to maintain a friendship (I had moved cities which made it easier to cope with) but eventually we slowly stopped trying. We still have friends in common and follow each other on social media. \n\nThree and half years later, they are engaged and I genuinely am happy for them. I've healed in the past three years and no longer feel any anger or animosity towards either of them. My dad and a close friend died during this time and for me, it made me realise you need to find happiness where you can and I no longer begrudge them that. Obviously I don't think you should shit on others to get where you want though but I understand why they did it now. \n\nI just wanted to share my experience with you so you know that there is light at the end of the tunnel. You won't feel this crappy forever and things will get better for you.",
            "Imagine unknowingly setting up your boyfriend with his future girlfriend and being stuck living with the new girl to witness it all lmfao\n\nSeriously, I never see these types of scenarios working out well... And I say this after having witnessed it in my former circle group.\nWhere are they now?\nThe relationship recently ended for good after it going solid for three years. Only for it to go to shit when one of my closest friends started crushing on a friend of ours boyfriend.\nThe other girl moved far, far away but I know they're still in contact and it made their relationship hell.\n\nNote to self: Keep your relationship dynamic between you and your S.O, don't turn it into a trio friendship that will eventually snowball into something more. It will diminish the intimacy you have with that person.\nI feel sorry for you, but honestly this whole thing wouldn't have happened if you hadn't connected them. Your ex is lying, she has more to do with the break up than he's willing to admit.",
            "I just can’t believe they both had the audacity to do what they did. Zero respect for the history both of them have with you. I’m sorry you had to endure this. Gaslighting is psychological abuse (both of them are guilty), and your ex forming close emotional bonds behind your back is cheating by most people’s definitions of cheating. Cut ties with both of them and never allow them to return under any circumstances even if they begin to cry and grovel.",
            "They're within their rights to \"do whatever\", but you're within your rights to tell them off for being self-serving, insensitive assholes.",
            "Holy shit, I don't know if I've related to a post so much before. While it happened at a younger age, my ex and my best friend not only continued their friendship after, a lot of my mutual friends refused to kick her from the circle(all my friends from college).   \n\n\nSome advice I can give you is, it's not you, even if more friends continue to associate with them, just know it's not your fault. Also I think you're doing a great job by going to therapy right away, please do not turn to drinking or reckless behavior as an outlet, it feels so good in the short term but stunts your growth. If you're feeling anger/resentment try to use that to better yourself in this situation, I think it has the potential to power so much positivity.   \n\n\nLastly, you'll not only get through this, you'll come out better on the other side. Someone will love you and respect you.",
            "That’s no friend. She broke major girl code.",
            "I've been the ex in this situation (I actually married my ex's longtime roommate) and even I feel like that was too much. \n\nWhen my ex and I ended things, I steered clear of the house as much as I could. I avoided hanging out with my now husband until the dust started to settle. After that whenever we hung out as friends, we went out and did stuff.  I don't think I came back into our once shared house until my husband and I's first date 3 or so years after the break up.\n\nThankfully, the three of us are all still on great terms. But had either of us ever pulled the sort of crap they did, I don't think we would all be so friendly.",
            "Ohmygosh this exact same thing happened to me a few years ago! I’m sorry they’re putting you in that position, it’s unfair and disrespectful of them. It sucks now, but it will be so much better after you distance yourself from them. You’re handling it well btw!",
            ">I found out that my roommate had a crush on my ex, while were were dating, yet still continued to hang out with him alone (while we were dating). I asked my ex while we were still dating if we could hang out just the two of us a little bit more, and I was accused then of being jealous and controlling. \n\nUgh. I am so sorry.\n\n>Of course they are within their rights to do whatever, but I feel like I was betrayed, even before the relationship ended. \n\nYou were betrayed. I'm happy that you're pursuing therapy because to have this happen from the people you trusted most is absolutely a horrific thing to endure. Going no contact with both of them is also absolutely necessary for you to begin healing from this. I hate that this is what happened to you. Best of luck. I hope you update us again in the future about what your life is like after moving on and healing from this.",
            "I am sorry, this sucks. Some words of advice straight from my mom's mouth - You are your own best friend and you should never place 100% trust into any human being. These are two people you have known less than a year and it certainly not be assumed that you can fully trust them to put your needs and wants in front of their own. 7-12 months is enough time to feel comfortable, but not enough time to truly know a person. Now you know who they are a lot better. \n\n&#x200B;\n\nWhile I am by no means saying you should never hang out with friends and your mate in a group setting, you are treading on dangerous territory by bringing two people you don't know 100% into a close, tight-knit relationship. I have never hung out with my husband's friends without him there, and I don't have their phone numbers in my phone, vice versa. They are nice guys and I enjoy chatting them up socially, but they are his friends and it is just better keeping an arms-length between us. The same goes with my friends.  Just take this as a lesson learned about how shitty people are shitty. Not your fault, but certainly something that should register.",
            "They suck balls. Don't take either of them back if they come crawling and talking about how sorry they are.",
            "Actually commented on your original post too when you posted it... for the love of all that is anything please do not let this change the way you perceive yourself, or human kind. You have my complete respect for how you have handled this situation, I myself remember the sting of my ex cheating on me with a “friend”, it was awful. Even if there wasn’t any cheating I know it probably still feels like there was. This situation still just feels sleazy. I’m so sorry. You’re absolutely justified In your feelings and I wish you the love and friendships that you DESERVE. You’re a wonderful person for how you’ve handled this OP. 💞",
            "I'm sorry, OP.  Being betrayed like that is crushing, there is no two ways about it.  You sound like a good and kind person and you deserved better from both of them.  I wish you a quick exit from having to see either of them and most emphatically wish you higher quality friends and lovers in the future.",
            "Similar thing happened to my daughter, except they weren't living together,  and her boyfriend played the \" I think I'm gay\" card so he could break up with her and not let her focus on this \"friend\" he had been hanging out with.",
            "You are totally within your rights to feel this way. You are also better off without these two, because clearly neither of them care about how painful and uncomfortable this is for you. They do not have to date each other. They could easily find other people to date (and from what you’ve said, I’m convinced they are dating).\n\nForget them and move on. I hope she moves her ass out soon. You shouldn’t have to go through all that right now.",
            "Seems pretty sketchy on their end but even if everything they have been telling you is true and there wasn't anything going on the fact of the matter is they don't respect you otherwise they wouldn't be doing this. You need to remove them from your life.",
            "I know I'm late to the party but this is so similar to what I went through. Spoiler Alert: it didn't turn out well. I hope you can find peace in letting this \"friend\" go. I'm sorry that you're being betrayed by the people you loved the most. It's definitely one of the most painful things to go through. \n\nAll I have to offer is that life is much less painful/drama free once you lower your tolerance level for bullshit. This behavior is unacceptable but rest assured, there are good and genuine people out there. You will love again. You will make true friends and life will be beautiful again.",
            "I have had a similar situation before where, in fact, my old roomie was the one initiating multiple hang outs with my ex, who she had only met through me and hadn't previously been very close to. \n\nAt the time, I would have loved to still have either of them in my life, but it clearly became unhealthy for everyone involved. They never hung out at my house either, but I ended up moving out.\n\nI legitimately don't think they had an affair, but why would a close friend initiate hanging out with my ex right after we had broken up? They had never hung out one-on-one before.",
            "Damn, that sucks, I'm sorry.   \n\n\nIt definitely sounds like there were feelings and attraction at least between roommate and ex while you were dating, even if no cheating took place.   \n\n\nIt sucks to find out this way about people you trusted, but for them t pull this is pretty shitty and you deserve better people in your life. At least you fund that out before more time and energy was invested in either of them.",
            "When one door closes, another opens. When one story ends, another begins. You are yet to see all the blessings of these chapter done and these people out of your life. It will be hard and it’s something you’ll have to feel but don’t dwell on the specifics. If they are or aren’t having an affair, two toxic people who don’t care about you are out of your life. It’s better you see this now rather than later.",
            "I’m so sorry that this happened to you. They both sound awful. The petty-ness in new would suggest telling all your mutual friends about how disrespectful your roommate is in all this... but... maybe you’re not as petty as I’d be. \nBut to be fair telling everyone about this is just also giving everyone a heads up about how much of a snake she is so \n\nHonestly I’d be more mad at my roommate bc if that was supposed to be my best friend idk man I’d lose it lol. \nGood for you for staying strong and keeping your head up.",
            "I'm sorry you're having to deal with this, and your roommate doesn't sound like a friend to you at all. \n\nI agree that it wouldn't be healthy to remain roommates, but I'd even go a step further and try to find new friends who won't treat you like this. It was perfectly reasonable of you to not want your friend/roommate to be friends with your boyfriend and for you to be able to spend time alone with him without the friend tagging along constantly. Both your boyfriend and this friend should have respected your relationship boundaries.",
            "Nothing to add here, but you’re strong and amazing and they deserve each other. The fact that she was so ready to let you move out means that she didn’t consider you a friend in the first place. Their friends will soon come to learn of their toxicity and they’ll find people just like them. Don’t worry. It’ll be fine.",
            "I am so happy you are working on your situation, and just remember, this has nothing to do with you. Don’t ever for a second blame yourself for this. I CANT wait for karma to hit them both. I hope they get to enjoy of life of misery. Together or not.",
            "This whole situation stinks, if he is infact hooking up with her and had to dump you before he did so, that sounds like the right thing for him to do, but hiding it and calling you controlling is terrible gaslighting behaviour, same goes for your roommate if they are getting together then she is a backstabber who cannot be trusted and not someone you want as a friend anyway, consider this situation from your future, if you didn't end up getting hurt now you would've not known that you shouldn't be friends with either of them.",
            "Take this time to really focus on growing strong and healthy friendships. Don't put all your eggs in one basket - cultivate friendships with many people that you share your various hobbies with :) I'm sorry these people feel like they can treat someone this way, but you are blessed with the time and energy to yourself that you can channel into bringing more positivity in your life.",
            "They were fucking well before he dumped you, you know this is true, maybe you don't want to believe it, but you should admit that you know it is true, it will make it easier to move on when reminding yourself what a scumbag he is. You dodged a bullet because it's only a matter of time before he cheats on your roommate too.",
            "This situation has happened to me before. It sucks because you end up losing two important people in your life. But on the bright side, you don’t have to waste any more time being blinded by their actions towards you. They are selfish and disgusting for belittling your feelings despite the relationship they had with you. \n\nIt’s really hard to accept something that seems unreal in these situations. Stay strong!",
            "I’m so sorry! I’ve been there before where my best friend started dating my ex.. only I later found out that there was much flirting going on while I was still with him.. I tried staying friends with both of them but couldn’t handle it and cut them out\n\nI’m so sorry you’re going thru this.. she is a shitty friend but you will be okay!",
            "I never comment on anything but just wanted to say that I know how this feels and was in a very similar situation many years ago. Please please don't let this consume you - make sure you put your energy in everything that doesn't involve them and power on through. This will, one day, be a thing of the past.",
            "Could be worse. My roommate had a gf for some times. One night they get into a fight, roomate's gf leave slamming the door. The following day the gf returns... But with my other roommate. And they stayed together for several months until moving out for other reasons",
            "I'm so sorry :( I feel this whole thing has been so disrespectful to you from both your ex and roommate. Unfortunately I know this feeling all too well and I find it so painful and nauseating. I wish you all the healing you need and fantastic new friends and loves! And mind you, you don't have to be happy for those two, it's perfectly normal to feel angry and betrayed in a situation like this. Good luck <3",
            "You have been betrayed. It is not surprising that you are devastated by this situation and your ex and roommate don't have any right to tell you how to grieve the loss of their trust and friendship. Equally, people cannot help who they fall in love with, and they do seem to be well suited. The best ending is simply a respectful and clean break, in so far as that is possible. I am glad that your personal space is being respected, they certainly should not be seeing each other in your home.",
            "If your roommate has one shred of decency she will come out of the lust fog feeling ashamed and stupid for what she did. But since she doesn't seem to have any decency, maybe someone worse than her will give her some justice.",
            "My ex and mutual friend did the same to me, but it was a relief because in the end they were wayyy more compatible with each other than she and I ever were. It bothered me she put up pics of them making out like a week after the break up...but eh soon thereafter I was kinda happy they found each other and I found my way out? It was a relief all in all.",
            "this happened to me a few years ago and it turned out my best friend and ex were seeing eachother behind my back while we were still together and started dating 2 days after we broke up. they’re still together and i have a lot of resentment for both. i’m so sorry you’re going through this nobody deserves that",
            "I know it’s easier said than done but try to not get yourself too worked up about this. Things sting because you still care for and maybe still want your ex. But he’s doing too a favor by no stringing you along. My ex husband is now married to one of my best friends and while I’m sure our situations are totally different, in the end all I want is for people I care about to be happy.  \nMy ex and friend were super weird about my finding out they were together, but that’s to be expected, I would have been weird about it too if I was in their shoes. But if someone doesn’t want to be with you, the best thing they can do for you is let you go. You can rest easy knowing you were right, but for the love of god please don’t let either of them gaslight you because they can’t just answer truthfully when confronted with the information they assume will hurt you. It’s the withholding of that information that causes the most pain and stress.",
            "You are like Neo out here dodging bullets but you cannot see it because you are in the thick of it RN. You jumped off that wreck & your roommate is on a sinking ship (with your ex) that the rats aren't even on anymore. I'm sorry this is happening to you and it feels terrible. You will get through it! It will get better! Take time to learn the difference between being alone and being lonely. Get to know yourself and make yourself the most interesting person you can! After all, in the end, the person you spend the most time with will be yourself",
            "This really sucks dude. This kind of stuff is why friends being attracted to each other is a recipe for fuck-ups. When things go wrong you lose friends on top of that, which hurts twice *and* leaves you with less support.\n\nThis is totally the mistake of your friends for not being open about this. I get why they didn't cause it's scaaaary to bring up, but by trying to keep it hidden they just set everyone up for pain. I would expect they also feel shitty for having lost a friend. I hope so at least.",
            "I think you’re not being controlling at all and you’re being pretty good about how you handle this situation (which is really hard). Honestly, they don’t seem like great people, so it’s probably good that you found out and they’re out of your life. \n\nI say this as someone who started dating one of my close friends. His ex-gf *hated* me because we also had chemistry (we had been friends for years before they briefly dated), but their breaking up didn’t have anything to do with me. He and I didn’t start dating until eight months after they broke up, and when she told him that she was jealous of me/I sensed it, we both really limited the amount of time we spent together while they were dating. He and I never dated because I had been in a long, abusive, and awful relationship for the first five years that we knew each other. When I finally extricated myself (after many attempts and being guilted back by fake suicide threats from my ex) my bf and I started to date. But again, the breakup was about *me*, and me learning that I don’t have to be responsible for other people/don’t need to stay in a relationship I hate. Not because my bf and I wanted to date. As other people have noted, I think it’s likely that they’ll do this to each other at some point.",
            "I would imagine that they started it behind your back. Kept it all going while you two were together. Now they're ready to be with each other but still love the sneaking around part. Just cut them out of your life for now. You don't need this.",
            "Your boss is fucking awesome. 2 days off? Wow.",
            "This is a fairly obvious point, but you really are better off without both of them, and one day that's going to sink in. Just hang on until that day arrives. Therapy should help you get there.\n\nThe big battle is your own pride and hurt ego. Those bruises will fade, as bruises do, and you'll move on stronger for having fought this one.",
            "Thats your keyword: in time you will be happy. You may have lost two people that were once close but ultimately it is clear youre better off without them. \n\nNonetheless I feel for you and this is definitely a shitty fucking situation. Just make sure to cut both of them off and move on with your life. You will find a new friend, a new partner and things will be even better! All in good time.",
            "Thats your keyword: in time you will be happy. You may have lost two people that were once close but ultimately it is clear youre better off without them. \n\nNonetheless I feel for you and this is definitely a shitty fucking situation. Just make sure to cut both of them off and move on with your life. You will find a new friend, a new partner and things will be even better! All in good time.",
            "I read this yesterday and meant to reply but it looks like most of the responses already captured my thoughts but I did want to say you handled this VERY well. You seem very well adjusted, when something like this happens people tend to approach it with anger and resentment and that's the easy route but you are approaching it rationally and with the intent to just protect yourself and thats awesome. Just wanted to applaud you on that as it's rare these days. \n\nAlso just wanted to add (and apologize if someone already stated this) that the one thing you will need to come to terms with is that if/when they start a relationship there is a good chance you will hear about it and they may cut you off completely. You may feel like this is meant as aggression towards you but it's not, it has more to do with their selfishness. Just remember you didn't do anything wrong and what they (especially your roommate) have essentially decided is that their new relationship is more important than the friendship you had and that is a reflection of who THEY are, not who you are. It will be difficult but chalk it up as seeing their true selves early on and not having to deal with that kind of immaturity and drama in your life. Its truly a loss for them, not you. Wish you the best!",
            "A partner can have lots of friends and situations vary, but generally it's a box of red flags if they're so close to an ex that the ex is practically a life partner. If they hang out together, share emotions, collaborate etc it's more like they have a relationship with the ex, they're not over them at all, and it's time to break up. I'm not sure if I would even want to date someone who was in the same workplace as their ex which for most people means they spend more time together than with family or friends.",
            "Bruh. What awful people. I'm sorry you had to go through that, no one should have to experience that. Take care of yourself.",
            "wow that pretty rough! I think it's definitely not healthy for you to be around either of them. I think you are letting your housemate especially get off way to easy. I do understand that holding onto anger is only hurting you, but this early on you've gotta be pissed! I hope for your sake that this only started after the break up due to her having a crush on him - i hope she's just the rebound. She probably is just the rebound .... \n\nShe clearly didn't value your friendship - times like this show who you're true friends are and she is definitely not one of them. Tell her she has 2 weeks to move out. It's so not okay. She is the one with the power to respect your boundaries and not allow him to come over and hangout and rather do it elsewhere if she must. She sounds like a horrible person with no regard for anyone but herself. She is not someone you should have in your life! Maybe nothing went on while you two were together and he did just consider her a friend because of your relationship they spent a lot of time together. I think after you two broke up she probably told him how she feels and he's probably again using her as a rebound.",
            "The exact same thing happened to me. For your own sanity, black them out. Block them, don’t talk to them, don’t go searching for them, don’t continue any relationship with either of them. Trust me. Get as far away from the situation as you can as soon as possible.",
            "My best friend of over 15 years started to date my ex and hid it from me for months. Then one day non-chalantly texted me about it and posted pictures online from the last prior months of their “relationship”. Dropped her like it’s hot. Some people are just going to suck. It will hurt like hell but there’s better people in the world out there who will treasure their friendship with you, and you as a person. Then you look back and think damn, glad they’re out of my life.",
            "I just want to know how may of these comments are people who got dumped for their friends or were in similar situations. Insecurities are at a high here lol.",
            "How are people that you've known for under a year your best friends? Maybe it's time to reconnect with friends you were spending time with before this ex and roommate. \n\nGet out and make friends or do hobbies. Keep busy with fun stuff. I get that their behaviour hurts but what's done is done. You can have new friends and it will matter less and less",
            "Yeah these answers that just validate OPs feelings are ok. The answers validating the feelings and agreeing with the posture are not. OP is being controlling. I fully support moving out or asking for her roommate to move out but she did nothing wrong.\n\nThis sub has become a cesspool of empty validation and partiality.",
            "A less mature, less reasonable person might roofie your roommate and shave off her hair and eyebrows.  \n\nAnd get a stitch-ripper and partially rip out the butt seams in her jeans, so her pants split the first time she wears them and bends down.",
            "It sounds like you broke up, and he is moving on with someone he already had chemistry with, maybe already had feelings for, and has a lot in common with. They have respected your boundaries by not bringing it into your home, and she is doing her best to make the process of you no longer living together easy. They haven\\`t told you about their relationship (if they even have one) yet, because you broke up not long ago and you\\`re still having to live together, so broadcasting their new relationship would seem unnecessary, and that\\`s their choice.  You were only together for 10 months, so moving on after a couple of weeks seems fair enough. There is no grace period. \n\nThis sounds like a painful situation. It\\`s painful when someone brakes up with you, and to see them with someone else. It\\`s sad when that pain stops you from seeing a friend because it hurts too much to be around the person that they\\`re now with. But I don\\`t think trying to prove that they\\`re doing something wrong, or dissecting their every action to show how they\\`ve betrayed you or disrespected you is a particularly useful way to process that pain.\n\nThe top comment says that it\\`s fucked. How is it fucked up to give a relationship a shot for 10 months, then recognize that it\\`s not what you want, end it, and spend time getting to know someone else that they may have a good relationship with? If he cheated on you, that was shit of him, but it sounds much more likely that he just naturally developed feelings for someone else, and after realizing that, did the right thing and ended it with you.",
            "I think that your instincts are right here. And I think that you're doing all the right things--setting and enforcing your boundaries and asking your roommate to leave. \n  \nUnfortunately, we can't stop people from doing jerk thinks. We can only control how we deal with the fallout. And you're doing the best that you possibly can. As painful as it is, it's better to know now what kind of people your roommate and ex-boyfriend are. There are a lot of great people out there--these two are not who you deserve to have in your life.",
            "[deleted]",
            "Well I'm gonna be downvoted but I've been in a somewhat similar situation but on the ex's perspective. I delayed the breakup and was catching feels from someone else without noticing it. I denied my feelings and re-evaluated my relationship and all that was wrong with it and broke up with my ex before pursuing a new relationship.\nI won't lie and say that my hidden feelings weren't one of the reasons for the breakup but they weren't, by far, the main reason. Even if I had never met the other guy I would have still broken up because there was just so much wrong with the relationship and I didn't see a future for it anymore. I no longer loved him, and that's a valid reason to break up. It just wasn't working anymore, he was heartbroken of course, and I felt terrible for that but would have been worse to keep dragging him and pretend everything was great when it wasn't. \nThat said, I did not allow myself to accept my feelings before the breakup. One month later I started dating. It was a short period of time, but since I was the one who dumped him, naturally I moved on faster. And that's valid. It's my life and I was ready. I wasn't going to wait because I didn't want to hurt him. The moment I broke up, it was no longer my problem. I'm sorry if it hurts you, I really am, but you have to understand people move on, faster or slower, and that's just the way it is.\nWhether he cheated or not doesn't matter anymore, but it pisses me off when people assume cheating is the only reason to end a relationship. Even if they are together now, does it even matter? \n\nNow, they are close to you and her being your roommate I think she respected your boundaries by not bringing him inside. If you are at the point you count the days they hang out together, I'd say leaving the place is the best option for you, as it's not good for you to so that. You need to clear your mind and heal properly. If it hurts you this much, you have every right to cut them out of your life if that's what it takes you to heal. \nI just think it's selfish to think they won't pursue anything until you heal. If anything, I think he did great by being honest and leaving you instead of lying to you.\nTake your time, heal and it will get better.",
            "She doesn’t have to drop your ex as a friend, but you also don’t have to be HER friend if that bothers you. This is how it goes.",
            "Sorry but you need to move on. You can't dictate who your housemate or ex hangs out with. If they want to hang out they can",
            "I’m so sorry this happened OP. It seems you dodged a massive bullet with both a so called best friend and a so called boyfriend. You will find people who aren’t huge pieces of shit like this.\n\nYou’re handling this all really well, I commend you for seeking therapy and looking to the future/doing right by you. Please know it’ll be ok in the end and you’ll look back as this and be glad you got to see whose these people really are.",
            "[removed]",
            "Sorry for your breakup and i can understand your feelings . it is too tough to handle such situations.  I would like to suggest you that , you talk to them face to face and ask directly what is happening. You will get an idea or clue what is happening between them by their expressions and their answers. If you sense something is fishy then dont waste a single minute to think about them . If they are not into relation or something else  then talk to them that you felt bad . If they are your best buddies they can understand your situation and they will help you out of this. \n\nThis may help you.....",
            "Hey! Same thing happened to me last year. They were absolutely hiding something under the guise of \"just being friends\". They had slept together every time I left the house for overnight trips. Gave my anxiety attacks for a few weeks. Good luck OP, could be a long couple of weeks ahead of you.",
            "If they really like each other, i don’t think u should stop them from being with each other, that will only make everything worst, if u still want to be friends with them, then try and let them have their own time and don’t intervene. If u don’t want to be friends with them anymore, then just kick ur roommate out and act like nothing has happened before",
            "\"it's controlling of me to ask them not to hang out\"",
            "They're probably fucking too",
            "I mean, you don't get to tell people what to do or how to live.  The reality is that sometimes when you introduce people...they end up liking each other more than they ever liked you.  It happens.  Sucks, but it's life.\n\nMove on from both of them.  Stop making assumptions about things going on between them.  it's not going to help you heal.",
            "your roommate and x are assholes. Just leave them both in your rearview mirror.",
            ">I asked my ex while we were still dating if we could hang out just the two of us a little bit more, and I was accused then of being jealous and controlling.\n\nIOW you were gaslit. What the hell kind of reaction is that? I'm so sorry this happened to you. Your worries and weird feelings about this are justified. I would say that you dodged a bullet here, but that doesn't make it any easier in the short term. I hope that the move out goes quickly and smoothly, and that the therapy helps you process this and move on. Love sent to you from afar. <3",
            "Who cares? Oh yeah, you do!\n You shouldn't! \nIt's only having an impact on you and only you can stop it from being an issue.",
            "I think this was said in your previous post but you really ought to keep some distance between your friends and your relationships. At 10 months you were still in a fairly new relationship and you had only known your housemate for 7 months? You can't have really known her morals and you let her ski alone with your bf for days? Activities like this are known to stimulate attraction? \n\nIt was naive to think that you could all hang out together all of the time and nothing untoward would happen. I mean most people wouldn't do that to a friend but a good amount would. When you are married you can mix with other couples but mixing with a single person of the same sex as yourself was asking for it. \n\nAnyway ....you have come off lightly, you have seen the worst of both of them fairly early on so you can move on! Lesson learned. I don't want to imagine how horrible this is for you to go through but you are young and will fare better in the long run, wishing you all the best!",
            "Do you have ownership papers on either?",
            "Even if you can't move on physically at the moment, you have to move on emotionally and mentally...find some new friends...go out with new people....it won't make the sorrow of losing relationships go away, but it will help you stop focusing on the the past so much.  \n\n\nThis guy (and girl) should be encouraged to be happy and spend time with the people who make them happy.  That wasn't/isn't you...AND THAT'S OKAY!...\n\n&#x200B;\n\nSomeone else is out there waiting for your friendship (and potentially more) and you're just sitting here on reddit not trying to find them. Go and do. let the past be.",
            "He probably realized you weren’t a good fit for him right around the time he started falling for your roommate. People find out about themselves and their needs as they live their lives. Sometimes you realize you are dating the wrong person. It happens. \n\nHonestly, it perfectly fine, and normal, for people to fall for other people in their friends group. It happens. In your mid twenties you’re just finding out what you really want in life, and it’s pretty common to realize that the relationship you had in the few years prior, isn’t the one you want longer term. There’s nothing malicious about falling out of love for someone, or realizing a friend or coworker is a better fit for a partner.\n\nIt’s not ok the way they handled it. He should have broken up with OP, and been straight forward if there were any feelings for the roommate. Then he should have kept a respectful distance for at least a few months to show respect for the relationship and friendships.\n\nThe two of them disregarded how hurt OP was going to be over this and that was really shitty of them.",
            "When you are in your twenties this shit happens.. sucks.  Move on, it didn't work and there lesson learned and new people to meet.   Maybe those two will make it work or not...",
            "Some won't like this comment but it has to be said:\n\nThere is also this saying suck it the hell up. So what he broke up with you. Why should your roommate stop being friends with your ex?",
            "They have been dating for a long time, easy to see",
            ">TLDR; Ex and roommate hanging out still, I suspect something is going on and now they're hiding it from me.\n\n i mean there aint nothing to hide, you aint with him so its nothing to hide. Granted it does sound like she pounced soon as he was 'free'",
            "I hate what happened to you and you are probably right, but dont waste your money on therapy. You dont seem to have any issues that require therapy. Save that money for a possible move. If your name is the ok only name on the lease just kick her out, you'll have to go through the court system, but it wont take that long.",
            "Time to move on you don’t want him in your life anymore so why should you dictate who that person sees and what he does?"
        ]
    },
    {
        "post_id": "p2j9dd",
        "author": "cinniebunz",
        "title": "UPDATE - My (29F) boyfriend (25M) has been unsupportive during the loss of my little brother and now I find out he made a friend he's been keeping secret from me for months",
        "url": "https://www.reddit.com/r/relationships/comments/p2j9dd/update_my_29f_boyfriend_25m_has_been_unsupportive/",
        "score": 2981,
        "num_comments": 131,
        "created_utc": 1628707262.0,
        "selftext": " Link to original:\n\n[https://www.reddit.com/r/relationships/comments/oyrwru/my\\_29f\\_boyfriend\\_25m\\_has\\_been\\_unsupportive\\_during/](https://www.reddit.com/r/relationships/comments/oyrwru/my_29f_boyfriend_25m_has_been_unsupportive_during/)\n\nI don't know if anyone wanted an update, but I kind of want to have it here to remember why I'm done with this relationship in case I stop being mad.\n\nSo the new secret friend I mentioned before? My hunch was 100% correct. Even before my ex bf and I discussed breaking up, he informs me that him and this new guy were talking about being together. They have a trip to Disney planned and are meeting in person next week.\n\nNo wonder he had no time for my grieving, he was too busy thinking about life with his new man. Yay.\n\nSo I'm officially single and officially know what I don't want in a partner now so there's that!\n\nTL;DR Life never seems to go to plan",
        "permalink": "/r/relationships/comments/p2j9dd/update_my_29f_boyfriend_25m_has_been_unsupportive/",
        "comments": [
            "Well done! You deserve better and you've chosen better.\n\nI'm so sorry for the loss of your brother. Fill your life with those that can support you through the grieving process. Your ex wasn't and will never be that.",
            "My brother in law died last week, and my wife’s grieving is a high priority for me right now. I don’t know what to say—I don’t think anyone does—but she needs my presence and comfort; even if I don’t totally understand her grief. I’m very sorry you lost your brother. I’m sorry your ex was a careless asshole and didn’t support you and just… left… it’s really crushing to hear. That’s such a mean thing to do.",
            "Get tested for stds if he treated you that way who knows what he did behind your back. \n\nBlock him so you don't see him or his tags on social media.",
            "I'm sorry almost 4 years went down the drain. Reading your previous post, I'm also sorry to hear about your brother and dog. That being said, an SO should not only be there for your good times. Everyone is going to go through some sort of difficulty in their life, but having the blame be put on you because of what happened? Nahh. That's total bullshit. He might not know what to say, but he should already know how to comfort somebody after being together for almost 4 years. Also him not being a family oriented man should tell you how wanting a family with this guy would be a bad thing. I'm happy that you ended things. You sound like a real catch and he doesn't deserve you.",
            "I'm so sorry for all that you've had to deal with. I've dealt with a close loved one dying unexpectedly and it's the hardest thing. Grief is just so much more than you can understand before you've experienced it yourself. I'm sending you hugs\n\nI hope your bf has a terrible trip and is later crushed with guilt over his behavior. His behavior is deplorable.",
            "Ah that is a good escape you made there, he sounded immature and not what you needed at all. \nHow are you coping since your brother died? Are you getting some support?",
            "I'm sorry for the loss of your brother but ECSTATIC that you ditched this guy. He's a selfish, cheating, emotionally stunted loser. \n\nNow finish grieving, do some self care, and the rock on with your bad self.",
            "I am so thankful you got out of that situation. I was in a very similar relationship when my younger brother completed suicide. I won't get into the details, but as hard as it was I see now (10 years later) it was the best decision I ever made. Being with somebody who has zero empathy for such a tragic situation is not what you deserve. I got my confirmation of that only a few months after we split and we had started to talk again and he flat told me he \"doesn't want to waste his time if he won't get the old me back.\" Adios asshole.",
            "GOOD! FOR! YOU! \n\nOn to the next amazing chapter of life.",
            "Even if he was thinking about new guy that should not of stopped him from supporting you. Losing a sibling is a really big deal. Even just a friend should be supporting. I say you dumping him is going to do wonders for you to start treating yourself better.",
            "I had an ex that did a very crappy job of being there when my friend committed suicide—he blew me off the next day for a birthday party. \n\nConfirmed my reasoning for why people that aren’t good with death aren’t good for me. I’ve been to a lot of funerals from all degrees of separation, so i’m pretty aware of it. \n\nSo sorry for your loss. I hope you can come to a point soon where your thoughts of your brother are happier than sad. Take the time you need to get there.",
            "You should watch \"Midsommar\" if you want to blow off some steam.\n\n&#x200B;\n\n\\*Edit: definitely trigger warning for suicide, violence, and family death.",
            "I'm sorry, OP.  But realistically, you were only happy when he's happy, and he's only happy when he I'd in control of everything.  This is a crappy human being who can't even be there for you when your bro died after 4 years together.  If you need to talk, just msg ok?",
            "A moment of silence for the new man who doesn’t yet know the steaming pile of garbage he’s about to get involved with…\n\nI’m sorry about the loss of your brother. I lost mine when I was 15 so I’ve been there. I suspect he’s looking out for you though since his passing helped you realise your ex was a bad ‘un. 😘",
            "I didn’t see your original post but man, you really deserve better. I’m glad you have the opportunity to find someone better suited. Good luck!",
            "i'm very sorry for your loss, and good for you dropping this horrible human being. Everything is going to get a little better from now on without your ex.",
            "Your ex is so *ugh*, I don't have words. I wish I was really good friends with him so I could say \"you know what, after what you did to cinniebunz I'd rather not talk to you again\" because he seems to have no shame and someone should tell him what's up. \n\nIt's not easy breaking up while you're grieving, but you did it anyway. You're doing great, even if you feel down rn.",
            "I’m so sorry for your loss and for the fact that your (ex) boyfriend made this even harder for you. A similar situation happened with my friend, her fiancé used to get so angry with her for crying over losing her mum that she would have to excuse herself to cry in private. Turns out he had been having an affair the whole time, while we were all grieving, while her mum was dying in hospital, even when he proposed to my friend. \n\nOn the plus side she dodged a bullet and is now very happy with a new partner and a beautiful daughter. \n\nWishing you all the best.",
            "[removed]",
            "Good for you for dropping him! He can be someone else's problem now and you can enjoy doing things you like without having someone whine and moan. Sending you love and hugs",
            "I'm sorry for the loss of your younger sibling. I have had loss, but I can't even fathom how it must feel with a sibling. I wouldn't know what to say to you in your moment of grief, but I would try to either say something or make you comfortable in our silence. Ignoring everything else that he clearly didn't give the time of day to, he clearly didn't even acknowledge your current life situation. If he did, he wouldn't have questioned why things felt different between you. He would have taken the time to see you, instead of gaming with 'a best friend'. I know right now it probably feels horrible losing another person from your life, but honestly, at least now you are on the right track. Be with your family. Grieve your sibling and be OK, not being OK. Best wishes to you",
            "I’m sorry about your brother. On another note, better to know what you like/don’t like in a relationship early on. Good luck.",
            "What an absolute asshat. I hope his new boyfriend does the exact same thing your boyfriend did to you so he understands how it feels.",
            "Don't think of it as 4yrs down the drain. It was a learning lesson & we've all had them. You came a lot stronger & a lot wiser because of it. You learned what you can or will put up with, what you won't, & when to put your foot down. The way he treated you after such devastating losses, you didn't deserve. There are good ones out there, but in the mean time-learn to take care of & be happy with you, the rest will follow 🤙",
            "How tf can someone let alone a partner of 4 years be that incapable of showing any kind of support? Give your girl a hug, help her feel better, get her some food and provide some emotional stability....do something!\n\nAs for the relationship ending, it may have felt worse if he waited and then blindsided you with a breakup. Im glad you had a hunch  and you talked it over, got to the bottom of it. Its still shitty timing on his part but thats because this guy is shitty. Learn from your pain and make peace with what this guy was/is. Make peace with the past so you can have hope for your future. (relationship wise, I know the family events will be hard to forget esp your memories with your brother)\n\nI know you been going through some real trauma and pain. I know you will get through this. Sending positive vibes. Continue to surround yourself with people who love and support you. Love yourself as well!",
            "First I want to tell you how incredibly sorry I am for your loss. Losing anyone who means something to us in our lives is something we can’t ever really prepare for. And losing a sibling is such a layered loss, because it’s not just a family member but it’s someone you’ve bonded with your whole lives. Sometimes they’re more than a sibling, they’re your friend & It’s such a special relationship. I think sibling grief can get pushed aside a lot of the time because people focus on the parents or spouse the most. But I see you and I’m sending you a lot of love. \n\nUnfortunately I’ve been through something incredibly similar. Three years ago I lost my little brother who was only a year younger than me, we were really close growing up so of course this devastated me and my family. He was the youngest of the four of us (23 yrs when he died) and was the glue of the family. I’ve had miscarriages, lost grandparents and uncles, but this truly shook me to my core and continues to be something I struggle with daily. \n\nAnyway, I was with someone at the time and we were in a very rocky relationship for 7 years. He was never able to emotionally be there for me through much of anything. Looking back I’m unsure why I stayed with him for so long. I guess it was the comfort of consistency even though it was consistently chaotic and toxic But our breaking point was after my brother died and he was totally incapable of holding any space for me to feel comfortable grieving. \n\nHe didn’t want to spend any time with my family and I as we all came together and made preparations for the funeral. He said it would be “too awkward for him”, which I understand, but if the roles were reversed I would have pushed past the awkwardness if it meant my presence was helpful and made him feel supported. \n\nHe also started multiple fights with me complaining that I was “bitchy and snappy lately”….literally a few days after my brother had died…I think being on edge is to be expected. \nHe also went to two parties while I stayed at my parents house from sun up to sun down with my family planning things and making sure people ate, diffusing fights that would come from everyone being overwhelmed with grief and exhaustion and he never did much to make me feel supported. I felt like I was a burden to him. \n\nIt was only two weeks after my brothers death and a couple days after the funeral that something clicked, and I realized he was never going to be able to be there for me during this time the way I needed someone. So I broke up with him. A month later he was with someone new. I knew it was all for the best but that still hurt. You feel so easily replaceable. \n\nI can’t even begin to tell how alone I felt and how hard it was to get through the next three years. But I know that had I continued dating that person, I would have NEVER been able to begin to heal. Looking back now I am so grateful I ended things with him when I did. And as much as it sucks to be going through a breakup after losing your brother and your pet, I promise you, you’re better off without him. He was never going to be able to be the strong supportive partner you deserve. He would have made your healing and grieving journey so much more difficult than it already will be. Some people just aren’t capable of being who we want or need. It hurts, but it’s okay because we have the option to let them go. \n\nI struggled for years to grasp the concept of what a healthy relationship was, but after a lot of therapy and my own spiritual journey, I’ve learned SO much about myself. My life isn’t perfect, I still struggle everyday with the loss of my brother and some insecurities from my relationship with that ex, but I know how to navigate my emotions better because I allowed myself to let go of the relationship that was holding me back from healing. \n\nI’m now with someone who is incredibly kind and good in ways I constantly begged my ex to be. And while my current bf doesn’t understand the capacity of my loss and grief of my brother, he still does everything he can to make sure I know he’s there for me whenever I need or want him. \nYou will find someone like that too if you give yourself time to heal from this season of loss you’re going through. It won’t be easy by any means, it’ll probably be the hardest thing you ever do, but in the end when you find your way back to yourself, you’ll find you have so much more in you than you think. More strength, more love, more understanding, more empathy. And you’ll attract the right people into your life. \n\nMy only advice is to allow yourself to feel it all. Lean into every feeling you have. When you want to cry, cry. When you want to reminisce on memories of your brother that make you smile and be happy, smile and be happy. Don’t hold back. It’s so incredibly important to get all those sad dark feelings out so you can make room for better days ahead. \n\nMy whole heart goes out to you, and I hope you have a strong family and friends to talk to and lean on right now. I know we’re strangers but I also know what it’s like to have no one who seems to understand the experience you’re having right now, so if you ever need someone to talk to who has an idea of what you’re going through, please feel free to message me.",
            "That guy was so low quality and red flags were waving the whole time. Please don't ignore them anymore\n\nIts good that he is gone. You deserve wayyyyyy better. \n\nPlease spend time considering why you would stay with him so long? Why didn't your brain say this guy is garbage and exit even before he cheated. He was so so so low quality\n\nHighly recommend therapy or self reflection for becoming more confident and gaining higher self esteem. You deserve so much better. \n\nI'm sorry you went through all that. Please be kind and gentle to yourself ❤",
            "My ex did similar to me, too. My brother was murdered, and he was physically and emotionally absent. Even accused me of emotionally cheating on him with a male friend who had lost his brother a few years prior and was actually helping me. I told him I wouldn't be leaning on this friend if he was there for me. Turns out he had a crush on one of his coworkers. Took another 10 months before he finally left me for her.\n\nI'm so sorry you've dealt with this. You deserve so much better than him. Take your time, focus on healing, honor your brother and family as you need to. Don't engage with this worthless POS anymore. Mourn the loss of the good parts of the relationship, learn from it, and when you're ready, move on. It's hard, but possible.",
            "You didn’t lose him he lost you",
            "I am really sorry, friend. This is for the best for you, as hard as it is. I hope you are coping. \n\nI lost my little brothers a few months ago, and I can honestly say that my boyfriend has played a monumental role in keeping me alive and somewhat sane through this. The man force-fed me in the first month when I was in shock and couldn't move. He has held me when I was scream-crying - the howls of someone who has just come to the realization - like it was nothing. I don't know where I'd be without him through this. I might not even be alive if not for him.",
            "I wouldn’t expect anyone to change their stance but one thing I explained to my boyfriend about marriage before kids was that I wanted to have the same last name as my children. I explained I would be happy to take his last name, but if we were not married I would giving then my last name or hyphenating. This might give him another perspective. Hope it works out!",
            "Oh honey I'm so sorry. This is for the best though, he wasn't giving you anything you deserve",
            "Congratulations! I read your old post after seeing this, and honestly: absolute bullet dodged. Tons and tons of people want to do the same hobbies and activities as you and they’re looking for romance, too. I’m sorry this hurts now, but I’m happy for future you!",
            "Youre better off that way honestly. No one deserves that during such a difficult time. Im sorry",
            "Damn I’m sorry you’ve had to go through so much, but I think things will only get better from here. And now you know exactly what you want out of a relationship when you’re ready. I wish you all the best!!!",
            "Good for you, sounds like you're much better off. My ex broke up with me a couple months ago, I was heartbroken for a while and I'm still not entirely over it, but it does get better. Especially when you know you deserve someone better. Take some time for yourself, but I'm sure you'll get over him in no time! Plenty of better guys out there",
            "I hope that in the following months you feel better. \nYou deserve better in your life and I send you hugs for your loss. \nSending you all the best loving vibes. ✨",
            "It's these moments that will test you and the people around you and make you realise who is worth keeping in your life. And I am glad to hear you are not keeping that asshole in it. I hope things start looking up for you and your family soon but until then, just hang in there!",
            "Congrats! Good luck with your new life without the emotional dead weight 😊",
            ">TL;DR Life never seems to go to plan\n\nThere you go hitting me in the feels",
            "I’m 29 and recently single too . Sometimes I get a little insecure but there’s more to us than just finding a bf and when it’s right it’ll be right . Be happy you have this time to enjoy you and how great you are . I know a few months ago compared to know I am so much happier",
            "Congratulations! And honestly, it is sooo important to know what you \\*don't want\\* in a partner, so even though it sucks to break up, I'm actually really happy for you to have made this decision. Take care & all the best to you!",
            "According to your description, his new friend was the minor problem in your relationship",
            "I'm sorry for the loss of your brother. I'm sorry this ahole didn't know how to be a good boyfriend and a decent human being. I say,  in the end, good riddance. Right now it hurts and there lots of familiarity makes it hard but you'll be much better without him until you fund the perfect partner that you deserve. \n\nGood luck!",
            "[removed]",
            "I’m so happy with this update!",
            "I'm sorry for your loss and good riddance with your ex. My younger brother also passed away in 2019. My bf, now husband was nothing but supportive and held me when I cried even though there was nothing he could say that would comfort me. You deserve better.",
            "I’m sorry for your loss. Don’t lose hope; there are so many beautiful and kind hearted men out there. I hope you connect with one.",
            "i hope u break that glitch and make life go as U want it to.... have a good life and i hope that you willl recover from this easily \n\n&#x200B;\n\noh and i wanna recommend that you copy/past the original post in you phones notes just ion case the mods decide that there gonna remove it",
            "Find yourself first and take care of present and future you. A partner will happen when it happens.\n\nBest of luck.",
            "Glad to see you left that zero in your rear view window.  I went through something similar with an ex - she asked me “are you going to get over this soon?” a week after my Gramma passed away. My Gramma was more like my mom, she raised me from three years old. At the time I thought she was right and I needed to just get over it, now I see that she was a class A Asshole.\n\nI’m so sorry for the loss of your brother and your dog. Better days (and better partners) are ahead.",
            "The good news is that your ex isn’t leaving to get his happy ending. Because he’s taking himself into that relationship. Which means it’s doomed. Someone as deeply self involved as him will never be able to function in a relationship. So he better enjoy his disney honeymoon because it won’t be long until reality will hit that relationship like a slap and the new guy realises that everything has to be on your exes terms and dumps his selfish ass.",
            "I’m proud of you, sounds like he made you feel worse and worse constantly so you didn’t leave until he found something he preferred, I’m sorry you went through that",
            "Throughout my life, I have found that losing someone to death is the ultimate test in a relationship. You'd be surprised how many partners actually can't handle someone else grieving.",
            "You deserve better! Keep your chin up girly, Ik life is probably hard right now but you can keep going! There’s someone out there who will treat you right and love you fully. In the meantime, we love you 🖤",
            "You deserve someone who will support you no matter what - during grief, during happiness, during anything. You can be that person for yourself, right now.",
            "Oh geez!  Bless ur heart!",
            "I am so sorry that happened to you. No one deserves that. I am also sorry for your loss of your brother. You should have had a stronger support and you \"bf\" stole that from you. Sending you hugs",
            "Chiming in with condolences for your loss(es). I propose you take many loving self care baths, you cry it out as much as you need, and you find comforting meals to eat every day. \n\nThe cruelty from your ex is real. It’s easy to say you did nothing wrong, other than holding on to someone unhealthy for you when they should’ve been let go. Hold on to the reality that the “differences” were your grief, the grief you are allowed to feel. The fact that you changed because a traumatizing event happened, not because you were bad, not because you couldn’t hold yourself together, because that shouldn’t even be an expectation at this point. You should only be together enough to not relinquish your agony on others, and even so it’s a common response to such loss. 100% you’re valid in all your feelings and as long as you’re getting up and eating something every day I’m proud of you.",
            "I'm so sorry for your loss! This is us a new chapter for you. I wish you all the best! 💟",
            "Im so sorry for your loss, and it sucks how this guy checked out on you when you needed him the most, even if he didnt feel like a partner anymore, at least as a friend.  You did good, this person did not deserve you, your time or your attention. Timing sucked but you will get over this, you got this!",
            "Your boyfriend more than likely went on Grindr to meet this man. His intention was to cheat without admitting his sexual needs. I guess he succeeded and you both got what you need now. You dodged a bullet OP.",
            "Eventually his time will come too, and at that point he shall be judged.",
            "Wow, this is why I would question dating a bisexual. They're much more likely to do this in my experience. Anyways, I hope you process your grief well and find someone who is not \"fair weather\". Inability to care about your grief is a huge problem. I remember one of my exes grandmother died and so I drove all the way across the country with her (she was scared of flying and didn't want to drive alone) later on when my grandma died she basically told me to get over it.",
            "[removed]"
        ]
    }
]