[
    {
        "post_id": "az648p",
        "author": "throwawaywifehatesme",
        "title": "My wife [28F] found out that my mother [59F] and I [28M] have been lying to her about our baby [0M] for months",
        "url": "https://www.reddit.com/r/relationships/comments/az648p/my_wife_28f_found_out_that_my_mother_59f_and_i/",
        "score": 2979,
        "num_comments": 32,
        "created_utc": 1552154310.0,
        "selftext": "This all went down about an hour ago and my wife is still crying in our bathroom with the door locked. \n\nBackstory: We had our son (now 11 months old) while my wife is in residency. She took a few weeks off before giving birth, and then went back to work a few months after, while I transitioned my hours to part-time so that I could stay at home and raise our son. My mom moved in with us shortly after the birth in order to help out, which allows me to get in the few hours of work per day and also not get swamped with taking care of the baby/housework. She's quite old-fashioned and would definitely not prefer this arrangement with me being a stay-at-home dad, but she hasn't said anything to either of us and has been a great help.\n\nFor anyone unfamiliar with medical residency, it is *brutal*. My wife has just over a year left. Sometimes she comes and goes for 1-3 days and our son is asleep the whole time she's home, which has been happening more as his sleep schedule shifted to sleeping through the night. My mom and I make sure that when she's home and the baby is awake, my wife gets him 100%. I know it's been hard on her, but unfortunately it's just going to be this way for another year.\n\nThe first big milestone she missed was him rolling over. When she got home, my mom pulled her over to the baby all excited. I thought she was going to tell her, but instead she says \"Julie, you came home right on time! He's been moving about as if he's going to roll over!\" They both stood there encouraging him, and right on cue he rolls. My wife was *elated*. She was so worried and guilty about not being there and she took it as proof that she can still be a present mother while working. \n\nSo we continued. I send texts over little things she misses through the day so that it's not completely unbelievable, but my wife has been 'present' for every single BIG milestone. He coincidentally started crawling with her right there, his first words were in front of her, and he began standing, cruising, and walking when she happened to be home. The walking one was difficult- there was a tough 7 day stretch where she just wasn't home during the daytime when he was awake, and his walking went from teetering to walking a couple steps pretty confidently in that time. We put little beanbags in one of his pants pockets so he'd be wobbly and unbalanced and it looked believable since he fell after the first step like he was doing a week ago. Yes, it was mean to our poor son but my wife's face was worth it.\n\nToday it all unravelled. So far he can just say 'mama', 'dada' and 'nana'. Yesterday he started saying 'bye-bye'. My wife has today off and has been home all morning. My mom and I have been trying to get him to say bye all day without giving it away that we already know he can say bye. Successfully got him to say bye to the ducks at the park, and we both gushed over his newest word the whole way home. My wife was using my phone to take pictures of him and began showing my mom at home while telling her about his newest word acquisition. She was swiping through my gallery and saw a video from yesterday and goes \"oh you never sent me this one!\" It was literally like a slow motion film happening in front of my eyes. I had taken the video of him yesterday waving bye-bye.\n\nMy wife isn't an idiot. She figured the whole ruse out pretty much instantly. I've never seen her look so upset and heartbroken before. I couldn't say or do anything to comfort her. Now she's locked herself in the bathroom crying and won't come out. I'm on our bed hoping someone can please tell me what to do to make this better.\n\n&#x200B;\n\n**tl,dr:** my mom and I lied to my wife about our son's milestones for months, and she just found out.\n\n&#x200B;",
        "permalink": "/r/relationships/comments/az648p/my_wife_28f_found_out_that_my_mother_59f_and_i/",
        "comments": [
            "Oh god the title read as if you and your mom had a baby together and I was like dying so this didn’t seem as bad after thinking that",
            "OH MAN, this is a very different story from the one the title suggested it would be! \n\nYour intentions here are very, very kind, but lying to protect your wife's feelings is still lying. It sounds like your wife is feeling some guilt or ambivalence about not being able to spend as much time with your baby as she wishes she could, and pretending that she is a part of all his firsts isn't ultimately going to help her deal with those feelings. You need to be honest with her and give her the space to feel whatever she feels about this - but she also needs to understand that a LOT of working parents deal with the same disappointment she's feeling, and come to terms with it. ",
            "This is a difficult situation.\n\nRight now, my suggestion would be to give your wife space. She needs to process this. It’s hard, but the fact is that you can’t do anything to fix what she’s feeling. Her emotions are incredibly heightened, not only from new motherhood but from stress and pressure, and they’re hers to ride out until she’s ready to be helped—and frankly, she might not want that help from you. While I understand why you did what you did, and I see the love and compassion that fueled the choice, you and your mother were dishonest in a very complex and conspiratorial way. That’s simply it. And your wife, even if she also sees the love behind the choices you mad, has been impacted by your dishonesty. She has been wronged. Right now, it’s most important that you don’t try to fix or chase away that feeling, because if you do, you will not lay a foundation to build up from this low and difficult point.\n\nLet your wife decide when she’s ready to talk and be helped, and what form that help will take. Give her that space.",
            "Stop lying and start recording or live streaming these things to her. ",
            "Oof, your heart was in the right place, but I completely understand why she feels betrayed. She is probably just as angry as herself as she is upset with you. I can't imagine how tough it would be for a new mom to be away from her infant so much, she is probably carrying a tremendous amount of guilt despite knowing she's going through residency for your family.\n\nI'd just give her space for now and when you talk, promise her that you'll be transparent going forward.",
            "Oh gosh, you all sound like you're trying to do the best you can.\n\nI think it's sweet that you and your mother are trying hard to make your wife feel less bad about being so busy with work. Lying is not black and white, you all have good intentions.",
            "Man, OP. I can sympathize with why you lied - you don’t want your wife, the mother, to feel horrible about missing a milestone. But gosh... if I were her, I’d be devastated and angry and hurt. \n\nYou had good intentions, but you still lied. For months. That trust is eroded and it’ll be tough to get it back. \n\nI’d apologize and ask her what you can do. ",
            "Doesn’t matter what your intentions were. Even tho they were good, you still lied. \n\nMultiple times. \n\nFor months. \n\nAnd you probably would’ve continued to lie if she hadn’t found out I’m guessing? \n\nStop. \n\nLying. ",
            "Why on earth would you lie to your wife? A baby learns a new skill on their own timeline. No one would need to see every big moment especially if your child was in daycare. Your wife has a right to be pissed at you and your mother.\n\nIt's hard to believe you would lie to your wife about something so small. And collaborate the lie with your mother. You have caused your wife a lot of anguish when she is already stressed from work and feeling guilty she can't be home with her baby. It will take a while for her to trust you again. A long while.",
            "You are an awesome husband. Honestly. I don't think this is about the movie clip at all. It is just that she feels guilt about being away so much. And seeing this on the phone made her questioning and doubting her motherhood, and probably made her realise the reality. But it is just what I am guessing here.\n",
            "I mean, your first wrong move was not pulling your mom aside after the first incident and telling her that was wrong and you don’t want to lie to your wife and this just put you in a terrible position. To continue collaborating with your mom and keep your wife from actually being a part of these milestones is absolutely terrible. You need to be honest and let your wife know how it happened that first time, so she knows it wasn’t you who first initiated this deceit.... and then apologize for stealing these milestones from her. You should have been keeping her updated while she was at work and sending her these videos. Who’s idea was it to put the bag in his pocket?? That is just taking it to a whole new level. ",
            "I’m so sorry. I have some things to say but first can you please tell me if these little lies were mostly your moms idea? "
        ]
    },
    {
        "post_id": "9hxoqs",
        "author": "dotnotdot",
        "title": "Update : My boss is the source of my anxiety, I want to quit , 7 months later",
        "url": "https://www.reddit.com/r/relationships/comments/9hxoqs/update_my_boss_is_the_source_of_my_anxiety_i_want/",
        "score": 2979,
        "num_comments": 123,
        "created_utc": 1537598365.0,
        "selftext": "Original post : https://www.reddit.com/r/relationships/comments/7vhay1/my_45_f_boss_60sf_is_the_source_of_my_anxiety_due/?utm_source=reddit-android\n\nIt's been 7 months and I'm happy to say I have officially quit, my last day is next week. I dwindled my days down to 2 and have recently started training at my new job the remainder of the week.\n\n\nI developed alopecia and started losing my hair from the stress. I was not going to allow this woman to take my hair along with my sense of self worth.\n\n\nThe news went better than expected when I explained I was leaving. Of course I didn't tell her my true reasoning, I cited somewhat truths to keep her happy and my side gig secured with her. \nShe offered a huge raise and other benefits, but nothing could keep me there, minus her pressence.  She said I was irreplaceble. Too late for praise now, maybe you should have treated me with respect. I didn't say this, though I wanted to, oh how I wanted to. \n\n2 decades of stress, anxiety , and being talked down to by my boss is officially coming to an end and I have the very kind redditors who messaged me and responded with words of encouragement to thank. Some of you offered to help me write a resume and some even offered me a job. If I could hug you guys I would, I'm truly that grateful. \n\nMy poor replacement is already feeling her wrath. I have warned her and told her to not allow herself to be a doormat. She's young, so I'm worried she's a bit naive, as was I and will accept the abuse. 😔\n\nI was offered a job as soon as I mentioned wanting to quit to a friend. I have benefits and work in a laid back atmosphere where I'm adjusting to not working under a narcissistic , bullying dictator. I'm learning I don't have to apologize constantly over the smallest mistakes to my new boss to keep them calm and happy. It's absolutely refreshing. \n\n\nThank you.\n\n**Edit :**Holy hell, reading these comments there are far too many clones my \"boss\" out there lurking amoung us.  \nIf my story sounds familiar, please work on an exit plan. This is not normal. This is an abusive relationship. The longer you stay the more ammunition they compile to use against you to keep you.  It **never** gets better. \n\n**TL;DR**\n\n**I lost a good chunk of my hair. \nI quit. \nShe took it moderately ok. \nI have a new job. \nBest of luck to my replacement, you're going to need it girl. \nI have Reddit to thank for the kind words and the push I needed to save my sanity and health.**",
        "permalink": "/r/relationships/comments/9hxoqs/update_my_boss_is_the_source_of_my_anxiety_i_want/",
        "comments": [
            "I'm so glad you got out, well done :-)\n\n\"She offered a huge raise and other benefits, but nothing could keep me there, minus her pressence. She said I was irreplaceble. Too late for praise now, maybe you should have treated me with respect.\"\n\nThere are few things more annoying than watching the crocodile tears of someone who is upset their actions finally had consequences. I got that in my last but one job.\n\n\"We need you here.\" I was told.\n\nNot enough to get regular reviews, not enough for pay rises, not enough for it to be worthwhile training me properly. Get stuffed, old boss ;-)\n\n",
            "That's so good!! I'm happy for you!!\nI had a hell of a charge nurse for a few years who was my source of constant anxiety attacks. She retired and the relief was pretty much overnight. No more anxiety attacks, no more misery, no more hating my job. It's amazing what a good leader will do for your health.",
            "I had the same issue at my first IT job. My boss and I had good laughs but most of the time when he called or talking to him my anxiety would shoot through the roof. When I get flustered or stressed out I stutter and he would mock it. I would be in tears sometimes.  There are other reasons why i dreaded work but that was one of the top 3 reasons why I hated my old job. I’m glad you got out. ",
            "Good for you! Your (now ex) boss was an abusive nightmare. You literally sound like Cinderella realising her worth. You deserve so much more from life, glad you’re chasing that now! ",
            "PLEASE go on Glassdoor or some other company review site and explain what you've been through at this company in a anonymous way. Don't put in any personal details or names. Definitely warn others of the positives and negatives you've experienced at that job.",
            "Go you! Experiencing this with a new boss now too. Need to get out too.",
            "Keep up the good attitude. I was in a situation very similar to yours where my boss was straight up emotionally and mentally abusive to me. I raised the concern several times with upper management but nothing was done. Fortunately I work in a field with a really high demand so I found a job as soon as I started looking. I was only under that manager for 6 months and its taken me months to shake the paranoia and walking on eggshells attitude. My new manager is super laid back and kind but I was so jumpy when I started there because I got used to all my flaws being pointed out and announced loudly. There might be an overlap with you too since you were in the bad situation much longer than I was, so if you start feeling paranoid or jumpy you'll know what's up. ",
            "Good luck with your new job! ",
            "I read your original post and that situation reminded me so much of what I went through for 2 years. Back around 2010 I took a job in another department (government). I knew by the end of the first week that something was wrong. I knew by the end of the second week I had made a huge mistake. Two years I worked under a narcissist psychopath. Every day was like a psychological cold war. It destroyed my confidence and left me with severe anxiety. In the end the only way out was to quit. I ended a career because of this person.  \n\nIn the end you have to decide what your sanity is worth. Sounds like you made that choice and I'm happy for you. There's life afterward. And don't be afraid to seek professional help. Counselling has done wonders for me. I don't think I'll ever be the same but it helps.",
            "I was in a similar position a few months ago. I, too, was a personal assistant. To an ambassador at an embassy. He was such a narcissistic egomaniac. He would yell at me if I did something wrong or hesitate an answer to something. If I did something right, he wouldn’t acknowledge it. He would call me out of hours sometimes just to ask about something stupid. When I was first worked there, one of my lovely coworkers told me that nobody really stays in my position for more than a year. When I asked him why he said, “because he’s crazy.” Lol. I was there for 9 months and just had to quit. Anyway, I don’t regret it as it was a good experience overall and I’ve learned a few things but I’m just glad I don’t have to deal with him or see his face again. ",
            "Sometimes stress related hair loss goes away.  The hair start to grow back after a few months.  ",
            "Well done for getting out of that environment. All the best at the new job! ",
            "> I was offered a job as soon as I mentioned wanting to quit to a friend.\n\nThat's because you had what my college classes call \"transferable skills\".  They come with any job, if you work there long enough and actually work hard.  Things like communication skills, critical thinking, ethics, information literacy, etc.  Being able to do that stuff is HUGE.  Job knowledge can be learned later.  Being able to function on your own within a working environment?  *Priceless*",
            "I can already tell by your positivity, the future holds great things in store for you. ",
            "I endured 7 years of the most horrible supervisor a person could have.  She was a horrible and just plain mean.  After more than 18 emails to the HR department they finally dealt with it and fired every one! I was just glad that she got hers! You can't treat people like that and expect them to be okay! Not Okay! ",
            "I'm so happy for you!",
            "You're in a better place. Try not to have that happen again. My boss is one of the nicest person in the world but the coworkers are absolutely the most evil people I've ever met.",
            "what an awesome update!! Best of luck to you! And your replacement...",
            "i recently quit my job.  i was threatened by a coworker's felon spouse at work.  since its a public place, he could not be banned from the location.  i was temporarily transferred out for a few months but i had to go back.  when i went back, i tried being there two weeks but would stress constantly thinking about being there and want to kill myself frequently.  it was a huge relief when i quit. \n\nim glad you were able to quit and find peace",
            "Yeah my boss was like that... except it was a group. Very toxic bully like environment where if you didn’t agree you were an outcast and would get shit on constantly. I finally quit after they got mad because I said fuck. In the back. My new job is the same amount of busy & way less stress. Some BS but not as bad as the last one ",
            "Congratulations on escaping! Well done for choosing your mental, emotional and physical health over the false security of the paycheck you were getting. So many of us are trapped by that false security and fear that this is as good as it gets. I hope your new work-life brings you contentment and balance. Good luck!",
            "I'm trying to work on a similar situation. My supervisor is very, very overbearing. The job is made stupidly difficult by daily scoring of things and I only took the job because I wasn't able to get on disability (PTSD, severe anxiety, chronic depression). I don't want to feel like I'm caged for eight hours a day any more and constantly judged. I'm 38. I'm a fucking adult. Let me do my job. ",
            "Congratulations!!! This is just as huge as leaving an abusive romantic relationship/marriage. You should be extremely proud of yourself!",
            "Earlier this year I worked with a woman who sounds exactly like your soon to be ex boss. Narcissistic, abusive, condescending etc.  Everything. I only lasted 5 months! \n\nI have to say, I admire your patience!!!! \n\nCongratulations for getting out. All the best to you!!! ",
            "20 years is a long time to stay in abusive relationship. Sounds like you’ve landed on your feet. Soon you’ll have a full head of hair to go with your new lease on life. ",
            "I had a job that stressed me out to the point where I lost some patches of hair.  That's a pretty weird thing body-wise.\n\n&#x200B;\n\nGlad you found a new gig.",
            "Good for you. I recently did the same thing with a job i worked 7 years at. I was basically losing my mind and spending too much of my own time thinking about how much i hated that job. No one should be talked down to, its not worth the money in my opinion, and for someone to use their higher position to take advantage of someones self worth, id rather take on a new job that pays less and at least be mentally healthy. I just started my new job a month ago and I've been so relieved of stress, I feel like im on vacation in a weird way. Im more relaxed, happy, and socialize naturally. Im sure you know how this feels?",
            "Hey congratulations OP. I quit my stressful job 6 months ago as well and as much as I wish I’d done it sooner I think it gave me a whole new perspective on jobs. Now I have a new job with an awesome group of people who are all chill and professional. I have such a great appreciation for working somewhere “normal” that I really think I can go further than I could without that experience. I was worried when I was working at my shit job that it would make me jaded and “crazy” but instead it gave me a better appreciation for a lot of things I took for granted at old jobs I had. \n\nEven though my last boss was a manic nightmare I came out of the other end of it more composed and able to deal with stress with a smile because hey at least no ones cursing me out as I do all this work. ",
            "Awesome! Congrats! So happy for you!! You truly deserve it. ",
            "CONGRATS!! I left my toxic job after 7.5 years and while it was scary AF, I am so glad I did it. ",
            "I quit my job in October. My boss was not only verbally abusive but he's thrown telephones and screwdrivers at me. I would be screamed at for other people's mistakes even when they occurred on my days off. My days off became panic of what I was going back to. He was sexist, racist and abusive. Recently offered me my job back and for a second I was tempted. I'm a Stay at home Mum now and I'm sad about that however my son has additional needs and I'm pregnant. Felt so good to decline. So so good. Glad you are out also! ",
            "Good for you, well done! I hope you are very happy at your new job, its well deserved :) ",
            "You should sue for workers comp",
            "Read the other post. Just curious what industry you were in?\n\nI've seen some pretty bad bosses in food service but nothing tops what I've seen in automotive.",
            "i'm glad you got out. you gotta do what's best for you.",
            "I was losing my hair at my last job too! Luckily after I quit it seems to have filled back in. I sympathize with you! Glad you got out.",
            "so glad you're free! check out ask a manager (i can't link, but you can search for it easy enough) and you'll see that you're not alone dealing with some wildly not okay management (and alison has good tips for readjusting your thought after being in a toxic work place).",
            "I worked under an emotionally abusive boss. Retail. She would call me into the office 3 or 4 times a day to dress me down over minor mistakes, then lovebomb me by telling me “you bring something here that I can’t lose”. One time I was doing 3 jobs at once and struggling *just* a little. In front of all my coworkers she was like “KentabooRex, I am so embarrassed for you.” Just eying me straight on like it was all my fault. She destroyed my confidence in my work for several years. \n\nThankfully she is long in the past and I have long since moved on. But I still struggle to shake the anxiety even 6 years later",
            "I can so relate. Worked for a bat shit crazy millionaire for 5 years in the office of a once successful business she inherited and was slowly running into the ground. I ended up in cardiac care for 3 days with an irregular heart beat and a BP of 165/110. The Dr said I needed to stay home, let the new meds stabilize  and rest up but my coworker begged me to come in as no one knew how to do part of my essential job. I showed up pale, weakened and covered in bruises from the IVs and sat at my computer. Boss lady starts screaming she needed a certain invoice from last year, no one recognized the information she was asking for. I sat on the floor to go thru a filing box and she came in and threatened me that I better not get up off the floor until I found the invoice she wanted (that didn’t exist in the first place). I should have grabbed my purse and gone home, but I really liked my coworker and she too was in the midst of a nervous breakdown. My aunt told me that night to give notice the next day, so I did. A generous 30 days. I was waiting to hear about my replacement but my coworker said the owner had not placed an ad because she was sure I’d change my mind. So I had to give yet another 2 week notice that she finally took notice of. I trained not one but two replacements, one high tailed it out after 3 days and the second one stayed but walked out four months later. Thankfully my coworker was laid off a short time later and got to enjoy a year of unemployment. ",
            "Just read your original post and update. Good job doing what was best for you and getting out! I'm amazed you were able to deal with her for so long and maintain your sanity. Good luck! ",
            "I'm curious. Was this job you had for two decades a MLM job?",
            "[deleted]",
            "[removed]",
            "Curse your boss out on the way out the door. Record it and post it on youtube. Will make you feel better. "
        ]
    },
    {
        "post_id": "4isc42",
        "author": "koumorinobi",
        "title": "My [24F] sister [25F] and her bf [25M] are upset because my fiance [27M] proposed to me and have started shaming us on social media",
        "url": "https://www.reddit.com/r/relationships/comments/4isc42/my_24f_sister_25f_and_her_bf_25m_are_upset/",
        "score": 2974,
        "num_comments": 364,
        "created_utc": 1462926424.0,
        "selftext": "Hi, r/relationships! This is a repost because I messed up a few of the details + I posted this in the middle of the night and didn't get much of a response.\n\nMy fiance: Charlie\n\nMy sister: Kendall\n\nKendall's boyfriend: Jack\n\n\n**BACKGROUND INFO**\n\nCharlie and I have been together for six years and have lived together for three years. We met in college. Our relationship is *awesome*. I love him more than anything and I know he's the one I want to spend the rest of my life with. We're best friends, we make a great team, and we're really happy together. So no problems there.\n\nKendall and I have always been close. We've had normal sisterly arguments and whatnot, but I love her and she's family. I don't really know Jack that well, but he seemed like a nice guy (which obviously isn't the case), and we've all gotten along until now.\n\nKendall and Jack have been together for two years. Their relationship is rocky; Kendall has called me countless times because of fights, breakups, and drama. I've always been her shoulder to cry on and I've supported her through everything as best I can. \n\nShe has gotten jealous of my relationship with Charlie, saying things like she wishes she could have a \"perfect\" relationship like ours and she wishes she could have that connection with Jack. Recently (within the last two months), she's started saying things like \"I should just steal Charlie from you\" and \"I wish Jack was more like Charlie, I think Charlie and I would be a great match.\" She started flirting with Charlie (which made him super uncomfortable) and overstepped boundaries. I was uncomfortable and upset with her behavior, we had a serious talk and she broke down. She told me she was going through a rough patch with Jack and wasn't handling it well. She apologized (to me and to Charlie) and told me she knew what she did was wrong, it wouldn't happen again, etc. Charlie and I talked about it and we decided to forgive her.\n\nAt the time of the incident, Jack and Kendall were still going through a rough patch.\n\n**THE INCIDENT**\n\nTwo weeks ago, Charlie invited close friends and family to dinner (this included Jack and Kendall). It was at the restaurant Charlie and I had our first date, down to the exact table we sat at. We had talked about marriage (at great length), so I had a feeling.\n\nLo and behold, Charlie proposed to me. It was perfect, I was so happy. I cried like a baby, lol.\n\nOur family and friends congratulated us. Kendall seemed super excited. She gushed about how cute it was, started talking about the wedding, and hugged us both. \n\nThe only person who didn't seem happy for us was Jack. He told Kendall that he wanted to go home and they left early.\n\nFast forward a few days. Kendall texted me and she was pissed. She called me \"a dirty traitor\" and \"a disgusting cunt.\" I was like wtf??? I asked her why she was upset. She claimed I was trying to ruin her relationship and then stopped replying to my texts.\n\nI texted Jack and asked him wtf was going on. He told me that he was planning to propose to Kendall at dinner. At first, I felt bad because maybe he had planned something beforehand and maybe it was just a huge misunderstanding. But apparently, Jack wasn't even planning to propose to Kendall until we got to the restaurant. He saw how nice the restaurant was, our friends and family were there, and decided \"hey, this is perfect.\" He thought it would help them out of their rough patch (which is a horrible idea because marriage doesn't magically fix relationships), but then Charlie proposed and \"stole his thunder.\" He didn't even have a ring!\n\nCharlie had been planning that proposal for *months*. He's had the ring for six months, made the reservations two months beforehand, invited all of our family and friends. Even the staff of the restaurant was in on the proposal! He put a lot of thought into it and I don't think Jack's heat of the moment decision to propose is more important than Charlie's carefully planned proposal. I'm actually upset that Jack would make something this special and important into something dramatic and all about him.\n\nI didn't apologize. Charlie and I talked about it, he agrees and doesn't think we should apologize.\n\n**THE AFTERMATH**\n\nSince then, Kendall and Jack haven't talked to us. Which is fine by itself, but that's not the end of it. Both of them have been shaming us on social media, twisting the story to make themselves look like victims, and have even coined us \"The Proposal Thieves.\" \n\nMutual friends (and even some family!) are disgusted with us. They believe Jack and Kendall's story, even after I've tried to explain what really happened. As funny as it is to be called The Proposal Thieves, it's not so funny to have friends and family turned against you. I'm really upset that my own sister would do this.\n\nCharlie has been super supportive and sweet through this mess. We both agree that we shouldn't apologize and have been standing our ground. \n\nHonestly, after everything Kendall has done, I'm pretty much fed up with her. She's my sister and I love her, but after she tried to seduce my boyfriend and now this, I don't really have a desire to talk to her anymore. Which sucks, because we've always been close. I think Jack has turned her into this horrible, self-absorbed person and it's just.. ugh. \n\nBtw, I'm **not** talking to Kendall right now and have no plans to talk to her until we receive a sincere apology. Even then, I think I might limit contact if she stays with Jack.\n\nWhat do you think, Reddit? What should we do? How should we handle this? Advice/perspective/anything???\n\n**EDIT**: Thank you for all of the advice! I will **definitely** post an update after we make our post explaining the situation. I really, really appreciate all of the help and support. It means a lot! :) I can't wait to see what a mess actually planning the wedding will be, lmao. See you guys in a week or two!\n\n**EDIT #2**: **JUST TO CLARIFY!** The people who believe Jack and Kendall's story are the ones who were **not** at the proposal dinner! A large amount of mutual friends who weren't there + extended family believe the story. Our parents, Charlie's siblings, and the few close friends that were actually at the dinner **do not** believe the bullshit story. We just haven't made a post addressing everything/telling our side of the story because we wanted advice on how to approach it (which is why I posted here).\n\nTL;DR: Sister and bf are upset that we \"upstaged them.\" Spreading lies on social media. Everything is a mess, please help?\n\n\n",
        "permalink": "/r/relationships/comments/4isc42/my_24f_sister_25f_and_her_bf_25m_are_upset/",
        "comments": [
            "I feel like Charlie should post something to the effect of \"After 6 wonderful years together, I asked koumorinobi and all her friends and family to the restaurant where we had our very first date, and there, at the very table where we sat 6 years ago, I asked her to be my wife. A special thanks to the amazing waitstaff at the restaurant for helping me plan my perfect proposal! I couldn't be happier,\" \n\nthis outlines that it was HIS proposal, and HIS planning and nips all other proposal thievery nonsense in the bud. \n\nAlso, congratulations, you two sound like an amazing team! ",
            "I will now re-enact for you what happened after they left the dinner.\n\nKendall (either in real life, or in Jack's imagination): \"Wow, isn't it great that Charlie proposed! I want to have a marriage like that\"\n\nJack realizes that the pressure is now on. Jack does not want to deal with the pressure. Jack does not want this fight or this problem. He wants to avoid the marriage convo entirely.\n\nJack: \"Well..I was going to! They RUINED it.  Now I can't possibly propose to you, and it's because of OTHER PEOPLE!\" (aaand internal sigh of relief for Jack).\n\nDon't apologize, give them time to cool down, and maybe when your sister is being more reasonable, suggest she talk to Jack about that incoming proposal she's so excited about...you know, the one that's totally happening. Uh huh.",
            ">I texted Jack and asked him wtf was going on. He told me that he was planning to propose to Kendall at dinner.\n\nBULL. SHIT. No way do I believe that he was going to propose that night. After all of their problems? Crikey. \n\nGo no contact with Kendall for the forseeable future. Try one more time with the really important people to clarify what happened, if they are feeding into the drama, they also go to the curb with the rest of the trash. Ignore all of them unless they come to you with a *sincere* apology. And don't invite those fuckers to the wedding. Not even Kendall, unless she apologizes. She sounds like a piece of work.",
            "> \"a disgusting cunt.\"\n\nI'm sorry, I'm having trouble getting past this.  Is this really the way your sister speaks to you?",
            "Write your version of the story. Post once, either on social media, or email the story to the friends that are upset. Emphasize the facts that:\n\n* Charlie arranged the dinner.\n* It was at your first date location down to the table.\n* He'd planned this for months.\n* Nobody's proposal was stolen, as Jack had literally told no one of his plans.\n* Mention that you are baffled at the way you are being portrayed.\n* Your family that was present can obviously corroborate all of this.\n\nTruth and sense have a way of cutting through all of the insane drama and lies that your sister is saying.\n\nYou only have to say these things once. At which point, I think you should cut your sister and her boyfriend out of your lives and try to focus on your new life ahead. It's sad that your sister is so focused on her own misery that she's determined to destroy your happiness, but that's reality right now. And considering that reality, she has no place in your life.",
            "[deleted]",
            "This is why I don't recommend that people \"take the high road\"  and not tell their side of the story. 9/10 times it lets the crazy person put out their story and people tend to believe the first story they are told. Write about how wonderful your proposal was and how much Charlie planned it and how happy your sister was. Then mention how baffled you are that people are accusing you and your fiance of stealing a proposal from a guy with no plan and no ring, and how sad you are at the number of people who are so eager to believe the worst about you two without getting your side of the story. If anyone brings it up to you afterward point out how nice it is to see the true character of certain people before inviting someone to be in the bridal party or to the wedding. Have your parents say something similar and how sad it is that Kendall is spreading lies about you instead of being happy and how much that hurts a mother's heart, etc.\n\nOn that note, under no circumstances have your sister in your wedding party.",
            "This reminds me of The Office, when Jim planned an expensive proposal under the fireworks for Pam, and Andy stole his thunder. Except in this case, \"Jim\" actually got to propose.\n\nSounds to me like Kendall and Jack had an argument after dinner about their relationship and maybe Kendall compared it to yours. So Jack claimed he was going to propose that night in an attempt at damage control and threw Charlie under the bus in the meantime. What an asshole. \n\nAlso if he really did decide to do it last minute, how the fuck was Charlie supposed to know that?! Is Kendall that dimwitted? ",
            "Does Kendall understand that Charlie invited everyone and coordinated dinner?  If Jack were planning to propose, I would have thought he would be spearheading the dinner.  And, you know, have a ring.\n\nIt sounds like Jack is feeding Kendall this story to get some heat off himself.\n\nPerhaps it would be worth it to sit down with Jack and Kendall to clarify the situation and request that they set the record straight with friends and family.  If they refuse, do it yourself on social media (gracefully), then block Kendall and Jack, go no contact, and enjoy your engagement.",
            "I wouldn't apologize, and I would unfollow them on social media. I'd also cut contact until they apologize to both of you. I'm baffled at how they think you stole their thunder at an event that your fiancé had been planning for months and invited everyone to. How does Jack spin that in his favor?\n\nAlso, The Proposal Thieves would make a good band name. ",
            "So, the people there... at the proposal... Don't believe you?",
            "Wow.  The entitlement is staggering.  \n\nHell no you shouldn't apologize.  All you can do is reach out to your friends and family and let them know your side.  You have several witnesses who can corroborate your story.  If people still refuse to believe you, well, there you go.  If hearsay is all it takes for them to turn on you, then they're dicks.\n\nYour sister sounds incredibly selfish and insecure.  What a nutcase.",
            "Honestly I feel really sad and worried for your sister. Jack sounds like a total asshole, and I'm concerned that there may be some flags for emotional abuse.. It definitely sounds like he's trying to alienate Kendall from a relationship with you, and I'd beg you not to fall for it (that doesn't mean apologizing or not maintaining strict boundaries though).\n\nIs it possible she will meet with you to talk about all this?\n\nI'm not in anyway excusing her treatment of you which has been deplorable. But at the very least let her know that youre concerned because she's not acting like herself and you love her and she can come to you if she \"needs you\" (code word = she breaks up with Jack). Then put some distance there until that time comes\n",
            "Wait, does Jack know Kendall tried to steal Charlie? ",
            "I would let everyone know that your fiance organized the dinner at the restaurant your had your first date, he had planned it out down to getting the same table, hat you have no idea that Jack might propose to your sister and that sorry for any confusion Jack may have had. You shouldn't have to apologize but it's probably worth doing that.\n\nYour parents' word should carry a lot too.",
            "Go online and put ONE post up, simple, straightforward, and honest, about your side of the story. How this was a planned proposal and was set up in advance. Say you are very disappointed how so many people are attacking you on what should be a happy day, and you thought better of them than to believe a skewed version of the story. \n\nOr however you want to put it. But if you really want to solve your social media problem you need to put down ONE posting where you take the high road, then don't address it again.  ",
            "This is the biggest bullshit I've ever read (not as in I think it's fake, but just how ridiculous these people are acting). How in the hell can you be a \"proposal thief\" if 1) you came up with the idea first and; 2) you weren't told about someone else planning a proposal?\n\nThose text messages your sister sent are insane. She's acting as if you overheard her boyfriend talking about asking for her hand in marriage (which he didn't since he kept the idea to himself), and then ran over to your boyfriend to say, \"Quick! Ask me to marry you before Jack does!\" Like, where is the logic in any of this?\n\nI'm sorry you're related to such a psycho.\n\nYou need to get your story out there ASAP. Don't let her continue to feed them lies. Tell them exactly what you told us about how he hadn't even thought of the idea until he stepped foot into the door and how the whole get-together was with the intention of your boyfriend proposing to you.\n\nAnd then, don't speak to your sister until she apologizes or literally *begs* on her hands and knees for your forgiveness, because who even does this shit?\n\n&nbsp;\n\n^^Edit: ^^Changed ^^\"you ^^forgiveness\" ^^to ^^\"your ^^forgiveness\".",
            "So, has Jack proposed to Kendall yet? No? Lol",
            "Just came here to say that I don't think your sister is the one that sent those texts. They may have come from her phone, but they probably came from her asshole \"SO\".",
            "Your sister trying to seduce your fiancé would have ended any sibling relationship. That is a huge red flag that she is out of control. ",
            "If you're using real names, this story confirms my thoughts on people named Kendall.\n\nIf you picked this name because you also connect things like this to people named Kendall, that's just as good.",
            "Honestly, anyone who tried to steal my boyfriend, then called me \"a dirty traitor\" and \"a disgusting cunt\" would be cut out of my life forever, blood relative or not.",
            ">She's my sister and I love her, but after she tried to seduce my boyfriend and now this, I don't really have a desire to talk to her anymore.\n\nYIKES.\n\nIt sounds like a terminal case of relationship envy on her part. \n\nAnyway, you and Charlie should just carry on, mention when you can to who you can that he planned it for months. That of course the spot was \"engagement perfect\" because that's what Charlie planned for it. And wait out the rest.\n\n>He told me that he was planning to propose to Kendall at dinner.\n\nJack is a sneaky bastard. He lied. Had this been the truth, he'd have kept his mouth shut and bought a ring and planned an engagement now that he knows he's ready to commit and has a sure signal that she'd say \"yes\".\n\nBut he didn't. What he did was deflect Kendall's anger that their relationship isn't progressing the way she wants it onto you. Now he doesn't have to break up with her, nor does he have to commit to her, they get all the attention of a newly engaged couple without actually committing to being engaged. He did this to shut her up. And unfortunately, it might get worse before it gets better, but eventually the lie is going to come to light, because he cannot put it off forever. ",
            ">Charlie had been planning that proposal for months. He's had the ring for six months, made the reservations two months beforehand, invited all of our family and friends. Even the staff of the restaurant was in on the proposal! \n\nAre you totally sure your sister and her boyfriend know this part? \n\nBoyfriend might have said something half true to her to make himself look better.",
            "Your sister is stuck with an asshole and I really hope she doesn't marry him.  What bothers me the most is that other people are believing their lie.  You need to talk the these people.  Over the phone or in person.  None of that Facebook crap, or texting cop-out. Ask \"Do  you really think we are the kind of people who would....?\"  Tell them about Charlie's plans.  That is all you should need to say.  You don't have to justify or apologize for any \"misunderstanding\".  Lay out the facts and if they've hurt you, you can say so \"I'm hurt you would believe that without knowing the facts\"  The  people you don't care about who are shaming you can screw it.  I beg of you: don't respond to Facebook nastiness, you'll only create more drama.\n\nBest wishes to you and Charlie!",
            "Look on the bright side: now you know that there's a whole bunch of people whom you do NOT have to invite to your wedding!",
            "He wanted a proposal to get them through their rough patch? \n\nNo. He wanted someone to unite against, so he spun a story. Now they're closer, because they have bonded over their shared interests in being assholes. \n\nThere's some great suggestions in this thread, but I think in time this will all become quite obvious. You know, when years go by and you're celebrating your third anniversary and they're still unmarried. ",
            "He had no plan to propose. Kendall got jealous and he lied to make her happy. She's an idiot. Ignore them. ",
            "This version isn't true! I heard that Charlie actually STOLE Jack's ring that he was going to give to Kendall! Charlie also destroyed the receipt and hacked Jack's bank account so Jack has no proof. Then, Charlie invited a bunch of his family and friends to JACK'S DINNER without asking just so no one would be on Jack's side. Charlie even confused the waitstaff and SNEAKILY told them it was actually his proposal right before everyone got to the restaurant. Kendall deserves to be happy you guys, especially after Charlie tried to mess up her relationship by being a charming snake in the grass. Why can't anyone see that??\n\n\n\nSOURCE: Kendall's FB and tarot cards",
            "It seems to me that Jack is just histrionic as ever. He feels the need to make it about him and get upset when attention is directed at anyone but him. Good on you for not condoning such disgusting behaviour. He needs to work on himself and then his relationship with Kendall before making any big life decisions that affect other people. I'm so sorry you had to deal with such children during special part of your life. ",
            "This is some low rent bullshit.\n\nNo invitation to the wedding. They need to get out of their highschool bullshit before they get to be treated like adults.",
            "Make a list of those who believed your sister and her bf. Include your sister and her bf to that list. That is your do not invite list. It can also be a no contact list.\n\n\nCongratulations!",
            "Get you and anyone there on your side in for a joint statement. Like this is a PR thing.\n\n- confirm you booked the restaurant to propose \n\n-confirm you brought the ring in advance \n\n-say you have been unfairly targeted and misinformation has been spread\n\n-show concern for them and say you all hope they can resolve thier problems ",
            "The behavior of your sister and her bf is so beyond the pale that I have to question if the details of this post tell the whole story...  If everything did happen as you have written, I don't think you need a bunch of internet strangers to tell you these people are crazy and toxic and you should excise them from your life.  \n\nBut if your sister is, **on her own**, a reasonable person then I think YOU, a good sister, should take a thoughtful look at her.  She is with a man who managed to twist her up so bad that she called you a disgusting cunt and went no contact because he wasn't allowed to impulsively steal your proposal.  Obviously I don't know them or you, but that sounds abusive to me. Check in on her.",
            "Jack sounds like a real piece of work. Sounds like Kendall might have had a moment of self pity when she got home because she's jealous she doesn't have what you guys have, and jack has turned around and tried to fix things with her by claiming that he was going to propose\n\nExplain your story to your family and mutual friends. 2 key things I would focus on here are the fact that it was Charlie who booked and planned the dinner, not Jack (so how the heck could he have been the one \"steaiing\" the proposal moment) and the absence of a ring. \n\nOnce thats done theres not much else you can do. Once things have cooled down and people start thinking sensibly, I'm sure they'llcome around. Anyone who still thinks you're a \"proposal thief\" is frankly just as crazy as jack is.",
            "No ring = no proposal. Don't let them fool you! ",
            "So hard not to go full snark on this and say \"Sorry I couldn't read Jack's mind and delay the proposal I had been planning for months, with the ring, my friends and family, so that he could go ahead with his spur of the moment decision\".\n\nWhat you can do is tell people that Charlie had been planning this for months, while Jack never said or did anything to indicate he was going to propose.\n\nI'll bet you a million bucks Jack wasn't going to propose, and probably has no intention of doing so ever. Here's what probably happened: Kendall got upset that he isn't committing to her, so he came up with this story to placate her and redirect her anger and frustration at you and Charlie.",
            "Did your fiance do the old-fashioned thing and ask your parents in advance? If so, you've got reliable witnesses who can attest it was his show all along.",
            "Let me add, do not apologize. Apologizing will only make them seem justified/correct.",
            "Get your fiance to get the  receipt for the ring, circle the date and ask your sister where her ring is and when did her bf buy it. ",
            "Jack is a narcissist. I don't know what's up with your sister. But, she is totally in the game he plays and becoming a narcissist herself. I  hope she wises up. Gets out of that. And regains her sense of integrity, empathy, and dignity. Sorry. It's bizarre that your sister is upset that Jack was unsuccessful at stealing Charlie's proposal set up. Wouldn't she want him to make his own proposal. Uug, she needs to break up with Jack. She's just mad that your proposal ended with Jack showing how F-ed up he is.",
            "Those friends and family that believe her should not \nBe invited to your wedding. Too much drama",
            "I was all set to tell a story about how my sister got engaged a month before I proposed (I already had the ring), and how I was happy for her, because *obviously*.\n\nBut after reading the rest of your post, when you're dealing with bullshit of this magnitude it's often better to not even validate it by arguing specifics.  Their anger has nothing to do with you, and addressing their complaints doesn't lead to a solution.  Other than the bare minimum of damage control, I recommend cutting them off completely.",
            "The best way to deal with bad publicity is good publicity. Kinda can be applied here if you think about it.  \nPost something on social media. Make it factual, and don't put any kind of dramatics in it. Just be clear and concise. ",
            "I cut both my biological sisters out of my life and one of my adoptive ones to. Toxic people aren't worth having around even if they are family, Kendall can't blame all the shitty behaviour on this relationship, she does have a brain after all. Everything she and Jack are doing is just fucked up, I would cut them both out of my life and set the record straight through the same medium they're using, don't let them shit talk you when you don't deserve it. ",
            "As far as what others think, the truth will come out soon enough. Be patient. And then be graceful when accepting apologies but be wary of those people from here on out.   \n   \n\nAs for your sister, holy balls, wtf? Is she a raging alcoholic or has she always been so outrageous? Whatever her problem is, it isn't yours to be abused by. I'm sorry. Loved ones do NOT treat loved ones like that. If they do, you can still love them, but be perfectly sound in not wanting them in your life until future notice, on your terms.   \n\nAnd Kendall Jack(son) - I see what you did there...    ",
            "Charlie sounds like an amazing guy and you guys both seem rock solid. What your sister did was incredibly immature and her boyfriend is totally twisting her the wrong way.\n\nKeep standing your ground like you guys know how to. Don't give in to their bs, you did nothing wrong. In this case, they *are* just jealous and are acting incredibly childish. \n\nI hope they either get their shit together or your sister leaves that guy. Really happy for your relationship OP. Congratz on the engagement! Sorry about the sitch.",
            "Congratulations to you and Charlie.  I hope the one post update goes well.\n\nWith regard to planning other peolple have suggested putting a code on all your bookings and I agree.  I'd also be very cagey about what information you let out.  \"Thanks, we've got it covered\", or \"You'll just have to wait until the day itself to find out what colour flowers / napkins /what music we're having\" are good responses to curious people.  Keep everything very tight, I'd even be cautious about telling your parents.\nThe fact that they begged you to forgive Kendall for trying to seduce Charlie makes me wonder what the dynamic is really like in your family.  They might put a lot of pressure on you to invite her to the wedding, and they might throw her the bone of some of your details to make her feel included.\nEven if they act disgusted with her now, people change their minds over time and the reality of one daughter not being invited will be difficult for them.\n\nPersonally I think she shouldn't be invited.  I might change my mind with a full, frank and very public apology, but even then I might not.",
            "I find it pretty damn confusing that Jack would want to propose at a dinner where half of the people there were Charlie's family, who aren't even related to him or his gf. And if they want to get engaged, there is literally nothing stopping them. This is some sad nonsense, but you definitely need to get out in front of it with your story.\n\nJust please, for the love of God, don't make Kendall a bridesmaid.",
            "> At first, I felt bad because maybe he had planned something beforehand and maybe it was just a huge misunderstanding. \n\nYou shouldn't have even felt bad if there *was* some type of misunderstanding hun! The fact of the matter is that your now-fiance is the one who planned this dinner. *He* did all of this, not your sister crappy boyfriend! I could maybe even remotely understand there being a misunderstanding if it was a family dinner that just happened to be where you had your first date, etc., that was planned by your parents or somebody else in your family, that *miiiiiigggghhhttt* be fair game. This was absolutely not that. This was intentionally planned and executed for the sole purpose of Charlie proposing to you and I wouldn't even be surprised if he had told your parents who maybe told them which helped prompt Jack's \"spur of the moment\" decision.",
            "What's funny is Jack still hasn't proposed. He could have taken her to the restaurant later and done it",
            " \"Jack wasn't even planning to propose to Kendall until we got to the restaurant. He saw how nice the restaurant was, our friends and family were there, and decided \"hey, this is perfect.\" He thought it would help them out of their rough patch (which is a horrible idea because marriage doesn't magically fix relationships), but then Charlie proposed and \"stole his thunder.\"\n Sooo this moron is pissed at Charlie for not being able to read his mind and take into account a plan he had just at that moment come up with??? I don't know if he is entitled,self absorbed incredibly childish or just plain thick! He is like a kid who throws a tantrum because HE doesn't get a present at someone ELSE'S birthday party:( ",
            "Oh come on, Jack was NOT going to propose to her. What a lie. He is just saying that to make you guys feel bad. They are both dramatic losers. ",
            "Everyone is quick to blame Jack here, but Kendall was ready to try to steal Charlie away. That had nothing to do with Jack at all. Methinks Kendall isn't an innocent manipulated girl",
            "Block on everything. Then make a post about it. Only one. Everyone who really knows you won't care.",
            "This may serve you as a litmus test for those friends and family you want to exclude from your new married life. Congratulations on the engagement! Cheers! ",
            "Congratulations on your engagement, OP! \n\nI don't see how anyone is buying their \"side\" of the story when he didn't even have a ring. \n\nI would severely limit their involvement in the wedding and wedding planning if you decide to forgive them and allow them to attend. You don't need your sister saying you stole her wedding plans, too.",
            "This will get lost, but you will want to reconsider wedding invites to all of those people that have 'turned against you' without even trying to speak to you and Charlie to find out the real story.\n\n\n\nJust tell them they can go to Kendall's wedding instead",
            "I agree with the one Facebook post. \n\nThen yes, NC with sister and \"BIL\". \n\nAnd congratulations on the engagement xxx",
            "But... How... It was obviously.... And.... *brain explodes*",
            "Thinking further down the line- even if she does sincerely apologize, don't invite her to the wedding.  If she's blown up at your proposal and called you a dirty cunt over it, I don't even want to think of what she'll do at the wedding.\n\nCongrats for the proposal!  I love how you mention \"Charlie and I agreed..\" And so on.  You two are an awesome couple, and deserve to be supported by your friends and family.",
            "My guess is that you're overestimating how many people believe them, because you're so hurt about what they are doing. I'd just respond to every single one of your sister's posts that's shaming you on social media with something along the lines of.\n\n\"To my friends and family reading this. I'm sorry, but what Kendall and Jack are saying isn't true. We did not steal their proposal and I am more than happy to explain what really happened if you contact me privately.\"\n\nIgnore everyone who this isn't sufficient for.",
            "> He didn't even have a ring!\n\nLol, he's such a loser and liar. ",
            "They believed that Charlie (and you) set up this whole thing with the place and the reservations and invited family and friends at your first date place...but Jack had dibs on proposing?  Wow, your friends are really stupid and gullible.  I would send them a link to this post.",
            "Lol Jack's story wouldnt make any sense anyway. Why would he invite Charlie's parents to his proposal? So freaking random. Hopefully you guys have a group picture with Charlie's parents at the restaurant. ",
            "> Both of them have been shaming us on social media, twisting the story to make themselves look like victims, and have even coined us \"The Proposal Thieves.\"\n\nI love the way they treat a proposal like a concrete thing, and there can obviously only be ONE, and if you have that ONE PROPOSAL, no one else can propose, ever.  /s\n\nThey are being so ridiculous I don't even understand why anyone else would listen to them.  Charlie would have had to be able to read minds (haha, like the idea was ever in Jack's head before) to avoid proposing at a dinner he planned and invited people to *for the sole purpose of your proposal.* I mean, that doesn't even make any sense.\n\nSo, yeah, obviously talking about the proposal and the planning Charlie did to set it up is the thing to do here, making it obvious that it had nothing to do with your sister.  I would also consider cutting contact until you guys get an apology from THEM for shitting on your engagement.  Good grief.\n\n",
            "Any chance of an update on this situation? I hope everything turned out well for you! I hope they didn't make what was suppose to be a happy moment sad for you! Late Congratulations to you and Charlie!! ",
            "Don't even consider apologizing that is a ridiculous demand on their part. How are they even going to act affronted by the fact that you were proposed to when jack didn't even have a ring just spur of the moment for him versus your fiancé's months of planning. \n\nIf you can write out the story of your proposal say you want to tell the cute story of your fiancé's proposal and then tag family and friends in it. As soon as the facts come to life your sister and her boyfriend won't have a leg to stand on because who in their right mind would take their side when they hear how your fiance planned it for months down to the table you sat at on your first date.  Then you cut out your sister from your life maybe if she breaks up with Jack you'd be willing but until then you want nothing to do with her.",
            "I'm so sorry this happened to you. It sounds like you and your fiancé have a wonderful relationship though! I think you definitely need to cut sister out of your life. She tried to seduce YOUR man. That in itself is unforgivable! What if she had succeeded in getting him? Where would that have left you? The she tries to ruin the excitement of your engagement?  That's just pathetic. Jack is not much better at all! She is trying to poison family and friends against you and make herself the center of attention. You will be so so SO much better off without her. She will ruin your marriage planning, and will even more than likely find a way to spoil your wedding. She won't apologize. Even if she does she won't mean it. ",
            "What a shit show, your sister and her boyfriend don't sound like very good people. Your fiance does sound like a good guy though. I wouldn't worry much, and I would also cut them out.",
            "OP, I wish you the best in your journey of dismantling this situation and I am very sorry for all the grief your sister and her boyfriend have caused you. I would love to hear an update once the storm has cleared as your story is very interesting! I hope all works out well :)",
            "Pull the Uncle Joey and tell them to \"cut it out\". If they don't listen, cut them out of your lives",
            "It seems their mentality is stuck somewhere between middle school and possibly 16 ? Although usually at 16 there is a more mature understanding of adult interactions and social correctness.",
            "OP, you seem like a smart, self aware, and independent person. \n\nCan't you just cut off the family members that are stupid enough to believe Kendall's story? It's often not worth going down to the same level as that by bothering to participate.",
            "Oh my there pretty ahitty to do that. Good luck with everything. ",
            "A lot of times, when faced with assholes, it's best to put some distance between you and them and just keep on living your life. If any of them wake up from the assholery, they can reach out. If not, it's pointless to spend time & effort trying to manage any of the chaos they manufacture. Life's too short.",
            "Yea gonna have to say don't take the high road on this. If Jack texted you those things saying he didn't plan on proposing till they got to the Resturant and he didn't have a ring....post screenshots to social media and let them try to defend that. Taking the high road doesn't always work. But ay congratulations on your engagement.",
            "Watch out - next thing you know, Jack will claim you're stealing his thunder by having the audacity to get married to Charlie at your wedding (where he will, of course, recognize that by some coincidence, the setting is just right for a wedding ceremony for him and Kendal.)",
            "Tell your side of the story on social media but remember to exclude it from your sister and Jack in the privacy setting. Don't let them high jack your post with silly drama ",
            "Almost this exact situation happened in the office, except on that show, \"Jack\" was the one who got the proposal out.",
            "uh how exactly do people believe their version of the story when you can prove to them your fiance had been planning this for months and had a ring whereas they didn't?  ",
            "In addition to providing your side of the story, post a screenshot of your text conversation with Jack (the one where he admits he had nothing planned). What he is doing is pretty low, and I wouldn't be above to shame him for it.",
            "Everyone who was at the dinner (excluding Jack and Kendall) are the ones who really matter. The other people believing the BS story can rly go eff themselves.  \n\nCongratulations on the engagement!!",
            "This is likely to be buried at this point, but if you see it, OP, remember this:\n\nWedding invitations are not guaranteed for anyone, even family. Maybe remind your sister of this.",
            "So your boyfriend plans out this beautiful proposal for you, and your sister's boyfriend shows up, decides on the fly that he's going to half-assedly propose to your sister, and when half-assing it doesn't work he blamed you guys??\n\nThe first time I read through your post I thought he was the main problem of the situation (i.e. possibly mentally/emotionally abusing/manipulating your sister), but after reading through it again and seeing as how your own sister tried to seduce your fiancé, I think cutting your sister out of your life for a while would be good for you. It seems as though she hasn't actually been supportive of you two this whole time, on top of all of this other bullshit. \n\nBest of luck and congrats to you and your fiancé! ",
            "Emphasize why your fiance would invite his family, your family, and your mutual friends to the restaurant where you had your first date, for your sister's boyfriend to propose\n\nAlso see if your parents will reinforce the true story to the extended family.",
            "Just wait until she shows up to your wedding and then gets upset that you had the gall got married, when the beautiful venue and flowers and dinner would be a great opportunity for her to get married!",
            "Ignore they will break up and blame your proposal on it.  Do not give them a platform to talk.  Start planning your wedding!!!  Put up pictures of brides, wedding cakes honeymoon destinations on your facebook/ pinterest.",
            "My friend Liz actually had something similar happen with her and her finance, BUT they were the Kendall and Jack in the situation. Let's see how it SHOULD have been handled.\n\nLiz and her boyfriend Fred have been together for years. Fred was planning on proposing on a family summer vacation. Liz's brother ended up proposing right before the family vacation to his girlfriend. Instead of being all butt-hurt, Fred just delayed a couple months until Liz's birthday. This is a logical response. Fred was a little bummed because he was so excited and had been waiting months already, but he also respected Liz and her brother enough to not try to steal the spotlight from him.\n\nNow, Fred had actually been planning for month. I doubt Jack was. What probably happened was, after dinner, Kendall complained about wanting to get married and how nice the proposal was (because really, it sounds fantastic. Props to Charlie), and Jack panicked. \"Well, *I* was gonna propose because the restaurant was so nice and it seemed perfect, but then Charlie did it first!!\" I would be astounded if he had actually thought about proposing.\n\nKendall wants to get married. Jack doesn't. Jack has now been able to move all the blame onto you and Jack. Give Kendall some time. Maybe she'll come to her senses, maybe she won't. I would just put out a blanket-statement about the proposal, and start cutting contact with the people who are blaming you and giving you grief. That's all you can do at this point.",
            "So did Jack end up proposing to Kendall anyways? ",
            "Wow, Kendall and Jack are children.  How can you be to blame?",
            "Your sister is a jerk and so is her boyfriend. The whole thing where they accuse you guys of stealing Jack's proposal idea is laughable because he didn't even have a ring ",
            "Anybody who doesn't believe you, cut them out of your life. Your sister should be told unless she stops this and apologizes that you'll cut her out of your life. Calling you up and talking to you that way by itself is unacceptable.",
            "So you have texts from Jack admitting he put no thought into the proposal till he got to the restaurant? Boom post those on FB along with /u/n4yhi7i5m's comment.",
            "What a jackass...... \"This seems like a nice restaurant.... maybe I will enter into a sacred commitment with this girl who I barely get along with, plus, Chicken Parm. What a great day!\"\n\nI am an sarcastic asshole, so I would send stuff like that to your sister until she realizes her BF is a D-Bag. Or cuts you out, Win win.",
            "It amazes me how much damage jealousy does.  It must be the center of so much evil. ",
            ">I will definitely post an update after we make our post explaining the situation.\n\nLIES!  ALL LIES!  ;)  Seriously though I hope you guys are doing okay now that the dust has (hopefully) settled.",
            "It's been a few months - What happened after you shared the REAL story with your family and friends? ",
            "Fuck them and tell the truth and have Charlie post something about arranging the entire thing. It'll shut them up. \n\nAlso, ignore my username, but I wanna go to the wedding! If some of your family won't go, then surely the family of reddit want to!! I am good with BBQ'S! Who is with me!!!?",
            "I don't have any advice, but congrats on your engagement :-) You guys sound like a great team. ",
            "Do nothing. Not one thing. Just wait and their relationship will die on its own and she'll come sulking back.",
            "RemindMe! 1 week",
            "She tried to seduce your boyfriend and you came back from *that*? lol.",
            "I can't believe Kendall and Jack will think Charlie stole the thunder. He basically came out the ideal like 5 secs when he got to the dinner party, which won't even exist if Charlie didn't organize it. And it would be weird if he proposes after Charlie. Wanna propose? Organize ur own event! ",
            "Ohh boy good thing you didn't announce you were pregnant lol \n\nCongrats by the way :)",
            "Is it normal for people to propose in front of their close friends/ family ?",
            "Out of all the posts on reddit...... this is literally the worst case of shitty ass people. Like, who the fuck even does this kind of shit? ",
            "RemindMe! 7 days",
            "Your sister has taken up residency in Crazytown.  I'd worry she is having some sort of mental break because she's being beyond stupid.  Keep on keeping on and she'll come around and apologize sooner or later.  ",
            "Make a post on Facebook! Make it public! Tag your insufferable (and mentally ill- she needs help) sister and her manipulative boyfriend. That's what I would do.. No one is going to smear my name, especially at the happiest time of my life. ",
            "You could always just reply calling her the attempted boyfriend thief? Shame her for trying to seduce Charlie. That way, you bounce them back. Also, ask where the ring was for Jack, and ask who arranged the meal, then post proof it was Charlie. That way, they look absolutely moronic. I'd then not talk to anyone taking their side as they just aren't worth the effort",
            "The situation sounds awful ): I hope it works out for you. I agree with everyone about posting something about how hard Charlie planned the engagement and how excited you are. Looking forward to the update.",
            "So.. All these \"friends\" and Family are believing your sister and her BF over Your Parents and his(I assume they were there?)? and your close friends? Sadly if they are taking her version over yours, They are being Gullible and buying into her Drama...",
            "I'm going to address the situation with your sister. When I was 17 I dated a real self-absorbed asshole who in turn made me pretty self-absorbed. I didn't do things like what your sister has done but I just sort of checked out of everything going on with my family. The relationship between me and my family faltered, obviously, and there were a few disputes until finally things boiled to a head and they sat me down. They told me my behavior was disrespectful and I was straight up shunning my own family, and if I wanted to be that way I could just leave the family altogether. At the time I still didn't think I was acting poorly, but I knew I needed to make changes to maintain a relationship with my family. I cut the guy out of my life, shaped up, and have had a great family dynamic ever since.\n\nI couldn't imagine losing my sister the way yours is drifting away now. Sometimes the path from valued friend to total jerk is a gradual slope, and she may not realize just how far she has strayed. If you want to salvage that relationship, I would lay it all out on the table for her; everything she has done, how it has made you feel, and how things will be in the future if she doesn't make changes. Be direct; she gets her act together or she loses you as a sister. Hopefully that'll wake her up, but be prepared if it doesn't.   ",
            "Don't invite anybody who believes them to the wedding and when you make your wedding tape title it \"proposal thieves.\" And send fifty copies to your sister with an attached note saying \"Sister, I am SO happy you and your bf could NOT make it to the wedding!\" ",
            "Kendall and Jack sound toxic - delusional and defeatists.",
            "This post reminds me of Law & Order for some reason.\n\nWe need to get Dick Wolf up in here.",
            "If it were me, I'd write up what happened (something very similar to this post) and email/snail mail it to everyone who has turned against you. I'd include something like, \"I don't want to ask you to take sides, but here is what really happened. If you still choose to be upset with me then so be it. At least I tried to clear the air.\"  Then leave it at that. If they still choose to be upset then you'll have to just let it go. Maybe one day they'll realize they were mistaken and come crawling back. Maybe not. You just focus on your future with your fiance. ",
            "Personally, I say call them out on their b.s.  especially ypur sister with trying to get with your finance.  Can you use your parents as a mediator?",
            "Is there a social media platform where you can reach all of these people? I would announce the engagement and also find a way to incorporate details about how Charlie carefully planned and arranged everything. And I know you said you and your sister used to be very close, but to an outsider, she a) puts her boyfriend and her selfish needs ahead of her family b) is jealous c) has tried to sabotage your relationship with Charlie. Have you told her that Charlie planned this for months? Picked the restaurant, a place which held a meaning for you TWO together, invited everyone, and arranged all the details with the restaurant staff? It might fall on deaf ears but I would still find a way to communicate to her that Jack is actually the engagement thieve here, not you, and that you're sorry she's putting her relationship with him ahead of her family. I would then go no contact with her immediately and let her know to never speak to you, ever again. Even if she does end up becoming a better person down the road she needs to understand that what she did here is grounds for NC and she is losing a sister and a friend in the process.",
            "don't invite them to your wedding. he's probably going to try and propose to her there because all the friends and family will be there and they will try to steal your thunder like you apparently did to them? just my take on what might happen...",
            "Let them be butt-hurt. How childish they are. ",
            "What do your parents say? Did you tell them about the text Kendall sent? About what Jack's parents? Sure, your parent's understand, but they might need to talk to Kendall, because Jack sounds like an asshole of a bf, and maybe they can talk sense to her since you \"stole her thunder\". Is she naïve? Because she believed Jack's BS story that he was planning on proposing to her.",
            "i scrimped and saved for years before i got the perfect ring for my gf, all the plans, getting family together, asking her father etc...it took so long. \n\ngranted she said no and moved all her stuff out last week... but that's not the point. \n\nyou dont just decide to propose like that. it really speaks to his character that he didnt think \"I should buy a ring and start planning\" it was \"oh i should propose. hows about....now? this seems nice enough\"\n\nalso wernt they invited there? \n\n..what kind of jackass proposes at someone else's event? ",
            "It makes me sad that you have to refer to your wonderful proposal as \"the incident\". I think that clearly demonstrates that the people in your life who make you feel this way are toxic. I wouldn't worry about the people in your life who are choosing not to believe tour story over Jack and kendall. The truth about jack will reveal itself in time and hopefully your sister will get out of that relationship. ",
            "RemindMe! 7 days",
            "Just delete your facebook, start a new one for your new married life, and don't follow anyone that doesn't come to the wedding.  Don't invite anyone causing drama to the wedding.",
            "something missing. how did your family turn on you again?",
            "Calling your sister a cunt is so low. I hate that word 😡",
            "Your side of the story is so convincing that the fact people believe them suggests there is more to this story you have let on.",
            "firstly get off social media. If u post something and it turns for the worst just let it be, just that the higher road. walk away from your sister and her toxic boyfriend.If she decided to believe in his BS that's her call. you just sit back and watch their relationship go kaboom. Meanwhile enjoy your time with Charlie. ",
            "Wow there is way more to this I feel like that we're not getting. Would really love to hear the other side of the story ",
            "Calm down and take a chill pill. There are more actually important things to concern yourself with than this petty little dust up between sisters. First, your sister is in a bad relationship and could use a bit of level headed advice from you, as in dump the narcissist and go find a group of friends who matter. Second, turn your attention to your future. You have planning, buying, decorating, inviting and a lot of other things to hand at the moment. Too bad Jack is butt hurt, send him a nice parting gift.  ",
            "Post on social media asking proof of the ring if Jack was really going to propose."
        ]
    },
    {
        "post_id": "3jwyi0",
        "author": "throwawaydadgivenup",
        "title": "I (57m) feel like a terrible father for giving up on my son (33m) but he's put our family through so much, is it time to say enough is enough? UPDATE",
        "url": "https://www.reddit.com/r/relationships/comments/3jwyi0/i_57m_feel_like_a_terrible_father_for_giving_up/",
        "score": 2965,
        "num_comments": 217,
        "created_utc": 1441585631.0,
        "selftext": "Original post:- https://www.reddit.com/r/relationships/comments/3jcs46/i_57m_feel_like_a_terrible_father_for_giving_up/\n\n\n\nSo I went to meet my son yesterday. 9:30 AM. He didn't show up. I waited for 3 hours before leaving and this evening I get a text asking if he can come home. \n\n\nThe hardest thing I did was reply no. I told him if he wants, I will spend money if he sincerely wants to go to rehab. Other than that, please refrain from contacting his mother or sister and not call me or message me unless it's an emergency. I told him that for years he's been draining his family, his baby sister hates him, his mother is broken and I gave up at 12:30 sitting at that cafe yesterday.\n\n\n\nI told him when he's sincerely ready to fix himself, I'll be there but not any other time.\n\ntl;dr hoped he would show, he didn't",
        "permalink": "/r/relationships/comments/3jwyi0/i_57m_feel_like_a_terrible_father_for_giving_up/",
        "comments": [
            "[deleted]",
            "I think the most heartbreaking thing to read is the fact that even though you told him you would only wait 30 minutes, you still held out for 3 hours. I'm sorry, OP, but if it's any consolation I think you're doing the right thing.",
            "[deleted]",
            "You made the right decision OP. For a while, I was your son. I was a good kid and made good grades; my dad always told me he was proud when I was growing up. But as soon as I was on my own, I got into drugs and they took over my life. Within a year I was stealing from my friends and family and only coming to my parent's house to rest up.  During that time in my life, no one could make me change. Even when my parents forced me into rehab, it didn't stick. In fact, a week after rehab, I stole my moms debit card and emptied her account.  \n\nThey eventually cut ties with me, and not having that safety blanket made things just bad enough to want to clean up. It took a while, but I eventually did. When I reached out to my parents and they saw I was sincere, they welcomed me back, but it took years for me to be able to forgive myself for what I put them through.\n\nOne of the top comments on your original post says that your son will never be the same again. That's not an absolute fact. I was a meth addict for years, but after I cleaned up, I graduated at the top of my community college class (I gave a speech at graduation and everything!), and went on to attend an Ivy League school. It's completely possible that your son will one day put this behind him and lead a fulfilling life. \n\nYou did good letting him know you'll be there as a resource when he's ready to live his life again. Until he decides to, it's out of your hands. \n\nEdit: Thank you for the gold stranger! ",
            "As the little sister of a former heroin addict you made the right call. My parents weren't strong enough to cut my brother off, and he put them through 13 years of hell. ",
            "I dated a heroin addict for about 5 months (15+yrs user). For what it's worth I think you've absolutely done the right thing. He is probably using the family home as his comfort place and 'safe' spot to withdraw, then go back to using again. It's sad but true, you just can't believe anything that comes out of a heroin addict's mouth, they are too unreliable. \n\nYou sound like a great dad and husband, good on you for protecting your wife & daughter from more heartache.",
            "My brother in law passed away a few weeks after his 23rd birthday. He died of a heroin overdose. He died in his childhood bedroom, alone. The parents thought they were a unified front but his father wanted to give him a place to stay and would sneak him in. Mom had no idea. \n\nMy wife beats her self up even years later because she had cut off contact years before. She would give money and do what she could but there came a point when she realized that nothing would change if he didn't want it.\n\nMy BIL was an addict and would promise up and down that he was going to change just so he could get close enough to use or steal what he wanted. \n\nYou can beg and plead but if they don't want to get help it won't matter. Letting them hit rock bottom isn't wrong of you. Letting them hit so hard that they bounce twice and realize what they are doing isn't wrong either. \n\nBe strong, tough love isn't a bad thing. ",
            "My ex husband was so drunk and coked up towards the end of our relationship that I didn't know who he was towards the end. He wasn't the man I married anymore. I know this has to hurt, but you have to look out for your wife and daughter now. Your wife will need you now more than ever. I want you to know it will be ok. Maybe not today or tomorrow, maybe not even next year, but one day the burden of his issues will no longer be on you and your wife. Maybe this will be the step that gets him help. I am so very sorry for you and your wife OP. ",
            "Hey, if you're ever in Toronto, I'll buy you a beer and listen.\n\nYou've done one of the hardest things a father could ever have to do, and you'll need to remember that you did this *for* your son, but he did it *to* himself. \n\nYou're a brave man. Braver than I would be in your situation. You're doing the right thing. Nobody knows how it's going to turn out, so there's no point in me being unnecessarily optimistic. But you're doing the best you can, and that's all you and your family can expect right now. \n\nTell your wife and daughter what happened, and then quietly take some time to mourn. \n\nTake it one day at a time.",
            "YOU NEED A SPONSOR RIGHT NOW!\n\nThis always happens with addicts.  To preserve your sanity and your family's sanity while helping the addicted, you get a sponsor from narcotics anonymous or alcoholic anonymous.  They know the dance that the addicted do, and how to deal with the lying, the hurt feelings, the loss, etc. \n\nSeriously. Your best bet in both helping your son and saving your family from mental anguish is through a good sponsor. Hint: they will basically show you how to 'lovingly detach yourself and your family from the addicted, and only help him when he is truly ready for help'. You cannot save him without him wanting to save himself. Get a sponsor. ",
            "My brother is 31 and hasn't worked for over 3 years. My parents completely support him financially, enable the hell out of him, and don't deal with the issue because it's been 15 years of fighting with him. Mom and dad let him come around to every family event, every time I'm home, and it's exhausting. My dad has a heart condition and it's going to put him in the ground eventually. I have virtually no relationship with my brother. I don't have any answers for you beyond I know how burnt out you feel.\n\nHe deals with mental health issues and copes using alcohol, weed, and hiding in gaming. Everything is a fight, there are no casual conversations. \n\nI'm sorry OP but at least this way, you keep some of your sanity.",
            "You did the right thing. My only suggestion is not to send him any money directly. If you are going to pay for rehab, pay the rehab itself. Any money you send, well I think you know how that goes. \n\nhugs to you. ",
            "This is exactly what I was hoping your update would not be.  You did the right thing even though it is probably agonizing.   I'm so sorry. ",
            "I know it's heartbreaking...I have done it with my own son. But in the long run you're doing what's best for you all. ",
            "OP, wish you were my dad. **You are a good man.** Much love. ",
            "Please look into AL-ANON for you and your family. You did the best you could in this situation. I hope for the best for your son and your family.\nAnd yourself.",
            "Good for you. Hold your bottom line! This is the best thing you can do for him and yourself.",
            "You did the right thing. I was a social worker and a therapist, and people with substance abuse problems will have trouble getting clean if their families enable them. They need to hit rock bottom before they see that getting clean and staying that way is the better option. It's not an easy thing to do, but in cases like this, it is the right thing to do. Explain that you are always there, ready to help, but that you can't support the choices he is making.\n\nMy mom had to do this. My grandfather was an alcoholic who was abusive. He'd be sober for awhile, and then he'd fall off the wagon - he even fell off the wagon at my mom's wedding. Four years later, she was pregnant with her first baby, the first grandchild (me), and she stated point blank that while she would stay in contact with her dad, he would never, ever meet me. He passed away two years ago, having been sober for 33 years. Were it not for the consequence my mother provided, he might have continued bouncing between sober and drunk his whole life. He was an amazing granddad and a good great-granddad. We were always really close. It's hard to imagine him as an abusive alcoholic, and while my mom does exaggerate, he really was one, and it's hard to reconcile the kindly old grandpa with the drunk asshole father. It's a dichotomy, and I'm lucky to be on the happy end. We were close enough that I identify as Serbian-American, even though my family (both sides) have moved around so much that you could throw a dart at a map of Europe and hit at least one country some ancestor lived in. This is all because my mom put her foot down and enforced consequences. Wanna meet your grandchildren? Go into recovery. It sounds simple, it's hard to do, but it works. At 50 years old, with 3.5 decades of being an alcoholic, my grandfather got his shit together. If he can do it, your son might be able to do it too. ",
            "I know this is heartbreaking but do keep in mind that you are doing the best for him. It might not be in the sweetest way, but he has to face harsh reality to help himself.",
            "God this is heartbreaking, OP.  Just know that you handled this the absolute right way - firmly setting boundaries, but still keeping the lines of communication open when or if he decides to get clean.  If you need to talk to someone, feel free to send me a PM.",
            "You're not a bad dad, this isn't something you did wrong, and it's okay that you can't do this anymore because frankly this is your son's journey that he has to figure out himself. There nothing you can do to make it better. I'm sitting in a sea of substance use disorder research, films, workbooks, memoirs - I work at a facility and am getting my councilor's certificate. If you ever want some direction in where to look to maybe understand where your son mentally is right now, feel free to PM me.\n\nI've also been on your side of having a substance dependent person in my family. Its so maddening to watch them spiral and seem to not care at all that they're dragging everyone down with them. Honestly? I'd rather be around my hundreds of clients trying to pull themselves out of the hole of addiction for 8hrs a day than spend one moment in a room with my active use uncle.\n\nLook out for you first. You did your best, you really did. You're not alone by any means - perhaps look for a support group for parents? I'll be thinking of you and your family. \n\nEdited: paragraphs.",
            "Oh how heartbreaking. YOU are a good man. I would have never waited 3 hours. Stay strong! ",
            "As a recovering addict who put my own family through the ringer for years I agree that you have done the right thing. The people I've known who were enabled and never cut off have rarely gotten better.",
            "I've been sober since May off opiates, my family cut me off and gave me the same ultimatum. I knew I would have a family and a home again if I could just stop using. And right now I am doing the best I have been in years, I'm volunteering with animals and even got a pt job. I think you're doing exactly what your son needs. As long as he knows that when he's ready to get clean you'll be there, that's the best thing you can do for him.\n\nCheck out Al-anon, or nar-anon if there's one around. A meeting is only one hour long, and you don't need to share if you're not comfortable. But trust me, it will take a weight off your shoulders knowing that you're not alone. *hugs*",
            "You did what was best to protect your family. Best of luck to you all ",
            "This seems so terribe and I am so sorry for you and your family, but it seems you are doing what's right by you and the rest of the family.\n\nGood luck and I sincerely hope he seeks help.",
            "I really hope this doesn't get buried. I'm really sorry to hear about your son OP. As a drug addict in recovery I know how difficult it is to get to the point where accepting help is a possibility. You should check out al-anon groups in your area it should help you deal with all of this that is going on, it has helped my father greatly ",
            "You can't help someone that isn't helping themselves. You are only enabling them. Tough love is still love. I hope eventually he turns it around. ",
            "I divorced an addict who refused to get help. Ironically, they left me first. It took some time in counseling to realize how sick I had become. \n\nYou're doing the right thing, as hard as it is to realize it right now. ",
            "I'm so sorry. But he did this for himself, and you're doing everything you should - keep him from your family, and be there for him the day he decides to sober up.\n\nI hope that you know that you did the right thing. I hope your son will realize that.",
            "You cannot help the unwilling, as I found out dealing with my alcoholic mother. It's tough realizing they don't want to fix themselves, and eventually you have to draw the line to preserve your own heart and sanity.\n\nCutting off your son means protecting yourself, your wife, and your daughter. That makes you a good father and husband.",
            "You did the right thing, no matter how hard it is. At some point he will hit rock bottom and realize the changes he needs to make. You've done all you can for him and now things are up to him. I'm so sorry your family is going through this. I can't imagine the pain you're going through. Sending internet hugs and positive thoughts your way. I wish you all the best.",
            "All I can picture is my dad as I red this. For what it's worth, you're doing the right thing. I know that doesn't make it easier, but you won't do any favors for him by helping him anymore. I'm sorry if that's harsh, I wish you all the best, I know how hard the road forward is.",
            "What kind of fucked up disease has symptoms that make the victim protect the disease at the expense of so much suffering for everyone involved? Addiction. Fuck it. Lost both parents to it for different reasons. My mom tried hard to stay sober for me, but my dad lost me because he didn't try at all.   \n\nI can only suggest that you remind him addiction is basically a disease of the brain and he needs medical treatment and therapy to overcome it—that no one expects him to beat this alone. ",
            "I am a parent of young children, and hope to never have to face the situation you are in. It takes an amazing amount of love and strength to make the choice you did. Although it doesn't feel like it, you just showed that you love your child enough to say \"NO\". No I won't let you kill yourself. No I won't let you destroy your life. \n\nHe needs boundaries. He needs people in his life willing to say no and to stop enabling him. Once that is gone, he can finally look at himself in the mirror and stop making excuses and justifying his lifestyle. Only when that is gone can he truly assess if he wants to change. \n\nYou love your son enough to say no. And I admire you. I can't imagine having the strength to do it. You just did one of the hardest things any parent could ever face. It's the right thing, even though I'm sure it feels all wrong. \n\nI wish I could be there to listen and hug you and your family. Why don't you try getting to an AL-ANON meeting? Or perhaps a counselor who specializes in addiction issues? I think seeking some perspective and closure would be critical for you right now. ",
            "I'm your son. Not really, but I mine as well be.  The stories are all the same aside from some acute details that make it unique and differently interesting.  \n\nAddiction is something that you or anyone will ever fully understand by experiencing it.  I didn't read the original, so I don't know what he's on, but I'm just gonna guess and say it's opioids.  Those are the main drug that seems to destroy families and want almost 60 year old men to help their boy out like he's still 12.  Only that dragon can turn a 40 year old into a little baby.\n\nI woke that dragon, I think it was born inside of me, infantile just like myself.  Time passed, quickly, and one minute I had this incredible life, friends, loving family, money, tons of choices for the future, super hot girlfriend, and most of all, I was happy.  I was confused about life and could find myself in a depressed state when I started philosophizing too hard about the insanity of \"living (whatever that is)\" on a ball of rock, water, and other living things of all sorts.  This ball we're on is currently at it's cruising speed of around 26,000 mph on this repetitive oval, or orbital path, around a giant yet very small ball of flaming gas we named the sun.\n\nThe depressiveness comes in when I think about how fruitless and futile our society is.  Concerned with one thing only: To produce and consume stuff for a trading note we call paper.  It's grown so big and fast that there's really only a few people in control of it.  So we get jobs that pay us money to spend on things that end up in the pockets of the people who paid us to do our jobs.  And that's just supposed to be it.  That's \"life\".  \n\nMy point is, I became a junkie after having what I thought and what most people think a \"good life\" is.  I didn't start drugs to escape from that thought of an insane society, but I kept doing drugs to escape from it.  It made it easy to forget about.  Grocery shopping could be fun.\n\nDrugs, or opioids in general are fantastic at providing this sense of comfort and confidence combined with the most perfect level of numbness you could ask for.  You were numb to stupid, and wasteful, and political, but if your best friend just died you would feel that, at least for a while until you started using more to try and numb that pain away. \n\nFrom age 24-26 I spent over $100,000 on heroin.  Money from a trust set up for me to pay for school that turned out to be very successful during my first 21 years of life as I think it started as $15k when I was born.  By 21 had everything I wanted or needed, but I also wasn't outlandish.  Nobody in my friends knew about it, not even my girlfriend.  I used it for school, and worked for rent and food and if ever in a jam I could use it to help out.\n\nFast forward and after several years of tuition and rent I've got 100k left.  By this point I'm taking around 5,000mg's of hydrocodone a month (10/325's - little yellows) and now the dragon is still sleepy, but now I have awoken him from an eternal sleep he planned on. But really every 3 weeks I'd run out, so I'd go through w/d hell for a week until I could get more.  Sleepy dragon wasn't happy, but too  sleepy to do anything about it.\n\nFinally I told my family.  They understood and were supportive and said Rehab.  2 days later I'm in rehab toughing out a gnarly addiction.  28 days later, feeling like a million bucks I'm freed.  Then about 10 people died in 2 weeks, all good friends of mine. A \"Friend\" from rehab came over, said he could get opium.  \n\nThat's how I woke my dragon to a full state.  And man, he was cool.  The opium was just cut up heroin sold in a college town under the idea that opium would sell easier.  Who knows, I was hooked, and if 5,000mg of hydro sounds like a lot, let me tell you how quick 100k can vanish when you have an unlimited connection of heroin.\n\nExactly 1 year and 4 months later my bank account was now -6,000.  I was smoking it.  I was buying it once a week and spending $2,000-4,000 each time.  \n\nThe money ran out, the dragon became very angry and in withdrawals he's great at guiding you to salvation. First it's overdrafting my account as much as possible.  Then pawning everything I own, then stealing from my family (nothing was off the table).  If it had value I was going to take it and pawn it and go get dope. I wrote myself a few checks from Mom's bank, then from girlfriends, and all at once it caught up to me.  7am until 12pm one day I had over 140 missed calls all from girlfriend or parents.  \n\nI called back, begged and pleaded not to call the cops.  I swore I'd make it right.  Parents paid my girl what I stole, kept her from the cops.  Parents just wanted to be done and said bye.\n\nSo I'm living in my car in Denver in the middle of winter.  Hustle hustle just for a 20.  Gave up hope, wanted to die.  Tried a hot shot about 6 times only to wake up a day later dope sick and out of money.  Hadn't showered in a year.  Somehow stayed out of trouble.  Stayed away from the other homeless, stayed isolated, stayed high.  \n\nThen my sister called on my prepaid virgin mobile phone I had, it had 8 mins left.  I told her to make it quick after realizing who it was.  She asked to meet for coffee, I was sick and had no money, so I said yes thinking I'd have some chance to get cash from her.\n\nCoffee was weird.  I was sick. She knew it.  She asked me to get help, that all I had to say was yes, but that it was not going to be like before.  I had imagined this moment the night before laying in the back of my car re-reading one of a few books I had.  At one point I felt a glow of warmth, it felt like hope, but then I let it go.\n\nToday was the day, the day that little flicker of hope I had inside of me would be tested.  \n\nThat was in 2009 (March).  I just had surgery a few weeks ago, but up until then I have not had a narcotic in my system since.  It was a lot of tough work, still is. The surgery and drugs didn't wake the beast and I haven't had anything for over a month.  I don't crave them anymore.  That took at least 4 years to happen. \n\nI did start out in 12 step and stopped 3 years in.  I quit counting my days and just remember that day I rode on an airplane looking and smelling like a bum.  \n\nYour son is me, he's just a bit older, but it doesn't matter.  He's got a beast that is in control and what you've done is the best absolute thing you could.  You shared your love and support of him and offered him help if he'd take it.  That's not turning your back on him.  That's all you can do, and I want to thank you for doing so.  I would check in on him every now and then, you might catch him at a time where the beast is busy and that glimmer of hope is making him feel warm. \n\nI'd like to add something I feel is important to address. Rehabs in this country are money making machines.  They employ ex patients, they have very little concern for anybody's well being and they charge an amount that should be illegal.  If you have money to   spend on rehab I suggest you speak to someone who knows the system really well and isn't invested in it (like me), or know that your son still only has a tiny percent chance of making it.  I was in a small rehab, mostly used for detoxing, but they had inpatient for 4 clients and I was one of them.  I met 100's of people coming in to detox and then off to rehab nearby.  I knew every rehab owner, every person in the program with more than 3 years, and every single newcomer as I was one of the first people they'd meet.  I've seen every rehab owner relapse.  Every person after 3 years would also relapse, but it was rare to ever see someone get that far.  Between 1 year and 3, I don't know if I ever saw one of those relapse.  They were in it and committed.  Just know rehab is a fucked up place to send a junkie.  It's full of other junkies that know things you don't.  You'll learn more about drugs and how and what to do in rehab than you ever will anywhere else.  Almost everyone there on a 90 day stay will relapse, a few times.  They will do it in groups.  \n\nIf your son says yes, you better have a plan, because that yes can turn into a no really quickly.  Give him some cash so he can not be sick.  And reach out to me PM if you'd like to hear more or want some more advice.  I'm sorry for what you and your family are going through.  Just know that your son is going through something even tougher.  Waking up every day wanting to die is an experience that you can't just imagine, you really have to live it to understand its power.\n\n**TL;DR:  There's hope, I made it out somehow and haven't taken illegal drugs since 2009.  It's been a tough road, and there's lot's of lessons that can be learned now, and many that can't be learned until later.  But I came back from the dead, and I'd love to help anyone who needs it.** ",
            "So I don't know how much this will help...but here are some things I've learned in my 25 years on this planet.\n\n1) My dad has a very addictive personality.  He went into the army at 17 because he hated school and wanted out. Did well and got out after a 2 or 4 year tour of some sort. He drank somewhat before the army....but partying became his life after the army.\n\n2) With parties come drugs and if you're not responsible...you will get in trouble. My dad had a huge coke habit by 25. He was 26 when I was born and my mom though he would get his shit straight. He did not.  Location changes only delayed further involvement with drugs.\n\n3) You will get caught doing something stupid to fund your drug habit.  For my dad...it was a meth lab. He got arrested on his 33rd birthday.  I was about to turn 7. \n\n4) Jail cleaned him up....from the coke anyway.  He threw himself head first into work and now owns a successful online business. Hasn't touched drugs in quite a while, as far as I know. Jail helped him take the step of getting clean. I have no idea what helped him stay clean.\n\nYour son needs a make or break rock bottom event. You might be able to provide it by cutting most if not all of your support.  I can tell you now that if he comes to you for rehab it will have a better end result than if you give him the ultimatum of something crappy or rehab.  He NEEDS to choose getting and staying clean on his own.  While jail provided my dad the opportunity....something in him realized he needed to get clean. He tells me he knew he would die if he stayed on the path he was on and jail kind of shocked that information into him.  I don't know, I wasn't there or old enough to understand what he truly was going through.\n\nI hope your son has his rock bottom moment before the drugs kill him.",
            "For what it's worth I was given a very similar ultimatum by my parents. I was much younger but, the misery I was bringing about in their lives was no less tragic. The final straw for them was finding a large quantity of drugs in my stuff. I was told I was going to  rehab or I would be cast out of the family. Initially I left. I didn't last long before realizing that without my family I didn't have much I cared about. That was over a decade ago, married, kids, career the whole nine. Life turned around for me, let's hope the same for your son. Most important is to know that you did not cut him off, you have given him a choice that protects everyone involved from further harm. You did the right thing, he now has to make that difficult decision. The relationship you have with him going forward is in his hands.\n\nTl;Dr\nYou didn't cut him off, you made him choose. This is a good thing, your a good husband, father, and person. ",
            "I'm sorry you're going through this OP, but I think you've made the right choice.  ",
            "I did a similar thing except the roles are reversed. I tried to get my dad to rehab and he told me to kill myself. It sucks, I know. ",
            "Damn. Sorry man. ",
            "I'm sorry OP, I've grown up with addicts, I've felt the anger, the helplessness and the fear... I know you're trying to help him. Good move, stay strong. ",
            "I can't begin to imagine the internal debates you must have had with yourself through all the years. Good luck, OP. Maybe you find a tiny bit of peace from this very hard decision you made.",
            "You have done everything you can do. There's a book called \"Beautiful Boy\" by David Sheff that you may be interested in and if I remember corrrctly it may list some resources for families of addicts. ",
            "My brother is a recovering heroin addict. I'm proud to say he turned his life around 180 degrees and has stayed clean for 8 years.\n\nBut my family has been in your shoes, and you did the right thing. You have to stay true to your promise to cut off contact. If he truly wants to get clean, he knows he has to come to you.\n\nThe last time my brother told my dad he wanted to get clean, there was no hesitation in getting him to rehab--I'm talking that day. There was no staying at home for a minute to collect his things, because there was the chance he'd just take off again. So maybe have a plan like that in mind?",
            "If it counts I basically went through this with my brother, and am now a father. I watched my dad basically do what you did. I remember waking up one night while by brother on one of his benders was yelling and screaming, waving a gun around and threatening to kill my mom. \n\n\n\n\nHe stormed out and came back later that night and passed out. My dad put him in the car, packed 1 duffel bag for him and drove him to the halfway house in town. He had woke up by the time we got there and put on an indifferent face. My dad's last words to him that morning were \n\n\n\n\n*'Don't come home until you've fixed your problems. We're not helping you any more.'* \n\n\n\n\nToday I'm a father and I can't imagine how my dad felt. Telling his first born child, never come home unless you can come home properly. I can't imagine how you feel. I wish the best for you and your family. I hope you can all heal. \n\n\n\n\nAnd if it offers any hope my brother got clean eventually. He was an alcoholic and frequently did coke. It took some time. I want to say close to 6 or 7 years. ",
            "I hope you can find the strength to get through the angst, worry, and depression the next few days, weeks, and months will bring.  It will be hard and you will question your decision many times over (as will your wife and daughter).  But know in your heart you are doing what is best for all involved.    This will be one of the toughest periods in your life, but know you will get through it.  This too shall pass no matter the outcome..\n\nI type from experience....  I have a troubled son as well, and I go through hell each time I reach  the mailbox.",
            "OP, as a family member who has seen this happen first hand the best you can do is let him figure things out on his own. It's hard because you know they will go through a hard time but after a certain age you gotta stop bailing them out or they will always rely on you.\n\nDon't feel like you're being selfish because it's not a matter of them being a burden but rather giving them the opportunity to live through the consequences of their own actions and become a mature grown up human being. It will be hard, and there may be times when you feel like they've changed and they reintegrate themselves into the family, only to have a relapse and go through everything all over again. It's a huge strain on the family financially and emotionally and to be honest, it's not fair to the other siblings.\n\nWhat happens is they become the collateral damage because they don't get to experience a life with happy and content parents, and they always live in the shadow of this sibling who is a well known fuck up.\n\nBest of luck to you and your family, but you must stand your ground. Offer to help him get PROFESSIONAL help, and only after that should you extend any other offer.\n\nYou can't change a person who doesn't want to change themselves.\n\nBest of luck.",
            "you did the right thing.  my brother struggled with drugs and mental illness, i wish someone had put their foot down like you are doing.  it's the best thing you can do for him.",
            "Please know you are doing the right thing. My family was torn apart by drug addict cousin who started robbing banks and anything really. He has spent more of his life in jail than out but out he causes havoc and almost killed my mom.  I told him if he EVER contacts or tries to see my mom or any of my family, I will kill him myself.  Haven't seen him in over 20 years but still have to block his number.  its awful.  \n\nYour situation is even worse and I am so sorry.  There is no greater pain, cutting off a child. But your life is important and to live a healthy one, with your wife and remaining child.  Please cut off all contact to save what you have left",
            "Dear Sir,\n\nThank you for posting this- both the original and the update.  It was interesting to read the perspective of a parent in this type of situation, and helped to put a few things into perspective for me.  The situation you describe about how your family has suffered through your son's actions is, I feel, fairly accurate as to what my parents and sister have gone through with my own struggles with drug addiction and mental illness.\n\nAddiction is a selfish disease, and that selfishness destroys relationships.  This then can become cyclical; the further damage done to relationships by the addict results in the desire to mask the negative emotions such a disruption causes.\nI myself couldn't see past my own difficulties and problems, had no capacity for empathy towards friends and family who tried their best to help me.\n\nIf your son truly wants help, and to make positive changes in his life; it is up to him to do it.  If my parents had continued to offer me shelter because they believed it to be the right thing to do, it would have only enabled me further, and not inspired any desire to turn myself around.  Recovery is something the addict must do for himself- and only they can can make that decision.\n\nYou still love your son, don't lose faith in that, but sometimes loving someone means letting them go.  Hopefully, he may realise what his actions have caused and start on a better path.\n\nMy family instituted a \"tough love\" approach, much like the one you are currently experiencing and I am blessed that through the work I have done to change my life that this relationship is well on its way to being mended.  I wish that I could guarantee the same result for you.  In the meantime, you have done what is best for your entire family.\n\nMy sincere best wishes that this situation resolves itself to the best interests of all involved- even if that may not be the resolution you hold as ideal. ",
            "Interesting, I had a friend in his 30's die of heroin overdose just a few weeks ago. His name was Ryan. It's hard to get people help that aren't ready for it. I just hope your son doesn't run out of time before he's ready to get help.",
            "What a difficult situation all around.  I was wondering, if you don't mind, providing some additional insight and context?  What research you've done into addiction and mental health?  Is there a family history of addiction or mental health issues?  Did something happen at University that could lead him to medicate with hard drugs?  What kind of medical treatment, if any, has he and your family engaged in as a result of his addiction disease?  Hope you find some compelling and informative opinions in everyone's replies.  ",
            "My heart goes out to you and your family. You did the right thing, sometimes tough love is the only way.\n\nMy girlfriends mom should have done that long ago with her brother, but she can't. He's been to rehab twice ( his father out him there) but mom would go get him when it got hard. He put the family things hell, stealing money and valubles to sell in order to feed his habit. Eventually his father left because he couldn't handle the stealing, drugs and how he couldn't get through to his wife. \n\nHe's since alienated his entire family, including mom. The sister hates him, the grandparents won't let him in the house. he finally crossed the line with mom when he stole her new boyfriends truck, drove it across the province and went on a wild bender without returning anyone's calls. He did this to a man who wanted to help him, let him stay in his home and borrow his truck to go to work. \n\nMakes you wonder what he would be like today if mom had giving him tough love.",
            "My heart actually clenched when I read that he didn't show up. So sorry for you, hope he gets the chance to come to his senses and wise up. \n\nBig internet hug. ",
            "Don't feel terrible, their is nothing you could of done to stop your son from going off the deep end.\n\nAs a guy who while growing up had all the ingredients to become an addict (addictive personality, abused and beaten as a child) the only person who could of stopped him is himself, sometimes we misjudge what our own bodies can handle. (I can handle weed but I know 100% if I tried harder stuff I would go off the deep end, including alcohol) \n\nI think you did the right thing, you have informed him that he is no longer welcome while still giving him the option to redeem himself. Every thing he does from this point on is for himself and on himself.\n\nStay strong op, even if it's just for your wife and daughter and know that this random guy is rooting and thinking of your family! ",
            "You're forgetting what a good father you are to your Daughter and a good husband to your wife.\n\n",
            "I'm sorry you're going through this. I just recently found out about a cousin putting my aunt through a very similar thing. He almost wasn't allowed to come to our Grandmothers funeral because he couldn't be trusted around family and friends. \n\nYou're not a bad person. You've left the door open for help when he's serious about rehab and getting better. You have to take care of yourself and the rest of your family. \n\nI guess I want to say you aren't alone and I wish you the best. I hope he gets clean and you can all rebuild, but mostly I hope you find peace. ",
            "So much potential wasted. Some people walk the line and fall, only to never make it back. It's not your fault and I think you did the right thing. \n\nMy deepest condolences. ",
            "You could very well be my relative.  I took in my cousin (35) last year.  He had been living with his mom in a no future area.  I thought if he could come to a place that offered jobs and people his age he would do well.  He has a medical condition that causes pain but he uses anything and everything.\n\nIt took one week.  I was missing medication.  Then my husband was missing medication.  Then there was money missing and more medicine.  Then our safe was broken into.  His mom still believes he doesn't have a drug problem.  He isn't living with us anymore but I saw him about a month ago and he looked rough.  Really rough.  \n\nOP I hope your son and my cousin wake up soon.  Both had so much going for them.",
            "I am so sorry that you are going through this, but for what it's worth, this internet stranger thinks you are doing the right thing. but as a mother I know that this is heartbreaking for you. ",
            "You handled this perfectly.  I'm very sorry for the grief you and your family are suffering.  ",
            "I was engaged to a heroin addict. Not the same situation, as he wasn't directly related to me, but I figured I'd throw in my two cents.\n\nHe didn't get serious about rehab until he lost everything -- our engagement, all of his friends, and his family. A few weeks after I ended all ties with him, he was in Florida at a sober living home. \n\nLast I heard he's back with his family and is talking to his old friends again. I'm under the impression that he's clean and taking care of himself. Sometimes tough love is the only thing that works.\n\nDon't second guess yourself. You made the right decision, absolutely.",
            "This breaks my heart more than any story of failed romantic love ever could. I'm so sorry :(",
            "Go to Al-Anon meetings. They're for people who have family/friends who suffer from addiction. They can be a big help.",
            "I'm so sorry.  As a parent, I know how hard it must be to be here.  \n\nYou did the right thing saying no, though I know its the hardest thing.  Having boundaries is going to be the only way to not let him take the rest of you down with him, because until he gets clean that is all he is going to be doing unfortunately.\n\nI hope your son finds peace and gets clean, and I hope you remain strong enough to keep you and your wife and daughter from his collateral damage.   Thoughts and prayers, sincerely.",
            "I am a heroin addict who's been clean for a little over 4 years, but is no longer active in any sort of recovery, or treatment, other than taking a maintenance dosage of a 2mg Subutex tablet, every other day. look into the possibility of treating your son's opioid addiction with a partial opioid receptor antagonist, like Zubsolv, Suboxone, or Subutex, they're all buphenorphine. Which partially antagonizes opiate receptors; subduing cravings, with only a limited euphoric effect. I can honestly say that without bupe, I would almost certainly have returned to intravenously injecting heroin every few hours, in order to stave off severe physical withdrawals.\n\n Opioid withdrawal is like having the worst flu you could possibly imagine, multiplied by ten. Then add in the constant psychological torture of knowing that you can instantly end your suffering with one shot, with one line, with one hit. That is heroin addiction. By the end of my 4 year dive into utter, and complete despair, I could not even achieve the numbness...the escape, that I so desperately craved. I was shoving old, dull needles into my arm, and injecting myself with poison just to prevent sickness.\n\n Only by incarceration was I able to achieve sobriety, and even after my first stint in an institutional treatment center, I almost immediately began shooting heroin again. The second time I landed myself in incarceration, they chose to forgo the treatment, and sent me directly to a medium security prison, which I spent 13 months in. I learnt my lesson that time. That may be the experience your son needs...it will certainly change his perspective on life, one way or another. \n\nAs someone who put my family through hell; who lied, and lied, and lied to the people I love...someone who stole and stole and stole from the people I hold dearest; I can almost guarantee you that your son is filled with regret and remorse in regards to you, and the rest of your family. That he wishes he could change the way things are between you all, but he can't...he just cannot escape the darkness that is addiction, and the sad thing is those feeling of regret and self-hatred only feed that all-consuming black hole of nothingness and disparity he calls a reality..I can say this with a high degree of certainty because I *am* your son.\n\n Although not literally, everything you described your son as, all the turmoil you experienced..they are identical to my life. \n\nI hope your son can find some sort of peace; wherever it may be, and I hope you get your son back, and the peace you, too, most certainly deserve.",
            "Remember when he was really little and at the park he wanted to go on the big kids structure but he wasn't ready for it developmentally so it was dangerous and he screamed and jumped around and begged and tantrumed because he wanted up and you wouldn't pick him up and put him on it because you like... didn't want him to die...?\n\nThis is the same thing. This is good parenting. You aren't responsible for lifting him onto the big kids' play structure. That's not good parenting.  Sometimes good parenting is saying no and walking away. ",
            "I'm so sorry for everything you're going through.  Remember you and your family deserve more than this life your son has inflicted upon you.\n\nPlease look into an AL ANON group. Hopefully you can find solice in others who have shared your situation. You have so much strength, I commend you for your efforts. Good luck",
            "Im sorry. I can't imagine how painful this was for you.   Just know that you did the right thing.  maybe it will shock him into getting his life together.",
            "I actually think cutting him off is the best thing you can do, especially for someone this old. \n\nDon't send him cash. If he needs money for something important to get his life together then buy it yourself. Don't bail him out of jail if he lands himself there. ",
            "Got to let addicts hit rock bottom unfortunately.",
            "You're a good Dad.  :)",
            "You've done your best and everything you can. The ball has always been in his court. It must be so painful for you.",
            "It's good you love your son. It's time to realize your son is 33 years old and therefor also a man. As a man has to handle his own shit. Don't wreck your life trying to fix his.",
            "You did what was best for the rest of the family--and for him.  Hope everyone is on the same page with you.",
            "I'm so sorry you're going through this. I know from personal experience that it's such a heartbreaking thing to stand by and watch. My family and I are dealing with the same issue. My dad is 57 as well and my brother, who is addicted to heroin, meth and alcohol, is 34. I'm his younger sister, I'm 23. Our household's seem eerily similar. My heart goes out to you. \n\nPlease know that you are doing the right thing. It's hurts like hell and it feels like your abandoning your child, but that's not the case. You're doing what's best for you, your wife and your daughter. Any professional who works with addicts will tell you the same thing. You must cut all ties until they're ready to get clean. If only it was easier said then done. \n\nPlease know that there are a lot of us out there. You're not alone, OP. I sincerely hope the best for you and your family. Please stay strong. ",
            "I'm sorry things didn't turn out as you hoped. I realized recently that you can't expend all of your emotional energy on someone who constantly takes. You can love them with all your heart, but it's impossible to help them with an emotional debt. At that point it's only detrimental to your own life.\nI hope that he comes around and accepts your offer of rehab, but don't beat yourself up about his decisions. You've done everything you can, & then some. ",
            "Some people won't change until they die and there's not always a way to help them. You tried your best.",
            "Sorry to hear.\n\nAt least you put out your willingness to help if that time comes. In the mean time you need to work on you and your family. Getting things back on track with you guys and doing whats right for getting back to normalcy.",
            "Addiction is one of the nastiest things. You are handling this the best you can. As others have said, he's an adult and needs to fight this battle himself. He's going to have to find the will to fight it from within and not from an outside source, so it's good you cut him off because while your family has been trying to help, it's just helping him stay high. He has been comfortable. I hope you're able to stand your ground when he inevitably tries to get something out of you again,  but I do understand how difficult all this is. I just wanted to send my support I guess. My big brother has battled with a heroin addiction. It put my family through some shut for a couple years but he seems to be doing good now. Knock on wood. I wish my dad was here so I could get pass along some of his advice, I'm unfortunately not as wise as him. ",
            "God damn. My best friend got into heroin and OD'd the night before his wedding. He'd been to rehab multiple times but all it really seemed to do was lower his tolerance. It's unfortunate, but nobody can make you get clean. It really does have to come from within. I'm sorry that your son's put you through this for so long and I think you're making a smart decision by telling him not to contact you unless he's truly done with the drugs. I also hope that if and when the time does come you and your family are able to forgive him for all of these years. Addiction makes you do some fucked up things and I wouldn't wish it on anyone. I've seen the nicest people go down that path - I really don't think anyone's completely safe. I'm not the praying type, either, but you and your family are definitely in my thoughts.",
            "He is an adult and has to face the consequences for his actions. I understand that it hurts your family to let him just leave your lives, but it's best for your mental (and potentially physical) well being.   \n\nPlease don't change your mind and take him back in. He's had MULTIPLE chances to change his ways. He made his choice to go back and continue to dig himself an early grave.     \n\nHe will only change when HE truly wants to get help.",
            "Hey OP, it sucks you're going through this.  My brother is a heroin addict as well, though he started younger than your son.  Really smart, phenomenal at anything mechanical.  By far and away the hardest thing my family had to do was to set up boundaries and maintain them.  We still talk to him (in fact, talked to my bro a bit today), but it's difficult.  I think the worst part is that we can tell there's a part of him that wants to get better.  Every year or so he'll do something dumb and end up in jail, go through rehab, and for a bit he'll be fine but eventually just relapses again.  Recognizing that for what it is is difficult.  Things will seem to be looking up, and then you'll find out he stole from you again, and it's another disappointing betrayal.  You don't even get angry, you're just sad because you're hoping this time is the one that sticks, and it doesn't.",
            "Recovering alcoholic here:\n\n\nThe only way he will ever truly benefit from recovery is if he enters with no reservations. You have no idea how many people I've seen come through rehab or the halls of AA just because their parents \"made them\" only to go back out and twice as deep.  It's painful but you must completely sever ties and let him hit his bottom alone. sink or swim. \n\nDon't take this the wrong way but you are actually enabling his addiction. Although his actions are his own, you enable him to continue making them. This is because he knows he always has a security net to fall back on.  \n\n\n\nIf you really love your son I recommend you attend some \"alanon\" or \"narcanon\" meetings. These are for the families/loved ones of those suffering from addiction. You will learn about how deep this disease really goes and the co-dependency/ enabling behavior which it thrives off of.   You have have to be strong\n\nWe stood at the turning point, half measures availed us NOTHING.\n\n\nGood luck OP and if you ever need someone with a little experience  to talk to pm me and I'll give you my #. \n\n\n",
            "You are being a good father by finally saying once and for all that you will not support your son as he self destructs. It's up to him now to do the right thing and fix himself, I hope he does.",
            "This made me cry. You even waited 3 hours for him and he never showed up. Im an addict too and my dad will not kick me out, he tells me he made a promise to my (deceased) mother that he would never give up on me, and he truly hasn't. Even back in the day when I asked him to just kick me out of the house and he wouldn't. You are not a bad person or a bad father for doing this. You are merely a strong and also loving person for waiting as long as you did when you said you wouldn't. You are not making a mistake. When your son is ready,he will get help or truly, sincerely ask for it. i know its cliché, but you cannot help someone who doesn't want to be helped. It will happen in time. I wish you the best of luck and to stay strong for the rest of your family. ",
            "Good for you OP, time to make him learn to swim or sink.",
            "You don't need another person saying it, but be a father first. You cannot support his habits. You also cannot force him to get help. You can try to lead the way, and offer support in correcting his lifestyle. Its sad to see, but he has to make the decision before help can be had, and all you can do is let him know you will be there when the time comes, and willing to help.",
            "Reading your original post, I kept wondering if you were my uncle. Their family has always been the closest to me of my non-immediate relatives, and I still care about each of them.\n\nThe oldest son is in a bad way. Every now and then, some detail of what's happening to him trickles down to me. A few years ago, he was in a chinese prison.\n\nIt's... like a solid chain tying him to the lifestyle. He'll come home, clean up and break the habit, but then the chain grows taut and drags him back into the lifestyle. I don't know what it's like. Maybe he has more choice than that implies.\n\nI hope things turn out all right. I hope that one day, your son manages to clean himself up for good and resume the life that was once so promising.",
            "I'm sorry. \n\nYou're a good father. \n\nThis isn't your fault. \n\nThis is NOT your fault. \n\nWhat you're doing right now - setting firm boundaries and sticking to them - that is being a good father. You're doing what you have to do to protect yourself, your wife, and your daughter. \n",
            "Hi OP, My parents had the exact same problem with my sister (she is older than me), I can tell you they did everything possible to help her. The decision you made was the right one, you have to protect yourself, and your family, and if this means making this kind of decisions then you have to do it. ",
            "It would be so easy for me to say that if my son was caught up with addiction issues that I'd drop him like the bad habit he suffers from.\n\nThe truth is I don't know if I could do it.\n\nThe hard fact is though you HAVE TO DO THIS - PERIOD. If they keep playing the same game they will keep playing it. And the end result is that your miserable. They keep on doing their addictive behavior.\n\nMy stepdaughter just lost her step brother (its complicated) to heroin very recently. He was in his early 20's. Had a kid with a girl who moved away so she could stay clean. The Mom kept taking him back in and listening to the bullshit. And so she walks in one day not too long ago to find him OD'd with the needle still in his arm. (My stepdaughter not the Mom). \n\nNeedless to say - now the game of would've, could've, should've - anger, guilt, and remorse starts happening. \n\nAddiction doesn't just affect the person doing it. It affects EVERYONE around who cares about them. \n\nThe thing that sucks the most? The drug addict believes the lies they make until it becomes the truth. Then there is no truth or lies. Just this blur of getting to that next fix - no matter what.  Until they either hit that bottom and decide to get help. Or die. \n\nOP did the best thing he could do for his family and for his son. There is nothing else that he could've done. And he stuck it out for much longer than he possibly should have. \n\nDon't give up hope though. I celebrated 20 years sober this past June. And I thought I was a lost cause and there was no way in hell I was going to draw a sober breathe. \n\nI hope that OP's son finally drops that shovel and decides to get help. And I hope that if he calls his Dad and asks for help. I hope that day happens. I truly do. ",
            "Tell him to get his shit together. He doesn't need to be babied. There are plenty of folks in this world who were probably in a much worse situation and still managed to come out on top. He's old enough to realize right from wrong, he doesn't need anyone to hold his hand for him anymore. ",
            "I've gone through this with a family member. Rehab has cost $35K in less than a year, but it's the best money I've spent. \n\n\n\nHe's been in three levels of care: residential hospitalization for 60 days, 90 days intensive outpatient (house with an on-site manager and a few other io residents, drug testing every day, individual and group therapy, supervised outings for shopping, a series of steps to achieve privileges such as a phone and unsupervised pre-arranged outings), and several months where he is now in sober living (part-time house manager, unsupervised outings, daily meetings, drug testing, and residents must be employed). This process is working so well. He is happy, healthy, and learning how to actually live a life.\n\n\n\n\nGoing to rehab, getting clean, and then just coming home never worked for him. He was back to old habits within days. He never knew how to function, how to operate in the real world. This longer, more practical, stepping-stone approach is working. It's like a miracle, except that he's worked for it every step of the way\n\n\n\nDealing with an addict is emotionally, physically, mentally, and financially draining. You live with the knowledge that the next phone call you get could be the one telling you they've died. You walk around your home and count the missing items they've stolen from you and pawned. You don't want them to starve, but you know that any money you give them will go straight into their drug of choice. They can not see their own problem. Their brain is disordered. \n\n\n\nMy family member went into this current rehab process straight from an involuntary psych hold. The police took him because he was a danger to himself and others. He detoxed from heroin for three days in a shitty, scary psych ward, and was too sick to protest inpatient rehab at that point when the family offered it. He accepted. \n\n\n\n\nHe knows he can never go back to certain places, never see certain people (even some family members, because they're untreated addicts) ever again. In the past, as soon as he had the chance, those were the first people and places he ran to. \n\n\n\n\nI'm sorry, I'm rambling, but I do have a point in trying to get out. You're doing exactly the right thing right now. Tough love, no enabling, you've got it. I guess what I'm trying to say is that if he accepts your rehab offer, please help him look into what's available for him after rehab. Intensive Outpatient. Sober Living. See, it's not just about getting clean. It's about learning how to actually live, and staying clean. Building a life that makes them think twice about using again, knowing that they'll lose it.\n\n\n\n\nPeace, love, and comfort to you and your family. ",
            "You need to read the book Chasing the Scream to understand how this has happened ",
            "I made, so hopefully your son can make it! One thing for sure, when he does get clean be there for him because the amount of guilt & realizations of I screwed up is huge! You instantly realize how precious life is and to waste it on drugs is the worst. ",
            "Hello OP.\nMy brother-in-law was a heroin addict and no matter how much we tried to send him to rehab, he would just escape. We thought of getting a court order once to send him to rehab but it just does not work until the addict makes up his mind.\nWe all stopped giving money and left him to his own demise.\nWhen he turned 27, something triggered in his mind and he came on his knees begging to be taken to a rehab.\nWe chose one that was very far from home. He finished his 1 year and came out clean. Found a job and is doing ok.\nOne thing he mentioned to me when i met him much after and was comfortable to chat about that period was:\n- I asked him if he does get tempted to take just one last shot.\n- He answered yes, he does, everyday but then he would remember how waking up was. He always felt so shitty in the morning and feeling like a total loser and he really does not want to go back there.\nDrug addiction made him into a very low self-confident man and that's the toughest thing he is fighting against until now.\n\nGood luck OP. Drug addiction can destroy life but sometimes there is hope that things might get better.",
            "it's a difficult decision but you made the right choice. Sometimes you can't help somebody until you let them go. Many times people will not have the desire to seek help until they hit rock bottom. Sometimes this is enabled by being a crutch for them to fall back on. It's painful watching a loved one go through this process but it seems you've done everything in your power to help him.\n\nStand firm and be there for when he's ready to get help and through the process of getting better as he'll need support. Until then you need to stay strong and have faith he'll make that decision to seek out help. ",
            "You're not being selfish, you're just refusing to enable his addiction and positively reinforce bad behavior. Once he knows he doesn't have daddy and mommy or ANYONE to save him, he'll hit rock bottom and that's the only time he'll ever decide it's time to get help and get clean.\n\nI recommend going to a support group for people who have family members with addiction issues, at the very least it'll help you and your family resolve some of the internal conflict and feelings you all have about this.",
            "There's a Canadian doctor called Gabor Maté that works with addicts in Vancouver's East side. I found his lectures and books to be a source of comfort in understanding how this can happen. You can probably read them for free online, or find his lectures for free. ",
            "He needs to really want to change for himself. You should've pushed him away a lot sooner. In life weakness is punished greatly..",
            "You did the right thing.  I'm sorry you're going through this.  Know you're not alone- I hope you seek out the help you need for yourself.",
            "For what it's worth, a colleague at my old work eventually realised that her relationship with her son was abusive and violent in a manner that, had he been her partner instead, would've been immediately recognised as domestic violence.\n\nAfter numerous attempts to deal with it through a series of slowly stronger steps she realised he was just going to stay at home, live off her, play games, and get violent whenever he didn't get exactly what he wanted. No matter what. She landed up calling a locksmith, changing the locks, and informing the police.\n\nShe gave this guy (35) many, many chances to shape up, with increasingly firm warnings about the consequences.\n\nOf course she was pretty broken up about it, but in the end she had to recognise that he was making his own choices at this point, and that she'd done all she could.\n\nWe can second guess her parenting etc as much as we want. We weren't there. Her other kids are fine, and FWIW I think this guy is just a bit broken - maybe some developmental issues, physiological anger problems, etc. He was totally unwilling to engage in any efforts to help, though, and couldn't be forced to.\n\nSo hey. It could be worse.",
            "So he started turning to drugs when he no longer had the comfort of family? He sounds fairly intelligent and Heroin use usually points towards more introverted people, (the extroverts tend to find their soulmate in cocaine). \n\n\nMy personal opinion is that he needs to talk to someone. \nHe needs a psychotherapist probably more than rehab.\n\n",
            "As a former HOPELESS ALCOHOLIC, the best thing my mum ever done for me was hit me with the TOUGH LOVE..  At first I was in my head, FUCK U, u don't know how hard it is, being me..  The usual story of a person in addiction, and I do struggle every day, still 14 years later, but I have been clean and sober though, and worked hard on cleaning up my life, relationships, debts, and all the other stuff that comes with living that lifestyle..\n\nIf it hadn't of happened the way it did, I don't think I would have ever gotten to rehab, or had this second chance at life..  \n\nSo don't beat yourself up, until someone really gets to a point of desperation, they won't seek to change..  We call it ROCK BOTTOMS, and generally is what's needed to shock u into a wanting or needing of changing your lifestyle..\n\nIt's a disease/illness of denial, and I do feel for all of you, your son living that life, and also all the family having it to deal with too..  I honestly thought when \"out there\" as we call it away from recovery, that I was only hurting MYSELF..  So far from the truth..\n\nPrayers for you and your family, hopefully it changes, but YOUR SON needs to have had enough.. And you cutting him off may be the ROCK BOTTOM he needs..  ",
            "A friend of mine's son go into heroin, and they let him come home.  He ended up ODing in his bed. :(\n\nGood luck with your son, and I hope he manages to beat his addiction.",
            "There is a podcast called Jay and Silent Bob get Old, the first four episodes are Jason Mewes and Kevin Smith recounting Jasons drug history. It's maybe 4 hours and spans probably 20 years, you should listen to it, its incredibly powerful. It's an insight into addiction like you won't get anywhere else.",
            "You did the right thing for you and your entire family.",
            "This all sounds very much like my oldest sister. She got pregnant in high school, was married and divorce at a young age, had decades of going on and off heavy drugs, several abusive boyfriends who she would refuse to leave, lost custody of both her children (one of which lived with us for about 3 years before custody went to his father), and stole from nearly everyone in the family or alienated them some way.\n\nNow my mother, this sister was an adopted child from my mother's first marriage and didn't have particularly strong ties to my father or his family, tried to do the tough love thing for probably close to ten years and cut all contact. However, my grandmother undermined my mother's wishes and continued to enable her drug habits and generally sleazy life style. It wasn't until my grandmother died and her last scumbag boyfriend was literally found dead in a ditch that she started to seek help and straighten out her life. By this time she was close to forty, I think.\n\nOn the upside, she now really has her life together and is doing pretty well for herself. She's been clean for several years and has a good relationship with my mother.\n\nI guess the moral is, it can get better. However, your whole family HAS to be united in the tough love approach. If aunts, uncles, grandparents, anyone continues to bail him out or enable him nothing will change and he'll only blame you guys for his issues.",
            "Almost 10 years ago. I was hooked on drugs and stealing from my family and using anyone I could. My father let me move home. Stole money out of his wallet. He told me if he couldnt have his wallet in his own home, without fear. Get the fuck out. Sat on the curb, waited for a ride. Never did drugs again. ",
            "Yeah, this is tough, but you did the right thing. Offering moral and emotional support along with offering to pay for rehab are great ways to support him without being taken advantage of.\n\nIf he ever wants to get sober to change, you will be there ready to help him in the right way.\n\nJust be strong and don't get roped into supporting his habits or lifestyle.\n\nGood luck.",
            "I can't even imagine how hard that was for you. But you are absolutely doing the right thing. Nothing will get better, nothing will change until *he* wants to. Maybe seeing how much he's hurt his family will make him want to get clean, or maybe it won't. But at least you aren't contributing to his addiction, or torturing yourself and your family by laying down and letting him tear you all apart again. Be strong.",
            "I'm sorry, OP, I was really hoping that he would show up and discuss how he needs and wants help. I hope for your and your family's sake that he gets clean and comes home one day.",
            "I can only imagine somewhere else around the world where in a similar situation a father hands his son a 9 mm and tells him, \" You know what to do\".  A shot later it's over and the family situation gets better. It's sad  to think that situations like that happen have to get that bad.",
            "You tried. You can't fix it for him. You are not a bad person.",
            "You shouldn't feel bad. Dudes 30, I'm in my early 20s right now and if I was messed up in my 30s I hope to god my family would stop helping me. You did the right thing as shitty as it seems he's a grown ass man and by 33 should know how to behave like it.",
            "I'm so sorry, that must be crushing...",
            "We all have our breaking point.  This was it for you and your family.  Focus on your life and rebuilding it without your son centering it.",
            "I worked for CPS and we often had grandparents fostering their grandchildren whose parents were addicts. You need to make rules. You need to have a code and you need to stand by it. Don't let them manipulate you or twist your arm in any direction.  Someone mentioned that people have different thresholds for what \"rock bottom\" was. Don't be surprised by how low someone would go to get an edge over you. For your family's sake, you need to have structure or framework that guides how you interact with your son (I.e. No money, only food, maintaining boundaries, calling police when necessary). It's easier to cope when you have a framework, so find support group that could help you make that.",
            "Please make sure you and your wife are on the same page regarding boundaries. He may contact his mom and play on her sympathy to get money or a place to stay. You and she need to be firm and together on your resolve to cut him off until he sobers up.",
            "I cannot even begin to actually know what this feels like, but, I feel compelled to say my heart goes out to your family.  Forge forward with what you do have, and stay strong.",
            "I hope we get some good news out of this eventually, but I'm proud of you for setting some boundaries. Sometimes we have to be at our lowest before we finally decide to fix ourselves for good. ",
            "I'm so sorry that you're going through this. My heart goes out to you.",
            "Probably one of the saddest stories I've read here. Sounds worse to have your son get addicted to drugs than to just pass away. In the latter, at least you can be grateful hold memories in a positive light. Sending your family including your son my best wishes.",
            "I was recently in a very similar situation, OP. My ex is an extreme alcoholic (although he's allegedly recovering now, after going to rehab), and after draining me emotionally, physically, and financially -- along with his family -- for years, I had to apply some tough love. I ended our relationship and refused to be his crutch anymore. It was one of the hardest decisions of my life, and I can't even begin to imagine what it must have felt like for you as a parent. Stay strong, OP. They say one has to hit rock bottom before they can begin to climb back up. Sending good vibes your way.",
            "Honestly don't feel bad... My parents wouldn't even pay for rehab and I had to continuously yell and yell at them to even help me get into an outpatient that was free from their insurance. And in the end they were so unsopportive I stopped going half way through. Thankfully I haven't used in a year but don't feel bad about cutting him out he has to want to change in the end.",
            "I can't imagine how difficult it is, but you're doing the right thing. Anything else is enabling his addiction. He needs help and he has to make the choice to get it. ",
            "\"I will never give up on you, but I will give up on your willingness to change\"\n",
            "Im a recovering heroin addict. Like everyone's said, boundaries are very important. You are not a bad parent for cutting him off or wanting to. That usually will just enable him, so taking all steps in order to not enable his behavior and addiction is very important. Sometimes thats the bottom people need to hit in order to get help.\n\nI think its great that your offer for rehab is on the table. It truly is extremely hard to get into treatment if you have no insurance or way to pay for it. How long were his past stays in rehab? Were they out of state?\n\nIf you ever need advice or have questions, please feel free to message me. I've been where your son is, and I've also worked in treatment. I'd be happy to help any way I can.",
            "A parent is only as healthy as their sickest child.\n\n:(",
            "Looks like it's already been said and I doubt you check this, but I just wanted to say that you did the right thing here. I was in the inverse situation - son to an addict. I just recently severed ties with my father completely, for good this time. It's been 10 yea for me too -  no more. Hope you and your family are doing ok",
            "As a son who had been here, DONT GIVE UP. Regardless of how you feel, regardless of his actions, regardless of anything anyone else can say, HE NEEDS YOU. Maybe not today, maybe not tomorrow. But I hope the day will come where he recognizes that he does. Don't lose your love, ever.",
            "Sorry to read this story, OP. I am also sorry I did not read your original post... Oh well. Anyways, here I am throwing my hat in:\n\nIt appears you son is mainly addicted to heroin. He also most likely mixes it up with cocain (speedball) from time to time, and he is also most likely doing benzodiazepines. That's your typical opiate addict cocktail. Whether I am right or not does not really matter, as long as we know that he is hooked on heroin/opiates, ie: the worst drug on the planet.\n\nWould you \"give up\" on your son if he had cancer? Of course not. Well, your son has a terrible disease called Addiction. Do you know who is the very first person who knows and wishes he was not afflicted by that disease: your son. That fact, I am 100% sure of. He wishes he was not caught in that death spiral, because a death spiral it is, and he knows it - life expenctancy of habitual heroin addicts is under 20 years, from time of first consumption. I know, I know, 95% of people in society do not believe it is a disease, but a growing body of science, as well as on the field experience tend to prove it is. One caveat, not all drug consumption is \"addiction\" (the disease), but habitual heroin consumption IS addiction in ALL cases.\n\nThat being said, addiction is most often linked with a) mental illness, b) unresolved personal/family issues.\n\nWhen one is addicted to heroin, it becomes the central focal point in one's life. It's the only thing that matters. Not parents, not friends, not spouse, not children, not food, not health, no nothing, no nobody. Only heroin. Hence the fact he does not give a shit about you... it's totally normal and expected. Now let's discuss why?\n\nTo make a long story short, opiates profoundly change the brain chemistry as well as the physiology of the human body. After a very short period of time, the body adapts, and that \"high\" state becomes the new normal. Every time an addict becomes low on drugs (at his stage, that's every 8-12 hours max) he experiences EXTREMELY VIOLENT and continual psychological and physiological reactions. There is only one things that can make  him well again: more dope (the name of heroin in the street). Trust me, your son absolutely hates being caught in the clutches of the devil, that's a certainty.\n\nI hope that simplified description of the addiction cycle makes you better understand what is going on.\n\nThe first step of a successful rehab is ridding him of the obligation to feed the withdrawal symptoms, which in turn will allow him to work on himself and start caring about his surrounding and loved ones: he will need to get on methadone, subutex and/or kratom. Then he will need to do what is called a \"taper\", a gradual reduction of those opiate substitutes. At first, he does not need to go off of them, and he might even stay on them for several years, that's OK, as those substitutes are much. much better than being on H on a daily basis.\n\nI mentioned that in most case, I will say all cases, Addiction is accompanied by an underlying condition a) mental illness, and/or b) personal/familial issues.\n\nWell, once his withdrawals are under contral and that he is in a more comfortable and appeased state of mind, then it's time to figure out what's wrong. with points a) and b). That in itself can take a while, of course.\n\nAs he eventually get better (no more withdrawal, better mental health, coming at peace with his issues), he will start to figure out that there is hope on the bright side of life, and he will naturally wish to regain a normal life. That's your typical addict progression.\n\nFinally, he will have to change his social setting (he cannot hang out with people of remotely bad influence) and he will have to draw plans for his life.\n\nOh and one final thing: heroin procures the most intense pleasure and sensations in the universe (on a high, of course). Once one has experienced it, it's kind of normal one want to experience it over and over again. Even once he will have gone through the 6 steps I just described, he will have haunting, recurrent thoughts about the drugs, of course. Who would not want to experience that intense, unrivaled rush of pleasure? Those are the times your son will need a permanent support structure, to distract him from those thoughts and to remind him of all the negative consequences assicated with shit consumption (another slang term for H). Good luck, dear father.",
            "These questions remind me of that quote in The Mexican. When you love someone, when do you say enough is enough? Never.    \n\nThat doesn't mean you let someone abuse you or you enable them to harm themselves. But you never really say enough is enough and write them off or make them feel unloved. I hope you find the way to balance the love (deep down) you all have for one another with this terrible disease. I'm so sorry you're all going through this. ",
            "I'm an ex addict who pretty much lost his family even after getting clean. My brothers both think I still use despite having a one month old. They haven't forgiven me for my transgressions and probably never will. Granted I did do some pretty horrible things to them and held an adoption for one and an entry into the army for the other. My Mom, i don't know what she thinks but we still talk from time to time.\n\nWhile I feel like my family has abandoned me I've moved on from them at this point. I have my own family and if they choose to hold grudges and refuse to forgive and forget it's them that loses the love, familiarity, friendship and companionship of their middle brother. \n\nProviding/throwing money at a problem, even in the form of rehab is not solving the problem. Most addicts don't need rehab, AA/NA or any other source of help. Most addicts just get tired of waking up tired and choose to finish. (Although AA/NA is always happy to take credit for those at the end of their rope).",
            "A 33 year old shouldn't  consider a parents house home anymore. It's your home , not his. He's an adult and needs to be accept the responsibility that comes with it. Good Luck and I'm sending my best wishes for you and your wife. ",
            "I went through a similar incident with a 28 year old nephew addicted to meth. I'm very sorry, OP. I hope I don't sound judgmental here because that's not my intent, but I don't think you're making a practical decision.\n\n33 or not, your son needs professional help. Addiction's a powerful, powerful disease and your son might crash very hard before seeking treatment. I understand your need to protect your remaining family but I think you need to keep close tabs on your son to make sure someone (you) is there to help him pull out of this. I really wish you the best of luck. Believe me, I understand, I've been through some of it.",
            "Are you the dad from Step Brothers? ",
            "[deleted]",
            "You decided to procreate, your responsibility never ends. ",
            "Troll, troll, troll."
        ]
    },
    {
        "post_id": "6sl3p6",
        "author": "Ace_burner1234",
        "title": "UPDATE: \"My husband [M42] and I [M32] (together 6 years) fought last night\"",
        "url": "https://www.reddit.com/r/relationships/comments/6sl3p6/update_my_husband_m42_and_i_m32_together_6_years/",
        "score": 2962,
        "num_comments": 87,
        "created_utc": 1502281355.0,
        "selftext": "https://www.reddit.com/r/relationships/comments/6pm1qj/my_husband_m42_and_i_m32_together_6_years_fought/\n\nI want to thank all of you for your comments and support; they made me realize really how shitty of a relationship I was in.  I did return home from my business trip, and after another physical incident, I said that was enough.  I called my parents (who are awesome), and my dad (who is awesome) came and helped me to safely get out.  We were even able to get my car out (its in only my name, and the lease is held by a major bank).  Funny thing was, that my dad had remarked to me that he and my mom had been waiting for that call from me for six years now.  In hindsight I should have gotten out *way* sooner, but hindsight is a bitch.\n\nDuring this process, the tribal courts and tribal police were way more helpful than I had expected.  A distant cousin of my spouse in the court actually helped us by writing a letter which would have compelled access to my car (and how to work the system), even though civil matters weren't his area and the obvious relationship.  (We didn't end up officially using the letter since we couldn't get is signed by a judge in time). The police were very understanding, and felt my request was extremely reasonable, and they did everything they could do to make sure the retrieval went smoothly.\n\nSo after an over-night stay in a major PNW city, getting the car to a transport service, and a cross-country flight, I am safely with my parents now.  It's not the house I grew up in, but it still feels like home.  And by the way, my boss and his boss are fantastic.  They have been nothing but understandable and willing to work with me so far, and that is absolutely fantastic.\n\nSo now I begin the process of rebuilding.  I'm going to focus on me, and do things I want to do which I know I wil enjoy.  I *will* rebuild myself financially and emotionally (my spouse subtly and not so subtly siphoned off resources by not having much free cash of his own, since he kept buying shit), and I will rebuild relationships which have frayed either due to alienation or distance.  Friends I have already talked to have been nothing but supportive, and I have warned them my spouse might try to manipulate them to get to me.\n\nWhat about my spouse you may be wondering?  Well, as soon as he realized that I had left his parents' house, turned off a family locator app, and was not answering his calls, he tried to guilt his way back to me.  He supposedly had a nervous breakdown, and was admitted to a local hospital off reservation.  When I landed last night there were messages from him that he had moved to the psych ward at a larger regional hospital, that he was going to try and get money back to me that I had given him for closing costs on the home purchase, and that he was sorry.  While if that is really the case, I'm sorry it happened that way, but I have the closure I need, and from now on I need to focus on myself.\n\n---\n**TL;DR**: I got out of my (financially, emotionally, physically) abusive relationship Monday, and I am not looking back, since I have amazing people in my life and things can only get better from here.",
        "permalink": "/r/relationships/comments/6sl3p6/update_my_husband_m42_and_i_m32_together_6_years/",
        "comments": [
            "I am so glad you got out!\n\nI hope anyone who is currently in an abusive relationship especially reads this:\n\n>Funny thing was, that my dad had remarked to me that he and my mom had been waiting for that call from me for six years now. In hindsight I should have gotten out way sooner, but hindsight is a bitch.\n\nMany people think they have nowhere to go, that no one cares, that their friends and family either accept the situation or have given up, and will just pile on with \"I told you so\" and not be sympathetic.  That those they've cut ties with in whole or in part won't care.\n\nIn fact, everyone who really cares about you will be relieved and happy you've escaped.  People you were cut off from will welcome you with open arms.  ",
            "Brilliant news, /u/Ace_burner1234 . I recall reading your original thread with horror and did feel for you. The level of entitlement your ex has is incredibly high. Good for you for not entertaining his BS. \n\nEnjoy the rest of your life. :)\n\nEdit: completely missed out a ",
            "I remember your original post. I'm so relieved that you're safe.",
            "Beware love bombs to guilt you into going back.  Let his \"I love you\"/\"I'm a changed man\" messages go unanswered and you'll see them eventually followed up with hate because you didn't react.  Save the hate and reread it whenever you have a moment of weakness.",
            "So glad you were able to get yourself out of a terribly abusive relationship.  \n\nA couple important suggestions for you:\n\n* Lock down your financial accounts.  Call **all** your financial institutions (banks, credit cards, loan accounts, etc).  You need new account numbers for your credit cards, checking and savings accounts.  If there are accounts that have his name on them (whether it is joint or he's a signer) you need his name removed.  Change the passwords for all your online financial accounts and telephone access accounts (my bank has a separate pin code I have to say when I call in).  You also want to have them put a note on your account that explicitly says your ex is not allowed access to those accounts.\n* If you were a signer or authorized user on any of **his** accounts, call those institutions and have your named pulled off.\n* If you had utilities in your name at his address (telephone, cable, power, gas, etc) call all those companies and **cancel** the service.  These are easy to forget about and he could easily run up your bills, not pay and force you into collections.\n* Call the credit bureaus (all three of them) and freeze your credit so he can't open any accounts in your name.\n* Change the passwords on **all** your online accounts, social or otherwise.  If the site has an option to deauthorize or force a sign out of all devices...do it.  For example, Facebook applications on iOS will remember your login information (like if you left an iPad at your exes that had Facebook logged in).  Using the force-logout option will make sure he doesn't have access to any of your information.  Facebook, iCloud and google services are some good examples of sites you want to do this on.\n* File a change of address form with USPS that forces **all** your mail (not just companies that you've changed your address with) to get diverted to a new address.  You don't want him to get his hands on important paperwork.\n\nI know this might sound a little over the top and unnecessary but it really is important.  Abusers will find any way they can think of to get back in your life, even if it's only to cause you trouble and even if it means he gets in trouble in the process.  I wouldn't put it past him to open an account in your name just so you're put in a situation where you have to call him on the phone.\n\nLastly and I think this is most important...find a counselor that specializes in abuse and trauma.  You've been through a lot and like you said in your post, you're in the process of unpacking and processing everything that happened to you.  Some of the bigger more obvious issues are possible to work through on your own.  But some aspects of abuse are very subtle and it would be helpful to have a good therapist in your corner to guide you.  \n\nFor example, you mentioned that you \"fell\" down the stairs which implies that you've at least partly bought into some of his manipulation tactics and have accepted blame for actions that are 100% his fault.  This type of abuse, where the abuser is \"rewriting\" events to make you at fault is a very nasty form of abuse, commonly called gas lighting.  It's an effective form of abuse because it causes the victim to start questioning their own memory, identity, recollection of events and hands power over the abuser.  This is one of those nuanced and subtle forms of abuse a counselor could really help you with.\n\n",
            "You took action like a champ! What a great update! \n\nDon't be surprised or alarmed if part of you still misses him. This is a normal oitcome of having beem in an abusive relationship. The feelings will fade with time. However, it wouldn't hurt to get a therapist who specializes on helping people get over abusive and manipulative relationships. \n\nCheck out the website Out of the Fog. It sounds like your ex may have a personality disorder. You may recognize a lot of his behavior there. They have a lot of good suggestions as to how to handle personality disordered people. Hopefully you will never have to face this guy again out of a courtroom, but it will be helpful for your recovery to know how to respond to abusive and manipulative behavior in the future. \n\n",
            "I remember your post and I am so glad you realised how bad this was. Sorry it took another physical incident and all of this work to become free through.\n\nYou sound* ok right now (which is telling) but don't be surprised if you go through a type of grieving for your relationship and who you wanted your ex to be. It will be ok, eventually.\n\nI'd probably block or permanently divert your ex though, you don't need him in your head right now. Perhaps correspondence only through a third party or something. Good luck and stay safe",
            "That all sounds like it's working out for the best. Stay strong. Definitely see a therapist to work through all this as well. It will all get better.",
            "Hell yeah! Best of luck in the future, I'm happy for you.",
            "I've never been happier to read an update in my life. So proud of you, op! You're doing amazing! \n\nI know it's hard, but you've done everything right. The future is bright for you! Congratulations :) ",
            "I am so so so so so very happy to hear this!\n\nLeaving an abusive relationship takes a lot of guts. Congrats on leaving, and all my love to you as you heal. ",
            "From your post, it's not clear to me that you've worked on the divorce angle. You need a family law attorney consultation. \n\nI'm so glad you got out of that awful situation. I remember your post before, and it was distressing to read. Good luck!",
            "I am so glad, OP, well done. \n\nNow block that mofo from here to kingdom come.",
            "I remember your OP. I'm glad you got out, but I'm sorry you went through this. Good luck with everything. ",
            "Yep, he was abusive. If you *had* been his wife, you would have had \"battered women's syndrome\", but let's change that to battered men's syndrome. His constantly trying to feminize you was a whole other level of abuse. I'm glad you got out, and that you're confident about rebuilding your life. Also, go your parents! They sound like awesome people, and I'm glad you have understanding bosses and friends. The fact that you were questioning whether you were in the wrong when he had physically hit you was what did it for me - he was physically and emotionally abusive. Good job for getting out. Work on finding who you are again, because relationships like that can really fuck up how you see yourself.",
            "Glad you're safe now OP. Enjoy your life. ",
            "What a brave move to make. I am so glad you're safe and with loving family. Good on you. Take care of yourself <3 ",
            "I'm so relieved to hear that you're safe, OP. I remember reading your OP with horror. Stay safe, always be kind to yourself + I'm so glad to hear as well how supportive everyone around you has been. Enjoy your freedom and your new life 💖",
            "[deleted]",
            "Try to get as much as you can in the forciere. Can you prove his abuse and can you get most of the house so that you can sell it?",
            "I'm so glad you're safe. Be kind to yourself, OP. Good luck with everything. ",
            "OP I'm so happy for you! It is wonderful that your parents are so supportive. Please stay strong. ",
            "I'm so sorry you had to go through all this. I'm glad you got out, and I wish you the best for the future.",
            "I'm happy for you.  You made the right choice.",
            "I think it's a good thing he went to the hospital (if he's telling the truth) because maybe there he will get the help he needs.\n\nYou did the right thing by getting out and getting safe.  I hope the divorce goes smoothly, and that you have no more contact from him.  You deserve to have your freedom, and peace.",
            "It's so nice to read a positive update. It's great to hear that you're safe with people who truly care about you and far away from your husband. In your first post you said something about when it's good it's great and when it's bad it's terrible - that alone without your description of his verbal and physical abuse set off major red flags for me. Please consider therapy, if you're not already, as you work to rebuild your life. It sounds like you're in a good place at the moment, but abusive relationships can be detrimental beyond what we realize and abusers can be insidious in trying to find a way back into their partners' lives. I wish you the best in the future! ",
            "I remember your post! Be proud of yourself! You've done a difficult thing, and got away from your abuser. Enjoy your life and I hope soon you'll find someone who treats you the way you deserve to be treated!",
            "I am so, so happy to hear this. \n\nYou deserve all the good things that are ahead for you. \n\nBe a little selfish about taking care of yourself, and also stay alert for your safety. He sounds like someone who has the potentially to be very dangerous for an extended period of time. Put yourself first.",
            "Woohoo! Uphill from here! \n\nAll the best to you and cudo's for sticking up for yourself!",
            "I'm so happy this turned out this way. I remember being horrified about how your (ex!) husband was treating you. You deserve so much better, and you're on your way to getting it. ",
            "You are amazing. So happy that you got out safely, that you're able to see clearly through the gradual fog he built around you, and that you're not going to get sucked back into the abuse. And thank you for sharing your story. Somewhere, there's probably someone reading this who just got an extra boost of courage to take action and get to safety.",
            "Check out r/NarcissisticAbuse! Glad you're safe and things went fairly smoothly.",
            "I'm so glad you were able to get out and that you are able to repair your relationships :) I hope things continue to get better from here on out ❤️❤️",
            "So happy for you. Take care. \nYou are your own person, not anyone else's. ",
            "I'm super happy for you. Enjoy your new chapters in life. Always remember your self worth. :)",
            "Good for you OP!  I'm glad you are safe and on the road to happiness again.  I'm sorry your husband turned out not to be the person you thought he was, but your parents sound amazing and you will overcome this!",
            "Just read your previous post, happy everything is falling into place for you! No one deserves that type of treatment. Fuck that dude.",
            "OP you are awesome, you showed courage and it paid off for you. I'm happy to hear you are back on a good path.",
            "Glad you got out. Good job.\n\nRandom but ... every time I see an update about an abusive relationship, I always think it's a different OP until I backtrack to the first post and go, \"Oh wait, it's one of the 10 other abusive relationship updates I've been waiting for.\" I think it's crazy I have to keep track because there's so many stories like this. It's sad.",
            "I just re-read your original post and realized I actually was one of the comments! I am SO glad you got out. At the time you posted the original post, I was incredibly worried that you would ignore Reddit and stay in that horrible relationship (it's hard to leave an abuser). BUT YOU'RE FREE! :) Congratulations!",
            "All that matters is that you are safe and with family who love and care for you. ",
            "So happy for you! The day I walked out the sun began to shine again and my smile slowly came back. It was devastating yet freeing. Freedom is a mindset & life worth, not an economic set. Get the hell out and back to being your happy carefree wonderful self! It is so hard for awhile. Then it gets so much better!",
            "I'm so happy to hear this. Best wishes on starting over and remember to stay strong!!",
            "Don't know why I'm saying this but I'm reminded of the book It Ends With Us by Colleen Hoover. ",
            "The beating on returning home, or soon after, was inevitable. He would have felt he needed to reassert his power over you after you threatened his self perceived superiority.\n\nI'm only posting this so that others in a similar situation might read this and get out immediately rather than risking death or permanent injury by returning.  People always think their situation is different and it usually isn't. That's why people have such big Aha! moments learning about abusive patterns.... reading lists of red flags, for example.  Someone will read this someday, thinking that their partner is different and go back for their Rolex or something, and get killed over it or get a broken cheekbone. Things can be replaced! Even your SS card and passport can be replaced!\n\nOther random bits of advice for those in this situation: File for divorce First in a location favorable to you. Change banks to a small local bank.  Change all passwords. Get a safety deposit box for your important papers and expensive jewelry if theft is possible (remember what can be considered joint property until you file). Consider a PO box if you'll be staying somewhere temporarily and it will help you stay hidden.  See if you can work from a different office location or work from home temporarily.\n\nBest of luck to you OP! HUGS!\nI'm glad you're now safe and rebuilding, OP. Hugs!",
            "I'm glad you got out. Also glad he's getting help. What he's done is unforgivable but maybe with therapy he won't do the same to someone else. You deserve way better op, good luck with everything. ",
            "There's a post I made about...an hour ago in r/gaming about how I got out of my abusive relationship (long story short:  Made a friend on xbox live, turned out he was local, we became friends in real life, when he noticed I wasn't logging on (because abusive then boyfriend broke my xbox and isolated me from my friends) he came looking for me.  Gave me a place to stay.  I never left).  I'm so happy you managed to get out of there!\n\nDon't fall for his bullshit.  That's all it is.  ",
            "A thousand times this. When I finally called my mom and told her I wanted out of my relationship, but was scared to leave since I found out he was drug dealer she and my three very large uncles showed up with a car. They had me packed, guarded, and out the door in less than 20 minutes. Never looked back.\n\nLike you, my parents and family and friends had all been waiting for that call and were just ecstatic to get it. None of them judged me, particularly those who had been taken in by my ex in the beginning and talked me into going out with him again after I initially decided he put me off for some unknown reason.\n\nI'm really happy you've gotten out. Live your life, learn from the experience, move forward. And thank you for posting a positive update about this. Hopefully someone else will see it and think, \"I can do that too.\"",
            "So glad you're out of that abusive relationship. 🍾",
            "Do you still have your penis?",
            "[removed]",
            "[deleted]"
        ]
    }
]