[
    {
        "post_id": "3nv2qi",
        "author": "Throwawaya747",
        "title": "UPDATE: My (28M) pregnant wife (26F) has gonorrhea and I don't know what to do",
        "url": "https://www.reddit.com/r/relationships/comments/3nv2qi/update_my_28m_pregnant_wife_26f_has_gonorrhea_and/",
        "score": 2948,
        "num_comments": 187,
        "created_utc": 1444238178.0,
        "selftext": "Original thread here: http://www.reddit.com/r/relationships/comments/3nlv34?sort=confidence\n\nMy wife just got the second test results back and...negative!  Turns out it was a false positive, or the lab mixed up the results. My wife apparently was too excited and forgot to ask. \n\nThanks to everyone who commented with support and advice. I'm sure glad I didn't get angry and confront my wife about cheating. \n\nTL;DR: In two days' time I have lost years and gained gray hairs due to unneeded stress.  But I'll gladly take the trade-off. \n\nEDIT: Upvotes for everyone! It's a good day.  Thanks again for the support!",
        "permalink": "/r/relationships/comments/3nv2qi/update_my_28m_pregnant_wife_26f_has_gonorrhea_and/",
        "comments": [
            "[deleted]",
            "Fantastic!\n\nGood job keeping a cool head, OP.  This could have gone a lot worse.  Look at that poor guy that ruined his marriage because he didn't get a follow up check up for his vasectomy.  \n\nCongrats on the incoming baby and best of luck to you!",
            "As someone who works in a lab, I'm super pissed off that happened to you. There are *so many* protocols in place to keep that from happening. Goddamnit. I'm so sorry that you had to go through this.",
            "As a lab worker I just want to point out that the doctor's office is probably the one who sent a mislabeled sample.   Most lab errors are clerical and take place before we even get our hands on it, but the lab takes the fall a lot! ",
            "The best part of this seems to be your undying trust and support of your wife. Most people are weak and jump to conclusions in these types of situations  (for good reason). But from reading the first post, you seemed calm and trusting of your wife. \n\nCongrats on the good news and soon congrats on the new member of your beautiful family.",
            "I know doctors are overworked.  I know doctors are doing the best they possibly can.  But when they say things like, \"It's is very rare for these tests to be incorrect,\" I get upset.  For me it was, \"Oh sorry, based on the test results it looks like your wife lost the baby, we should schedule a D&C right away.  These tests are never wrong.\"  Doctor read the test results incorrectly.\n\nEdit: Not DNC (Doh.)",
            "So happy to hear this!! I've been thinking about your little family quite a bit. Fingers crossed for a happy and stress free remainder of the pregnancy! ",
            ">I'm sure glad I didn't get angry and confront my wife about cheating.\n\nPresumably she's thinking the same thing :)",
            "Yay!!\n\nSurely a mislabeling/clerical error, as it is usually the case with these \"lab errors\". But it means someone out there got the negative test instead of the positive one... Oh well.",
            "I'd like to add, for future reference, that pregnancy weakens the immune system and often underlying diseases dont show until pregnancy. I see ops wife is negative, congrads! But even if she was positive, it would have been possible that you had been a carrier all along, and she got it from you eventually, but didn't have a flare up until she was pregnant and her immune system was weakened. (fun fact, women's immune systems are weakened during certain stages of pregnancy so as not to attack the developing fetus!) ",
            "Congrats!\n\nSTD's are nothing to clap about.",
            "What a relief! So happy for you!",
            "[deleted]",
            "Just read your OP and immediately guessed it was a false positive. The kind of certainty that you showed really suggested she wasn't a cheater. What an awful scare. Glad you kept your head.",
            "Dude... I'm so relieved. I wanted to badly to believe that neither of you had cheated. Congrats on your new baby! Hug your wife and tell her your believed her. ",
            "Woohoo! So happy for this good resolution. Posts on this sub with happy endings are so rare.\n\nI've gotten lab results mixed up more than once over the course of my life, and I'm really glad that is indeed what happened here.",
            "Congrats! Now go get your wife some roses and a nice dinner or something. Even if she doesn't know how you felt, you do, and it may be a good way for you both to relax.",
            "You think you have grey hair now, just wait until the baby is born.  Haha",
            "Looks like that gonorrhea is *gone*orrhea",
            "Huzzah.",
            "How often are false positives associated with pregnancy? When my wife was pregnant with our second child she was told she had herpes. She did have some sort of infection but to her it didn't look like herpes and didn't itch. She's never had anything like that before or since, and neither have I. We've been together for 8 years now and haven't been with anyone else in that time. Could it remain dormant for that long, and never show in one of us? Or is it most likely just a false positive on the blood test?",
            "False positives can be a bitch, they really don't care enough to test twice or just once properly because it saves them money. Even if there's a chance it's a false positive, with drug testing at least, they'll try to \"catch you in a lie\" before double checking their results just because it could save them a few dollars.",
            "Ever had a dream where you did something just *awful* and regretted it so badly... only to wake up and find out it never happened at all? That sense of freedom and relief is wonderful. I imagine you're feeling that right now.\n\nCongratulations OP!",
            "there are a lot of people who are happy about this final result!",
            "You know what would be one hell of a plot twist? \n\nThe second test was the one that mixed up. \n\nBut no, seriously happy that it came back negative. Hope all goes well with the pregnancy.",
            "Wait, I don't mean to burst your bubble but did you actually see any of the documentation? ",
            "/u/your_what_hurts yay! We were right!",
            "THIRD TEST NEEDED \n\nObviously.\n\nIf its possible that one test can be wrong, you currently cant be sure WHICH one is the wrong one.",
            "Did you check if you had it?",
            "*GONORRSEE-YA!!!!*",
            "Glad it worked out. ",
            "Very happy to hear!!",
            "How long did it take to get the results?",
            "I'd change doctors. No bedside manner.",
            "If you have gonorrhea and are testing positive, you would KNOW for sure if you had it. Shit itches and burns like a bitch and it oozes.  All sorts of wonky shit happens when you are pregnant but most likely a positive result like that was a mess up. Even still, she needs a copy of her results to make sure they didn't miss anything else like a yeast infection or HPV. HPV, by the way, is extremely common and in no way indicates she has cheated. It can stay dormant for a decade. ",
            "give her a round of applause ",
            "I'm happy for you! Could have turned out so much worse, way to keep a level head.",
            "hey congrats!",
            "Phew! Crisis over. ",
            "Can gonnorhea be apart from sexually? I don't know about this in particular, but I know that there have to have been cases where a previously dormant STI from a previous partner, or infection caused by a different transmission method have caused relationship trouble. I had a mild scare once with a red spot, and at no point did either I or my partner accuse the other of cheating. There was a casual \"well, you haven't been with anyone,\" but in a very gentle tone just to cover everything. She also knows that I've only been with one person before her (no penetration either) so it wouldn't have been a dormant thing, so I give her tremendous credit for that level of calm, and I would react the same to her if the situation were flipped around.\n\nWent on a little tangent there, but my original question was what I actually meant to post. Other point still stands though: people, trust your partners, so a negative result or a bit of rug burn that looks like the clap doesn't cause undue harm to the union!",
            "A week after my ex gave birth to our daughter, she got a voicemail from her gyno's office, \"Please call us back immediately, we have your results in.\"\n\nShe didn't know what was up, and in all the business of birth didn't remember one test from another etc. so she calls the office. The receptionist tells her, over the phone, \"Your tests came back positive for chlamydia, the doctor would like to have you come in\"\n\nMy girlfriend goes \"*what?* I just had a baby!\"\n\n\"Oh...Jesus I called the wrong Samantha. Sorry, have a nice day...\"\n\n\nJust wanted to share, your situation is kind of funny as well :D glad everyone is well!",
            "I'm so glad you got the second test! Sounds like it was an unfortunate error.",
            "Thats great news but I hope her dr was seriously apologetic about indicating that it would be highly unlikely that it was a test issue.  He could have just said \"lets get a retest before we start panicking.\"\n\n",
            "I've been thinking about you guys ever since your post. Phwew! So glad!",
            "Not her, for starters.",
            "I'm really glad you got the news you wanted here. However, I would suggest you still get tested. She now has 1 positive and 1 negative test...which is a 50/50 situation in my mind. Do yourself a favor and get tested, then you will know for sure.",
            "Congrats to you and your family OP!",
            "Yay! That is great news!\n",
            "Very happy for you! Now relax and make the rest of the pregnancy as stress free as possible!",
            "Very good news. But I'd still have a different lab test you both again. ",
            "Such a great update! And congrats on the new baby!",
            "SO < OP by 2 years. Definitely not creepy.\n\nYAY! I was worried, and hoping you would update. Glad to hear that it was just some random lab error. Good luck with the rest of the pregnancy! ",
            "I'm happy things worked out and all.\n\nBut I kinda wanted this soap opera to go in a different direction.",
            "She a ho. Go to Maury, collect $200.00"
        ]
    },
    {
        "post_id": "56sijj",
        "author": "anxiety_issues_suck",
        "title": "**Update** Me [26M] with my live-in girlfriend [26F] 10 years, she has lost her sex drive due to anxiety/stress issues. I'm trying to be supportive but the lack of intimacy is killing me",
        "url": "https://www.reddit.com/r/relationships/comments/56sijj/update_me_26m_with_my_livein_girlfriend_26f_10/",
        "score": 2944,
        "num_comments": 88,
        "created_utc": 1476113301.0,
        "selftext": "Original Post: https://rr.reddit.com/r/relationships/comments/55zq1c/me_26m_with_my_livein_girlfriend_26f_10_years_she/?st=iu45ko64&sh=99d7b298\n\nHey guys I got some really good feedback to my post that made talking to my girlfriend a lot easier and I'm so happy so I thought I owed those posters an update!\n\nAfter reading all the comments and reflecting on our relationship I decided the recent lack of sex was not the problem but just the symptom of a much greater issue, my girlfriend's stress. Like I said in the original post, I was weary to bring these issues up because I did not want to add additional stress to my girlfriend's situation, she has enough to worry about right now.\n\nI had mentioned that weekends are her least busy times and that is when we get things done around the house and hang out with friends. Some users said we should focus less on being social and more on ourselves, and someone else suggested that I try to get more done during the week so we can relax more on the weekend. So on Thursday and Friday I got up early and did everything we needed to do this weekend, cleaned the whole house, did our meal prep (something we usually do Saturday) and got all the laundry taken care of. We're finishing our basement and this weekend was going to be the carpet, so I went to Lowe's and bought everything Thursday and banged it out alone on Friday.\n\nShe noticed the whole house being cleaned Friday night and was really relieved that we didn't have to take care of it this weekend. On Saturday we got up and that was when she realized I had taken care of the carpet and everything else. It was awesome, she was giddy with excitement because she pretty much had nothing to do all weekend. So I asked what she wanted to do and it was stereotypical Fall couple stuff; went and got pumpkins and mums for our porch, went and got some new Fall decorations and candles and then just hung around the house being lazy. While I worked out and walked the dog she did a bit of work to get ahead so she wouldn't be as busy this week. We ate dinner and since we were in a Fall mood we watched Hocus Pocus. \n\nOn Sunday we slept in for the first time in ages... well first time for her, I sleep in all the time, don't judge me. We continued the fall theme and went apple picking. We came home and I made an apple pie. She started doing some work but after about a half hour she said screw it, went for a run and then came home and relaxed. We went to her mom's for a big Sunday dinner and when we got home I decided it was time to talk to her about her unsustainable stress situation. \n\nI told her I loved her and was in it for the long term but that I was worried about her and that her current situation wasn't healthy. She started crying, she thought I was sitting her down to break up with her! She knows that the way she's working isn't healthy but she didn't think it would go on this long. She kept thinking to herself \"just a few more days and I'll get into a flow...just another week...\" and before she knew it it's been 3 months and she's still pulling her hair out. I wasn't going to talk about the lack of sex but she brought it up and apologized. She said her problem isn't the lack of a sex drive/attraction but that she's just exhausted all the time. \n\nAfter we talked, I gave her a big hug, one thing led to another and we ended up having sex! woo! It's Columbus day today so we both are off and it happened again this morning, double woo!!\n\nSome people had suggested I say we schedule some times to hang out which I was against, but my girlfriend suggested something very similar. Saturday night is now the night we make a point to have sex. It used to happen naturally a couple times a week, but with her new schedule that probably isn't going to happen. Saturday night is now our designated night to stay in and make dinner or go on a date with just the two of us and then go home and have sex haha.\n\nSo in conclusion, I'm going to take care of more of the housework so our weekends are less busy and we are going to make it a point to have sex at least once a week. We used to divide it pretty equally but I have a hell of a lot more free time during the week than she does. Also, communication communication, communication. I was thinking this was the beginning of the end, and after a few days and one honest conversation I think everything is going to be just fine. \n\n  ---   \n  **tl;dr**: Busted my ass last week to get all our housework/responsibilities taken care of before the weekend. Hung out and had a great weekend together. Discussed our situation Sunday night, we figured out a system that will work, and then we finally had sex! I'm going to shoulder more housework/random crap during the week so we can relax together on weekends. \n\n**Edit**: so I guess this post is locked so I'm sorry if I was unable to respond to you guys but I did read all the responses. Thank you for all the support I really didn't think this post would get so much attention!\n\nTo everyone who who just said congrats or gave further advice: thank you so much, your advice really helped me work this out. /r/relationships never fails me!\n\nand to that one guy who came over from /r/TheRedPill keep your chin up, you'll lose your virginity some day",
        "permalink": "/r/relationships/comments/56sijj/update_me_26m_with_my_livein_girlfriend_26f_10/",
        "comments": [
            "Perfect. Brilliant. Communication porn. \n\nI'm saving this post to return to on particularly depressing days. Well done, OP.",
            "[deleted]",
            "Great update! Glad to see you taking initiative and both of you communicating. And yay for sex! ",
            "Well. You guys seem to have this communication thing down pretty well. This was seriously lovely to read. ",
            "Bravo and congratulations! If I may offer one final piece of advice, Dan Savage (who writes the wonderful sex advice column Savage Love) often advises people to \"fuck first,\" meaning have sex at the beginning of date night, before you go out, rather than at the end. This mitigates the common problem of arriving home after the date very late, drunk, and with a food baby, which too easily can stand in the way of having sex, and if you fuck first it jump-starts the wonderful feelings of romance for the evening. Afterglow is a wonderful thing to bask in.",
            "Good for you, OP! There's nothing sexier than a capable man.",
            "[deleted]",
            "Don't hesitate to have sex, and THEN go out to eat. Sex is better on an empty stomach. And maybe you have some drinks with dinner and do it again.\n\nJust sayin.'",
            "This put the biggest smile on my face! It's so great that you've made moves to fix things instead of just leaving it up to her, because you have clearly helped her so much. In your last post you said you want your girlfriend back, and by putting in just the slightest bit of extra effort, you've got her. Amazing communication. Just makes me feel all warm inside. \n\nBy the way, a scheduled date night will do wonders for you both, even if the concept doesn't seem so fun. I think it's gonna be a really great change for you. \n\nCongrats OP! ",
            "Most people miss this one - if something isn't working, try doing it differently. And talking about it. Lots of couples will keep silently banging their heads against the same wall until the relationship is dead and buried. Good for you for shaking out something workable.",
            "Housework gets everybody laid!!",
            "Jesus. \n\nEvery single person who has a relationship should have to read this post. Because a large majority of people are either going to have this happen or watch it happen to their SO.\n\nHell of a fucking post OP. Way to go. ",
            "Best update I have ever read on this sub! I am so thrilled for you both. Your communication was on point, a hundred percent. We could all stand to take a page from your book. :)",
            "I shouldn't have looked too far down in the comments, some people are so critical... You sound like a great boyfriend OP! I mean for God's sake, especially compared to some of the ridiculous relationship situations that come up on this sub, this was really handled beautifully by both of you. ",
            "I'm similar to your girlfriend in terms of stress and anxiety, and it took me 6 months at a new job before I got 'into the flow.' Up until then I was having issues with insomnia and even broke out in hives. Then I got my positive performance evaluation, found out everything I was doing was fine, and my stress levels dropped to manageable overnight. But it took a full 6 months, which I think is a fairly typical \"getting used to new job\" timeline. So it may still happen for her!!!",
            "Wow. Good for you. Good for her. You handled this amazingly. I'm so happy that things have turned around for you! Another win for good communication! Also, major props to you for stepping up and taking care of more work around the house to make things easier for her. That's incredibly mature of you. Well done all around.",
            "I just want to congratulate you immensely for recognizing that you have so much free time and stepping up to take over some of the housework. That's a really mature and respectful way to help your partner out. I want to applaud you guys, I was really happy reading this, it sounds like you guys are very good for each other!",
            "I'm not trying to be negative, I just want to share my personal experience. I was in a dead bedroom situation for the past 2 years. I'm pretty sure it was stress related, as it began shortly after she had to pickup all the work of a coworker who went on maternity leave, which added a significant amount of unpaid overtime.\n\nThe initial effort and communication was well received and I was hopeful, but it didn't actually last the week. The scheduling (her idea) didn't work because it turned into, \"do you mind if we wait till tomorrow\". And I wouldn't press it, and it would just go months, until I'd bring it up again (rinse repeat). Even after things normalized with her job, the damage was done and we never recovered. Her sex drive never came back.\n\nI'm not saying this is the case for you, I'm just saying that you've made the very first steps and depending, it could be struggle ahead of you, or hopefully, smooth sailing. Though for your SO to go months and not show any interest in sex, even with her busy schedule, is telling. Especially so, since she recognized the problem already, but didn't actually do anything until you made it an issue.",
            "Glad it worked out. Stress is so much easier when you have someone to understand and help you through it.",
            "Awww I loved reading about your organized weekend together !!!! So sweet. Best of luck :)",
            "That is great news and a good update.   I would tell you to be cautious.   I had a deadbedroom for many years and the talk you described happened between my wife and I many times.   I ended up doing many chores and hiring help to do those that I couldn't do in an effort to reduce stress to help our sex life.   Eventually my wife would gravitate back to little to no sex.  The next time I did bring up the issue of lack of intimacy my wife would have one more thing that caused her to lack a libido.   Keep focused on the positive but I am concerned that you didn't have any intimacy Saturday or Sunday until after the talk.   Those two days were stress free and she didn't offer sex even though during the talk she admits to thinking it was a problem.  ",
            "I'm truly happy for you mate!",
            "Hell yeah. My bf and I both work and go to school and we definitely let sexy times slide. We finally dedicated Saturday as the scheduled day and refer to it is \"sexy Saturday.\" It totally helped.",
            "What a pleasant update. I wish you two the very best. Thank you posting and for updating, OP! ",
            "It's good I guess that you talked, but your contribution seems a little uneven.\n\nBasically you're going to take on more housework and she's going to do ... nothing really. Aside from just enjoy the time you've freed up for her by your doing more than half the housework.\n\nWhy doesn't she try to cut down on work? In your first post she seemed to be admitting she doesn't actually need to work that much for the job, she just overachieves because she's a perfectionist. \n\nSeems like your the one doing all the relationship work here and she doesn't have to make any of the changes. If she's financially contributing more to the household then it evens out. But if things are financially even and you're doing more housework... basically you're subsidising her high stress lifestyle simply because she refuses to pull back her excessive work life and you really want to get laid for once.\n\nYou have more free time because you have the brains to work smart not hard... seems a shame to blow that spare time cleaning because she refuses to do the same.",
            "Yay! This is a great start to resolving the issue and kudos to you for getting all the chores done so you two could hang out and reconnect over the weekend. I had a feeling that your SO was also worried about the lack of sex, so it's great that you didn't even have to bring it up to her, she brought it up herself. \n\nOne thing that works for me and my SO is if for some reason one of us doesn't want to have sex on our agreed upon \"schedule\", the person who declines must initiate within 24-48 hours later. It's never 100% on target, but it makes sure that things never feel one sided. To the haters who dislike the idea of \"scheduled sex\": no, we don't have a spreadsheet. It's just a mutual, often unspoken expectation of timing which generally has a pavlovian affect for that specific day/time/set of circumstances. It works for us, YMMV.",
            "THIS IS HOW YOU DO IT FOLKS",
            "Omg, this is beautiful.\n\nI know you're a more unplanned-life kind of guy, but the fact that you realize you need planned time with the girlfriend you live with is so awesome, and it really shows how much you love her. I think a lot of couples overlook taking time out for the purposes of spending time with each other and wouldn't even consider it. I think you're gonna be great.",
            "[deleted]",
            "You are an inspiration.",
            "Amazing post! This made me really happy to read :) You sound like an awesome partner, OP! Please do another update in a few months?!",
            "Wow. Reading this post and everything you did makes me want to have sex with you. Great job!!!! ",
            "You win the everything. Bravo!!",
            "I'm happy for you <3",
            "Well isn't that surprising - taking on more household duties than the person who has much less free time alleviated that person's stress. Who woulda thunk? Truly you are a champion of progress. You even had to bust your ass to take care of your surroundings. Something about the way you say it sounds so fucking transactional like it wasn't a natural thing to support your partner as much as possible when she was pulling out her hair? You honestly thought of a breakup sooner than you thought of picking up the slack so that she has some time to fucking relax? Come on man, you've been together for 10 years. You can treat her better than this.",
            "So she and you both have full-time jobs and yet she was getting up to do the housework on the weekends while you were sleeping in?\n\nFound the reason.",
            "So, you get to do all the housework and your reward is to get sex once a week on her schedule. \n\nCongratulations dude. ",
            "Sounds like she has a shit job and now you're doing all the work. You'll both get burnt out. While it was a happy update for now, scheduled sex starts to really suck too.",
            "Wait so she had a lot of energy and went for a run? And then had sex with you when she was worried you were breaking up with her?",
            "nothing you've done here actually works long term.  all you've done is supplicate to her tantrum and give into her manipulation.\n\n> we are going to make it a point to have sex at least once a week.\n\nhere's the reality you need to get through your head: she does not want to fuck you.  what you're getting is called transactional sex.  it doesn't last because cleaning the house doesn't make you more attractive.  it makes you less.  that scheduled sex shit lasts a couple weeks, a month tops.  every fucking time.  desire cannot be negotiated, and it certainly can't be scheduled.\n\nyou need to act more like an attractive, dominant, respected man.  that will make her *want* to fuck you.  start lifting weights an hour a day, every day, either 5x5 stronglifts or a heavy lifting crossfit program.  start eating better so you lose weight.  she'll notice sooner or later.  gradually start commanding her to do things.  then one day, be spontaneous (literally the opposite of scheduled sex).  on your way home, surprise call her, ask her what she's wearing.  tell her that when you get home, she better be wearing her tallest heels, her sluttiest skirt, no underwear, and she better be laying face down on the bed with her ass in the air.\n\ndon't believe me?  set a reminder in this thread for a month from now.  report back how well your scheduled transactional sex kept up."
        ]
    },
    {
        "post_id": "evr8cj",
        "author": "oopsmybaddad",
        "title": "I [26F] accidentally told my dad [60sM] a family secret that wasn't mine to tell.",
        "url": "https://www.reddit.com/r/relationships/comments/evr8cj/i_26f_accidentally_told_my_dad_60sm_a_family/",
        "score": 2944,
        "num_comments": 92,
        "created_utc": 1580324090.0,
        "selftext": "I had a very awkward moment on the phone with my parents yesterday. I really like family history (not 24&me but like tracing the family tree), so I’ve been doing some research. My dad asked about it and when he mentioned some previous research his first cousin \"Karen\" had done.\n\n&#x200B;\n\n>Me: “well yeah but that might not be our side of the family, right? She’s technically only your half your cousin right?\"  \n>  \n>My Dad: \"What do you mean, no she's not, Karen is my Aunt Betsy's daughter so she's my cousin.”  \n>  \n>Me: \"Well Grandma and Aunt Betsy are half sisters, right? So you’re only like 25% related.”\n\nTo back up for a second, my grandma is in her 80s and does’t have dementia or anything.  She definitely didn’t just \"get confused\" and say something inaccurate, but it’s very possible she forgot that she hadn’t told her own son and therefore should tell him before she told his daughter.\n\nWhen my grandma told me, it was in a casual context with my parents present (but evidently not listening to our conversation). She said she’d known/suspected since she was young that her younger sister Betsy was a product of an affair. She didn't really frame it as a huge secret, more just a family tidbit that she and Betsy had long since set aside.\n\n&#x200B;\n\n>My Dad: Wait, what do you mean 25%?  \n>  \n>Me:  “Well, Grandma and Betsy don’t have the same father so technically-\"  \n>  \n>My mom: “WHAT? Great-Grandma Name had an affair?!?!?”\n\nI stumblingly apologized and my dad sort of acted like this was something he knew about his mom/grandma, but I could tell from his recovery that he did not know, and was a little rattled by both the revelation and the fact that it had come from his daughter of all people.\n\nIt doesn’t immediately affect his personal self-image - his parents/grandparents are still the same people, we don’t really see that cousin and her family anymore, and obviously all of the adults involved are long dead, but still.\n\n**TL;DR: I told my dad that his own grandmother had an affair and his cousin was his half-cousin. Should I do something? Should I say something to someone? Warn my grandma? Apologize to someone? Or just keep my mouth shut?**",
        "permalink": "/r/relationships/comments/evr8cj/i_26f_accidentally_told_my_dad_60sm_a_family/",
        "comments": [
            "You've done nothing wrong. Your grandmother told you within earshot of your parents and never said it was a secret. However, you might want to check in with your dad. Something like, \"When we talked about Aunt Betsy, I had no idea you didn't know. I'm sorry if it came as a surprise. Grandma mentioned it to me when we visited, so she could probably tell you all about it. I love you and I hope you're ok.\"\n\nNot acknowledging what happened may be more uncomfortable for you and your dad, and also gives far too much importance to this decades-old secret.",
            "I wouldn't listen to the \"mouth shut\" people. The thing is out now already anyway. Go up to your dad and tell him this situation is bothering you. Just openly say that your grandma told you when they were there too so you presumed he knew. And that you're sorry if you upset him, you didn't mean to (and love him). That's all you need to do. If he wants to bring it up to your grandmother, then he is an adult and he could do that perfectly fine himself. Don't fret it too much, you didn't know.",
            "This is honestly unfortunately common with family secrets, especially when you go back a couple of generations and people were making more effort to cover up certain things. My great aunt was a product of my great grandma \"having an affair\" with her 50 year old employer when she was 16 and in domestic service (in reality it's heavily implied in the family it was a rape), with my great aunt subsequently being sent to a home until great grandma was married and they could pretend great aunt was a product of this.\n\nObviously everyone alive in the family at the time knew this but it was never spoken of, kind of an open secret. My grandma (her (half?) sister in law) ended up very matter of factly referring to this at a family event just after my great aunt had passed away decades later much to everyone's shock as we had no clue. My grandma had genuinely just been so used to the idea of it being an open secret that she'd just lost track of who'd actually been told this information and still just assumed everyone knew (like they did back in the day).\n\nI suspect your grandma is in a similar position, especially given she said it in ear shot of your Dad previously. It's easier than you think to lose track of who knows what, especially when the secret in question has been going for decades. I'd not make a big deal out of it but maybe mention to your Grandma that this came up and it seemed like your Dad didn't know or had forgotten, just in case she wants to explain anything to him herself.",
            "I don't think there's anything to really say. This might have shaken your dad's view a little bit, but you didn't do anything wrong and there's nothing to apologize for. Just let it blow over.",
            "Side note: If you’re tracing genes (ala 23&me) the half relationship matters. If you’re tracing family history, it doesn’t. That person was and is part of your family.",
            "If he was anything like my kids, he probably was told and just wasn’t paying attention or forgot.",
            "Don't worry, I accidentally told my mum about my dad's first son that she didn't know about and we're all fine.",
            "It’s a weird feeling when family secrets come out. I recently found out that my aunt secretly had a baby that she gave up for adoption when she was 20. No one in the family knew about it until my mom got a match and message on ancestry.com.",
            "Haha this happened to me in my family. It's a shocker to learn that people who are older, parents, and grandparents are real people too but now you all have a more complex understanding of who they are as people. It's ok :)",
            ">24&me\n\nIs that the version for great apes?",
            "Okay so you told a family secret. Not a very well kept one it doesn't seem...\n\nBut why would you think that this would discount the research Karen had done? If she did thorough research, she would still have more information on her mother's side than you would without talking to her, and she might have researched her \"dad's\" side as well.\n\nIt's just a weird reason to not talk to her about the research she's already done.",
            "No biggie, i don't think, since grandma casually mentioned it and he was present.",
            "Naw you’re good. You didn’t tell him anything a DNA test wouldn’t know.",
            "Don't apologise. You didn't do anything wrong. You were told with your parents right there and weren't even told that it was a secret. Just give your dad time to process it.",
            "I don't think you did wrong, my grandad came out with some unknown truths to me and my brother one day, like it was something he talked about casually to people. My dad was a little surprised when he found them out",
            "23&me just sayin\n\notherwise kinda sounds like a autobiography of someone with down syndrome \n\n&#x200B;\n\nand you didn't do anything wrong",
            "All you really have is that gossiping grandma said she ‘suspected’ that her mother had an affair.  If Karen isn’t aware of the gossip either, I suggest you keep quiet about it.",
            "It doesn't really seem like a big deal and I'm sure your grandma won't care since she told you while they were there",
            "This is late but, I want to say - this matters a whole lot to your Aunt Betsy. And to Karen. And to everyone at the time who were to have this revelation. But it really doesn't matter now, like at all. If you treat it like a bombshell it will become one. Shit happens. Be open with your family about it, invite the idea of your grandma and dad discussing it so she has a chance to defend why she didn't mention it (I forgot, I thought you knew, we weren't discussing it with anyone at the time and I guess I just never mentioned it, etc). And just move on.",
            "This is dumb. Any family that does the half sibling shit is a shitty family.",
            "Since it’s “known/suspected”, it’s probably only Grandma’s opinion and may not be the case.",
            "There is actually no such thing as a \"half\" cousin. You can maybe use that description among siblings with different parents, but with cousins, whoever is the parent doesn't matter, you would always fully be a cousin. As for siblings, there may be something separated in the genetic pool, but in reality, that is always your full sibling by sharing just one parent.. you either come from the same egg pool or semen pool. These are made up descriptions to help children know who the parent is, when the adults have had children with multiple partners. The term \"half\" is kind of an illusion.",
            "Keep your mouth shut and let it blow through....",
            "Your dad had every right to know too. You're not in the wrong, I think you Grandma should have told him this years ago. It doesn't change the nature of his relationship with his family. Blood doesn't make family, bonds do. So you are ok. I know you feel bad, but really the only thing that changes is the way things are referenced, not the love that is felt.",
            "Oh well.  The truth shall set you free!",
            "There's nothing for you to say. As you said, you believed he knew.",
            "I'd not worry too much about. I would maybe explain you just thought he knew because of how grandma told you, but you didn't do anything wrong. \n\nThese sorts of things tend to be a big shock at first, but that tends to fade quickly. At the end of the day it doesn't really change anything and was in the long distant past.",
            "Wow! Yeah, things said between grandma and grandchild are another level of honest. I tell my gram EVERYTHING! She does the same. You should probably apologize to someone, I guess. It’s not really that big of a deal.",
            "I would bring it up and just say I wish I had handled that with more tact, I'm sorry if I upset you. I love you Dad. \n\nFollow his lead from there. \n\nIt's not about fault. It's about keeping your yard clean and nurturing important relationships.",
            "You're okay. You did nothing wrong. Your adult if a father needs to handle this one. Grandma was in the wrong for not telling him as an adult.\n\nThe funny thing is that before ancestry, stay at home moms definitely had affairs (since single income households were the norm back then). There definitely are stories of people finding out they weren't 100% related through ancestry.",
            "Talk to him about it privately. It's possible he knew, but is more upset at the rest of the family finding out. If he didn't know, you should tell him that you assumed he knew. He's probably not angry at you, just a little shocked that you knew.",
            "NTA. All families have \"secrets\" that older generations aren't always open about. But if they come to light, they come to light, and with DNA testing now, that's more likely than not. I think the advice to reach out to your dad that Freckledfrida gave is good. You didn't intend to do any harm.\n\nWe had this happen in my own extended family:\n\nA few years ago my oldest sister and I went to San Francisco and met a whole raft of 2nd and 3rd cousins she'd uncovered while continuing the genealogy research our mom had started decades ago.\n\nMy grandfather had two brothers, one of whom had a falling out (over a will? not sure) with the others and disappeared around the turn of the twentieth century (my dad was born in 1906). \n\nSomehow my sister had figured out that he'd moved to California, maybe following the gold rush, and once there had settled in, doing well for himself. He'd married and had kids, but refused to tell his new family anything about the family he'd left.\n\nHe was long gone, but once my sister and the cousin she'd reached out to over a forum connected all the dots, they figured out he was my dad's uncle who'd disappeared. \n\nWe had a wonderful time and a couple of family gatherings with these newly-found cousins, and they were astonished to realize that between my grandfather and his *five* sons, and their 19 children, there dozens and dozens of 2nd and 3rd cousins all over Texas and the rest of the US.\n\nWonderful people, and who knows *what* the start of the estrangement actually was. My mom always disliked my dad's father, but would only say \"He was a son of a bitch.\" But who knows?\n\nFamilies are weird sometimes.",
            "Honestly I would bring up that they were literally there for the conversation, and *clearly* not paying attention. It's not like it was a secret conversation where you learned everything they've been keeping from your dad, y'know? It might help a lot to know that it's not specifically been kept from him on purpose.",
            "I just want you to know we have all slipped up at times and it's normal. I know how you might feel but don't beat yourself up too much about it. I do agree with many of the posts here stating that you should check up on your dad.",
            "You're fine your grandma didn't care it's old news and if your dad acted like he knew then let him hurting no one so it's all good",
            "I would give grandma a heads up to your Dad's reaction, but other than that I don't see an issue. \n\nI'm also a genealogy buff and in the 90s I was pestering my grandma for info on her first marriage  - I couldnt find the marriage info anywhere.  She finally gave in and wrote me a letter with a lot of personal info that her children did not know. I had to promise to never tell her kids the info, but was free to record it and use in my research records. \n\nGrandma willingly told you this info, in front of your parents.  She clearly did not intend to exclude them from the info, so I see no wrong doing on your part.",
            "Okay but was Aunt Betsy in contact with her supposed biological father who wasn't your grandma's father? It seems like if it she was the product of a secret affair (which you don't actually know, just suspect) that she wouldn't have been, so why would the research she did not be relevant to your \"family history\"?",
            "You could say that, since grandma told you in front of dad, you assumed he knew.\nI agree with those who say that it's far enough in the past that it's not a big deal anymore, and your dad is far enough removed that it shouldn't upset him, but you never know. Some people just can't tolerate any insinuation that things were not as they imagined. I would just stress that this was unsolicited information that you thought he knew.",
            "[deleted]",
            "Personally I'd let it be. It's not your problem and you've done nothing wrong. In fact, the only ones who have are deceased. Not being told is something your dad will (likely) forgive his mother for and hopefully understand that it's a piece of information that's best kept from a child and just never came up when he was an adult",
            "I fail to see an issue here. Sure it was awkward but how were you supposed to know if it was a secret?  Maybe it's not even a secret. Just something that was never mentioned. \n\nIf he's upset he can talk to the people he needs to talk to to clear things up. Otherwise, just move on. Family histories are often messy and a lot of things were kept quiet due to the culture of the times. It is what it is.",
            "> 24&me\n\nI see you're also from the south.",
            "If they weren't listening when your grandma said it, then it's their fault and problem. Just because you know how to listen, doesnt mean you need to apologize to the people who dont",
            "Nobody has proof and it's way back in the family tree. \n\nJust don't discuss it more.",
            "NTA it wasnt your secret to keep either. I busted my g-grandmother too. Did DNA and family tree. Oops. Ah well. Some stats estimate a full third of kids are/were raised by a man who isn't their father and neither of them are aware.",
            "Mouth shut mouth shut mouth shut.\n\nThis is always a risk when digging into family histories and genealogy. People lose track of who knows what, people die and leave behind bombshell revelations among their belongings, all sorts of messiness can get dug up and cause problems. You learned a valuable lesson here, and it’s “don’t assume that someone knows a thing if they have never directly told you they know the thing.” \n\nThis information is now in your dad’s hands and he gets to decide what to do with it. If your grandmother told you in casual conversation, she won’t be shocked if word gets back to her that the secret is out. Your dad may prefer to drop it entirely, and I would give him the chance to do that before running off to sound the alarm.",
            "I'm failing to see the issue here,  OP. You found out a slightly interesting history based on Christian tradition, otherwise it's -no- thing.  Nothing. Ask yourself, and then ask your father, \"does this change anything? Anything at all?\"",
            "Who gives a shit about any of this?",
            "I don’t believe in family secrets, the truth always comes out- Fear, Obligation, and Guilt won’t stop me from telling the truth.\n\nMy advice is to get out of the FOG and don’t let anybody tell you to lie on their behalf or withhold the truth for that matter",
            "> When my grandma told me, it was in a casual context with my parents present (but evidently not listening to our conversation).\n\nI don't think you should feel bad for revealing this family secret.  If anything, your grandmother should feel *triply* bad about how this went down: first for actually cheating, second for not coming clean, and third for placing the responsibility of the knowledge on you.\n\nPersonally, if I was told this by a relative, I'd *immediately* spill the tea to see if it's a secret or not.  If it wasn't a secret, you're just being a bit crass with something people dealt with already.  If it was a secret, you're doing a solid to everybody in your life that was kept in the dark.  Holding onto someone else's dirty laundry is just a good way to get dirty yourself."
        ]
    },
    {
        "post_id": "db5f2o",
        "author": "ThrowShenron",
        "title": "My gf (21) often gives me (23) the silent treatment for saying no (Update)",
        "url": "https://www.reddit.com/r/relationships/comments/db5f2o/my_gf_21_often_gives_me_23_the_silent_treatment/",
        "score": 2944,
        "num_comments": 169,
        "created_utc": 1569812192.0,
        "selftext": "Just wanted to give an [update](https://www.reddit.com/r/relationships/comments/cu7rvn/my_gf_21_often_gives_me_23_the_silent_treatment/) and say that I broke up with my girlfriend last night. She blew up at me last night and I felt like our arguments were becoming too frequent. We're meeting on Tues to have a final chat as I said I'm open to getting back with her if she changes but I'm not holding out my hope.\n\nIts hard to leave when I love her so much but sadly love doesn't equal a healthy relationship.\n\nThanks to everyone in this subreddit that helped me to see the manipulation from her and her immaturity. Shit sucks but I'll survive.\n\nTL;DR broke up with girlfriend last night after frequent disrespect and arguing from her",
        "permalink": "/r/relationships/comments/db5f2o/my_gf_21_often_gives_me_23_the_silent_treatment/",
        "comments": [
            "[deleted]",
            "> I said I'm open to getting back with her if she changes but I'm not holding out my hope.\n\nThat was not smart.",
            "Word of advice:\n\nDon't assume anyone will change. It requires more effort than anyone has probably given in their entire life to change core personality flaws that they have. Usually the motivation to fix these kinds of things is a grave personal loss. Often a breakup.\n\nManage your expectations.",
            "What's the purpose of the final chat? You're broken up, end of. She can't demonstrate that she's changed in a couple of days.",
            "Expect her to say she's going to change, but don't expect it to ever happen. Leaving the possibility open isn't a good idea.",
            "I’m glad for your sake that you managed to end it, but I would be cautious with the final meet up. She may be full of empty promises to entice you back, and nothing will change.",
            "That last meeting is not a good idea. You are hurting, and seeing her say what you want to hear may cause you to regress and give it another shot.\n\nA good relationship can have issues, but one like yours where fighting is the norm and improvements don't happen are just not sustainable to become happy. You already did the hard part, which was admitting to both of you that this just isn't working. Meeting up won't make any of this better or easier. Send a text and cancel the meeting, then block her on all accounts. It makes the grieving process so much easier for you.",
            "Honestly OP you are young. Go live your life. If life brings you two back together then so be it, but I wouldn't put too much energy into this relationship especially since it's only 6 months in.",
            "Six months is way too soon to be dealing with this level of toxicity. You’re both students, and maturity demands that some things (financial responsibility, good grades in the courses you’re paying for) take precedence over fun things. You’re mature enough to see it; she’s not. \n\nAlso, six months is often still a “honeymoon” period, in which you’re both still infatuated with each other. It sounds like you are, but she isn’t. (I maintain that it isn’t “love” until you’ve farted, pooped, or vomited in front of the other person and they still see you as a romantic and sexual partner, albeit not at that moment).\n\nIt’s entirely possible that had you met five or ten years later, your relationship would truly have the potential you saw in the beginning. But it doesn’t at this time. You’re better off making a clean break.\n\nAs for her - I can empathize because I was immature and selfish and over dramatic at that age. I was dumped by someone I loved, and who loved me, because I was not capable of having a healthy relationship then. BUT the break up was part of what taught me how to behave, how to get my own shit in order before being in a relationship. Poor actions have negative consequences, and nobody is required to sacrifice their mental and financial health for the sake of love that isn’t mutual.\n\nGood luck!",
            "I just want to reinforce that you would not be in the wrong to cancel the “final meeting”.   This is just giving her the opportunity to ask for s second chance. If you do not want to give her another opportunity than you should cancel the meeting.",
            "[deleted]",
            "From my own personal experience- I used to be in a long term relationship for almost 3 years. We fought a lot but mostly because he was always disrespectful or just a plain asshole- the things we fought about weren't important things that justified why we were fighting. It was mostly him telling me how horrible I was, whereas I always put his emotions and feelings first etc. We broke up for a week last year, he came back saying he was wrong etc, I only gave him one chance. We ended up dating for another year and a half and let me tell you- he didn't change in a year and a half. I doubt that she would change in a week.",
            "As u/Finn_Finite said in your OP: \"Also, a hard fact of relationships: **sometimes love isn't enough.** You can love each other to bits and still not be healthy for each other.\"\n\nOP, you will find someone you also love to bits, who will be healthy for you, and you will be healthy for her.\n\nGood luck to you!",
            "OP don’t trust the upcoming good behavior, she’ll bounce back to normal when it’s “safe” to do so. She’ll be on best behavior Tuesday so good luck",
            ">love doesn't equal a healthy relationship\n\nSomething I needed to hear tbh.",
            "Remember, the silent treatment is a form of emotional abuse. Abuse victims often feel compelled to accommodate their abusers, or take blame for the tone of their relationship. As you fall into this category I am urging you not to go that route. With abusive people there is never a happy \"final chat\" that leads to major change. You cannot change her.",
            "the reason you shouldn't be open for her to change is that it's not going to happen but also it's not fair to her. personal growth never, ever comes from external pressure. for her to become a better person, which is what you want because you love her, she needs to feel the consequences of her poor choices and choose to change on her own for the next fella. you will be doing both of you a favor by not leaving this door ajar.",
            "\\>  I said I'm open to getting back with her if she changes \n\nDon't get back together with her. She will not change.",
            "That last chat sounds like a terrible idea. What about her behavior so far makes you think she will change at all? She has shown you at the current time she is incapable, and people don't change their chronic behavior over night, not even over a month. It take a lot of deep introspection and self awareness that she has shown she lacks.\n\nI say cancel the last meeting and cut your losses.",
            "\"Love doesn't equal a healthy relationship\" Well said! It helps me to remember that. This should be a motto or something among people trying to escape or recovering from dysfunctional or abusive relationships. 👍\n\nAlso well done on choosing to end this relationship. I know it's not easy to break it off with someone you care for, even when it's ultimately the best thing for you both. You'll be alright :)",
            "Big ups to you for making a decision like this at your age.  You'll feel better about it down the track",
            "i also just went thru a bad breakup. ex bf was super manipulative and an almost compulsive liar. we can get thru this, im here if you ever need an ear to listen to ya",
            "After reading your original post and coming back to this update, I felt such a huge relief wash over me. I'm glad this heavy weight has been lifted off your shoulders. You can't stay in a relationship where the other party refuses to compromises and always wants their way to be done. I think you should just focus on getting high grades and completing your studies for now. Being immersed in your study will distract you from the heartbreak and hopefully help you move on. \n\nI'm personally against having the 'final chat' as this leads to reconciliation and a cycle of regret and toxicity. Please think hard on this. Can you stand another day of an unhealthy relationship? Another week? Month?\n\nDon't let other people take advantage of you again specially when you're currently not in the right headspace after the break up. Focus on yourself first before you start looking for a new relationship. \n\nI'm hoping this last chat is not a reconciliation chat and that you heal soon.",
            "yeah, sucks, but probably better in the long run that you dont tie your finances to someone who thinks \"dipping into your overdraft\" is a reasonable solution.",
            "> love doesn't equal a healthy relationship \n\nPerfectly put.",
            "Lol I wouldn’t even give her that blessing since she wants to act like a child. How you react is teaching them how they can treat you. actually have that talk with her and give her the silent treatment the whole time then at the end of it be like “is that all?” Then get up and LEAVE KING",
            "She's not going to grow out of it over the weekend, but if she cares, she may make an effort to work on it.",
            "When the arguments become too frequent and disrespectful then it's time to move on and find someone who balances you supports you. Good luck, your young and she's immature and your be okay.",
            "To speak from my own experience. Do not meet up with her again. \n\nWhile in college I was in a bad relationship where my needs were not on equal footing. I caved multiple times to be the nice guy and spend the time with her that she was begging for. Time and energy were taken away from school and my job. In the end, my grades suffered because of it and I missed out on the promotion I deserved. \n\nI finally came to my senses in the last week or two of the semester (too late to salvage my grades but you live and you learn). I went to break up with her and it went incredibly poorly. She spent hours crying and I tried to be nice and comfort her when I really should have left. The next day I felt like shit. It kept eating away at me until I broke and went back to see her and make up. Sure she was happy but a few days later I finally came to my senses and saw all the damage that relationship had done. \n\nWhat should have been a one time conversation to break up got strung out over several days and made everyone miserable. Please don't repeat my mistakes. Value yourself and your life goals. If someone gets in the way of that, they don't support you like you deserve.",
            ">Its hard to leave when I love her so much \n\nBruh, you dated for 6 months and couldn't even make it out of the honeymoon phase without breaking up.",
            "Good for you for leaving. Classic narcissist.",
            "“Love doesn’t equal a healthy relationship” that’s the quote of the dang year. We can’t love people into changing when they don’t want to and so many people just don’t get that. We should love others but if they become too poisonous then at some point you need to know when to walk away. Good on ya for knowing it was time to walk away.",
            "No one has time for the silent treatment, Stewart.",
            "Good on you for leaving her. Your graduate with is most important thing right now. She clearly has no sense of boundaries.",
            "You made the right call",
            "This just screams immature girlfriend. Which is so sad because there may be a future when she grows up. \n\nMy husband and I have been together since we were 18 and in my early 20s, we went through a phase of me exhibiting toxic behavior. Like name calling during fights, saying “I hate you”. He was the type to shut down during fights and not want to communicate at all so I would try and goad a response. We’ve been together for almost 14 years now and we have majorly worked on our issues and while things are not perfect, I cringe looking back at some of the immaturity and learning we needed. I’m glad he didn’t leave me but I give myself a lot of credit for the work I did on myself. If she isn’t the type to make an effort to change, you’re gonna be miserable. If she doesn’t see her problems, she may never change.",
            "Good for you OP. Hopefully you can find someone who is more on your level regarding communication skills and maturity.",
            "\"Its hard to leave when I love her so much but sadly love doesn't equal a healthy relationship.\" \n\nThis!! You're probably going through a really tough time right now, but this is the exact perspective to have and you're doing the best you can. So many people don't get this until way later, so good job on coming from a healthy mindset!",
            "Be careful about the final chat.... But you haven't been dating long enough that you should need one. Perhaps this is best left as a learning experience for everyone involved.",
            "Just be cautious about promises/change that happens out of desperation. It often isn't a true change and they will revert back to their old ways.",
            "Don't do that final chat. That's not going to end well. She will swear she will change for you, you'll give in to the tears... Then trapped again. \n\nYou can do better. People cannot change overnight.",
            "Imo final meetup is a bad idea i tried it w my ex and she said she wanted to still be friends and it was a very awkward lunch which was followed by 2 wk of her calling and txtn me sayin nice things and basically justifying everything when in reality i was just a stepping stone and used pretty much to piss off her rich parents who were sick of her shit",
            "the final chat is going to be a waste of time. Either she promises to change (she won't) or she wants you to accept that you don't deserve better.\n\n&#x200B;\n\nBe done with this one OP. Six months in and arguments because she can't get her own way? Not at all worth it!",
            "Better ends it now rather than later.\n\nIn any case, I just want to throw it out there. Some people may have a hard time articulating themselves when they get angry at something or someone. This could be perceived as that person is giving someone silent treatment. Sometimes they just couldn't help it.\n\nBut there is also another kind of people that deliberately giving silent treatment  to make another person feel bad. The only way to tell is to get to know that person better.\n\nMy point is, this might not be the last time you're in the relationship that encounter silent treatment. Don't count that as the deal breaker alone.",
            "She won't change. Dont waste your time hoping she will.",
            "She won't change her behaviour overnight, so I suggest not getting back together - don't hold out hope for that. You shouldn't even be meeting up with her either, that's a bad idea, just start moving on.",
            "As a child of someone who frequently used silent treatment, ABORT MISSION",
            "Final chat? Oh lawdy. Move along. No breakup happened here. Just a list of ultimatums that will be made and broken and remade and broken in the months to come.",
            "Read the original post and it sounds like immaturity to me, not this evil manipulation that people apparently made it out to be. She just needs to grow up and learn from her mistakes. Doesn't sound like something to break up over if the relationship is otherwise good and satisfying. Sounds like something that needs to be talked about and worked through. \n\nPeople are so quick to end relationships, especially on reddit. When you really love someone, you work through your problems and give them the opportunity to change and fix it. Now if it continues on despite multiple opportunities for change, then you should consider ending it. People are not disposable. It's not like you got a bad phone and just need to chuck it and get a new one.",
            "I think that you should take a lot of the promises that she makes with a grain of salt. I once had a girlfriend who kept bringing up a specific past fight and would actually blow up on me when she thought about it or something happened where she was triggered to it coming to her mind. Eventually I told her i was done and broke up with her. She then told me that she was wrong, that she was working on it not triggering her. So i took her back and things were good for about two weeks and then things went right back to normal. I'd hear her out, but just keep that in the back of your head that stubborn people arent just going to stop being that way. If you're in grad school figuring things out for yourself, it might be better for you personally to be single and not have those issues taking a toll on your grades and furthermore even your bank account. Like you said, love doesn't equal a healthy relationship and I personally don't see it being healthy again, even though it once was.",
            "She is going to do everything in her power to show she has changed and get you back.  All while not changing at all.  Be ready.",
            "Just reading the original and as someone who was extremely bratty during their relationship, don't do that to yourself. When I was with my bf, my biggest thing was making sure at the end of the day we were succeeding and focusing on school. Don't leave it open for change unless she does, maybe a break period but the thing is you're 23...you have the time to focus on school and date after.",
            "I'm sorry you broke up with someone you love, but it sounds like it was for the best. Please look up something called \"love bombing\" and keep it in mind if she suddenly starts behaving in a similar manner to you and you think you should give her another chance.\n\nSomething I wish I learned sooner was \"actions speak louder than words\" - people are very good at playing sorry and apologizing and saying all of the \"I'll change! I swear!\" promises... but often that good behavior goes away after a couple of weeks. So IF you do decide to give her another chance, keep her on probation so to speak for a few months and pay attention to whether change has actually happened, or if it just happened for a week or so to get you comfortable again.",
            "I've gotten back together with girls because of the final meeting and lived to regret it. You have a lot to lose and  nothing to gain from that.",
            "Shes one step away from being the perfect girlfriend.. just apply the bag.",
            "OP, I highly don’t recommend the final meet up for a few reasons;\n1. She showed you her true colors, believe them. \n2. Meeting up again only gives her a chance to convince you otherwise, despite her behavior being crystal clear. \n3. The feelings are still very raw, and break ups are hard. It’s very easy to fall back into a relationship with the wrong person when you are in a vulnerable place.\n\nI really sympathize with your post OP. I just very recently ended a relationship where he would exhibit the same behavior. When I would set boundaries in the relationship that he didn’t like, he would furious. One example of this was he believed I should also delete my Snapchat and Instagram because he (on his own terms deleted his). He somehow convinced me on Instagram, but I pushed back on Snapchat. He was livid, according me of suspicious behavior for not wanting to delete it. This is phyco  level controlling, and this was close to 2 years in. It always starts small in the beginning, don’t be fooled. \n\nYou can absolutely love someone that is not the right person for you. I left that relationship still loving him at the time, but knowing it was the right choice for me. Stay strong OP. Please don’t get sucked back in and fooled like I did for 2 years!\n\nFeel free to PM anytime if you need someone to talk to!",
            "Save all of your texts and communications from her. Maybe record what happens at your last meeting. I broke up with my girlfriend in college and she went and tried to get me kicked out by telling them I raped her. Girls get extremely vengeful after breakups.",
            "My girlfriend does this too\nCan't blame her tho she's mute",
            "My ex would do the same thing to me. I fought way harder than I should have. J even tried to let her back into my life after 6 1/3 weeks of no contact, but she took the first opportunity she had to hurt me again, then tried to blame me when I got upset. I'm now 2 1/2 months into a second period of no contact. It's easier, but J still miss her sometimes and want to talk to her. We had crazy gokd chemistry, but it was also very volatile at the end. Keep your head up. It'll get easier.",
            "Don’t do this “final chat”. There’s nothing more to say.  She’s not going to magically respect you - the reality is she’s young and has a lot of growing up to do, away from you.  Like actual years of working on it.  Take it from a 28F who’s been as immature as she is.  Yes, everyone grows at their own pace, but you’ve only been together 6 months and this is how she treats you... you’re honestly just too young to put up with it.  You might have another 1-3 partners before you settle down so consider that.  Dating is about finding the right person for you, not finding someone who needs to change their whole attitude.  I highly suggest you go your separate ways and focus your energy on things that will benefit you in the future. Good luck OP!",
            "Dude, don't do it. She will act all nice and sweet you to get you back. She might even refrain from acting immature for a period of time just to please but she showed how she truly us. I'm not saying she is an awful person but she came off very self-entitled, immature, and manipulative to me. She is the kind of person who usually put themselves first. She probably does not see this. Bro, just break up with her. It doesn't matter how much she changes, if you ever get married or have kids, sooner or later, her ugly side will show up and you will be stuck. Although, I do believe people change but do not risk your future this way. Just leave. This might sound bad but there are plenty of fish in the sea. Better to be heartbroken for a few weeks than have your life ruined.",
            "Life is too short to date shitty people. Don't meet up with her. Block her and move on. Focus on your future, your school and you! There are so many other sweet ladies out there who would give you the love and respect you deserve.",
            "You are 23 years old. Cancel the meeting and go no contact.",
            "People dont change - they can pretend to for a while but always slip back into old habits.\n\nDon't go back, it always ends up the same.",
            "You can't change anyone ! That will come from within !\nGood Luck Brother 👍",
            "People don't make real, lasting change very quickly and not without a serious shock to the psyche that causes us to take a step back and really evaluate our own flaws. Sadly, losing someone she loves is probably one of the only catalysts for that that she'll experience. If she's really going to change, your reunification can't happen now, but maybe in the future if she's had some introspection time and worked on herself.",
            "You sound pretty mature for your age. At one point in my life I did the same thing your girlfriend does. Communication is key, you have to talk shit out.",
            "Dude, no one makes drastic relationship changes between Saturday and Tuesday.\n\nJust because she might be telling you what you want to hear doesn't mean there have been changes.  All it means is that she said something different.\n\nYou should call her up (or possibly text to keep it concise - depending on what your conversation was the other day) and tell her you're sorry but the relationship just isn't working and you won't be meeting her tomorrow.\n\nYour gut says this is a bad relationship.  Trust it.",
            "You made the right move, if she doesn't respect t you saying no walk away.",
            "Same mate, I had a girlfriend who would give me the silent treatment and we'd argue like crazy about stuff. I loved her to pieces, and still love her we lived together and had a life together, but I didn't see anything changing so we had to end it. It sucks.",
            "People don't change friend. They say they will but they never do",
            "[removed]"
        ]
    },
    {
        "post_id": "fpbwdk",
        "author": "PinkxThePrincexx",
        "title": "UPDATE: My (20F) GF (22F) expects me to play videogames with the person she cheated on me with, like nothing happened.",
        "url": "https://www.reddit.com/r/relationships/comments/fpbwdk/update_my_20f_gf_22f_expects_me_to_play/",
        "score": 2937,
        "num_comments": 391,
        "created_utc": 1585230972.0,
        "selftext": "This post is an update to this post: [https://www.reddit.com/r/relationships/comments/fkv4g1/my\\_20f\\_gf\\_22f\\_expects\\_me\\_to\\_play\\_videogames\\_with/](https://www.reddit.com/r/relationships/comments/fkv4g1/my_20f_gf_22f_expects_me_to_play_videogames_with/)\n\nHey everyone. Thanks for all the comments.  \n\n\nAfter the post, I talked to her. Telling her that something felt shady about the whole cheating accident, I asked her for details, that I needed her to be honest.  \n\n\nJust a reminder, before this, she told me it was not a big deal, just some sexual texts. Turns out, it was that, plus nudes, plus bonding, plus other sexual stuff. It was at the point she thought about leaving me for him.  \n\n\nI was dumbfounded. She admited that despite telling me she stopped talking to him, she didn't. That, in her point of view, he saved her life, as he was the only person in the world she felt comfortable enough talking in details about her suicidal thoughts, and that \"sex was just to thank him, he deserved it\".   \n\n\nShe refused to stop talking to him. I told her that, in this case, we'd break up. She told me to grow up, we broke up. She went CRAZY and sent me images of her hurting herself, saying she's kill herself and asking her friends to tell me she'll kill herself.  \n\n\nAfter some time, she calmed down and apologized. I told her that at first I wanted to break up to heal, trust her again and maybe build a new romantic relationship, but that it was impossible after the crap she did.   \n\n\nI'll focus on myself rn, but I'm still feeling dependant, and I still... love her. We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine (which could end at the end of the month, or in a month, depending on the situation.)  \n\n\nI know you told me it was a bad idea, but heh, I need time to change everything. I'll handle it. My therapist also told me not to make rash decisions like cutting her off completly, but to focus on myself. I'll do that.  \n\n\nThanks again!\n\nEdit.: So guys. You realise I said that we would consider a FwB relationship if everything seemed fine after the quarantine. That nothing is set in stone. I... Thank you for your support. I'm thinking a lot rn. Also, my therapist didn't tell me \"don't cut her off\", she told me \"don't make rash decisions, as you have the tendency to live through other people. Make your own choices\", because I've told her about asking for advice on reddit. Thanks again for all the comments. I'm reading them all! OH and PLEASE remember, we're two women.\n\ntl;dr: my (20F) GF (22F) cheated on me, and guilt trip me about it. We broke up. She went crazy.",
        "permalink": "/r/relationships/comments/fpbwdk/update_my_20f_gf_22f_expects_me_to_play/",
        "comments": [
            "I would not bother with FWB with this person. She's not trustworthy, and seems extremely dramatic or possibly unstable.",
            "> We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine\n\nPlease don't do that. She will just suck you back in to her drama. \n\nLove is a hard habit to break. Your feelings of love for her are leftovers from before you knew who she really is.",
            "She will use a FWB relationship to keep messing with your head. You will always remain dependent on her as long as you keep her this close in your life.",
            ">\"sex was just to thank him, he deserved it\". \n\nThat's some intense mental gymnastics.\n\nYou dodged the bullet neo.\n\nIf she threatens to kill or harm herself again, call 911 and treat it a serious threat. \n\nIf people are just doing it for attention this can be a serious wakeup call when they are suddenly on the hook for the ambulance and hospital fees, and if they are genuinely suicidal it can save their life.",
            "Why would you keep this person in your life, let alone in your bed?",
            ">My therapist also told me not to make rash decisions like cutting her off completly, \n\nI think your therapist is dead wrong here. And if she sends you texts like she did again, call the police and have them do a wellness check. What she's doing there is abusive.",
            "> My therapist also told me not to make rash decisions like cutting her off completly\n\nWith all due respect to your therapist: it would only be a rash decision if the upsides of remaining in contact potentially offset the (self-evident, numerous and dramatic) downsides. \n\nWhich, given that she lied to, gaslighted, mocked, guilted and emotionally blackmailed you, I'm having trouble discerning at the moment.\n\nGood for you for pulling the trigger!",
            "Use this quarantine time to work on yourself and figure out why you're so dependent on someone who treats you like shit. You don't love her. You love the her you knew BEFORE she started fucking around on you. She's not that person anymore. \n\nStop wasting your time on her. She doesn't deserve you.",
            "> We agreed on a friends with benefits kinda relationship\n\nThere is no way that will end well.",
            ">She went CRAZY and sent me images of her hurting herself, saying she's kill herself and asking her friends to tell me she'll kill herself. \n\nManipulation 101.\n\nOh, but I thought her affair partner was the only person in the world she was comfortable opening up about this stuff to? Tell her to go waste his time instead of yours.",
            "I mean this is in the nicest way possible, but you’re a complete idiot if you’re considering a FWB type relationship with this woman after everything she dumped on you. What good do you possibly think could come of that? (besides sex, and being celibate should be preferable to that)",
            "If you go anything other than hardcore no-contact, you'll regret it. FWB - ~~you want a baby with her?~~ Don't put your emotions over your head. It'll be the worst decision you've made yet in life.",
            "Dont be a coward. Break up, deal with the pain that comes with it, and find a healthier relationship. You're prolonging your own suffering.\n\nBreak up on text if you have to, then block on all platforms. Ghost her. She doesnt deserve better. Any attempt for civil discussion will result in her emotionally manipulating you into staying (I.e. threat of suicide, FWB instead of no contact, etc).  Grow a spine.\n\nAlso next time she threatens suicide, call 911.  Either you call her bluff (99% likely) or she gets the help she needs. Either way, you're not a prisoner to her.",
            "Perhaps your therapist meant you should make a *reasoned* decision and cut her off. \n\nFWB with a cheater you’re still in love with is like trying to ride a vicious untrained horse with a burr under its saddle.",
            "I doubt you have a therapist because no sane person let alone a licensed therapist would suggest you not cut her out of your life. Those are contradicting suggestions, don't cut her out of your life, but focus on yourself? That makes no gosh darn sense. \nI love my ex gf, but when she cheated on me my therapist told me to move on and focus on myself.",
            "[deleted]",
            "> We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine (which could end at the end of the month, or in a month, depending on the situation.)\n\nMy dear, sweet, simple girl:\n\nThis is a godawful idea. Do not do this. This will be completely impossible to maintain. You are asking, *begging*, for another blow-out crazypants meltdown by agreeing to this. Fucking *don’t*. \n\nIt’s over, let it be over. Stop poking the corpse and getting your hopes up when it twitches.",
            "Well, this is a terrible update.",
            "I'm so sorry this happened to you. You deserve so much better than what she has to offer and I hope when the quarantine ends, you're in a place where you realize that. \n\nYou are not unlovable or undesirable. Whatever she found attractive or enticing about you, I garuantee someone else will. She's not your only option or last resort for intimacy. And quite frankly, she doesn't deserve any sort of companionship at all from you after everything she's done.\n\nYour ex cheated on you, lied about it, gaslit you about it, never took ownership for the mistake she made or pain it caused you, and tried to emotionally manipulate you into staying in a really gross and inconsiderate way by trying to make you responsible for her mental and physical well-being, despite knowing the struggles you've had with your own mental health. Throw the whole person out, sis. She's trash.",
            "I’m gonna sound mean. I’m being blunt and I genuinely want the best for you. I remember this specific brand of online nerd drama shitshows from when I was your age. Intended tone: friend at a bar telling you you’re so much better than this bullshit. \n\n1. Obviously don’t do FWB with an ex with this much recent history. \n\n2. Nobody involved in this was mature, including you. \n\nMaturity includes knowing how to assert boundaries and standing up for yourself. \n\nYour prior post mentioned that “of course” you would be fine with her talking to him on an RP server. \n\nLook up the geek social fallacies. Long story short, this idea everyone has to be cool with everyone and included in everything is unrealistic and unhealthy. \n\nIf they worked together at a long term career company (vs. at a job she could easily swap for another) that’s an “of course” they will have to be in contact. If they were in the same college class — same thing, but they shouldn’t study together outside class or work on class stuff together like essays. \n\nAn RP server is legit way down on the list of acceptable places they HAVE to meet up. Asking her to block him on the server and on other platforms would have been perfectly reasonable because RP and Smash are fucking hobbies. Sometimes this happens in friend groups - two people can’t associate. People work around it. \n\nThe fact you thought that “of course” the RP server contact should be allowed shows you are willing to put up with and accept more shit than you should be. \n\nMy point is, take care of yourself first, and your boundaries. I’m a strong believer than most boundaries are non negotiable. Prioritize the important boundaries to protect yourself.\n\nYou’ve seen first hand what happens when someone  keeps talking to a sexual partner. Your ex is now with that guy. You’re going to catch feelings again if you keep seeing her. Just cut the losses and move on unless you want this to repeat. \n\n\nBy the way, regarding geek social fallacies, here are the two I think apply\n\nGSF1 - Ostracizers are evil\n- idea that excluding someone from a group makes you an asshole\n- there is a difference between petty reasons for exclusion and good reasons for it\n\nGSF5 - friends do everything together\n- you don’t have to do everything together as a group\n- this includes doing stuff with people like the guy\n\n\nEDIT: I snooped and saw your post about how the ex won’t admit cheating. \n\nAdvice: relationships aren’t courtrooms. You do not need evidence to believe what you believe. Some things cannot be argued. \n\nEx admitting they cheated changes nothing. You know they cheated. You know at the least they did shitty things. A search for admission is a search for validation or closure or communication. The first two come from within and you certainly don’t need the third with her.",
            "You need to move on, this is just rediculous. Clearly you have low self esteem which you need to work on because this girl fuckin sucks.",
            "Lol.  I did an FWB with an ex girlfriend like this.  What I didn't know, was that she tried to get herself pregnant so I'd come back to her.  Luckily I escaped. \n\nIt's not worth the drama.  Move on.",
            "You need to cut this girl off completely, go no contact, and go take time to heal. Thank god that you made the decision today to not get back with her, but you need to be able to pull yourself away from her orbit. If you do that, in 2 months you will look back and think that you were crazy for even considering continuing to hang around her. She has already shown you that she is a liar, and she is a horrible person for making you dig down to find the truth.",
            "OP you need a new therapist.\n\nShe cheated on you she can go to hell.",
            "OP you need to block this woman and be done. The sooner you completely separate yourself the sooner you will start to feel better.",
            "You really really want to bang  someone who threatened to kill themselves all because they got caught literally cheating on you. Dude, you deserve better than this.\n\nIf someone else told you something like what would you say to them? That’s it’s okay to be emotionally blackmailed by your cheater ex?",
            "NOOOOOO, do not go the FWB route dude. I'm telling you from my experience, from reading others experience here and from my friends' experiences, this is  bad idea.  **I'm going to guess that you two still text everyday, she still tells you about her feelings and says I love you....  if so, you are still in a relationship my friend.** Wear a condom please. \n\nShe's going to stay latched on like nothing happened and threaten to kill herself again when you break it off again. She's not healthy mentally and you don't need to deal with that anymore. *Why go through breaking up with her twice or more?* **She has learned nothing since you broke up, she is still texting the other guy.** Tell her parents and friends that she is their problem. Not yours. If you refuse to cut off a negative person in your life, then you need to keep her at a distance at least. Start inching away to focus on yourself.",
            "Please don't enter into a FWB type of connection with a suicidal ex!\n\nIt will end badly, period.",
            "You need a new therapist if he/she is suggesting NOT to remove ties with the person who worsened your mental health by taking the actions she did. Do not EVER contact that person again. You don’t need to be around or with somebody in any way that makes you second guess your character to the point that she did. There are plenty of women out there that are actually fucking faithful to their partners, and understand how wrong it is to say that they love somebody, and then fuck some random body. She sounds extremely narcissistic and has no type of personal accountability. Don’t set yourself up for failure again like that with her.",
            "> I'll focus on myself rn, **but I'm still feeling dependant, and I still... love her.** We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine \n\n\"I know I'm an alcoholic, but I'll only drink beer, not spirits, and not every day, so...alcoholism handled!\"",
            "Good on you for ending it, but don't do the fwb thing - you need to get her out of your life completely; if you don't you will never fully heal or be able to move on. She is unhealthy to have in your life in any capacity, and if you don't cut her off entirely *now* while you have the distance of quarantine you will regret it for the rest of your life.",
            ">She refused to stop talking to him. I told her that, in this case, we'd break up. She told me to grow up, we broke up. She went CRAZY and sent me images of her hurting herself, saying she's kill herself and asking her friends to tell me she'll kill herself.\n\nShe cheats on you, tells you to grow up because you're struggling to pretend that being cheated on is fine, refuses to stop talking to the guy she cheated on you with and then makes her friends tell you she'll kill herself if you leave her? This person is a really terrible influence on your life. Her friends are idiots for actually passing on her threats as well because she's blatantly trying to manipulate you and they don't seem to care.\n\nThe message she's trying to send is that she should be able to treat you as badly as she feels like, and your only option is to go with whatever she wants - demanding that you get over being hurt and threatening you into not leaving when you can't. She doesn't care about your wants or needs is immature as fuck. She's the one who has a lot of growing up to do. Hell, she even managed to reframe the cheating as if it's no big deal and it was something she *needed* to do. Take any apologies she made previously and throw them straight in the trash because she's not actually sorry for hurting you.",
            "FWB is the worst idea ever dude. Dont do it.",
            "Do not start a FWB situation with someone you have so much baggage with!!",
            "I think you really need to cut all ties with this woman, she has a back up to give her all the attention in the world. I know it's difficult to really hard to swallow and digest this all at once but stay strong. Self preservation mode is the most important thing any human needs to remember.  \\*internet hugs\\* Glad you were sensible enough to do as much as you did. Congrats on starting a new chapter forward, big step. Proud of you!",
            "You should never have a FWB relationship with someone you don't trust, dude. Ever. Ever. A million things can go wrong and she will totally fuck you over because, as she's show, she doesn't care about you. \n\nShe threatened to kill herself to keep you in line. She wants a FWB to keep you in line. She clearly sees you as an uppity toy that needs to be brought in line. This woman clearly uses sex to keep people dancing so... Stop showing her it works. \n\nHere is an exercise that helps me: when you were young and dreaming of the person you'd one day meet who loves you, were you eagerly awaiting someone who without remorse cheats on you, tells you you're the problem, threatens to kill herself, and then drags you back in with sex like a fucking angler fish? \n\nUnless you had a questionable childhood, I'm gonna say no. I'm also going to say you don't actually love or miss HER, you love and miss the person you thought she was. But she isn't that person. She never was. Shit she's spewing aren't beliefs you get over night. This is who she ways was but managed to keep hidden just long enough to pull you in. \n\nPeople make mistakes and they can change, but look at how she behaves. She can't change because she can't take responsibility. She'll pay lip services and say whatever is needed to keep you staying there a bit longer but we have seen this play out so many times before. \n\nUltimately, don't have sex with her just because you are dependant on her. Let the scan heal because the sooner you heal the sooner you can get back in the game and find someone who will love you. I know it's scary, but once you're with someone who genuinely cares for you, communicates well, builds a life with you, you won't even be able to remember this horrible person. But if you keep lingering, keep playing her game, it'll hit your self esteem. \n\nSo, grab your dignity and go. She's not a safe person to be around.",
            "In my experience, if someone threatens self-harm or suicide, report them to the authorities immediately. If they're not lying, they will get the help they need, and if they're being manipulative, they will hopefully learn not to do that in the future if they get a visit from the police and/or have an involuntary hold at a psych hospital.",
            "I remember being 20 and putting myself and other people through hell.  I'm almost 50 now... Knock that shit off OP.  Self care now.",
            "Are you fucking crazy, considering taking up any sort of relationship with her?? She has threatened suicide and has self harmed to get her way. SHE HAS THREATENED SUICIDE AND ACTUALLY SELF HARMED TO MANIPULATE YOU. This seemed like a perfectly rational and proportional response for her - for breaking up because SHE CHEATED ON YOU, LIED ABOUT IT AND THEN DISMISSED YOUR CONCERNS.\n\n???!?!!!\n\nJesus, Mary and Joseph Stalin, what a fucking dumpster fire of a situation. Are you suffering from self esteem issues?? Because I don't see how you think this is normal? You think you deserve to have this happen to you??\n\nI can't believe I'm typing this. RUN, RUN SCREAMING FROM THIS PERSON BEFORE YOU HAVE YOUR LIFE RUINED",
            "Dude. GTFO immediately.  FWB isn't worth having this person in your life. Run. Run. Runaway for her baby!",
            "she cheated on you, guilt tripped on you and you still want to see her? have some self respect.",
            "Don’t be FWB with this person... and honestly, your therapist is dead wrong if she thinks you shouldn’t cut your ex off. She’s abusive. Cut her off and be done with it.",
            "Girl just end it. If she threatens suicide again call 911 and let them give her the care she needs. Then block her everywhere. She's not your responsibility and what she does to herself is her choice.",
            "If your therapist says to not do anything rash then okay.... But from personal experience its almost always better to rip of the bandaid with this type of person. She's shown herself to be a liar and and be emotionally manipulative. When you stop being FWB, she will pull the same crap again and you will be pulled into an endless cycle. Do yourself a favor and cut her out. \n\nThis is not coming from a place of judgement, I've been through something similar and it sucks. Loving someone but knowing how bad they are for you is the worst feeling in the world. I think sometimes we can all be a little too forgiving because we see the best of people, but its so important to take care of yourself and not more negative people drag you down! I would write down in a notebook everything she's down to lie and manipulate you. If you ever feel the urge to take her back, please read that note and remember how she made you feel! You don't deserve to be treated poorly and although it feels scary now, there is someone out there for you that will not lie and harm themselves to get their way.",
            "Get out of there. Have some respect for yourself and let this girl go. You are better and deserve better.",
            "Speaking from personal experiences, FWB with former exes is near-impossible under the best conditions and with better people. This girl is absolutely unstable and you should rip off the band-aid and go no-contact. No need to justify it to her, just do it.",
            ">I'll focus on myself rn, but I'm still feeling dependant, and I still... love her. We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine \n\nOP, NO.",
            "Cutting her off completely isn't a rash decision, staying in contact is. Really.",
            "Dude, you need to stop associating with her. Don't do the fwb thing. It's a really stupid idea. This girl has waaaaaay too many issues. Stay away from her. She's nothing but trouble.\n\nEdit: also, your therapist is smoking crack. Seriously, they're completely wrong. Cutting her off is EXACTLY what you should do.",
            "Your feelings for her are never going to subside as long as she's still in your life because that's just how people are. This is why people always say to cut contact. \n\nAt the very least just cut contact for a period of time while you gather your thoughts and get your feelings straight. Take some time on your own to think about it. \n\nThink about whether or not you really want the drama because that's what you'd be opting into.",
            "Your gf is a master manipulator. She cheats on you, and does all of this stuff to gaslight you but somehow you are also an equal contributor to the problem. You did nothing wrong and you should act in accordance with that. Her still talking to this guy after you told her not too is deal breaker sorry. She has no consideration for your feeling. Only her own. You are young my friend. There will be many more who you will meet who are worthy.  You have all the time in the world.",
            "Do you really love her or love the person you thought she was?  Because if it's the latter, she isn't that person so there's no reason to love her.  And having an FWB with her is a bad idea.\n\n1. She's an unstable and manipulative person.\n2. she's an untrustworthy person/ a liar\n3. She cheated on you and has no remorse for her actions\n4. She doesn't care about your feelings and is selfish.\n\n&#x200B;\n\nJust break contact with her.  She will be nothing but toxic waste in your life.\n\nAlso do **NOT** visit her alone if you don't want to end up on a true crime documentary.  \n\n\nAlso your therapist is awful.",
            "I feel like this friends with benefits thing is really bad idea. It will not allow normal separation and recovery for both of you",
            "I'd drop the rope completely. You're letting her get away with blue murder here and you'll only end up getting hurt even more. Your therapist is a muppet. How are you focusing on yourself if you're not removing yourself from the situation so you can focus on yourself!? It's not a therapist you need, it's uncommon sense",
            "Good job breaking up, 100% the right move, good for you! \n\nSeriously, breaking up with someone and continuing to have sex with them afterwards makes you (I know you havnt done it yet, I'm speaking hypothetically) a complete and utter dirtbag! This is one of the most selfish and destructive things you can do. A person who wants you back will always lie and say they are fine with keeping an exclusively sexual relationship and they can handle it. This is a lie. They are trying to get you back and you are making it impossible for them to get over you. Seriously man, don't do this, it makes you a shitty person. I say this as someone who has done it and had it done to me and I can see now how selfish and destructive it is. There is no shame in breaking up with someone, stringing someone along and using them for sex when they love you is certainly shameful. A good clean break is what you both need, you can get over one another and have happy memories of the relationship for the rest of your lives.\n\nHope it all works out for you anyway buddy, once again good u breaking up, it sounds like the best move!",
            "I fell incredibly sorry for you for being in love with such a vicious, abusively toxic resin. Unfortunately you’re going to have to find out the hard way why keeping someone like her in your life is a bad idea. Good luck, your going to need it.",
            "Uh. You're being abused and manipulated by your girlfriend. You should run. I imagine your depression will only get better once she is gone.",
            "Too much drama, cut and run. You'll be much happier in the long run. Make the choice to surround yourself with quality people.",
            "already been said but the FWB is a fuckin ploy, don't do it, it'll just hurt more afterwards.\n\nTake your losses and skedaddle cause manipulative people who cheat tend to never change. Better off learning from it and healing from the heartbreak.\n\nAt least you've got some down time to mull over it...",
            "Use all that love for yourself - because you deserve better than someone who clearly cares so little for you. Good luck.",
            "Get rid of this girl and get a new therapist. Cutting toxic controlling behavior out of your life is exactly what you need. Don’t be weak and hold on to a piece of her by having a FWB. She’ll use them to take advantage of you. \n\n Breaks ups hurt and they are hard to get through. But it’s worth it in the end. You’ll come out of it better and stronger than you were before and will less crazy in your life. \n\nGood luck.",
            "I personally wouldnt do FWB only because she literally was threatening you with her suicide when you dumped her and you cant trust her to tell the truth. If shes not telling you the truth about screwing somebody how do you know you wont get am STI from her? Be careful",
            "Glad you broke up with her. Better to be done with it all.",
            "Sounds exactly like my ex. Like. Exactly. Pretty weird actually. I cut her out of my life after she finally just crossed too many lines. Best thing I ever did for myself. I left her at 20, met an awesome girl a year later, and now I've been happily married for 4 years and we have a new son. It's way better in a healthy relationship.\n\nI'd say cut all ties with her. It's what I had to do long ago and I don't ever look back. It's hard to do at first, but she's obviously very very toxic and any contact with her will only make it much messier.",
            "She'll stab you in your sleep.\nBring your own condoms so she can't trap you.\nEdit: because you're a woman, no need for condoms I guess. But better just to walk away",
            "Hey man, I know it's probably a little overwhelming having so many strangers telling you to remove someone you love from your life, but please hear me out.\n\nI really don't see how this FWB makes your mental health any better. Look at it from her perspective, she had a relationship with you, then she found this other guy she was interested in too. She realised you'd never be ok with her pursuing a sexual relationship with him, so she cheated and kept it a secret. Now you've 'broken up' but you're still in contact, and you're still sleeping together. So basically, you've given her the greenlight to do what she wanted all along: be with both you, and GIH. She said the nudes were a 'reward' but you're not stupid, she enjoyed the attention, imagine there was a girl out there who got off on nude photos of you, and was willing to reciprocate? Wouldn't that make you feel gratified? Now she gets the both of you fighting over her, win win for her.\n\nWhat is this FWB arrangement not giving her that you two's relationship was? And how are you going to feel when she starts talking to/sleeping with other guys? Because that doesn't sound like it's going to be healthy for someone already struggling with depression. I also think you have to confront the possibility that dealing with someone suicidal who self harms and talks about her issues with affair partners over the internet on a regular basis has probably been making your issues worse all along.\n\nLook, some of the advice you're getting here may be harsh, but what it comes down to, is that we're trying to save you the time and heartache of two of the most likely possible outcomes:\n\na) Being in contact with her makes it impossible for you to get over her, meanwhile she meets someone else, be it GIH or a new fling, and you have to sit there watching it all happen in real time. Eventually she cuts contact with you to make her new bf happy, and you end up having to try and move on however much further down the line anyway.\n\nb) neither of you are able to get over each other, and find no one else permanent before eventually getting back together because it's the easiest thing to do. But now there's all this bitterness because you broke up the first time, and the whole time you were broken up with she was still trading nudes with GIH or others. You basically end up back where you started but even worse.",
            "Your therapist is insane, you still getting exposed to pshychological damage from your ex... And emotional black mail... I advice you to change therapist or questioning her/his advice.",
            "FWB is for people who don't really habe any strong feelings towards eachother, you both have feelings - it would be a huge mistake.",
            "I really don't think you should be in a FWB relationship with your ex. Also, congratulations to you for leaving! That takes courage.",
            "Unless you are into a lot of drama, I'd suggest not picking this back up after the quarantine - or ever.",
            "Her actions after the breakup should tell you what you need to know. She tried to manipulate you and failed. Emotional blackmail is not okay.",
            "She is incredibly abusive and manipulative. She told you to “grow up” for asserting boundaries and asking for the most basic form of respect at all, let alone in a relationship. She told you to “grow up” because you wanted to end your relationship after she admitted to more details about cheating on you and continued to stay in contact with the person she cheated on you with. Really truly try to think critically about that. \n\nThe suicide threats are emotional manipulation and she is intentionally making you the villain and her the victim. Please google the cycle of abuse. Her “reasons” for cheating are disgusting. “The sex was a way to thank him”? What the hell? She has NO respect for you.\n\nIf there is a next time she threatens suicide and sends you images of self-harm, call the police and ask for a wellness check. I have a feeling she’ll stop real quick when faced with actual consequences for her actions.\n\nYour therapist is wrong here. Cutting off your ex is the right choice and the best thing you can do for your own well-being. Ghosting, blocking, or cutting off an abuser is always justified. Do not be FWB with her. Cut her off. No contact. Block. This is not going to get better. She has already shown her true colors. She was willing to manipulate and lie to you as a girlfriend and that won’t change as a FWB. You need to end this relationship with her on all fronts and move on. \n\nAnd since she cheated on you, get tested for STIs.",
            "Just read this today. You did the right thing and I wish you the best of luck with your future partner! You deserve more respect than what you were given!",
            "Came here to say humongous red flag, but I think you already figured that one out.",
            "No matter how lonely and sad I am, I'm always glad I'm not with someone wishing I was alone...\nFuck this mess",
            "Fuck this, I just got out of a 4 year relationship after breaking up and getting back together over the stupidest shit. I have complete empathy and understanding for where you feel conflicted especially right now. But honestly, she upfront is disrespecting you. You laid boundaries out and she didn’t even think of them which upfron should tell you, SHE DOES NOT CONSIDER YOU. I know this hurts, trust me. But in all honesty, despite any fears you may have; leaving this girl is a MUST. Cheaters will try and not only make you feel guilty but also make you confused as fuck to the point you don’t even know what you’re thinking. For your own benefit, leave her and if you feel depressed afterwards or lonely; just reach out to some girls and talk to them. Sometimes our fear of loneliness can be Pacified with mere interaction either platonic or intimate with someone else. It’s somewhat of a rebound but doesn’t have to be sexual.\n\nPlease save yourself from being even more hurt. I’ve been doing similar things for 4 years and I wish I had done it earlier",
            "[deleted]",
            "Just gonna say, listen to the trained professional and not the random people on the internet OP. Just as general advice.",
            "Once a cheater always a cheater bro.\n\nAlso how can you build a future relationships where she doesn’t even trust you enough to talk to YOU about her issues not some other guy? \n\nRelationships are built on trust.",
            ">I know you told me it was a bad idea, but heh, I need time to change everything. I'll handle it. My therapist also told me not to make rash decisions like cutting her off completly, but to focus on myself. I'll do that.\n\nI'm not a mental health professional by any means, so take my opinion with a grain of salt, but I'm a bit dumbfounded that your therapist would give you this advice when your gf is clearly demonstrating abusive manipulation behavior.\n\nShe cheated on you and gaslit you into thinking it was a \"you problem\" that you had an issue being around the person she cheated on you with and when you tried to break up she threatened suicide. These are textbook abusive behaviors. Your girlfriend is extremely, profoundly, and deeply unwell and it  seems unhealthy to continue to expose yourself to a person who is so incredibly toxic right now. Having a mental illness is a challenge, but it's not an excuse. \n\nI think even having a fwb type situation is ill advised given her demonstrated propensity for manipulation. My suspicion is that for folks like this it's a one-way kind of deal: *they*  get to sleep with whomever but expect you to be committed to hooking up with them only and will get upset when you see other people. \n\nBy all means, you do what you think is best for you but I'm just a bit shocked that you'd be given that advice by a therapist. \n\nAlso, this guy sounds like a MAJOR creep. If he slept with someone as \"thanks\" for helping them through suicidal ideation, that is disgusting. Your gf is mentally ill and he took advantage of her in a moment of weakness. Even if he didn't interpret it that way, he should have known better.",
            "[deleted]",
            "I'm so sorry to hear your story. What happened to you hits close to home and nobody should be put through that. \n\nI don't think your ex GF is in a mental space to be with anyone right now. When somebody is a danger to themselves or others, what they need is therapy or even medication and not the focus of their breakdown in their life. It is ultimately your decision, but I must chime in with the \"don't do FWB\" crowd.\n\nFurthermore, I think she knows she screwed up and is using your feelings for her as a bargaining chip. But I think what she did was a very clear betrayal. She probably does not know why she did it, she sounds not mentally stable and that is why your attention should not substitute therapy. This is for her to figure out on her own. I would definitely stay away from her for the foreseeable future.",
            "Jesus Christ get away from her yesterday. This girl is certifiably crazy and will do more crazy shit.",
            "I can’t believe your therapist advised you to possibly keep someone this toxic in your life. There is nothing about this story that indicates she deserves a second chance or is mature enough for a relationship.",
            "yep. just ghost anyone that threatens to hurt themselves after a breakup. they are never worth keeping in contact.",
            "As soon as I saw “he saved her life” I thought RUN. Holding the threat of hurting herself over you is abuse. You’re better off without her even if you don’t feel better right away.",
            "She's trying through multiple manipulative avenues to guilt trip you, *and it's somehow working.* This woman cheated on you, lied about it, shoved it in your face, and tried to make you feel like you were the asshole for being upset about her infidelity and *purposely* hurt you by trying to make you interact with the guy she cheated with! She's not fucking stupid, she understands what she did. No normal person would even conceive of doing such a thing if they were genuinely remorseful and trying to win back their partner. THEN, she obliquely tried to make you feel bad by saying, \"Only HE was there for me and understood me when I was ~~attention seeking by~~ threatening suicide!\" Trying to imply you're not good enough. Straight from the negging handbook. Yuck. And THEN she tried to manipulate you again by threatening to hurt herself when you actually tried to stand up for yourself. And now you may keep some type of relationship with this awful person?\n\n\nHoney, she's got you pegged good - she sees you as a sucker she can steamroll. You deserve better than that shit. You have the right to stand up with self-respect and say, \"I deserve far better than you and your shitty manipulation and total disregard for me as a person.\"\n\n\nYou love the idea of her, and the ideal of her; because in reality, she is not what you want her to be. \"When you have rose-colored glasses on, all the red flags just look like flags.\" She is *everything* she does, not just the times she makes you feel good.  Ted Bundy was a swell guy to lots of people lots of the time. Doesn't mean you should fuck him! How could you love a person who cheats on you, lies to you, and manipulates you? Because sometimes she's fun to be with and \"gets\" you? Because you feel like she's unique and special and it's you two against the world? Honey, if it was you two against the world, she wouldn't be sexting some other dude and trying to make YOU feel like you're to blame for it.\n\n\nIf you are afraid of being alone, you need to absolutely be alone for a while, and learn to be comfortable with that. Because people like her definitely target those that they believe will put up with their shit, and so far she's not wrong; you put up with all of her shit so far, and she's slowly tugging you back in. You deserve so much better.\n\n\n I know all of this may sound harsh, but I'm telling you this as someone who wants to help you avoid painful mistakes. You are only 20, and have a whole life ahead of you to find someone who would never dream of cheating on you. You just have to be willing to believe you deserve it. When you're needy, and maybe clingy, and obviously worship the person you're with - bad people can take advantage of that. You go back with this gal, and you're going to be in this same situation in a year, 3 years, five years - but with added heartbreak and wasted time.",
            "Omg I think you need a new counselor. I can't imagine having someone this unstable and manipulative in your life is good for your mental health at all. \n\nDon't do the FWB just break up and block and never look back.",
            "Look, I know you can't turn off your emotions like you can flip a light switch, but that's all the more reason you need to truly DISTANCE yourself from her - she is TOXIC and like radiation, she will only poison you the longer you stay around her. \n\nHer threats of suicide and pictures of her hurting herself is EMOTIONAL MANIPULATION. And even if you really, truly think she'll kill herself, you call the police (if that's the protocol in your country) and ask them to perform a welfare check because someone you know is threatening suicide. It is NOT YOUR JOB to rescue her. You are not equipped to do so, and even if you were, you're too close to her to give her the help she needs. Not to mention, you need help yourself.\n\nFWB? Have you asked yourself how she could so easily move to FWB, which is all sex with no emotional attachment (which rarely happens - someone always catches feels - you already have them BEFORE going into this arrangement, good grief), after supposedly being in love with you? Either 1. she plans to use this an opportunity to \"win you back\" which would be all gain but all pain for you or 2. she never had the emotional depth you thought she did to begin with (aka: she was just using you from the word \"go\"). I'm not your therapist, but I don't think this is what your therapist meant. I don't see how FWB would make your situation better AT ALL.",
            "I'm glad that you're focusing on you. Just as a tip from someone who has done FWB with someone who had similarly extreme reactions to things, having a FWB with someone like that is a bad idea. Toxic relationships can still be toxic outside the confines of a boyfriend/girlfriend relationship.",
            "Hey, here is one thing that I want to voice, reading the other comments... there are some strongly opinionated people on reddit. You should read what people have to say, but take it with a grain of salt (even this one). In the end you should do you, not what others think! \n\nI understand why many would not want such person in my life, (knowing what you wrote from this and the previous post) I (probably) wouldn't want it either. But you know the situation far better than anyone and you know what you want! \n\nSo keep asking yourself if you are fine if things are as they are and if you are okay with them. (asking because it is not something that you should ask before you make a decision but also after the decision, in a week, in a month.....)",
            "Bro she’s toxic af.  If she cheated once she will definitely do it again.  If I were you I’d ship her directly out of my life and never let her close again.",
            "Your therapist told you not to cut off someone who sends you pictures of her hurting herself to make you be in a relationship with her, because you need to  focus on yourself? My dude. Get a new therapist.",
            "> We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine \n\nWhat? WHAT? You want to be friends with benefits with someone who pretended to commit suicide? Is having sex with that particular woman really so amazing that it’s worth allowing the crazy back into your life? Or do you secretly dig the drama and fear losing it?\n\nI don’t know exactly how to translate this into lesbian, but *do not stick your dick in crazy.*",
            "Friends with benefits with a person who trades sex for emotional support,  self harms and threaten suicide to keep you in your life.\n\nOP you are just as toxic to her than she is to you if you if you do this.",
            "Your therapist is an idiot. Cut this toxic leech out of your life, the self harming should've been enough, what kind of therapist recommends staying around that for the benefit of your mental health? She cheated. She will do it again, don't be naive for a bit of sex.",
            "Your therapist is wrong.  This is exactly when you should make a hard decision (I wouldn't call it rash.)  You need some deal breakers in this relationship and what she did should definitely fall into that category.  She's manipulating you.  She's keeping the guy and forcing you to deal with it   She threatened to hurt herself and forces you to deal with it.  Now she's asking for a FWB relationship and made you think that was a good idea.  After you kick this chick to the curb, find a new therapist.",
            ">”sex was just to thank him, he deserved it.”\n\nSo they had actual sex, not just sexts sent? And you are FWB with her now?",
            "You really shouldn’t be FWB with someone you’re so emotionally attached to. Nonetheless someone who’s gone behind your back and hurt you in such a way. This seems like you both just clinging to each other, sounds really toxic.",
            "I would steer clear of this person.",
            "This sounds awful, all of it.\n\nI wish you stay well mentally & physically. Make sure that you truly DO focus on yourself for now.",
            "No! Why would you experience all that with the self-harming and threats and still decide to be FWB?",
            "Erhm. She sounds nuts. Don’t stick around for that to blow up.",
            "First off dont be FWB with this person , ever..... She sounds (all mental bs aside) like a very selfish and toxic person. 2nd. Move on. 20 yo is WAY to young to hung up on this shit when there are PLENTY of better people in the world. Start fresh. No other advice needed.",
            "FWB is never going to work. She is not your friend. She is not even friend material.",
            "I don't think your gf is gay from your descriptions. Are you sure this isn't a phase for her.",
            "So, I have mentioned this a couple of times... but boy I never thought it’d be something that 100% applies. I wish I didn’t have to use this anecdote, but I have to. \n\nMy old friend before he kicked the bucket (suicide) had a girlfriend just like that. She cheated on my friend any chance she could. Whether your situation be some one time thing or not, people who especially have mental health issues are susceptible to doing it again. They try and attach themselves to someone not out of pure love, but out of dependency of someone carrying the baggage of their emotions. Which could be why they cheat. Because the more people you have, the more emotional and sexual (people use sex as a coping mechanism; I know I have) support on that level of intimacy you have. \n\nMy friend went through all the works. Whenever he wanted to leave, she’d show photos of her self harming as well as saying she’d kill herself. She put all of this responsibility on him by saying that his response will determine if she does it. I dunno if she was doing it out of selfishness and malice or if it is from a pitiful yet unaware place in her heart. As someone who has watched this being done to someone else, who has been the receiver of this situation, and who has been the person who remorsefully has done it, it is severely not okay to put all of that on you. \n\nNonetheless the tactics worked. No matter of the intention is maliciously manipulative or unawarely selfish, the person doing this ultimately wants you to know how upset they are and what emotions they have. They want you to come and comfort them for validation. So in my friend’s case, she continued the cycle. She blamed it on mental health. I broke seeing how he would just passively say, “Well you cheated again...” and her response would be to blame my friend or to blame her depression. When things got better, he was forced to associate with these people that knowingly had sex with her while they were together. All because she forced him to. People this emotionally unstable can be harmful in ways you don’t expect. \n\nIf you can’t see by now, my friend actually committed suicide in that relationship. All of the pressure, the hatred, the deceit, and him expected to take all of this cost his life. We told him to leave her, but he was too blindsided by the adrenaline of the abuse to ignore it. He was so compassionate for others that he forgot his own needs. \n\nThat was his ending and it’s not certain that it’s yours. But I’m telling you as someone who sympathizes that you need to cut contact. My friend tried breaking it off multiple times, but found himself back in her arms. More bruised than the last time. If you keep coming back whether it be a friend, a partner, or an enemy, you’re enabling them. You’re telling them that their behavior is acceptable since it hasn’t deterred you from their life. Don’t do this whole FWB thing. You’re fueling her to throw more baggage and responsibility on you. She will use it to keep you within her grasp. It is a tough time during this pandemic, but you have a plethora of hotlines, especially an abuse hotline specifically for the pandemic that will be of a great aid to you. Suicide hotline is also important once the dust settled and you’re left alone in your thoughts. God knows suicide hotline helped my ass. Please take all of these things I said to heart. I and everyone else wants to see you get through this adversity with sunshine around you and a big, confident smile on your face. What you laid out in your update will most likely give you the opposite. Take this seriously. It cost my friend his will to live succumbing to the abuse.",
            "So now you two aren’t dating, she gets to keep you and him in her life with zero commitment to you? Sounds like she’s getting her way because now she gets to have both of you in her life. I’d honestly distant yourself and cut her out",
            "I look forward to your post telling us you have an std in the future. FWB is such a bad idea with this girl!",
            "She's not trustworthy at this point and wants the benefits of two people chasing her. At this point, it's best to instantly break things off with her and go cold turkey. Your therapist may believe otherwise, but it's not healthy to stay with someone who's this unstable. It's not your job to ensure she maintains a stable mind and it's immature of her to expect that from you.\n\nNo matter what she does, how she'll threaten to hurt herself and whatnot, do not answer her. A 'friends with benefits' situation is just the way for you both to cling to each other when it's clear she's moved on and is wanting to have you only as a side-partner. She's trying to manipulate you and if you stay with her, you're giving her an avenue to do just that",
            "Your way too young to fucking around with this worthless person. Have some fucking self respect and move past this horrible woman.",
            "> but heh, I need time to change everything.\n\nThis means you are going to prolong the hurt. You cannot continue to have sex with someone who you still love and think you can JUST be friends with benefits.\n\nShe cheated on you dude. Where is your self respect?",
            "She is extremely manipulative and toxic. Holy shit. I hope you find the strength to cut her off. \n\nPlease please please cut her off.",
            "She sounds like a keeper.",
            "Why do you need to have FWB with this asshole. Personally I'd rather fuck a cactus than fuck someone who cheated, then threatened suicide unless I stayed (which, hi, is abuse). Love yourself more dude.",
            "I would definitely get a new therapist, and she should start seeing someone stat if she isn't already. She is not your problem, and it's not your job to fix her. It will never be a healthy relationship if you both don't work on yourselves.",
            "Good that you’re listening to your therapist! They know you and your life better than us.",
            "HOLY BONKERS!  \n\n\nYo for real. You're 20? Why are you focusing energy on someone that is like this? This is insane. That's not a red flag, that's a whole country on fire.   \n\n\nThankfully you found this out now rather than way later in your relationship and the roots were deeper.",
            "Sis no, she ain’t healthy. Cut her out of your life for good.",
            "You're completely wrong if you think that the fwb is a good idea. Just end it after the quarantine and do you, take care of your self. Because somebody who would do that to you doesn't care about you (any more) and you aren't going to change it. Have a little more respect for yourself than to go back to the mud puddle that got you dirty in the first place.\n\nMay sound harsh but Im kinda in a similar situation and people will only treat you how you let them. If what has happened is ok with you then you don't need this post. If you're not ok about it then its up to you to change all this once you can separate.",
            "I think I'm mostly sad that you don't respect yourself at all.  You should talk to your therapist about that. You're letting someone walk all over you, emotionally manipulate you,  and a plethora of other destructive behaviors.  I hope you learn to love yourself and realize that what you're experiencing now isn't it. It's dependence and honestly if you need a FWB, you could do better.",
            "Listen I, as a emotionally unstable person with mental health problems, fully sympathise with mental health issues typically. \n\nHowever this is just... disturbing. This extends past uncontrollable health issue as she not only was absolutely unacceptable, manipulative, deceitful about the cheating. But then had the nerve to disregard your emotions and make you feel guilty for having boundaries. It really is disgusting and you deserve so much better. PLEASE do not let her guilt/manipulate you back!",
            "The amount of self-disrespect you’re showing right now is infuriating. You say you don’t think you can live without her because you’re depressed. How her having you on the palm of her hand make you psychologically better, SPECIALLY when she disrespects you all the time with this bs? And now you’re friends with benefits? What do you think she’s doing? Banging some dude while she can have you at the same time? I don’t want to be judgemental, but you need to reevaluate your life goals. \n\nIs being stepped on helpful to your emotional well being? Do you like being devalued by your girlfriend like this? This is all infuriating. Besides you’re only 22. The only obvious path for your own benefit is block this person and never contact her again. Develop yourself, grow, have more people in your life. You shouldn’t be all invested in a person at this age. It’s time to move on.",
            "So, here's what I did when I was in somewhat of a similar situation.\n\nI had a girlfriend who, when we broke up, went off the deep end in a similar fashion to how your girlfriend did. Pics, suicidal threats, etc.\n\nI immediately called 911 and informed them of the suicide threats and I sent the pics to her family with the message \"Please make sure she gets the help she needs.  I'm very worried for her, but I can't be with somebody like this anymore\".\n\nOf course the cops did a wellness check on her and she Lost.Her.Shit. and they put her in a psych hold. Her parents were shocked by the pics but understood and thanked me for reaching out.\n\nI never heard from her again.\n\nTL;DR is that that kind of stuff is WAY above your paygrade. You can't fix her, and you shouldn't try. it's not your job. Let the people who are responsible for her handle her.  Don't be malicious about it, but just be very \"I need to focus on me, not on you\" like your therapist said.  Don't set yourself on fire to keep her warm.",
            "People like her are worth leaving behind. Don't even communicate with her through text.",
            "Please, surgically remove this person from your life. You can always wank the pain away, but parasitic fungus stays.",
            "bro what the fuck. She is a horrible horrible person.\nYou don’t love her, you love the feeling of safety and comfortability. I hope you can work through these issues with your therapist and cut all connections with her.\nYou deserve better.",
            "Extremely bad idea to remain FWBs, especially since you still love her, but unfortunately, we sometimes have to make bad decisions and experience the consequences in order to really understand how bad of an idea it was. Good luck to you and hopefully it isn't as devastating as I expect it to be.",
            ">We agreed on a friends with benefits kinda relationship\n\nYou didn't really break up then and have made zero progress. You will not get any better this way. Good luck.",
            "Yeah I had an oddly similar experience recently. GF threw herself at some twitch streamer she started obsessing over. She was throwing herself at him shamelessly, sending him sexual messages and nudes on snap, etc. Lied to my face every step of the way. All the while was talking about how she loved me but I knew she couldn't stop thinking about him and wanted him as her side dude just in case things between them could work out. In some of our big fights she threatened to hurt herself to the point where I'd have to stop fighting just to ensure her safety or prevent her from doing something like throwing herself down the stairs.\n\nShe also tried to make me feel guilty. She tried to make me feel like I was abusive. She tried to make me feel like I was responsible for any of it.\n\nTruth is that I was abused, just like you. These people we found and made ourselves vulnerable to were damaged individuals that aren't fit for a relationship with anyone. I'm as sorry for you as I am for myself.\n\nIt's been a few months now and I've found someone else who is incredibly sweet and a genuinely good person through and through. I know the signs to look out for now, I hope you do too. I'm wishing you'll be able to move on and find a healthier relationship when you're ready.\n\nedit: oh, and I tried the FWB thing with her. Don't. She continued trying to manipulate me and my affection, she continued to be abusive, and your girl will do the same.  I had to fuck up myself to learn better. You might have to as well, but maybe i'll have gotten through to you before you do.",
            "Never stick with someone who cheats on you",
            "Leave her. I was on your shoes, that will not work in the long-term.",
            "Do NOT fwb with her!! There is no possible good that can come out of that emotionally. And you're both too fragile for it to just be FWB. Please look after yourself.",
            "This girl threatened to kill herself just because you broke up, how are you seriously considering being FWB with her? This sounds like a childish revenge. Move on from her. If she hurt you so much how can you even think about it.\n\nWhen you said you broke up I thought \"good for you\" but the FWB part totally blew it.",
            "Mark my words. You will regret this in a few years, and when you do, remember me",
            "Friends with benefits is a spectacularly terrible idea. But you know that.",
            "FWB is never a good idea with someone who hurt you, lied to you, and threatens their life to manipulate you into staying with them. You might feel like loving them will save them but it won't. Don't validate her actions by staying. Can you honestly say you can see her everyday and not be reminded that she didn't care/respect you enough to say no? You deserve love, trust, and honesty. Walk away and let her cheat on someone else.",
            "Nah. Just cut her out of your life. Don’t torture yourself by keeping someone that manipulative around.",
            "You mentioned  in your last post that you were seeking a therapist but it’s hard because of the quarantine, I wanted to mention that my therapist has options to call or Skype with her, and we’ve also taken a walk (2 meters apart haha) last week. I don’t know if that’s an option for you but it might be worth looking into. You mentioned a therapist in this post too so maybe you have it figured out, but I just wanted to bring up that there might be options.\n\nEta: I also don’t recommend sleeping with your ex but if you do you need to stay vigilant about STIs. She’s already been dishonest to you about her sexual history so don’t trust her to keep you protected, your health is in your hands. Transmission rates are lower between cis women but not negligible",
            "I'm really, really sorry that you feel love for somebody who can do that to you, man. That level of manipulation is a special kind of horrible. Please take care of yourself and be mindful that forgiving someone can be as real as just letting them go. I wish you the best.",
            "Run that is not a relationship someone should be in",
            "I've read everything and you're edit, do NOT do a FwB situation w her, at all. I did that exact kind of thing with THREE of my past romantic relationships. How did it turn out, you ask? It crashed and burned every fucking time. You start to love them again and get sucked back into all the drama and you want to talk about the things that went wrong, but you can't, because thst kind of relationship is now way behind you. I don't talk to any of those 3 anymore and I now dislike them as people. Therapists can be wrong sometimes and I genuinely think your therapists advice on this is bs and will only worsen this problem. There is no reason to keep in contact with a person that has put you through all of this.\n\nYou're only going to hurt yourself if you go through with this desicion.",
            "When you break up with someone they show their true side - i know this from experience.\n\nAfter that episode I wouldn't entertain anything with her - 3.8 billion women out there.",
            "Hey OP, if your therapist can’t see you, try Better Health. It’s cheap and effective, with video chat based therapy that has it’s obvious advantages atm. Keep your chin up, you deserve better.",
            "> She went CRAZY and sent me images of her hurting herself, saying she's kill herself and asking her friends to tell me she'll kill herself.\n\nNext time, take that statement seriously and call the police. If the person is serious, you might save a life. If the person is not serious, then they will (hopefully) learn that manipulating people through these tactics is not a sound strategy. **Caveat** here that I understand not wanting to call the police out of concerns over a police shooting or other horrible interaction with law enforcement, etc.\n\nI'm glad you ended the relationship, and it sounds like your therapist's advice was more geared toward potentially cutting her off on more sober, deliberate reflection (or going limited or no contact, etc.).\n\nI do think not even bothering with FWB will be better for you. There will be too much drama involved for what a FWB situation is supposed to be.",
            "It honestly sounds like she’s the one that needs to see a therapist.",
            "Omg I thought girls like this only exist in high school because they want attention. Don’t keep her around, you’ll get nothing but headaches.",
            "Allowing this toxic, manipulative person in your life is the worst thing you can do for your mental health.",
            "Bro she cheated on you she isn't worth your time lmao",
            "I’m sure other people have said this already, but I’m just going to be straight: you need to respect yourself more. She is jerking you around and clearly has no respect for how much it hurts you. Would you ever treat her like this? If so, then good luck in a super toxic relationship. But from what I gather, you wouldn’t. So don’t put up with this shit and find someone that won’t treat you like this. Believe me there are plenty of women out there that won’t put you through this.",
            "Op, the wlw community is not so tiny that you're not going to get a more sane gf who is actually faithful to you.\n\nLike, just bounce, girl",
            "She is a selfish manipulative child. She is honestly not mature enough to handle an adult relationship. Your requests were more than reasonable and respectful. You deserve much better than this.",
            "Sex was to thank him, he deserves it.\n\nSorry what? Your gf is a twat. Sorry.",
            "Gross. Fwb with someone who self harms to get your attention? Sounds like you’re literally feeding the beast and will end up adding to this drama. Yuck yuck.",
            "Your edit is telling because it sounds like you read into what your therapist said. Sounds like what she’s really saying is think about yourself first, not living for others.\n\nAnd the way your ex treats you? You shouldn’t go anywhere near her. You are always better off alone than with someone who triggers your mental health, puts you last, cheats on you, etc",
            "Sending a picture of her hurting herself is a hella toxic control tactic. Focus on yourself and be glad that you’ll be moving on to something better. When you find someone healthy, stable and without these huge ups and downs, the difference will be like night and day.",
            "It seems to me that you are trying to keep a FWB relationship with her because you are lonely and because you view being in this relationship as validation of your self-worth. And I get it. Depression and anxiety chip away at your self-esteem until you feel like you are worse than nothing. My friend, right now you are looking at yourself in a funhouse mirror. That's what depression and anxiety do, they show you a warped version of reality. \n\nYou should not be in a relationship right now. Not because you don't deserve to be happy, but because you deserve better. You will find better one day, but it's hard to even see better when your heads hung down low. Try to make platonic friends, for now.  Work on hobbies that make you happy and maybe try to find communities online that share those joys. Once the quarantine is over, try to find irl communities if there are any near you. \n\nIf you don't have any hobbies, now is a great time to try some new ones!",
            "Leave that chick in the dust man, on to the next one King. Block her on everything and focus on you. Women will notice.",
            "You need a new therapist. Any therapist that would encourage you to stay in a co-dependent, abusive relationship is a shit therapist.",
            "Wait, so your therapist encouraged you to stay with the girl who cheated on you? You need a new therapist.",
            "When someone says they will kill them self if you leave is a major red flag this girl is clearly unstable and you should get tf away from her. The whole fwb is not a good idea with this girl trust me on that.",
            "Someone manipulative as that shouldn't be someone you would be open to sharing your body with and being a FWB with.",
            "Stay away from her and get tested for STDs/STIs if possible. She does not love you and is using you for whatever reason",
            "She is pretty toxic. Good for you if you get out of all her crap",
            "Don’t continue a FWB thing with her. You seem like the type of people who would get hurt in this situation because you’re a good person. You deserve so much better so please take care of yourself first and cut ties with her.",
            "God how can you still have feelings for her after that crap? Find a loyal woman, you deserve it.",
            "Definitely don't suggest being FWB with someone who isn't stable... Those kinds of things end because people get attached and emotional, it's just going to end in disaster one person is already halfway there.",
            "You're going to get dragged through the mud with a fwb relationship. Don't do it. Just move on, don't waste your energy and time with this.",
            "honestly, no. you shouldn't be FWBs or have any kind of relationship bond with this person. she cheated on you, lied to you about her feeligs towards the guy, kept on talking to him and playing games with him and developing feelings, and then when you tried to set up *healthy boundaries* that are necessary to you, she guilt-tripped you into thinking that you're the one wrong for complaining.\n\nsex as a reward because \"he deserved it\". that makes me want to puke. even if he was a good friend, that's still bullshit. buy him a present or something, but don't fuck up your SO's life.\n\ni kinda of sense some kind of... codependency? like, you saying that you'd die without her and you sweeping her mistakes under the rug and taking the blame for them. i know that feeling, i used to be like that. *YOU WON'T DIE*. it's better you break up now and stay as far away from her as possible, so she can't manipulate you, otherwise you'll never properly heal.\n\ni think you need a new therapist. yeah, nothing is set in stone, but that doesn't mean you have to keep toxic people in your life \"in case they change their ways\". your ex will never change, you forgiving and pretending that she did nothing wrong will only make her think that you'll forgive her no matter how many times she fucks up, and she'll continue doing the same shit because she knows there won't be any consequences.",
            "You can't be FWB with someone who threatened to kill themselves and self-harmed when you told them you needed to step back from a relationship with them. They will not be able to \"keep it casual\" and it will become a total fucking disaster.",
            "Distance yourself from this person's influence ASAP like others have indicated already. You're still young so you haven't had the experience necessary to identify these types of people and their bait and switch manipulation tactics (usually this is a case of borderline personality disorder or narcissistic personality disorder) but they're sort of common and you've only scratched the surface on that iceberg of crazy. They're parasites who merely use their relationships as bargaining commodities or tools, and you don't need to settle for that. Many people don't learn this lesson until they're my age and have gone through the ringer a few times.",
            "Yeah... FWB is a *more* complicated way to have a relationship not less. And lets be real, would you be friends with someone who lies, cheats on their SO, emotionally abuses (threatening to kill yourself if someone else doesn't do something **is abuse**), and uses sex as a reward system? Is that a good friend? Would you respect that person, trust them, keep them in confidence? This woman doesn't even qualify for the friend part of FWB, so.... How can it really be friends with benefits? All its going to be is sex with someone who treats people like trash.",
            "Red flag my bro. I’ve been in similar situations before. Please do yourself a favour. Stop talking to this woman.",
            "Wtf op don't be FwB with a crazy person!",
            "This person and toxic and doesnt respect you.\n\nI don't know why you would want her in your life after she cheated TWICE and even lied about it.",
            "I could not  do it. Not just the games but the girl. Cheating is a deal breaker for me. I'd never trust her again.",
            " >My therapist also told me not to make rash decisions like cutting her off completly, but to focus on myself. I'll do that.\n\n\nYour therapist is an accomplished person who holds a license. I'm an internet stranger with an opinion. However I absolutely think you need to give her the axe. Your therapist is RIGHT about focusing on yourself, but what positive will keeping her in the picture do for you? That will just distract you. She needs the boot ASAP. Don't give her time to justify her actions.",
            "Jesus Christ dude grow some self-respect and refuse to ever speak to this woman ever again what the fuck is wrong with you you are better than this! There's someone out there for everyone and you're wasting your time with this person.",
            "Next time she is claiming to kill herself.... call the police and say you are worried your friend has killed themselves after some messages you got. A knock on her door from the police might teach her to quit saying shit like that.",
            "Lol I too am not smart at all so I have nothing but empathy for you and your extremely poor decision making skills. I'd have have done the same TOTALLY WRONG thing.",
            "i would drop this chick like a bad habit.  any chick that cheats, is very likely to do it again.  they just cant be trusted.  because they dont care about how YOU or whoever is their boyfriend, feels.",
            "Have a threesome and enjoy it.",
            "You can't be friends with benefits.\n\nYou aren't friends.\n\nEdit: Also, fire the therapist. You absolutely need to get away from this woman, need to get clean. You need to get all those love and jealousy and affection and thirstiness chemicals out of your brain. That means NO CONTACT, for a very extended period. \n\nThat isn't a \"rash decision\", it's a sensible decision and exactly what you need.  It's also what she needs.",
            "Please don't let yourself get roped up in her bullshit. She won't change, at least not in a few months. You should cut her out, completely. No friends with benefits, no friends, no relationship. Don't let her back in. She is immature, manipulative, and toxic. You deserve better.",
            "She sounds awful, even though you feel like you love her, she is so toxic and shes going to continue to treat you awful. Continue going to therapy and  move forward without her (not even in the fwb sense). Shes going to keep playing games with you, and it will hurt you more. \n\nFocus on you OP, and then you will find someone who truly respects and cares for you.",
            "Uh.. you're really simping right now. Stop simping and find a new girl.",
            "I'm proud of you for making a tough decision and riding it out. Nothing wrong with taking it day by day, I just very much hope that you realize after some reflection that she isn't worth it after the things she did to you.",
            "If your therapist allows your to FWB and not quit cold turkey, that’s a bad therapist.",
            ">don't make rash decisions, as you have the tendency to live through other people. Make your own choices\n\nYou understand that the therapist *also* means \"stop living through your ex-gf\". I sincerely doubt that any licensed therapist would recommend you maintain a relationship with someone who self-harmed and threatened to kill themselves when you broke up with them... if they did recommend that, you need a new therapist yesterday.",
            "Why would you want this person in your life",
            "So you tell her how you don’t feel comfortable with her talking with someone that she cheated on you with and her brilliant 10 out of 10 response is grow up? Op you honestly dodged a major bullet if I was you I’d at least do minimal contact if you still want them in your life.",
            "If she couldn't live without you, why did she cheat to begin with? The answer is, he doesn't want her either I bet.",
            "And you two are still dating because..?",
            "Mate, she's a cheater. That behaviour will always be in her background and you'll never be able to trust her again, I promise. I got back with the person who cheated on me and it was worse the second time around.\n\nJust live for you right now. You need to look after yourself at the moment as it is, what with everything going on, and make the best choices for yourself. It might hurt to be without her right now, but that's part of grieving for the relationship.",
            "Were you supporting her financially in any way? It seems you were giving her something that he couldn’t so she wanted the best of both worlds.",
            "You've got to give your brain some control over your emotions, your heart will only make bad decisions and things won't end well for you, FWB is a very bad idea, you don't need her to be happy just end this before it's too late.",
            "Hey, OP. I'm very sorry you're going through this. I'm not here to tell you what to do but I would encourage you to keep a few things in mind going forward.\n\n- If you do get back together, it is very likely that SO cheat on you again\n\n- Your SO is emotionally manipulative. I want to make one thing clear, *your SO did not go crazy.* She knew exactly what she was doing when she cut herself and sent you those photos of her hurting herself as well as trying to rally your friends into guilting you. She only apologized when she realized that this tactic wasn't working on you\n\n- It may be in your best interest to take any apology and/or promise with a grain of salt. I strongly advise against giving this woman the benefit of the doubt. Like...ever. She has demonstrated that she is untrustworthy, manipulative, and doesn't respect you. *She will not change.*\n\n- You mentioned feeling \"dependent.\" It is very likely that, at some level, she knows this about you and knows how to exploit this.\n\n- Most importantly, if you do decide to take her back, understand that it is extremely unlikely that she will get better from here. In fact, she will most likely only get worse. I've met people like the girl you're describing and I've seen how they ruin their SOs, it's all bad.\n\nIf you truly feel that you wanna take her back, so be it. Just understand that *cheating,* *lying,* *and emotional manipulation* will all be issues with which you will constantly have to deal. It will never stop. *She* will never stop. These things will likely be a regular part of your relationship should you decide to take your SO back. It's up to you to decide whether or not she's worth it",
            "Your therapist has a point about asking for advice on Reddit and it is great that you are being honest with your therapist.\n\nBut I am telling you from experience. An FWB situation with someone like her is a BAD idea! I have done the same thing with exes that were bad news for my wellbeing and EVERY TIME it hurt, it was nasty (not in a sexy way) and it took a toll on me.\n\nIf you need an FWB, go on Tinder, OK Cupid or something and be clear that you are looking for something casual. You will find someone. Don’t do the “merry go round’ “ with exes. I have been there and done that. It was a waste of my time, energy and sanity! \n\nGood luck in whatever you do! I wish you all the best!",
            "I had kids with that kind of mess. Run, run as of she will kill you, because she might.",
            "Get out of the FWB situation.  For short time you'll feel the loss; remember time heals everything.  You are in an unhealthy relationship.  Just imagine you find another girl that you want to be in a serious relationship, how would she react?",
            "Bro, I've been in a very similar situation, I understand what you're going through. You should continue any part of this relationship, being friends or otherwise. I know, It's hard when you love someone. That was my problem too. Some people have a very broken personality. They will show you a very sweet side of themselves, that you get attached to, but then do things like this. When you are in a healthy mutually respectful relationship things like this don't happen. I know that you love her and I'm sure that she has lots of good qualities but, if you continue this with her you are heading down a very dark path. Look up borderline personality disorder because, from experience, this is whats happening with her. Just remember that there is only so much that you can do for someone else. Much love brother and I hope you the best",
            "She cheated on you and your worried about playing video games w the person she cheated on you with wtf bro priorities dude",
            "You’re being a wimp. She’s never going to see you as otherwise, she’s keeping you on the hook because you’re nice and it’s hard to confront nice people. Stop acting hurt. You’re ok. Dont present yourself as weak, people don’t like it, even if it makes you impossible to deflect, they just want to get away. You’re asking for respect from a lover who has clearly moved on. Things aren’t going back to normal, she wouldn’t have tucked someone else if she wanted things back to normal. You’re going to be lonely, but don’t worry there are seriously 7.5 billion other people and they all suck just as much as us. You’re awesome, wait till you remember that game you used to play or something.",
            "Not so smart. Your therapist might need a therapist it’s not sound advice.  But it’s your life. Your every right to do what you want. Whole thing seems toxic. This relationship has everything from manipulation to codependency to cheating to zero emotional intelligence.  I agree with the rest this will not end well.  If she doesn’t hurt herself she will hurt you.  Please be safe and best of luck.",
            "You just said yourself you love her.  Nobody simply has a FwB relationship with someone they still love.  It is a myth.",
            "Why would you do FWB.\n\nYou didnt get what you wanted from this person and now she will use you for sex only?\n\nYou are not friends.",
            "You deserve better, please respect yourself",
            "I'm more than a little surprised your therapist didn't point out to you the whole \"I'll kill myself if you don't come back\" is a form of manipulation and abuse.\n\nGiven this former GF is really great at pulling your strings, manipulating you, and emotionally abusing you, I'd stay away from her. No FWB. No friendship, period.",
            "Please just be strong enough to leave once and for all and be done with it. Don’t get involved back in her mental instability and drama in any way, shape, or form including FWB.",
            "Hey OP, I notice a lot of the users here are trying to reason with you by attacking you ex-gf and saying she's a horrible person. I'm sure that you still believe she is a good person, and that might make you disregard some of the opinions here. While none of us truly know how good or bad of a person anyone in your life is, it does seem like the two of you together brings out some very unstable parts of each of you. Nothing that you have described sounds like a healthy relationship, and I think you would agree with that if you were reading your posts as an outsider.\n\nI feel like you need a lot more time away to heal and try being with other people. Continuing a fwb relationship, or even holding onto the possibility of one, wouldn't help you reach any closure. It also could put you two at more risk of harming yourselves or each other. It does seem like a clean break is what is needed for a good while (not just a month or two), but ultimately it is in your hands. Good luck, and I hope that you both can continue on your path to improving your mental health! :)",
            ">\tI'll focus on myself rn, but I'm still feeling dependant, and I still... love her. We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine (which could end at the end of the month, or in a month, depending on the situation.)\n\nYou're a glutton for punishment.",
            "Unpopular opinion. RUN LIKE HELL",
            "You’re a glutton for punishment. After all this, you are giving her what she wants despite what little regard she gave you. I think you would benefit talking to a therapist and improve your thoughts of self worth.",
            "Dude. She's guilting youmwith self harm?  Go no contact.  She is crazy.",
            "Crazy for you to even consider being friends with benefits with a cheating liar. Seriously, a few minutes of sexual pleasure for what? You keep going on about your mental healthy not in a stable stage because of her but you'd forget about it for minutes  just for lust. I felt sympathy reading your posts and was even glad that you were able to toughen up to break up with a cheater, but then became gravely disappointed for making a reckless decision. That was such a huge let down. I can't say enough how much of a terrible idea this is. You'll just go down in a cycle of hurt.",
            "Holy shit you need to work on yourself and not be in a relationship.",
            "I had a really similar situation with my friends. Trust me when I say the quicker you stop talking to her the better. Those kind of people sap the life out of you, enjoy all the attention, and continue to complain while doing nothing to change. You'll look back and wonder why you wasted your time.",
            "Hey, sorry for being late to the party, but I might have life experience to draw from. I'm a lady who dates ladies and I have definitely been through stuff like this. My current gf & best friend have also been in the same situation. I'm 29, and I feel like this kind of relationship seems like a shitty, but common milestone in queer lady relationships.\n\nAll 3 of us had that girl in our college days. We had someone that pulled us around their drama storm. We wanted to care for them so they can see the light & become their best self. They had a legitimate problem that pulled on our heartstrings. They were beautiful enough to cloud our judgement. We wanted them to bond with us.\n\nAll 3 of these women cheated on us. All 3 of these women played it off as less serious than it was. All 3 of them emotionally blackmailed us with suicide, fake pregnancy, or homelessness. We all took them back because, well, we missed them. We loved them.\n\nWhen you're 20, you're an adult who's still growing. It's weird. The part that grows is the emotional & communicative part of your brain. It's easy to be attracted to high maintenance people at this point. Some people have an experience like this, decide to move on, and later realize that's not what they want from love at all. This is the lesson of your 20's.\n\nSome people never learn that lesson, or it's the only thing they know so that's what they expect. Unfortunately, my friend falls in that category. She's dating a demisexual (plays out as straight in this case) that has a sketchy past, some serious daddy issues and super controlling behaviors.\n\nSome people, like me, need to repeat the class, so to speak. I went through a few of these relationships before I met someone that never expected me to bear major emotional burdens for her. She was just happy to have a good time. She was very positive, motivated towards self-improvement, and was a very confident gal. We were only casual for a few months, but that was okay. That's all either of us wanted, since we were so burned out from the stuff you're going through.\n\nAfter that, I started finding more emotionally grounded women. It turned out that they were just as enrapturing as the drama llamas, but it didn't hurt anymore. Mature discussions regularly occurred. Things like needs, wants, & boundaries where discussed & encouraged. I can't even begin to tell you how good that feels. It's like wearing glasses for the first time, or losing 100 lb of dead weight. It feels safe & exciting at the same time.\n\nThese are shitty growing pains, but in a way they're good for personal growth. When you're a queer gal, dating only gets easier from here. It gets better. Right now it hurts, but enforcing boundaries is better for both parties, even if parting ways is the healthiest choice (and let's be real, it definitely is at this point). \n\nGood luck man. Love happens more than once. I believe in you.",
            "Use this time to start growing apart. She is not good for you and never will be.",
            "Yeeeeeeeah fwb really doesn't work when you're recent exes...",
            "If you don't mind my asking. How long have you two been together? You already have two very major red flags to deal with (cheating and her self harm) the self harm is very very worrying as it could lead to future violence against herself or you. It's up to you to decide weather to continue to see her or not so I wont try to suggest action on that but what absolutely must happen whether you continue with her or not is that she needs professional help (especially if you decide to keep see her). She has some major issues that you are not trained to deal with. SHE NEEDS PROFESSIONAL HELP.",
            "I realize I'll be \"that guy\" for saying this, but welcome to life.",
            "She's beyond unstable. Good you ran the other way lmaooo hope you recover well from this!",
            "break up with her, she’s not worth the mental/emotional energy - if she’s willing to guilt you into staying w her with suicidal threats and self harm she could do a load more abhorrent stuff which is just not worth it. yeah u love her now, but i promise u when u meet somebody that’s bloody decent and that’s a cup of tea to u without the fucked up strings this lady has. think of it this way, ur shoving this manipulative asshole out of ur life to make room for somebody better !",
            "Wtf dude, block/ban and change your phone number then total ghost.  Have some self respect.  Absolute shitshow...",
            "Wait so she did all this yet your therapist says to not make rash decisions? This is the perfect time for a rash decision of break up forever and never see her. Did you tell that therapist about all the suicide threats? That's horribly abusive to you and manipulative. You need her out of your life or she will keep doing this forever. She's already cheating on you. Dude.",
            "Lol... You 2 are both crazy",
            "As to your edit: Don't! This girl needs to sort herself out in major ways and the best thing you can do for yourself is cut her out completely.\n\nIf she threatens self harm or suicide again, call the police!",
            "\"Sex was to thank him\" ?? That's fucking disgusting. I wouldn't give her a second chance if I were you!",
            "She was extremely manipulative with you during your relationship and after you broke up with her. I wouldn't trust her not to do that when you two are sleeping togethor, again.",
            "Continuing to stay in touch with her is a BAD idea.\n\nYour therapist's advice is horrible.",
            "Move on bro, I’m surprised your therapist hasn’t told you to move on aswell.",
            ">FWB situation \n\nCongrats, she just won. You just got sucked back into a situation that completely in her favor. She gets to have sex with the both of you now.\n\nYou listening to your therapist is stupid, considering this girl hurts herself when you threatened to leave her.",
            "22F sounds like a comphet; she really said “he deserve sex as a thank you” BYE miss me with the bs on that front",
            "You should tell her to go and save her life againb if he's so supportive. Btw he deserved to fuck her ;)",
            "You sound like you're stuck in one of those stupid limbo situations where the obvious thing to do is somehow difficult. Squash that and tell her it's not happening. No \"innocent\" friendship and gaming with the enemy. I can tell she's controlling you based off how you question yourself in this ridiculous situation. If she listened to reason or to you then she would have stopped.",
            "\\>We agreed on a friends with benefits kinda relationship if everything was cool between us at the end of the quarantine \n\nEverything was going perfectly until this. Please please please OP if you value your mental health in any way whatsoever do not do this it fucks you up wayy more than you think it will. You're thinking it will help with the pain that you're feeling from the break up but trust me that situation never, ever ends well and will come around to fuck you up if you try it. If you listen to anything in this thread please please listen to the people telling you not to get back into any kind of sexual or romantic relationship with this person.",
            "Aight, Nintendo ID, we're going on a mission to smash the duck out of the arena GIH and her. I'm taking samus.",
            "[removed]",
            "Do the FWB thing with her, but also see other women. Don't do anything outside the bedroom with her either. Just fuck her and leave, or tell her it's time to go, but I wouldn't recommend having her over to your place."
        ]
    }
]