[
    {
        "post_id": "i7wkqu",
        "author": "Ohwhoaeskimo",
        "title": "I (30F) caught my husband (31M) in an affair and I don’t know how to move on.",
        "url": "https://www.reddit.com/r/relationships/comments/i7wkqu/i_30f_caught_my_husband_31m_in_an_affair_and_i/",
        "score": 2936,
        "num_comments": 169,
        "created_utc": 1597168729.0,
        "selftext": "I’ve suspected things had been going on for a while, but kept brushing it off—I thought he would never do that to me. Since around April, he’s been refusing my attempts to have sex most of the time, sitting differently on the couch to where he’s facing away from me... little things. \n\nIt’s with one of our good friends. She came to my house a few weeks ago. She’s texted me. She’s pretended to be there for me. \n\nI found out because I rolled over and they were having a Snapchat conversation. She said she wished she could be there to hold him and he summarized that I tried to seduce him last night and mocked it. I confronted him and he admitted it. He said that it was because quarantine was stressful. He does not want to work things out. He thinks of me “only as a friend in his heart.”\n\nWhen I told her husband, he confronted her and apparently they actually kissed back in February. I think at that moment, I was never going to be enough for him. \n\nWe used to be so so so happy. The week before they kissed, we celebrated Valentine’s Day together. He bought us a nice bottle of wine for our anniversary. We had fun, we were perfect. \n\nI don’t know where to go from here. We’ve been married only about a year. I feel like he took so much from me and doesn’t even want to go to therapy or work this out. I don’t want to leave my house but everywhere in it I see him. He chose her. I’ve been cheated in every relationship I’ve ever been in. He was supposed to be my forever. \n\nI don’t know what to do. I’ve made therapy appointments but I was also laid off last month, so I have too much free time to analyze every single moment where he might have been lying to me or where I made myself pathetic trying to cling to him. \n\nHow do I start to get through this?\n\nTLDR; My husband had an affair and does not want to try to work out our marriage. I feel like I’m drowning and don’t know how to start moving on.",
        "permalink": "/r/relationships/comments/i7wkqu/i_30f_caught_my_husband_31m_in_an_affair_and_i/",
        "comments": [
            "Lawyer first. Get the divorce filed, and get their advice on if it's ok for you to leave the house while things are processing.\n\nAs for the other, you need to fill your time. Devote yourself to hobbies, including picking up new ones. Rely on friends - long video calls, watching movies together, etc. Fill as much of your time as you can until things start to process.\n\nI'm so sorry he gave up on you without even trying, hon. You deserve far better than that. It's a shame some people are so good at hiding how little respect they have for other folk, but please hold onto the fact that *none of this was your fault*. There is absolutely zero reason for a partner to cheat, ever, and there is absolutely no justification that can put even a shred of the blame on you.",
            "You can't go to therapy and work this out. It only gets worked out if both people want to put the effort in, and your husband has made it very clear he's not interested in trying to make the relationship work. He directly told you that. You need to find a lawyer and file for divorce.",
            "Call a lawyer. Relationships take two and he's clearly done.",
            "Have a mantra to help you when things get overwhelming. \n\n\"I'm going to be okay. This sucks but I'm going to be okay.\" \"I am a loyal, trustworthy, hardworking woman, I deserve the same in return.\" \"I am beautiful, I am confident, I am worthy.\" Even if you don't feel they are true in this moment, it will help to say them out loud until they hold truth to you. \n\nI'm sorry you are going through this. You can't trust this man anymore and he is not willing to compromise with you. You deserve better.",
            "I was where you are 5 years ago. \nMy husband leaving me and subsequent divorce was very sudden and traumatic. It took time but eventually I got my emotional shit together and life went on. You'll be thrown for a loop for a while but what absolutely will help is cutting both people out completely. No \"gaining closure talks\", no coffee dates to catch up, no late night texts etc. Block them on all social media and step back from mutual friends. \n\nMake sure you are serious in your conviction that your husband is a stranger who doesn't deserve your time. Same goes for your \"friend\". That means they aren't allowed to weasel their way back into your life. \n\nYou loving either one of them is not an excuse to let them back in your life. You have to accept and understand that fact. One or the other will want some form of contact at some point, they don't deserve that from you. \n\nThrow yourself into hobbies, friends, getting a new job, exercising whatever.",
            "The first thing you need to do is work on what your first step in the divorce will be.  Go talk to a lawyer.  Many offer free initial consultations. You are posting here asking for emotional support - and you do clearly need it - but the main thing you to need to do is get yourself out of this terrible situation where you are married to someone who doesn't give two shits about you.  You will feel better if you start taking definite steps in that direction.\n\nPeople post here all the time about finding out their partner cheated or had an affair but they want to work things out and the poster doesn't know how to trust them.  Your husband is making this easy for you - he doesn't even pretend to want to work on things.  \n\nDon't forget that decision of his even if he later changes his mind and wants to work things out.  He has chosen the other woman in a clear an unambiguous way.  Even if he chooses you later, you already know that doesn't stop him from looking for a better option.  Even if your \"friend\" decides to end the affair for good, you should assume your husband will look for yet another alternative option to you.\n\nTherapy is also a good idea, when you can get around to it.  You might also look around for support groups - maybe r/surviving_infidelity, or maybe a local group of some kind.  Or maybe just a friend or family member or two who you can turn to right now.  (NOT your husband, obviously).",
            "Wow I'm so sorry. \n\nI notice one line that stands out: \"I've been cheated on in every relationship I've been in.\" That really sticks out to me. There's something going on. Yes, it's the dudes' fault. But this + \"everything was perfect a month ago\" says that perception isn't lining up with reality for you and you have a really well developed coping mechanism for overlooking flaws in people and maybe excusing red flags or problems. \n\nI can't really speculate where that came from, but usually people who were told or shown \"reality is what you make it and I **insist** it be okay!\" (my mom was like this) are expert excuse makers, reform school for bad boys matrons, and live pretty deep in denial---I know because I was one. Also people struggling with their own stuff sometimes pick troubled friends as well and tolerate, overlook, forgive or excuse messed up stuff. \n\nA good therapist can work with you to unravel the reasons that led to this in terms of things that you maybe excused or forgave or missed/ignored so it never happens again.",
            "Why are people so gross.  Your husband is gross, your “friend” is gross.\n\nHaving integrity isn’t that hard.  They are trash masquerading as people.\n\nI’m sorry this happened to you.  My father in law did something similar, so did my uncle.  Uncle and aunt stayed together and worked it out FIL married affair partner.  It’s been years and I try to treat them normally, but I just don’t have the respect for them and I can barely stand being in the same room.\n\nThis will happen to your husband and honestly I think it’s a very good reason to not bother working things out when a partner has an affair.  You can be assured that everyone who knows just  barely tolerates the person now.",
            "The only way forward from here with divorce. Your husband is not only a cheating scumbag, but he shows no remorse or desire to fix things, and one person can't hold a relationship together on their own.",
            "Cheating aside, You DO need to go to therapy for the line you dropped at the end about being cheated on in every relationship. Clearly there’s something about you unresolved that allows people that abuse boundaries to sniff you out and take advantage of you.",
            "i think when u file for divorce, if it’s your house, make a move to keep it, and then sell it later after divorce bc eff that SOB for cheating on you and then ruining destroying ur home as a safe space. \n\ntake it one step at a time, and find yourself and your friends. you’re gonna need a support group, so def get some good friends in your corner, and if you’re close w you parents, def start off there. \n\ngood luck OP, you got this 👊🏽💓",
            "WOW.  Girl he was really making fun of you for trying to have sex with him. He is SHIT! Don't waste any more time grieving the loss of your relationship with this scumbag.\n\nNothing is your fault. A decent human being would have just been straight up with you when his feelings changed. He made the choice to betray you everyday and continue to use you because it was convenient for him. You would never do this to someone, because we are above people like this. Find you someone who will give you the same respect you give them.",
            "First of all, tell all your mutuals what a backstabber she is",
            "Find out if the other woman is married. If she is, tell her husband",
            "If you have no children get out now.  If you have children get out now",
            "WTF is wrong with people???? You have been married a year and he is already cheating???? Disgraceful...",
            "I’m sorry. There’s always one partner who is blindsided because they think because they’re happy their partner must be too. \n\nGet into some therapy for yourself.  Most communities have a program for those with limited income. Hopefully you can find something within a reasonable drive time. \n\nMake daily plans and stick to them. Exercise, spend time with those who support you, and try to see him for who he truly is, not as you thought he was. \n\nI know this time sucks, but you will eventually come out the other side for the better.",
            "Get a lawyer and move on.",
            "Sorry OP. You have to move on now. He isn’t worth your time anymore. Your wounds will heal within time. Be ready to get a lawyer and file for divorce.",
            "Im really really sorry. But get it all out now. Take time to think about every little moment where he might have lied to you and analyze it. Trust me because if you don’t now then later you will randomly think about it and then get upset or feel low all over again.\n\nAlso how you get them is how you lose them. \n\nAnd your husband not wanting to work on things says a lot and in a way is a blessing in disguise. You will see that later.",
            "Dump him. That’s how.  Once a cheater always a cheater. \n See a lawyer",
            "Man divorce him, he doesn't deserve you or your love and you'll find someone eventually whos right for you, its gonna take awhile and its gonna be hard but you'll get through this and be happier at the end and maybe be with someone new, or maybe he'll realize what a mistake he made and try coming back to you but if he does, don't let him.",
            "Do you know what the other woman gets? A cheater who cheats.",
            "I’m so sorry that you are hurting. Him and this so called friend deserve each other. Get a good lawyer and divorce his ass. I went through something similar. I was married 20 years and he cheated with someone half my age. I found out by mistake. I was hurt and very disgusted so I divorced him. Best decision ever.",
            "Well he's a horrible person.\n\nBeen there, divorced a guy like him.\n\nSorry, but clearly he is not a good person. It may have started out good, but this is who he is. He will just keep acting this way in his future relationships.\n\nBe happy you can get out now...I lost years of my life to one of these guys.",
            "I don’t have any advice because I’ve never remotely experienced anything like this, I just wanted to say I’m so sorry you’re going through this. That fucking sucks and you deserve so much better than a selfish husband who would be so casually callous to you. He can kick rocks and maybe he’ll one day realize how spectacularly he screwed up. I hope you can look back on this a year from now and find yourself in a better position. I hope you’ll heal and find happiness. 💜",
            "You’ve been married only a year. You’re only 30.  Hard as it may seem to you know, you are far, far better off than you would have been and have lots and lots of life left to move on.  You’ll get through the hurt and sense of rejection and be sorted soon. Work on yourself, seek counseling if you find that helpful, and count your lucky stars.",
            "Get a very good divorce lawyer and demand spousal support and that he keep you on his medical insurance until the divorce is final so you can see a therapist. Don’t feel guilty about demanding all that you are entitled to.",
            "Do you seem to go for a certain type if they keep cheating? I am just curious because all of my ex boyfriends were emotionally and even physically abusive (I haven’t dated in two years to work on myself) and I realized it was because I came from a broken home and my self esteem was really low",
            "Protect your assets prior to filing for divorce, then hit the Tinder app, hard",
            "Start by getting your things in order like important documents and personal keepsakes. File for divorce and look for a new place to stay. Rely on your support network for help through this, family, friends, whoever. Distance yourself entirely and time will start to heal. There's no repair and don't take him back if he tries to come back. I'm so sorry, but, you're so young! There's so much more life ahead of you. You're going to make it.",
            "There is a lot of good, practical advice here.  I am glad you have a therapy appointment.  I am a therapist myself, and that's always the first suggestion I give.  Getting a lawyer is also the right thing to do.  Your post, though, states \"I don't know how to move on\". Unfortunately, that part is a lot more difficult and less concrete than making a therapy appointment and finding a divorce attorney.  \n\nThe only way you can move on is to take it one step at a time.  Be mindful of each and every step, and make sure that everything you do is for your own good.  It appears that your spouse is adept at trying to project blame into you.  Let that blame roll off you like water off a duck's back.  Actually imagine yourself impermeable to his negative energy.\n\nGoing forward, every thought, every decision, needs to be about you.  If you are still living together, find somewhere else to stay, and do not engage him when you leave.  Instruct him that all communication will go through your attorney. Each interaction with him will make it more difficult to move on, and cutting ties complete will allow you to start healing.\n\nI am so sorry that this has happened to you, and I wish you the very best.  If I can be of any additional assistance, feel free to send me a message.\n\nTake care.",
            "You will be better off in the long run even though it might not seem like it now. You should never have to force things in any relationship, especially marriage.",
            "I'm so sorry. I know how bad it hurts, because the same thing happened to me when I was 31.  I also had been married about a year when he began acting strangely.  \n\nIt isn't about you.  It is about your husband's inability to be satisfied with his life.  He is most likely a man who loves to chase women.  He needs that thrill and the uncertainty to feel energized and happy. \n\nIn order to survive, I cried a lot.  I journaled.  I left and moved in with a friend.  I learned how to \"unlove\" someone.  \n\nMy ex was like 2 different people: the man I fell in love with and the icky, cold man I was married to.  \n\nWarm hugs for your aching heart.",
            "So sorry to hear... Look I gave this kind of advice last week on this sub\n\nFirst you did nothing wrong, it seems you understand that... So there was nothing you could do, It Literally is part of his Nature. I used to fight (Verbally and zphysically) with my friends that pulled this crap... Alot!\nI mean how hard is it to remain faithful?\nFocus what you have in hand, not the grass on the other side.\n\nHe cheated FOR her, He will most definitely cheat ON her, you eluded to that in your post... Again you could not stop that.\n\nHe is so toxic and it's like a snake bite, the venom takes time to get out of your system. Time does lessen Pain, it may or may not remove it... but Time does Lessen it. Time is a gentle healer, let time do its wonderful work. Again that's something you cannot change.\n\nYou must feel the pain you do, do not suppress as total healing can happen, the old band aid scenario. Pain is a strong advocate for change... Pain, you can run it avoid it or stay there and whatever is causing that pain will damage you more.  If you had stayed that situation there was more pain coming your way... That is something you could and did change. WELL DONE YOU.\n\nThough you may not know this yet, a tremendous burden has been removed from your life. He is a SEP Someone Else's Problem NOW. \nPain comes and pain goes, Character Remains, His character has been exposed, yours is just starting to Shine, You are Loved... END OF STORY. You will Love again, just right now the toxin of his Venom is still in your system... that is something you can change. First breathe fully in and fully out. Remember you had a life before him and you have a life yet to live. A great saying I heard when I was young. Hold onto that which is Good, but for the Bad, Learn from it then release it.\n\nMay my post and long Rant help you to focus.\nFrom my heart may you Go Well and truly God Bless\nOn my cellphone so please Forgive my many typos",
            "I'm so sorry that you have been through alot of hardships. However you should not stay with him. He straight-up showed you that he doesn't want to be in the marriage. It's not worth being with someone who has hurt you and it will only damage you even more emotionally. Don't waste your time, life is very short to be with someone who is not worth it. If you do decide to divorce, don't see it as a curse, think of it as freedom, for you can search more about yourself and strengthen yourself. I wish you the best and be strong.",
            "Everyone is right, get a lawyer, face the facts, he said it's over and even if he changes his mind you must move on. Things will only get worse, Liars are liars. You deserve a relationship based on truth love and friendship. Sending you strength♡",
            "Divorce his sorry ass. Take it all. Use voodoo curses, minor ones just to inconvenience him in slight ways. Then move on and do so well for yourself you’ll look back and laugh.",
            "Kick the bum out and live for yourself.",
            "It’s only been a year no kids right? Seriously. Clearly time to move on. Tell em both 2 get fkd. And plan a new life. Sorry but when a guy says that shit it’s over. And what a pos for treating you that way. You’re better than that and you know it.",
            "talk to someone you really trust and just let everything out sometimes it just feels amazing to talk to someone and get their view and it still feels great for me even if I don't agree with what they say. but that just personal experience so you don't have to do it if you're not comfortable",
            "I'm so sorry you're having to go through this. Eskimo kisses and hugs <3.",
            "Look...he doesn't want to work it out. He doesn't want to work on the relationship. He's decided that he doesn't want to be with you.\n\nAll you can do now is do right by yourself.",
            ">I don’t want to leave my house but everywhere in it I see him. \n\nSo fill your time changing it. Re arrange furniture, box anything that you dont love, paint if you can. Change out pictures. Buy a lovely new bed set that is just for you. For me that was a cottage floral with a giant dusty pink bow. It was gorgeous and super feminine and made me appreciate that all these choices were now purely for my own pleasure.",
            "alexa play “heather” by conan gray. honestly the only advice i can give you is faking it till you make it. you need to prove to him you don’t need him in your life, you don’t need him to be happy. you’re in control, this is your life. it’s ok to cry, it’s ok to feel things. you can do this",
            "I would say - as far as the house goes - you can make it yours. My story is not the same as yours so I can’t claim to understand your feelings of course. \n\nHowever my ex and I bought a house together and raised our girls there. And when we divorced I wanted to sell it and start all over because the memories seemed like they would be too much. But for various reasons I stayed and had a couple cathartic days when all was said and done where i put on loud music and purged some of our joint things and painted my room and made spaces in the house more mine. \n\nIt can actually be empowering in a way to stay in a once-shared space, and make it your own.",
            "Please remember that there are good men out there that won’t cheat on you. Don’t prolong the Inevitable, he is cheating on you and has ended your marriage. Let him go. You deserve so much better.",
            "Get the Chump Lady book. Good walk through.",
            "Stay strong and watch out,  some people start putting on the we can be friendly act and talk you out of going for what you deserve! Get all you can from the divorce and move on to a better life .",
            "Why does he sound like a 21 year old in some casual relationship, when he's a married grown adult. Im so sorry. Divorce. You will heal. You can do this.",
            "Sorry this is happening to you, but a man should only have to tell you he doesn’t want you once. You should file for divorce and lean on your support system to get you through this.",
            "Stop thinking about you as a couple and start thinking about you as an individual. First, get a lawyer. do not worry about the expense since the lawyer will make sure ex pays. Then follow his advice to the letter. Make sure the lawyer knows how much you've been hurt so they can take appropriate action. Since you do not have a job, ask the lawyer to try to get you living expense money until you get back on your feet. Do not move out unless the lawyer says you should. Instead get him to move out, have him abandon you and the property. Make it a game and enjoy winning for a change.",
            "It’s okay to feel your feels. They will pass. You have gotten through this before, you can do it again. I am sorry this has happened to you",
            "Very sorry you're hurting right now. Lawyer up, get a divorce, and never talk to that \"friend\" again, (who never really was a friend to you btw). Good luck, so sorry again.",
            "Ummm, only a year of marriage?",
            "You will get over this, you will be strong, maybe not tomorrow or the next day, but in enough time you will.",
            "I just wanted to say, I'm so sorry for your pain. I hope you find a way through it. In 2019 I ended a 9 year relationship and I went to travel to stay ahead of my sadness. It worked and brought me a new way of being in the world and changed my life. I wasted 9 years on some jerk who didn't love me, don't waste yours either. This guy did something cruel to you, don't give your love to such a person.",
            "I'm so sorry. I hope you can recognize that anyone who would treat you this way, and especially claim to have no emotional connection to you, is not going to be a good husband or partner, and is not worth your time. That doesn't make it less painful. Time will help, but for now, can you live in a different place, or can he?",
            "First: you are not pathetic for ever clinging to your husband, he’s pathetic for making you feel like that. \n\nSecond: he’s a pig and doesn’t deserve you. This is NOT bc of you. You will be enough for a man who shares the same values as you (e.g. not a pathetic cheater, for a start) and you’ll laugh and smile and feel desirable again. I’m as sure of this as I am that your ex’s fling won’t last. \n\nThird: Drop the friend. She’s disgusting. She’s not better than you. \n\n\nA lil story: \n\nMy moms ex-husband and father of her kids, cheated on her after 12 years with our much younger cousin. They had a public, drug-fueled (reason #1 for divorce) relationship that ended as quickly as it started. He started sleeping with a co-ed who had been spoiled by her daddy’s money her whole life, got into drugs, and then her cousin’s husband. My mom was sure they’d marry and live happily ever after bc she was absolutely broken by this situation but I called exactly what happened from the start. He’s now with a diff girl and can’t keep up with child support or manage to meet to get his kiddos and my mom kicks a&&! \n\nYour {ex} husband won’t be with this chick for very long. Once they aren’t sneaking around, the fun will fizzle pretty quickly. \n\nYou just have to take this one day at a time and give yourself time to process and heal. Don’t let yourself have too much free time. Stop obsessing over when he lied, he lied the whole time. Figuring out when and where just keeps you invested in this person who does not deserve anymore of your attention. I know your heart is broken, and I am so sorry. You don’t deserve this but you are light years too good for him. Go BE great and find someone actually GREAT! \n\nHugs",
            "I am so so sorry this has happened to you. I hope you do not blame yourself and realise that everyone is one their own journey, learning, hurting etc. and  he has lost one of the best things because of his own shit that he needs to figure out. \n\nI hope you recover well from this and one day I promise, you will look back and think, \"Thank fuck\", because your future will be so much better; it will be worth it.",
            "Heartbreak is the worst. It feels like a literal death. And you will grieve that death. Greif has so many stages so be patient with yourself and feel everything you need to feel. But in the end you will be thankful that you found out now then 10-20 years from now. I'm so sorry this happened to you.",
            "I think you should consider some solo therapy to help you work through this. Focus on yourself for a little while, do things you enjoy and did enjoy before him. Have a look at any compromises you made for him and reverse them, build your life again according to you.",
            "Read ‘getting past your breakup’ by Susan J. Elliot . It saved me",
            "I would never want to be with an immature liar like this man. I feel awful for the pain you’re in. You’re better off without him. Oh and if it’s of any consolation... he will cheat on his new girlfriend as well. Trust me.",
            "You're thirty years old, and (assuming no calamities or accidents) have a half a century of life ahead of you. \n\nMy advice is to speak to a lawyer about your legal options, speak to a counsellor to unpack the hurt and betrayal you must be feeling, and to build a fulfilling and happy life for yourself that doesn't include this lying, cheating piece of shit.",
            "What an asshole he is.",
            "Get a hobby breh, it's so easy to move on when you can be happy.",
            "A few thoughts come to mind. You are going through so much right now- take a moment for yourself. Know that you are a catch and worthy of being treated with the ultimate respect. Rely heavily on your girlfriends who build up your worth. I highly recommend watching Beyoncé’s Lemonade. I always say- if Beyoncé can be cheated on .. anyone can. There is no shame in this journey. Just the building blocks to make us women’s into the strong individuals that we were made to be. \n\nYou got this!",
            "If this is happening after not even a year of marriage you should separate. Trust me on this. Ask him for space and send him out of the house while you prosses this.\nYou guys are young.  And he's at the midd life crisis stage of his life which a lot of times for men means cheating.   You can either wait till its out of his system or move forward without him. \nIf you eventually decide on the latter date guys in their late 30's/40's.  We tend to be out of our manly man womanizing phase by then.  You have to remember,  these days most American men don't \"grow up\" until that age. And yes, myself included.  I'm very sorry for your situation and I hope this helps",
            "I'm really sorry this is happening to you. Its so confusing to see someone you thought you knew change like that. You don't deserve that treatment and you especially shouldn't waste any more time with someone who does shit like that to you. It's the ultimate betrayal.\n\nI watched my mom go through something similar after 30 years of marriage. It felt like my dad literally changed overnight and just sabotaged the hell out of our family. It was devastating for my mom. They were together since 15 years old and she dedicated her life to him and us....only to be thrown out one day like yesterday's trash.\n\nFast forward to 15 years later. Through that time my mom went to therapy and regained her strength and came out of the gates kicking.  She got her real estate license and formed a team. She now makes well into the 6 figures and is almost living debt free! She has a boyfriend who treats her like the queen that she is. This past year she got her portion of my dad's final retirement payout and she took us all on a cruise to celebrate. We had a moment where we reflected on where we were as a family to now and it was a beautiful moment.\n\n Its so hard when you are walking through that fire....burning alive....but its important to remember that there is better days ahead. Stay focused on those better days for you. I wish you the best OP.",
            "I am very much like you, a practical person who pushes forward.  Keep being that person, it will help you tremendously!! I know you are hurting but you are strong. You deserve better. There will be better days ahead!",
            "I'm so sorry this has happened to you ❤️",
            "Try to find some free therapy or a support group.  Church is a very good place to heal, make new friendships and refocus your life.  No relationship or marriage is perfect and you can not force someone to desire to make it work when they don't want to.  If you have family or friends you may want to live with them.  Concentrate on your healing and growth.  Do you want to go back to school?   Choose another career?   Make this a time for you and DO NOT DATE anyone until you are healthy.  There is life after divorce.",
            "You get though it by showing him the same thing he showing you. And on top of that y’all been marry only a year. A year these days is like a month. Sometimes you have to put something new in your life mentally. Sorry just pissed me off when people get married and start doing dumb shit. But if you care about him don’t let him know cause you already tried that. But do things that he don’t expect you to be doing and watch his reaction. But a person can have his cake and eat it to. I’m pretty sure you heard of that before. But my point is there other ways to find out if your man loves you. And if so he needs to keep it real and keep a smile on your face.",
            "Hi so confused bf has cheated alot in past with his ugly h sister in law but has come along way but weird yesterday he didnt call me at gym like usually does. he cut his hair cut doesnt have long hair anymore. I gave him a  tiny brown towel i let him use for gym has one long black hair on it is it maybe his i doubt it it looks like her type of hair should i confront him about it or wait  os hasn't slept with me since he supposebly left his affair can someone give me advice.",
            "Forgive yourself for feeling angry or sad or hateful or for not knowing what you want. Forgive yourself for everything you’re doing to feel okay. Forgive yourself for not knowing and for not asking the questions that were pressing against you when something didn’t feel right. And let go of any shame – for leaving, for staying, for any of the feelings you felt before the affair or during it or afterwards. None of the shame is yours to hold on to.\n\nEvery relationship has a ‘make it or break it’ point. Some relationships will have many. Forgive yourself if you missed something. This relationship involved two people. If you weren’t giving your partner something he or she needed, it was up to them to tell you so you could put it right. There will have been times that your needs went hungry too. It happens in all relationships from time to time. It’s the intensity and the duration of the unmet need that does the damage. You deserved the chance to know that something wasn’t right. And you deserved the chance to put back whatever was missing. You have that now. If you aren’t able to give your partner what he or she needs moving forward, forgive yourself for that too. Sometimes two great people don’t mean a great relationship. Sometimes it’s not the people who are broken, but the combination of you.\n\nYou will always be someone’s very idea of beautifully and imperfectly perfect. Most likely you have always been that to your partner, but somewhere along the way, life got in the way and things fell apart for a while.\n\nRight now though, you are going through a trauma. Give yourself plenty of time to forgive, and to start to feel okay again, whether that it is in the relationship or out of it. Be kind to yourself and be patient. You deserve that. You always have.",
            "Leaving that house and filing for divorce is a start. After that, you’ll know what to do.",
            "This may be very unpopular, but please hear me out.\n\nIf you've been cheated on by numerous men, maybe the issue truly lies with you. \n\nI would take this as an opportunity to do some serious self-reflection and growth. Why do you get emotionally involved with men who would consider cheating as an option? Why do you have a \"friend\" who would be willing to put herself between you and your husband? Why do you believe that all was well on Valentine's Day, when it obviously wasn't - he did kiss her the next week, after all. Considering that, he is either an excellent liar, or you are living in a fantasy and you were subconsciously ignoring the realities of your relationship with him. \n\nBefore you rush for divorce, I would empathically suggest accepting his feelings for her, dealing with your grief, and then spending an enormous amount of time and energy looking at yourself. The truth is, if you don't address the reasons why you married a man who saw cheating as an option, why you have been with cheaters in the past, why you didn't see this coming, and why you are surrounding yourself with \"friends\" who would betray you like this, then you will most likely just repeat this cycle all over again even if you and your husband get divorced. Maybe, after you've done all of that, you might find you and him can have a shot at real love. Maybe not. Maybe you will realize you married a man with an irreparable character, and you find someone else. Either way, you will be better positioned for true happiness.",
            "I recommend that you skip therapy and immediately purchase a motorcycle. Put some thrill back into your life. It will help you forget about EVERYTHING.",
            "Have you ever thought about polygamy?",
            "No one wants to hear this but having been unfaithful I can say it’s never just black and white. There is more to it than he’s just an asshole. It’s not black and white. There’s shades of grey. \n\nThe victim of an affair is not always the victim of the marriage. \n\nWatch Esther Perel and get some insight as to why this happened.  Esther Perel is the lead therapist on the topic of infidelity.  I’m not saying this is your fault ... but I am saying this can be an opportunity to really examine the relationship as a whole. \n\nVillainizing him is too easy. \n\nSee why the marriage came to this. What you unravel in questioning this will help make you understand it better so you avoid someone like this again.",
            "Move on yo,. Millions of guys will not say no to a bj"
        ]
    },
    {
        "post_id": "4gf0t3",
        "author": "pixiemixi",
        "title": "[UPDATE] I [30F] just learned my husband [31M] has feelings for my SIL [29F] and hates my brother [32M].",
        "url": "https://www.reddit.com/r/relationships/comments/4gf0t3/update_i_30f_just_learned_my_husband_31m_has/",
        "score": 2928,
        "num_comments": 146,
        "created_utc": 1461613173.0,
        "selftext": "Here's the [original post](https://www.reddit.com/r/relationships/comments/4g6d8c/i_30f_just_learned_my_husband_31m_has_feelings/)\n\nHi, r/relationships. I know this update is coming fast, but I've made my decision and I thought you'd all like to know. A lot has happened in the past day, but in the end, I think I'm making the right choice. Tbh I think I knew this is what I had to do all along, but I was in denial.\n\nI want to start off by thanking everyone for their advice, kind words, and even tough love. I have decided to end our marriage and get a divorce ASAP. It's heartbreaking and painful for me to do this, but honestly, I don't think I could live with knowing my husband loves another woman *and* assaulted her in front of me. The fact that this is my SIL makes it even worse. I don't think we can come back from this and I would always feel like I wasn't his first choice.. plus, he touched and kissed Kate without her consent, which is an awful thing to do by itself.\n\nI sat down and really, *really* thought about what happened and how it made me feel. It made me feel disgusted, hurt, and angry. It made me feel like an idiot. It broke my heart. I couldn't believe the man I loved, the man I have been with for almost a decade of my life, would betray me and hurt me like this. It almost doesn't feel real. To think we were going to have kids, to think I trusted him and gave him all the love I could. It fucking hurts.\n\nA lot of you suggested that maybe he married me so he could be close to Kate. We sat down last night, I showed him your comments, and he broke down. He admitted to me that yes, he did marry me to be closer to her. It's always been her. From day one of our relationship, it's been a ploy to stay close to Kate. Not only is this devastating to me, but it's extremely creepy and I feel bad that Kate ever had to be around Jack. His intentions were almost predatory.. who knows what he would have done to Kate if her husband and I hadn't been there to intervene. I honestly think he would have done some truly horrible things to her, given the chance.\n\nHe begged me to stay. He promised he loved me, he could get over Kate, he wanted me. I was his soulmate. We were meant to be together. He would go to therapy to work on his issues and we would be okay. He was sobbing and begging and trying to convince me to stay. I wasn't hearing it. I'm done. He's a liar.. he's been lying to me for years. He's creepy, horrible, and I can't live with him knowing what he did and how he truly feels.\n\nI called Charlie to talk to him about everything.. like always, he's here for me. He's incredibly pissed at Jack because of what Jack did to Kate. Kate is still shaken up and upset; she feels violated and her trust in Jack, someone she considered her friend for years, has been destroyed. Charlie told me that if I had chosen to stay with Jack, it was very likely our relationship would have died right then and there. Charlie told me he refused to talk to anybody who believed what Jack did to Kate (assaulted her) was okay or forgivable.. even if that somebody was me. He also thinks what Jack did to me for all these years is beyond cruel and he's angry about that, too. \n\nI still have to contact a lawyer and get things in order. It's only been a day since I've made my decision.. but you were all so, so helpful to me. I can't begin to express how thankful I am for your comments.\n\nIn the end, my brother and SIL are the people that matter most to me. They're my real family, the people who love me, and they're here to support me through this decision. I'm young, there's still hope for me to find someone who sincerely loves *me*, there's still hope of starting a family, there's still time left for all of that. I'd rather take my chances of finding someone new than staying with Jack.\n\nThank you, again, for everything. \n\n**EDIT/UPDATE #2**: Thanks for the condolences and kind words! It really means a lot to me. To address some concerns:\n\n* I will be extra careful and keep an eye out for anything Jack tries to do. Like many of you said, his obsession is unraveling, so he might do something drastic. I'm going to contact my lawyer ASAP to start seeing what I can do, change all of my passwords, get my bank accounts in order, etc. I have also **removed any information of my future whereabouts and plans** as some of you suggested.\n\n* I'm going to book an appointment with a therapist. I feel like it would benefit me and help me work through this whole thing.\n\n* Kate doesn't want to talk to/interact with Jack, but she is thinking about getting a restraining order. Understandably, she doesn't feel safe around Jack at all and would rather have nothing to do with him. She's also going to be extra careful, since she's the person of Jack's obsession and he'll probably try contacting her/doing something crazy. Charlie is there to protect her (he's a former Marine, 6'3\" and pretty dang intimidating), so I'm sure they'll both be okay. We're all here for each other.\n\n* Some people don't believe this is real because of my timeline (I said we've been together since HS in the last post, but then said \"almost a decade\" in this post). This was a mistake, I meant to type \"over a decade.\" I can't prove the validity of my story, so you'll just have to take my word for it. I don't really feel the need to explain myself here. You either believe me or you don't. It's a bizarre situation. I can't explain Jack's behavior any better than you can.\n\n* On the bright side, Charlie and Kate are still trying for a baby, so there's a pretty good chance I'll be an aunt in the near future. There's still hope for me to find \"The One.\" In the meantime, I'm going to focus on me, and moving on from this whole thing.\n\nThanks for the concern and encouragement! :)\n\nTL;DR: Getting a divorce. Sad, scared, but hopeful. Thank you, Reddit.",
        "permalink": "/r/relationships/comments/4gf0t3/update_i_30f_just_learned_my_husband_31m_has/",
        "comments": [
            "I'm glad you were able to get some clarity from posting here.  Sometimes I think \"divorce!!\" gets thrown around a lot, but it was absolutely, totally warranted here.  I'm so sorry that you and your family have had your lives violated by this terrible man.  He has taken your love and trust and selfishly abused it.\n\nHe's probably going to go into desperation mode very quickly, so make sure to secure a lawyer.  Not only that, get your personal papers, things like IDs, passport, birth certificate, etc and keep them safe.  A lawyer would have to tell you what's \"OK\" to do with joint resources, but I'd be keeping a close eye on the checking account as well.  Don't let him hurt you further.",
            "God, OP I'm just really sorry. ",
            "I do think Kate would benefit from filing charges and to try and get a restraining order against him. What. A. Creep.\n\nI'm so happy for you though that you got out before any children got involved and that you have a strong support system around you. Wish you all the best for the future.",
            "I am so sorry that he did this to you. I just want to take a moment and give a word of warning: Please be on high alert. He's someone with what seems to be an obsession with his world unraveling. He may make poor decisions. Please stay safe and watch your back, and have Kate and Charlie do the same.",
            "I'm not generally of the alarmist persuasion, but this is really pretty disturbing. I mean, it's elaborate and long term and he's heavily invested. That incident the other night sounds like the wheels finally coming off his carefully maintained persona--normal guy, husband, BIL--like, he's crumbling. I might be worried about him doing something desperate, if you think about it, the guy has just lost everything, his whole ornate fantasy world has just imploded. \n\nBe careful, you and your family. And good for you for walking up to this, I'm sorry it happened.",
            "Kate should look into getting a restraining order on Jack.  He might escalate his behavior since you're divorcing him and he won't be able to use you to be close to her anymore.\n\nI hope everything goes smoothly for you and I'm sorry Jack lied to you and betrayed your trust.\n\n\n",
            "Good for you, hon.  I know it's horrible right now, but eventually you will be so grateful that this asshole showed you his true colours before kids got tangled up in the mix.  \n\n>I think it will help me in grieving for my marriage and for everything that I'm losing.\n\nYou absolutely deserve your grieving period, but I think the only thing that you're losing is some toxic dead weight.  You're gaining the potential for a bright future, maybe with someone that genuinely loves you, someone that you can build a loving family with.  ",
            "I'm sorry this has happened, but you made the right choice.\n\nYou, Charlie, and Kate need to figure out how to be safe. Your soon-to-be ex-husband is unstable and while I hope he sees the light and seeks help, you're not guaranteed that... I would talk to a lawyer ASAP and a therapist or a cop who specializes in protecting stalking victims.",
            "So he tearfully confessed that your entire relationship has been a sham to creep on your SIL, then he tries the soulmate line? This sounds so fucking fake. ",
            "You can and will do a lot better.",
            "This one truly hurt my heart to read. I am so sorry, OP. \n\nI think the getaway with your brother and SIL is a great idea. But don't forget to give yourself space to grieve in your own way. Your loss is different from Kate's, or Charlie's. And you're the one who will have to deal with the legal fallout (can I just say, thank GOD you didn't have children with this monster). I'd seek out a good counselor for yourself, to be a neutral third party you can trust with all of your emotions, no matter how ugly. It'll help immensely. \n\nGood luck, OP. Stay strong, you're doing the right thing.\n",
            "Not to sound alarmist, but...take exceptional care for awhile.  You *and* Charlie *and* Kate.  Your soon-to-be-ex is obsessed with your SIL and now his ready access has been cut off.  His world is crumbling and men like that have a tendency to not go quietly.  \n\nEveryone needs security cameras.  No one walks alone to their car after work.  And maybe you and Kate should go underground until STBE gets through the enormous crisis that's coming.  Like I said, alarmist...but.  But PLENTY of women have been killed in this world because a man couldn't handle the rejection.\n\nSo.  Be very careful, take every possible precaution.  No one here wants to here that you or Kate died as the result of a murder-suicide.",
            "I would sincerely suggest that Kate gets a restraining order.",
            "OP, please tell your SIL to press charges on assault and get a restraining order, as it is likely he is going to stalk her. This will also help you in the divorce, as you can often get a much quicker divorce if your partner commited a crime of this nature. \nI wish you the best. You are a great person, and now you are free of that horrible person. There will be plenty of men that would love to be with you and love you for you. Sometimes things like that happen, you just catched the creep accidentally, and as hard as it is and as much as it hurts, you can recover. You will heal.",
            "Man this guy is a true snake with all his lies:\n\n> He admitted to me that yes, he did marry me to be closer to her. It's always been her. From day one of our relationship, it's been a ploy to stay close to Kate.\n\nVersus\n\n> He promised he loved me, he could get over Kate, he wanted me. I was his soulmate. We were meant to be together.\n\nYou can't tell fact from fiction regarding his feelings for you... does he genuinely love you and want to keep you or does he just want to keep your proximity to Kate?\n\nSorry it wound up like this. He's messed up. Glad you have your bro and SIL to support you. ",
            "Someone should start making screenplays out of the shit that gets posted on this sub.\n",
            "> It made me feel disgusted, hurt, and angry. It made me feel like an idiot.\n\nThis happened because your STBX is a douchebag, not because of anything you did or failed to do. Please remember that.",
            "Good for you OP. \n\nIm ashamed to admit that while reading your story I was half expecting Sawyer, Hurley and the Smoke Monster to show up.",
            "I agree with others that Kate should get a restraining order from Jack.\n\nAlso, when you start dating again, there's a chance you will develop jealous feeling towards Kate stemming from this situation. I suggest you prepare yourself for this now. Therapy seems in order for this situation, especially after having been lied to for so long, you're going to have trust issues. These are normal reactions but for your own sake, take care of it *before* it damages a good relationship you get into.",
            "I'm so sorry.  I really am horribly sorry for you.  This is truly heartbreaking when I think of you in all this.   Jack is a disgusting human being and I think maybe Kate should look into the merits of a restraining order against Jack.  By all means, the guy fucking married you to be close to her.  He got drunk and assaulted her.  He confessed to it all as well.  You stated that you guys worry what might have happened if Kate had been alone.  For Kate's sake, I think maybe you should at least file a report with all the pertinent information.\n\n\nI think you're doing the right thing with divorcing Jack.  Ignoring what he did, and just basing his feelings purely, you deserve, and WILL GET BETTER from another man.  There are men out there who will love you, for YOU.  Not for your proximity to Kate.  His actions make me want to vomit.  It was disgusting and horrible and cruel.  \n\n\nBut you will get through this.  You seem like a decent person and you have a great support network.  You will be fine and you deserve better.  You deserve happiness and love.",
            "You sound like someone with a good head on your shoulders, so you probably won't be talking to Jack about anything but divorce again, but if he does continue to try reconciliation, remember what the four of you were talking about just before he flipped out...having kids, and your respective futures together.  Whether subconsciously or not, he decided to blow it all up, forever, and there's no coming back from it.\n\nYou and Charlie and Kate have done nothing wrong, and hopefully you find someone honest and genuine in the future.  Jack needs lots of time alone and therapy, and even after all of that, he still will not deserve a relationship with you.",
            "Oh honey, fuck this guy. Fuck this guy so hard with fire. \n\nYou will be -amazed- at how much better life will be after this. ",
            "OP, I wish I could give you a hug. It's going to be hard, but you definitely made the right choice.",
            "I am so sorry that it played out like this.\r\rOther people will give advice on the legal aspects, so I'm going to leave them to it.\r\rPlease just remember that none of this is your fault. While you feel embarrassed now, please understand that you have no reason to be. You loved someone who had ulterior motives, and you trusted him when he said he loved you too. Believing the best of someone you love is nothing to be ashamed of, even when it turns out that they are (as my five year old says) giant fart faces. \r\rI'm very proud of you, this seemed like such a cut and dry situation for those of us on the outside, but I know it wasn't that simple for you. There is a life out there, full of people who either already truly love you  or will in the future. Stay strong, and don't let the giant fart face get you down. ",
            "I'm sorry this happened to you. Please make sure to check your fiances and credit history, you can't trust this man to not be doing things behind your back. Also recommend that your brother and Kate take in their electronics to be check in case he's been hacking their laptop camera or using it to follow her. (On that note, check out your electronics too.) They should also change their locks and any passwords of theirs he knows. Make sure all mutual friends know something so they don't innocently help him stalk her.",
            "I commented on your first post that your husband might have married you just to stay close to Kate, but reading that he admitted to it still shocked me. I'm so sorry OP.\n\nThank goodness you didn't have kids with him. Divorce, divide your assets, and never see him again. ",
            "With time, you'll be ok. You seem to have a good support system in place. Give it time. Hang in there. ",
            "Good luck! You have a loving family and I'm thankful for that. Take care and be brave onward to the new chapter of your life.",
            "Wow OP, i am sorry to read this.   I am glad you made the decision to cut him out, he is a creep and you all need to get a restraining order on him.  \n\n",
            "You've definitely made the right decision.\n\nIt's not even a case of who matters to you, it is more a matter of the fact you're with a 'partner' who wants to be with someone else.",
            "I hope that you find strength with your family and know are hearts are with you. Good luck in the future. ",
            "That's horrible.  Best wishes and good luck in the future and with moving forward.",
            "> It almost doesn't feel real\n\nIt's like living in a nightmare. \n\nKeep yourself busy. Don't be afraid to spend a ton of time with friends/family leaning on them. They'll *want* to be there for you. Remember that.",
            "You're 30 and no kids? You'll be fine :) You made the right decision to divorce a weird and possibly violent man. For lack of a better statement, fuck him. You can and will do much better. Now you get to use Tinder!!!",
            "I've pored through the new and the archived. I've seen all the updates I could see. Nothing beats the Fuckery of this. I'm so sorry.",
            "HELL YEAH--Congratulations!!!  Please take care of yourself and get as much support as you can.  \n\nAlso....did you pick Lost names?  :)",
            "Wow, good for you! Things will look up, just takes time. ",
            "I'm sorry you're in this situation. My heart is just hurting for you and I think you made the best decision. Be kind to yourself and surround yourself with people who love you for you. Good luck to you!",
            "Wow, what a tragic, yet necessary ending. I marvel at your strength OP. I'm sorry you had to go through this.",
            "you are strong and made the right call. I am so sorry this happened to you and I wish you the best.",
            "You did/are doing the right thing. Protect yourself. Lawyer before saying anything to Jack, protect half the money etc. Good luck. ",
            "Kate needs to lawyer up and get a restraining order if possible.",
            "Jack, Kate, Charlie... is your name Juliet? I'm sure you're a LOST fan. You should've called Charlie \"Sawyer\" instead, to stay true to the show. Anyway, good on you for standing up for yourself and good luck for a great future ahead.",
            "What the actual fuck. He married you to be close to Kate?! This is like seriously sociopathic levels of obsession. I'm so glad Kate is safe and your real family is intact. You're making the right choice, OP. *hugs.*",
            "I'm so proud of you for making the right decision, and SO happy that you don't have kids with this man. I would not trust him around a child. Plus, you can cut him completely from you life, which is a blessing.",
            "\"His intentions were almost predatory.\"\n\nThey are not \"almost\" anything. They ARE predatory.",
            "You are a lovely person to be so worried about Kate and her situation.  Sometimes you almost sound as if you worry as much about her as you do about yourself - or more.\n\nBut this is devastating for you, and I just wanted to say that I hope you spend a bit more time caring for yourself right now than for anyone else (naturally you want Kate to be safe - but you be safe too).",
            "*He also thinks what Jack did to me for all these years is beyond cruel*\n\nIt is beyond cruel; it's sociopathic.",
            "Please don't get shot. Have someone keeping an eye on Jack while you're enjoying the cabin, and make sure you answer the phone when they call to tell you they lost sight of him.",
            "Is it wrong to feel bad for Jack?\n\n\n\n\n\nJust kidding! Good luck with starting next chapter in life!",
            "I'm so sorry for all you've been through. Time will help dull the pain some, but in the meantime it will hurt like hell. Stay strong and take this internet hug.\n ",
            "I am sorry he put you through that. I am glad you chose your family over this filth that used you like that.  This is not your fault please do not feel guilty about his choices.  Feel good that you made the right decision and cutting him out of your life.  Find someone that loves you!",
            "Ugh, OP I'm so sorry this is happening to you.  I can't imagine how painful this has all been.  Of course you're grieving the marriage you thought you had, the husband you thought you had.  But allow yourself also to be grateful that this has come out so you can have the chance to build a life with someone *real*.  \n\nYou have shown incredible strength to make this decision.  It was the right choice.  Surround yourself with love and cherish the real relationships you have.  ",
            "Such a smart, level-headed decision. I'm so sorry for what you're going through, but I wish you the best. You acted quickly & things will only get better for you.\n",
            "All I want to say is it wasn't your fault and I am sorry this happened. ",
            "Be careful, now that you're saying no and detaching he might actually move his fixation from Kate to you and the most unhealthy sense of the word.",
            "I think you're making the right decision, you deserve much better and he doesn't deserve to ruin healthy relationships in your life with his toxic nature. Also Kate and Charlie are very right to be upset, I'm so glad you're moving forward with the right people in your life, big hugs!",
            "Jesus Christ this reminded me of Shaun of the Dead. Anywho OP you will get through this. You will. You'll be like a Phoenix part of you will feel like it died and be reborn in fire. For now all three of you enjoy that baby that's on its way and good luck to you all in everything. ",
            "I'm so sorry you had to go through that, but I admire how strong you are and how you're aware what the right decision is. So many people would have chosen their S/O. I'm so glad to hear you've chosen the healthy route. \n\nBest of luck to you OP. Stay strong, you can do this! ",
            "No advice, but wow, this post touched me really deeply in a way that a lot of fucked up stuff on this sub doesn't, and I just wanted to say I'm sorry for your loss, OP. I can't imagine what you're going through but I just wanted to say we're with you and hang in there. ",
            "Wow, I'm surprised your brother handled it the way he did. Had that been me, I would've probably hurt him. He disrespected you and his wife, in your brother's house. Definitely unforgivable. It'll be tough at first but keep yourself occupied, find a new hobby, rediscover who you are as a person and stay around positive vibes while you heal.",
            "This makes me so happy that you are seeing how valuable you are and not accepting being someone's second choice. I'm in awe of how brave you are facing this and wish you the best of luck! ",
            "I would get psychiatric help and then sue this guy in small claims court for PTSD, all three of you.",
            "Wow, he married you to stay close to Kate?  That is super creepy and obsessive behavior.  Sorry you had to go through all that :(",
            "OP I'm giving you a virtual hug right now. Just thinking about how much of a creep your soon-to-be ex husband was makes me wanna take a long hot shower. I'm glad you picked your family over a jerk like him. You're in my best wishes OP. Have fun with your mini-vacation with your folks and use that time to cleanse yourself mentally. You deserve it. Good luck OP!",
            "Im glad that you made this tough and hard choice to leave him, im also happy that you still have your brother and SIL to lean on during this process. I wish you a happy future OP",
            "> I couldn't believe the man I loved, the man I have been with for almost a decade of my life, would betray me and hurt me like this. It almost doesn't feel real. To think we were going to have kids, to think I trusted him and gave him all the love I could. It fucking hurts.\n\nYes, it truly sucks.  The betrayal is beyond crazy. Work on your emotions and good luck!\n\n\n\n>He admitted to me that yes, he did marry me to be closer to her. It's always been her. From day one of our relationship, it's been a ploy to stay close to Kate. Not only is this devastating to me, but it's extremely creepy and I feel bad that Kate ever had to be around Jack\n\nI have no words. That is A+ for insane mental actions. You have my sympathy!!\n",
            "I am immensely sorry. This entire situation is just plain awful and no one deserves this. You deserve someone that knows you are enough, a soulmate and partner for life. You sound like you have a strong head on your shoulders and I fully believe you made the right choice and you most definitely will be A-ok. Hugs",
            "Sending love in this tough time <3",
            "I'm so sorry. You are doing the right thing but I can't imagine how much this whole thing must hurt. I'm so glad for you that this all came out in the open before you snd Jack had kids. Now at least you can just remove him from your life entirely. Best of luck to you. ",
            "Jack stole years from you and the potential of actually finding someone who loved you during those years for his own creepy, obsessive, and selfish desires. You deserve better. I hope you have a happier life without that scumbag. \n\nYes, Kate get that restraining order. He assaulted her around you and her husband; no thinking what he would do now. ",
            "I'm so sorry for what's happened to you OP :( I have such admiration for the way you seem to be dealing with things and that you're sticking to your guns regardless of how much breaking down and crying he did. Good luck with everything! ",
            "Wow, that confession is disturbing. Thankfully you have a support structure in place to help you through this. Good luck.",
            "That is some crazy shit. I'm glad you're out of there.\n\nWith regards to your second edit/update, your sister might not be able to get a restraining order without documented proof of him harassing her. She may be able to get an order or protection, which is something you should look into as well because frankly....this guys a psychopath.",
            "I'm really happy that your brother and SIL are being supportive and close to you during this hard time. ",
            "> We sat down last night, I showed him your comments, and he broke down. He admitted to me that yes, he did marry me to be closer to her. \n\nThis is one of the saddest things I have read on reddit. I am so sorry. You deserve someone who is completely devoted to you.  I'm happy that you have such a good support system.\n\nJack reminds me of a guy I dated, simply because he did stupid shit when he was drunk. He always apologised the next day, it was never anything that bad, but it worried me. Then I found out he had once been in court for harassing a girl when he was drunk. The messed up thing was it actually hurt to leave him because I thought he was sweet. I knew it was for the best, especially now that when I read your original post, I automatically pictured him as Jack.\n\nGood luck in life, and stay strong.",
            "You go girl! ",
            "Good for you, OP!\n\nOne other note - this:\n\n> He admitted to me that yes, he did marry me to be closer to her. It's always been her. From day one of our relationship, it's been a ploy to stay close to Kate.\n\nAnd this:\n\n> He promised he loved me, he could get over Kate, he wanted me.\n\nAre mutually exclusive, imo. Unless he's one of those who's \"not wired for monogamy\" and can love multiple women types (which I doubt - plus you don't sound you'd be ok with it anyway, esp since it seems like you're more of a '2nd choice' for him, and for so long too), or unless he's gotten over her now (which is clearly untrue from recent events that transpired).\n\nI think you clearly made the right call OP. Stay strong!",
            "I think that, if she hasn't already, Kate needs to explicitly state to Jack that she's not interested in him, has never been interested in him, and would never be interested in him, even if she weren't with her husband. And that she considers what he did sexual assault, and wants no further contact with him ever, and will consider any further attempts to contact her to be harassment.",
            "I don't get why he would marry you to get close to your brother's wife. That makes no sense at all. I mean, with you for ten years just to get close to someone else? I don't know how that works. What's your husband been like otherwise? What have the years been like? Has the relationship been good otherwise? I'm not saying to stay with him, just something doesn't add up. He might have a mental illness.\n\nEdit: bring on the downvotes, scumbags.",
            "[removed]"
        ]
    },
    {
        "post_id": "t7d9w8",
        "author": "Justonethinmint",
        "title": "Me (F26) found out that a friend (M30) thinks that we've been dating for months and I've been oblivious, how do I tell him I'm not interested?",
        "url": "https://www.reddit.com/r/relationships/comments/t7d9w8/me_f26_found_out_that_a_friend_m30_thinks_that/",
        "score": 2930,
        "num_comments": 183,
        "created_utc": 1646498313.0,
        "selftext": "So our parents are friends and they introduced us last September because we have a lot of common interests. I'm an introvert and don't have a lot of friends but he seemed really nice if very quiet and we get along pretty well.\n\nI'm awful at picking up on things in social situations (reading the room, facial expressions, between the lines, etc) so I thought we were great friends.\n\nMy mom just asked when we were \"making things official\" because she wanted to let everyone know we are dating and it caught me off guard. She explained that everyone (including him) thought we were dating and just hadn't made it official.\n\nHe's very sweet but my mental health is not in a good place and I feel no romantic connection to him whatsoever, but I'd still like to be friends.\n\nI have a \"date\" with him later today and now I feel awful and I'm nervous where I wasn't before. How do I let him know I'm not interested and didn't mean to lead him on? \n\nTldr; Guy thinks we are dating, I had no idea and I'm not interested. How do I let him (gently) know I'm not interested?\n\n\n\n\nUPDATE: We talked, I apologized for the miscommunication and he let me know that he wanted to be friends still and we are good. I might be asexual and autistic so I'm going to get tested for autism and talk to my therapist about the asexuality. Thank you all for your kind words and advice!",
        "permalink": "/r/relationships/comments/t7d9w8/me_f26_found_out_that_a_friend_m30_thinks_that/",
        "comments": [
            "Don't automatically assume he agrees with your mom. And be honest with him, that's all.",
            "\"You'll never guess what, my mum thinks we're dating! Isn't that bizarre? I told her we're definitely friends, not romantic. Has your mum said anything? I think people of their generation can be weird about men and women being friends.\"\n\nLet him have the plausible deniability.\n\nYou do lose out on the chance to know if he ever thought it was anything else, but I think that's an acceptable loss in the circumstances.",
            "Do you kiss, hold hands, talk about how many children you want, send each other kissy face emojis, gaze into each other's eye over a romantic dinner? How often do you go out on real dates?\n\nIf not, why would a grown man think you are dating?",
            "This is bizarre.\n\nDo you meet up regularly? If so, does he try to kiss you or touch you in a couples type way?",
            "I operate by a simple rule: if we haven't had a conversation out loud that used the words \"dating/exclusive,\" don't fucking assume we are. Regardless of what your guy says, remember it'd be on him for assuming something of you without a discussion.",
            "Are you sure that he thinks that or that it's just your mom thinking that? Why does she think that she has a right to tell everyone your news? Wouldn't you tell the relevant people if there is something to share? This smells a lot like the mothers sitting together and dreaming and now putting on pressure, not that he thinks the same. \n\nJust bring up that it's funny how your mom tries to force romance where there is none. You'll find out yourself then what he thinks about this. It's going to be painful every time if he has expectations that aren't coming true, but you're not responsible for what's in his head. There is no real gentle way to tell him. So just be honest.",
            "Have you kissed ? It could just be your mom thinking this",
            "> She explained that everyone (including him) thought we were dating and just hadn't made it official.\n\nHow incredibly rude and presumptuous of everyone. \n\nThis isn't your failing. You've done nothing wrong. And unless your friend is *very* neurodivergent, it's unlikely he thinks you're dating unless he has:\n\n* Tried physical affection (put his arms around you, hold hands, tried to kiss you).\n\n* Described you guys having out as \"dates\"\n\n* Tried to take you to stereotypical date places (dinners at nice restaurants, walks in the park) or make chivalrous gestures (buy you flowers, open doors for you). \n\nIf he just assumed you guys are dating because you're two people of the opposite sex that regularly hang out, that HIS mistake. \n\nBut quite frankly, my guess is that this is your mother's meddling (spreading misinformation to others, trying to strong-arm you into a relationship) than anything else.",
            "I am unclear here.  So he hasn't told you this, or attempted a 'move' on you in months?  And you are basing this off what your Mom said?  I think you should simply ask him what's going on first, then just politely tell him what's up.   I mean, I'm a sensitive dude to the point of being a wimp, and I'd always much rather just have someone tell me something directly.   \n\nEdit:. I can't pick up signs well either.  But someone not making a move in months is kind of a different thing.  Or not talking about it for months.  That is just so odd.",
            "I'm baffled at why he would think you're dating if you haven't even talked about it.",
            "[deleted]",
            "After reading your update, please be cautious talking to your therapist about asexuality if you’re not sure they’re an ally. There are still a lot of people in the field who think asexuality is a mental illness or a simply a symptom of depression. I’ve seen way too many people in the community get hurt by their therapists who said really vile things to them when they tried to come out or get guidance when trying to figure out their sexuality.",
            "Approach him as a friend who is helping you clear up a messed up situation with your mom.  \n\n“Hey Name,  for some reason mom has decided that we’re dating and I need your help shutting this down before things get more complicated.   I’m in no place mentally or emotionally to date anyone and while I like you a lot it is in a friendship way not a romantic way.   So if you could drop a hint to your mom that we’re buddies but not boyfriend and girlfriend I would appreciate it. Right now I feel like a bad tv show for our moms”",
            "Just be honest and tell him you don't feel the same way.",
            "You said you've never kissed?   \n      \nThen your mom is either making this up / trying to get YOU to admit you're dating..... Or he's unwell.   Since September????? That's SIX MONTHS of dating without even a kiss.  He absolutely knows you two aren't dating.  He may have chosen to tell people you were, but he knows you aren't.",
            "It may be difficult to get a good autism assessment as women get pretty good at masking autism as they age - so be aware when you go for testing",
            "Lol he must have poor social skills as well if he just assumed you were together. Lol. I don't want to be mean because it's possible he's a kind person who just doesn't understand but at the same time it's kind of crazy to make that assumption. Also embarrassing. He's 30 so it sounds like he might have some issues if that's how he manages his romantic life? He can't even talk to you about it and then labelled it that way without even asking you?\n\nIf he gets angry, mean, abusive when u turn him down just block him entirely. It's not your responsibility to deal with a 30 year old man's issues. If he's being a nice guy to you as your friend but secretly wants things from you he's a straight up tool Mr nice guy who needs to get his head in the game.\n\nI repeat... The second he gets angry... Retreat. Far away. His feelings are not your responsibility. Be prepared to get out if there and DO NOT let him guilt you or feel bad about your decision and feelings.",
            "I believe I have autism as well but haven't thought much about getting tested.  I wonder how much that costs and what benefit there is to formal diagnosis?",
            "Saw the update, did he think the two of you were dating? I’m glad the conversation went well",
            "Oh Geez. This is the worst feeling and I’m sorry you have to do this but…\n\nYou HAVE to stop this before it goes any further.\n\nTell him you are sorry for the misunderstanding and that you do not feel a romantic connection. \n\nDo not say “for now” or anything unclear.\n\nBe strong and tell him.",
            "I just want to say, you might have Autism. It’s super under diagnosed in women.",
            "'I want to clarify that I see the time we spend together purely on a platonic level. I am concerned you might see this in a romantic or sexual way and I wanted to be upfront and let you know I do not share this. I say this because I wouldn't want to lead you on and I also don't want to feel like you're only spending time with me because you want something more. I understand if you don't wish to spend time together beyond this or if you want some distance if feelings were becoming involved on your end. Thoughts?'",
            "Just try your best to explain and talk to him",
            "Don't feel bad because I'm A LOT like that. At least he was good about it, I wonder if he just went along with what they thought and was thinking he was just friends.",
            "> I might be asexual and autistic\n\nI had that vibe too, from how you explained how you experienced this.",
            "You tell him exactly what you just told us here. That's all there is to it :)",
            "There’s two routes here. \n\nRoute A) Just tell him what your mom said, that she said he was under the impression you two were forming a romantic connection, and ask him if that’s actually true. Then, based on what he says, either let him know that while you really value your friendship with him you’re not interested in romance…. or have a laugh about how your collective parents are trying to play matchmaker. \n\nRoute B) Play it off. “Haha, my mom said she thought we were dating the other day. I told her we were just good friends. It’s cute that she wanted to play matchmaker though.” It gives him an out to not have to admit he had feelings or thought something else was happening, and it also establishes how you feel about it pretty unequivocally. \n\nGood luck. You can do this. <3",
            "Thanks for the update.  This is very sweet and dare I say it, wholesome.",
            "<3 good luck working out your self",
            "Why would he think you’ve been dating for months if you’ve never kissed or said/done anything romantic? That doesn’t even make sense.",
            "Just a mini-rant about men being clueless in this department.\n\nIn 2022, men have an obligation to make it safe for women to be really, really direct with them. It’s no mystery how to do this: just be a gentleman, be couth, and pay attention. Be appropriate about whom you give what kind of attention, be conscientious about cues, body language, nonverbal communication. Treat them with respect. Just because a women may deliberately be dressed appealing and look sexy gives a man no right to stare, or approach her to flirt. It isn’t an invitation. Staring is aggressive and can make anyone uncomfortable. I don’t think it’s any more complicated than that. \n\nIt is ironic but men who make it safe for women to be direct with them won’t find themselves rejected as often simply because they’re sensitive to cues and less likely to make unqualified overtures in the first place. It doesn’t have to get weird.",
            "Well for me if you haven't been on an official date so to speak and haven't kissed or both let on you into each other then ur not dating.\n\nMy GF and I kinda just moulded from friends to relationship as we hung out alot friend wise and I walked her home per usual one time as we live in the same town and we just both eye fucked each other as we realised we were hot for eachother so we went to her place and well the rests history.",
            "I have been lead on like this before. I went along with the idea that we were maybe going to be casual FWB but he seemed to have issues initiating anything sexual which is all I wanted. He couldn't do anything outside the confines of a relationship which is something I didn't want. I decided to try and stay friends with him without any expectations of sex and just keep it platonic, he got more and more unpleasant to be around and started becoming rather abusive. I ended up leaving, I guess at some point he mustve thought we dated or were bf/gf at some point and it's like dude...  no... nothing we ever did constitutes a date or us being dating. I did not mind being friends cause we had great memories but we were never on the same page... And yes we are fully grown ass adults. I feel like I was clear to him without being hurtful or cutting but he didn't get it.",
            "Big mistake in continuing to hang out with him but a good idea to get checked out",
            "How does he think you’re dating if you’ve never kissed???",
            "Honestly you can be dense as lead and it shouldn't matter. You are not dating unless officially stating so to each other.",
            "Have you been going on dates?",
            "FIRST OF ALL, you did NOT lead him on.\nHE assumed not saying no meant yes.\n\nJust be honest with him and understand if he doesn't want to be friends with you anymore.\n\nI've lost many friends that way and it made me feel like garbage and like they were only friends with me to wait and see if I'd date them.\n\nBut always, even if it hurts, hold your feelings as important. You could lose him, that's HIS loss for assuming you'd date him just because you hang out.\n\nIf you hadn't expressed any romantic interest, he is the one that is wrong. You stating your feelings here? They are completely valid. You haven't felt what he wants you to. So he is the one in the wrong.\n\nNever ever feel bad for telling someone how you feel just because your feelings being voiced hurts their feelings. If you have to keep your feelings unsaid JUST to keep theirs from being hurt, it's toxic and suffocating.",
            "How did he think you have been dating if you haven't been intimate or kissing etc.....?",
            "This is hilarious but I'm glad it worked out well. Just if you were setting a time and a day to hang out then y'all were dating. He didn't \"think\" you were dating rather you thought that you weren't.\n\nDates don't have to be romantic. Friend dates are a type of dates.",
            "Idk where you think you are asexual from this? Maybe something you didn't mention but I just want to make sure correct info is being spread about asexuality.",
            "Setting up a time and place to meet between two people of the opposite gender is easily assumed as dating. Especially for months at a time. Unless this guy is a virgin and clueless I’d assume he’d at least give you signal or make a move indicating he’s interested in being more than just friends. It’s hard to believe that clarification of what your relationship is with him has never been discussed after seeing him multiple occasions since September. He actually believes that you two are “dating” part of me wants to tell you to run for the hills and never talk to him again. Another part of me says he’s probably a really\nGood guy and he cares more about you than he does about his own sexual gratifications and that you should give this guy a chance. This is pretty weird ngl",
            "He probably doesn't want to be \"just friends\" if he previously had intentions of dating you. You two should be honest with each other and just break it off. Sounds like you're in different places with different desires",
            "omg, how do adults get themselves into these situations!?\n\nlike, how can you figure out how to use a computer and get on the internet and not know how to use words?",
            "I’m glad to see your edit, but just wanted to say that in a world where your mum had this impression simply because of this guy (and not because she was meddling or whatever), you’d have been well\nWithin your rights to call him up and tell him explicitly to stop whatever he was doing to give people the wrong impression. And then also tell your mum and anyone else necessary that there was no dating and never had been.\n\nSome people use people like you (and your unwillingness to make a scene, or fear of saying the wrong thing or “being too cruel” or even the autism/lack or reading social cues ) to force them into situations. Like they’ll ask you out in public, or call you their partner publicly so that if you don’t go With it, it looks like you’re the “bad guy”. It’s manipulative and wrong.\n\nMaybe he wasn’t doing this, but do just bear in mind that this is a thing",
            "is your friend’s surname Wolowitz?",
            "Chances of being diagnosed with autism at 26 is pretty slim.. like almost 0.. I’m not sure where you got this one from.",
            "Looks like you are looking into testing for autism, which is great! As for asexuality, maybe you are- but know that depression and anxiety can damper sex drive and romantic interest. As you get a handle on your mental health & a diagnosis, that may change for you.",
            "Just gonna be straight with you, if he does like you, and you hit him with the friendzone request. Your friendship is either over, or he will act different with you. If you want to remain friends only, just tell him. Dont blame yourself, and dont feel bad. If you didnt intentionally lead him on, then he just got the feels. Rejection sucks, and its coming his way. Do him a favor, and dont drag it out. Just tell him your not all there mentaly (thats not a insult or diss, it happens sometimes) and that you arent looking for a relationship \"RIGHT NOW\". \n\n\nI think thats more important, because when you do feel like dating. He will want to be the first one to take a shot at you, an you have to be ok with that because it means he really does care an like you for you. The best thing for him, and you is to just get the bad news over with.",
            "Ur parents introduced u and uve been going on dates....so u r dating. U aren't official, but ur dating. That's what dating is unless u have explicitly had the friends conversation.\n\nI would be honest about the situation. \"Hey, my mom thinks we r dating and asked when we will be official, but I didn't realize that's what this is. I'm sorry if I led you on, communication about these things is something I need to work on. If you want to stop being friends, you can just say so and there will be no hard feelings. How do u feel about the situation?\". \n\nSocial situations have endless rules and ur still learning them so don't make this person feel bad, and be honest, they deserve that much. If he doesn't agree with ur mom about the situation, this is his opportunity to say so and u can have a good laugh about it together.",
            "[removed]",
            "Poor him\n\nNot to blame you but\n\nPoor him",
            "First I’d like to ask, how does he mistakenly think you’re dating him?? Do you kiss him and act romantic with him?",
            "Pick up a trade and hold out on him until he stops. If he’s doing the same and ur dying because of it. BE INTERESTED!"
        ]
    },
    {
        "post_id": "53foa6",
        "author": "nora19294",
        "title": "My [32F] husband [33M] doesn't want our nanny to teach our daughter Spanish. Feel like I'm seeing an ugly side of him.",
        "url": "https://www.reddit.com/r/relationships/comments/53foa6/my_32f_husband_33m_doesnt_want_our_nanny_to_teach/",
        "score": 2928,
        "num_comments": 435,
        "created_utc": 1474254406.0,
        "selftext": "My husband Eric and I have been married for 5 years. We have one child, a four-year-old little lady named Katherine. We both work busy jobs but I'm a writer and I usually work from home or from my office down the street. Our live-in nanny, Ella [45F], has been with us for about six months. She is INCREDIBLE at her job, and she's honestly become part of the family.\n\n\nThe other day Katherine, my husband and I were driving somewhere in the car and my daughter said, \"Want to hear me talk like Ella?\" And she started speaking Spanish! I'm not fluent but I know enough to know that she was really speaking it, not just pretending. I was really impressed and told her great job, keep practicing, etc. My husband didn't really respond but I didn't think anything of it at the time. \n\n\nThen tonight (just now) Ella came to my office after Eric got home and took over watching Katherine. She was really quiet which isn't like her, and she apologized for teaching Katherine Spanish without asking. My response was basically, um...what? I told her (completely confused) that I had no problem with that and I actually think it's a fantastic idea. I wish somebody had taught me when I was little -- especially where we live in Southern California, it's a great skill to have. So I reassured her that I would actually appreciate it if she would keep teaching Katherine the language. Ella then told me that Eric had just asked her to please only speak English around Katherine. \n\n\nElla has gone back to our house for the night, but I'm still sitting in my office fuming. I am beyond furious with Eric, and I know I need to collect myself before going home and speaking to him. First of all, I feel like he's damaged our relationship with Ella, who's been nothing but wonderful to us and our daughter. Secondly, I cannot for the life of me understand why it's a bad thing for our young daughter to learn a very useful second language (which she'll probably have to learn later in school anyway). Eric has never expressed any racism (if he had, we wouldn't be married; that's a dealbreaker for me), but I can't see any other explanation for this. And finally, I am furious that he made the decision to talk to Ella without me. That's not how a partnership should work. \n\n\nA) Where do I begin in addressing this with him?\n\n\nand B) How do I make it clear to Ella that she's free to speak whatever language she wants around our daughter?\n\n\n  ---   \n  **tl;dr**: Our amazing nanny has been teaching our 4 year old daughter Spanish, and my husband asked her to stop without discussing it with me first.",
        "permalink": "/r/relationships/comments/53foa6/my_32f_husband_33m_doesnt_want_our_nanny_to_teach/",
        "comments": [
            "I'm in medical school, and one of my good friends in class grew up with a nanny who taught him Spanish, and he is still fluent to this day. So many of our patients are Spanish-speaking-only, and they are blown away when this white dude with a Jew fro walks in and speaks to them in their native language. He doesn't have to wait for an interpreter like the rest of us. I am *so* jealous and wish I had paid more attention in Spanish class because it's a big advantage to have. ",
            "Keep your temper in check when you speak to Eric, but make it clear how beneficial you think it is for your daughter to learn a second language, especially young when it is so much easier to learn. My mother knew a child in Africa that spoke Arabic (her parents were Egyptian doctors), English (the language of the expat community), and Yoruba (the language of her nurse/nanny). At age three she spoke all three languages with the proficiency you would hope for a child her age, speaking all three languages did not slow her down in any one.\n\nThere is a chance he is thinking this will hurt her continued development in English, I have to hope that this is the case, rather than racism, which is obviously just as likely his reason. ",
            "I would start by expressing to him how impressed you are with Katherine's Spanish, and how much you appreciate Ella teaching your daughter such a valuable thing. See where it takes you. \n\nI don't think you should deceive him, but I worry that you letting him know that Ella told you what he said is going to get him upset with Ella, which will cause problems",
            "Take a deep breath before you talk to Eric.  It could be as simple and stupid as him not liking the idea of Katherine asking him questions he can't understand, let alone answer, which is why my parents stopped my informal Spanish lessons with my babysitter when I was a toddler.  (They admit in retrospect this was a bad call.)  Unless he exposes more bigoted motivations, the biggest problem here is him making the decision unilaterally, especially when he apparently knew you'd disagree with him.  Start by expressing your disappointment in that regard, and go from there. ",
            "I'm bilingual myself (having two native languages, English is not one of them) and I'm raising a trilingual son (hopefully he'll have 3 native languages).\n\nBilingualism is good for practical reasons and that's very obvious to everyone - you'll probably have a better chance to find a job in the future because of your other language, you can communicate with more people from different cultures, etc.\n\nBilingualism is good for your brain development - even if you're teaching your child a second language that is not practical at all (like Klingon) it's still good for your brain.\n\nLearning a second language doesn't have any detrimental effects on your \"first\" language in the long run.\n\nI can provide you with sources if need be.\n\nAs for your husband, he probably thinks that learning Spanish is bad for her English development. That's not true, but that's quite a common misconception. I don't really think you see an ugly side of his. Just a misinformed side.",
            "Part of your discussion with your husband needs to be about how you two need to discuss these things first. He should have come to you first, and discussed this with YOU first. Instead, he went behind your back. That's unacceptable. \n\nFor A) I guess start by calmly asking him his reasons. It's kind of hard to go forward without a \"Why?\" Hopefully, if you keep asking him questions and forcing him to explain himself, he'll realize how absolutely idiotic he's being.  \n\nI have no idea what he'll say, as there is no good reason. Fluent Spanish as a second language is an awesome skill -- I have a friend who learned it young from her nanny, and now owns her own company with locations in the U.S. and South America. A couple other friends speak it fluently and it has opened up numerous career opportunities for them.\n\nAnd maybe there's a chance that Ella misunderstood what he was trying to say?\n\nFor B) -- Your husband needs to be the one to apologize, or to clarify if Ella misunderstood. For your part, you need to reassure Ella that it's ok that she came to you. If your husband is being an asshole to Ella behind your back, it's possible he'll get even worse if he thinks Ella tattled on him. \n",
            "Please keep us updated! I'm super curious. I also wish I would have grown up bilingual and I would be MAJORLY pissed to find out my dad ruined it for me.",
            "If you don't have any other data point to support your worst assumptions, don't jump there yet. Just ask him why he doesn't want your daughter to be exposed to another language. \n\nIf he has some reasonable but misinformed fears (e.g. I've heard parents worry about primary language development,  though I'm fairly certain that's a dated view), research it together and come up with an agreed upon approach based on that education. \n\nIf he shows himself to have unreasonable or bigoted opinions, you can be sure it won't just apply to your nanny speaking Spanish.  ",
            "Try to be calm before you approach this issue with him. Before you accuse him of racist views, make sure you ask him to clarify why he has an issue with your daughter learning Spanish from Ella. Address his issue directly and fairly while also providing your reasoning for wanting your daughter to learn Spanish. \n\nIf racism is not the issue, it might simply be that your husband worries that learning Spanish will give Ella an avenue to communicate with your daughter behind you and your husband's backs, and he may feel that his role as a parent is being threatened with this in mind. That belief is sometimes, though not likely in this case, a justified one. \n\nMy mother was adamant that my siblings and I were not to learn the language of my father's family. My father's parents regularly called my mother a whore and a gold digger (despite earning more than my father) and looked down upon her as less than deserving of my father. She feared that, had we learned the language, it would be easier for his parent's to manipulate us and shut her out of our lives by spreading misinformation about her (which they tried to do anyway in broken English, but at least this way she understood what was happening). While I wish I had learnt the language anyway, I understand and support my mother for that decision.\n\nYour husband may have similar fears, but I don't think that they are reasonable in this particular instance. **Whatever you do, avoid mentioning that Ella spoke to you about this**, your husband may see this as Ella trying to win your favour behind his back. Just start with: \"Hey, I wanted to talk to you about Ella and [daughter]. I got the impression that you had a problem with Ella teaching her Spanish, but I actually encouraged her to continue teaching her because it'll be really helpful later in life. Is everything okay?\"",
            "[removed]",
            "My bio dad kept my brother and I from learning Spanish because he didn't want us talking behind his back. Towards the end of my Abuela's life, she reverted back almost entirely to spanish. It's unfortunate I could only understand her and not respond. Insecurity may be the culprit.",
            "You're not just getting a nanny, your daughter also has a tutor. This is great for her! ",
            "He shouldn't have gone behind your back but aside from that, it's hard to know how to proceed unless you know why he is averse to your daughter learning another language. It absolutely may be some racist reason (\"don't want her sounding like a Mexican\"), which you already know is a deal-breaker for you and would be for me too. But hopefully it's something more benign, like your husband mistakingly thinking that a young child would be confused by learning another language and her English would suffer. In which case putting his foot down without discussing it with you is still a problem, but hopefully you can help him understand that there's nothing wrong with your kid learning Spanish.",
            "Studies suggest bilingual kids score higher on verbal skills compared to monolingual kids (no surprise there - bilingual kids learn more words than monolingual kids at a younger age, and have more languages to express themselves in/with). So if he tries to argue that learning Spanish hurts her English skills, that's pretty much bullshit. Bilingualism is very much an advantage and your kid is being given a great opportunity to learn another language for free!\n\n",
            "This may just be some miscommunication.  \n\nEric MAY just be worried Ella's English / reading age will fall behind if her primary caregiver ONLY speaks Spanish to her.\n\nIf that is the case, this can easily be fixed by ensuring Ella knows to use both languages at least equally.\n\nHowever I worry that you might be right and it might be driven by racism.\n\nPS: Learning to be bilingual from a young age MASSIVELY increases a child's ability to grasp languages, maths and all kinds of other skills.",
            "I live in a bilingual part of the world. I can speak both English and French fluently.\n\nIt's not just that I can talk to EVERYONE and the fact that it made it hugely more employable during my working years, but if I had or ever get the opportunity to travel I can go so many more places. And be much safer. \n\nHe is deliberately stunting and limiting your child, which is super weird. I say all these things for when you inevitably have to point out that \"I don't like her speaking a language I can't understand!\" means he needs to learn it, not she needs to stop lol",
            "Just gonna play Devil's Advocate here. Does your husband speak any Spanish? If not, he could feel apprehensive about your young daughter being able to say things he can't understand. Esecially at a young age where children are very impressionable and picking up what others are saying around him, it may make him uncomfortable to think about only being able to monitor 50% if what she's exposed to. Maybe you should all try to learn some Spanish! I don't think this is a race issue at all.\n\nDisclaimer: I'm Puerto Rican and my dad opted for an English-only household and I do wish that they taught me Spanish young. It's hard to learn as an adult. Maybe you should chat with him about the benefits if becoming a bilingual household.",
            ">Where do I begin in addressing this with him?\n\nAsk him his reason for not wanting Ella to teach Katherine Spanish.  You're assuming it's racism, but he might have other reasons (whether you agree with them or not is another matter).\n\n>How do I make it clear to Ella that she's free to speak whatever language she wants around our daughter?\n\nHold on.  If your position is that you must discuss this as partners, then you cannot simply go to Ella without talking to your husband either.  The bigger question, though, is what happens if you two reach an impasse and do not agree or cannot persuade the other?  On the one hand, there seems to be little downside to learning a second language (no studies showing that it inhibits primary language skills) and some definite upside (the 2nd language).  On the other hand, you will have to consider for yourself where this falls on the \"is it worth possible hurting my marriage over\" scale.  If Eric is adamantly against this (either for right now or the immediately future), but would agree to have Katherine take Spanish lessons in the future, would you back down or stand your ground?",
            "Is it possible that your husband is more concerned that he may feel excluded as part of the family unit since he may not know Spanish? The act of someone else teaching your daughter a foreign language may make him feel isolated from her (and perhaps you as well, drive you said you also know done Spanish). Being the only non Spanish speaker in the family could create a divide for him that's he's worried about.  Might not be anything racially motivated at all...",
            "My father was the same way. As a little girl, I went to a music program instead of pre-k to get me socialized because I had (and still have) an anxiety disorder and was slow progressing. With that music program, I got to learn about different types of sounds, instruments, music, etc.\n\nI loved Mexican music. I had a little radio in my room and I would keep it on and read or play in my room and try to say the words they sang. It always made me feel confident and smart to know I was learning from these songs I had never heard before.\n\nMy dad would come in to my room and ask why I was listening to that music and make me turn it off. I still don't understand it completely, but I do believe it's an underlying racial issue or perhaps more so what other people he was friends with or my family would think if I was an English speaking child speaking Spanish instead.\n\nI would make sure to calm down before you speak to your husband and explain she will need this life skill and teaching her early will only improve the way she learns. Perhaps look up some research on it (how bilingual children are ahead of the game) and feed him some knowledge.  ",
            "What kind of person wants their child to NOT learn?",
            "Search Google for articles on the benefits of learning two languages as a kid. \nIt's insane to refuse your kid such a big advantage in life. Being bilingual at  a young age has many, many benefits beyond the language itself. ",
            "\"Hey, Ella mentioned yesterday that you didn't want her speaking Spanish around Katherine. I actually kind of like the idea of our daughter learning a second language, and wish you would have talked to me before deciding against it. Is there a reason you're not comfortable with it?\"\n\nNo need to get mad before you even talk to him. It could have been a simple misunderstanding.",
            "OP, can we get an update today?",
            "Native English speaker (non American). At least once a month I think to myself \"God, I really wish I knew spanish\". It's far more spoken world wide than english, you can go so many places and communicate with so many people. It's also a good door into other latin languages. He's closing doors on your daughter before they even open! ",
            "Either he prejudiced against Spanish speaking people. Or as someone in the house who doesn't speak spainish he's paranoid it'll be used against him.\n\nSee if he's willing to learn some too and if he's prejudiced remind him of all countries and national businesses that hire people who can speak or read other languages. It's really good skill to have in a globally connected world ",
            "Being bilingual has many cognitive benefits as well (greater plasticity in the brain, increased academic performance, etc.)! The younger children are when they begin to learn a second language, there are even more benefits due to age such as a reduction or lack of non-native accent and just ease of acquisition (more like learning first language, naturally). Also, learning two languages at once does NOT hinder a child's ability in either language. OP's husband is just ridiculous to not take up on this wonderful opportunity\n\n(Source: I have a B.S. in Language Education, but researching Second Language Acquisition will give you most of these details)",
            "Question A:  Start with \"Why...\"\n\nQuestion B: It really needs to be an apology from him to Ella and him telling her he made a mistake and it is OK.  Anything else and she'll know that no matter what you say, he feels differently.",
            "Well, I would certainly communicate with him and find out his reasons before judging them to be racist, although I too am struggling to see what other motivations one would have to NOT have their child be bilingual. \n\nI also wonder if you'd noticed racist behavior from your husband before but had just kind of ignored it.\n\nTalk to him, and say that you really want your kid to be bilingual.",
            "Being bi-lingual can mean a solid 10K more per year salary wise in many industries.  ",
            "Stopping a child from learning a second language without effort and for free????? Why?? If she speaks Spanish she will have no problem learning French and Italian in future. People pay crazy money for their children to have the option of learning a second language before they realise it is a foreign one - if she learns it now, she will be fluent. If she learns it as school, she will have \"advanved level of Spanish\".\n\nI cannot wrap my head around this.\nA free language! Without lessons, homework, teacher appointments and fees! Free, for your daughter to always have it!\nOMG, people are weird..",
            "You should ask why and watch his reaction. It may not be a racist  issue he had with it. There is a stereotype of uncaring, absent parents who see less of their kids than the nanny does and so the children learn to speak Spanish or Malaysian or whatever their nanny speaks, because their nanny is the only one who cares about them. \n\nIt could be upsetting him that he feels he may be turning into an absent father. A lot of the time people do things out of insecurity, not outright hate, especially if he's never shown any racism before now. ",
            "Reguarding B, you don't \"Make it clear to Ella that she is free to speak whatever language she wants around your daughter\" until you and your husband have discussed it and agreed. You're mad at him for asking Ella to only speak English around your daughter without discussing it with you but you are automatically telling her it's fine/good to speak Spanish without talking to him yet. You two need to talk and understand eachother's viewpoints first. He might just think it will undermine your daughter's English to learn a secone language too, in which case research it and show him links supporting dual language learning in her age group.",
            "Studies support the fact that very young children learn a second language much faster than when they get older.  Her advantage when taking Spanish in high school would be greatly enhanced.  ",
            "My dad denied me the ability to speak Spanish too, though it was by not teaching me himself, as he's the one who's fluent. I love him, but I definitely resent him for denying me something that would have been a very, very valuable skill where I live and work.  \n  \nMaybe he just doesn't understand how easy it is for kids her age to pick up two languages and is mistakenly worried she'll get confused?",
            "Free Spanish lessons in a evergrowning multi-cultural landscape?   The horror!",
            "Give Ella a small raise to continue teaching Katherine Spanish! That will make your husband think twice about making unilateral decisions!!",
            "[deleted]",
            "You need to figure out why the hell he doesn't want his daugther learning another language. Being bilingual is an incredibly useful skill and makes it much easier to learn many many other languages! I had a spanish nanny when I was a kid and she never taught me spanish, unfortunately. But I would have loved to know spanish!! I would have really really appreciated it and it would have made my life more interesting and I would be smarter because of it. You need to straighten this out and make sure that Ella keeps teaching your daughter spanish. She will be thanking you when shes older (and she sounds like shes enjoying it!)",
            "Maybe he's worried that it creates a language barrier between child and parent, giving the nanny too much power over her and making them able to keep secrets and talk to each other without you understanding. ",
            "It's an incredibly valuable skill, learning another language will improve her cognitive ability and look really good on future resumes.\n\nYou two need to communicate in this and you should really understand why he would be against it.",
            "Its always an asset to be able to speak more than one language. Your husband is letting his hangups get in the way of what is best for his child. Tell him so. ",
            "Speak to your husband and ask him why he did that. Maybe he is angry because he thinks that the nanny overstepped her boundaries teaching your daughter without asking you first, or he thinks (wrongly) that learning spanish will confuse your daughter and make her mix her English and Spanish. ",
            "I wonder if his objection to her learning Spanish is not coming from a racist point of view but rather that he feels left out of his daughters life. You say that you have a live in nanny and you seem to spend more time with your daughter than he does. Is it possible that he felt like he's missing out on his daughters life and that he's not there for her when he heard her speaking Spanish? Maybe he feels threatened as a parent by the nanny, like he's being replaced? The fact he hasn't expressed any other notable racism in the past 5 years you've been married makes me think that racism might not be the case but a feeling of being left out.",
            "My cousins had a Colombian nanny when they were little and so they learned Spanish along with English. Their dad is Cuban so he speaks it with their grandma (who also speaks fluent English), but both kids pretty much lost their Spanish skills after their nanny moved back to Colombia.\n\nMy point here is that Katherine's command of English will not be negatively affected by her learning a second language at a young age. Eric needs to chill out and recognize it's actually a great thing for her, especially at this age.\n\nPlus, is she in preschool yet? Considering you live in SoCal, I wouldn't be surprised if they're teaching the kids a little Spanish there. I grew up in suburban Chicago and almost 30 years ago my preschool was teaching us Spanish vocab words for stuff around the classroom.",
            "You've been getting some good advice here, but I want to add that my first thought was that his four year old child having a skill he didn't was making him feel insecure and perhaps envious. \n\nHe might also fear getting left out, that his daughter will bond more closely with the nanny than him, and it will be in a language he doesn't even speak. He may worry she'll keep secrets from him, talk behind his back, etc. \n\nBasically, I think he fears he's losing a part of her and he's not ready for that. \n\nMaybe suggest a way he could also learn some Spanish? \n\nOr, failing that, maybe suggest that he should be happy his kid will have skills he lacks, and opportunities he didn't have. ",
            "Could this be a jealousy thing? Like eventually he'll be left out since he doesn't speak it?",
            "Print out the numerous studies showing the brain and learning benefits for a kid who grows up bilingual.",
            "Just adding an anecdote.\n\nI grew up in the US in a very white area in an Irish Catholic family. I decided to learn Spanish in school and got okay at it.\n\nAfter college, I got a random opportunity to go to Spain for an internship so I took it and that was years ago. I just kind of stayed and now Spanish is my primary language and none of that would have been possible without the language. International business (and increasingly domestic business in the US) is not as English-dominated as most Americans seem to think.\n\nThe point being, it's a very useful skill that you never know where it can take you.\n\nI don't have a kid yet, but they will absolutely grow up English/Spanish bilingual (though English is the minority language here)",
            "Why wouldn't he want his daughter to know a second language??\n\nMakes absolutely no sense as it gives a terrific advantage to ones who do know a second  language.\n\nWhen applying for schools and/or jobs it is a great advantage indeed!\n\nAlso - Spanish is used so extensively now that it's a real boon to actually know how to speak and write it too!",
            "Hey husband, I would like our nanny to continue giving our daughter free Spanish lessons. It will help her in school as she'll already know the language when she has to take her foreign language classes, it'll help her in the job market being bilingual, it will help her various places we might go on vacation, and it will allow her to understand what is being said around in her Spanish which could be important for keeping her safe.",
            "I don't know if this has been brought up yet, but honestly there have been studies as well (you can simply google these) that people who speak more than one language become smarter, and I even remember one article mentioning that the brain of a multilingual person works completely differently than that of someone who does not speak at the very least a second language. So aside from the fact that he may be being racist, I would mention that in your talk with him. Hope it works out well! ",
            "OP, he may be concerned about your daughter's English education. I was bilingual before K and my parents decided to focus me on English because having two languages going on began making grammar confusing for me. If you haven't seen racism from your husband then it probably is either something like this or just a discomfort with someone else spontaneously teaching your child things without your consent. \n\nOn the other hand, it's pretty rude what he said to your nanny and it's extremely disrespectful to go over your head. I'd address those with him, non confrontationally, and then feel out his motivations. ",
            "I grew up in as Mexican household and I always talked to my mom in English so she could improve her English.\n\nI never spoke Spanish growing up, but I could understand it.\n\nI WISH I prescribed my Spanish and learned how to speak it as to this day its hard for me to pronounce the words.\n\nYour daughter has a great advantage here and this will help her in the future.",
            "WTF? He's throwing away a massive opportunity for your child. The languages you learn in childhood are so important. You will probably never be able to speak a language as good as the one you learn then. \n\nWTF? WTF? If I were you I'd throw some studies around about bilangual childs. (I'd also scream at him, but that's never a good advice. Holy fuck.)",
            "I'm just going to throw this out there: is it possible your husband is under some misconceptions about how language learning works?  It wasn't that long ago when people thought that teaching a young child a second language impacted their ability to learn their first language.",
            "The best time to become fluent in a second language is at yours daughter's age. Many of us take a few years of Spanish in middle or high school and completely forget it as soon as a we graduate. \n\nIf your husband is being ethnocentric, he is also being incredibly stupid. Living in SoCal (or almost anywhere else in the US) and being able to speak fluent Spanish is a ridiculous advantage to have in both your professional and personal life. Your husband is depriving your daughter of this advantage.",
            "As a female, salary negotiation is daunting. As a bilingual, I have the upper hand. They always up their offer when I explain they'll save money on interpreters. I say absolutely let her learn the second most spoken language in the US, and the most spoken language by amount of countries speaking it. ",
            "PLEASE post an update to this soon, OP. I need to know what his reasoning was. I am 100% on your side at this point, but I feel like there has to be more to this...",
            "If husband was racist, he would have been against hiring Ella in the first place, lest daughter get Hispanic influence.\nThat said, unless you and your husband keep up with Spanish language while your daughter is growing up-through school etc, there is a very good possibility she will lose her ability to communicate. ",
            "So, there's been a lot of focus on your relationship with your husband, OP, and how to handle that. \n\nAnd to touch on that briefly: yes, find out his reasoning. \n   --If it's racism, I'd suggest counseling if you don't want to immediately dump his racist ass. (Because WTAF.)\n   --If it's fear that his daughter will know a language he doesn't, well, he still doesn't come off very well. The idea that children shouldn't have any skills or any knowledge bases that their parents don't seems like a very toxic sort of authoritarianism driven by insecurity. Children are separate people from their parents, and I'm not sure why anyone would want to limit their child from gaining valuable skills just because they themselves don't possess them.\n   --If it's fear that it will hamper her English skills, he's STILL not coming off well. Five minutes of googling could have set his fears about that to rest, and I'm not sure, if you had that sort of fear, why you wouldn't go gather info about it before making a decision. \n\nIn short, he may not be a racist, but if he's not, he sounds impulsive or insecure, and like he's indulging his impulses or insecurities at his daughter's expense. \n\nBut while I was reading your post, my strongest reaction was to worry about Ella, since it sounds like however it was handled, it hurt her. She was giving your daughter (and you, as her parents) a great gift--immersion with a native speaker at a young age can't be matched for effectiveness and ease of learning. (I had a nanny who spoke Spanish, and my parents put me in French lessons at the same time. My French skills never came CLOSE to my Spanish.) Even if you and your husband had agreed that you didn't, for whatever reason, want her teaching your daughter Spanish, it should have been handled with respect for the fact that what she was giving was valuable, even if you had reasons for not accepting the gift.\n\nYou've got stuff you need to work out with your husband, but please don't neglect attempting to address the hurt that (it sounds like) was done to Ella. ",
            "Right now is one of the best times in her life to learn a second language. It's a critical window of opportunity for learning Spanish, mastering the accent, and retaining it throughout her life. Maybe your husband thinks it'll interrupt her English speaking, but this isn't true. Talk to your husband about this. Second languages are much harder to learn later in life, and learning a second language is so incredibly valuable.",
            "I'm basing the following comment on your husband might not be racist, but just concerned about your daughter:\n\nI grew up in a country where having a maid was very common. Almost every house had either a live-in maid or someone who comes in almost everyday just doesn't sleep in the house. They were cheap and it gave the family more time together. Hell my sister had one because both parents worked full time jobs. \n\nAnyway, one of the downsides is that you had a lot of parents that gave the child to the maid to take care of. Over time, a lot of incidents came out where the child was too attached to the nanny or vice versa. This has a consequence of the child not identifying with his heritage and speaking only the native language of the maid. By the time the child grows up, the maid would have a bigger influence on him than the child's parents. \n\nSo maybe your husband is misguided and worried about that. I don't know what his intention is, but it might be something to look into. \n\nWhat I do have an issue with is not discussing it with you. I feel that he might have reprimanded Ella a bit too strongly.\nYou need to ask him why he's against it. Hopefully it's just that and not something worse. \n\nIf it is just that, that he's worried about your daughter picking up more of your maid's culture than her own, then maybe give her a few hours to learn. At this age she will pick it up so fast it will make you dizzy. It'll be a huge advantage for her. ",
            "My dad spoke German and most of his family did as well, but my brother and I weren't taught more than a few words/phrases. Now (in my mid-forties), it's one of my biggest regrets that we weren't brought up to be fluent, or at least conversational. Oh behalf of all the unilingual people out there, if I may be so bold, I say teach her Spanish.",
            "I don't know if this is helpful or not. I'm a Dad, and it is were in a situation where someone presumed to start teaching my daughter something without running it past me or my wife I would definitely be concerned. I feel like that is over stepping bounds. Personally, if someone asked I'd say sure go ahead and teach. But they have to ask. My wife and I need to be aware of who is doing what with our kids, however harmless.\n\nI would however, have spoken to my wife about this issue first, deciding together how to proceed.",
            ">How do I make it clear to Ella that she's free to speak whatever language she wants around our daughter?\n\n\nYou don't get to make that decision without first talking to your husband. That's not how a partnership works (your words). ",
            "Is it possible he thinks Ella's Spanish is too \"low class?\" I've heard this in reference to Chinese, where people are really picky who tutors their child in Chinese because it has to be someone who speaks in a high status sort of way. I also personally knew a couple who, despite being fluent in French with good accents, refused to teach their daughter much French themselves because they wanted her to have a \"native\" accent. ",
            "your husband is a fool. spanish is one of the most used languages on the planet and learning it now will open so many doors to your daughter in the future.\n\nyou need to ask your husband what his reasoning is and why he didn't discuss it with you.  once that conversation is done, then talk to ella. your husband needs to apologize for being a dick and you both need to assure her that you're appreciative of her time and skills and you love that she's giving such a great gift to your daughter.",
            "I like how your first assumption is that he is racist and guilty.  Do you do it often ? ",
            "To start your daughter sounds like an extremely gifted child, and learning a second language would be a great skill ( I would have lived this ) like you have stated.\n\nConcerning your husband I don't think this comes down to racism, from what you've said the only thing I can hazard a guess at is that he may be jealous or feel left out from his daughter. I'm not criticising his skill as a father but you said you both work busy jobs and that could already be difficult for him. With that in mind your nanny is now teaching her a language which is great, but a skill that wasn't by the influence of her father. This could cause your husband to just feel slightly jealous, or maybe useless.\n\nI would suggest sitting down with him and explaining that it would be great for your daughter to learn a new language and it would be valuable for her in her future and he shouldn't limit her, also make sure he is okay and that he can start to deal with the situation.\n\nHope this helps :)\n\n",
            "I look forward to the update on this!",
            "I'm late to this but you need to stand your ground with this one. I am bi-racial and my father pulled this shit on my mom, who gave up her fight, and, well, if I spoke two languages right now it would be a superpower. ",
            "He might be worried that hearing two languages will hold back her English. Reassure him this is not the case. I can probably find some studies for you if you need to back up your argument.",
            "Not only is this possibly racist, but he made a unilateral decision in your marriage. A big no-no and a big disrespect to you, his wife. If he had a problem with it he should have came to you first so you could talk, and then would have told him what an idiot he is before he made an ass of himself.",
            "I grew up with one language, English. I took Spanish in 8th, 9th, and 10th grades and never put enough effort into it. As a college student later on in NYC, affordable apartments I found were always smack dab in the middle of Spanish speaking communities. My Spanish improved enough to have basic conversations but I'm by no means fluent. I've done a pretty bad job of trying to teach my own kid Spanish. \n\nEven still, now living in an area without Spanish being spoken much at all in suburbia, they are teaching it in schools. My son is learning Spanish in 1st grade. If they are teaching it in the school system here I would bet it's definitely going to be taught in areas where Spanish is spoken. So what's your husband going to do? March into the school and object? ",
            "Is it possible that he just thought it was bad for ability to learn English words and didn't realize she could learn both at the same time?",
            "It might not be racism, just fear. \n\n My parents moved to Germany for work when I was a couple months old. \n\nThey sent me to a local kindergarden to help me learn basic German but later on to a school that taught in my maternal/native language. I remember huge fights my parents picked with the school over which language to prioritize and what to teach us. My parents worried intensely that learning German would lessen my skills in French, that I would not be able to tell them apart. In the end, they got their way, I lost most of the foreign language skills I had acquired in kindergarden in the first two-three years in school.\n\nThey fought hard and long to have it that way and today they fully admit that what they did was wrong. They were scared and thought learning German would keep me from correctly learning French and that mixing the two would prevent me from learning either correctly. They were worried that this would handicap me later in life. In the end what they did somewhat handicapped me, since today I am not perfectly bilingual. \n\nIf he's worried about her English (and possibly also about over-taxing her by making her learn to languages at once), you should have all the arguments on your side. I think research has shown (but please look it up), that kids are best place to acquire foreign languages and that growing up bilingual will make it easier for you to learn new languages in the future. ",
            "This is more common than you would think, especially among older generations. This may be my prejudice, but I feel like fathers are especially prone to thinking this way. As someone else mentioned, it's not that the people who think this way are racist, rather they (1) don't understand how language acquisition works, and (2) feel uncomfortable when their children can speak a language that they don't understand.\n\n\nI hope you two can have a constructive discussion about this that promotes harmony within your family and nurtures your daughter's education.",
            "I hope you're able to get your husband to warm up to the idea of speaking Spanish. I kind of wish I had learned it instead of other languages. I only work retail, but there are still a good number of customers that come in that can only speak Spanish, and I'm sure such a skill would help make her more attractive to employers in the future. She'll also be able to read more books, news in different languages, could even come across opportunities on the street where speaking Spanish comes in handy, have even more opportunities to make friends (having access to Spanish-speaking groups). Learning another language would really open a whole new world for her.",
            "You're daughter sounds very smart and talented. It's wonderful that she is enthusiastic and lucky enough to have the opportunity for somebody to teach her another language at this young age. You'll have to talk to your husband about this calmly and find out why he feels the way he does. From there you can decide how to deal with the issue. \n\nThe egalitarian in me says he shouldn't have the ultimate say in how you raise your daughter, definitely speak to him about making decisions like this behind your back. Hopefully this is just a misunderstanding and you can convince him to think otherwise.",
            "My brother's girlfriend won a semester long scholarship from her U.S. based school to study abroad for a year in the overseas satellite college in Spain. For the first few months it was rough going for her because she really didn't speak the language. It's years later and she is a teacher in the public school system and she still talks about how the learning experience from that trip molded her into the go-getter, try-anything-once, out going, type A/B mix personality she is today. I myself have dealings with several languages and am trying to better those skills with practice, repetition and (expensive) schooling, both home and formal. I know that doesn't directly answer the question of what you should do next. I can only give an opinion that whatever you say to change the mind of your spouse, stick to your guns and show him that it would be an amazing skill for your children to have that will have life-long benefits. To let your daughter learn a language early in life is a blessing and will not only benefit her budding communication skills, the Leadership factor and child like knowledge-desire (wanting to learn a third or fourth language) will make your little girl unstoppable when she goes to university already armed with something that so many of us would pay a small fortune to understand and be proficient in. Please tell us if there is any good news from your endeavor.",
            "Tell him you dislike it. And maybe he could learn with you daughter? Then, they could bond. Because maybe he feels left out.",
            "I can't improve on the advice already given here. But please give an update later if possible. As a father of two grown daughters both of whom learned multiple languages in school, I would've loved to expose them at an early age to a language immersion type training, which you have with a live-in nanny. That young mind will soak this up to a level of fluency so quickly.",
            "Your husband is being silly. I would give anything to go back and have learned a second or third language at a young age. It will be extremely beneficial for her growing up. Like ridiculously beneficial. If she ever applies for any job then the fact that she speaks a second language will show her above anyone else who can't (assuming they were similar in most other ways). ",
            "Oh hey South Carolina. Same. Anyway I agree with a lot of people. Bring it up to him saying how wonderful you think it I'd and tall about how great a second language Is to have. Also how that's such a wonderful way for Katherine to bond with Ella since I'm sure she'll be around awhile. You definitely want good relations with her and it seems like you guys find Ella to be an extended family friend which is heartwarming.\n\nSee if he brings it up first and if not just ask him why he seems upset and what the problem is and then maybe ask him why he told Ella to stop? Honesty is good but I hope he wouldn't become rude to Ella for bringing it up you. The only reason I can see why he'd have an issue is racism tbh? Most well off families pay good money for their kids to get language lessons like French and Spanish, etc. \n\nIf this is the case then discuss with him reworking his morals and feelings. Tell him its racist and you don't tolerate that and he needs to change or edit himself, maybe even counseling? I don't know if that's a thing but ya haha.",
            "I guess it's possible that he thinks hearing Spanish will somehow slow Katherine's progress in learning English, in which case all you would need to do is correct him on that.",
            "I think you need to speak to your husband. Some people mistakenly believe that learning additional languages negatively affects children's development, probably because bilingual babies are often slower speaking fluently in either language they learn (but catch up later and are of course also bilingual). It's a common misbelief. Also, you may be from a country that's not got a very positive attitude about learning additional languages - I'm in UK and we're really not very into learning foreign languages and there's a lot of ignorance about the benefits. His view might be 'well everyone speaks English so...' which isn't uncommon.",
            "She's going to have to learn Spanish or another language in high school and college. She'll have a huge advantage learning it this young. ",
            "Little late but I'll add my two cents. Children who are bilingual have massive advantages in life. Studies have shown that children who are bilingual outperform their peers in academics. Id push learning spanish hard with my kids if I was a parents",
            "In this day and age, it's almost mandatory to know at least a little Spanish. And at 4 years old, your daughter is at the perfect age to absorb it like a boss. \n\nI would say go to your husband and make it clear to him that you are so not happy for not talking to you first. Personally, I would make him go apologize to Ella for what he said also and ensure he talks to your daughter to let her know it's good for her to broaden her horizons by learning new languages. \n\nYou don't even have to stop at Spanish, you can get her started on other languages too. It's a trip for me to hear a little one jumping from one language to another. ",
            "Hope you find a way to get this resolved. I haven't read all the way down. Perhaps there's something else going on? It does sound rather odd.\n\nIt'll be great if Ella only speaks Spanish to Katherine - that way it'll be less confusing when Katherine has to switch from one person to the other.",
            "Tell him to google neural plasticity. Children have a window growing up that they're able to learn what a foreign language sounds like and how to replicate those sounds. There are tons of studies that are readily available without a pay wall that he can read. If he still doesn't want her to learn Spanish, he has problems and he's holding your daughter back.",
            "I can't think of a reason why he would be upset at Ella speaking Spanish to your daughter. I'd definitely bring it up, but let him explain his reasoning behind it before jumping to conclusions. \nI can't think of any reasonable explanation for this, but on the off chance that he has one, you should let him give it to you before we assume he's motivated by racism (if he is, then that's going to be a pretty awful conversation :( )\n\nI think it's great that your daughter was being taught spanish btw, could really help her later in life :)",
            "The research and data indicating that it is advantageous for children to learn more than one language is overwhelming.  Even if it is a language they will never pragmatically use, it can substantially increase there capacity for deductive reasoning.  Is your husband aware of this?",
            "Learning a second language will actually be a huge advantage for your daughter. I'm quite shocked that he doesn't realize that.",
            "Katherine is 4 years old. This is the absolute best time for her to learn another language, which she absolutely should. Your husband is being unreasonable in his expectations, both that Katherine shouldn't be learning Spanish and that he gets to be the final (sole?) decision maker. ",
            "Being fluent in a second language with let her breeze through a few classes easily, get jobs far more easily, and get her salary increased at said jobs. I'm a 23 year old woman, just moved to central texas, and I'm trying to learn Spanish. It would be a HUGE asset to almost anyone in the US or europe, and employers would look on it favorably.\n\nSit your husband down and ask him *why* he doesn't want her speaking spanish. Maybe he had an issue with a Latino friend, family, or other figure and has developed a resentment towards it. I really couldn't think of why he wouldn't want his daughter to be bilingual.",
            "Is Eric Latino? If so, maybe his parents ingrained it in him that as Americans, they should not speak Spanish.\n\nMy parents didnt't start teaching/allowing us to speak Spanish until I was about 14 because they feared we'd be discriminated against if we sounded foreign.  Now that times have changed, they have changed and embrace being polyglots.\n\nMaybe he's just a product of times past?\n\nIf not, forget what I said. \n\nA) Address it by sitting him down and asking him what he objects to and why. Have counter-examples ready and reasons why it's beneficial for your daughter to learn a foreign language. \n\nB) Just tell Ella that she's free to speak whatever language she wants around our daughter and that you support her to do so.",
            "First, I'm with you. I think it's great that your daughter is learning Spanish. At age four, she has a unique opportunity to become fluent in a language quite easily. I am not expert on early childhood development and languages, but if you and your husband speaks the queen's English and Ella speaks spanish that's going to benefit her development. Children, iirc, get confused if one parental figure speaks two languages around them.\n\nSecond, I have no idea why your husband reacted this way, and I'm upset that he made a decision like this without talking to you about it.\n\nThird, I feel like by doing this, he's invalidating something that your daughter is proud of. That's not okay.\n\nEdit to Add: Honestly, after thinking about all this, Ella deserves a raise, not a reprimand.\nAnyway, I think calling out your husband on this is what's needed. He did something behind your back, and quite possibly against what he knew you would approve of. You need to ask him what his objections are, but make it clear that he also owes you an apology.",
            "my dad speaks spanish, and he never spoke it around me when i was growing up there are times i wished he had, its a good skill to have and since i have a spanish name i am always getting people who start speaking it to me when they first meet me",
            "Has he ever acted this way before? I think a lot of people in here are naive about deep racist thoughts and feelings can run. Good luck.",
            "but done you want your hija to habla en espanol? ",
            "You need to have a talk with your husband. You need to nonjudgmentally ask him what his concerns are, take them seriously, and have a discussion about them. It's possible that his concerns aren't racist at all. I think the most likely concern is that he feels excluded by your nanny and daughter being able to communicate in a language he can't understand. Personally, I think this is best addressed by continuing the Spanish lessons and also teaching your daughter proper etiquette for multilingual people. The most important rule being that languages should not be used to keep secrets or exclude people. She needs to be taught that many people can't speak Spanish, and in particular Mommy and Daddy can't speak it. She also needs to be taught that it's mean and rude to speak a language in front of people if they don't understand it. So, the proper solution is that she and Ella should exclusively speak English around people who don't speak Spanish, but of course can speak Spanish when they are alone or with other Spanish speakers. This is really basic stuff that multilingual people learn as part of socializing and being taught manners. If there's some other concern, you guys can discuss it as well. He does need to discuss it with you, though, and not just stonewall.",
            "Maybe he thinks learning Spanish while she's still learning English will harm your daughter's ability to speak English. Not sure how true that is, but I can see why your husband is concerned.",
            "Native speaking spanish here! \n\nYou should totally talk with your husband, I know a couple of languages and I think that spanish is one of the hardest, so teaching your baby girl from a very young age is a really good thing\n\nBuena suerte! :)",
            "I am a nanny and my first thought was that it is a common misconception that teaching children a second language will make it harder for them to pick up their native language, or that they will confuse the languages and language acquisition will be harder for them. This is absolutely and unequivocally false; children come with language learning software naturally installed. Many parents, for some reason, believe basically the opposite and often bring up a misguided concern over exposing their children to other languages too early or some other such nonsense. I would guess that your husband's motives are probably more along the lines of being worried that his child will be overwhelmed or confused or even held back by that second language, rather than simply being a bizarre and only recently surfacing racist streak that you never knew about. I could be wrong but this conversation happens so frequently between myself and parents that that would be my first guess. ",
            "I'm just playing devil's advocate here, but could it be maybe that Eric was concerned about Katherine's ability to speak english suffering because she's dividing her attention between the two languages? I'm not saying that's actually the case, but it could be that he is concerned about that, and not the fact that she's speaking spanish in and of itself. Another explanation that I can think of that is a bit less benign, is that he feels threatened by or jealous of the fact that his daughter is speaking a language that he cannot. Just my two cents.",
            "very short sighted of your husband. People spend tons of money to learn another language. I think its an amazing opportunity for your daughter. Definitely need to have a talk with him, I would be super happy if my kid got to learn another language for \"free\". ",
            "Is anybody considering that maybe the reason he doesn't want her to learn Spanish is because he doesn't want his daughter and this nanny having a bond he could never be a part of? You say you never got a racist vibe from him before, so maybe he's just worried that suddenly Ella and his daughter can start having their own inside jokes that he won't understand... Just a thought. I would ask why exactly he doesn't want their daughter to learn and take it from there!",
            "This isn't much advice as it is trying to understand where Eric is coming from. Does he know any Spanish? If he doesn't I can kind of understand that he wouldn't want to be the only one in the house not able to speak/understand it. \n\nI used to be in an interracial relationship where my ex and his family were bilingual. He would always talk about our hypothetical children going to his parents house to learn to speak Thai, but he refused to teach me any when I asked. I was going to be the only one in the house unable to speak it. They would be able to have conversations right in front of me without me understanding. (Him and his family did it often enough to know it would have a high chance of happening) I didn't want to be left out of conversations with my own family, so maybe thats what your husband is feeling.",
            "IS your husband apprehensive to the idea of your daughter learning a second language for the fear of having trouble learning English? This is the time where she can learn so many languages with ease, in comparison to her adult counterparts. Knowing Spanish, in our current society, is a skill desired by so many employers and will help in the long run. Hell, while you're at it, teach her some other languages. \n\nMy son is currently 1.5 years old, and I speak to him in my fluent language of Spanish, French, and English. I'm also learning Mandarin and Arabic, and speaking to him with what I can. My niece, who is 5 years old, was thought English, Spanish, French, Japanese, Taiwanese, and German is able to fluently speak in English without any issues. Just have a talk with you husband, and get down to the main issue as to why he has trouble with it. As for Ella, the relationship between here and your husband is tarnished but it is still good with you and especially your daughter. ",
            "There is no downside to being multilingual. ",
            "People are giving you a lot of reasons in this thread why bilingualism is awesome for kids, but I don't see as much feedback on how to talk with your husband about it.\n\nI'd start with: \"So Ella just apologized to me for speaking Spanish to Katherine. What's going on?\" I'd want to know his reasons first. \n\nIt's possible he's racist. It's possible he mistakenly believes that kids get \"confused\" learning multiple languages at once and doesn't want Katherine to be held back in school (silly reason, but I have a friend whose parents were told this and so they stopped speaking her native tongue at home and she never learned it, which is tragic). \n\nYou can't discuss with him until you know his reasons. So ask him about them and let him talk. Only then can you refute them as needed and find a resolution.\n\nRegarding your relationship with Ella, I'm sure it's nothing you can't fix. Once you and Eric are on the same page, just reiterate to her how grateful you are to have her and how wonderfully your daughter's Spanish is coming along.",
            "I can sympathize with the view of \"don't start trying to teach my kid something without my knowing about it / approving first.\" Maybe your SO was just angry that no one had asked his opinion on this and wanted to regain some control over the situation. It's possible it doesn't have anything to do with Spanish at all, but he felt his role as a parent was being ignored / run-over. I would want to know everything being done with my kids as well before it was done.\n\n> And finally, I am furious that he made the decision to talk to Ella without me. That's not how a partnership should work.\n\nYeah, I wouldn't get on your high-horse just yet. A partnership should be both partners discussing things and coming to a mutual agreement before one of them unilaterally doing anything. Did your husband act this way? No. But did you act this way? No.\n\nYour response to the nanny shouldn't have been: \"oh yeah, ignore what my husband said. Keep doing that thing he told you not to do anymore.\" That not only continues to sideline your husband and undermine any authority he has as a parent, but as an employer, as well. You should be discussing these kinds of things with your spouse and coming to a united decision before proceeding, *particularly* in areas where there might be or is some initial disagreement. That's the partnership part. Don't get all up in arms about your husband not discussing instructions to a nanny with you first when you turned around and in the next breath did the exact same thing by not discussing anything with him first.\n\nYou also just put the nanny is a really bad place. Now she has two parents sending her mixed messages about what to do to keep them happy and keep her job safe. Does she listen to you, or does she listen to your SO? Don't do that again. Take a time-out on the topic, tell her you'll speak with your husband and get back to her about it, and go talk with him. He should not have approached the nanny without first discussing with you, either, but obviously the best way to proceed here isn't to make your nanny some kind of go-between so you and your husband never need to talk about it. Go fucking talk with him and then circle back with the nanny once you've both come to a mutually-agreed on solution to let her know what's up. You should both be in that talk with her, since at this point you've both given her completely opposite instructions. She needs to know you're both on the same page with what she should be doing, and the best way for that to happen is for you both to be in that follow-up conversation with her.",
            "I'm half-Thai and my dad made the choice to not have my mom teach me Thai as a child because it could \"ruin my English\". Now I can't communicate with my family, my cousins tested out with a second language for easy college credit, and it's increasingly useful in the job market. \n\nMy bi and trilingual cousins have perfect speaking skills and are often picked as candidates for jobs in part due to the language skills.\n\nSeriously, it's a great skill and not a hinderance. Maybe open up the conversation with your husband about his concerns and ask your daughter if she thinks 'speaking like Ella is fun'? \n\nSome kiddos play with stuffed animals, other learn life skills I guess! Either way, congrats on your fast learner and her open mind!!",
            "My half brother is 11, and has had a Spanish spreaking nanny since he was a couple weeks old. She is part of our family, and we love her, and also her wonderful family. My little brother can speak fluent Spanish, and I absolutely know that it has benefitted him in so many ways. He's so intelligent, a great reader, really awesome at Scrabble, very curious about the world and just a wonderful guy. It always blows people away that this hilarious freckly red-headed kid speaks fluent Spanish. Im sure knowing two languages has really enriched his life and made him a well-rounded person.",
            "You'll need to talk to Eric, but I suggest giving him some of the benefit of the doubt if he hasn't shown racist tendencies before. Basically, go in listening instead of going in ready to fight. \n\nYou'll have a fight if it's just straight up racism. \n\nHowever, many people are under the (very) mistaken idea that speaking multiple languages harms the development of the child in some way. It could be he just needs to understand that this won't be a detriment in language acquisition in general, and some education could help. I'd call that a potential learning experience over... just straight ugly racism. \n\nBest of luck. You seem to have your head on your shoulders and will be capable of dealing with this. \n\nYou might want to reach out to your nanny in some way- I have no doubt that Eric, well intentioned or not, has damaged your relationship with your nanny. I'm not sure how, but it would likely be important to reach out to her- perhaps set up some dia de los muertos time with the whole \"family\" for this coming November.\n\nBack in the 80's when I was a child, I too had a spanish speaking nanny and english-only speaking parents. My nanny instructed me to not speak spanish in front of them for years- finally my mother picked me up and heard me saying goodbye in spanish to someone or other. My mother was overjoyed- but the nanny was deathly afraid that she'd lose her job. The community knows that a lot of racist fucks are out there, and they're afraid- take extra, extra effort to make sure this nanny doesn't get in her head that she's unaccepted and unappreciated. ",
            "I would just ask your husband why he doesn't want her to learn Spanish. He will no doubt have a silly excuse.  Listen to what he has to say, but when he is does, tell him that your daughter has a greater chance of being successful professional if she learns a second language. Then remind him that children learning languages better the younger they are. Also mention that your nanny is teaching her a skill for free that could cost a lot of money later in life. ",
            "I would spend no time thinking about it until you talk to him.\n\nIt could be something simple and not racism, and if you over think it you'll just end up being really angry when you do talk.\n\nIf you approach the situation giving him the benefit of the doubt then the conversation will go much smoother. You don't know if maybe there's miscommunication here, and Eric possibly asked Ella to only speak English when talking about new things with her that she doesn't know the English name of or something, and Ella misunderstood.\n\nIf it is Racism though, then go ahead and get steamed, but until you know for sure, try not to get worked up!",
            "She should have asked first. Here is my take on this. \n\nMy MIL only spoke Finnish to her son and her husband is American. He lived in a home where he could not understand what was being said. That became a big problem for him as he was a part of that family but was left out of conversations. \n\nWith your husband, your child having the ability to communicate with hired help, an adult mind you, without his knowledge or input is very concerning and you should be concerned instead of applauding it. \n\nYou have no idea what this lady is saying to your kid and just because you trust her fully, does not mean your husband has too. He has the right to be concerned and he has the right to decide what lines your nanny cannot cross. If you two cannot agree on this, then the nanny does not teach your kid Spanish. When two people cannot agree, no decisions are made and since the nanny has introduced this problem, she has to be the one to stop. Reason being, this issue did not exist until this outside person made it an issue. \n\nIt isn't racism you are dealing with here, this is a safety concern and that is how you should see it. ",
            "If you live in the Western Hemisphere, being bilingual in English & Spanish is incredibly valuable, even just asking for directions sometimes.  Quebec & Brasil I think are the only places that won't be covered, right?  Geez this makes no rational sense at all.\n\nI live in Houston.  I can't tell you how many times Spanish would have come in handy in my life.  You bet your britches my kids are learning Spanish when they start languages in school.  (And one has already started with Duolingo)  Having a an in-home bilingual speaker that's teaching my kid as a bonus to their regular duties?  Please sign me up.\n\nYour husband has lost his mind for some reason or another.\n",
            "I'm a speech-language pathologist working in an elementary school with a lot of Spanish speaking students.\n\n\nChildren are way better at learning languages than adults, because of brain plasticity. It is very good to have a second language growing up, and will probably help in a lot of jobs when she is older.\n\nHOWEVER, a lot of people who are not in my field, or directly educated about language development are afraid that learning Spanish will stunt growth of English. In first learning, your daughter might confuse a few vocabulary words, but she will grow out of it. And knowing Spanish will help with things like root words and English vocabulary. \n\nI have a 3rd grade student where Mom only speaks Spanish and the kid only speaks English. They use a lot of gestures, and Dad speaks both, but they didn't teach him Spanish because they were afraid of English development being stunted. The Mom is one of the best parents...very involved, healthy lunches, always at parent-teacher conferences, but doesn't speak much to her son. We are working on convincing her that he should be learning Spanish.\n\nI think you need to find out why your husband is so uncomfortable with it. If it's worry, then you should do research together about the pros of a kid learning a second language when they are young. It's a concern that makes sense, but the research will contradict that.\n\nIf it's that Ella overstepped her bounds by doing this without talking to you, I can understand that, and kind of agree. Especially if your husband is concerned about the impact on your daughter's development. I think you should talk to her about how it is great to teach her Spanish, but in the future, please talk to you first if she wants to introduce your daughter to new things.\n\nIf it's that he's racist. Then tell him he is being an ass.",
            "Lots of people are stating that perhaps your husband is worried about it affecting your child's English or be strict racism. But would like to add a third possible motive for his actions that he does not want his kid and her nanny to have a \"secret\" language that they communicate in. I know a kid that grew up like that, her mother was bilingual and her father wasn't and forbid the non-English language to be spoken. (It's messed up everyone can agree no need to hash out those specifics)",
            "I'm Hispanic and raising bilingual children in the US, although that second language is not Spanish. I have a few points.\n\nFirst, raising a child to be proficient in a language that is not the country's dominant language is **blood to the end**. Both my wife and I are Japanese speakers (she is native) and speak Japanese at home. While the kids speak Japanese well and have no problems interacting in Japanese with native speakers, they aren't as strong as their peers in Japan. Bear in mind that this is where my kids have the benefit of two Japanese-speaking parents at home with Japanese as the household language. In your case, there are zero Spanish-speaking parents and the household language is English. This means that you cannot reasonably expect the limited interactions with Ella with turn your daughter into a Spanish speaker in any sense of the word. She'll maybe learn some phrases and how to count to ten. To give a real-life example, I grew up surrounded by Spanish on a daily basis and while one of my parents is a native Spanish speaker, the other is not. The end result is that I am not a native Spanish speaker, and I am the only one of my sibling who even has any Spanish. So, don't think you have some golden opportunity hanging in the balance. Based on my experience and the research, I have every reason to believe that your daughter will soon tire of dealing with Ella in Spanish because she knows that Ella speaks English.\n\nSecond, I think it is wrong to frame this as any sort of racism. Spanish is a language, not a race, and it is the second-most spoken language on the planet by all sorts of people. You might as well say that an opposition to speaking English or Russian is somehow racist. In any event, it is not unreasonable for a parent to claim a say in what language(s) his child is raised.\n\nI would also add that it is possible that your husband would have been just as displeased if you enrolled your daughter in trombone lessons or any such other endeavor without discussing with him. This simply may be a decision that he things should have been discussed before you acted unilaterally.\n\nSo, to answer your questions:\n\nA) Find out the reason for his opposition to your idea in a non-accusatory way\nB) Is this even your unilateral call? This would depend on who Ella's employer is. Is it you, your husband, or both?",
            "she could have asked you if it was ok to teach her. I do think a second language would be a great idea. maybe he was just pissed she didnt ask?",
            "If your husband wants to hinder your child from effectively communicating with people, he had better have a damn good reason.\n\nPerhaps he saw the study from a few years ago that indicated that kids who were bilingual had smaller vocabularies...until they were adults, when their vocabularies were significantly broader in BOTH languages.",
            "Are you sure it isn't because he doesn't understand how bilingual kids manage it and he isn't actually just scared of your daughter having difficulties in English at school?\n\nHe might want her to be very eloquent in English and he might be scared that \"Spanish\" words and grammar will take the place of English ...\n\nDo not be too confrontational, it could have nothing to do with Racism. Lot of people who only grew up learning English and don't speak another language might not understand how kids can manage it. There's also the possibility of him being ashamed of being monolingual and feeling threatened? Could be stupid things but not necessarily racism.",
            "Talk to your husband away from your home after you've settled down a bit. Perhaps starting with something like, \"Ella approached me today and apologized for teaching our daughter Spanish. I have to say I was quite surprised by that. Can you tell me why you instructed her to only speak English with Katherine?\"\n\nGive him plenty of time to talk...don't let him off with a short answer.\n\nDepending on his answer you might ask him things like; \"Why do you feel this way?\" Follow up, point out things that are mentioned in this thread like how speaking more than one language can benefit your daughter in a future career or how bi-lingual children have easier times learning other subjects as well.\n\nTell him as well that something else about this situation that bothers you is that he made the English only decision unilaterally. Doing that, you feel has damaged or could potentially damage your marital relationship and the families relationship with your nanny. \n\nThis isn't a small thing and it's my bet it won't be resolved in one conversation. Perhaps therapy will be called for. Good luck to you!",
            "I cant imagine any reason, not based in hate, to torpedo such a wonderful opportunity for your child. \n\nMaybe someone else can point me to an example of the negative sides of knowing two languages...",
            "That blows my mind. I wish I learned Spanish as a child. I didn't care to learn it at all in school and now I work in a ski resort town and we get so many spanish speaking customers. I wish I knew Spanish. It would definitely earn me more money here. Teaching your child more than one language seems like the best idea.",
            "Why would you *choose* to limit the language proficiency of your daughter?\n\nEnd of story, unless you want to get a nanny that speaks Standard Mandarin.",
            "As a fluent bilingual in both English and Spanish, you have no idea how useful until the opportunities to put it in good use come your way. It also opens up a lot of job opportunities. Your daughter learning it at such a young age is incredible and I hope despite this incident (and despite your husband's rather disrespectful input), that your daughter learns this valuable life skill. She's already signs of great progress, which is very promising. A father should encourage their kids to grow and learn, so what the hell is his deal? \n\nI can't say much about what his actual reasoning is behind this is, but I don't believe it to be rational regardless. You can focus on that once you've talked to him, but for now you should focus on bringing this up in a healthy manner (since as you said, you're fuming right now). Once you've got things leveled, prepare to ask him why he talked to your nanny without communicating with you beforehand- as if seemingly he knew you would have a problem discussing something of this nature with him- and then afterwards what his deal is with his opposition. Be concise with your position, and try to reason with him. I'm not sure how a negotiation would play out, but if there is a middle ground, then at least it's better than nothing- even though it's pretty disheartening.\n\nYeah, I don't know. This sounds super weird. Why wouldn't a father want their kid to learn something useful? Boggles my mind. Hope you give us an update, OP.",
            "As other have mentioned, I'd get to a calm place before speaking with Eric about why he is opposed to Ella teaching Katherine to speak Spanish. Thinking racism is the cause is a kneejerk reaction, and the real reasons may be as simple as ignorance towards learning. It sounds like you only have the one child, and I don't know Eric's background, but he may just be woefully ignorant of the developing brain of a child and how easily they pick up new information and that learning more (breadth, not depth) early on will greatly improve her mental aptitude later in life.\n\nBut, there's also the concern that he did not discuss this with you and took actions without your knowledge. He needs to know this is not acceptable behavior. While Ella's actions were incidental and neither of you intended for your daughter to be taught Spanish, if there was any concern about this, it should be been discussed prior to any formal actions being taken. This is doubly concerning because Ella is a live-in nanny, and you've already seen the results of his unilateral actions.",
            "OP, kids who grow up with dual languages are proven to be more... lets not be PC about this, *smarter*.  Fuck what your closed-minded husband thinks.  That and it always helps knowing more than one language, especially if you live in socal where there's almost as many latinos as whites in some areas.",
            "Maybe it's not about racism. My bf is bilingual but he once told me that he wouldn't want me to teach our future children Chinese because he wouldn't want to have his children speak a language he doesn't understand (nothing to do with racism or how he doesn't see that it is an asset to learn Chinese). I got upset but a compromise would be that he learns Chinese too so that he's not left out.\n\nIn addition, I agree with everyone on here saying that learning a another language is very beneficial. I am trilingual (English-French-Chinese) and I learned all languages when I was fairly young and when I tried to learn Spanish when I was older it was a lot harder.\n\nMaybe ask your husband if it's maybe about being left behind.",
            "You don't know that he doesn't want her speaking Spanish for racist reasons. You need to talk to him about what his potential issue may be here before rolling into your home with a head full of steam and starting a fight with him over this. ",
            "1. Get your husband on the same page. \n2. Offer Ella a bonus for the confusion and to keep up the good work. \n3. Try to learn Spanish so you can help Katherine practice",
            "I just wanted to give a tiny bit of hope in the sea of negativity in that it's *possible* that he is jealous or insecure of the type of bonding and secrecy that comes from language learning. Feelings like those are actually very common with nannies.\n\nYes it's possible that he's being racist and that definitely needs to be addressed if it's the case. But I wanted to provide an alternative to open your mind a little and possibly help you cool off and be less mad going into the conversation.\n\nGood luck",
            "This is just dumb for so many reasons.  Kids who know more languages always do better on language and literacy tests.  You can get substantial pay increases and have many more opportunities for jobs for being fluent in a language, not to mention the spanish population in America is constantly growing.  It opens up travel to most of central and south America as well as spain, and at least some ability to communicate in Portuguese (yes, I know they aren't the same language but there is decent enough overlap where you could get by).  Plus your kid will inevitably have to learn a foreign language anyway so this gives him a leg up on his grades.  Your husband is acting like a close-minded racist (I realize that is an oxymoron).  Tell him to grow up already.  Learning anything that could be beneficial in the future is never a bad idea.  Knowledge is always correlated, to a degree, with success.",
            "It's basically a control issue. Your husband wants full control of what your daughter is learning and I hate to tell you he may look down at the culture because she's a nanny pretty much a servant to you all.",
            "Talk to your husband about it obviously. It's possible he may not be coming from a bad place.\n\nMy grandparents are from Cuba, and I grew up in the US. My grandparents didn't really know if they should've taught me Spanish or not. They thought two languages could confuse me, and they wanted me to be like everyone else and fit in.\n\nHopefully that's where your husband is coming from. Hopefully.",
            "I posted this collection of articles on another thread a while ago, a bunch of research showing that childhood bilingualism had all kinds of benefits: \n\nBarac, Raluca, and Ellen Bialystok. \"Cognitive Development of Bilingual Children.\" Language Teaching. 44.1 (2011): 36-54. Print.\n\nBlom, E, AC Küntay, M Messer, J Verhagen, and P Leseman. \"The Benefits of Being Bilingual: Working Memory in Bilingual Turkish-Dutch Children.\" Journal of Experimental Child Psychology. 128 (2014): 105-19. Print.\n\nEspinosa, Linda M. \"Challenges and Benefits of Early Bilingualism in the United States' Context.\" Global Education Review. 2.1 (2015): 40-53. Print.\n\nLearning, & T. B. \"Bilingualism & the Brain: the Lifelong Benefits of Juggling Languages.\" Learning and the Brain Blog. (2015): 2015-12. Print.\n\nKaushanskaya, Margarita, Megan Gross, and Milijana Buac. \"Effects of Classroom Bilingualism on Task-Shifting, Verbal Memory, and Word Learning in Children.\" Developmental Science. 17.4 (2014): 564-583. Print.\n\nAdi-Japha, Esther, Jennie Berberich-Artzi, and Afaf Libnawi. \"Cognitive Flexibility in Drawings of Bilingual Children.\" Child Development. 81.5 (2010): 1356-1366. Print.\n\nMarian, V, and A Shook. \"The Cognitive Benefits of Being Bilingual.\" Cerebrum : the Dana Forum on Brain Science. 2012 (2012). Print.\n\nTang, Rongxiang, and Yi-Yuan Tang. \"Bilingualism, Executive Control and Neuroplasticity.\" Culture and Brain. 3.1 (2015): 68-74. Print.\n\nBialystok, Ellen. Bilingualism in Development: Language, Literacy, and Cognition. Cambridge, UK: Cambridge University Press, 2001. Internet resource.\n\nMcCardle, Peggy D, and Erika Hoff. Childhood Bilingualism: Research on Infancy Through School Age. Clevedon, UK: Multilingual Matters, 2006. Internet resource.\n\n",
            "hopefully he's not a bigot. Some people think children should only be spoken to in one language or they won't learn it correctly. If he believes this you can educate him that this is laughably untrue and that many children grow up speaking 3 languages if not more. If he does turn out to be biased against Spanish-speaking that's a lot darker.",
            "Speaking Spanish got me my last 2 jobs...It's useful.\n\n\nThere's a lot of misinformation that goes around about young children learning languages - that it might confuse them or hurt their mother tongue somehow.  Long story short: it's the best time to be learning a second language.\n\n\nMy sister in law had made my niece take French in middle-high school instead of Spanish because she's a snob/closet racist (Spanish being \"the maid's language), I hope this isn't the case for your husband and he's just misinformed.",
            "I get what you're saying, but at the same time, the nanny could very easily decide to teach their daughter something they don't approve of, but the nanny saw no issue with. Which is why they should check with their parents first. \n\nFor example, teaching their daughter how to put on makeup. Yeah, she'll probably use the skill when she's older, but it's not something everyone wants a young child to learn. \n\nI'm not saying there is an issue with learning Spanish. I'm saying there is an issue with a nanny making these decision without consulting the parents. A simple \"hey, I could teach your daughter Spanish if you want?\" is really simple to ask. \n\nAlso, if you had already started teaching someone's daughter Spanish, why would you not tell them? ",
            "I've heard that some people thing that learning a second language will have their first language stunted, so it could be that he's heard that rather than it just being a straight up racist thing.\n\nThere are people who will pay through the nose for multi-lingual nannies because of the career advantages it can give their kids later on.\n",
            "It's actually much easier to pick up a second language if it is taught between the ages of 3 and 7. What your nanny is doing for your daughter is highly beneficial for her later in life. Also the earlier you learn a second language the easier it is to pick up a third or more. Spanish is a Romance language (based on Latin), and has many similarities to French, and Italian. Once she has one the others will come much easier. \n\nMaybe you could tell your husband these things. Stopping the nanny doing what she was doing would hinder not help your daughter. Speaking Spanish in a highly Hispanic area will never not be helpful, best case for a job later in life, worse case if only because people will underestimate her and not expect it. \n\nSpeaking multiple languages also looks good on college transcripts btw. \n\nAs for the nanny, I bet she just wants what's best for your daughter. If you explain that your husband didn't understand the benefits of what she was doing, and you talked to him about it, your's and your daughter's relationship with her should be fine. (Who knows about your husband but he will need to mend that fence himself.)",
            "There is a ton of linguistic research that indicates children's brains are so malleable and undifferentiated before puberty that learning language is easy for them at young ages. They are designed to learn!\n\nIf your husband has a problem with any certain language or cultural group then perhaps this can be a terrible conversation and in that case I wish you well sorting it out. I do not have advice for how to handle that, if it is the case. \n\nBut! I would more be leaning towards the idea that your husband is worried your daughter will be confused by learning two languages. In that case, I would (were I in your shoes) try to stress how much easier it is to learn language at this age and ask him to do some research of his own to assuage his fears. If your daughter decides to learn Spanish in high school, for instance, it would be much more difficult for her to approach native speaking proficiency at that age than it would be now.\n\nNot to mention how amazing Spanish is as a jump off to any of the romance languages - eg. Italian, Portuguese, French - all of these languages are related, and blend where countries border each other.\n\nIf you can speak to your husband about the benefits of being bilingual perhaps he will relax and not be concerned any longer. I'd give him the benefit of the doubt and just assume he is worried that she will be confused. ",
            "Before being really upset with your husband, he may just be protective or worried that someone could communicate with his daughter in secret and he wouldn't understand what they were talking about.",
            "Your husband sounds like an ass. It might be hard to reason with someone who is so unreasonable...so I don't really have any advice other than good luck. ",
            "There is basically no disadvantage to her speaking more than one language. Your husband is nuts. \n\n(For the record, i grew up speaking english and learned french when i was younger, my only regret is not learning more languages when my brain was younger) ",
            "There is literally no downside to knowing multiple languages. What dick has a problem with this. ",
            "You can't graduate high school in California without a foreign language credit, so she'll be learning some Spanish (most likely, unless your husband insists on French I guess) eventually. \n\nI'm guessing he doesn't want her talking \"behind his back\" in a language he doesn't speak. I'd tell him, that's his problem, your kid can only *benefit* from being English-Spanish bilingual (I live in AZ, do you know how many good jobs *require* you to be fluent in Spanish here?! It's no different in SoCal either), and that if he has a  problem with her being fluent in a language he doesn't know, then he should make an effort to learn that language himself. \n\nAsk him *why* on earth this is such a problem for him when she really can only benefit from it. I can't think of a single drawback to being bilingual, especially in Spanish! ",
            "That's fucking stupid. Nuffsaid",
            "well first of all, does your daughter have the ability to differentiate between the two languages to begin with?\n\nI know a couple korean-americans that were taught korean when they were very young,\n\nspoke broken korean-english until they were 9~13 and have a korean accent when they speak english and an english accent when they speak korean.",
            "Spanish Teacher here.\n\nStudies show that children who know 2+ languages outperform children their own ages that only have one. They improve the elasticity of their brains and they become better at skills such as multitasking and problem-solving. These are all things that you can tell your husband. There are videos that explain this better on YouTube. I show them every semester so that my students understand why my class is important. \n\nBut honestly, like you said, you guys live in southern California. Learning Spanish could be really useful. \n\nI will say that he might just be uncomfortable with two people speaking another language in front of him. A lot of people think that if someone is speaking another language in front of them, then that person must be talking about them. I run into it all the time at work. Maybe reassure your husband and suggest that you guys all learn as a family?",
            "Bilingual person here - everyone in my home country is bilingual and grew up learning two languages  (coincidentally, also Spanish).\n\nThe only encounters I've ever had from people who are uncomfortable hearing me talk in my second language - usually over the phone to my mum - are bullies. \nMy MIL showed herself to be racist when she loudly declared 'in this country we speak English! It's rude to speak another language with English speakers around!'\n\nAt the time, I was teaching my daughter to say 'please' in spanish. \n\nOP, your husband is displaying some willful ignorance here - and it might not be blatant, but there's an undertone of racism here.\n\nIn your position - I would download the app 'memrise' and tell your husband that you are learning Spanish because you always wanted to learn it, why doesn't he try?\n\nHis reaction will give you your answer.  I warn you, it won't be pretty.",
            "His racism is robbing your child of a better future. Pretty fucked up. Stay with him if you don't care how intelligent your kid grows up be.",
            "Edit: Well, this turned out to have an unexpectedly happy ending. Yay for happy endings, and yay for talking things out.\n\n----\n\nIf someone who speaks three languages is trilingual, and someone who speaks two languages is bilingual, what do you call someone who speaks one language? An American.\n\nSheesh. What else doesn't he want her to learn? Dinosaurs? Round Earth? Heliocentrism?",
            "[deleted]",
            "Growing up with two languages is one of the best thing you can do for a childs cognative abilities. ",
            "If it means anything, I think knowing a second language is going to be a useless skill in 20 years.  The technology to translate in real time is just around the corner.  ",
            "There are several articles out there that talk about the important of learning several languages as a child. It makes the brain work differently. I suggest showing him one of the articles ",
            "Being bilingual is an excellent life skill to have. Not only does it open you up to a whole new culture (books, movies, tv, etc) and experiences and people (and friends) but it is valuable academically and in the job market. \n\nI took French in high school instead of Spanish (way back in the 70s), I wish I had taken Spanish instead. It would be much more useful in today's environment. People who are biased against the Spanish language should study the history of the southwestern United States and realize that it was a Spanish country before the US acquired it. ",
            "some people wrongly assume that if their kid starts learning another language while learning their primary language, it will worsen their skills in the primary language.  its possible he may be worried that it will hurt her english speaking skills, (although this is not likely to hurt her skills at all!!) i would keep this in mind when approaching him about it, since it may not necessarily be about racism.  ",
            "That's crazy...even if he doesn't want his child speaking another language for God knows whatever reason, he should at least encourage it b/c it helps your child build strong foundations in how to learn, think, and see things differently. Learning a different language has more positives than any negatives even if you exclude \"the ability to talk in a different language\" part. ",
            "I can see why ~~you're~~ your husband would be annoyed. What else is your nanny teaching your daughter? It's not your daughter learning Spanish that is the problem, it's that your nanny is making parenting decisions without consulting you or your husband.  \nYour husband was totally out of order to talk to your nanny about this without consulting you.   \nSo in summary, communication is the problem here. You and your husband need to talk about your expectations, agree, and communicate them to your nanny.  \nEdit:Wow, TIL that the statement \"deciding to teach your child a second language is an important parenting decision and not one that a nanny should make without consulting the parents\" is controversial, at least in the US!",
            "Your husband sounds like a complete turd in this regard. Being able to speak multiple languages is one of the most useful skills anyone can have. Would your husband be so adamant if your daughter were learning a language other than Spanish? It seems like this could be the start of many red flags to come.",
            "Closet racism is a thing.",
            "Lots of people are giving g out great advice about being bilingual, which is great. Though I think you're overreacting here. I was expecting your husband to have an angry tone towards you or the nanny. Sure, he should've spoken to you about this (and you would've relayed to us if there was a hint of prejudice) before asking the nanny, but he didn't. Also, the way you phrased it he \"asked\" her not to teach her anymore, he didn't tell or demand her to stop. I'm all for being bilingual but you shouldn't be fuming or beyond furious.",
            "So, your nanny  has a right to make a major decision about your kid without talking to you (or your husband), but your husband has no right to talk to your nanny without asking you first?\n\nThat's not how a partnership should work.",
            "Holy shit stop overthinking.\n\nStart with.\n\nHey, what did you tell the nanny about Katherine and spanish?",
            ">Eric has never expressed any racism (if he had, we wouldn't be married; that's a dealbreaker for me), but I can't see any other explanation for this.\n\nGet a grip. Some people think that trying to learn a second language at a young age makes it more difficult to learn their first language properly. They might be *wrong* (they probably are? I don't know), but they're not *racist*.",
            "I'm a father of three trilingual kids. I would have still liked the nanny to ask me before going on to teach any of my kids anything.  \nAnd I don't see why you are \"fuming\": How does him asking Ella not to do a thing that's not part of her duties damage the relationship? Second, ask him - that part shouldn't make you angry. Third, does your husband ask for your input before making ANY little thing regarding your daughter? I hope not.",
            "Dont listen to these people here is what you do:\n\nPull him aside with a look of surprise and a sly smile on your face, while saying something to the effect of, \"Honey! Nanny just told me you told her not to teach daughter Spanish! You didn't mention you would talk to her in the car, but good job on nipping that in the bud!!\" And smile genuinely while nodding approvingly. \n\nAnd then brace yourself for whatever racist shit he will then reveal to you. Try and play it cool while he does this so you get all of his views expressed. \n\nOf course you could get lucky, and it could turn out he really just disagrees with many of your child rearing philosophies, leading him to guide things in different directions behind your back. \n\nEither way if you start off by scolding or being disapproving, you'll never get the real reason why he did it. Not fully. ",
            "[deleted]",
            "If I were you I'd do 2 things to make sure he knows how serious you are.\n\n1.  Divorce his ass.  (You can't live the rest of your life with a piece of shit racist)\n\n2.  Move to Mexico with your daughter. (This way you and her can have a healthy upbringing in the Mexican culture)",
            "[removed]"
        ]
    },
    {
        "post_id": "6leqgw",
        "author": "familyreunionthrowaw",
        "title": "[Update] My family disowned me [26m] and now they want to reconnect",
        "url": "https://www.reddit.com/r/relationships/comments/6leqgw/update_my_family_disowned_me_26m_and_now_they/",
        "score": 2917,
        "num_comments": 152,
        "created_utc": 1499268672.0,
        "selftext": "Sorry this is so long. Link to original: https://www.reddit.com/r/relationships/comments/6hc92o/my_26_m_family_disowned_me_now_want_to_reconnect/\n\nI talked it over with my adoptive mother and my partner and I decided to see what my sister had to say. As a few people here suggested, I made a new email address and told her to only contact me there. I also told her I would only respond to her, that I wasn't ready to speak to my mother yet. I asked her why she was contacting me now, why she didn't stick up for me then, and what what she wanted from me. \n\nShe told me that when everything was happening my father had forbidden any of my siblings from talking to anyone about it or attending the trial. Everyone knew I was in therapy for being gay, but he told them that my \"legal troubles\" were because I had run away from therapy and I was selling myself and doing drugs and I refused to come home. None of that is true. I did have a drug problem later, but that's not what the trial was about and I never sold myself or ran away. I had to go to the hospital because I got hurt and the doctors there called the police. I also desperately wanted to come home but they didn't want me back. \n\nEarlier this year my sister was playing a game with her son that she used to play with me when I was little and she realized there was nothing her son could do to make her stop loving him. She started asking my mother why they didn't find me and make me come home, get off drugs, etc. and my mother finally broke down and told her the truth. My sister immediately started looking for me but it took a while to track me down because I changed my name. \n\nShe says she doesn't want anything from me and I believe her. She said she's sorry for what happened to me and that she would have stepped in if she knew. We've been emailing back and forth a million times a day and we've Skyped. She still seems pretty conservative but she told me that she \"watches and enjoys Ellen\" and that my husband and I look sweet together in the photos she saw online. She still lives near the rest of my family, but she might come out here to visit. She wants to meet my partner and she sent a very nice e-card to my new mother to thank her for taking care of me. I'm really happy to have her back in my life. \n\nI'm not sure what to think about my mother. My sister maintains that she really wants to see me and that she's so sorry and that my father made her do it, but she's still with him. And I'm even more hurt now that I know they lied about me. I put up with literal torture for them, and they threw me away and then told my family I was garbage so they would stop loving me too. She kept up the lie for ten years, and who knows how long she would have kept going if my sister hadn't been so persistent. \n \nAnyways, thanks for all the advice I got here, especially from those of you who tried to be understanding about my mixed feelings towards my family. \n  ---   \n  **tl;dr**: I decided to talk to my sister, my parents lied about what happened. ",
        "permalink": "/r/relationships/comments/6leqgw/update_my_family_disowned_me_26m_and_now_they/",
        "comments": [
            "I remember your post. I'm so glad that you were able to connect with your sister and that she was deceived by your parents.\n\nI would be *very*, *very* cautious about connecting with your mother. She hasn't reached out to you directly with a huge apology, and there is probably a reason for that. Plus she is still physically living with your abuser.\n\nSpend some time reconnecting with your sister. Years, perhaps. Put a foundation in place. See what happens with your mom over time but BE. CAREFUL.\n\nI wish you well and lots of happiness.",
            "I would move slowly and cautiously and establish a relationship with your sister first.  Then, perhaps, other siblings.\n\nUnfortunately, it sounds as though your father is abusive and your mother is his enabler.  I would be very hesitant to allow her to have contact with you and your partner.",
            "> that she's so sorry and that my father made her do it, but she's still with him\n\nDon't forget that.\n\nSorry means *nothing* without an attempt to change. Not one single, gotdamn thing.",
            "I'm really happy that things seem to be moving in a positive direction with your sister, my heart ached for you reading your original post.  Since it sounds like she is still in contact with your bioparents, tread carefully - any information that you give her could easily end up in their hands.  \n\nYour mom willingly sent you to a torture camp.  She is still married to the person that she blames for everything.  She lied and slandered you to people that you loved to isolate and exile you while maintaining her own reputation.  Don't give her a second opportunity to damage you emotionally, to fuck up the good life that you've built for yourself in spite of her.  She is no Christian.  \n\nIf she divorces your father, fully admits her own implicit guilt, and puts herself in intensive therapy, tell her you'll consider talking to her in a year.  Otherwise, put yourself first.  ",
            "It is amazing how parenthood really makes you re-examine your own childhood, relationship with your own parents, etc. I can see why her love for her child helped her realize, deep down, that there was something fishy about the lies your parents told her about you. I'm glad that the two of you have reconnected. I hope it continues to be beneficial for the two of you. \n\nI hope that she becomes a source of familial love for you. I agree with other posters: Take this slow, and your mom made unconscionable choices. But I'm rooting for you and your sister.",
            "Glad to hear you've made some progress.\n\nI think you are right to proceed with extreme caution. ",
            "It sounds like you're on a good track now. I'm so sorry you went through all this. Just keep leaning on your partner and your adoptive mom as you make decisions.\n\nI understand your missed feelings about your mom. My husband ended up entirely estranged from his mother for similar reasons, when she never intervened in the abuse by his father nor stood up for her kids and then grandkids. He gave her chance after chance but ended up just accepting that she chose the abuser, and he couldn't deal with going through that choice again.",
            ">I put up with literal torture for them, and they threw me away and then told my family I was garbage so they would stop loving me too. \n\nThis is one of the saddest sentences I've ever read in this sub.  OP, I genuinely hope that this works out for you and that having your sister back in your life brings you some happiness.",
            "I'm happy for you that your sister seems to have woken. Though, in my eyes, if she was fully decent, she would disown her parents for being so horrible.\n\n>I put up with literal torture for them, and they threw me away and then told my family I was garbage so they would stop loving me too. She kept up the lie for ten years, and who knows how long she would have kept going if my sister hadn't been so persistent.\n\nThis is exactly what you should say to your sister when you explain to her why you won't see your mother again. I have two kids, and I just can't imagine doing anything like that. It's pure, pure evil what your mother and father did.\n",
            "I too remember your post, thank you for the update.\n\nPlease think that, as an adult, we start our own family with our partner and this new family is the one. Whatever family was ours during childhood, the one we build is the one that matters now, in the present, and that will support us thru thick and thin.\n\nWishing you all the best. ",
            "> she told me that she \"watches and enjoys Ellen\"\n\ncool. that sounds awkward as fuck. also, though, sounds like her heart is in the right place :-)",
            "Your sister sounds nice and good-intentioned but still not trustworthy IMO. What was she trying to accomplish by telling you that your mother is so sorry and really wants to see you? It sounds like one of her goals here is to connect you and your mom which is something you aren't interested in. Is your sister sharing info about your life with your mom? It sounds like she might be doing that. Does she have your permission to do that?",
            "Ignore your birth mother. See what happens with your sister.",
            "Honestly, i'd continue to explore the relationship with your sister.  It doesn't look like there will be any harm in doing so.  That being said, I'd be clear you do not want a relationship with your mother.  She was complicit in what happened to you and she has not really apologized for what happened. \n\nShe has an equal responsibility to you as did your father.  We all know your father failed you, but your mother was well within her power to stop him, conservative or not.  The fact that she's still with him indicates that she made her choice.   \n\nLive a happy life, have a nice relationship with your sister, and go from there.",
            "Theres nothing my husband could do to force me to not protect my children. I'd be wary of mom if she's still married to dad.",
            "I may be in the minority here, and also naive, but OP has been basically tortured, torn away from the only family he knew (which yes he should have been), gone through the foster care system, has had copious amounts of therapy, has a wonderful support system, and made a great life for himself... I think the man can make good decisions on his own. I understand everyone cautioning, but lets calm down a little with the theories the sister is nefarious in her intent or will be in the future. You do you OP. I think everyone commenting cares a lot about you from just one post, and that says a ton about you as a person.\nI am so so happy for you and also LOVE the Ellen olive branch. I feel like she was really trying to help you feel like she wasn't trying to judge you. Plus the thinking about how her son could never do anything to make her stop loving him... she's really coming a long way from her roots. You also mention that she was an integral part of you childhood, watching and looking after you... maybe a part of her feels the same about you???  I hope so! Wishing you and whomever you decide is your family, the best!",
            "don't feel any sort of obligation to speak to your parents. period. \n \ni remember your story, thanks so much for the update. i can't imagine what all you and your husband are going through. sending my best wishes your way. ",
            "\"I'm not sure what to think about my mother. My sister maintains that she really wants to see me and that she's so sorry and that my father made her do it, but she's still with him.\"\n\nIt's perfectly okay to regards her acts as beyond forgiveness. I certainly do.",
            "I look at my kid the same way. There's nothing she could do that would make me react in such a horrible way. I read stories from broken homes every day and I just can't imagine how you get to treat your own children so badly. I still don't get why my own parents did. I hope you're able to forge a relationship with your sister. Your parents though, if I where you it would be unforgivable, and I've forgiven so many things. ",
            ">that my father made her do it, but she's still with him\n\nThat would be enough for me to not want anything to do with my mother if I were you. But I'm not and whatever decision you make, I hope it works out well for you. I'm so sorry all that you've been through and I hope reconnecting with your sister brings you joy and happiness. ",
            "baby steps, no rush\n\nI still think someone wants a kidney",
            "I also remember your story.  \n\nCautiously optimistic is your motto going forward.  Protect your well-being is your #1 priority.  Keep them out of your head and stay on a course of independent fulfillment.  They have never added to your life, only taken.  We can and should choose to only have people in our world who at worst are neutral.  Never allow anyone to take anything from you willingly.  \n\nAs an outside, just a few thoughts to process.  \n\nIs Mom wishing to connect to receive her guilt or because she genuinely wants to know you?\n\nIs mom willing today to stand up to dad and tell him to let her and you be so you can have a relationship.  \n\nRegardless of sister's efforts, she is still an agent for Mom.  If she genuinely is in this for the sake of a relationship between the two of you, she will not pursue, pressure or continue to advocate for mom unless mom makes a full, legitimate apology.  Mom apologizing doesn't automatically commit you to accept her back into your life.  If you choose to reconnect, do so on limited terms, away from her safety net.  Short visits, little communication between visits and some genuine reflection and acceptance that you are perfectly normal.",
            "Well, I think you should keep your distance from your sister and family bit here because there is obviously something up, and it's really suspicious that they suddenly want to reconnect with you after disowning you, but if you really miss your family and sister, you can contact them, but I would be careful because you are practically not family anymore.",
            "Being gay is terrible, but lying somebody's reputation down the drain is perfectly ok? Those people might believe they're Christians, but I doubt they believe in Christ.\n\nDon't trust posers. Everything about them can be fake.",
            "This is infuriating on so many levels, and just goes to show how fucked up people are.\n\nOP, I hope you're ok. I'm not really sure what else to say, I can't imagine what it would've been like. \n\nI hope that the future treats you better friend. ",
            "[deleted]",
            "Coming from a family in which my granddad pushed his two sons out of his family at a young age, because they turned out to be gay and later tried to keep them away from me, because he thought, they will sexually abuse me \"just because\" - I wish you all the best in whatever you decide to do.  \n  \n(Many years later, family relations are better now and I love my uncles.)",
            "I remember your post. Nice to see a happy ending sometimes. Thanks for the update and please be careful. This random stranger is happy for you. :)",
            "Tell your mom to divorce your father and to contact anyone they told those lies to and clear things up. Maybe that'll give her a taste of what they did to you. ",
            "I'm so glad it's slowly working out with your sister. That's great news! However, after reading JUSTNOMIL, JUSTNOFAMILY and RBN, I would really suggest being cautious around your sister. \n\nIf she's going to visit, don't host her at your house. Meet out places or at her hotel. I'd also be prepared for your parents to possibly show up. Maybe just to start out just trying to pay attention to surroundings and keep doors locked and stuff, but also be ready to take measures like getting security cameras or alarms so you can get them set up quickly if needed. \n\nI really hope I'm being overly cautious, but your parents can do a lot with information about you, including making your life hell at your home and possibly actually physically hurting you... ",
            "I would advise that you tell your mom to go fuck herself until she divorces your dad or they both give you a HUGE AND SINCERE apology and even then you DO NOT talk to her or your sperm donor again. The shit she and your sperm donor did was fucked up on every level and does not deserve anyone's forgiveness. You've built a happy life for yourself out of the pain they caused you. Don't let them ruin it, like most of those kinds of parents do.\n\nAlso, I forget who said it, but I have a feeling your sister is projecting her own guilt onto her mother. The moment your egg donor went along with the shit your sperm donor did was the moment she forefeited any chance of a relationship with you at any point.\n\n(If you do want to be extra, you can add the condition that they have to tell everyone they know and everyone they lied about you to about what they said (lied) about you and what they were using those lies to cover up.)",
            "I don't know if anyone has asked but does your Dad know they are trying to talk to you? I'm just saying I wouldn't want to be a secret Brother/Son. Certainly not in your circumstances. Just my two cents.",
            "Please, for the love of God (ironically), don't ever dare let your parents get anywhere near you. Be very clear about that to your sister; your parents fucked up and should be in jail for child abuse/negligence right now.",
            "Is there any chance to press charges against your father? It sounds best for everyone.\n\nIronic how he sent every one of his children to a \"therapy\" when he's the one that needs to be locked in a mental asylum",
            "The thing is, your mother only wants to reconnect behind your father's back.  If she is with him, there is no chance he'd allow her to do this.\n\nAnd your sister is doing this behind his back too.\n\nSo while you may reconnect, there will most likely come a day where they disappear again.\n\nYou need to accept that and prepare for that.  Because as long as they are all still afraid of him, history is bound to repeat itself",
            "People here are giving way too much power to your bio-parents.  This whole like...\"they could come after you and make your life hell\".  The reality is that people who throw away their children probably aren't going to expend the effort to go out and attempt to hunt them down.  I am not saying that you shouldn't proceed with caution with your sister so that you don't get emotionally hurt, but that caution should be...don't put unrealistic expectations for \"family bonding\" on your meeting.\n\nI think it speaks well of her that the minute she found out the truth that she sought you out and her having her own children made her realize there is nothing a child could do that should cause the parent to stop loving them.  She might be conservative. That doesn't necessarily mean she's hateful or not open to accepting you and your partner.  Sometimes people just need to get know unfamiliar concepts to wrap their minds around them.  I would be cautiously optimistic with your sister and I wish you well.  ",
            "OP, I don't have any advice. I just wanted to say that it was very brave of you to open up the possibility of a relationship with your sister. You sound like such a wonderful person that has been through so much, and you deserve all of the goodness in the world that comes to you. I hope this new relationship with your sister is a happy and joyous thing, even though it will be complex and perhaps difficult to navigate at times. \n\nI'm very proud of you. Good luck.",
            "[deleted]",
            "I'm glad to see you landed on a good place with your sister, maybe a first step could be a way for you to \"contact\" your mother without contacting her at all; tell your sister what info you want your mother to know or not and let her talk with.  \n\nYou are in zero obligation to contact her if you don't want, no one would judge for not wanting to do it now or 100 years from now. ",
            "There are more than 7 billion people on this planet and half of them are liars. Its just easier to see the world this way. People are liars. ",
            "They're not really your family, not even your sister. Sorry but it's true. Nothing she could ever do would change the fact that your sister's parents will always be her parents. She's already speaking on behalf of your traitor mother. You're just opening yourself for disappointment and betrayal. Thread extremely carefully and good luck! \n\n>She wants to meet my partner and she sent a very nice e-card to my new mother to thank her for taking care of me. \n\nEverything you share with her she will share with your mother and father. I just don't see how you could be a happy family with any of them.",
            "Congrats on your new sister! Your post was on my mind for days, I'm glad things turned out to be okay (ish) in the end. ",
            "Keep the sister, drop the mother. ",
            "I haven't spoke to my mother in almost 10 years... its not the end of the world, you won't go to hell.   But, I have never felt better in my 47 years of existence...",
            "Don't let your sister compel you to contact your mom before you're ready.",
            "OP, your mom is a doormat and I would never speak with her again. ",
            "[deleted]",
            "I'm really sorry to read about all the abuse you have been put through just because you're gay. I really hope your life has improved drastically since then and that you are doing well.\n\nAnyway, I can understand the whole situation from your sister's perspective. It's very easy for parents to manipulate their kids and at the time. she probably believed them since they were her parents and kids generally trust what their parents have to say. I'm glad she saw through their bullshit and it seems like she has tried very hard to contact you again and that she wants to have a good relationship with you.\n\nAs for your mother, that's really up for you to decide. It's possible that your mother continues to stick by your dad because of religious reasons and was brought up to believe that she can't divorce once she's married. My friend's ex-boyfriend has an abusive father who is physically and verbally abusive towards both him and his mother. His parents are Jehovah's witnesses and the mother believes she can't leave him because it is a sin, even though she recognizes that he's an abusive asshole (My friend's ex-boyfriend was abusive as well, but that's another story for another time). It's also possible she's scared of being alone and even though your father is an asshole, at least she has someone by her side and did what he said out of fear.\n\nYour mother hasn't tried to contact you directly which may suggest that she does feel shame for what she did and knows you're angry with her. Maybe one day you could try to have a conversation with her about the whole situation and see what she has to say about it. Your mother might feel awful about what she did to you or she could possibly just want forgiveness to satisfy her own ego, but the latter doesn't really sound like the case. Use your own judgment and see if she truly is sorry for what she did and if you think she is deserving of forgiveness or not. It's up to you whether you want to revive your relationship with her or leave it in the grave. Do what you feel is right and don't let anyone force you into a decision you don't want to make."
        ]
    }
]