[
    {
        "post_id": "kz6fpy",
        "author": "ProAcrobat34788",
        "title": "How to deal with my dad (50/M) moving his GF (48/F) in as a 16/F teenager?",
        "url": "https://www.reddit.com/r/relationships/comments/kz6fpy/how_to_deal_with_my_dad_50m_moving_his_gf_48f_in/",
        "score": 2914,
        "num_comments": 344,
        "created_utc": 1610890095.0,
        "selftext": "\n\nMy dad recently moved his partner in without asking me or my siblings if it was ok.\n\nThis has created a lot of awkwardness for us, and my 2 younger siblings keep telling me they are uncomfortable living with her because it’s like having a stranger in our house. I feel the same way. I don’t really know how to cope so I’ve just not really talked to her beyond saying hi and good night and how was your day to her. \n\nRecently, my dad has asked me why I haven’t talked to her more and I told him that I’m not that outgoing or talkative with strangers. He said that she wasn’t a stranger and I said she felt like one. I asked why it wasn’t ok for me to just coexist with her in the house and to just only exchange small pleasantries, and he got angry at me and said I needed to make her feel welcome. \n\nI just don’t know how. She seems nice, but I’ve been feeling depressed about not seeing my friends, and so I’m tired and run-down a lot. I have a bad relationship with my mom, too, so I’m wary of older women and women who are in a position to be maternal.\n\nTl;dr: I’m looking for advice on how to deal with my dad’s girlfriend moving in.",
        "permalink": "/r/relationships/comments/kz6fpy/how_to_deal_with_my_dad_50m_moving_his_gf_48f_in/",
        "comments": [
            "Honestly? Sounds like you were doing fine. \n\nBe polite. Be pleasant. Maybe periodically try to engage with her. \n\nIt’s not on you, the kid, to develop a relationship with this older adult. And if you aren’t there yet, that’s fine. \n\nMaybe ask your dad why this is such an issue for them. What do they want to happen? What do they view as wrong here?",
            "Did any of you meet her before he moved her in? It is so bizarre to me that some parents pull stunts like this.",
            "This is not on you - it's 100% on your dad. If he is someone you can talk to, sit him down and tell him how it made you feel that he didn't give you any input into moving someone into your home. Tell him you don't feel like you know his GF at all, and that you feel uncomfortable with the situation. If he can listen and own up to his messup, then you can go from there in figuring out ways to get along with GF. \n\n\n\n\n\nCoexisting with a roommate (essentially what she is now) is perfectly fine - be polite, don't leave a big mess, etc. Kind of prepares you for college life, in a way. But if you can, it might make things easier to be open to getting to know her, once the shock wears off. Your dad should be putting forth a majority of the effort in making that happen, since this was his decision.",
            "Your dad is expecting you to do the emotional labour of building a relationship with his girlfriend, which is a really shitty thing to do. It is his girlfriend and his children so he needs to act as the bridge not you. Tell him this.",
            "I wasn't asked for permission for my parents to move someone I'm when I was a teenager. Nor did I meet my mom's boyfriend before he moved in. However, that was on her. My dad however, has allow d us to meet and get to know his girlfriend before he gets a house with her for me to live in during the summer while I'm in college. This is not on you, this is on him to make her feel welcome. Especially since he didnt introduce her beforehand.",
            "I am so sorry you have to go through this, it is a very unpleasant experience and I completely get where you're coming from.\nIf I may ask, how long have your father and his GF been together? Have you spend time with her before she moved in? And has she made an effort to get to know you and your siblings or is she just there?\n\nWould you mind helping us paint the picture?",
            "Why is the job of a minor to make adults feel comfortable? Your dad is out of touch.",
            "Your dad screwed up here. He should have given you and your siblings much more of an opportunity to develop some kind of relationship with her (be it parental or not) before moving her into your home. That was a selfish decision on his part and it's not your fault you view this stranger as stranger. Your dad wanted to skip the hard part of actually letting his kids get to know his new partner and go right to the part where you're all a family and that's just not how this works.",
            "As a step mom this seems so weird to me! My stepdaughter was younger than you when I moved in, she was 11, but it was definitely a conversation and I had been around for years. I was not a stranger.\n\nIt's definitely not fair to you or your siblings. Is there another adult you can talk to? Therapist, aunt, uncle? \nMy parents are still married but I could see my dad doing this. Well my house, I want her to move in so she's in. Kids will adjust. \n\nIs there anyway you and your dad can talk privately and say something about how you want him to be happy etc but you and your siblings are still adjusting?   Good luck.",
            "This is all on your father.  I don't understand people trying to say you're even partly responsible for ANYTHING here.\n\nLet's put aside the fact that you're 16 years old, and your father just pulled this nonsense.  Let's put aside that there are two other, even younger children here also feeling infringed on.\n\nIf you're living with someone and you want or need to  move someone else in, you don't just do it, you talk with the people living with you first.  This even goes for them staying the night.  It's just common courtesy to give a roommate that warning.\n\nI mean this is standard even for two strangers but as your FATHER, moving in his girlfriend, he should have absolutely talked with you and your younger siblings beforehand.\n\nIt's his home and he can do what he wants legally, but it's just not right to pull that crap.  Even if you had not been ok with it(as you aren't now), at least you would have known it was coming and had been able to somewhat prepare yourself for the loss of privacy.\n\nIf a friend of mine pulled something I've this on his kids I'd probably yell at him.  Totally inconsiderate.  I'm guessing this is part of why your mom divorced him, sorry to say.",
            "This is your dad’s responsibility to facilitate ways to help the family get along and bond. He can hop on google and figure it out. I literally just typed “how to help children bond with new partner” into google and a wealth of resources appeared. This is your dads relationship and it’s on him to do this. Keep on how you’ve been handling things.",
            "While your dad isn’t necessarily wrong for moving moving his girlfriend in, the way he went about it is very wrong. He absolutely should have talked to you and your siblings about it in advance and helped to better prepare all you you, including his girlfriend. There should have been some get-to-know-each-other dinners at home, maybe a family weekend outing that included her, etc. well before she moved in. If she feels like a stranger to you then that’s on your dad and maybe on her a little bit also, but it’s certainly not on you. You have been polite and have done nothing to make her feel UNwelcome, which means you’re doing the best you possibly can given the circumstances. What has SHE done to make YOU feel more comfortable and at ease with her moving into your space? She’s the adult, your dad should be talking to her about how to facilitate a warmer relationship, not you.",
            "As a stepmom, the work here is NOT on you. It’s on your father and his girlfriend to make this work.",
            "Ok well first we don’t even know how long the father has known the chick so that’s one. Secondly that doesn’t give him any right to move her in so sudden. Here are a couple of things you could do that would help:\n\n1. Try talking to him and telling him you respect her and his decision to be happy but you are not comfortable and that it will take time for you to get used to it\n\n2. You could try to make small talk with her or something, but giving you said you don’t have a good relationship with older women because of your mom it might be hard. But don’t force it, it takes time to get used to someone. And if she is a genuinely good person, she would understand.\n\n3. Number 2 brings me to my next option actually. You could ask to talk to her alone and bring up the fact that this is all new to you and you aren’t being mean by not talking to her much but you just don’t know how to talk to older women because of your relationship with your mom. Also try to say that you would consider one with her but she has to understand that some things take time.\n\nI’m a 15 y/o so I know how that feels. It was awkward for me at first with my dads gf because my mom didn’t like her (and still doesn’t) but I soon got used to her after a while because she was so nice and I felt way more comfortable talking to her than to my mom since I don’t really have a mental connection with her (still a great mom though) but ofc since my mom was still single at the time, she now has a new bf and I have to try and make some type of connection with him.\n\nBut I know that if the connection isn’t there then it just ain’t there. And I’m gonna tell you sometimes, but most of the time, you can’t force things that aren’t there to be there. That’s like forcing a person who doesn’t have feelings for you anymore to like you again. It’s impossible. So in the end if it doesn’t work out and you just don’t genuinely feel comfortable with forming anything with her then your dad just has to deal with it. Also talk to your younger siblings and tell them something similar to what I told you. But this is your life and we are strangers, go with your gut sweetie.",
            "Just keep being polite and respectful. A relationship will form or it won’t. Depression is hard, and I hope soon it’s safe to spend time with your friends again. My dad got married to a woman I had only met 2x before the wedding, so I understand how awkward it can be to have a stranger in the house. It should get better with time.",
            "To people saying the parent doesn't owe OP anything and can just move his partner in without notice and expect her to treat this stranger like family: \n\nShe is a child. He is her parent. He A. Has not considered the effect that this will take on his children, and B. Can't expect them to treat her like family when they literally just met her as she was moving in. This takes a toll on OP's mental and emotional health, and it takes nothing for her dad to not be selfish. No one is trying to dictate anyone's relationship, I'm sure if the guy is dating again that's fine, but trying to enforce a non existent relationship between GF and OP is straight up not going to happen unless there's effort on GF and Dad's part to build that relationship. She is not responsible for how she feels when the adults put her in an uncomfortable situation- They are ADULTS and have made irresponsible decisions, it's not her job to remedy them. Lastly, if you feel like your relationship with your partner is more important than the wellbeing of your children, for fucks sake, let another adult who will prioritize them take guardianship so they at least feel like a priority to someone.",
            "It's her job and your father's--not yours to make the effort to be accepted in \"your pack\". She has to show that she cares too and that shouldn't fall on the kids' responsibilities and obligations",
            "One thing you might consider is telling your dad how you are feeling (depressed, isolated, overwhelmed, awkward with a new person in the house, anxious about having a new adult female figure in the house given your relationship with your mom) and telling your dad you think you need to talk to a therapist about everything. \n\nYou sound like you're overwhelmed and like you need an impartial adult to talk to  and help you sort out everything that you're going through right now. It won't necessarily make everything better at home, but it will give you a safe space to unpack it and give you some tools to cope with an uncomfortable time and situation.",
            "I’d suggest talking to your dad and asking him for a formal introduction and to HELP you get to know each other. Like he can cook dinner you all sit down. He can set up movie nights where you show her your favorite movie. \n\nHe might think that he’s giving you space to get to know her on your own time but doesn’t think you’re trying. Meanwhile you need him to help.",
            "I dont think your dad should have \"asked\" you, but he should have discussed it with you first. Efforts should have been made to ensure that everyone was comfortable and the transition smoother. I would suggest talking to your dad and expressing your concerns. \n\nBeing in a blended family is difficult. For all people. Starting with being polite/friendly is a good start. And something everyone should do for roommates. Hopefully your dad sees where he went wrong and makes efforts to help everyone get to know one another more. \n\nBut also I think some empathy could go a long way. Being a step parent is difficult. So your understanding that and trying your best would be awesome. And being a step kid is difficult. So their understanding that and trying their best would be awesome. Everyone has to give a little here if you all expect to move forward.",
            "Oh man, that's a big expectation on you.  I'm sorry you're going through that.  I'm a mom and a stepmom and what your dad is expecting is unreasonable.  Its perfectly fine for you to just be polite and kind to this new houseguest when you see her around.  You arent obligated to more than that.  If you think shes nice and want to maybe help with dinner or watch TV together those things are low stress activities, but dad and girlfriend are going to have to get over it.  \n\nDad was wrong to spring her on you and dad was wrong to lecture you after he did that.  I hope you're able to get some help for your depression.",
            "\"Dad, it feels like I'm living with a stranger because I *am* living with a stranger. I don't know much about her and she and I have never hung out. If you want her to be part of the family, then we need to do things together besides *coexist*.\"",
            "The best thing my dads wife ever did was give me aaallll the space I wanted. She never pushed for a relationship, and I respect her for that so much. \n\nI’m sorry the adults in your life are putting this on you. You’ve been dealing with it absolutely correctly from what you’ve said so far. Would your dad take it well if you showed him this post?",
            "I’m an adult in possibly a similar situation someday (as the new girlfriend of a man with three daughters.)\n\nI would never move into their space without a good long period of time to get to know the girls. And I would also want to have a discussion with all three of them about how they felt about me, like, moving in to the home they share with their dad. To make sure they were okay with it. \n\nPlease just do the best you can with the situation. It is not your job to be the welcome wagon for the girlfriend. Definitely be pleasant, but personally I would wish the adults in this situation had been more proactive about setting the situation up to succeed.",
            "The GF has to know how strange it is for you guys. His expectations of you are unreasonable and he’s not being understanding/nice about this new, unexpected situation he put you in. I think you’re doing just fine. You can’t force or fake something you don’t feel. I honestly think it’s on her to build a relationship and help YOU adjust. Not the other way around. She’s a big girl.",
            "Your father is being inconsiderate of your feelings and your young so obviously 🙄 things like this are going to affect you in this way \n\nThe fact is wether your father choose to ignore this situation or not she is yes a stranger at lest if he wanted this transition to be more appropriate then he would of actually built up this relationship not just throw her at you \n\nI think your dad knows that it’s not okay with you guys but obviously it should be obvious that your trying not to hurt his feelings \n\nBut he has no right to judge you or yell at you because you have those feelings beyond you just being his daughter you are also a human being who has the right to feel whatever it is your feeling i can’t tell you how you feel or how you should feel \n\nOverall maybe it would help to talk to your mom and maybe see if you can talk to a councillor at school that’s a lot of baggage to carry on ones shoulder",
            "First of all, this isn’t on you at all and it sounds like an uncomfortable situation for you and your siblings, I’m sorry you’re in this boat. \n\nDoes your dads girlfriend know about the situation with your mom? (Does your dad know how bad your situation with your mum is?)\n\nIt’s rough not being able to see friends right now, and I totally understand your depressed feelings. \n\nYour last paragraph honestly is perfect. Would you perhaps feel comfortable saying something along those lines to her? Perhaps if you use the term “new person” instead of “stranger” it softens it a little bit too. \n\nAs the adult, it’s on her and your dad to make you and your siblings feel comfortable, but hopefully if you let them know you’re open to it, they will do just that",
            "As a single dad, I would definitely let my daughter get used to a prospective partner BEFORE the living together phase. In all honesty it would take a while to even get to the point of introducing a new partner to my daughter. \n\nYou are allowed to be you. And you are allowed to take your own time to warm up to someone and get used to them. This is his fault, not yours.",
            "It's his job to make you guys feel comfortable with the woman he just moved into your family's house, not the other way around.",
            "You're fine imo, your dad is asking too much. He wants a cohesive family instantly for his own comfort, but that's just too bad. He should have been more considerate if he wanted more consideration from you.",
            "I want to give the benefit of the doubt and say we don’t know the father’s side of the story here. We don’t know if the GF has been trying or if the father has been trying to get everyone aquatinted or not. \n\nThe only advice I can give is that the relationships you form are dependent on you. If you don’t want a relationship with your dad’s GF you don’t need to try to form one. If you want to alleviate being awkward with her you’ll have to become closer to her. And you also serve as a role model to your younger siblings in this regard. But with any relationship it’s a two way street so it’s not just up to you either. So I wish you the best in working things out here",
            "tbh it’s not your responsibility to get to know her. She should, as the adult, be making the effort to have a relationship with you and your younger siblings. Since your dad already had kids before they got together, she should know that she’s not just signing up for a man but she’s signing up for a family and treat it like that.\nThis is a big change for you guys I’m sure. And if you have bad experiences with parental figures in the past, it makes a lot of sense that you are feeling this way. I would say that you have to approach every person with an open mind. If she’s making an effort to get to know you guys definitely keep being polite. But honestly if she’s not making an effort idk why you should be the one responsible for it; she’s pretty much a stranger until she initiates. If she’s being rude, that’s completely on her and not your fault.\nPerhaps bring up to your dad that you don’t know her as much as he does, and that you are open to getting to know her as long as the communication is reciprocated, and if she’s willing to make an effort. He probably won’t understand if he continues to react the same way he has been to you...but it’s worth an effort",
            "It sounds like your dad is an a$$holio",
            "You’re dad seems to be focused on his love life, and doesn’t seem to understand that this will be a weird transition on his kids. I was in a similar situation when I was 14, but the even better part was is that my mom was also living with us (in a separate room from my dad) that was fun. \n\nAnyway, communication is important. I would just let him know that you need time, just as you would with anyone else such as a new friend. You still have to get to know her but it will take time.  Especially with how the world has been. When my dads girlfriend (now wife) first moved in, we had an awful relationship and I never wanted to be around her. 6 years later, I definitely see her as family. Relationships take time, but don’t feel bad for being uncomfortable or just wanting some space - it’s a weird situation and a weird time we are living in. Good luck, I think you’re doing great so far!\n\nEdit: both my dad and stepmom apologized many times for their actions for how they moved in years after. They thought it was the best timing at the time, but learned that it was a mistake.",
            "My mom did this to my sister and I as well, except it was with my stepdad. I was 13/14 at the time, and it was explosive because of our contradicting personalities and beliefs (and me just being an angsty teen). If you do not feel comfortable doing anything other than exchanging pleasantries, that’s a valid way to feel and is 100% okay. In my personal opinion, she’s technically invading your space, you’re not invading hers. Your home is somewhere you want to be comfortable. Overall I would take things slowly and see how they go. If you continue to feel like you and her do not vibe well together, coexistence is fine. I know your dad got upset about making her feel welcome, but if it’s a choice, you can have a private conversation with him regarding your feelings once everyone has settled into the living arrangement.",
            "Oh my fucking wow, “dad acts like inconsiderate, impulsive teenager and puts everyone out, makes them feel awkward in their own home, and then puts the burden of being an adult, fixing it, and doing what he should have done on actual teenagers.”\n\nYou need to tell him this isn’t your job or your problem. He decided to do this like this. He can do the work to make everyone comfortable since he failed to have conversations up front. This fucking grosses me out to no end. I’m so sick of these grown ass men putting their romantic relationships above their families and then trying to force everyone to normalize their cringy behavior.",
            "Your father should have discussed and give you and your sibling some time to develop relationship with his girlfriend.\n\nI was in a similar situation and it was not pleasant for me. First time was when my dad pulled me out of boarding to school to live with him and his new family (his second wife and a 3 years old). At this point, he has been remarried and had a child without my prior knowledge. So I went from being in boarding school barely see any of my family to living in a family that is almost like a stranger's home. Second time was when my mom moved me from my father (Thailand) to live with her in the US. I knew that she had been married and have my half-brother already, but I never met my step-dad or step-brothers before. Adjusting to living with my step father and also adjusting to American culture was really difficult.\nThe result was that I ended up having very distant and little contact with my family. \n\nI would sit down with your dad and talk to him if possible.",
            "I ignored my stepdad for the first year he lived with us (I was a senior in high school) It’s uncomfortable AF and there’s no way for it not to be. I would say “you should...” or “you could...” but it really just takes time. She’s one of the adults here. I think the onus is on her and your dad to help ease the transition.",
            "> He said that she wasn’t a stranger \n\nShe's not a stranger to **your dad** but he needs to realize that she is absolutely a stranger to his kids.  His kids weren't born with ESP and can't read his mind and didn't somehow telepathically absorb his knowledge of her.  It's your dad's responsibility to bridge the gap, make her feel welcome but he's failing in that respect 100%.  He's making no effort there.  He's completely dropping the ball.\n\nSince talking to your dad is as effective as talking to a wall, I would suggest one of 3 things\n\n1. Stop talking to them period.\n2. Go move in with your mom is that's possible\n3. Talk to the gf.  Tell her straight up that she is a stranger to you and your siblings and presence is uncomfortable.  Since you talking to your dad hasn't gotten it across that he has done absolutely nothing to bridge that gap and it is his and his responsibility alone to initiate that, maybe if she says it to your dad he'll listen.",
            "Some suggestions on bridging the gap: try having a family dinner, or a family game night; pick a lazy Sunday and show her old photos of you/your sibs (school plays, fav birthdays, visiting grandma? Even stuff that you don't see as important); do a movie night where everyone shows their favorite movie, start with the younger siblings; make a meal together, maybe she has family recipes she wants to share....\n\nIt can feel like an uphill battle, but you're showing that you are willing to get to know her. She also has to be willing to get known! It's also important that your dad understands that he can't just \"add lady instant family!\" - in a way, she has to do the whole \"dating\" process with his kids (you and your sibs) you're not an optional part of his life! You and your dad could maybe look up resources about divorced families and new relationships.\n\nIt's a lot, but be willing to show that you're not trying to be a difficult teenager, but this is a huge life change and you kids need to be respected as equal members of the family.\n\nGood luck!",
            "You don’t have to be anything other than polite. This is a HUGE boundary bash and your dad sounds like he doesn’t give a shit.",
            "I went through the exact same thing 6 years ago, I was also 16. The only thing I can tell you is have a heart to heart conversation with your dad and hope she moves out",
            "Be as pleasant and positive as possible for 2 years then move out.",
            "I personally feel like I don’t need permission to do anything in my own home and my relationship, with anyone, should be built with that person and not based off another’s experience/relationship/opinions. You can try talking with him about how to appropriately interact with her but unless she’s asleep in your bed I would not insult his judgment.  \n\nIt’s inconsiderate to move in someone without a conversation but your dad doesn’t owe you or your siblings anything concerning his partner. It is reasonable for him to ask you to use your manners and build your own appropriate relationship with her the same way you meet new people (it seems extremely childish that you’re making a point to not be friendly and only cordial yet avoidant). \n\nLearn about her by simply talking to her. Be polite, honest, and sincere. Don’t assume anything negative without solid proof. She may be human (good and bad) but that doesn’t mean she’s out to harm or abuse anyone.  \n\nLastly, get out of your own way. She may end up being a really nice person to have in your corner especially considering your poor relationship with your mom. She’s not your mom so it’s a clean slate to have femme energy that is nurturing and caring (but you have to be open to the possibilities.) \n\nAsk her to tell about herself. Seek a connection so that she feels welcome in your father’s house.",
            "[deleted]",
            "My parents have been divorced for years and all I could ever want is for my dad to meet someone again that makes him happy. I can't speak for you because I'm not in your shoes, my parents have been single for years since the divorce, but I do know it breaks my heart watching my parents be so alone. Especially during covid. Everyone needs someone. I think its better over all for your dad to have someone there for him to support him, rather than being alone. Does she treat him well? Does she make him smile? Is she worth getting to know ( at your own pace, when you're ready of course )\n\nI would have a talk with him about expectations. You should want to compromise and coexist, but it isn't really fair for him to expect you to go out of your way for anybody if you are not comfortable yet- as long as you're respectful and not snobby. Him adding pressure wont help, the relationship should come naturally. When anybody over thinks it its going to feel more weird.",
            "You’re dad should have done things a little slower & not sprung her on you\n\nHowever, the parent does not as children for permission.",
            "Every person deserves a chance. Your dad wouldn’t bring her in if he didn’t trust her and a stranger is someone no one knows anything about. This woman is not a stranger danger. You don’t have to treat her like your mom because she never will be and you don’t have to be her friend but every person deserves respect and a chance to prove they are good, to you. \n\nYour dad shouldn’t be mean or force this confrontation on you and you two should be able to have a healthy open like of communication, judgement free. That’s called a family.",
            "His house, his rules. There will be some adjusting to the new situation. Make the best of it and get to know her. Could be a lifelong friends/parent figure.\n\nHonestly, most parents don't sit their kids down and ask. Usually it's telling the kids.",
            "You say she seems nice so let's start there. She's not your mom. She's not trying to be your mom. But she is obviously serious about your dad. I'm sure with the pandemic you didn't have normal opportunities to have spent time with her the past year, but now she's living in your home. She's probably feeling as uncomfortable as you or more so---there are 3 of you kids and only 1 of her and I'm sure she feels unwelcome and is likely trying not to step on anyone's toes or assert herself too much. If she seems nice, try talking to her. It's not your responsibility to make her feel welcome (dad's wrong there) but it might be more pleasant for you and your siblings to increase your comfort level around her and the only way for that to happen is if you allow a relationship to develop. Start simple. Ask if you guys can all bake cookies together or make popcorn or something. If she's part of your home you may as well try to get along instead of accepting the fact that it feels weird and leaving it at that.\n\nDon't judge her or all \"older women\" by your bad relationship with your mom. Surely you've had an older female teacher you've liked at some point? Even if you haven't give this woman a chance.",
            "You shouLd pLay it caLmLy and not rush with anything coz onLy tiMe can teLL if she is good or bad :/ aLso you shouLd try to avoid feeLing awkward around her coz tht wiLL aLso make her feeL uncomfy around you and might create bridges :3 it is important tht you give her a chance coz not everyone is same and not every step parent is bad ^_^ try being positive and induLge with her",
            "Your dad doesnt need your permission to move his new partner in. He’s the adult and it’s his house.",
            "I get it. You are 16 years old and she is not your mom. She isn’t your mom! Even though you don’t necessarily get along with your mom, you might feel a bit of a betrayal to her if you’re kind with his new girlfriend. And that is a very normal way to feel.\n\nI should get one thing out of the way. He does not have to ask permission to bring his girlfriend into his house. It’s great that he’s trying to see that the two of you or all of the children and his girlfriend can get along. And no you do not have to kiss up to her. But if she’s nice and if she treats you well then it won’t harm you to treat her as well as you see she’s treating you. I’m not suggesting that she is to replace your mom. But she may be able to help you out with things that any other mom could do, just because of her age and experience.\n\nI am really glad that you took the initiative to speak kindly to her even if it is just in a minimal way. That is the least you can do, and you were mature enough to have recognized that. Think about this. Things won’t get worse if the two of you do happen to get along. It could bring your dad and your siblings  and you  together. It may not be a bad thing, so give it a chance and see what happens.",
            "Wow... all of this shitty advice. Your dad is a human too who wants to feel loved and be around the people he cares about. You absolutely should make a effort to get to know his new love interest. It’s stressful, it’s hard to move on, and it is sudden however that’s not an excuse to do your best to make the situation better. Should this man live and die alone? Don’t let your selfishness ruin what could become a beautiful relationship, your father absolutely does not need your permission to move forward with his life.",
            "[deleted]",
            "Not trying to me mean but your dad needs a partner so do your best to support his goals and help him help you, get to know the lady.",
            "Get a job and move out love lol as awful as it is u still can't do anything I assume she helps with finances do you help with ur father's finances ?",
            "Since you’re probably going to have to deal with her living there regardless, I would suggest just putting in a little extra effort to try to get to know her. Maybe she feels awkward too and wants to get to know you, but doesn’t know how. Do you guys have any board games? Maybe some game nights would help break the ice and create positive memories and pathways to get to know each other better :)",
            "Moving in the new girlfriend with 16 year old girls in the house? Can't tell if your dad is stupid or just an ass.",
            "You don't have any obligation to make her feel welcome anymore than she does to impress or mother you, you already have a mother. There's no reason not to be civil and maintain communications with her, you could end up good friends. But your dad sounds like a piece of work so if I were you I'd get a job after school so you can move out at 18. If he wanted the happy family unit he should have tried harder with your mom or realized it wasn't a match in the first place before destroying his children's sense of security in their own home. You're onto something not trusting people of their age as they tend to think that being too cheap to pay for birth control means you owe them something, you don't. They put a roof over your head and clothes on your back yes, but more because they didn't want to be viewed as the pariah they really are by their peers. \n\nHowever you do owe them civility and courtesy, if it gets bad, and I mean actually bad not what most millennials call bad, but actually bad, don't hesitate to contact child services or the Police. Asking you to help make her welcome is one thing, thinking it's your duty lets anyone with a brain know exactly what kind of person he is, and if she's in love with him then you know exactly how she is too. My advice, start becoming independent now and seek counseling as soon as you're on your own so you don't project onto your own children some day.",
            "Not your fault, is your responsibility. As the eldest sibling you set the standard for your siblings. This person (to your testament) has not done anything specifically wrong, so is worthy of a chance. \n\nYes i agree with the general comment that the quality of the relationship is mostly on the shoulders of the adult, but at the same time youre 16, which is more than old enough to warrant bearing some weight and give the relationship with your fathers partner and your potential step mother some energy and a good chance.\n\nIf youre wondering how to do it, general comment is give a warranted degree of presumed respect, respect their relationship and be courteous about any trivial changes the household makes. Pick and choose which changes are too much wisely, and above all else remember that while your feelings of awkwardness are warranted, it might be just as hard for this person to come into an established family, she probably feels like an intruder. Make her feel like a part of the team (assuming she deserves it) and like i said at the start set be a role model for your siblings.",
            "You don't have to act like being her daughter but try to get into your father shoes and at least try to make the environment nices for everyone. Being honest with her might help I guess so she won't try to act like something you can't embrace",
            "It sounds like your dad is trying to glaze over that fact that he kind of shoved this on to you guys regardless if it was a good idea or not. I'm not entirely sure why dads do this... my dad did the same thing. The girlfriend and your dad need to grow up and realize it's on them to facilitate a relationship, not you and your siblings.\n\nI'm sorry about your mom. My parents divorced when I was 14 . Her and I did not get along and had a strained relationship for a while and my dad brought his girlfriend in pretty much instantly. I know how your feeling and would gladly lend some advice if you ever have any. Just DM me and I'll respond the best I can. Best of luck. Just remember that unfortunately your dad is wrapped up in her. If things go south, he will unfortunately choose her side. Hang in their kiddo.",
            "I'm on the other side of this equation, moved in with my gf and her two children 13m/16m.  It is ackward. It's been less than a year I think they are coming around and realizing liking me is not disloyal to thier father.  That it makes thier mother happy, and doesn't take away from thier relationship with her.\n\nGive it time and give her a chance, remember your father loves her, she makes him happy.  Having another adult in your life can enrich it, you can embrace that without being disloyal to your mother",
            "I understand how difficult it is for you and your siblings, particularly in the times when we are forced to spend our days at home. However one thing to keep in mind: your father’s life is his private affair.  Whilst he should (have) introduced her to you before she moved in, he shouldn’t be expected to ask for your consent as it is his choice and his responsibility. In a few years time you will be living on your own, and a decade thereafter might perhaps consider moving in with someone, too, and then it will be your choice.\nWhat is important of course is that if find that your father’s girlfriend is not nice to you, you should tell him immediately. Otherwise just be yourself and if she tries to befriend you try to find it in your heart to accept.",
            "Try interacting with her more. Maybe do something together like a movie or baking. If she seems nice, give her a chance. Blanket weariness towards older woman isn't healthy long term.",
            "Dad should have waited \nuntil his kids are 18 and out of the house.",
            "He doesn't have to ask your permission. They're adults and you're a child. Yes, he should've run it by you but in the end it's not your decision to make. If she's not rude or outright abusive towards you then you need to accept her. Your dad is entitled to a life with someone who makes him happy and he shouldn't have to sacrifice that because you have a problem with it for superficial reasons.",
            "Maybe you and your siblings could write him/them a letter, where you express your feelings about the situation? Then give it to them, and you three go out so they can read it, digest it and calm down, before you all talk about it? It also gives you a chance to be careful with how things are said, and not make it to harsh for him to understand (my experience as a teenager with a not so great dad, was that when I got angry, he basically checked out and didn't listen to what I said).\n\nAlso consider talking to an adult from your school about it. I know covid makes it harder, but maybe you can ask a teacher or counsellor to call you?",
            "Parents deserve to be happy and have full lives, and that includes relationships. \nAlso, a parent does not ever have to ask any child for permission on anything. \nThat being said, it is always a good idea to gauge how the person you are dating is around your child - anyone progressing to the serious dating / moving in phase is a potential step parent, and they must be willing to be that and to act like that every day - legally wed or not. \nI share custody of my 11 year old, and it has been no less than a jungle to navigate introducing her to someone I am dating, and then if we move in together / get engaged / get married, etc... It takes care, communication, compromise, and commitment. But in the end, a new family can be built.",
            "He pays the bills so he didn't have to consult with you about it before moving her in. Would it have been nice to give you a heads up? Yes, but not necessary. As far as making her feel welcome, that's up to you. The best way to deal with it is to accept that he's doing what makes him happy and be nice to her unless she gives you a reason not to be. You will be able to get your own place in 2 years",
            "I wouldn’t be annoyed at all, would just have to get up to Pee first 😂",
            "I think you should say the last paragraph of what you wrote out loud to one or both of them, and then maybe ask if theres something, aside from saying welcome, that you could do to make her feel more welcome. This is really on your dad but it sounds like he lacks the skills to do it. \n\nSometimes, when adults are confronted with strong feelings, they get straight up stupid. Say what you feel and be completely honest and forthcoming and transparent. Then be like: \"ok your turn\". \n\nGood communication goes a very long way.",
            "Your dad should have out work into creating a relationship with you guys.  You don’t have to love her, but yeah, she’s a stranger in your house. Good luck.",
            "You need to explain to your dad why it wasn’t okay for him to being her in if you guys didn’t know her very well and didn’t even ask if it was okay. Let him know there will be an adjustment period but you’re sure you’ll come around. Don’t lie though. If you don’t think you will, be honest. But from the sounds of it shes nice enough and likeable. Also tell him its a 2 way street. If she wants to talk to you she can. It shouldn’t be you, a child putting in all the effort. Shes an adult and if she was the one that went to your dad and said you weren’t talking to her, she needs to step up and act like one.",
            "Oof. I'm sorry this is happening, OP. Like many others have stated more eloquently: this is not on you. You are minors, and it's not your job to make the adults feel better about their choices. Your father has not figured out that you can't force this kind of relationship. \n\nBut you and your siblings are stuck in this situation and now you're trying to navigate uncharted territory. \n\nTo that end: your feelings are valid, especially in a pandemic.  Feeling depressed or uncomfortable is valid. \n\nAs others have mentioned, talking to a counselor or other adult may be helpful. It may allow you to find someone to advocate on your and your siblings' behalf. \n\nHaving a safe space of your own may also be helpful. If you don't already, a locking bedroom door may help give you a sense of privacy and stability. \n\nThis is good time to support your siblings. You're struggling with this transition and they have less life experience than you.",
            "Seems like a huge change with no prelude or forewarning. Were there no introductions? It's just \"Hey, this woman is moving in\" out of nowhere?",
            "I see the issue is with your dad and his actions vs his girlfriend. You need to address it with your dad in a calming way. You know him and you know the appropriate approach I'm sure,  so I won't coach you on what to say but the conversation needs to be had. After that,  as the older sibling,  its really important for you to be open to getting to know her imo. Your younger siblings will model after you,  so if you are standoffish, they will too. This won't improve anyone's life just co existing. Your mental health as well the rest of the family's will be better if you can all enjoy life together as a unit. Now I don't know this lady,  but she might be a super awesome woman who could be a friend to you and your siblings,  (I'm sure she's not trying to replace your mother. ) soon you may be leaving to college or adult life,  but your younger siblings may continue living with her for a few years to come,  I'm sure they could benefit from a positive female role model in their lives. Sorry to put that on you but how you treat her will set the tone for your siblings.",
            "Ultimately it's your dad's decision but I can't imagine he wouldn't discuss this with you first. And I mean like months ahead of time, like \"things are going well and we brought up the possibility of living together if things continue to go well.\"\n\nThis would give you time to prepare, as well as meet the other person  and get to know them a little better. He also should have taken your concerns into consideration, even if he ultimately decided against your wishes. This too would have allowed both of y'all to see potential problems and brainstorm potential solutions, making the transition easier.\n\nBut ultimately is was your father's responsibility to talk to you about this, and it is your father's fault for not doing so, not the fault of  his girlfriend. I would try your best not to hold your father's mistakes against her.\n\nAs far as how to coexist, when you are ready you should sit them both down and discuss these issues with them. Write down all of the points you want to say first. If you are not ready for that maybe write each of them a letter expressing your concerns, but try not to be accusatory, don't write \"and you did A,B,&C and that was wrong...\" Rather write,  \"when she suddenly moved in without me knowing ahead of time, it made me feel...\"\n\nLet them know how you feel and where your boundaries are. You might not be an adult just yet but you almost are, and as such your dad needs to start respecting you as an almost adult, which essentially means treating you like an adult when the situation calls for it, and this is absolutely one of those situations.",
            "Your dad screwed up by not introducing her more gradually. He also screwed up by putting this on you. You (and she) are left to make the best of an uncomfortable situation. The easiest way to make things more comfortable, in my experience, is to make friends. It doesn’t have to be best friends, or even casual friends. But in your life there are people you’re going to see regularly who are friends of friends or significant others of friends, or of relatives. They may not be your favorite individual, but yet you have to be social (or familial). Be as friendly as you can manage, and try to find something to talk about. Make spending a little time together as pleasant for each of you as you can. Ask them about themselves. Tell them small amounts about yourself. \n\nThere are friends of my friends whom I find  annoying, superior, or awkward, or whatever. But I wind up enjoying the 10 or 15 minutes that we talk, because we have found a little common ground. Neither of us would call the another to hang out, but for those social events, we can deal.\n\nI know this may sound like the opposite of what you want. You are uncomfortable and probably unhappy, and you want people to know. Being nice does not compute. But as stated, you can make the best of a bad situation. Making it worse is not in anyone’s interest.",
            "I can understand how this must feel awkward.Try to make the best of the situation and give her a chance. You mentioned that she seems friendly so try to get to get to know her, then it’ll feel less like sharing the house with a stranger. Probably it’s a strange situation for her too so you are in a way in this together. \nThis could be a chance for you to make a more positive encounter with an older female.",
            "Your father has confused his relationship with her with your relationship with her. He thinks because he knows her well and likes her, that you should feel the same way. \n\nAnd to be blunt, because they are having sex, she has a control over him that is not logical. You are handling this fine. She’s not your replacement mom and, other than being polite, you don’t have any responsibility to her. The adults should be the ones trying to make this all more comfortable.",
            "your dad is disrespectful as hell. this is your house and your siblings house, too. you should have the right to get to know someone before they just like. start living in your home. it’s weird. it’s awkward. your dad fucked up lol. \n\ni’d start by trying to spend some time with her outside the house, maybe at a park or you could order take out at a restaurant and eat in the car? spend time with her alone, and makes sure your siblings do too. it’s going to take a lot of time to get to know her since your dad wasn’t responsible enough to do the work of making sure you guys already had an established relationship before moving her in. make sure to stay curious towards the situation and try to keep an open mind. good luck!!",
            "You are already wiser than your father. Sorry for you, but you will manage, wish you strenght and fun",
            "Your father did the wrong thing. Maybe you and your siblings could all sit him down and explain how this makes you feel together?",
            "They should have given you time to meet and get a level of comfort long before she moves in.",
            "\\> Recently, my dad has asked me why I haven’t talked to her more and I  told him that I’m not that outgoing or talkative with strangers.\n\nI would have just told him, \"I feel uncomfortable having a near total stranger suddenly living in my home with me. To you, she sure isn't a stranger, but she is to me. It hit us a bit hard that we were never consulted before you moved her in.  I'm having a bit of an adjustment period with it, and I'm going to need some time.\"\n\nYou are not responsible for any of this. It is not on you to break the ice and make her feel at home. All you need to do is be cordial as long as she is at least cordial to you. This is 100% on the adults in this situation, especially your father. HE is the one who needs to facilitate this, and he should be putting the situation and feelings of his children first before anybody else's. If he isn't, then he is failing you.",
            "Your dad  hasn' t considered that they are pushing a instant relationship, that will only happens if you have had a chance develop one. They need to back off!!!!! Nta",
            "Your dad is likely aware that it was a bad idea to do this, but it's possible it was rushed because of the pandemic. He might want you to try and pretend like it's okay to validate his decision.",
            "I feel like maybe asking your dad if you and your siblings can have a conversation with HIM without her being there to clear the air and basically say that you need a bit of leeway to figure out this new experience. Say how you feel and that with how things are with your mother it makes you feel cautious but you are trying your best and I'm sure he will understand and give you a bit of a break!",
            "OP, can you talk to a counselor from school? Maybe talk to your dad and the gf together and say something like, \"Look, gf, you seem alright and, Dad, you like her, so that's good. We (OP + siblings) don't know her as well as you do, but it isn't like we are against getting to know her. I understand a little better than (siblings) because they are just little kids, but it is going to take time for all of us to be comfortable with each other. I'm sure she's a little uncomfortable, too. Trying to rush things just puts another layer of weirdness over it for everyone. Maybe we can just build it up one day at a time? That's how \"They\" say the strongest foundations are formed.\"\n\nI don't know. A real counselor can tell you if that's a good idea or not. But if you say it like that, you are letting her know you didn't hate her on sight and you aren't working against her. You are also telling your dad the same thing and maybe showing him how ridiculous his expectations are without saying \"Dad, you're stupid \" And you will be approaching them in a way that shows that you accept that they are a couple and you aren't trying to play kid games.\n\nI guess that's what I, as an adult, would do. And since you're expected to be the adult here, it seems like the best thing to try first.",
            "As someone show is a mom on the other side and has been there. \n...\nIts always hard when there is a new environment.   Being a parent and being lonely and finding someone you actually love and loves you... then being so worried because your kids are your world and your 1st priority.    Holy crap. I have to introduce this person to my kids. I’m torn becomes I love them both. ...\n\nIs it because she really isn’t a good person. Treats you bad. And is sincerely no good for any of you....\n\nOr is it “im not sure how to navigate this space. .. I’m not sure how I feel about my dad having a girlfriend he lives and wants to live with. “”\n\n...\n\nI don’t think I’ll ever get married again. It was a traumatic experience. My ex and I are friends and super co-parents. ...\nI am a 42 yr old women who found the live of her life at 39!!! \nMy BF and I are Princess Bride Level True Love. \nMy kids were so young when we got together and they accepted because our Familiar. Our Cat 🐈‍⬛ accepted him with flying colors. \n\nChange is hard. Us parents are just teenagers..(boy crazy doesn’t go away until you find the one) \nTrying to find their person. \n\nBe discerning, but also see how they are together. Are you upset because she is new and different. \nOr because she is a not a good person. (“You hurt my dad I will FU-Up!” Lol) \nThink about your dad as a teenaged friend. Is it a toxic relationship? Or is it love and it’s just uncomfortable because he’s your dad. \n\nMy 2 scents being on both sides of the coin in my life. (My mom died at 7 so got a new mom at 11.5)",
            "Had he never brought her around before she moved in?",
            "My sister is dealing with a similaie situation as well right now. The difference being she loves my mom still as well and my parents got divorced a few years back. I currently live with my mom but my advice would be simple. If you love your dad and have a good relationship with him just support him as much as you can. It may be uncomfortable for you and I understand why but unfortunatley your dad is going to do what he wants and obviously did not care about asking you or your siblings how you felt about this. Its tough I understand but just try to treat her nicely but not get to close either. you can definatley treat her kindly and yet not really have a relationship with her either even if you live in the same house in closd quarters. Just try and do it for your dad and things will work themselves out I promise. You may end up even coming to like this woman eventually so no need to upset anyone involved here so early on. Please let me know if I can be more specific or help with any other issues regarding this that you may have. Best of luck hang in there kid.",
            "Probably just go talk to her - not in a best pals kind of way like your dad wants you to, but in a \"Hey so we have to coexist now, let's try to make sure it doesn't suck for either of us\" kind of way. Because I'm pretty sure she feels kind of outnumbered and like here's these kids and is she supposed to try to parent them or what?\n\nYou also might ask your dad to explain what \"making her feel welcome\" means to him. It might turn out that what he wants isn't all that annoying. \n\nLastly, your siblings are totally justified in feeling like there's a stranger in the house, but there's unfortunately not much you can do except try to turn her into not a stranger. Maybe play some board games with her or something? No one can or should try to artificially push you into having a family type relationship with your dad's girlfriend before you're ready to, but if you can at least feel a little bit more familiar with her it'll make everyone's life easier.",
            "It will get better. Try playing a board game with everyone. Itll get way less awkward as time goes by",
            "Like others have asked I want to know how long you have known his girlfriend before she moved in. What did you dad say when she was moving in? Has she made an effort to socialize with you and your siblings? Was there a necessary reason for her to move in? Things are difficult right now and sometimes people are moving in due to covid, loss of employment/reduced employment or to help with kids that are taking classes online.\n\nYour dad shouldn't have moved her in without introducing her to all three of you and making sure you all get along. However, for kids sometimes there is never enough time to feel comfortable. Your father and his GF are the adults here and should do a better job at facilitating the situation to make things easier. However we don't know if they are doing all they can and you're being resistant or if they aren't even trying and expecting you to do all the work. Regardless since she is living with you then it's best to do what you can to make the situation better. Think of things you enjoy doing or your siblings enjoy doing that all of you could do together: watching a movie/tv, cooking, playing games, going for walks/bike rides/hikes, playing sports, etc. You could also set time aside for the two of you to just talk (this doesn't really help with the siblings though). You can also consider doing things around the house together, cooking or cleaning. If she's cooking then definitely take the time to learn from her. If she's not cooking and your dad isn't cooking then maybe you can see if you two of you could cook together. I bring up cooking because it's a good activity to do together and it's one of those things I wish I learned more before living on my own.\n\nI understand being wary of older women and it's fair to be hesitant if you don't want to become too vulnerable, but talking with older people can be helpful. I know that as a teenager you really want to talk with your friends, but talking with someone older can sometimes be an interesting experience. I appreciate what I've learned from those who are older.",
            "I know how you feel  My mum moved her bf in without asking me or my sister too, despite stating before she'd never do that. He should have asked you and your siblings directly if you're comfortable with taking such a major step. Furthermore he is trying to put the onus on you for building a relationship which is totally unfair. So don't feel guilty here whatsoever. Sounds like you're handling it fine so far.\n\nJust try and communicate your feelings directly to the both of them. You're well within your rights to be uncomfortable at what has happened here, it's clearly been rushed. I hope they will be the adults here and take your feelings on board. Things will work out better further along the line I would think  Good luck, making this post and how it's written shows a great deal of maturity.",
            "I've been on both sides of this as a teen my mom moved her boyfriend in when I didn't have a relationship w/him, I hated him he was loud, rude, and abusive, but not to me in front of my mom. She didn't ask and I never expected her to as she is the adult and it's her house. That being said I had a bad relationship w/my mom at that time, because I didn't know if she would listen to me, or care how I felt, yrs later after we talked she says she would have put him out but who knows if she would have at the time. I was just polite, took care of my brothers as was expected, and stayed in my lane, I never tried to have a relationship w/him because I didn't like him, and the way he treated me. (She is now happily married for 25 yrs to a different man who treats me as if I'm his own.) I was 13~14 when this happened.                                                      I have also been the girlfriend who moved in w/my 2 kids and his kids( only 1 lived w/us fulltime the other stayed living w/his mom) his daughter moved in shortly after I moved in, her life w/her bio mom was bad, I treated, loved and accepted her as my own. I made it clear she had a mom, I'm not here to try and replace anyone, but in our house I'm the mom, it would be our rules, that we as parents set together, for all the kids to follow. I spoke to my daughter everyday before she moved in, if she was having a bad day she called me, if her bio mother was being abusive she called me. So we had a great relationship but I made an effort to have a relationship, and so did she.                                                                       My suggestion is speak to your dad openly and candidly, don't hold back about how you feel, why you feel that way, and tell him your siblings are feeling uncomfortable as well and voice their opinions to him too; but don't be disrespectful, he being the adult doesn't owe anyone an explanation or need anyone's permission. He should have however made an effort for you to build a relationship w/each other, before just moving her in, and her being an adult should have thought about having a relationship w/all of you so that everyone is comfortable. My advice is just sit and have a open conversation w/your dad, explain why you feel the way you do. As a parent I don't get angry w/my kids for their feelings, and when they explain why they think or feel how they doI usually get it. I'm open minded and realistic too. I'm sorry he failed to do it better and you feel so uncomfortable. I pray you get to a place where you all can live in peace and happily.",
            "It's going to feel uncomfortable for a while. Even if you knew way in advance it would likely still feel odd.\n\nIt will take time, and probably effort all round (it takes two to make a relationship) but you don't have to force it. Take it at your own speed, and tell your dad to be patient",
            "Look, the best you could do you’ve done already, I wouldn’t stress about it really, your siblings and you could make conversations more productive by just speaking about what you’ve done today so far like what you learned at school that week, or something new you learned at your job this week, or if you started a workout routine, read a article or headline from Instagram or Twitter, that could make things less awkward around the house",
            "Jeeeeez. Tell your father that it is very unacceptable to move his girlfriend without even having a constructive dialogue first. He needs to understand that although he might think he is doing the best he can, he is hurting every relationship involved by just throwing a new girlfriend into the mix without really talking about it",
            "It shouldn't be on you to do this since you are a kid, but it might actually help you feel less isolated if she is nice and you can form a new friendship. I would call a family meeting and calmly explain that while you want them to be happy they blindsided you and you and your siblings are young and overwhelmed by the change especially right now. Then I'd agree to try to get to know her and make an effort and maybe everyone can come up with fun stuff to do that could make the relationship less awkward. Cooking, watching movies, boardgames, etc. if its possible to form a relationship it could be great. I'm sorry they did that to you though. But sadly you have reached the moment that happens to every kid when they realize the extent to which their adult parents are actually incredibly immature and just fallible people trying to get through life like everyone else. It can be shocking and jarring and sometimes means your needs are cast aside.",
            "Whether this is weird or not depends on how long they have been dating.\n\nI'd guess normally you'd date for awhile before introducing the kids and then do things together before someone moves in.\n\nIf she's literally a stranger, then that is weird.\n\nIf it's just that she's not a family member yet, that takes time.",
            "Can you tell your father that things are weird mostly because you didn’t move she was moving in until she did? I am a stepmom close to her age and my stepsons is 15. He knew months before we all moved in together that this was happening, which gave the two of us time to get to know each other and spend time together before moving day. \n\nI also agree with everyone who says it’s her responsibility to get to know you as long as you are being polite to her. She’s the adult, not you.",
            "If the GF is serious enough to have moved in, the dad should have introduced his kids to her long before then. They should have an established relationship before moving her in. If he’s only just started dating her, then he’s an even bigger idiot then we thought"
        ]
    },
    {
        "post_id": "4883af",
        "author": "throwingrightaway",
        "title": "UPDATE: I [M22] caught my girlfriend [F21] purposefully worsening her injuries.",
        "url": "https://www.reddit.com/r/relationships/comments/4883af/update_i_m22_caught_my_girlfriend_f21/",
        "score": 2912,
        "num_comments": 99,
        "created_utc": 1456716352.0,
        "selftext": "Since I've been asked a couple times I'll provide an update to those who saw my original post:\nhttps://www.reddit.com/r/relationships/comments/47nna5/i_m22_caught_my_girlfriend_f21_purposefully/\n\nSo to start this off say thank you immensely to those who shared personal experience and advice. \n\nLacy came home yesterday while I was home and immediately broke down crying when she walked through the door. She immediately apologized for leaving and for making me worry.\n\nTurns out I really underestimated Lacy's redditing and she ended up seeing the post when she was gone. Honestly I can't think of a better way for this to have gone. She told me she stayed up all night reading every single comment.\n\nIn summary, she did some serious self-reflection and has admitted to me that she is suffering from depression and that the injuries were a way for her to receive the attention that she wanted so incredibly badly. But also admitted that the whole process really just made her feel pathetic and worthless inside and ultimately worsened her depression. It had become a rather vicious cycle. \n\nWe talked a long time but it was ultimately her who said she needed and wanted therapy. We have spent time today looking through her options and she plans to make an appointment Monday. \n\nI think it was the stories from those who had similar experiences really hit it home for her. \n\nThis whole update has been pre-approved by the girl in question and she has also asked that I let you all know how much you have helped her \"get her shit together\" (her exact words).\n\nTLDR: Girlfriend found reddit post, wants to go get help, all is well.",
        "permalink": "/r/relationships/comments/4883af/update_i_m22_caught_my_girlfriend_f21/",
        "comments": [
            "[deleted]",
            "[removed]",
            "Hi Lacy! That's really great that you're being honest and willing to get help and that you've got someone who is being supportive. I think you will probably do really well with therapy.\n\nI'm making my own throwaway here because some of this sounded like stuff I used to do. It has made me feel better to see other people saying they've done similar stuff, so I thought I would add my story as well because at times I have also found myself trying to make injuries worse without really knowing why.\n\nI cut myself for a long time, but I always went to great lengths to hide it and never sought any sort of attention for it. I literally did it for a decade before I ever spoke to anyone out loud about it. For me that was totally different than other injuries.\n\nAt times I would try to hurt myself \"accidentally.\" I sprained my ankle once, which was genuinely a complete accident (came at a really inconvenient time, too) but after it happened I kept injuring my ankle more to delay healing and then trying to sprain it again. Other times I intentionally let myself faint (note: I never actually faked fainting, they were real faints but I let them happen), made myself catch an illness, let myself have some nasty falls, and similar things.\n\nThe weird thing is that a lot of times I wouldn't tell anyone about my injury. Plenty of those fainting spells happened with no one else around, for instance, and then when I did faint with other people around I was extremely uncomfortable with the attention and would deflect it as soon as I could. It was like I liked the idea of attention more than the reality of it.\n\nI saw some comments about Munchhausen's By Proxy on the last post being a potential problem and while I can't speak for anyone else, having my own slight Munchhausen's issues has in no way ever made me even think about doing that to anyone else. That's a whole other realm of behavior to me even if it does involve some similar symptoms.\n\nI really, really hated myself for feigning illness, but I've learned to forgive myself. I was always afraid of being called attention-seeking because there is such a stigma about that, especially for women, but people do need some attention, that's just how we are, and while there are definitely bad ways of trying to get attention, needing attention doesn't make someone a bad person. \n\nIn my case I was the oldest of a large, conservative, homeschooling family. My parents talk about how as a baby I got more attention than any of my siblings, and I'm sure that's true given that I was the first, but as I got older I was expected to set an example to all my younger siblings. I wasn't supposed to need anything because I was the oldest. I was mostly left to teach myself because the younger ones needed my mom's attention more in their schoolwork. And not only was I the oldest, but out of the older kids I was the only girl so I feel like I got stuck watching the younger kids a lot more than any of my brothers. I was almost like another parent to my youngest siblings. I remember multiple times where I was upset about something and I was told that I was too old to get upset (even if I was only 10) and reminded that we had actual babies in the house.\n\nI was very depressed, started self-harming very early, and developed a fairly serious eating disorder, all of which I hid for years until in my early 20's I finally ended up hospitalized for the eating disorder. My parents didn't believe in mental illness as anything but a spiritual problem, so even though (they say now) they knew what was going on, they never got me any help.\n\nI kind of wonder if part of my desire to have a physical issue was because I did have real issues that probably did need attention, but I knew that a purely physical issue was the only way I could get sympathy.\n\nSometimes, too, I was covering up my problems with a physical issue. It's hard to explain to people that the reason I could barely walk was that I hadn't eaten in a week, so a sprained ankle or a recent illness provided a better excuse. I guess I could have just lied about it, but I wouldn't do that. Somehow making myself sprain my ankle seemed better to me than outright lying about having a sprained ankle.\n\nI did fantasize about having an illness that would garner me lots of sympathy and attention, but like I said, I was uncomfortable with the reality of receiving attention so I never went that far.\n\nI still don't know exactly why I did what I did, but my point is that I've learned to be gentle with myself. Maybe I was attention-seeking, but I can forgive myself for that. After all, it's possible that I actually did need attention.\n\nIt was easier at first for me to feel sympathetic to other attention seekers while I still reviled myself. I remember reading online somewhere (it might have been reddit) about paramedics who deal with patients who fake seizures and other medical issues for attention. Most people were criticizing the patients and saying how awful they were until one paramedic told a story about a girl he used to see regularly who would fake seizures and how annoyed he was about her until he found out that she was living with a stepdad who would sexually abuse her and faking seizures was how she would get herself out of the situation.\n\nThat's obviously an extreme case and I have never personally dealt with anything that bad, but it made me realize how judgmental I had been of attention-seekers, *especially myself*, when I really didn't understand what might make someone do what they do. It was a while before I was able to forgive myself, but feeling compassion for other people helped me eventually start to apply some of that compassion to myself.\n\nI am in mental health treatment now. I actually did do some real, unintentional, damage to my heart with an eating disorder (funny how I would try to have other physical problems but assumed that my eating behaviors would never hurt me) and had to be hospitalized for that, but I'm in excellent physical health now and am just working on my mental health. I've found that as I've been going through treatment that desire to seek attention has completely vanished. I still worry I might be doing the same thing with mental health conditions, but I talk with my treatment providers about that and they've pointed out that even thought they really don't think that's what I'm doing, if I were doing it that would be reason enough for treatment in itself, so no matter what I do need and deserve treatment.\n\nAnyway, I wanted to reiterate that I'm really happy to see this update and I wish OP and Lacy the best. I think OP's support and Lacy's honesty and willingness to look at her own problems is absolutely excellent and a good sign of things to come.",
            "Happy to hear she's getting help.",
            "Sometimes you need to hit your lowest point before you can begin to get better. I learned that the hard way last year. I also learned that people are more willing to offer you a hand than you'd think - Lacy, please don't hesitate to reach out to your loved ones in the future.\n\nBest of luck to you both.",
            "That's fantastic news.\n\nAnd I know it's cliched, but making the conscious decision to stop the cycle is the hardest part. The path of recovery won't be easy for sure, but having the intrinsic motivation to even begin the journey is more than enough to get that momentum going.\n\nStay strong and I wish you the best!",
            "Yo, Lacy- you got this!!!",
            "I'm glad to hear she's working towards getting better. I wish you both all the luck. ",
            "When I was a kid, my cousin (who was a little older and more sportier) and me were playing on the monkey bars. After dark, she came home to huge blisters on her hands. My Aunty and mother both fawned over her injuries and waited on her, cared for her and she got all this special treatment. So the next day I set out for those monkey bars! I swung and rubbed my hands till I myself had some blisters forming. I run home to get this \"special treatment\" for myself. I was so ready to welcomed and cared for! I show them my trophies and wait for their reaction... Nothing.. \n\nNo special anything. So now I these dumb sores and stupid bubbles and no one cared. ",
            "Dear, sweet Lacy and dear OP. I hope all goes well for you. It might be a long road, but it sounds like you've both got your heads on straight and you have made a good start. Life can be really hard. Big hugs. ",
            "You got this, OP's GF!! :)",
            "Congrats to her for having the courage to realize and try to tackle her problem and congrats to you for being such an awesome BF! I hope it all works out :D",
            "Lacy, if you're reading this--I've been where you are. I used to hurt myself for attention because even though I was surrounded by people who loved me, depression can make you feel so lonely and worthless. I just want you to know that you're making the right choice by getting help. It does get better, even though it might not seem like it. You have a good man by your side and you're going to get through this. Hang in there!",
            "Glad it's working out. To Lacy, make sure you stick it out getting help, depression can make it feel utterly pointless to get help, so please remember that it's absolutely not pointless.",
            "[removed]",
            "I'm so happy that it is in the open now. I know that, while embarrassing and upsetting, telling my loved ones was the best possible choice. My rate of self harm dropped drastically and I had people to go to when I was feeling down. I hope this works out for both of you. It will get better!",
            "I hope you and your gf have the best time together. The right girl/guy can be perfect for someone in deppression and it affecta a lot more people than one thinks. I hope your gf reads this, coming out of depression thanks to a certain individual has made my life so much better and now i want to spend the rest of my life with them. She doesnt know it but she seriously saved my life and ive never felt happier about it. I wish you both the best :)",
            "I always feel really warm and fuzzy when reddit truly helps someone out. I can't help but feel a feeling of accomplishment and pride even though I contributed in literally no way to this.\n\nEither way, I'm glad the situation resolved this way. Good job OP! Good job Lacy!",
            "This is great to hear! Best of luck to the both of you. Lacey, it takes a lot of strength to get help. Really proud of you. You are definitely worth it. Just know that things can and will get better.  And OP, great job to you as well. \n\nTake care guys!!! xo",
            "so glad this had a happy ending :)",
            "Ops GF if you are reading this good on you, you made probably the best decision you could\n\n> but it was ultimately her who said she needed and wanted therapy\n\nSounds like you already started to \"get your shit together\"\n\ngood luck to the both of you",
            "I am so proud of her. Admitting to something like this, and seeking help is so incredibly courageous. I am so glad you guys talked, and are taking the steps in the right direction. It won't be easy, and there will be set backs, but that is not a \"bad\" thing. It is a process.  So happy about this update.",
            "I'm so so so glad this turned out the way it did. In OP's original post he mentioned something about Lacy being on reddit and the whole time I was reading I was thinking \"if my boyfriend posted something about me (assuming he used reddit & I was aware of it) I would probably notice my own name and story if I saw it...\" and I was a little worried about the repercussions of her seeing that but it happened and everything is going to be okay. Kudos for getting your shit together. ",
            "Fantastic!! She could look into something called behavioral cognitive therapy. To my understanding, its where a person learns to tie other emotions into their current actions, I.e. when I wake up without an alarm I either forgot to set one or I slept through all of them and I'm late -changed to - I woke up before my alarm because my body is refreshed and I am ready for the day. This is an example of something I actually did before I learned what it was called. Now I always wake up before my alarm even if by only moments. I can cite sources if it would help. Let me know. ",
            "Your girlfriend is very strong.  ",
            "Good luck Lacey, you can pull through! <3",
            "This makes me so happy. ",
            "Read the TDLR as: GF found reddit, all is well. ",
            "For everyone who downvoted me to hell because I said she was doing it for attention... \n\nI TOLD YOU SO. Next time fucking relax and consider that maybe not every solution needs to be as fucking dramatic as you all make it out to be. ",
            "It's wonderful that you've been supportive and understanding. Even not pushing therapy on her. Depression is such a complex thing that sometimes significant others can't really grasp it. Huge kuddos.",
            "Great update! I'm glad she is taking the first steps, those are big difficult steps to take in the beginning. You can do it!",
            "I know it's more her thing than yours but keep up the support and get detailed updates as time goes on.  Sometimes, it's easy to want a happy ending but it's always a process to heal - sometimes she needs space and sometimes she needs confronting like what you did.",
            "I'm so relieved that you and she talked about it together. Whatever she's going through is big and going through therapy alone is really, REALLY, tough.\n\nI'm sorry that she's feeling pain of some kind emotionally and acting it out physically. Lucy, if you are reading this please know that you are not alone. I'm here for you if you want to talk. (((Hugs))) Try expressing this stuff with writing or creating something that doesn't physically harm you because it's a dark and deep hole to climb out of and it's easy to just stay. ",
            "I'm glad she's getting the help she needs and good luck! ",
            "[removed]",
            "I was wondering about you guys. The image of her wit the hammer poised over he leg and a look of \"oh shit\" really stuck in my head. I hope she gets better. And a reminder to you, OP, that if her crazy is too much for you, you're not obligated to carry her.",
            "I still feel like you're still burying your head into the sand to cherrypick your narrow view of the world around you. And being here is not going to be helpful when everyone adopts a child-like perspective of your girlfriend's suffering or your 'recuse' as some warm and fuzzy romance fantasy.\n\nYour girlfriend is playing doctor by trying to diagnose and treat herself. If the imagery alone of your girlfriend suffering so much that she deals with her emotions by slamming the cold steel head hammer onto soft and supple human flesh does not disturb you enough to feel compelled to bring in professional advice, and not internet advice, then I don't know what you tell you. Lacy is clearly in pain right now and she deserves a sense of inner-peace and happiness just like the rest of us. I do not understand why you people believe she does not deserve professional help to work through this.\n\nPlease consider soliciting expert advice and not internet advice. We all know that anything not following the same warm and fuzzy narrative is going to be discarded and down-voted into oblivion. But even if you do continue to cherrypick, right now is still the opportune time to speak with a professional in a candid manner. \n\nYour girlfriend is diagnosing herself with depression while she continues allowing an unknown illness to progress further. It is a good idea to seek out professional aid as depression might not get better, it might get significantly worse on it's own, and there are more serious prospects in play here. Your girlfriend might not have depression at all. Have you ever entertained the thought that you really have no clue -what- disorder she is suffering with, only that she's asking for your help?\n\nSelf-harm is a cluster-b characteristic and that's a fact. If she displays four more of these characteristics then she meets the criteria for being diagnosed with an emotionally unstable personality disorder and not depression. Therefore, the treatment for depression that you two take alone, by yourselves from self-help books or the internet, is not going to be the same treatment that an actual clinician will give you.\n\nCaregiving in a relationship?\n\nThis is not a romance novel. Mental illness offers some very real, very painful struggles for both the person suffering and their loved ones. Unless you're willing to actually work with collaborative support from professionals, your circle of friends, outreach groups and peer support like NAMI, then you will not build the tools to be successful. Period. And with the way you come across with denial I can guess you'll keep building up stress after stress until it becomes too much, when you should be open to accept that there is nothing wrong with looking out for yourself on occasion.",
            "Instead of self harming, can we please please please call this self hammering?\n\nPS: I'm ecstatic she is choosing to get help. That is the first huge step and it having be HER choice shows that she has a great chance of getting through this with you. Best wishes.",
            "[deleted]",
            "Plot twist: OP has no girlfriend."
        ]
    },
    {
        "post_id": "4xpcfj",
        "author": "Throwaway592j1",
        "title": "[UPDATE] My [19F] manager [25M] had unlocked my phone and was recording a private video of me and my partner onto his own phone, and I caught him",
        "url": "https://www.reddit.com/r/relationships/comments/4xpcfj/update_my_19f_manager_25m_had_unlocked_my_phone/",
        "score": 2911,
        "num_comments": 271,
        "created_utc": 1471199213.0,
        "selftext": "Original post here: https://www.reddit.com/r/relationships/comments/4skueq/my_19f_manager_25m_had_unlocked_my_phone_and_was/\n\nHello everyone. First of all, big apologies for how long overdue this update is. Since the rules limit me for one update only I wanted to have the most full outcome to give you. Thank you all so, so much for your help and support and advice, I didn't expect so many people to respond to me and I really am grateful.\n\nSadly the outcome isn't so happy. My conclusion from the original post was to go to highest management first and then police if the result wasn't satisfactory, which is what I did. \n\nI went straight to the store manager the morning after my post and was advised to write up and sign a formal grievance, which I did. I then met with two other managers to discuss the details of what happened and any other relevant stuff. They told me they'd talk to the manager in question and any witnesses and get back to me in a week after investigations had taken place. In the meantime, my manager was not allowed to work with me and was told to reschedule all his shifts or work elsewhere. \n\nA week passed and I heard nothing. When I went to find out, apparently due to staff holidays it couldn't be completed in time. I asked how much longer and was told a week. I felt this was too long and was really restless by this point already and so my boyfriend came with me to speak to the police. \n\nWe explained the situation and my details were taken down and then we met with a sergeant. To summarise, she told us that in the UK there is no specific law against accessing someone's private phone/recording off someone's private phone without permission. As such, they are unable to search his phone as no arrests can be made. The only thing they could do was go to his house and explain it had been reported and that if he ever distributed it he would be arrested, which they did, and he LIED TO THE POLICE and said he hadn't done anything. Sadly, they said there was nothing more they could do.\n\nThe internal investigation then concluded and I was told my manager had denied everything, made up a false excuse for the apology text he sent me and basically called me a liar. They told me that there is no CCTV where it happened and nobody who was in the area at the time saw anything (no shit, they were the complete opposite end of the room, as I had already explained). They tried to say they weren't taking sides, but to be honest it seemed like they were. They're moving ME from the department instead of him, because moving him is \"harder\". I really enjoyed my job and now basically I have to suffer because my manager is a disgusting liar. They don't seem to care how serious this is. I ended up almost crying when they legitimately said \"maybe you didn't see anything at all\". I feel like they're accusing me of lying and imagining it, even though one of the managers involved was the one that caught me in the corridor bawling my eyes out.\n\nI really wish I could've given a happy update. I'm so upset that I have to move and give up something I enjoy when he gets off without even a slap on the wrist, goes on knowing he can probably do this again to someone else and carry on being the scumbag he is, not to mention, he might still have the videos. He may have distributed them already but how the hell would I know. I have no idea what to do now. The police say nothing else can be done. If anyone has any legal advice around this issue within the UK law then I would be very very grateful for that. \n\nSorry for the length, and if it's worded badly. Again, thank you all for your advice. I'm sorry this was a bad update.\n\ntl;dr: Went to higher management and police about how I caught my manager recording a private video from my phone to his phone. He lied to both; management say not enough evidence to do anything, he gets to keep his job but I have to lose mine. Police say nothing can be done due to no UK law surrounding the subject.\n\n",
        "permalink": "/r/relationships/comments/4xpcfj/update_my_19f_manager_25m_had_unlocked_my_phone/",
        "comments": [
            "OP - I work for a large corporate in the UK.  I'm not a lawyer.  There are a few things you could consider doing:\n\n- as others have said, contact a local lawyer who specialises in employment law.  Seriously, this is the most important thing to do. Although the company appears to have followed it's internal policies on grievances you still have several options, ultimately including quitting and suing for constructive dismissal based on gender discrimination.  At the very least, contact from an employment lawyer will terrify the store and you may well see corrective action immediately.  Settlements for gender discrimination are uncapped in the UK (unlike unfair dismissal, for example) and companies are very wary of cases like this.\n\n- In the meantime, make a note of all situations which have made you uncomfortable while working at the store - you mentioned in your previous post discussions about attractiveness of other female employees and your boss letting you know he found you attractive.  Both can and generally would be considered harassment.   Discuss these with the lawyer as well.\n\n- make sure you have a written record of the grievance judgement and ask for one if it hasn't been provided.  Make it clear in writing that you are unhappy with the outcome, especially the transfer - which feels like punishment for raising a grievance against your male manager who has harassed you.\n\n- check the employee handbook to see if they have an appeal procedure and if so lodge an appeal\n\n- If your store is part of a chain and has a corporate HQ, ask HR in your store how you can escalate to corporate HR.\n\n- In general, in your communications with HR locally and beyond, make it clear that you feel like you are being harassed, discriminated against and punished because of your gender.  Which should be easy, because you clearly are.\n\nBut first, get a lawyer.  The company absolutely will not want to defend a case like this - if it were to go to a tribunal it would be a disaster for them - and I doubt they will stand by a creepy manager once a lawyer is involved.\n\nedit: link removed.  Google \"citizen's advice sexual harassment\".",
            "Wow, that is such shit. Have you thought about going to a lawyer or going to the media?\n\n>\"maybe you didn't see anything at all\"\n\nThis makes me fucking sick.\n\nAlso, even though you're in the UK, /r/legaladvice still may be able to help.",
            "That's such bullshit, a phone might be a telecommunications device but these days it's also a personal computer and unauthorised access of a computer is a crime under the Computer Misuse Act in the UK.   There's bound to be something they can do!",
            "1. Your manager did face consequences - he learned that if he does this, he will be reported & have to be on the defensive. Please dont think your effort was futile. If he does it again, his victim will be able to point to a pattern and he wont get away with it as easily.\n\n2. Because you've been reassigned, I'd recommend going to talk to an employment attorney, or if your city/township has an Equal Employment office, go talk to them. Equal Employment office, you can file a complaint and the company will have to defend their actions to a 3rd party. As far as an employment attorney, perhaps there's a case where you can claim that as a result of your sexual harassment and reporting, you suffered negative consequences. I would explore these two options before you throw in the towel. ",
            "Look for a new company, OP, please. The fact that they see fit to treat an employee this way (even one on a 'low level') is abhorrent. \n\n\n\nVisit r/legaladviceuk and tell them what you told us. Don't quit your job until you've gotten good counsel - and not from the police.  From a professional. \n\n\n\n\nKeep your head up and if you find a way to keep fighting this, do it.  This manager is not fit to hold his station, and you do not deserve to be shamed.  \n\n\n\n\nI am disgusted for you.  And I am so sorry.  Do not give up.  Do not accept this.",
            "Oh OP, I'm so sorry. I wish I could give some kind of advice to help you from here, but it seems as though all avenues have been shut down by the people around you who could have done something.\n\nIf you were to ever find out he had distributed it, report it immediately. Also, I would notify anyone you know that is a mutual acquaintance or friend of your and his to look out for any evidence in the future of videos or pictures or even statements that he might make regarding the situation. Liars usually get caught in the end with bad behavior, you just have to look for it. Good luck and hold your head up lady, you did nothing wrong. Try to make the best of the situation you've been forced into and if I were you, start looking for a different job.",
            "[deleted]",
            "\"in the UK there is no specific law against accessing someone's private phone/recording off someone's private phone without permission\". Rubbish. This is a clear offence under the Computer Misuse Act (s1 and s35). \n\nSource: am English qualified solicitor. ",
            "Without detail, I'll say I experienced a sexual harassment incident with a manager at a big retail chain in the US. When I reported this to HR, they assured me there would be an investigation and no negative repercussion for me coming forward with this report. After a week, they said because he denied it, I had to continue working along side him. This was not an option for me and they so conveniently weazled me into the decision to leave my job. I know I should have pushed this further and could have sought legal action, but I was scared. Don't do what I did, don't give up. I'll always wish I had done something different. Good luck to you!",
            "Oh god. All of my rage right now. ",
            "I'm not advocating a bat to the back of the head but you know if there are no cctv cameras it didn't happen.  ",
            "When you guys say speak to a lawyer, where are these magic lawyers coming from and who's paying for them?",
            "I hope you showed the police and senior management the incriminating text he sent you to \"apologise\" and say he was going to delete the video! I'm so sorry this has happened to you. What a creep.",
            "[deleted]",
            "Honestly, I'd probably steal his phone and just destroy it. Who knows what he will do with the video, whether it's personal, or if he shares it. Id be REALLY creeped out, thinking that he could be using it for his personal enjoyment!!! I can't believe there's nothing else management will do. Wtf",
            "> They're moving ME from the department instead of him, because moving him is \"harder\". I really enjoyed my job and now basically I have to suffer because my manager is a disgusting liar\n\nThis is very close to Constructive Dismissal, and may have already crossed that threshhold. You're being punished for reporting sexual harassment. Talk to a real lawyer. Not some legal advice sub which people here seem to confuse for a lawyer. That's just a place where people say plausible sounding things at random (seriously, I just checked and saw you posted on another sub and the answer you got is almost certainly wrong). The info people are giving you in this sub is also mostly wrong from the top level posts I skimmed.\n\nReal lawyer. Consults should be free. \n\nDon't file shit or sign anything before you talk to one. If you've already signed anything for HR mention this to the lawyer and see what the law is regarding that in your jurisdiction; you may still have options. \n\nedit: some of the info you're getting isn't wrong per se, but it's mostly irrelevant and is not focusing on the right issues. ",
            "I agree with the people saying look for proper legal advice (the police were  wrong, this is a crime under the computer misuse act as well as a number of other laws).\n\n> I really enjoyed my job and now basically I have to suffer because my manager is a disgusting liar. \n\nIn saying that, look on the bright side, your job isn't a good job, because now you know the company you work for isn't really all that great. You don't want to work for them now anyway if that's how they treat people. So, its more of a plus in that respect.",
            "You may call me barbaric and violent, but if somebody did this to my girlfriend and the legal ways didn't work, the fucker would be shitting teeth by now.",
            "Thank you for the update, and I'm sorry you had to go through this. I don't have an appropriate sub for you due to being from a different country, but if you are curious about your legal options, try checking out a legal or employment advice subreddit. \n\nPlease take only this one piece of advice-- not everyone knows how to do their job. Especially police. The law is a convoluted thing, and it feels like the UK, with some of the most stringent defamation laws in the world, has some laws these managers are running afoul of. Again, not a lawyer, but I do know trust... Don't trust these people to know the law. Trust a lawyer instead.",
            "This sucks! I can't say anything useful about the situation itself, I do want to say this: don't keep private videos on your phone anymore. Keep them somewhere safe, for example: on your computer and **encrypt the hard drive**. If you want, I could give you some advice on how to do this.\n\nETA: but most of all, I feel really sorry for you",
            "What he did is in his personnel file, and he got a big scare. If he is caught again it will be taken more seriously.\n\nAsk around your company to see if any woman has had other problems with him. If they know what happened to you they might be more willing to come forward, and more careful with their phones. ",
            "I feel sick reading this. I'm so very sorry. What an absolute pile of bullshit.",
            "Lawyer. The. Fuck. Up! ",
            "I feel horrible for you! What shit. \n\nThe only aid I can provide for you is to recommend you getting a second security measure on your phone to protect sensitive material. There are plenty of pic and video vault type password locked apps out there, many of them free too!",
            "Do you have a union where you work?",
            "I have a feeling I know which company this may be. A similar thing happened to me a few years ago with my manager being explicit in the workplace and sexually harassing me. Nothing was done of course and I was ridiculed for leaving over something so 'insignificant'. The UK really should have better laws for protecting employees in these situations.",
            "Post in r/legal or r/legaladvice\n\nThey may be able to tell you more about your options at this point. Basically it sounds like this manager just fucked you over and will get away with it. Where you now are being looked at as the liar, you will never have access to his phone and you had your job changed on you. \n\nI would tell the hr dept that you want to keep your job, you're not moving because of someone else doing wrong. Also, in the moment when you caught him with the phone. I would have asked to see the pictures and videos and deleted it myself. And you should have recorded him confessing and apologizing to you, at least then hr would have known the truth and he could not have denied an audio recording.",
            "Maybe try cross posting these to r/legaladvice, they might be able to give you at least some ideas on what else to do. ",
            "Jesus reading this just made me sad. I'm so sorry your privacy was violated in such a manner and that your company reacted the way they did. I would start looking for another job if that's an option, and if your country has any sort of like 'Employer rating' site I would go on there and post your story. At least people coming in would be warned. I hope things work out for you. ",
            "> in the UK there is no specific law against accessing someone's private phone/recording off someone's private phone without permission. \n\nThat's weird because in my country (South Korea) the law passed like 10 or 20 years ago because it's like common sense to protect one's private life (including sexual ones) from anyone else...Isn't that too obvious to western culture? I mean I know BBC and UK trying way too hard to prove other countries are inferior in terms of sexual crimes but I guess they need to self-reflect themselves first before pointing their \"white and clean\" fingers to other people...I recently found UK are esp fucked up in terms of sexual assault cases. (funny thing is, the men in UK are so against Feminism and women rights activist even though their culture is still blatantly favoring their possessive men and forgiving to rape criminals)  ",
            "First of all, I'm so sorry this happened to you, OP. Please excuse my language but that's how much this whole thing blows my mind. \n\nWait, what the fuck? You're telling me that in the UK it's NOT against the law to take someone's phone and record whatever I want off of it WITHOUT THE OWNER'S PERMISSION? There's no such thing as violation of privacy in the UK? That is the craziest shit I've ever heard. He must have known your passcode too, which makes it even worse. How is everyone just ignoring this??",
            "If you're in the UK talk to ACAS. If you're in a union talk to your rep. ",
            "The advice on r/relationships is too often what the responders like to fantisize they would do in the OPs position. They're kind of living vicareously through the OP but dont actually have to take responsibility when things go wrong with their knee jerk, unthinking advice. I think this post is a good advertisement for taking any advice given on this forum with a grain of salt. ",
            "Ugh, I am so sorry that happened. I went through a similar experience where my manager essentially sexually harassed me, would not give me work and acted blase when I tried to talk about ways to fix things. HR ended up telling me to take a week off because my boss told them that I was unstable. Since we were moving offices during that week off, I had to pack up all my belongings and take them out to my car. Really looked and felt like I had been fired. \n\nHR isnt there to help you. They are there to protect the company from liability. ",
            "[removed]",
            "The sad truth is that an HR department exists to protect the company, not its employees. ",
            "I'm so sorry OP! That's a really horrible turn of events. I've also found myself rather perplexed at the legal system, and been told by police (who were also very apologetic), that the law isn't in the victim's favour in certain cases. The perp in my case couldn't even be arrested or brought in for interrogation, either.\n\nI think everyone else have given you great advice, and IANAL, so I won't presume to say anything much. Maybe also check your Citizens' Advice Bureau to see if there's any precedents?\n\nBest of luck and hugs. Hope this gets sorted out. It really sucks when you realise that maybe your safety and happiness aren't a priority in the world. ",
            "I'm a bit late in the game to comment, OP, and dont have any advice to add regarding what actions to take next, you've already gotten really solid, awesome advice here from many commenters.  I do, however, want to say something.  What happened to you is so appauling and I'm so angry on  your behalf, I just had to comment on the off chance you do read this.  I really hope that you do follow up and talk to a lawyer. Your manager is fucking scum and he deserves whatever is coming to him, whether it's retribution legally and financially speaking or bad karma that will eventually catch up to him. Just know you've got this random internet stranger's support!",
            "I've studied law and the police and as others here have pointed out, the police you spoke to were misinformed. This guy definitely broke a few laws. Speak to other cops or keep pushing. ",
            "I'm so sorry about your situation. It pisses me off when there's no justice, which is why I think your next step should be to plan a suitable revenge that can't be traced back to you. A few kids trashed my car with an axe a bunch of years ago. Despite my neighbors seeing who it was and giving their statements to the police, nothing at all happened. So I waited six months, went to his house in the middle of the night and planted nails on all the tires of his car and also severely scratched the paint. It was a fairly new BMW. My point is: if the system fails you on justice, take it into your own hands. ",
            "Sue him civilly and the company too. ",
            "You said that he messaged you saying that he deleted the videos. What happened to those messages?",
            "Call a lawyer, at this point they're more likely to help you than Reddit is.",
            "I'm sad to say, but given OP's course of action, I'm not entirely surprised by the outcome. This is what most big companies do -- cover up misconduct by employees (especially management) to cover their own asses, to limit liability. Period. \n\nI mean, it's logical. Really really scummy, but logical. :(\n\n[s] Isn't corporate-capitalism wonderful sometimes? [/s]",
            "I know this might sound crazy, but can you go to The Daily Mail with this story?  Get some legal advice first (I don't want you to get sued for slander), but they always seem to love a story like this.",
            "Time to go public and blast them to media",
            "I'm sorry that the police couldn't help you and that your company is punishing you for reporting it. \n\nNevertheless, I think you did the right thing in doing so. You stood up for yourself and there's value in that. ",
            "this is outrageous! i'm furious on your behalf and that of every other coworker of yours who may have (had) their privacy invaded by this prickhole.\n\ni wish i could help you, OP, but i have no useful advice to give you. i hope everything turns out right for you and your partner and your manager gets his ass fired.",
            "PM me if you would like a few emails at the Guardian. ",
            "[removed]",
            "Your coworkers took a side by not taking a side. They're absolutely disgusting and should have had your back. You're better off not working there, you can find better people to spend your time with. ",
            "Is the UK a two-party consent country? You should be recording any interactions, especially if you have any more with the manager. ",
            "What the Police told you sounds like absolute bullsh1t, there is no way that their hands are tied in this case.",
            "Worked with a girl who got grabbed by a co worker but due to no cctv, nothing happened about it. She quit and he still worked there. In fact they put me on shift alone with him on night shifts (i was young teenage girl then and no one warned me except for her bf), and i ended up quitting because he started to ask weird questions about me. I knew manager defended him like mad last time, so didnt want to take my chances. It sucks but heard of these cases falling apart. \n\nIf you're sadly lucky he will repeat an offence like this and it'll be a hard pattern to cover up. Yet again, it's down to luck if he's reported and evidence is caught. If police know about him and other staff do maybe you've increased these odds. \n\nYou made a good choice, sometimes you've got to question if they have this attitude where you work, would they be fair to promote you for good work or not. Sometimes this is a sign the office you're in isn't that great. With getting the police involved he may have deleted the video out of fear his phone might get searched, so odds are you've prevented it from being shared online. Hopefully other staff members know to keep their phones away from him. Look for revenge porn support sites, they have lawyers and support groups for when someone takes images like this. \n\n",
            "I just want to point out that this guy is a sociopath, possibly a psychopath, as someone just like this guy, I can attest that not only is he going to deny it to the ends of the Earth, but odds are he has it out for you now. The minute he got wind that he needed to reschedule, I would imagine he went into full psychopath mode, leading to him lying to the police and all that. Be assured he still has the video, but by now it is safely on a hard drive separate from his phone. \n\nIt sucks, but sociopaths rarely do shit like that without working out in their head how they will get out of things if they are caught.  Also, remember how his hands were shaking when you caught him? That is how he got caught. He wasn't fast enough, it's symptomatic of someone who hasn't stolen many things. ",
            "And this is why we tell people HR isn't on their side but no one seems to think that.",
            "\"To summarise, she told us that in the UK there is no specific law against accessing someone's private phone/recording off someone's private phone without permission\"\nWhat a joke of a country if true",
            "What about store cameras? Most stores I know of have them everywhere, especially in back offices. Can you ask to access the footage and take that to the police? I'm so sorry this happened to you.",
            "Do you have a labour board?",
            "Your efforts are not in vain.  Unless he is a psychopath, the is completely terrified of what could happen to him if the truth were exposed.  He is likely is experiencing terror - and the people who know about the incident probably think he is a total slimeball.  There's some justice in that.",
            "This is sounding like a court case not only with the manager but with the company also. Take advantage of social networks and news also. Of course this will be set up to be a drawn out legal battle and I am positive they have already got their ducks in a row already in prep for you responding with a lawyer. ",
            "That's shit, that video could be anywhere, damn, I can imagine him jerking off to it, or uploading to a porn site or giving to his friends etc.\nOP, you need to take measures, make sure this doesn't happen, viruses, hacking, and misuse of technology is real, you need to keep safe.\nI also don't get- why you have such a video on your phone? It is a blatant blackmail opportunity, phones are the biggest target of hackers, something like this was sure to happen,\nAnywho, stay safe.",
            "Go to the media. This is so fucking stupid. ",
            "Blow this shit up on social media.",
            "Go to ACAS for advice. Record any interaction you have with him in case this isn't the last of it. ",
            "Keep fighting this, honesty, however the law is currently on his side as there is no evidence of his crime, I mean, unless they recover the deleted file from his phone (WHICH NEEDS TO BE DONE ASAP, before it is overwritten) there isn't much you can do.\n\nDepending on his phone, this could be done in as little as 5 minutes, with the right program.",
            "Dont record yourselves naked kids",
            "You could anonymously post all of his information and the internet would take care of it for you. Just saying, reading this made me want to personally have that manager, destroyed. You should be allowed to have justice in this matter, and might I say, it is 2016, the UK police need to get there shit together and start thinking of the unthinkable for crimes against innocent people in this time, not 1973.",
            "I'm really sorry this happened to you. I'm not familiar with UK labor laws so I can't be of much help. But I just wanted to write to say that noone is going to watch a cell phone video filmed off the screen of another cell phone. So I wouldn't worry too much about him distributing it. Good luck and I hope you can find a better employer. (Seriously get the fuck out of there, they clearly don't respect you and it doesn't sound like a healthy environment).",
            "You can always break his legs and call it even. ",
            "Ugh people like him make me sick. You or your partner should spy on him and get a private video of him and then anonymously email it to the entire company. ",
            "Valuable lesson here.\n\nIt's not about what happened it's about what can be proven.",
            "Couldn't you just try and access his phone?",
            "You shouldn't have snitched ",
            "You apologize a lot. Maybe see a therapist. ",
            "lol, in the US all you'd have to do is lawyer up and they'd have been in deep shit",
            "> To summarise, she told us that in the UK there is no specific law against accessing someone's private phone/recording off someone's private phone without permission. \n\nThat doesn't sound right. There is definitely such a law in the U.S. You should perhaps seek a second opinion (a lawyer, etc...). "
        ]
    },
    {
        "post_id": "4ke30q",
        "author": "Cu23209",
        "title": "I [25M] had sex with my disabled friend [24F]. It made her happy but I'm feeling guilty.",
        "url": "https://www.reddit.com/r/relationships/comments/4ke30q/i_25m_had_sex_with_my_disabled_friend_24f_it_made/",
        "score": 2905,
        "num_comments": 256,
        "created_utc": 1463845505.0,
        "selftext": "My friend Lana is disabled in her legs, result of the accident when she was 14. So she's in a wheelchair. She also has movement issues in the rest of her body.\n\nWe've known each other for a few years now, we met at the university and now we're both in grad school. I was her first real friend in her life as she puts it, as others have never been interested in friendship with her. As months and years went by we became closer, we did a lot of things together, we studied together and we were great friends. Her family are rather protective of her but they trust me completely with her.\n\nI never looked at her sexually, she was more like a cousin to me. I never considered dating her either. I really love spending time with her and being her best friend, the one that she trusts and can always rely on.\n\nYesterday we submitted a major piece of coursework and we're finally free. I asked if she likes to celebrate. I picked her up and brought her to my place, we ordered pizza and had a few beers and enjoyed ourselves. The plan usually is that she takes my couch these nights as she often stays here (a lot of the times it's studying together though).\n\nLast night she was really intimate and kept holding my hand. One thing led to another, we were having sex on my bed. The sex was very good, but that level of intimacy with her was amazing, like something I had never experienced before in my life. After sex she laid on top of me and told me that this was her first time having sex and she's glad that it was with the right person. We slept in each other's arms. This morning I drove her home and when we arrived she kissed me and told me that she's glad that last night finally happened.\n\nI'm a little overwhelmed. On one hand I certainly love her and last night felt very right when it was happening, on the other hand I can't shake off this feeling of guilt that I'm having right now. I feel like she's been more or less isolated in her life because of her physical condition and I'm the first person who's really been her friend and she's opening up to me like that, not maybe because I'm the right one for her or that I deserve her but because I'm the only option. I feel like I'm taking advantage of her.\n\nI don't know what I should do. Are my thoughts valid? \n   \n**tl;dr**: Me with best friend who is disabled. We had sex and I feel like I took advantage of her because I'm her only close friend.",
        "permalink": "/r/relationships/comments/4ke30q/i_25m_had_sex_with_my_disabled_friend_24f_it_made/",
        "comments": [
            "[removed]",
            "Ignoring her disability for a moment. What are your feelings then? Are you dismissing this potential relationship because she's disabled?",
            "For the love of Pete, do NOT let her know how you're overthinking this.  You might want to ask if that was an impulse or just how she feels about you.\n\nIf you enjoyed it don't screw it up.  Sounds like she was happy about it.\n\nI mean if she initiated, was intimate, holding your hand, etc. that's a pretty clear sign she's into you.  You done got seduced son.  \n\nIf you're lucky you just took the first step down the path from friend to partner.\n\nMay very well be she's had feelings for you for a while.\n\nPlus only having one close friend...if she's an introvert that's perfectly normal.  \n\nIntrovert doesn't mean shy, it means you don't need or even want a lot of close relationships.  Other people are draining.  You can be friendly, the life of the party, sociable, entertaining, but only so much.\n\nYou're perfectly content just being alone or sometimes with a chosen partner.\n\nExtroverts thrive on socialization. Introverts enjoy socialization, but need time away.\n",
            "I know you've developed something of a protective attitude toward her, but she is still an educated, worldly adult.  If she says that she wants to pursue something, don't second guess her, she is capable of taking care of herself in this respect.\n\nThat being said, it may still be productive for both of you to talk about this, but don't do so in such a manner that it seems like the continuation of the relationship is contingent upon this concern being addressed.  Ask her if she's okay with this, tell her how you feel, and let her tell you that it's alright.  If she does, believe her, she the best authority in this regard.",
            "She doesn't have a mental disability that would make her unable to understand the ramifications, and thus consent to sex. You didn't do anything wrong.",
            "She's in love with you and you're in love with her, whether you know it or not. Don't let these feelings destroy the love you two have for each other. You say being intimate with her felt right, trust your instincts and let her trust hers.\n\nShe trusts you. Her family trust you. It's not because you're her only friend, it's because you're a great friend and a trustworthy person. You deserve her. Don't overthink it.",
            " Dude, stop over thinking this and start to enjoy it. You like her, she like you. You can have a great relationship together, be happy. ",
            "From what you are saying, it sounds like both of you are lucky that they found each other. The connection you have is rare. She wouldn't have felt that with \"any\" other person she would have met. \nI would understand your guilt if you didn't feel anything towards her and had manipulated her in order to have sex. It really doesn't sound like it's the case here. She loves you because you are you, not because you're the only friend she's ever had. \nYou are very lucky :-)",
            "You didn't take advantage of her; you gave her a wonderful experience.  \n\nIt sounds like the two of you have a great relationship with a lot in common and a amount of mutual caring. There is absolutely no reason for you to feel guilty.",
            "Dear Stupid,\n\nYou have good thing. Thinking screws up good thing. So stop thinking. Have good thing. Enjoy it.\n\nSincerely,\n\nAnother Stupid",
            "You are being naive if you think that you are the \"only option\"\n\n**She picked you!**\n------\n\n:-)\n\nSounds awesome, congratulations!",
            "Well, she obviously really loves and cares about you! She won't see it as taking advantage in any way. You might just want to talk with her about what you're feeling. It should lighten things up.",
            "Might these feelings be coming from a place of over protection from the past? I have a couple of disabled friends and as unneeded and patronizing as it is, I do feel very protective of them. Perhaps that combined with what happened last night and the ensuing feelings/hormone rushes is just fucking you up a bit? \n\nShe's happy, you're happy, this sounds like a good thing that could go places, nothing you're saying is coming off as you taking advantage of her or anything of the sort. \n\nStop worrying and start planning a nice date for you guys or something. ",
            "I am going to try to come at it from a different point of view.  People treat disabled people differently.  If its a physical disability, there is literally no reason to treat them different beyond reasonable accommodation (ramp for wheel chairs, but no you don't carry them in unless asked).  You were probably one of the FEW people who treated her like a NORMAL person, like she has a brain and her disability ISN\"T contagious.  That creates a special bond for some people, and is very precious.  \n\nAlso,  even if nothing else goes further in your relationship, the reason your sex was SO right is because you both genuinely cared for the other person.  You've developed a great friend relationship.  If you are both ready, its okay to take to next step.  (just because she can't walk, doesn't mean she lost all feeling down there etc.)\n\nEdit:  Just wanted to  add in answer to your question: NO you are not taking advantage of her.  She knew what she was doing, and seduced you.  If you are happy with the idea of having a relationship with her, GO FOR IT!\nExperience: Best friend is physically handicapped, she has been happily married for 12 years.",
            "With the title, I assumed you meant mentally disabled, so I'm very glad that I was deceived...\n\nThat being said, it's 2016. We've long since retired the word \"cripple\" and get the pity out of your head. She's an adult, you're an adult. **Live, Love, Be Happy.**\n\n### You found someone that makes you feel special.\n\nHold on to her as long as you can. Let her know how she makes you feel. Buy her flowers for no reason. Apologize when you do something wrong. Treat her as you would wish someone would treat your daughter.\n\n\n\n",
            "\"The sex was very good, but that level of intimacy with her was amazing, like something I had never experienced before in my life.\"\n\nI think this says it all. Don't overthink it, just go with it. Just because she's disabled doesn't mean you had sex with her out of pity. It sounds pretty well like you had sex with her because you are attracted to her as a person. ",
            "Even though she's disabled, her heart and her mind are working fine. Even if she was isolated for a lot of her life, she still has human needs and desires. Just because she was disadvantaged in a few ways in her life doesn't mean that you're taking advantage of her by default - she wanted this.\n\nIf last night was what you both wanted, then it was good and right. If she's happy, don't sweat it - you know you had no predatory designs on her, and you know you both had fun. \n\nJust let what happens happen. It sounds like you're both really solid together, so who knows where this could go?",
            "She's a consenting adult and so are you. You both enjoyed it, so let it happen.",
            "Honestly it sounds like you two had a beautiful night, and a strong connection. You love someone, that person loves you back. \nRemind yourself she is an adult, capable of forming relationships with who she wants to. This came from a friendship that seemed to be loving, fun, and caring. Sounds like you both fell in love with your bestfriend; kind of what everyone in the universe hopes for!",
            "Her mind is fine, she consented to the sex. By the sounds of things, she initiated it. Please don't question her choices just because she uses a wheelchair. To her, that's normal. Her chair and its routines are part of her life. She has agency to say yes or no like anyone else, for her own reasons. It's not up to you to imagine how she SHOULD feel. She shouldn't need to be shamed for having a sexuality. If you feel guilty those are YOUR feelings and its ok to have them, but don't look at her as Poor Lana In A Wheelchair, because that's not friendship.",
            "Wow, I was expecting something pretty terrible based on your title, but instead I found a post where you're really conscientious and thoughtful. \n  \nYour concerns are very valid. When all the happy feelings where off, you'll eventually sit down and have a talk with her about what kind of relationship you want to have going forward. That would be an excellent time to bring up your feelings. She'll probably reassure you, and you should be receptive to that. ",
            "Heh... almost sounds like she took advantage of YOU buddy!!  ;)\n\nQuit overthinking & friggin' enjoy it.  This doesn't happen often for any of us.",
            ">that level of intimacy with her was amazing, like something I had never experienced before in my life.\n\nThere is a song out there by Tim McGraw with the lyric \"'I love you' ain't no pick up line.\"  It's true, sex really is different when you are with someone you care about and who cares about you.\n\nLet your worries go, she is a full grown adult who knows what she wants and got it.  You happen to be it, so enjoy.  \n\nOne question though. Other then the \"taking advantage\" fear, how are you on a full relationship with her?  You said you saw her as a cousin.  Don't forget that just as much as her being somewhat isolated isn't a reason to stop, its also not a reason to force yourself to do it.  I really hope this last paragraph is unnecessary, because your post is cute as fuck and I think everyone here wants you to update in a year about your engagment.  But don't feel like you are trapped because of this either, if its not what you want.",
            "Holy shit, this sounds like the beginning of a romantic comedy. A rather good one.",
            "It is a beautiful thing, being in love with your best friend. You even note how amazing the level of intimacy is during sex. This can be your whole life, if you want it. You can second-guess everything, but really you only need to look at how you feel and how she feels.\n\nTo echo the theme of the advice given here, all you have to do is just let it happen.\n\nThank you for sharing; you've made my day.",
            "You could always look at her as being lucky. She lost her virginity to her best friend, someone she could trust, a person she loves. A lot of people these days don't get that their first time. She gets to know that the first time she had sex wasn't with someone who was just using her, but someone who'd stuck by her through everything.\n\nIt sounds like she initiated and both of you were extremely happy during and after. It's sweet of you to consider her feelings, but as many people have commented: her mind is as a consenting adult. She knew what she was doing and she wanted it bad enough to go after it.",
            "Don't let the world steal a good thing from you. Be selfish and keep her for yourself. Just start dating her.",
            "You sound like a really lovely person, she's lucky. You're lucky. Enjoy it. \n\nJust an observation but if you didn't care so much for her you wouldn't care about this issue. I think it's a legit thing to consider but let it wash past and just enjoy each other. I wish you both all the very best. ",
            "I want to write my own. My ex (Year and a half relationship) was disabled in their legs too. She would often ask me to move her body during sex as she couldn't.\n\nBeyond that (and the obvious restrictions of different positions) nothing at all was different from a normal relationship. Fully sound-minded adults who fell in love. \n\nWe broke up due to different levels of activity (Be that a cause of the disability or her personality I don't know because we would still go out) but her disability from a 'I feel guilty about her' was not an issue after the first month. I truly fell for her for who she was.\n\nYou aren't taking advantage of her. People are naturally socially awkward, shy or etc. I think you're pitying her due to the disability when really you have perfect relationship potential infront of you. \n\nIt won't be easy to navigate (there were some caregiving actions I did for my ex) but obviously no relationship is without trials. Give it a shot if that is what you are feeling. You aren't taking advantage of her at all!\n",
            "You obviously have a huge amount of feelings for her, even if you don't completely recognise what those feelings are are yet. Don't put too much pressure on yourself, and just let the connection grow into what it's going to be. You're a great guy, she came onto you as well as you coming onto her, and it sounds like it was an incredible night.\n\nStay respectful, stay true to yourself, and stay positive and let the good stuff happen. ",
            "you sound like you feel bad that you had sex with her because she is different.\n\nas long as it was consensual, you have nothing to feel bad about.\n\n you don't owe her a serious relationship just cause you had sex with her, but you should most definitely talk to her about what this means for both of you.\n\ntalk to her like any other partner and be honest, don't let her circumstances guilt you into staying or having a relationship that you are not 100% happy about. ",
            "How do you feel like you took advantage of her? She is an adult like you, capable of making her own decisions. You didn't use your friendship as a tool to get her into bed. It actually sounds like things happened that night exactly as she wanted them to happen. She was likely looking forward to making a move on you, possibly had even planned it a little.\n\nStop overthinking it and just enjoy what you have.",
            "Just remember that any disabled person is more than just their disability. What happened was a wonderful thing. Everyone needs love and affection. Be that for her.",
            "It does not sound like you are taking advantage or her. \n\nIf you are happy, she is happy, and hell, even her family is happy, what is the problem?\n\nYou both clearly love each other, have a happy relationship",
            "She is a grown woman. You didn't take advantage of her. She chose to be intimate with you because she trusts you and more than likely loves you. Just because she has a disability does not mean she needs constant pity or to be treated any different from any body else. ",
            "Dude!  You are very clearly head over heels for this girl - and by the sounds of it, she for you.  Stop worrying and thinking about it so much, go enjoy your relationship with her and hopefully it only blossoms from here.  ",
            "Look she had a good time with someone she could trust and wasn't going to hurt her. This is a win/win as first times go. \n\nBigger issue, you like her she's fun and you never thought of dating her? Is it just because of her disability? You should probably unpack that because my guess is she's had a crush on you and thinks this is a start of a relationship. If you don't think it's a relationship you need to figure that out and tell her ASAP. It will likely ruin the friendship but better sooner than later. ",
            "> The sex was very good, but that level of intimacy with her was amazing, like something I had never experienced before in my life.\n\nRun with this. It's incredibly sweet and special. You love her as the person she is and have been her friend. You are worthy of her love. \n\nOn another note. Did you use birth control. ",
            "Nobody's addressing you feeling \"overwhelmed\" but I think it's valid and warrants some quiet reflection. That sounds like a powerful experience, why not take some time to let it sink in.",
            "She is physically disabled, not mentally. \n\nIn no way were you taking advantage of her since she was clearly expressing interest. \n\nI think this is the struggle people with disabilities have. All the good people avoid them for fear of being judged so that leaves them with bad people who could care less about the moral dilema. ",
            "It sounds like she did the majority of the initiating (good for her!) and that is definitely YES YES YES I GIVE CONSENT LETS DO THIS kind of stuff. You did nothing wrong! She definitely made a choice in the matter - there's no way that reads as you taking advantage of her.\n\nNow you have fun, you crazy kids.",
            "I completely understand where you're coming from, but remember that she initiated the intimacy and she told you the next morning about how happy she was. If you want to date her, talk to her and see where it goes. ",
            "Got really emotional at this. Sounds fine to me bro! You sound like you both really care about each other and you shouldn't feel guilty at all!",
            "You are a lucky man.  She sounds like a keeper.  ",
            ">We had sex and I feel like I took advantage of her because I'm her only close friend. Are my thoughts valid?\n\nNo, they are not.\n",
            "Honestly from your tone posting + all the good things ypu have to say about her, it sounds like she isn't the only one with feelings. New relationships are scary b/c of the unknown. If I were in your ajoes (and I'm a man too), I'd give it a try. It sounds like you two are really comaptible.",
            "she's in love with you man. tread carefully. but it seems as if you like her too, it's just it was unexpected. it seems like you two have a lot in common, get along really well, it may be worth giving a shot - I'd take it slow though, she is really venerable(you're her first real friend, probably her first love, her first sexual partner). gl man",
            "Honey, you're her oyster, she's your oyster, go have lots if happy perfect sex together!  Also, all's fair in love and war, and this sounds like love to me. \n\nAlso, d'yknow how rare love is? You know how lucky you got? Go get her and have a happy life! :)",
            "Would you still be feeling guilty if she hadn't articulated what actually happened?  She's just calling it the way it is before you're ready to put it in words.  Hence turning to reddit to sort your feelings.  But your feelings are clear as day to everyone else, including her.",
            "She is an adult and she doesn't sound mentally incapable of giving consent in any way. It also sounds like you have some deep emotions for her that could be able to grow, if that's what you both want. I don't read anything here that makes me think either of you did anything wrong. \nBeing disabled doesn't make her any less deserving of a healthy sex life than anyone else and it doesn't mean that you took advantage of her either.\nYou two should have a talk about whether you want this to become something long term and what kind of relationship you both want, but there is no need for you to feel guilty for expressing yourself sexually with someone who fully consented, participated and was happy to have sex with you. \n",
            "Your thoughts are not fully valid because you seem like you really like her, perhaps even love her. You should talk to her and ask if she thinks you took advantage of her. If she says no then you didn't. If she says yes then you did. But you definitely need to communicate your feelings. ",
            "She likes you. \n\nDo you want to try out a relationship with her? If yes, ask her out formally. If not, tell her you aren't looking for a relationship but you had a great night and want to remain friends.",
            "My last serious girlfriend was also wheelchair bound because of her legs, so I can relate a little. It can be a little intimidating at first because you don't want to screw anything up, and you're afraid that you're taking advantage of her. Well, you're not. She's in control of all her mental faculties, she's just like you and me, except you moves around in a different way. Don't let it get in your head, have fun, and I hope you two end up having a great future. ",
            "If you are interested in her, I say go for it. She may have been a little isolated, but she isnt mentally disabled. Shes a big girl and can make that decision for herself. Dont feel guilty about enjoying someone because they have a disability. ",
            "Who better than someone who has really been her friend? \n\nAlso as others have pointed out, the disability is her legs not her brain. Taking advantage would be if you weren't really her friend but had let her think you were.",
            "Sounds like you are into her, and she is definitely into you. Whats the problem? Friends often make great partners ",
            "dont sabotage what could be a good thing with misplaced guilt ",
            "Your feelings are definitely valid and show that you're a good person. \n\nYou say that you're worried that you don't deserve her - I find it interesting that you say that, because from your own explanation you're one of her closest friends and you've been there by her side through a lot. \n\nRelationships usually aren't 'deserving' someone, except in situations where the one person is a crappy partner. That's pretty obviously not the case, here! You care about her and she cares about you, it sounds like the two of you have something special. I'd just go with it and see where it leads. ",
            "Dude treat her like a real person, and acknowledge her agency.  You guys are obviously in love.  There is no \"taking advantage\" here, and suggesting there is is kinda patronising.",
            "As someone that has often distanced myself from people and never been able to maintain long term friendships, I'd like to say you could just as easily be her first real friend BECAUSE she feels you're right for her, and not the other way around. My boyfriend is my best friend because I think he's amazing, and I don't just think he's amazing because he's my best friend. ",
            "Finding the right person to open up to is generally hard, she found that in you, and it seems that she does that for you too as you seem to have accepted intimacy with her with open arms.\n\nAs for your doubts. I think they are natural, but they also don't give your friend enough credit. She may be disabled and had many difficulties in her life, but that does not mean that she is incapable of knowing when she is loved. If anything, the challenges she had to overcome probably thought her to better appreciate people who accept her, and made her more capable of accepting others for who they are. That is not easily found, and in that respect, you are very lucky.\n\nRelax and give it a go, enjoy it.",
            "Speaking as a girl, her virginity story is now super awesome. She got to lose it with a very sweet man who was first and foremost clearly a dear friend. It doesn't get much better than that. \n\nSpeaking as someone who is not pretty much stuck in ye olde mobility scooter and has hip (and there for sex) issues, it's lovely to hear she's getting that experience and especially that it was exciting and rewarding for her partner. I worry about that a bit. \n\nI'm so happy for both of you, so enough of the guilt now! ",
            "She's still a grown woman with her own bodily autonomy and sexual agency. I think your concern comes from the fact that you love her and want to protect her but this was as much her decision as it was yours. If she didn't want you she wouldn't have taken things further. Relax and stop feeling guilty. Enjoy your new relationship with your best friend :)",
            "Don't make decisions for her. Make decisions for you. ",
            "As opposed to most other comments, I do understand where you're coming from. You say you are the first person who's really been her friend, and now her first \"true love\".\n\nWhile you may be in love with her now, there is no telling yet where the relationship will lead in the future. Even now she seems to be kinda dependent on you, which will only grow worse in a relationship.\n\nYou are not taking advantage of her now. However, the whole situation is set up for a huge asymmetry in commitment and emotional dependence.\n\nSo what's going to happen if eventually you decide that the relationship doesn't work for you anymore? You can do this in normal relationships. Could you do this with her?",
            "Don't feel guilty, you both made adult decisions, and it sounds like they were good decisions for both of you.",
            "Just be with your best friend.  Do you really think you can find a relationship with a different woman thats more fulfilling.  And ask your self if the same is true for her.  ",
            "You didn't take advantage of her... You said she initiated, right? And you responded.. You two have all the firmaments of a great relationship.. Trust, Friendship and caring... So the best advice I can give is just ENJOY YOUR LIFE! If you Love her, then LOVE HER. You haven't done anything but fall in love...",
            "I think the fact that she prefers to hangout with you you see yourself as her ONLY friend, but in reality she doesn't put energy into other people, she only seeks u out (to study or hangout). Therefore u think she can't make friends because of her disability but in reality she separate herself from otherssss because she likes you. \n\nMy work has disable people and I treat them as normal as possible, I'm actually nicer toward them and more accepting than the none-disable people so ur idea of her not being able to make friends because her disability is untrue.",
            "You didn't take advantage of her. She knew what she wanted, and you 2 showed each other a good time and that's partly because you are such good friends.\n\nYou'd be wise to have a heart-to-heart check in regarding feelings.",
            "wheres the problem? people like her are few and far between.",
            "Sounds to me you're guilty because you're worried your taking advantage of her. But that doesn't seem to be the case. Don't let worrying about screwing this up screw this up for you. She seems smitten and so do you. Enjoy it man. Nothing is better than being best friends with the woman you love. You obviously know how to treat her, and you both obviously care for each other. That is all you need.",
            "I would also take her feelings into consideration. While you may feel like she's isolated and that you're her only option is this what she feels? It's a little condescending of you to assume that she'd fall in love with anybody who came along. \n\nShe's still an adult and made the decision to sleep with you, just like you made the decision to sleep with her. It seems like you guys would have a good thing going, try not to get too into your own head about this.",
            "dude what you described sounds like a wonderful relationship that you both have. She clearly likes you alot and trust you more than anyone. If you want to be with her, do it!\n",
            "Your concerns are definitely valid. Ignoring the disabled part, she is still someone who is sexually/  socially inexperienced, and her experience with you *is* formative. \n\nThat is a responsibility & a burden, and you are rightly concerned about bearing it. \n\nAgain, leaving aside your feeling of whether you took advantage of her due to her disability, if you enjoyed the experience, and want to continue having sex with her (and her with you, of course) while staying friends or evolving your relationship to be more romantic in nature, then do so. \n\nIf you didn't enjoy it or don't want to have that type of relationship with her, for *whatever reason*, then talk to her about just being non sexual friends again, or stop being friends with her. \n\nShe is an adult woman who can exercise her own initiative. Other than exercising the camp site rule, don't engage in the soft bigotry of low expectations. \n",
            "If you want to be with her do it. If you feel like you dont, dont. If you feel like she is making a mistake normally its up to the other person to share that. Talk about this before you go any further with anything.",
            "If you just hump her and dump her you should feel really guilty. It sounds like you two love each other and you should pursue a relationship as that's probably where she thinks things are at between you two.",
            "Dude, you're guilty because you had good sex with someone you like a lot and have a close relationship with? \n\n If she can develop a close  relationship like the one she has with you she can obviously do it with other people and it sounds like, for whatever reason,  she elected not to.  \n\nMaybe it has something to do with her disability, maybe it doesn't. But either way, it's not your responsibility to make sure she has a full social life. Your  only responsibility is to your relationship with her, and it sounds like a great relationship. \n\nWhat it sounds like is actually going on is that your relationship with your friend has changed and you're not sure what to do or how you feel about it. Her disability doesn't enter into it.  You need to sit down, take a deep breath, and think about what you want out of this relationship, and if it's changed now that you've had sex.  ",
            "It's great you are concerned and thoughtful of how this may impact her. Your feelings seem sincere and just because you hadn't thought of her that way before, it has obviously developed into something beautiful and intimate. I think you should try being with her.",
            "Hey man, I would first like to agree with everyone here and say that it sounds like you two have found each other in this crazy world - and that what you have is truly a beautiful thing. Honestly, I was grinning happily the entire time I read this post (okay, not the part where you are sad, but you get the picture).\n\nI'd also like to add something else. While I am not disabled, I am an introvert and was always sort of unpopular all through my teens. I usually had one close friend at a time (which was fine by me, being an introvert), and even though I had intense crushes from time to time, they never amounted to anything.\n\nI fell in love with (and married! though that point for you is sometime in the future of course) the first guy I ever was in a true relationship with. Looking back, I realize now that us being close friends for a long time before we actually got together is what made me realize that we could be something more. We already had a trusting and amazing relationship even before our first kiss, before our first real make-out, before our first time having sex. And I'm so glad for that. I feel like I was able to hand-pick my partner for life, because I really got to know him and care for him platonically before anything else. And it sounds like you, too, are in such a position.\n\nNot everyone falls in love with their best friend, and that's okay. Sometimes the one they end up with is someone new and unexpected. But for you, and for me, it seems that we found that special someone and learned to treasure them in a wholly platonic way, only to fall in love with them later on and see them as something more. To build a romantic relationship on top of such a strong friendship is truly amazing.\n\nTrust your initial instinct that this feels right. You felt amazing (and it sounds like she did, too!) for a reason, and it's clear to those looking in that you're very much in love and well-suited for each other. I ask you to take a breath and let what happened sink in. It is real. Wherever this relationship goes, whether it lasts a lifetime or a few wonderful weeks, let it happen. It sounds like this girl is crazy for you (and she rightly should be!), and that you care for her deeply as well. I wish you all the best :)",
            "Would you feel guilty if she wasn't disabled? If not, stop discriminating and follow your heart. It sounds like you'll be happy together.",
            "Sounds hot. I bet she absolutely loved it. Don't let her down! She's probably thrilled to find someone that she loves to connect with this way. ",
            "your letting BS and false guilt get to you. you both clearly like each other. partners tend to bond with people who treat them the best (hence why best friends becoming lovers/married happens more then you think) So stop beating yourself up for something thats not true and just be happy mate.\n\n\nP.S; this plays out like a really cute romance novel :)",
            "To me it sounds like you two are a great fit for each other. She even confirmed her feelings by stating that she was happy that it happened finally.\n\nFurthermore the way you're writing about her says that you have a solid relationship going that probably make most very jealous.\n\nEnjoy the ride.",
            "Probably late to the party, but I think you should share this with her. It's incredibly sweet, and shows how much you care. Do you think you would feel this guilty if she had previous experience? If not, then you just empathize with her and feel bad. ",
            "She's a consenting adult, having a physical disability doesn't mean she can't date or consent to sex. She enjoyed it and was happy, you didn't take advantage of anything.",
            "I don't feel like there's anything to feel guilty about- it sounds like she clearly wanted YOU. But you guys sound very close, so I think as other people have said, talking to her about this would be good. I'm sure she wouldn't have taken it this far if she didn't want to. ",
            "Disabled lady here.  \n\nDon't overthink this.  You will never know what it's like to be looked at like you can't possibly be a sexual being because of your disability, or worse, to have people assume you're not mentally competent because you're physically disabled (which is what it sounds like you're doing here, just a little bit).  Your friend made this decision for herself, with you.  Don't second guess her.  You clearly have feelings for her, and she has feelings for you.\n\nJust relax, and be happy together :)",
            "Sounds like she's been waiting for you to make a move for a long time. \n     Maybe you feel bad because you kind of see her as a lonely, isolated invalid girl who puts far too much emotionally into a guy who pays attention to and values her, and you don't want to break her heart, ruining your existing friendship and making her feel taken advantage of. Maybe you also really like her, too. I know I sure wouldn't spend a lot of off-work time with a chick and let her sleep at my place if I didn't like her at least a little bit.\n     Maybe she doesn't see a romantic relationship with you, but wanted to finally lose her virginity, and knew you'd make her first experience a great one.\n      She's an adult woman, and your best friend. Just talk to her. If you really do like her, and her disability has been the wall between you and any sexual or romantic feelings for her, that was obviously broken down by what happened last night. Ask her how she feels and thinks about it. Any awkwardness in such a conversation is forgivable, you don't have to be James Bond. **Absolutely do not convey in any way, shape, or form that her disability was a significant factor in this whole thing. She already knows that people are hesitant to form relationships with her because of it, and she probably wouldn't want to have it confirmed that you were, too.**\n     Whatever happens, happens. Hope things go well.\n",
            ">I don't know what I should do. \n\nStart dating her, become a couple, and live happily ever after.\n\n",
            "You should respect her as a person (not pity her for her difficult life) and understand that she has needs and has made her choice to be intimate with you.",
            "Don't over think it man. She enjoyed and it she even said she's glad it \"finally\" happened. Meaning this is not some spur-of-the-moment thing.. She's probably been thinking about it and wanting it for some time. ",
            "Stop overthinking it.  She loves and wants to be with you because you are who she chose.   Now, figure out how you feel about her and if you love her..there you go. ",
            "All you need to know is this:\n\n1. You didn't promise her anything, the ball is in your court with where it goes. She didn't directly communicate her intent in sleeping with you so you shouldn't feel responsible if you both end up wanting different things.\n\n2. If you both truly love each other, and that bond is there, you shouldn't fight it, let it simply be.\n\n3. Despite being disabled, she can be self aware about her feelings and make her own decisions, and she consented to the sex despite the possible risks.\n\n4. If your feelings change because of her disability, don't go out with her.",
            "welcome to the left-hand path, brother",
            "If you feel guilty about anything, it should be for pitying her and feeling like she somehow has a diminished capacity to consent because of her disability--which obviously isn't the case. You should also probably tell her how you feel so she can decide for herself if she wants to be involved with someone who thinks of her like that--you owe her that much. As someone with \"special needs\", the worst thing people can do is assume what my needs are and act according to that--whereas if i needed something or their help I would always ask outright. You aren't her guardian and it's not your responsibility to be.",
            ">Last night she was really intimate and kept holding my hand. One thing led to another, we were having sex on my bed. \n\n>The sex was very good, but that level of intimacy with her was amazing, like something I had never experienced before in my life. \n\n>This morning I drove her home and when we arrived she kissed me and told me that she's glad that last night finally happened.\n\nI have a lot to talk about:\n\n1. She started the relationship. So manipulation could not exist on your end.\n\n2. It seems like you match and the sex is great. What more do you want?\n\n3. She is physically disabled, not mentally disabled. She loves you and you love her. Stop feeling bad and realize the awesome relationship you have! ",
            "This post made me (almost) cry cause you seem to love each other very much. I'm happy for the both of you. She sounds awesome. You do too. ",
            "> Last night she was really intimate and kept holding my hand.. we were having sex.. was very good.. After sex she laid on top of me and told me that this was her first time having sex and she's glad that it was with the right person.\n\nSo, simple enough mate, \nit's just NOT that you \"coaxed\"her to have sex with you. Or say, mixed something in her drinks like we often hear, or whatever.\n>\n\nSecondly, she HERSELF told you, admitted that she did enjoy it all. And well, don't forget that when you drove her home next morning,\n> she kissed me and told me that she's glad that last night finally happened.\n>\n\nSo, I just can NOT figure what's it that's making you feel guilty about it. \n>\n\nAfter all,\n- You didn't 'force' her.\n- You didn't 'threat' her,\n- You didn't 'rape' her, taking advantage of her disability that she just wouldn't be able to defend herself. She, and you both are adults as well.\n>\n\nAnd please, put that 'Cousin' part away from here completely, if you somehow, at the back of your mind, have that part as well making you worry, oh, feeling guilty. \n>\n\nThere's completely, another psychological theory about it. Let me know, if you're curious and really had that part making up all that 'guilt' thing. I'll let you know about it all, and in 1-2 sentences only, don't worry. I'm not some professor of psychology. Or of, lectures either!\n",
            "<\"On the one hand I love her\"\n\nWoah. Let's focus on that for a second. You spend loads of time with her, have a great time together, had great and intimate sex together and what's the problem here exactly? That she's disabled therefore you feel guilty? If you do love her (romantically) there's nothing to feel ashamed of. It sounds like your night together was amazing and you're probably afraid because you're falling for her. \n\nYou just handed in some massive piece of work. What a weight off your shoulders. Go out on a date with her. Take her somewhere cool and spend the day just keeping that intimacy you shared alive. Give this a chance before you do anything else. \n",
            "Damn, the fact you're even worrying about this..sounds to me like you're a good person. \n\nTalk to her, man. Have an honest conversation with her. Tell her how you feel. How being with her made you feel. Be honest. Don't hold back. Communication communication communication. It's the most important thing you can have in a relationship. \n\nIt sounds like y'all care about each other so much. You're allowed to care about her in that way. ",
            "The best relationships start our as friendships. ",
            "Dude she woud not have chosen U if U were not the 1 & you 2 woud not have had the chemistry you did if it wasn't right. But you 2 did. meaning there is nothing wrong with it. Stop overanalyzing it & give it a try atleast.",
            "You are the right one. You need to try and build up your self confidence. \n\nIf you love her and she loves you there is no issue. ",
            "By your logic childhood love is illegitimate because the lovers became as such before other options even existed to them. And if young enough, sex might have come later than the relationship did, mind you.\n\nWhat you're doing now is ignoring her right to think and justify freely, because *you* feel the need to think and justify things *for* her. \"I'm not sure this is right because you might do it for the wrong reasons,\" is a legitimate concern to express in itself, but deciding things for another is not. Besides, love is de facto a \"you're special and that's why I have feelings for you\" kind of thing, so asking if it's all right that she has feelings for you because you are special is a bit over thinking it, isn't it? She is a paraplegic, not comatose. She can think for herself, and she did. Accept her feelings and decide on those of your own: are they the same? Just make sure you answer that last question without weighing in the disability. It's about the person inside the body, not about the body.\n\nOn a side note, if you love her so much, why are you asking Reddit? Just tell her you're worried about her and use the line above if you need (the 'you might be doing it for the wrong reasons' one). She ought only to admire your worries for her well-being, IMHO. Best case scenario: she considers your worries, contemplates the notion, and then decides in full awareness to stick to her plan and hook up with you.\n\n**TL;DR**: you're over thinking it. Stahp. Plus, she's an adult, responsible human being, and you are taking this away from her if you deny her the right to choose this way forward. Voicing your concern however is very justified, and I would even suggest it.",
            "Sounds like you did a good thing for her.",
            "That was fucking beautiful. Like one of the few Lifetime movies with a happy ending. I am kind of choking up.\n\nLook, she is not \"disabled.\" There is a woman in there, a red blooded woman who wants you more than oxygen. She is floating on cloud nine. Somebody, finally, saw her as a woman. And she was good enough. For one shining moment she was exactly, perfectly right. And you gave that to her.\n\nThere is no guilt. Pick up the phone and ask to see her again. I can tell you want to. \n\nThis is just damned beautiful. ",
            "Don't worry, friend. If you'd pressured her into sex and she said yes because you're her only friend, yeah, that would've been bad, but you didn't do that. You were kind and respectful and treated her as an equal and when *she* expressed sexual interest you reciprocated because you think she's great. You've absolutely done everything right, here. By all means go and date this girl you clearly love who loves you and live happily ever after.  =) ",
            "How do you feel towards her, aside from these (legitimate, thoughtful) worries about a potential power imbalance?",
            "You opened a new world for hef.\n\nMy friend is disabled after being hit by a truck at the age of 10. She's almost 40 now and her only sexual experience was with a guy who used her for one night and then told her he was engaged to someone else.\n\nYou had a mutually loving experience with Lana and you have real feelings for her.",
            "aww, you really care about her.  don't worry I am sure she thinks she took advantage of you a little too.  It is awesome you found love.  ",
            "C'mon man, we're all isolated if you really think about it. At your age, you maybe have gotten to know a hundred or a couple hundred people. Out of what, 7 billion? None of us are going to meet \"THE one\".\n\nWe all look for someone we want to get closer to and try our best. \n\nSo try your best, and if it doesn't work out, it doesn't work out.\n\nGet out of your head!",
            "Sounds like the start of a good relationship.\n\nBest friends tend to eventually develop feelings and want to be together, there is nothing wrong with that.",
            "I would hate for you to miss out on a good thing because of guilt that shouldn't be there. She was consenting, yes? You're both mentally matched, yes? You care \nfor each other, yes? Look beyond the fragile China doll aspect, her family does that for her, and see what you have. Maybe you have already been together all this time and it's time for you to face the music and enjoy falling into something so many others struggle to achieve. ",
            "This is so cute",
            "You never mentioned how you felt. Do you like her romantically? Skip the disability stuff that's irrelevant. ",
            "People have similar feelings when they get a promotion at work. They've proven themselves to their superior that they're worthy of the promotion, but once they get it, suddenly they feel like a fake, a fraud, that they're only good at the job they had and won't do well at their new higher position. \n\nThat's your relationship with her. You guys deserve each other. Promote this dedicated proven friendship into an intimate friendship, and you'll have a best friend for life. \nMarriage, I'm; talking about marriage. ",
            "Physically disabled people are just regular people like anyone else. It sounds like both of you enjoyed having sex and being intimate. Don't treat her like she's fragile or easy to take advantage of just because she's in a wheelchair. Having sex with a disabled person who wants to have sex isn't taking advantage of them. The issues with friends and intimacy seem more like the result of her mind, e.g. ruminating over being disabled or simply a personality flaw. Cute story though, you guys should take things slowly, but it seems like you are both really into each other.",
            "I totally get what you mean. I think some people are misunderstanding that your concern is not about her disability after all you already love spending time with her and you've had years of adapting to her disability which hasn't stopped you from wanting to hang out with her and connecting with her. \n\nyour issue is that you feel insecure that her feelings for you could be for the wrong reasons. Voice your concerns that you know she could get many other men and have lots of friends but because she hasn't really gotten \"out there\" in the dating game, your afraid that she might be settling for you since she hasn't explored her other options. \n\nI'm sure she will reassure you, that even if she went out and dated other guys, and made other nice friends, your the person she wants romantically none the less, her family loves you, she loves you and she connects you like no one else and she is not settling, your the one who makes her happiest. Let her reassure you and don't feel guilty! \n\nIf you are concerned about becoming codependent transitioning into a relationship due to Lana's rather isolated social life, you could try to encourage her to develop confidence in making new friends/ joining new social interactions. After all, in a relationship, you support one another to develop as individuals too.",
            "Give it a try OP !! It certainly wasn't pity sex (as it seemed from the title), something is \"flowing\" between you guys ! I say go for it !!!",
            "I understand your concerns and I think you are a great guy for trying to understand her feelings. That being said, she is not mentally disabled and she is 24 years old. She can consent to sex. Don't feel like you took advantage of her, because you didn't. ",
            "Dude, an amazing story and I just hope that you can both talk, that you follow your good feelings rather than sticking to the mainstream, and that it all works out.  ",
            "Just be happy and get onto it, you both care for each other and it's all that matters.\n\nI used to have a friend who's in a relationship with a physically disabled women and those two are the cutest couple I've ever seen, they have such a close relationship.",
            "My hubby and I were great friends for quite some time before it just happened one night and we fell in love. Similar to OP's story yet no one was disabled. ",
            "From the way you're talking, it sounds like you have feelings for her (romantic feelings) too. It's not taking advantage for two adults who have feelings for each other to get together. If I were you, I would stop over thinking things and just be happy that you met someone that you enjoy and who feels the same way about you. \n\nAlso, as an aside about dating someone who has a disability, my advice would be to not underestimate what she is capable of. My fiancé is missing a hand (born that way) and when we first started dating my first instinct was to offer to help him with things that I personally don't think I could do with one hand (like cut his meat for him.) It wasn't out of any feelings of, like, contempt for his abilities or anything like that. I was more coming at it from the position of \"if I broke my hand and couldn't use it, I would be grateful for someone who wanted to help me.\" But that's the wrong way to think about it; if you break your hand or legs, that's usually temporary, so you may not ever have to develop the skills to deal with it, where as someone with a long term disability may well have figured it out a long time ago and be offended that you think they can't do something. I never acted on my impulses to be helpful, instead I took a \"wait and see\" approach meaning to wait and see how he reacts to it, and if he asks for my help or seems to really be struggling with it, then help or offer to. Turns out, he doesn't need my help with shit. Forget cutting his own meat and tying his own shoes, dude can do everything I can do and then some. He's got it handled. He also (much later in our relationship) told me that he was so upset one time when he was like 18 and his grandpa asked him if he could tie his shoes. Glad I didn't ask about cutting his meat on that second date! Point being, don't underestimate her or think that you know her limits or what she's capable of. Let her show you her limits. They may be a lot less than you would initially think. ",
            "I think you are objectifying her.  She is a human being; she is your friend.  You made her year.  You seem to really like and respect her.  Just think of her as a human being who likes you.",
            "I don't think you should be feeling guilty, it sounds like she iniated it. It sounds like you built up a really good relationship with her over the years and she wanted to move things in a romantic direction. It sounds like you really enjoyed the experience on a lot of levels. I honestly don't think her disability is a factor here. If you wouldn't feel guilty if this was a \"normal\" person you shouldn't feel guilty now. The disabled people I knew wouldn't want you to think any different of them than you would someone who wasn't. If you want my opinion I think you two should explore a relationship. ",
            "Just have to throw this out there, imagine what she's thinking right now.",
            "There shouldn't be any guilt if u like her because she clearly likes u?  ",
            "She's happy, you had an intimate time together.  What are you guilty of?  You should think about that and re-evauluate your relationship with her.  To maintain what it was before or to escalate that into something more.  ",
            "It's funny because in a way, the concerns you have are actually explained away by the reason for the concerns.\n\nYou're concerned, because noone else has been interested in a friendship with her, and so you feel like she has been forced into a position where you're her only option and she may not necessarily like you for you?\n\nBut the fact is, she likes you for you, BECAUSE you are a kind person who saw her for her, and chose to be her friend and get to know the real her, beyond her disability, when others wouldn't. \n\nIt sounds like, if this develops further, it's starting off from a strong foundation, I would put your concerns to rest\n",
            "My man, you gotta start thinking. Do you want to be with her? Is the disability a deal breaker? Ask yourself these questions and think about it.\n\nFrom what it sounds like idk if you were \"taking advantage of her\" but nothing here says that. You know the situation, I don't.",
            "This is really wonderful. ",
            "Just enjoy what you two have and don't worry about the rest of the world. \nPerhaps you feel more uneasy because she admitted to you that you were her first... ",
            "She's a grown woman who had sex with someone she greatly values and has feelings for. Happens a million times a day around the world. I am happy for the two of you!",
            "Hi! I don't think you are taking advantage of her, for me everything looks okay, you both enjoy yourselfs as the human being you are, that's it. I mean she have the opportunity to met a lot of people even if she is disabled of her legs, I think her feelings are the right ones, you both have being friends for years and then of all those years os relationships she decide by her own to have sex with you. She must feel something wonderful for you.",
            "Plenty of able-bodied girls have few or no close friends and could fit this scenario OP. She clearly makes you happy.",
            "If she's been sheltered for much of her life by her family, I wouldn't be surprised if she's also been treated like she's incapable of knowing her own mind/what she wants. Don't contribute to that. Trust that she's an adult who knows what she wants and treat her as such. \n\nThis is coming from someone with a physical disability (almost complete paraplegia, use a wheelchair full time). I've dealt with both didn't of the spectrum - those who think I need all the support in the world and am incapable of knowing my own mind, and those who treat me like any other person (my husband is a good example of this). \n\nBe open and honest with her about how you feel. I grew up around a lot of Paralympic athletes and disabled people who lived very full lives thanks to the fact that my mom is also in a wheelchair so I know for a fact that most people with physical disabilities can live very full and independent lives when given the opportunity. The best thing you can do is have an open and honest conversation with her. ",
            "I get that you want to look out for her and not take advantage. So now ask yourself; Are you taking advantage? The way you described your relationship and interaction sounds like a functioning and caring relationship. Hell, I could tell you loved her, on some level, by the way you described ordering pizza with her. Don't write this off. Maybe you are meant to be best friends in a different way. You've found a woman you relate to on a deep and personal level. You are comfortable with her and like being around her. Maybe there's something there. ",
            "Well first and foremost, don't go all white knight on her or you'll lose your friend. Just be open and honest about it with her. Tell her exactly what you just said. That your afraid she chose you because your the only available option and you don't want to enter into something if she isn't legitimately into you. (don't say anything like you taking advantage of her....most disabled people would feel deeply offended if you imply they aren't capable of taking care of themself)",
            "At least she'll never be the one that got away, OP.\n\nseriously, though, I say go for it if you feel it.  You already see her as a PERSON, so the fact that she's differently abled shouldn't affect moral choice.  \n\nJust do it.",
            "You are as guiltless as a guilt-free young man can be. Her morning gladness was a proof of that. You two should do it again sometime.",
            "It is a rather complicated situation. I don't think that such an encounter is easy to put past. Yet you don't have to enter into a relationship out of compassion or fear of doing wrong by her. May sound cruel, but she did what she did willingly - you didn't trick her into it. \n\nGood luck and tread lightly. ",
            "I think you must definitely watch an Indian movie named 'Margarita, with a Straw'\nIt's the same case! And they have beautifully shown that even disabled people have sexual feelings and we ignore them and just focus on their disability.\nSo I will definitely recommend you to watch it asap.\nThank u",
            "Dude I wouldn't worry too much, she's a grown educated woman, and you are a grown educated man. You are not her only option, but the right option for her. You've been her friend for years, been there to help her, so she knows you're the perfect guy for her.",
            "You seem to really like her. She seems to REALLY like you.\n\nI'm confused what the problem is. This could actually turn into a relationship if you weren't so caught up on the fact that she is disabled.",
            "My girlfriend is in a wheelchair.  We have been together for almost 3 years. I dont notice a differwnce in our relationship compared to those ive had with people without disabilities. I think disability is a bad way to describe it, my GF cant walk, but she has done more in life than most people i know, and it sounds like your friend is the same way. When describing people in wheelchairs stol the description at people. The chair is not important. The lack of mobility does lead to some issues with self esteem in dealing with limitations, but also creates very strong people. Im not sure if your feeljng of guilt comes from her being in a chair or the fact you had seen her as a friend. Either way she sounds like an amazing girl and you seem to care for her a lot. The person youre in a relationship should be your best friend. Also, just because she is in a chair doesnt mean that she wants or enjoys sex any less, trust me, my girlfriend loves sex and is great at it. Dont feel anything but happiness about what happened between you two. I say go for it amd enjoy what is in the future for you 2.",
            "> I picked her up...\n\nI'm so so sorry, but that was gold.",
            "You HAVE to give an update!",
            "You love her. It seems like she loves you. See where it goes, you could potentially be very happy for a long time together.",
            "\"Picked her up\" ( ͡° ͜ʖ ͡°) \n\nEdit: I know I'm being down voted, but I still think this is gold so I'm gonna leave it here :)",
            "Ouch, buddy! No other option? You really think a college age girl can't get laid because she uses a wheelchair? Get over your weird ablism--- she's not a child, you didn't take advantage. STFU and don't ruin this for her.",
            "F*CKING TALK TO HER",
            ">  but because I'm the only option.\n\nThat depends on her personality. Is she desperate? Trans people don't have many options but most I know don't lower their standards. So with her, the question isn't about where other people would date her, but whether she would date anyone who gave her the time of day. If she is desperate then she as to deal with that, but if she has standards, then don't worry.\n\nAnd you didn't take advantage of her. She made her choice to bang you. If you starting using her desperation (assuming it was there) as leverage against her, then sure, you'd be taking advantage. But If you're just taking a genuine interest in her and her in you, then don't worry.",
            "10 up votes says shes hot.",
            "[removed]",
            "No you're not, but pehaps she is taking advantage of you?",
            "[removed]"
        ]
    },
    {
        "post_id": "53q92i",
        "author": "lackofdog",
        "title": "My [27m] fiancee [26f] and I are finally in a place where we can get a dog. She just admitted that she doesn't want a dog, and never has. Considering ending things over this.",
        "url": "https://www.reddit.com/r/relationships/comments/53q92i/my_27m_fiancee_26f_and_i_are_finally_in_a_place/",
        "score": 2901,
        "num_comments": 1013,
        "created_utc": 1474413361.0,
        "selftext": "Hi reddit. My fiancee Ali and I have been together for 4 years, living together for 2, recently got engaged. Our relationship has been great for the most part, one of the few things we disagree on is animals. I love animals and Ali feels indifferent towards most animals. \n\nTo give a little background about me - I've always been an animal lover. Throughout my childhood, my mom hated animals, especially dogs. My mom never let us have any pets and she used to tell us that once we were adults we could have whatever animals we wanted. \n\nWhen I moved away for college, I lived on campus for 4 years (and therefore couldn't have any pets). I've wanted a dog for as long as I could remember, but up until recently it wasn't in the cards for me to have a dog. Ali and I currently live in a not-so-pet-friendly city for renters. I always lived in apartments that never allowed pets, even with a pet deposit. \n\nWhen Ali and I met I told her about wanting to get a dog someday. Ali told me that she doesn't like a lot of dogs, but would be open to the right dog. This was in the very beginning of us meeting - I basically made it really clear that I will own a dog one day.\n\nThroughout our relationship, I would occasionally bring up wanting a dog. Ali would remind me that our apartment doesn't allow for pets (which was true). Ali and I agreed that once we moved into a place that allowed for pets, we would look into getting a dog. \n\nAbout 2 months ago Ali and I moved into a house just outside of the city we work in. The house is a good size for the 2 of us (plus extra), the landlord is pet-friendly, and the house has a huge, fenced in yard. It's a much more residential area, and there's a dog park about 3 blocks from the house. \n\nOn top of the house being perfect for a dog, I'm in a financial place where I can afford a dog. I make very good money and I don't have to travel for work. I'm mentally prepared for potential pet fees and other expenses for having people watch the dog. \n\nSince we're finally settled in the house, I decided to mention to Ali again about going to the shelter and looking at the adoptable dogs. Only this time, Ali didn't have an excuse for why we couldn't get one. After a few weak excuses (i.e. sometimes we go away), Ali broke down and told me that she doesn't want a dog. In fact, she's never wanted a dog. She was hoping I would forget about my dreams of wanting a dog. \n\nI'm not sure what to do. I'm trying to reason with Ali but she said her answer will always be \"no\" to a dog. She just doesn't like them and doesn't want them. She basically gave me an ultimatum - either her, or my potential dog. \n\nI'm feeling shitty about this, because I always made it clear to her that I was going to want a dog someday. I feel like she was banking on something unrealistic, and now she's putting me in a lousy spot. \n\nIs there a way to compromise on this? \n\nTL;DR - Girlfriend and I can finally get a dog, she admitted that she doesn't want a dog and never has. She gave me an ultimatum - either her or a dog. \n\n\n",
        "permalink": "/r/relationships/comments/53q92i/my_27m_fiancee_26f_and_i_are_finally_in_a_place/",
        "comments": [
            "I never wanted a dog but my husband did. I agreed to getting one because it was important to him. Our agreement was that he takes care of all dog related things. The dog whines to go out at 2am? My husband gets up and deals with it. He vomits on the floor? Still husband's job. I've grow to adore the dog too and now help out more, but knowing that I didn't have to deal with the bulk of the issues really helped me adjust. I can't say this will work for you, but maybe there is a way to compromise here. Maybe she's afraid of the upkeep and cleaning? I understand being upset she lied and don't blame you if this is a deal breaker. If you are open to discussing it, I would just suggest seeing why she doesn't want a dog. ",
            "I think the bigger issue is the way she communicates and has basically lied to you about something that is really important to you.  It is a big breach of trust.  I think that is something that needs to be considered carefully. \n\nShe has now put you in the horrible position of being \"the bad guy\" who she would tell people picked a \"dog\" over her!  When the reality is that she has intentionally misled you about something that she knows is very important to you - or at best, completely discounted something that is very important to you.  She isn't treating you with respect or like a partner.  ",
            "[deleted]",
            "Good news is, you can meet plenty of nice girls at the dog park near your house.",
            "She's banking on the fact that you've built this whole life together in order to force you into giving up your dream of owning a dog. And now that she's confronted with her lies, she gets to act like you're being petty and choosing an imaginary pet over the woman you asked to spend the rest of your life with.\n\nYou either stay and give in to her long con, never getting your dog, or you break up and she gets a sob story about how she was dumped for a hypothetical dog.\n\nHave you ever seen this type of behavior from her before? Has she been passive aggressive or manipulative or uncommunicative before now? If not, it may be that she agreed early on because she didn't want to jeopardize things and didn't realize how much it meant to you until it was too late, and then just completely mishandled things.\n\nIf she has, then this is just a bigger example of what a manipulative asshole you're engaged to. \n\nI hope it's the former, but the fact that she won't discuss it and she put an ultimatum on you to force you into doing what she wants is a big red flag that suggests the latter. ",
            "[deleted]",
            "It isn't about the dog. It's about her lying to you for the entirety of your relationship. \n\nThat is not the way to have healthy communication. \n\nShe knew you'd not date her if she ever told the truth, so she lied. She dated you under false pretenses. Is that really the kind of person you want to marry? ",
            "A dog will love you forever and unconditionally you know. Just saying.",
            "Part of my requirements for a partner include being a cat lover. It's non negotiable for me. My cat is a part of my life and no one can ever change that. You made it clear that having a dog was part of your future plans on multiple occasions. I don't understand how she could think you would change your mind.",
            "Well, if she's given you an ultimatum, then no, there's no compromise. What a dick move on her part. Bring a dog home and tell her she can pack her things.\n\nSo sorry about this.",
            "I'm right there with you.  This would be a deal breaker for me.  It sounds to me like you've already made up your mind.  Even if she waivers for you, she'll always resent the dog.  She basically manipulated you by lying about being agreeable to a dog, knowing full well she really doesn't like them.  I don't take well to manipulation myself.  Do you?",
            "She pulled a really hurtful long con on you.  She lied to you for years and years just so you would stay with her.  That's incredibly unhealthy for a relationship.  It doesn't matter what she lied about.  She has terrible communication techniques and lied to you for years.  I would never be able to get over that.  What else is she willing to lie about in order to get you to stay with her? ",
            "My life is animals so I completely understand your love. I have two dogs and work with dogs and cats for a living. I also had to wait to get a dog until my life settled. I would have been devastated if my husband switched on me like that. Loving animals is a deal breaker for me. It's a fundamental and very important thing for me. \n\nBreaking things off wouldn't really be about the dog. It would be about lying and fundamental differences in how you want to live your life. I see it no different than lying about wanting children. Both require a certain type of lifestyle and responsibility that not everyone wants. ",
            "Dog stuff aside, she is not a woman who is ready to be a wife. \n\nThis is her major conflict resolution strategy. Tell half truths/lie, avoid, and hope her partner changes (drops) common reasonable and mainstream things about himself. \n\nI love dogs but I do not want to own one in the city. It's just so much more of a micromanaging responsibility. If I shacked up with an urban dog owner I'd be very up front about not wanting dog responsibility. No poop and scoops, no walks, and I would prefer to stay later at parties if good times are still flowing if he had to go walk the dog and be responsible. \n\nThe misrepresentation of her stance and enthusiasm super sucks and has complicated problems. But, I personally feel that cohabitating with your dog that you're responsible for seems like a good compromise. ",
            "[deleted]",
            "you'll be happier with the dog",
            "The way to compromise on this is for her not to have strung you along the entire length of your relationship and lied to you saying she'd be willing to have a dog when she knew she was going to slam you with a \"Me or your dream\" ultimatum.  What else has she done this on?  How would you feel if she'd done this about kids? If she'd lied to you about being open to one day having kids, would you be willing to stay with her?  \n\nIs it REALLY any different? It's not WHAT she deceived you over, its' the fact that she felt it was perfectly acceptable to string you along and lie to you, only to say, I've been lying the whole time and now you have to choose, me or the thing you've been totally upfront from the beginning about wanting in your life. \n\nThere's no compromise. She agrees to get a dog or you dump her like the lying piece of trash she is. I wouldn't even give her the option of keeping her word.  She's deceived you all the way down the line. ",
            "I am a huge dog lover. All of the compromises I can think of (get another animal, volunteer at a pet shelter, etc) really pale in comparison to having your own dog. I wasn't in a position to own a dog until I was 22 and it was always my dream. I have literally broken up with someone because they didn't like my (very cute, well behaved) dog. \n\nPets are important and you made it clear this was important to you. She lied and lead you on and hoped to dissuade you from something important to you. \n\nGood luck with your new dog!",
            "Have you asked her what her reasons are for not liking them?  For some people it can be fur (poodles don't shed or if they do its not noticeable I've ever seen it)  could be the chewing (can adopt an older dog that's outgrown the phase)  could be that they are always moving (look at breeds)  could be that is the work (you make sure she knows she won't have to take care of it) basically what I'm saying is,  talk to her about her reasons and see if it's something you could work on a compromise with you getting your dog and her not getting the part she doesn't like. ",
            "Just break up. Truth be told, you're making it clear that you'd rather have a dog than have her as a girlfriend, and you can always get another girlfriend who loves dogs.  If this is how you feel, it just wasn't meant to be.",
            "This is like lying about wanting children. But hairier and you can put them in a kennel when you go out of town.\n\nI'd get a dog and break up with her. Or vice versa.",
            "This might be a silly suggestion, but what if you did some volunteering with a rescue group to expose her to dogs more slowly and show that you are serious about the responsibility? After some time, maybe she will agree to temporary fostering.  If she will agree to it on a trial basis with no commitment she might change her mind. If her mind doesn't change, then at least a few dogs will be walked or one might have a bit of a break from living in a cage, and you will know for sure that it won't work out.\n\nI have said no to dogs in my relationship before because I know the level of responsibility and the limit it places on your day to day flexibility. It does suck that you guys aren't on the same page about this though.",
            "I'm rather neutral about this, as I too do not ever want a dog while my husband does, but I said as much from the beginning. I think they're messy, smelly, always needing attention, expensive: just not good for me, but I was honest.\n\nThe thing is, she can decide not to want a dog. She shouldn't be made to feel like a bad person because she doesn't.\n\n*But* you can decide to not be with someone who cannot fulfill a part of your happiness and you shouldn't feel like a bad person because you do.\n\nI'd say the bigger flag is she was terrible at communicating this. You've spent 4 years on a relationship that may be undone because she wasn't 100% unfront and honest. That would not be a deal breaker for me, but I don't want a dog at all, ever. I'd say weigh the pros and cons of staying together and then weigh that against how likely it is that she can learn to communicate better. If you choose to stay together, remember compromise isn't a weakness. If you choose to end things, I hope you get the best doggy ever.\n\nTL;DR You shouldn't feel bad, but not wanting a dog doesn't make her a bad person. She'll need to learn to communicate waaaay better if you're going to work.",
            "You could get a foster dog. She might learn that she either does like dogs, likes that particular  dog, or see how happy you are when you have a dog and compromise.",
            "If its important enough to you to break up over I think you should let her know how strongly you feel about it.  If an issue like that was that important to my partner i'd give in.",
            "I'd break up with someone over this. I want a dog like some people want kids. If my partner did this to me, there'd be no going back.",
            "Ali was the name of my first dog. She was an absolute sweetheart, honestly, the best dog ever. Your girlfriend deceived you, and I would not blame you for leaving her over it.",
            "Be thankful she showed her true feelings before you married her. Make it clear that your plans haven't changed and won't change. She's welcome to use the door if she won't live with you and your dog. ",
            "When you initially brought it up at the beginning of the relationship and she didn't enthusiastically agree with you about the idea of a dog, you shouldn't have taken that for what it was: a hesitant maybe. I'm surprised you're blindsided by this decision. It sounds like, in your eagerness, you have projected your own desires onto her. Everyone is saying she outright lied to you, but I feel like that might not be as cut and dry. It sounds like she gave you middle of the road answers to pacify you, but was also vocal about being hesitant. A common way people do this is to frame it in a way that removes themselves from the equation, ex: we can't have a dog because of our apartment. \n\nSince it sounds like there was no room for negotiation on this subject, I can't say I blame her necessarily, though I have to agree with others that this is not healthy communication. It's your call whether you end the relationship over this (which is perfectly reasonable). My only question is that if this was relationship breaker all those years ago, did you explicitly say so? If so, why did you choose to stay with her over a tentative and hypothetical maybe? ",
            "I don't know, guys. It seems to me that, though he was clear he HOPED to have a dog one day, she never promised to get one. She said they'd \"look into it,\" she said (early on!) that she would be \"open to the right dog.\" \n\nIt really doesn't sound to me like she seriously promised you anything. Everyone screeching about her \"lying\" to you don't know how you phrased it, or how she phrased it. I highly doubt she knew it would be such a huge dealbreaker for you, like ABSOLUTE END OF THE RELATIONSHIP dealbreaker. \n\nTo people who don't like dogs, \"I want a dog someday\" doesn't exactly sound binding. \n\nI'd talk to her more. Seriously, you love this woman. Surely you can find a compromise. Depending on where you live, maybe you can have an \"outdoor\" dog. (I know people in the States recoil in HORROR at this idea, but in Ireland it's quite normal for the dog to live in a cozy doghouse, hang out in the yard, and never go in the house, etc. I'm sure there's some compromise.  ",
            "If I were a petty person who loved drama I'd bring home a dog. She's making you out to be the bad guy 'he'd rather pick an imaginary dog over me' and putting it on you to break up with her. But nah, flip the script, take out the imaginary, 'I always said I wanted a dog the whole relationship then when I got snuffles she dumped me - how could you not love snuffles?'",
            "Lots of replies are calling her a liar. I think that's really unfair to her the way you put it OP. \n\nWhen you first met she said she didn't like dogs but might be open to the right one. That's hardly gushing about how much she likes dogs. In fact that might be pretty honest she meets someone in one of their first dates shes not sure how long the relationship will last, she doesn't like dogs but sure this theoretical right dog might be ok. \n\nShe then every time you bring up dogs has said we can't have one in our current living situation. Again, not lying, maybe she could have been clearer that the problem wasn't the apartment it was the concept of the dog. \n\nThen she said that you could *look into* getting a dog when you moved into a better place. Again she's hardly singing dog's praises. But again poor wording. \n\nI'm not telling you which way to go. Only you know that, but I just think people are being way too mean about your girlfriend here. She hasn't been super clear the whole time but it's pretty obvious she hasn't ever wanted a dog. I think now that it's a real possibility she just realised how much she really didn't want one. ",
            "Is there a way to make her more open to a dog? Maybe a foster system? Prove to her that you can watch a dog and show that she wouldn't need to do anything with it if she didn't want to. Maybe borrow someone's dog. She didn't want to ruin your dreams, her goal wasn't to crush you. ",
            "Yea, this would be a deal breaker for me. I love cats. My last one died while I was in school and I thought it was best to wait until I had moved and found a job. Then I met my girlfriend. For a variety of reasons, we had to decide fairly early on if there was any potential to our relationship. We talked about a lot of things to make sure we were generally on the same page. We talked some about some very serious topics-marriage, religion, kids, money, career goals, geographic goals, health, etc. But one topic I made sure to broach was cats. I made it clear that I'd loved cats long before her, that I would get a cat no matter what, and that I wanted one as soon as possible. Like you, I'm reasonable. There have been some close calls at some pet stores (rescues, not kittens bred for sale), but we still don't have a cat because it's not practical with our current life. However, if my girlfriend were to tell me that she'd never be okay with a cat, I would break up with her instantly (and then move and immediately get a cat). I would feel betrayed and duped. I would also not be okay with giving up on my dreams of having many cats over my lifetime. Your girlfriend should have been honest with you from the beginning and let you decide then if you were still interested in dating her. Instead she deceived you. Do you know what pets are really great for? Giving you cuddles and a distraction when you're getting over a break up! Go get yourself a dog! ",
            "I did not want a dog. My husband did. We finally got a dog after 10 years together and he never touched the dog at all. Didn't pay for anything, didn't clean anything, complained about everything. Thr dog was my best friend. She died at 18 months after a lengthy medical issue. It killed me. He insisted we get another dog and in my grief I agreed. He doesn't touch this dog. He doesn't do anything but ask to get rid of it. \n\nDogs are like kids. You only get them if both people agree and if you don't agree, break up and find someone with your same values. \n\n",
            "She doesn't want a dog, even if it means losing you.\n\nYou do want a dog, even if it means losing her.\n\nIt sounds like there's an easy fix here where everybody gets what they want. She values not having a dog over your relationship, and you value having one over your relationship.\n",
            "I think people here are very quick to say break up, but they're not in the relationship, you are. You've been with her for four years. I don't think you should break up with her just based off of this. I would talk to her, figure out why she doesn't like dogs, see if there's a compromise that can be reached. Maybe she had a bad experience with dogs in her childhood, maybe she was never exposed to them so she doesn't understand why you want one so badly, but you won't know until you talk to her. And if that doesn't work and you feel like you can't be in a relationship with her anymore then break up with her. \n\nBut you gotta talk to her first. She lied about being ok with a dog. In all fairness, that sucks, but on a list of horrible deceitful things, it's nowhere near the top. ",
            "Here's my take on it. It's not going to be the popular one because reddit loves dogs and telling people to break up, but here it is anyway. \n\nShe's your fiance. You've pledged to marry her, which means you intend to spend the rest of your life with her. You want her to be a part of your family,until you die. If you're willing to break up with her over a dog that you don't have, especially when you've never had a dog and may not even like it when you actually do, I don't think your relationship with her was that strong to begin with and you should consider the commitment you're about to make. It would be different if you already had a dog and she said you had to get rid of it, or if your dog died and she doesn't want another. But you've never had a dog at all. \n\nHOWEVER, if you're thinking of breaking up with her because she deceived you and disregarded your wants and needs, that's a valid reason to explore breaking up with her. \n\nBut you gotta be honest about why. You can't use the latter as an excuse for the former. If you're really just mad that she won't let you get a dog, you seriously gotta think about what marriage actually means to you. \n\nAnyway, good luck. ",
            "There will be no good result if you compromise with a person who doesn't like dogs. If you still get a dog, there's no guarantee your dog will be treated right by your fiancee. I will probably get downvoted for this but don't compromise especially when there is another life involved. Based on experience, the person who doesn't like dogs will do everything to get rid of it. ",
            "be open with her and talk to her about it. i agree with others comments that it's misleading but maybe she also feels scared or something and the ~ultimatum~ may not really be an ultimatum if you both talk openly and honestly about it.\n\nif you both are planning on spending your lives together these are the kinds of things you'll be facing in the future anyway and you'll have to be open and honest to each other all the time.\n\ntell her that you're upset and feel mislead by her - don't dance around that fact, because its not helpful. you could be freaking out and over analyzing things that aren't happening, or she could be. Or you could be correct and she could really be a little manipulative.\n\nexplain to her why you've wanted a dog and what it means to you and why you're upset and just be completely honest. If she's the one you wanted to spend your life with it's silly to give your relationship up over a dog* (mind you i am 120% pro dog), but if she truly is completely intent on you not owning one while its something deeply important for you then she needs to realise that marriage and relationships involve compromise and that shes hurt and mislead you and your hopes for the future.\n\ni saw another person suggest noticing if this is the only way shes mislead you or if this is the only problem you guys have with your relationship. Maybe this topic has brought up other doubts you have as well?\n\nI don't feel comfortable telling you what I think you should do one way or the other - its completely up to you.\nBut if you dont openly communicate and she's unable to compromise with something that truly matters to you and she was already aware of that... then I don't see this ending too well\n\n-----EDIT----\n* its silly for HER to give up a relationship over a dog as well as OP.\ni feel like if she really loved OP and wanted to stay she wouldnt mind. maybe she is very scared and having doubts too and looking for reasons to leave and trying to play that card also?\n\nsorry to leave this on a neg note but i realised i didnt word that paragraph right",
            "I just wanted to give another perspective, similar i guess to the top comment. I keep coming back and reading this thread and feeling mega guilty, but here's a short rundown of my story.\n\nI've never wanted a dog.  Not been a dog person, and for me #1 it absolutely is the upkeep and cleaning.  I am a busy, career driven person, and my cat is the max care I can deal with (and you can leave her alone at home with food for up to 4 days).  I don't like picking up poop, or needing to come home or arrange for something every day.  I don't like piles of fur all over everything.\n\nBut I fell in love with a guy with a dog, and he is an extremely lovable dog, well behaved, one of the best trained I've seen, and an angel.  \nWe are married now.  The dog is very sweet.  \n\nBUT, all the grossness and things I was afraid of about dogs has come to a head.  My husband is simply just not bothered by the smelliness, constant hair on the ground, and shit in the yard.  I'm the sole gardener, and i'm constantly having to step over piles of uncleaned dog shit, there will be 20-30 giant piles of poo in the yard before I snap and finally nag him.  The floor is covered in fur.  \n\nHe constantly guilts me for not allowing the dog in my recording studio but I just want one place, particularly the place full of small electronics and cables, that is not full of fur and dog stank.\n\nAnyways, not trying to hijack the thread, maybe I should start my own and ask everyone \"is this marriage doomed to fail\"?  but the point is, from my point of view - I would be absolutely fine and adjusted to the dog if my partner was a devoted and attentive owner in terms of cleanliness.  But he's not.  He maintains that eventually \"the poop will just dissolve into the ground\" (Sure it will, but do I have to walk around in gross dog shit for six months until it does?) and isn't bothered by what he admits is the dog's \"stink\".  \n\nSo I feel like the more important issue could be whether you guys are on the same page as to cleanliness and general life habits.  If I had a partner more OCD and he was always vacuuming, picking up the dog poop, and, oh, actually making arrangements in advance to have the dog taken care of when we're going away (instead of ME always having to pick up the slack at the last minute).... I really wouldn't be bothered by it.  Instead, I have a lovable, sweet, stench-emanating creature who shits and sheds everywhere, that I never would have gotten of my own accord.  I would pet him more, if he didn't smell so bad.",
            "Kids, pets, and religion. These are the 'big 3' of dealbreakers in relationships.\n\nIt is totally okay for you to want pets. It is totally okay for her to not want pets. Unfortunately, it is very hard to find a compromise on pets, as you either have them or you don't.\n\nYou'll need to decide which is more important to you, because it sounds like you are going to have to choose between one or the other.",
            "Awe man. I'm sorry this just sucks. Ultimatums are usually not good, but you go get yourself your dog my friend. Screw her , she lied to you for years - to me this is on par if you wanted kids and she lied about it for years that she did too. People may think they are not the same thing , but I am never having kids ,but I absolutely want at least two dogs- its a big commitment and responsibility. I wouldn't be with someone who didn't want dogs, much like two people who have different stances on children . To me this is a deal breaker and j think you should go get your pup and you'll find someone who loves dogs too- like in 101 Dalmatians. All the best. ",
            "I want dogs someday and there's no way I'd let anyone come in the way of that. I had two dogs at home when I was young and can't think about never having a dog again. The best part about dogs is how happy they are to see you. When I moved away I would come home every one or two years. It's cheesy but the best part was knowing how happy my dog would be. I remember going home once and seeing him come running toward me (he was a dachshund) so I layed on the ground and let him smash his neck onto my face and wiggle around. That's how he hugged. \n\nIf your fiance can't get into that then it sucks but it's just something not for her and probably never will be. I'd be afraid of her possibly hurting the dog if you ended up getting one. People that don't like dogs will have short tempers with them.\n\n",
            "You have so completely fetishized owning a dog that I honestly think you turned a blind eye to Ali's obvious unwillingness to have one while thinking she'll get over it.",
            "If you can, explain to her that she misled you and kind of put you in a bad position. Tell her you will take care of all the responsibilities of owning a dog. However if she hates dogs that much and wouldn't be able to fathom being around it or god forbid became abusive towards it you may want to reconsider. ",
            "I got married to someone who told me he also didn't want kids. I was up front about it from the beginning of our relationship. Then after being married a few years he said he had always wanted kids and assumed that my clock would start ticking and I would change my mind. Now we are divorced. ",
            "Its a really bad relationship strategy to give ultimatums about things that are very important or integral to a persons happiness.\n\nYour gf, probably doesnt really understand that there is a real risk of alienating you so much with her ultimatum that you might infact break up with her. Not so much chose the dog over her, but realise she isnt a compatible partner, both because of the adversity to dogs, but more because of the ultimatum and lack of compromise. \n\nI think you should make it clear to her that you are actually considering that the two of you may not be compatible at all, and that you are very unhappy about her communication skills, and complete lack of regard for something you have repeadedly verbalised was important to you. - From decieving you into thinking she would be open to adopt a dog, to straight up ultimatum is such a huge landscape where constructive communication could have occurred. But didnt.\n\nIts not a healthy way to build relationship strategy or a good precedence for future conflict solving. That means, if you do break up with her, dont let her have the delusion that its because of the specifics of the dog. ",
            "I have family that don't care for pets. Thankfully they don't have any.  Animals just don't matter to them and they would likely, not through any real maliciousness on their part, more forgetfulness; neglect a pet. \n\nThat is why I wouldn't force pet ownership on anyone. I just spent $400 in vet bills alone on my dog last month, but I love my dog so it was worth it to me. If my husband didn't care for the dog it would cause a lot of strain on our relationship because medical problems do pop up from time to time. If she is as adamant about not wanting pets as you about are wanting pets, then there might be no compromise possible.\n\n\n\n",
            "Late to the party here, but:\n\nIts possible that this is difference in the way that dog lovers and dog indifferent folk look at pet discussions.\n\nTo me, it looks possible that OP's partner didn't understand the weight of what it meant to OP when he said he wanted a dog.  To a dog lover - and there a plenty on this thread - this can be as big a deal as the 'having kids' conversation.  Its a defining milestone in the future, and a part of what you are.\n\nIf you're not a dog person, though, it simply might not register as that definitive.  You might hear it in the same manner as hearing a partner say that they want to run a bar, or visit India.  Something they talk about, sure, but its not necessarily final, or a core ambition.\n\nRemember that they have spent their entire relationships without a dog - this is how OP's partner has experienced the two of them so far.  The absence of a dog so keenly felt by OP is the relationship status quo for her.\n\nWe don't know how their conversations went.  Its possible that OP thought he was making a clear and definite ambition known, but it just didn't register as such for OP's partner.\n\nIts definitely important enough to both of them that the relationship is at stake now.  But I think to say that OP's partner lied is way too strong.\n\nOP, get a dog.  Or don't.  Only you know if the relationship is worth it.  But if you might be about to break up over this, take some time to talk through a dog-owner's life with your partner, who might not have seen this the way you do.  After all, what would you have to lose?",
            "It's kind of unbelievable that you're thinking of ending a relationship over a dog that doesn't even exist. I mean, do you love this dog that you haven't even met yet THAT much more than this woman? The fact that you're even considering this leads me to believe that maybe your relationship has some much larger underlying issues and you're just using this fictional dog as an excuse to get out. I mean, in a healthy relationship, you both would just find a way to compromise.  Maybe you could volunteer at a dog shelter?",
            "If you're considering breaking up over this, you should not move forward with your engagement. She reacted badly, with a panicked attempt at manipulation. But you're taking that on it's face, when it sounds to me like she's worried. Rather than playing into it, this is a chance for you to both communicate better. If the relationship really is good, be the more mature communicator and reassure her: \"I care about you more than the hypothetical dog. But we need to compromise on this issue — I want a dog in my life.\"\n\nSeeing it from her perspective, it basically seems like you're going from 0 to 60. You've both never owned a dog, for your own reasons, but you personally have always dreamed of fulfilling that childhood fantasy of dog ownership. Well, first of all, you will not get that fantasy experience, because you will ultimately be responsible for all of the not-great aspects of pet ownership, while as a kid there's always a safety net there. \n\nAnd second of all, have you worked up to this in any way? Have you pet-sat your friends' dogs? Stayed over with someone who has dogs for a few weeks? Volunteered at the shelter you're hoping to adopt from? Thought about fostering a dog first, to get the hang of caring for one day in and day out? Have you even had a conversation about size, breed, age, or any of the other details before simply saying: \"I'm so excited that I can now go adopt a dog!\" \n\nIf you've done some of these things or something comparable, you're right, she lied to you, because those seem like firm steps towards dog ownership. But remember, she gave you a hesitant \"maybe\" about \"the RIGHT dog\" YEARS AGO. It sounds like you haven't taken the time to find out what that would be for her, and she, a person who still generally doesn't like dogs, feels that you're pushing her out of this relationship to make room for one rather abruptly. \n\nYou also don't mention any of the reasons why she doesn't like dogs or isn't excited about potential dog ownership. Too loud? Messy? Worried about allergies? She just wants to relax after getting home from work? Scared of them? Had plans to have a summer house in France? It's possible she just has a general antipathy for dogs, but if you've never even bothered to ask any details about why, you're just as bad as she is for doing the exact same thing to you (never probing to see what you were thinking about when/how you wanted to get a dog). \n\nI see a lot of people comparing this to having children, but that seems unfair to me. Unless one person already has children going into the relationship, any new parents will be experiencing it for the first time, and since we were all once kids, it's hard to imagine anyone who simply doesn't have ANY knowledge about what they're generally like. I think it's more like... owning a boat. If early into a relationship, someone wistfully told me: \"I'd love to own a boat one day,\" but never had any experience sailing or even spends time on boats, I'd be really surprised if after four years all of a sudden they told me they wanted to use our shared resourced to buy a boat that summer! It can mean a million different things and very different levels of commitment (is it a yacht, canoe, kayak, fishing boat, tugboat?), and someone can not like them for a million reasons, ranging from inexperience to being a jerk to PTSD and trauma. \n\nIf you care enough about this relationship to even think about getting married, try more communication and at least get to the bottom of what you're both thinking. It's possible that you're racing into this too fast and it's possible that her reaction is selfish and insecure rather than a long-term lie. Both can be worked through. ",
            "I really don't like living in a house with animals. I don't like how worked up everyone gets over them and how they're constantly a topic of conversation, I don't like the hustle when you're trying to make food in the kitchen, and I don't like never getting to make last-minute plans because the dog needs to be cared for. One of my biggest fears is falling in love with a dog person.\n\nA few years ago I fell in love with a woman with a dog, and tried it out because he was very well-trained. I still was constantly anxious and on-edge every time we were in the same room. It eventually lead to our breakup. \n\nNot all people dislike dogs just because they personally don't want to deal with the upkeep -- it may be deeper-seated issues about how she wants the energy of the home to feel.\n\nTalk to her openly about what the core of her issues are. Some may be compromisable, but others might not be. That will determine if you need to leave or not. ",
            "My boyfriend is \"eh\" about pets. I want a furry zoo.\n\nOur compromise is that I'm the primary caregiver for the pets. If he needs to he'll help me with some things, but I'm the one that feeds them, cleans up most of their messes, and so on. And it would absolutely be a deal breaker if he told me I couldn't be with him and get a pet I really wanted.\n\nShe intentionally lied to you about something she knew was important to you. She shouldn't be allowed to lie to get you where she wants you, then reveal the truth when she thinks it's too late in the game for you to leave her.\n\nDogs are wonderful pets. I've never met a truly bad dog. But do you really want a fiancée that lies so you do what she wants?",
            "It's basically like compromising on having a kid... only with a shorter lifespan, and you can get rid of pets easier than children. People who have children they don't want end up resenting their child and their partner, and the relationship can fall apart quite easily. Same deal with pets. \n\nBut she's put you in a tough spot by lying to you all this time, and as someone who is buying a house with the intent of getting a puppy, I really feel for you. It was not fair to you that she played along in the hopes that you'd just forget about it.\n\nI don't think you're being petty or foolish for considering breaking up with her over this because you told her all along that getting a dog was important to you. If this is the thing that is a dealbreaker for you, then it's important enough to break up over. ",
            "Honestly, OP, it saddens me to hear that you two could end an otherwise-successful relationship over this disagreement, but I am kind of on your side. Pets are very rewarding for those of us who love animals. My mom is an animal lover and my father kind of despises them (oddly enough, he loved our first dog before my sister was born, but you can see him turn cold to the dog as soon as she's around in old videos). My dad *has* learned to live with pets because they make the rest of us happy, but my parents have the same exact fight when they get a new pet.\n\nOne *potential* short-term compromise could be to foster dogs. Let her know that you have always wanted a dog and you want one now, but you don't want to lose her. Ask her if she'd be open to a kind of temporary pet to see if dogs would grow on her at all. The other compromise would be a different kind of animal. None are quite like dogs, but lots of different pets can also be rewarding.",
            "Whoa whoa this is a shitty way of communicating. If this post is indicative of how you speak about your dream of having a dog it's obvious that this is both important and thought out on your end. What if this was kids instead? Or a future dream career that involves travel? Would she have also put it off until she was cornered and you looked like the bad guy if she disagreed with those goals? \n\nI recommend serious reconsidering on your part if this relationship is healthy for you.",
            "*\"You can be with me but only if you give up your lifelong dreams.\"*\n\nWhat happened to supporting your partner so they can reach their dreams?\n\nYou should be concerned about the fact that she trivialized your hopes and dreams to the point where she was banking on you just about forgetting them, and then using your relationship as leverage to get her way. ie: blackmail\n\nThe thing about blackmail is that when you leverage something that remains as leverage after the fact, it can be used over and over, which is a pretty damned unethical and a terribly unhealthy presence to have in your relationship.\n\nIf it was a deal-breaker for her, she should have mentioned it long ago. What she did was a dirty trick, and unless the situation can be salvaged, getting her way will leave a dark stain on your relationship for a long time to come. You've nurtured the commitment to own a dog since how old? And she wants you to drop it, not because dropping it will add something to the relationship or remove something bad, but just so you can maintain the relationship? Talk about a horrible tradeoff.\n\nSpeaking of talking, this is a good opportunity to discuss how good communication keeps relationships healthy, and conversely, how bad communication can destroy it.",
            "I can see where you are coming from but at the same time are you seeing where she is coming from? You are talking about how you always wanted a dog and when you have the ability to get a dog YOU WILL GET ONE. seems like regardless of the other person's feelings about it. it's kind of like without her input of if you should both get a dog it was more of a when YOU get a dog she can come help you pick it out. if you are in a long term relationship you should also take her feelings into account and learn a bit more as to why she doesn't want a dog and explain to her why you really want one.\n\nalso if you are really interested in getting a dog, see if she would be interested in at the very least pet sitting a friends dog with you for maybe a week. ",
            "I am a huge dog person. Like you, I always hounded my parents for a dog growing up but we lived in apartments. And if someone did to me what she did to you, I would 100% choose the dog. \n\nI understand that you have a relationship and have been together for four years, but she has known the WHOLE TIME that she would never want a dog. She basically led you on the whole time. Instead of thinking to herself, \"hey, I like this guy, but clearly dogs are important to him, and I hate dogs, maybe we shouldn't be together,\" and then doing just that, she lied to you in the hopes that one day your love for her would beat out your lifelong desire to have a dog. Personally, there is no way I could stay with someone who did that to me.\n\nPlus dogs love you unconditionally and are awesome. ",
            "Has something happened in her past that has given her problems with animals? If so, understandable and I would forgive someone if they truly had a problem with animals rather than just not wanting one. Also, do you love her? Thats another thing you need to think about-- do you think you could leave her forever? Maybe if she doesn't have a fear of dogs and go to a shelter together, she may warm up.",
            "There should be a way to compromise on this, but doesn't seem like she wants to. My boyfriend loves dogs and similarly mentioned wanting to get a dog pretty early in our relationship. I've always been afraid of dogs and never had a pet, but knew my fear was pretty irrational and that it'd make my boyfriend really happy. We got a dog this past spring. I'm still getting used to him, but I've grown to love the dog even though he has too much energy sometimes. I feel like she should be willing to try if she has no reason for her \"no\" other than not liking them. Has she ever had one?",
            "Yeah, wow, sorry that she put you in this situation. This wouldn't be choosing a dog over your fiancee. This is not \"her or the dog\".  This would be choosing to not be in a relationship with a person who's communication skills are so stunted that they intentionally mislead you for years and then give you an ultimatum regarding something they've known you always wanted. Poor communication skills, deception and lack of trust are perfectly valid reasons to not want to be in a relationship with someone. ",
            "It's really not fair of her to blindside you with an ultimatum, and I'm sure she knows that. Think about it this way (and maybe ask your fiancee to think about it this way too): Will you be happy if you never, ever get to own a dog your entire life? If you want children, will you be happy creating the same rule for them that your mom had for you? If a dog is essential to your happiness, and not having a dog is essential to hers, you're probably not compatible. It sucks, but there it is, and she should have been honest about that from the beginning instead of hoping you'd just sort of forget your lifelong dream of dog ownership *even as you picked out a place to live together in part because it would be suitable for a dog*. (The way she went about this was not great, to say the least.)\n\nI've seen animal-lover/animal-disliker relationships where person A would get a pet and person B would make them give away their pets after x time had passed, or where the animal-disliker ended up resenting the animals themselves, or where the animal-lover ended up being hurt by their pet being a constant source of tension. If you can't quite see eye-to-eye on animals, you have to at least be willing to figure out what you both can live with for the rest of your lives. At the very least, she needs to back down from the ultimatum and be willing to discuss. If she can't have an animal around, any animal, ever, you have to decide if that can be the rest of your life. If it can't, you need to make it clear that you don't think you can be happy never having any pets. And if you do arrive at a compromise OR give up on dogs OR she agrees to let you have one, then you still need some serious discussions about being honest with each other. As someone who needs animals to be happy and knows that, I would be feeling very hurt and betrayed right now. And I'd choose the dog, but that's me.",
            "Get a golden retriever or a yellow lab. No one can hate those amazing pooches. ",
            "If you are already considering ending things over this than you should.  Not saying it's a bad thing but if your wanting a dog more than staying with her it was never meant to be anyways.  Same goes for her side of the ultimatum as well. If you getting a dog is enough for her to end the relationship with her than it wasn't meant to be.",
            "You and your new dog are gonna be really happy in your new place. With a dog park nearby I'm sure you'll find like minded individuals like yourself who enjoy dogs just as much as you.",
            ">She basically gave me an ultimatum\n\nmaybe verify that this is an actual ultimatum",
            "> She was hoping I would forget about my dreams of wanting a dog.\n\nKeep this in mind. You aren't breaking up with her because of a dog. You're breaking up with her because she spent 2 years waiting for you to give up on your dream, and settle down to be the way she wanted you to be.\n\nFuck. That. Noise.",
            "It's funny how everyone here is a relationship counsellor. Everyone just sit the fuck down and calm your titties. It doesn't have to be a lose win situation. \n\nI'm not a relationship counsellor but here's' my 2 (you can choose to follow it or not):\n\nOP what I suggest you do is find out why she dislikes having dogs. It could stem from her past or perhaps even cultural beliefs. After you find out why don't explode like she did but try emphasise with her and try your hardest to persuade her. You have built quite a relationship with this Ali and it would seem rather unfortunate if your relationship is ruined. All the best mate. ",
            "Given that you have never own or taking care of a dog for any extended period of time, you might consider giving it a try before breaking up with your long term GF. ",
            "For four years she lied to you.  It should make you wonder what else she is lying to you about.  Sure she is framing this as just about a dog, but what about kids or where you live how will you ever know if she is telling you the truth.  Get the dog, tell the gf to take a walk.  ",
            "The lying is the more important things.\n\nHowever, as someone who doesn't like dogs even a little, wanting a dog was a longstanding dealbreaker for me.  (Unlike your GF, however, I was always upfront about it.)  It's completely fair for a dog lover like you to break up over NOT wanting a dog.  We're allowed to choose for ourselves what is important in our lives, because we're the ones who have to live them.  Doesn't matter if your GF or your friends or her friends who whoever think it's not a valid reason- it's something that is important to YOU.",
            "I'd ask her why she thought it was fair to lead you on for years about having a dog someday and then just say no. This isn't just about a pet. This is about dishonesty and lack of will to compromise. If she cared about you at all, I'd figure she'd at least try. You were very clear and honest with your intentions, but you're the bad guy because this is important to you in a relationship? \n\nThis would be up there with kids for me. I wouldn't be with someone who didn't want kids, and likewise, I wouldn't be with someone who didn't want pets. It's an important part of my life, and the right person for me isn't going to be someone who doesn't like dogs.",
            "I think their is a ton more unhealthy stuff going on with this relationship than just a dog. If she is willing to leave you over a dog, and you are ready to leave her, you can't possibly love each other enough for marriage or kids. Those deep in love feelings are just clearly not there between you two. I'd say at best, you like each other at this point. I personally don't say this often in here but, you two should break up yesterday",
            "Oh boy. This really sucks. There are a couple of troubling issues. First is that she couldn't be honest with you from the beginning about never wanting a dog. Second is that she is willing to let you go if you decide to get a dog. If she was honest from the start you could have made an informed decision whether you wanted to continue a relationship with her. I like you was not allowed to have animals growing up and always knew I wanted a dog someday. At this time I have 2 dogs and I love them dearly. I don't think there is a compromise based on the fact that your fiancé is willing to walk away if you get a dog. The question is are you willing to walk away from a woman you were planning on marrying to fulfill your dream of having a dog. ",
            "Go and get the dog you want. Maybe she'll back down, maybe she'll leave, either way at least you'll have a dog.  \n\nWhile you're at it, consider signing up to raise a seeing eye dog puppy instead of getting your \"forever\" dog right away. You'll learn how to train and care for a dog, you'll do a good deed to feel proud of your whole life, and she'll really look like an asshole when she dumps you over it.",
            "Honestly I couldnt live without pets in my life. All of my SO's have always known this. She should have been upfront about it. \n\nMaybe she will come around, if she is willing to comprimise. ",
            "If you are a dog lover, don't ever commit yourself to someone who doesn't like dogs. Period. End of discussion. I can assure you, without any reservations at all, that it will not end well.",
            "> About 2 months ago Ali and I moved into a house just outside of the city we work in. The house is a good size for the 2 of us (plus extra), the landlord is pet-friendly, and the house has a huge, fenced in yard. It's a much more residential area, and there's a dog park about 3 blocks from the house\n\nShe put you through the trouble of finding and moving into a perfect place for a dog before finally being honest (when she no longer had a choice)?   What a shitty person.\n\nThis is about two things.  One, you wanting a dog.  That's simple.  Two,  she pretended to sign on to something important to you for her own benefit (to move the relationship along; presumably at the beginning a \"no dogs ever\" statement would have been more likely to end things).  This is basically treating your feelings and priorities as something to get around rather than something important to her too.\n\n",
            "You're not compatible and she's dishonest.\n\nWhen* you get a dog, you'll find it's a real chick magnet, and hopefully you'll attract a much better woman. \n\n*When. Not if. When.",
            "A dog would never do that to you. Clear communication, a loving partnership, and blanket honesty honesty are what a dog offers!",
            "I'd go with the dog myself. Dogs don't spin a web of bullshit for 2 years and then turn around and say \"sorry! I lied!\" \n\nPlus dogs are awesome minus the poop.",
            "I'm almost like u OP. \n\nI live with my grandparents until 7yo and they had a couple of dogs cuz it was a large house. Then my partner moved to an apartment and I could not have a dog anymore... I miss that life. \n\nBut I know that someday I will be able to have a house big enough to afford having a dog (or maybe more). \n\nNow to your situation, I personally would consider ending that relationship because of the sad life without a pet and the fact that the person I love is the reason I'm not totally happy. She should have been honest right from the start and putting you on a place where you are the bad guy is not something you do to the love of your life. \n\nHope things end well for you OP, gl and choose wisely.",
            "I've had names picked out for future dogs for all of the 23 years my hubby and I have been together. We didn't get one until we bought a house because in our early years, we moved quite a bit for school and work and didn't want to be in a position where we couldn't find a place that accepted pets. \n\nHubby was never the type of dog nut I was but when we got Oliver from the Humane Society, I broke my ankle the next morning. Long story short, he and Oliver bonded while I was in the hospital and also from the fact that he did all of the walks for the first nine months or so. Oliver is his dog. He adores him. If anything is remotely wrong with him, my husband has him booked into the vet to check it out. \n\nIt's really unfortunate she lied and that she's not willing to give a dog a chance. \n\nBy the way, I think it's great you're looking at getting a shelter pet. Both of ours are from the Humane Society and we love the heck out of them. \n\nGood luck, whatever happens. I just hope you wind up with a dog. ",
            "If she's open to compromising then definitely make it clear you'll do all the work. If she's worried about mess try getting a dog that doesn't shed? Would you have broken up if she had told you at the beginning that dogs were a hard no?",
            "I think should have a final talk with her, telling her that you care about her thats why is important that she agree with having  the dog and answer any question why is the problem with the dogs. if say no without, you luck with the next one. \n\nYou can find someone like her who likes dogs and  can be more trustful more. ",
            "I am not a dog/cat person - at all.  It's a huge deal breaker for me.  And Ali fucked up by saying she'd be ok with it if she wasn't.  So, is there any middle ground?  Maybe.  Is there a breed that won't shed hair (which is one of my *no way* things and might be one of hers?).  Will you absolutely look after your dog and make sure it is trained well and she won't have to deal with it a) slobbering all over her, b) having to take it out and pick up it's shit, c) be forced or guilted into 'loving' it?\n\nLike I say - not everyone is a pet person, and if your girlfriend isn't but she's doing her best then that should be enough and tread lightly - it might take a long time for her to curl up on the couch with your dog (the very idea makes me dry puke) - but she's making an effort.",
            "My fiancé and I made a compromise about this. She is a HUGE dog lover and has two. They take up the bed and I'm a light sleeper. If it were up to me, I'd rather them sleep out in the living room with comfy beds or on the couch with blankets, etc. so I said, I love this woman and my sleep too. So I have my own room for sleep. If the dogs bark, she handles it. She's happy and I'm happy because we agreed to compromise. I've grown to love her dogs and find myself spoiling them a little too much. :)\n\nI say you get your dream pup and let your fiancé get used to the pup. Talk about compromise. It's your life too and you seem like you'd make a great pooch owner. Way too many homeless animals out there.",
            "It sounds like she is being childish. Firstly, this is her fault. Second, she is literally saying rather than take responsibility for her mistake she would rather leave you.\n\nHer not having a dog seems to be more important to her than you. That type of personality and lack of responsibility is a bad combo my friend. Now that you're making good money you'd had better protect it by not marrying her. (Of course all I know about her is what you wrote, but its not looking good) Seems like the type of person that would take everything you got if you divorced.",
            "Try fostering a dog! Tell her you'll take all the responsibilities of that dog and if you didn't stand up to your word you don't get to keep the dog, but most probably you will and you'll j get to adopt the dog and keep him forever and during that fostering time she'll probably grow to love him so she'll change her mind! \n\nIf she doesn't agree to the fostering idea, drop her lol. ",
            "My question is....why is it up to her? Why does she get to say no when you say yes...why is she the final answer?  Marriage is all about give and take...all about compromise. If it is your dream to own a dog and you have had this dream since forever, then she should be willing to try. Maybe she does not have to take the dog out? Or she doesn't have to clean up after it....anything. I just don't understand why she wants to crush your dreams on something that is so loving.  Good luck to you, I hope it works out.",
            "Just go out and get the dog. Let her worry about her next home.\n\nShe's been lying to you this whole time. ",
            "She lied to you about something that is very, very important to you. Personally, I think that's more cause for concern. Quite frankly, if it was me personally, I would leave. \n\nI love animals too and if my boyfriend had lied about this at the beginning of the relationship and only admitted to me 4 years down the line he didn't want any, It would be justifiable for me to leave him. The compatibility would not be there and I don't think it's there for you two.",
            "Choose the relationship that will be full of joy, trust, dependability and unconditional love.  \n\nYou'll get over Ali.",
            "If she's completely unwilling to get a dog then I would break up with her. She essentially lied to your face about her willingness to get a dog. It sounds like you made it clear you were very passionate about getting a dog and you trusted her when she said she would eventually be willing. I think this is a huge betrayal on her part and just shows shes not able to communicate properly.\n\nMy bf loves dogs and has always wanted one. I held him off because I still wasn't sure I wanted one and it was never the right time for several different reasons. When we were finally in a place we could get a dog we had a long talk. We agreed that it would be a small dog (I've always been scared of big dogs), we both would have to agree on which dog to get and he would take on the bulk of the responsibilities. I completely fell in love with our dog after we rescued him, and it's actually me who take the most care of him. I honeslt couldn't imagine our life without him. I think the difference between me and your current gf is I MEANT it when I told him I was open to a dog when we're ready. ",
            "Speaking for myself, I would never marry someone who would not let me have pets. My poor husband has so many cats and parrots and a dog to deal with, but our home is full of life and love. Before I owned a house, I kept rats as they are such a great apartment pet and fun, endearing little animals.\n\nOP, if you marry this woman and it lasts, you'll have gone your whole life without ever owning a pet. First your mom, now your fiancee. This seems heart-breaking and really wrong to me. Wanting a dog is such a modest dream. \n\nI'd feel differently about this if your fiancee had always been honest about her feelings or if they came from some kind of severe allergy or past trauma, like PTSD from a severe dog bite. But she just doesn't like dogs, and she was dishonest. \n\nEven if we leave the issue of the dog out, (1) she lied to you about something important to you to get you under false pretenses into a committed relationship with her and (2) she is unwilling to compromise on something important to you. Is this the behavior of someone you want to marry? When there is a conflict, she will lie and refuse to compromise and basically steamroller over you. Please don't accept that.  Billions of women in the world; you can find one who loves dogs. \n",
            "I don't think she's being reasonable. I love dogs, but I don't like them inside of the house. Maybe this might be an issue? I can't see the problem with you having an outside dog if you take care of it. Just a different perspective. ",
            "I think the question you've got to ask here is would I be unhappier without my future dog or without this woman as my future wife. :/ it sucks that she wasn't absolutely honest about not ever wanting a pup in the first place but now that she's made herself perfectly clear the ball is in your court. It's a shitty decision but you shouldn't feel guilty about it either way. If you c any imagine the rest of your life without ever owning a dog or other pet then you may have to sacrifice the relationship, if you can't imagine your life without her you'll probably end up having to sacrifice having the pup unless there's some sort of compromise you both can come to. Def try to open it up to discussion one more time and emphasize the importance of you wanting a dog to be apart of your life too. ",
            "That's fucked up she would deny you something that would make you so truly happy. Just cuz. \n\nDump her and use your adorable new pup to pick up on dog lovers. Sorry for your heartbreak but a dog is way better.",
            "Other people have already covered the basics here, so I'm just going to add this:\n\nThere is little hotter than a man with a (clean, well-behaved) dog.  There is no better way to start your new single life.",
            "Get your dog man you'll find a new girlfriend",
            "It's not even a question. You choose the dog.",
            "Ok, so I guess a major part of this dilemma is that OP would look bad because \"omg he chose a dog -A DOG- over a fiancee!\" Like he was willing to throw away their love yadda-yadda-yadda. However, I think SHE's the one who is willing to throw it all away, since she gave the ultimatum. An ultimatum that is based, may I add, to a preference that OP stated early on and kept on actively talking about. She sounds like the rest of her life will have to be her way.\nJust go get a dog, dude. You're young and quite honestly, she sounds like the wooooooorst.",
            "She lied to you, disrespected you,   and now she has no desire to compromise.  Sounds like a real solid foundation for a marriage!",
            "I'm no therapist or relationship guru so - take this all with a grain of salt.\n\nThat being said, if I were you I would turn the tables back around on her and leave her with the ultimatum. Something to the effect of, \"As we've discussed on *multiple* occasions over the past four years, I am going to be getting a dog. If this is a deal breaker for you there's nothing I can do about that, but I wish you would have told me earlier *when we were making the plans to get a dog when XYZ conditions were met*.\"\n\nPut the \"ultimatum\" and life-shaking decision back on her. You did nothing wrong in regards to this - you've done your homework, you waited until the time was right, you discussed it with her on multiple occasions so this wasn't a surprise to her. She's the one that has upended your mutual agreement on a life \"plan\" (if you will) and she should be the one that's left to make the decision about whether or not her lying is going to cause this relationship to end (as far as the dog is concerned - please listen to other redditors though in regards to her inability to communicate and just lying in general, because *that* might be a deal-breaker for *you*, which is completely understandable and if not that then some heavy couple's counseling).\n\nThe biggest \"red flag\" for me though is the fact that she's decided that somehow, for some reason, you're the one that should have to change their plans. What? She's the one with the problem and she should be the one to find a solution to it. Plain and simple. There is no ultimatum for you, even if she's trying to pretend that there is. You two made a plan to get a dog, now you're going to get a dog. If this is now something that she wants to leave and end then relationship over there's nothing you can do to stop her. But please don't fall into the mentality that you've done something wrong or that you've caused a problem. You haven't.",
            "If you're willing to drop her over getting a dog then she isn't the one for you.",
            "Did Ali tell you why she doesn't want a dog? Maybe you can reason with her. If not, I'd consider just adopting the dog you want and taking him/her home. Maybe Ali will change her mind when she has some exposure to a real live animal in her home - maybe she'll even fall in love. If not, well, I guess Ali will leave you, but you'll have a nice furry buddy to lift your spirits while you look for a more honest, compatible life partner.",
            ">Is there a way to compromise on this? \n\nNot unless she's willing to change.\n\nIt can and should be a deal breaker that she lied to you about this.  I'm a dog person and I always made it clear to DH that I wanted dog(s) someday.  He wasn't really a dog person but knew that and was cool with us getting a dog when we got our house.  And he's been a great dog owner over the years because it's something so important to me (and he's a good person who wants to do right by the animals).  \n\n>She gave me an ultimatum - either her or a dog. \n\nChoose the dog.  As a bonus, a dog will probably help you pick up new women, especially at a dog park. :)  \n\n",
            "There's only one decision when given an ultimatum like that and I think you know which one it is.\n\n\n\n\n\n\n\nIt's the dog. Pick the dog.",
            "As someone who absolutely needs to have a dog in the near future, I would be considering the same thing. \n\nShe lied to you about something that matters *a lot* to you. I think a dog is more than a dog. A dog is a companion, therapeutic, something positive to add to your routine, a living being. If you adopt a dog, you're saving a life so there's that too. There is just an overwhelming amount of positivity that comes with owning a dog (or a cat! or other animals) that can't be substituted with anything else (besides children for some people). \n\nAnyway, her lack of communication about something as serious as this is giving you a glimpse into the future. If you decide to stay with her, you'll probably have a really hard time believing her over any other serious topics. I wouldn't be able to trust somebody like this. \n\nI think you should choose the dog. \n\n\n",
            "She lied to you.\n\nGet the dog. Have fun. ",
            "Get a female puppy and tell your girlfriend you're trading her in for a younger model.",
            "So, a proven liar or a potential dog???\n\nThat's an easy one. \n\nA dog will not lie to you. ",
            "What is wrong with the people telling him to dump his fiancé over this? That's a little brash and seems insane to me.\n\nI used to be terrified of dogs and generally found them gross and annoying at best. One of my coworkers has a boxer that's so lovable and non threatening that I became okay with that one dog. Then he got a puppy and I looked forward to getting to cuddle with it every day when he brought it in. I don't like most dogs but I definitely now like his, and can see other dogs as being cute. I wouldn't be opposed to having a dog if my partner really wanted one and I could have a say in which dog it was.\n\nMy current partner is not a cat person at all and has warmed up to one of mine so much that they're inseparable. OP should talk to his fiancé, find out what it is about dogs she doesn't like, and work out a compromise. If he's already planning on marrying her this seems like a crazy thing to break up over.",
            "Man if I had to choose gf or dog, 100 out of 100 I'm choosing the dog.",
            "Pretty much what other people are saying. She strung you along based on a lie that she hoped would resolve itself without her needing to make any tough decisions. I'd be worried what else she's willing to lie to you about and hope it will just go away.\n\nEDIT: I mean, if you really want to try to resolve this, find out why she hates dogs and see if you can steer her toward a breed that she will like. But I'd be hesitant to drag this on too much longer, because she might just keep jerking you in circles until you fall victim to the sunk cost fallacy.\n\nEDIT 2: And I have to ask... After wanting a dog your whole life, building toward it, believing it would happen... Are you going to be able to look at your big, fenced-in backyard and think about the dog park down the street without being (at least) disappointed or (at worst) resentful that there isn't going to be a dog in it after all?",
            "The dog will love you unconditionally. She has listed you a condition for her to love you. The answer is clear. ",
            "Yeah OP I would worry about what other dreams she was hoping you would forget about. Children, traveling to France, owning an RV? Any other big dreams she may lie to you about? I couldn't trust someone after that. She is your partner and knows you want a dog. Dogs are like children. I would reevaluate things. \n",
            "This isn't about the dog. This is about her valuing her own wants above yours- she thinks that any minor inconvenience a dog in the house might cause her outweighs your lifelong dream of dog ownership. It would be different if she hates dogs and was upfront about it from the start, but from this post it seems she is just indifferent and would rather not have one, and is pulling the ultimatum to get her way. This is extremely shitty behaviour and cannot continue, because she can and will do it again about other issues.\n\nI guarantee you that she is bluffing. You need to say in no uncertain terms that she cannot veto your dreams like that, especially when you have been so upfront about them from the start. I think this is salvageable- don't throw 6 years out the window for one bout of bad behaviour if it is out of character- but this is not a crazy hill to choose to die on.",
            "Perhaps there is a reason to her not liking dogs and not wanting to be around them. Do you know if she had a traumatic experience as a child with a dog? Maybe ask her why she is so against them.",
            "Here's the big thing for me.  Let's take the dog out of it and just make it any life long desire that you've shared with a potential partner and while they weren't thrilled with the idea they knew it was important to you so they said when things allowed for it then it was OK.  Your fiance has been lying to you for 4 years saying that one day you would get to finally have that life long desire of yours.  She knew all along she would never go for it when the time was right because as far as she's concerned there will never be a right time.  She knew damn well you would never forget this.  She only said that because if she had told you that she only said it so you would stay with her would make her look like a shitty person.  But that's exactly what she is in this situation.\n\nThe lying and manipulation are the real issues you should be worrying about op.  The choice is now fulfill your lifetime desire of owning a dog or staying with the woman that's been selfishly lying to you for 4 years. It's your choice. But the dog will never lie to you. ",
            "So, do you want a loyal four legged pal or someone who has lied to you for four years? \n\nWhat if she'd been like this about kids?\n\nI'd be feeling pretty betrayed at this point and I'd be thinking that if she really loved me, she'd be happy that I was finally going to get something that I'd wanted for my whole life. ",
            "I would be so so so pissed if this happened to me. It is my DREAM to have a dog with someone I love \n\nIf they deceived me like this for that long I would honestly question how much they care about me, my dreams, my goals, my interests. ",
            "> either her, or my potential dog\n\nOnce you choose the dog and she starts accusing you of destroying your relationship, just tell her you choose the dog because the dog will never lie to you.",
            "Pick out a dog, bring it home, and tell her the ball is in her court. If the prospect of a dog is a deal breaker to her in your relationship, then I don't think she has her priorities (you) in order. It's just selfish. On top of this, you could argue that she's lied to you about something you care deeply about for the balance of your relationship. Sorry to hear about the position you're in. ",
            "If getting a dog is really that  important to you and GF is adamant about not wanting a dog you may well have to weigh the pros and cons of leaving your relationship. What would you be giving up in order to gain a dog? If she was allergic would that be as much of a deal breaker. \"Babe, I love you but I always wanted a dog.\"\n\nI have a dog, I love him, but he's my dad's best friend and I'm more of a cat person. Looking after the dog uses to really stress me out.  As an extreme example, at times I felt like the dog was like an unplanned child that I was unprepared to look after, and led to a lot of feelings of resentment toward the dog - despite the fact he's cute as fuck and I grudgingly love him as a member of the family.\n\nGoing ahead with getting a dog and being the dog's full carer could work. It's going to change your relationship whether you end things or not. \n\nIf you really love her, consider all the angles.  It's not the most unreasonable thing to break up over, but you said you were engaged.  ",
            "If this was a cat (that's just what I prefer, personally) I'd be soooooooo far out that door. But again that's just me. \n\nNot just because pets are awesome, but why does she think it's okay to lie to you for years? Why does she get to decide your dream isn't important? Honestly, I'd be so afraid of just being steam rollered with other issues I don't think I could get over this. ",
            "Pick the dog. She has been dishonest to you from the start about this. She agreed to look into it. She said she'd be open to the right dog. She said that once you had the right living situation she'd be okay with getting a dog. Now she tells you that she's never wanted one, and doesn't want one so much that she's happy with laying down an ultimatum and making you choose. She has lied to you over and over again by telling you she's willing when she knew it was never something she'd actually agree to. And ultimatums are hugely manipulative. You're damn right she has put you in a lousy spot - this is entirely on her. You've been honest from the get-go that you wanted a dog. You haven't lied to *her*. Look at how far she would go to get her own way in this relationship. She's willing to treat you like this if it means she gets to have what she wants. Sit with that for a while. Do you feel respected? does she seem to care about your happiness?\n\nI think you should get a dog. Take care of it entirely by yourself - you make sure it gets fed and watered, you train it, you walk it, you deal with its poop, you play with it and love it. She doesn't do a thing for the dog. That's the compromise. If she's not willing to compromise she can move out, I guess, or find a way to suck it up. You do not have to sacrifice something you've wanted since childhood because of her lies and dishonesty. That's not okay.",
            "And FYI when you do look for a dog, please rescue one.  If there is a specific breed you want, you can still find one in a shelter or Google \"(breed name) rescue (your state)\"  There are a lot of great rescues out there and lots of breed specific ones.  \n\nIf you do want a purebred puppy, get one from a responsible breeder.  Never **EVER** buy a dog from a petstore.  (sometimes rescues have adoptions at stores like PetSmart or Petco - that's cool)\n\n\n\n",
            "Guess you getting a new doggy, and losing a lying manipulating girlfriend!!!",
            "You know what you're gonna get from a dog that you never got from Ali?\n\nLoyalty.",
            "Dogs are a big inconvenience. Maybe she thinks you are a slob and she doesn't want to pick up after you and the dog. Maybe she wants to travel and not worry about the dog. She could have a lot of valid reasons. Maybe she really thought she could stomach it but changed her mind.\n\nI think  you should break up with her Op. She deserves a grown up who won't pick her over a dog you don't own yet.\n\nOh btw people comparing this to having kids are crazy. Pets aren't kids. They aren't people. There is no biological imperative to have a dog. \nIf you want to pet a dog so bad go volunteer at a shelter so she can have a peaceful home. ",
            "So which breed are you getting?"
        ]
    }
]