[
    {
        "post_id": "i1chj5",
        "author": "wannabeawake",
        "title": "[UPDATE] Me [23 F] with my bf [21 M] of 8 months, regarding living with my brother [20 M]",
        "url": "https://www.reddit.com/r/relationships/comments/i1chj5/update_me_23_f_with_my_bf_21_m_of_8_months/",
        "score": 2895,
        "num_comments": 70,
        "created_utc": 1596219232.0,
        "selftext": "Original post: https://www.reddit.com/r/relationships/comments/34fd9v/me_23_f_with_my_bf_21_m_of_8_months_regarding/\n\nHey all! Reddit emailed me about verifying this account, which I completely forgot even existed, so I checked it out and went back and read my post from 5 years ago. I read through the comments again, and I figured maybe it'd be worth posting an update since honestly, I have no idea how I was defending this person at the time...\n\nPretty much, I made that post about my boyfriend thinking it was \"very weird\" that I lived with my brother at a point where my boyfriend and I had been dating for a few months shy of a year. One month after I made that post, my brother ended up moving out anyway, and my boyfriend and I moved to another apartment (all planned, and just a matter of the lease ending), so the situation had mostly resolved itself.\n\nHowever, LET ME TELL YOU, holy shit, I wish I would have taken the advice given to me in the post, and I cringed reading through this 5-year-old post because a lot of the comments were so true, and I should have just left. I put up with his shit for a total of 4 years before he broke up with me (\"for good\" - we actually broke up probably 10-12 different times that lasted anywhere from a few hours to a couple of weeks). \n\nThe entire time, he was definitely jealous of my brother. Pretty much, he ended up admitting that my brother was a guy who commanded a room, people always looking to him (like, he's sort of a \"leader\" in his friend group), and making people laugh. That was the type of person my (now ex-) boyfriend wanted to be, so he hated that my brother was that. In fits of rage, even in a *completely* unrelated argument, he would randomly be like \"I bet you've fucked your brother!\" So much shit coming from him, but I think that the combination of he and I in a relationship together was just incredibly toxic and made it so hard for me to be able to think about things rationally. \n\nThere was a comment in my original post about someone wishing I could see the situation from the outside, and looking back at that post, I feel like I finally am, and it's just cringeworthy. Someone had PM'd me a list of signs of an abusive relationship, and looking back, he definitely checks off most of those. I had said that he rarely lies to me, but in retrospect, our relationship was FULL of lies - some major ones that I recall from before I made that post, so I'm not sure if I was lying to myself then or what.\n\nI'm in a much better place now, and have had a new boyfriend for about 2 years. I think the takeaway here, and why I wanted to post an update is for people perhaps in a similar situation (regardless of what it might be about) to consider. If your SO is absolutely ridiculous when it comes to something, don't expect it to be okay just because you can maybe avoid that topic in the future. It's possible that it will still come up, and it's very likely that this isn't a red flag to ignore just because it's easy to ignore. It's still a raging red flag, and has a lot of implications for your relationship in the future.\n\n\n---\n**tl;dr**: Stayed with boyfriend of < 1 year at the time for about 4 years. He was super jealous of my brother and thought living with him was very weird. Post-breakup, I finally have clarity and he was ridiculous.",
        "permalink": "/r/relationships/comments/i1chj5/update_me_23_f_with_my_bf_21_m_of_8_months/",
        "comments": [
            "Thanks for posting this.  Although I was not around here back then, it was cool of you to update and recognize those who were trying to help.  I'm glad to hear things have gotten better for you with that creep out of your life..",
            "Sometimes it’s really hard to leave an abusive/bad relationship because your SO makes it feel like you are not worthy of someone better. Until you truly are able to love yourself and ok with being by yourself are you free from being codependent or settling in terrible relationships to not feel alone.",
            "Hope your ex didn’t do anything to damage your relationship with your brother! It sounds like you are both people who care immensely about each other and I hope you’re still close :)",
            "I'm sorry you had to go through this. Reading the original outloud to my Husband he immediately said he's jealous. Glad to hear the jerk admitted it",
            "Isn’t it amazing how much you can grow in just 5 years? 23 year old you was still a kid. \n\nYou’ve grown and matured and thankfully outgrew a bad relationship. :)",
            "Bloody hell.\n\nMaybe he secretly fancied your brother.",
            "People love throwing the \"you're fucking your sibling\" in your face if you get along with them don't they? There's been a few recent posts where the conflict has always been the SO being irrationally jealous of the OP's siblings. Over it's just gross people try and shame you for getting along...",
            "I also noticed the comment /u/zizzymoo left in your last post. It was so kind, and I wondered how that checklist went for you at that time.\n\nI'm glad you saw him for what he was, and also for checking in with an update. Happy you've moved on to another guy who hopefully treats you - and your brother! - right.",
            "So glad you're in a better place now. It's funny how you can view a situation differently after you are removed from it. How is your brother doing?",
            "I can’t believe it’s been five years...but glad to hear it",
            "I read your first post and it’s SO much sounds like every abused girl. I’m so glad you got out and are spreading awareness. A really great example. Good luck",
            "My ex boyfriend once told me to kill myself because I performed at my high-school talent show without him. HE WAS ALREADY GRADUATED. And there was no prior plans to do it together either so it was obviously him being insecure as fuck for no apparent reason other than I did something without him.",
            "Happy you are better now! Wow a lot of things you said make me realize how bad a relationship I was in really was... My ex would say the most random things about my parents like \"look how your mom is looking with disapproval to me\" and she wasn't even looking, and \"I won't stop doing these things I know that hurt you because I don't want to chose\"... I feel you. Amazing to see you moved on beautifully and thank you for the advices. 💖",
            "I was with someone who thought having male roommates and friends was weird. I moved in with him mainly because I didn't have the money to keep my apartment and didn't want to go to a homeless shelter. I got trapped there for years because he got me pregnant and I couldn't afford to leave. So if there are red flags, get out.",
            "I’m not trying to be rude or anything but just genuinely making a remark, do you think in the past years you’ve spent enough time single? \n\nHas it been easy to keep your identity strong and personality throughout? \n\nSorry bout the experiences, it’s tough but we can’t be hard on ourselves for wanting to see the best in people",
            "[deleted]",
            "> we actually broke up probably 10-12 different times that lasted anywhere from a few hours to a couple of weeks\n\nThis is all in OP's past, so this goes out to whoever else needs to hear it: a relationship that goes \"on-again, off-again\" is a relationship that almost always just needs to stay \"off\".",
            "I'm glad you finally see it, and that you took the time to post this.\n\nIt took me 12+ years to do just that. It was toxic and hurting me for the last 3 years or so. I don't hate him tho, we were bad for each other, I was really toxic back then too. We both have so much better lives now.",
            "Can’t help but feel incest porn has played/caused  a large part of the ex’s thought process especially when he said you slept with your bro o.O",
            "thanks for the update and you are a good writer, it was so easy to read despite containing tons of information.",
            "Hindsight is a wonderful thing, isn’t it? \n\nI honestly look back at the things that went on in my 5 year relationship with my ex and cringe with shame at the things that I was blind to.    \nYou live and learn and sometimes, you do have to take a massive step back and try to look at things objectively or from an outsiders view.    \nThe main thing is that you know that the problem wasn’t with you, it was him that had the weird issues. One of the worst things someone who is supposed to care about you can do is gaslight you, the way that he did. \n\nI’m glad you’re in a better place and in a happy relationship now.",
            "Thanks for sharing. It is a valuable lesson for all of us. When you wear rose colored glasses, red flags are just flags. We all need to learn to recognize red flags and don't ignore them.",
            "I've been waiting 5 years for an update to this. Now I can finally leave Reddit. Thanks!",
            "Wow... reading that post reminds me of the potato story, where the guy pretended he didn’t know what a potato was as a joke but then stuck with it. So happy it’s in your past and you’ve moved on!",
            "This wasn’t directly mentioned in your post but I’m going to bring it up anyway. Have you noticed that you can’t be alone? \nNow that you’ve dropped your ex and have been in a hopefully healthier state for the last two years, maybe it’s time to address that?",
            "Congrats on getting out of there!!",
            "Plot twist your ex is in love with your brother and that is what caused it",
            "[deleted]",
            "Wow, can't believe your ex was actually jealous of your bro. Like wth, and even accuses you of sleeping with him. Honesly, its good thing you're out of that situation now and have gotten yourself a new bf.",
            "Jesus that dude has some issues he’s gotta work out",
            "Updates a post from 5 years ago.\n\nYou da real MVP.",
            "This is the behavior of someone that's paranoid and in a relationship it almost always comes with controlling behavior that gets worse and worse. \n\nMy cousin, who is incredibly handsome and charismatic, had numerous relationships with girls in our year in late highschool and the cycle of events and behavior repeated over and over again. He was jealous of both his own brothers, his gf's brothers and so on. It's just fucked up. \n\nIt's all caused by feelings of paranoia, inadequacy, and anger.  But the paranoia/jealousy is key when people throw out this accusation. Which then leads into the controlling aspect. Anytime you hear someone say this and it's unfounded, run for the hills.",
            "Can you share the link with the check list? I feel like that’s something I need right now. Congrats on getting out and growing love",
            "Wow so much wisdom here!! I'm so glad you are safe and free and it sounds like you have grown so much!!! Congratulations!!!!",
            "It’s ok for people to be “ridiculous” about some stuff. It’s just that two people need to be compatible with their ridiculousness. Not necessarily applicable in the case of your ex, but for instance, with other personality traits.",
            "Thanks for posting this and all,but your wording here promotes toxic masculinity \n\n\n>a guy who commanded a room, people always looking to him (like, he's sort of a \"leader\" in his friend group), and making people laugh. That was the type of person my (now ex-) boyfriend wanted to be, so he hated that my brother was that.",
            "But you stayed with him for 5 years and the only reason you’re not with him is because he finally broke up with you.\n\nSounds like sour grapes to me."
        ]
    },
    {
        "post_id": "3jn7eb",
        "author": "buckets_of_drawings",
        "title": "[Update]I [36M] walked into my lovely GF [42F] with her new boy toy. I brought the ice cream.",
        "url": "https://www.reddit.com/r/relationships/comments/3jn7eb/updatei_36m_walked_into_my_lovely_gf_42f_with_her/",
        "score": 2892,
        "num_comments": 379,
        "created_utc": 1441387899.0,
        "selftext": "Original post [here](https://www.reddit.com/r/relationships/comments/3j9ol0/me_36m_with_my_42f_of_2_years_i_suspect_shes_up/)\n\nFirst off, I want to say thanks to the advice everyone had given.  There were a few thoughts that resonated that I appreciate.  Secondly, get your popcorn.  *Disgunbgood.jpg.gif*  I know we all like a good story, and this is somewhat therapeutic for me.  This all happened a few days ago and it took me a bit to digest everything. \n\nQuite a bit of advice was around direct confrontation and asking her what the heck was going on.  After numerous ignored phone calls and text messages she finally decided to pick up her phone.  She apologized and said her phone died and she didn't realize it until it was too late.  I started in right away with that she had previously sent me a message non nonchalantly that she just 'wasn't feeling it' between us.  After that message, we talked and she said she was just feeling stressed and was taking it out on me.  Understandable...stress happens.  So my next question was this: \"Your friend had told me that you were seeing someone else.  Whats going on?  Do you want to break up??\" \n\nHer answer?  \"What??? WHO SAID THAT??? oh my god.... who said that?? Oh my gosh, Im sooooo tired of all these rumors about me!   Who said that?!\"    She went on like this for quite a while.  What struck me was that she was more concerned about someone ratting her out than the accusations.   She assured me over and over that no she did not want to break up and then started making me feel awful that I would make these statements towards her.  Didn't I know how she felt about me?  That i was saying this made her feel like I didn't trust her.  I suddenly felt like the worst person in the world. She also pleaded with me to give up who it was that said this, but I wasn't budging on that.  In the end, she said she was having an emotional, stressful day and just wanted to relax and we would talk later, maybe over the weekend.  After taken in the advice from here... I felt like she was misdirecting. \n\nI sat there in a mix of feeling like something was amiss, and feeling awful that i just accused my beautiful girlfriend of cheating on me.  I felt terrible.  I sat for a bit, feeling like I just put this huge crack in our relationship.  I love her to pieces.  I needed to go apologize.  \n\nI hopped in my car and drove the hour to her city and decided to get her a quart of her favorite chocolate ice cream on my way there.  When I stopped into the shop to pick up this treat, I run right smack into her daughter hanging out with her boyfriend.  They are both in college, doing night classes and just got out of school and wanted a treat.   We were chit chatting and she was going to be staying at her bf for the night, but forgot one of her workbooks and needed to stop at the house real quick to pick it up.\n\nAfter chatting, the daughters bf took off and we both drove up to my GF house.  I pulled into the street because they have assigned parking at her unit.  Her daughter actually pulled up behind me instead of her own spot and when we got out I said, \"whats up, neighbor took your spot again?\" as we walked up to the door. \n\n\"No.... thats not my neighbors car...\" \n\nI don't know if it was the way she said it or her sigh afterwards or what but suddenly it felt like my heart just sank.  I KNEW what we were going to find, but I was hoping for anything but that. \n\nHer daughter and I both shuffled through the door and stopped immediately in the entryway.  We could just hear them.  There's no mistaking it.  You know the sound:  rhythmic thumping and moaning with little exclamations of pleasure.  The bedroom was right across from us.  \n\nHer daughter looked at me with her eyes as big as saucers and just goes 'oh my god....im sooooooo sorry'.   At this moment it felt like i was living outside my body. Its hard to explain but suddenly it was like i was just a person watching actions happen. I couldn't really feel anything and  I didn't know what to do.  Here i am...standing here...with a quart of ice cream while my GF is getting railed in her bedroom.  I had no idea how to proceed. My whole body just felt like i couldn't control it. \n\nHer daughter suddenly just screams 'MOM! WHAT THE FUCK!' that sounded like a cross between a banshee wail and an firetruck siren.  \n\nMy GF actually ran out of the bedroom, naked and all, possibly thinking there was some emergency.  Maybe motherly instincts that something bad just happened.  I don't know.  She started to formulate words but fell silent as soon as she saw the too of us standing there. \n\nEventually a stream of words fell out of her mouth: \"oh my god. What are you doing here?  You're not supposed to be here.  what are you doing here?\"  She kept repeating it over and over until she ran back into the bedroom.  \n\nI still stood there. shocked.  Still having an out of body experience. I don't know how much time passed. seconds or hours.  It blurs.   She came out clothed in her pajamas and was talking to whoever it was on the other side of the bedroom door.  My GF (EX now) started yelling at her daughter and I about why we were in the house.  I think the realization of everything was suddenly starting to hit her because she started crying and making unintelligible noises.  Her daughter starts to scream at her about 'how could you do this??' and 'you did it AGAIN?'   \n\nAt this point...I had seen enough.  I couldn't even look at her anymore. Everything was numb and my ears felt like they were ringing. My body still wasn't my own.   I walked over to her kitchen table and put down the ice cream saying, 'I know you get hungry after sex....so heres some ice cream.'  and walked out the door.   She started sobbing 'Nooo' but it I just kept walking and drove home.   That was a few days ago. \n\nI didn't go to work the next day.  \n\nMy phone has been BLOWN up. I have not replied.   For your reading pleasure here are some of my favorite messages:\n\n\"If we had spent more time together it wouldn't have happened.\"\n\n\"It doesn't mean anything.  You know that I love you\"\n\n\"If you cared anything about us or our relationship you would talk to me.\"\n\n\"Are you ignoring me?\"\n\n\"Please\" I have lots of 'please's.  \n\n\"if you cared, we would be able to work this out\" \n\nIt goes on and on.  \n\nRight now I still feel kinda numb.  I just don't understand how or why this happened.  I gave this girl and her family so much and my all and it didn't even matter.  I provided for them when times were tough and did so much to make our lives good.  I know I shouldn't feel this way, but I feel like I don't mean anything or that I can't make someone happy now. It's frustrating.  I know Ill get over it in time but it definitely hurts. I don't understand why or how this could happen. We were soooo good too.  So many questions I want to ask her, but Im forcing myself to NOT have contact with her and just going to move on. \n\nIn retrospect I wish I kept the ice cream. \n\n**tl;dr**: GF caught having sex.  She got rewarded with Ice cream. ",
        "permalink": "/r/relationships/comments/3jn7eb/updatei_36m_walked_into_my_lovely_gf_42f_with_her/",
        "comments": [
            "> 'you did it AGAIN?'\n\nGod, those words from her daughter tell you everything you need to know. Stay strong, man. If you can, block her number so you're not tempted to reply and if not, just maintain no contact.",
            "None of those messages indicate that she is taking any responsibility whatsoever, nor does she seem to have any remorse.\n\nAnd on behalf of couples everywhere who are forced to spend time apart due to careers, she can fuck right off with saying that it wouldn't have happened if you had spent more time together. People are apart all the time, they don't go jumping on dicks. And again, she's saying that it's the circumstance or is it even your fault that this happened?  Lol, what a self-absorbed asshole she is.\n\nI know you said you two were soooo good together...I don't know, I personally can't stand people like that, that just lie and manipulate, and never have any accountability, and always stack the deck in their favor. This is her basic nature, her very character, or lack thereof. She isn't going to change.  I say good riddance.",
            "Ugh...I hate the \"If you cared about our relationship\" bullshit. If she cared about your relationship she wouldn't have fallen on some other guy's dick. ",
            "I feel really bad for the daughter. She sounds sweet despite growing up with a terrible role model.\n\nBest of luck processing everything. I'm terribly sorry to hear what happened to you. At least this can close this chapter of your life and soon you can start a new one and find someone who treats you wonderfully. No contact, gym, facebook, blah blah, etc.",
            ">'I know you get hungry after sex....so heres some ice cream.'\n\nWow OP, you could say that was \n\n*puts on sunglasses*\n\nIce cold. \n\n*YEEEEEAAAHHHHHH*",
            ">I don't understand why or how this could happen.\n\nBest not to spend your time thinking about this. The minds of cheaters are places where no sane person should venture into. \n\n>In retrospect I wish I kept the ice cream. \n\nBut hey, at least you still have your wits about you.\n\nYou'll be fine, given time. \n\n",
            "No contact. \n\nYou might drop the daughter a text saying that you bear her no hard feelings. ",
            "Keep up no contact. Remember it isn't your fault. Reach out to family and friends for support. ",
            "Better finding out than if you had been married! Especially the part about the daughter saying that she did this again.\n\nSo uhh, what kind of ice cream was it?",
            "[deleted]",
            "\"My biggest regret is leaving the chocolate ice cream on the table for your cheating ass to enjoy. Don't contact me again.\"",
            ">In retrospect I wish I kept the ice cream.\n\nIt would have melted.  It's worth it for the story.\n\nAside from the cheating, there was a lot of deceit on her end.  Stay strong and keep doing what you're doing.",
            "I think it's great that her daughter was there, if only to do the crazy, curse-filled screaming that you probably *wanted* to do, but would've only made you the \"bad guy\", or \"scary\". \n\nSorry it happened to you, OP.",
            ">\"If we had spent more time together it wouldn't have happened.\"\n\nWell, no shit you didn't spend enough time together, you were too busy canceling plans with your boyfriend to spend time with \"friends\".\n\nIt's funny how a \"night with friends\" turns into a sleepover and a denial, and when caught in the act it's somehow still your fault; at least it wasn't a complete stranger.",
            "At 42, if she isn't mature enough to maintain a relationship and not cheat. Then she is never going to be mature enough. It hurts alot, but you dodged a bullet in the end. Take some time to heal OP and realize you didn't do anything wrong other than picking her to date. She is the broken one, not you, that is what you have to remember.",
            ">\"if you **cared**, we would be able to work this out\"\n\nPeople, lol. ",
            "Stay no contact. Block her on everything. She doesn't deserve one second more of your life wasted on her. Work on moving on. Knock it off with the feelings of insecurity. She was going to cheat. You are the unlucky one she conned into a relationship. This is 100% on her.",
            "> In retrospect I wish I kept the ice cream.\n\nYou should definitely have kept the ice cream.",
            "Look at it this way.  \nNow she very well may associate her favorite flavor of ice cream with being caught cheating!  \nGood Luck, it will get better.",
            "Stick with the no contact and walk away. She is a wreck and it sounds like this wasn't the first time. Never give her a second of your time. I would block her and just move on. \n\nSorry man.\n\n ",
            "I think the best punishment is to not respond to her.  That'll hurt her more than allowing her any modicum of closure.  ",
            "Never speak to her again. The way you left that was fucking perfect. Especially leaving the icecream.\n\nDeal with your feelings and get back out there, but leave her with the single moment of you giving absolutely zero fucks. That's so cold and so amazing.\n",
            "The most cruel thing you can do to her is never answer another text or call again. the opposite of love isnt hate. its indifference. ",
            "Sorry to hear your suspicions were well founded man.\n\nI'd block the texts soon if you haven't already.  You aren't going to get a real answer out of her and you'll only hurt yourself by reading them.\n\nNow focus on yourself and all the free time you have not having to drive an hour away whenever you want to see someone who doesn't care about you.",
            "well good riddance! ",
            "You did the best thing, OP.\n\n\"If you spent more time with me this wouldn't of happened\"\n\n...didn't she start excluding you for this guy when you made an effort?\n\nGood on you; I feel bad for the daughter though.",
            "Glad she had some ice cream for that *sick burn*",
            "[deleted]",
            "Hey. Check out chumplady.com. \n\nThe more recent articles aren't that great but there are some really ....insightful? ...encouraging? ones in the archives with comments and advice from people who have had similar experiences.",
            "I have to say that i know you get hungry line was superb, mic dropped bro. Plus judging by the daughter saying \"you did it again\" you are better off without her. Daughter seems like good people. ",
            "She tried putting it all on you for what she did. \nTried to make herself feel better/ justified for her actions. \n\nDon't give in. You can/will do better",
            "\"If we had spent more time together it wouldn't have happened.\"\n\nShe ignores you and cancels out on you I don't know how many times, and this is what she says? She's out of her mind.\n\nDon't worry dude, you're 36, you could be dating a hot 29 year old instead of a woman in her 40s that can't keep it together.",
            "Honestly, you've been treated badly and lied to.   I think leaving the ice cream was both gentlemanly and also gave you a funny story to tell months from now when you've started to be able to move past this awful incident.\n\nThe No Contact thing is the right thing.   Please find someone to talk to.  They'll remind you that you deserve to be treated better than this.",
            "Leaving the ice cream is perfect. Don't regret leaving the ice cream. Symbolic of your moving on past that moment.  \n\nYou will find the right lady that you can trust. Sadly, it isn't her.  \n\nReboot, clear saved game, rebuild character, launch intro.",
            "You think someone would do that? Just go onto the internet and tell lies?",
            "sweet thunder fucking christ man...that's a fucking story. i'm sorry you went through all that. i felt numb and out of body when you described it. if you're in los angeles, i'll buy you a beer, or 10.",
            "if you want my opinion, i think she knows she fucked up and she knows she lost a good guy. That being said, dont ever ever ever ever take her back. Its probably best if you just ignore her and try to learn what you can from the experience and move on from it. Try to think that that chapter in your life is closed and those experiences made you a better person. ",
            "> 'I know you get hungry after sex....so heres some ice cream.'\n\nAlpha as fuck.\n\nKeep the faith, OP. Just because your ex was a cheating, lying beeeaatch, doesn't mean anything about you. You are a catch, go find someone who appreciates you.",
            ">'I know you get hungry after sex....so heres some ice cream.' and walked out the door.\n\nMah nigga...",
            "Sorry that this happened to you, but the way you told the story was amazing. You were also great leaving that place and avoiding contact. By any means you go back to that woman.",
            "That ice cream line was an emotional H-bomb OP, well done!",
            "Could be worse, you could have married her and had a kid. Divorced my wife last year after i discovered she was cheating. Have to communicate with her every day or so for our daughter's sake it has really drawn out the healing process.",
            "She's a terrible person, and she isn't going to change.\n\nHer blaming you already shows that. \n\nMove on...as much as it hurts...just move on.",
            "classic manipulation. She cheats and then accuses you of not caring about the relationship.  ",
            "I can't say I have any advice, but I love this one:\n> \"If we had spent more time together it wouldn't have happened.\"\n\nConsidering she had been canceling plans with you for several weeks.",
            "This has happened to me too many times honestly. Not walking in l, but being cheated on. After a while, you start to realize that you are empowered. With every text you ignore, you are deeper into her head. You, on the other hand, can move forward. It hurts, and you don't understand why. But the pain goes away. You have your whole life to look forward to whether it's by yourself or someone that will make enough time for you NOT to cheat. \n\nBro, you got out Alive and on top. You are golden. Just stay strong buddy ",
            "I'm not sure how helpful my own experiences will be to you, but here goes. When I was a younger man, I had an amazing relationship with a beautiful young woman. Things were great, the sex was awesome, and we were in love.\n\nCut to a year down the road. I discover that she cheated on me and confronted her about it. She cried and did the same song and dance that your ex is trying, and I unfortunately took the bait. Was I naive? Absolutely. She seemed sincere, and I was a fucking moron. What can I say? Not enough blood to run the big and little brains simultaneously.\n\nNow here comes the unfortunate part (which others have alluded to in other comments here). Once you forgive, it's like giving your SO a golden ticket to bang anything that walks. I forgave my GF and believe everything she said about how \"she loves me\" and \"they mean nothing\", which led to her cheating on me with a cool half-dozen other guys. (Yep, I was a fucking moron)\n\nOnce I found out she was back at it, I regretted being such a dipshit in the first place when I forgave her. I ended things immediately and never looked back again, learning a tough lesson in the process.\n\nI don't know if the love I had for her is on the same level of your love for your Ex, but I gotta say man - just walk away. Never look back. Nothing good is going to come from it. Fuck, even her daughter recognizes the pattern.\n\nIt's not you, man. It's her. She's the one with issues, and she's not going to fix them at 42. Don't let your own doubts lead you back to her, because that's only going to crush your soul WHEN it happens again. You made the right call, ended it with a soul-crushing blow to her with the ice cream, and ignored her attempts to control your emotions. You dropped the mic on that crap.\n\nYOU ARE IN CHARGE HERE.",
            "One time I confronted a (within a week) ex about cheating on me, and her only response was \"Who said that, who said that?\" And no denials. It's pretty funny now. She just wanted me to give up my source I guess...I didn't. Turns out it went on for a little while...",
            "You are wonderful. \n\nShe is awful. \n\nThe kind of woman who does shit like this in full view of her kid is not someone you want to be around or in a relationship with. ",
            "Once a cheater, always a cheater. ",
            "What a entitled bish",
            "Dude get some ice cream, hang out with some friends, have a good time. Try and occupy yourself with people who don't fuck you over. Seriously. Go have a good time somewhere. I'm sorry.",
            "I'm not sure how the relationship is between you and the daughter, how long you've been with your girlfriend, but even though you should cut the girlfriend out doesn't mean you have to cut the daughter out. If there was any sort of friendship/relationship there, keep in touch. She's probably devestated just as much as you. But the girlfriend is a lost cause, a sad mistake.",
            "I hope you are gonna thank the daughter. Im pretty sure she did not really forget that book but knew he was going to be there.",
            ">That was a few days ago.\n\nSo you caught her cheating a few days ago?\n\nhttps://www.reddit.com/r/relationships/comments/3j9ol0/me_36m_with_my_42f_of_2_years_i_suspect_shes_up/\n\nThis post (the original post - presumably written prior to you walking in on your ex) says it went up three days ago.",
            "[deleted]",
            "[removed]",
            "I think you know what you gotta do. You will find that person who will love you the same way you love them, it might just take awhile longer.",
            "This sucks OP. But you are both old enough to know, that these things don't just happen. She wanted what was happening. She just didn't  want you to find out. You just gotta pick up the pieces of your heart and smash'em back together. Someone else will be greatful to have it and take much better care of it. ",
            "So sorry.  Life would be a lot less painful for honest caring people if cheaters were born with a big letter \"C\" on their forehead.\n\n",
            "I know you say you regret the ice cream, but that was actually a *really* good 'fuck you.'  It was just as cold as the treat.  \n\n\n\nHow you react from here depends on how you feel, though if I were in your situation, I don't think I would contact her.  She needs to live with the fact that she screwed up possibly one of the best things in not just her life but that of her family's life.  This isn't on you.",
            "You're a better man than I am. That ice cream would've been splattered all over one, or multiple, surfaces of the house. ",
            "What the.. \n\nShe's trying to blame her actions on you and it's actually laughable, leave that bitch. ",
            "Man this hit me hard. I went through the same ordeal about 5 months ago. Still hurts.",
            "Hey, I haven't been in your exact situation but I have been cheated on  and felt absolutely crushed afterwards. All I can say is that it's going to suck for a while. You were for her something or she wouldn't have gotten so upset and sending you so many messages. She's manipulative so she will try to get back with you and attempt to make you think it was your fault. My advise is to send her one emotionless email. Tell her you enjoyed being with her and what she did was one of the worst things she could have done. Close it saying you'll contact her when you're ready, if ever. Then send her emails to spam and block her number. You need time to heal. You need time to live in a world where you aren't manipulated by her. You need time to work on you, so if you do come to her for closure you can agree on what was your fault but you won't accept what wasn't.",
            "I've been on the receiving end of this situation multiple times and it's the worse thing I've ever felt, you immediately feel sick and out of control and nothing can be done about it at the time. Chin up and best of luck to you OP, I truly hope things pan out for you.",
            "What the fuck. The entire time I thought this was a 20 something girl, but she's a grown ass woman with a kid? She's a fucking mess",
            "It's quite telling how so many of texts are trying to shift the blame to you. \"If we had spent more time together this wouldn't have happened.\" \"If you cared about us or our relationship, you would talk to me.\" \"Are you ignoring me?\" and \"If you cared, we would be able to work this out.\" are all her shifting blame off herself onto you. She made no apology in any of that. She's only upset that she got caught.",
            ">In retrospect I wish I kept the ice cream.\n\nIt would have melted on the way home, and I guarantee you she didn't enjoy it.",
            "I'm sorry but you catch her literally in the act and then she has the audacity to blame you for it:\n>\"if you cared, we would be able to work this out\"\n>\"If we had spent more time together it wouldn't have happened\"\n\nIt sounds like she wants something else and she went out and got it while lying to you about it the whole time.  If she had been truthful about her other boyfriend and you had known about it, this would be a more complicated decision.  As it stands, she lied to you repeatedly and cheated on you.  Seems pretty straightforward to me.",
            "Lesson...don't chase anyone. They need to show up real. ",
            "I hope you'll be able to accept and keep in your mind that her actions are a reflection of her own issues, not your own.\n\nNo mater how much care, love, time or compassion you dedicate to a relationship there will always be faults and failings that your partner has to overcome on their own.\n\nHer actions in no way negate the positive elements you've brought to the relationship, they just exemplify her own personal issues.",
            "OP, you sound like a caring guy. Please don't let one shit bag of a human change that about you. It is so rare. In sure her daughter will forever appreciate what you did, even if her mother is a sociopath.",
            "In regards to the ice cream, hopefully you ruined her favorite flavor for her forever.",
            "Stay strong. You got this... don't go back to a woman like this. ",
            "> I know you get hungry after sex....so heres some ice cream.\n\nGolden.",
            "Pull yourself together and recoup. Better days ahead brother. It has been 2 years for me. I have drank my way out of sorrow but have lived for the best in life. ",
            "What you said when you set down the ice cream probably cut so deep. Stay strong buddy, that's tough but luckily, there are so many women out there who are incapable of this type of act. ",
            "You are better off.  You live you learn.  I am sorry this happened to you.  ",
            "I'm so sorry man. As someone who's been through something similar, right now there's so much anger you're probably feeling so angry and numb, but in time the sadness will really start hitting ya. \n\nMy only piece of advice is to cut all contact, and accept that time will fix it. Download a chrome extension that'll block you from clicking on certain links. That's what I did with my ex's and her friends' social media channels. \n\nStay strong, bud.",
            "Don't bother responding to anything she says. It'll only make her try even harder to convince you to get back together as she'll see it as you starting to come around.\n\n\nRemember that none of this is your fault. She cheated of her own accord and there is nothing you could've done differently to change what she did. Judging by her daughters reaction this isn't the first time she whored it up while in a relationship. But even so she's already shown that  she us willing to gaslight you and blame you for her inability to control herself.  If you did take her back she'd just end up cheating again most likely. Why wouldn't she if she knows she can get away with it and still get to be with you?\n\n\nYou deserve better. For now though, just take your time and get your head on straight. Then worry about finding another girl that's worth your time.",
            "I know I'm late to the game, and you probably have a million messages to look at but....I just had a very similar experience to you on Monday when I found out my boyfriend of three years had a new girlfriend (she contacted me on FB....and she isn't the first).\n\nIt's so easy to look back now and think \"What a fool I was,\" that's what I did for the first two days between sobbing my weight in tears. My work provides us with free counselling, which I signed up for (the email kind).\n\nThe gentleman who responded to me had some great advice to cope; no one goes into a relationship expecting to be cheated on so we never really expect it, and for the first little while we're willing to ignore the small events that (looking back) are obviously clear indicators.\n\nThis isn't a reflection on yourself as a partner, but her selfishness. She had a great guy in her life but she was selfish and wanted more than just that. She failed at communicating with you about what she was expecting and wanted.\n\nI don't know you, /u/buckets_of_drawings but I'm going to assume we're both great people, and as time goes on we'll learn to heal, maybe learn to trust again. But in the mean time let yourself experience these emotions, and try to be productive and move forward.\n\nI cried for three days, confronted him over the phone (told him he was selfish, and I never wanted to hear from him again, and also that I would in time forgive him, but only so that I could completely forget him and wipe him out of my life), and now I'm working on a mixture of anger and loneliness (they're like waves. One wave is anger, the next wave is lonely).\n\nIf you need to talk or vent drop me a PM.",
            "If she wasn't such a horrible person it wouldn't have happened.",
            "I was just listening to the song \"Mr. Brightside\" today. I feel for you sir. ",
            "God, idk whether to feel worse for you or the kid.",
            "OP,\n\nI'm sorry for this situation man, its terrible that it happend and hope you can go on with your life, but I got to say something else: that line was killer. It sounds so much like a scripted line from a show, which makes it so much more cool.\n\nAlso, I hope the daughter is fine, she seems like a good person who happend to be connected to a really shitty situation.\n",
            "There are people that  feel worthless so the cheat.  Somehow the chase makes them feel loved.  This woman is one of them.   It sucks that you were caught up in this woman's emotional baggage.  I'm sorry OP",
            ">\"If we had spent more time together it wouldn't have happened.\"\n\nSo that's why she kept cancelling on you! \n\nSorry bout this OP. Be strong. If you falter, come and we'll talk sense into you. You did good.",
            "Yeah, cut your losses and move on as hard as it may be. She's a terrible person and likely will cheat on you gain in the future.",
            "My justice boner is raging.",
            "Man, this woman is 42 and acts like a 17 year old. Put her in your history and move on.",
            "You should probably send the daughter a nice message saying you're sorry she was involved in that and wishing her luck in the future. It kinda sucks when your parent dates someone you think is ok and then the relationship ends.",
            "It's always the same:\n\n*\"If YOU cared this wouldn't have happened!\"*\n\nIn it's natural habitat, the cheetah projects emotional flaws onto it's former mate.",
            "I love how they always play the \"if you cared anything\" line... If they cared anything they wouldn't have cheated.",
            "Wow with all the red flags, you confronted without enough evidence, allowed her to gaslight and guilt you, and you went to apologize with a carton of ice cream. SMH/UFB.\n\nPlease don't accept the blame for this and get back with her.\n\nYou were a great beta provider and she hates to lose you, she needs a more dominant alpha to \"take her\" and  give her the sexy feelings she needs.  She is a user and not really LTR  material.\n\nThe nicer you were to her and the more you gave the less she respected you, that is very common.\n\nDont accept a relationship were your partner in not putting into the relationship as much as you are.\n\nYour idealistic fantasy betrayed you as well, she was not who you imagined she was.\n\nI am sorry, I wish you well.",
            ">  I know I shouldn't feel this way, but I feel like I don't mean anything or that I can't make someone happy now.\n\nNo guy, quite the opposite, you gave all you could and that's the mark of a considerate mate. Plenty of girls out there who are looking for that. You just happened to fall for a mark-assed trick this time, but no worries. Not everyone is like that.",
            ">oh my god. What are you doing here? You're not supposed to be here. what are you doing here?\n\nYeah, how dare you interrupt your ex cheating on you.  That's just inconsiderate.  \n\n>\"If you cared anything about us or our relationship you would talk to me.\"\n\nI've noticed that not once does she apologize.  You probably omitted it, but she's not sorry she did it.  She's sorry she got caught.  Your line as you walked out was perfect, by the way.  ",
            "Whole time I was reading that I was hoping you didn't leave her the ice cream. :(\n\nBut yeah, forget this lady. She's crazy and she's blaming you for waking in on her rather than apologizing. ",
            ">\"What??? WHO SAID THAT??? oh my god.... who said that?? Oh my gosh, Im sooooo tired of all these rumors about me! Who said that?!\"\n\n\nThat's roughly the same thing my teen aged girlfriend said to me after I confronted her about her cheating. I guess some things never change, haha, stay strong OP",
            "Why aren't you with her daughter?  ",
            "Sounds like you were already dating a single mother. What do you think drove the father away? ",
            "\"I know you get hungry after sex...so here's some ice cream.\"\n\nCold. Blooded. (And awesome!)",
            "Too bad her daughter has a boyfriend. You could have looked at her and said, \"Well, I drove all the way out here. Netflix and chill?\"",
            "bang the daughter.  really your only option.",
            "A bullet just scratched you, but flesh wounds heal! Stay strong man and be happy you are free now to find someone who really appreciates and loves you for all you're worth. :)",
            "I especially love the \"It didn't mean anything.\"  Sex is really that meaningless? Really?",
            "Nah man best to leave the ice cream. If she is decent it forces her to think about how caring and considerate you were, and if she is a skank who could enjoy iced deceit like that then you have on final bit of proof that she is a piece of shit.",
            "Do you think she ate the ice cream? ",
            "Why did this happen? Because your ex is a selfish person. She had something, it wasn't enough, or she had a problem with it, and instead of resolving whatever the issue was, or leaving, she handled it like this. That says nothing about you. That says it all about her. It doesn't matter how you treated her. She's mad because her awesome setup is ruined. It's a pride thing. \n\n",
            "I think the thing about cheaters is the excitement of getting caught, So that's why that happens. Sorry that happen for you.",
            "Look at it this way. It wasn't all wasted time and effort. You probably learned new things about yourself and how to deal with new situations and what to look for in someone. Time to focus on you bro. \n\nYou do you",
            "you dodge a fucking bullet my friend. she has unfaithful tendency. its hurts because you loved her but this person doesnt deserve your love; that was your mistake, happens to the best of us. no point communicating  to her, seeing that all she did this multiple time. trust is already broken.  she was questioning everyone instead of looking in the fucking mirror and asking herself wtf she was doing.  no contact her and move on. ",
            "damn sorry brother those are some shit text she sent you about caring when shes cheating but stay strong. ",
            "What a piece of work, placing all the blame on you. Not taking any single ounce of responsibility. You deserve better man.",
            "She's trash man, forget her and move on.\n\nNow I know that sounds pretty weak but it's important.  If you read those words and feel awful, it means you somehow think you're to blame.  I've been there man.  The moment that you can read that and say \"yeah I know\" is when you're really ready.  It takes time.",
            "Jeez... Just reading this I already started to get that out of body, ear ringing, balls dropping adrenaline rush. Sorry it happened and best of luck. ",
            "Wow. Just wow. So sorry this happened to you. Please don't try to work it out with her anymore. You deserve so much better.",
            "I would have grabbed a spoon and pulled up a chair. Ate every damn bit of ice cream. On another note can someone explain to me why cheaters carry on this whole double life? What is it they are looking to get out of deception ",
            "Your spider sense was tingling! ",
            "I can't believe she's trying to blame this on you. I hate when cheaters do this. Lots of people have imperfect relationships or don't have their needs met. That doesn't automatically mean that you cheat. Cheating was HER choice and had absolutely NOTHING to do with you. \n\n> \"If we had spent more time together it wouldn't have happened.\"\n\nIf not getting exactly what she wants and needs all the time means she cheats, you don't want her.\n\n> \"It doesn't mean anything. You know that I love you\"\n\nIt means something to you. And she can't tell you what you know. \n\n> \"If you cared anything about us or our relationship you would talk to me.\"\n\nIf she cared, she wouldn't have cheated.\n\nI don't think cheating is always a relationship ender, but in this case she seems to think that she can pin the blame on you or on the relationship as though it's only natural to be unfaithful when things aren't going perfectly. That's not how normal people think. There's a fundamental flaw in the way she thinks. Or perhaps she's just a manipulative bitch who doesn't sincerely believe all the stuff she's sending to you, she's just trying to get you back. I know you have questions but I don't think you're ever going to get a straight answer from this woman, or an answer that isn't some form of twisting things and putting the blame on you to make you feel guilty and feel sorry for her. \n\nYou deserve so much better and I'm sorry. I'm also sorry for her poor daughter.",
            "Well...based on what I read from this story in my opinion, to be frank and pardon my French, but fuck that bitch. You don't need someone selfish like that in your life who returns your generosity, love, and kindness by cheating on you with someone else. Just cut her off and move forward as soon as possible. It'll only get worse for you if you stay with her.",
            "Stay strong man! It sucks now, and might suck for a little while longer, but you dodged a bullet! You will soon be happy that you didn't marry that mess.",
            "Sorry you're going through this, hang in there. Don't read anymore of those messages she's sending you, it's not worth it. You can do way better, go get you some ice cream and maybe some pizza. ",
            "Fuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuck her. I'm sorry you had to deal with that man. She obviously didn't just hurt you, she hurt her daughter who was, at the very least, embarrassed for her mother's infidelity but more likely was hurt as she would her father being cheated on, because after that much time in her life, I'm sure she thought of you as one. That probably makes it hurt that much more, losing her from your life and the rest of your girlfriend's family you may have grown close to, but you did your best for by her and you'll find one who appreciates you for it. Probably younger and hotter, too.",
            "Ouch...Sorry you had to find out that way and that, that happened at all. The leaving line was almost worth leaving the ice cream though, I definitely wouldn't answer any of her messages or contact, she doesn't deserve the peace of mind that comes from communication. Well, things can only get better from here, keep you chin up buddy you'll find someone way more awesome when you're ready to :)",
            "Damn dude, that's rough. As unfortunate as circumstances have determined, at least her daughter was there to support you in the moment of truth- regardless of what happens next, she'll have to live with the fact that she was audibly fucking a rando some ten feet away while her SO and DAUGHTER stood by in abject horror. I hope that her failures as a human being can serve as some form of condolence. ",
            "Your \"tl;dr\" is among the best I've read. I'm sorry for what happened to you though, truly.",
            "I probably would have just dropped the ice cream sideways on purpose so that she would have to clean it up knowing that it's her favorite flavor, it's more than likely not edible by most sane people's standards, and that you had brought it for her while she was banging the other guy.",
            "I know it's a little weird but maybe stay connected to the daughter as a person who can help her. Because maybe you guys are close or whatever but don't punish a daughter. Ignore mom ",
            "Fuck her",
            "I would have loved to stay and enjoy the ice cream watching her making up every kind of explanations and embarrassing herself. Given I were cold at the situation.",
            "You know what man, I've been in a relationship where I've heard \"if you love me/if you cared...\" and it's bullshit. It's a phrase the other person will use to make you feel bad about how you reacted and 1000% fuck that shit. \n\nDon't even bother listening to her shitty excuses and justifications because there's no reason for anyone to pull that shit. You did the right thing, and it's best to just let it go. It's hard, and I feel for you. I hope things turn around for you and some good things happen in your life because you seem like a solid dude. ",
            "I live how they say if you spent more time and yet tell at you if your not working enough Lol",
            "I'm a vindictive person. I'm SO angry for you, OP. It's not mature, it's not the \"right thing to do\", it puts me on her level, but I want to just backhand the living FUCK out of your disgusting (hopefully ex) girlfriend. You seem to have tried so hard for her, cared so much about her, and she did this. \n\nI'm furious for you, OP.",
            "\"I know you get hungry after sex...\" OP is a BOSS",
            "I read somewhere that you celebrate failure. Too often we're caught in a society where making mistakes is seen as bad and wrong. But OP, this was no mistake. This was wrong. Her messages all scream of manipulation and control. Tonight you get to celebrate freedom and the fact that you'll learn from this one and meet someone who sends all the right signals. Good on you OP and all the best!",
            "Just reading this, even I felt the pain and betrayal. That sinking feeling of hurt, betrayal, pain and anger. Now if I am feeling like this, imagine how you felt!\n\nI have never in my life had my girlfriend cheat on me. What a fucking nightmare to have witness the act...\n\nstay strong man",
            "Oh jeez, you poor fella.\nI'm sincerely sorry you had to go through that. Catching your Love in the act like that is horrible and truly does break you in a way.\n\nYou seem like a very level headed gent though, you already know you'll get through this, you know that you are a good person and deserve love.\n\nAll the best, friend.",
            "This explains why there was a husband-shaped hole in the wall OP.\n\nTraumatic! :/",
            "G'damn man... Internet bro hug to ya.  That's some raw, rank shit right there.  You seem a righteous dude, which means she doesn't deserve you.  Take some time to decompress, put your game face on and get back out there to find someone who DOES deserve you.  Block the ex's number and her email address, then call it a learning experience.  I know it'll be hard, but she ain't worth your time to sweat her or her cheating ways.  Oh, and that bullshit she told you about if you had just done this or that?  Yeah, no.  That's her trying to justify her bad behavior.  Don't even fall for it.",
            "Her messages after getting caught shows her pretty well for who she really is.\n\nGood on you for finding the truth now rather than later. To some people it does not matter how much or what you give them. They only care about themselves. Mostly kids and teens act like this, but some adults do and those should be shunned like the plague because obvious reasons and when someone is 42 and act like this, no fucking way in hell that person will change and become a decent person.",
            "I feel you, tbh, I was seeing a girl out of town. Provided for her and her family when she couldn't. She did the dirty as well. Shit happens man and life sucks, you're doing the right thing by not replying to her. ",
            "You gave her the ice cream. You're a saint already. Block her.",
            "So sorry to hear this dude. It's stuff like this that make me jaded about getting together with anyone.",
            "she's a knob, sounds like shes not good at the truth at all",
            "Although I really feel bad for you OP and hope you find you way. The way you wrote this was amazing. I was hooked. ",
            "Lol I guess revenge is best served cold, ayyyy lmao. Nah but seriously be happy that this didn't get past you, imagine if it had carried on for longer periods. Look at the bright side you're a free man now. \n\nYou should bang her daughter if she is of legal age for revenge. ",
            "She can enjoy the ice cream while she hopefully spirals into a depression for being such a skank.\n\nUsually that's what bitches love to eat after getting broken up with.\n\nHopefully she gets fat.",
            "> I walked over to her kitchen table and put down the ice cream saying, 'I know you get hungry after sex....so heres some ice cream.' and walked out the door. She started sobbing 'Nooo' but it I just kept walking and drove home.\n>   .....\n> In retrospect I wish I kept the ice cream. \n\nThat's my soap opera quota for the day.",
            "> 'I know you get hungry after sex....so heres some ice cream.'\n\nHaha, what a come back! Quite the icing on the cake.\n\n> \"If we had spent more time together it wouldn't have happened.\"\n\nSo the lies, misdirection, and shaming you for not trusting her wasn't enough. Now it's your fault she cheated!\n\n> \"If you cared anything about us or our relationship you would talk to me.\"\n\nThrow in some emotional manipulation for the hell of it. \n\nSorry you walked in on it, but in a small way you should be happy you did. Otherwise it would have gone on for god knows how long (she would have never told you). Now at least you know and you can move on from this toxic piece of filth. \n\nKeep the no contact going. Anything that comes out of her mouth will just be more lies and rationalizations for her shitty actions. Focus on yourself and try not to dwell on it. It hurts now, but just keep pushing forward day by day and you will get through this.",
            "Some say living well is the best revenge, I'd say banging her daughter is.",
            "I loved the parting comment bud, although you may have felt like shit its a great ending comment haha.. worth leaving the icecream for.",
            "She's upset over what you were able to give her. Her provider is now gone. I've talked to many men who get caught \"buying\" the sex from a girlfriend. Even after s divorce. \"Let's be friends\". Proceeded by jealousy when you find a new girl. Then its\"let's get together again\".",
            "You still have to get some closure by talking to her, otherwise it'll be on your mind for a LONG time",
            "You should have thrown the ice cream at her feet and said, \"Take the ice cream, bitch. It's nearly as cold as your heart!\"\n\n\nAll that aside, I'm so sorry that happened to you. *internet hug*",
            "If I there man I would pat you on the back & take you out for a drink. It's a cruel thing she did to you but don't let it stop you from being happy. Block her from all social media & anyone who tries to contact you via 3rd person for her. Take it form me it's always the good ppl who gets cheated on & get blamed for being the reason why they cheated. ",
            "Hey man that really sucks. You seem like a good guy and you handled the situation well. \n\nGrab a new hobby to pass the time and keep your head up, pulling for ya buddy. ",
            "The hamster.\n\nFuck older past their prime sluts, aquire much younger.",
            "Now for the ultimate payback - fuck her daughter.",
            "> I don't understand why or how this could happen. We were soooo good too. So many questions I want to ask her, but Im forcing myself to NOT have contact with her and just going to move on. \n\nYou might want to consider talking to her and asking the questions. Otherwise, insecurities might haunt future relationship(s) because you might think, \"Wow things are sooooo good! ... or are they???\" \n\nBut you don't need to talk to her, either. Some people are just really bad at monogamy. That's likely the case here. ",
            "Alpha fucks...beta bucks",
            "Disappointed OP. You missed the perfect opportunity for a classic punchline. I would have told her something like \"Here, you're gonna need this\", and handed her a pint of Rocky Road. \n\nDammit OP. Do you have a time machine?"
        ]
    },
    {
        "post_id": "56xjru",
        "author": "CrayThomas",
        "title": "I [33M] live a life away from people. My family keep insisting that I end it and come back.",
        "url": "https://www.reddit.com/r/relationships/comments/56xjru/i_33m_live_a_life_away_from_people_my_family_keep/",
        "score": 2886,
        "num_comments": 341,
        "created_utc": 1476185679.0,
        "selftext": "About 8 years ago I decided that I don't want to live around people anymore. This isn't about something that happened or me thinking people are bad or other crazy thoughts, I just could never fit with people. I never had friends, but never felt like I needed them either. I think I might be somewhere in the autism spectrum but I don't have an official diagnosis. I'm cool and fine on my own.\n\nI grew up in NYC and finally decided that the environment there is no good for me. I decided to move to a different state, buy some cheap land in a very small village and built a house for myself. The only people I interact with in person on a daily basis are the people at the market where I buy stuff and when something is delivered to me. To be honest, it's the best decision I've ever made. I'm much happier and more comfortable.\n\nI have a lot of online friends. I'm a software engineer and make apps and games. I can work from the comfort of my own home and the living costs are so low that I have no stress about money. I've already made enough to last me 30 more years of living like this.\n\nNow my family are the only people that I have some sort of emotional connection with. I have a more or less good relationship with all of them especially my younger sister who visits me quite often. The thing is, they all say they miss me. They want me to come back living in NYC, they say I should get out of my solitary life and start a family for myself. I can't do those things. And my parents are calling me selfish for not even trying.\n\nI feel really bad when they're upset at me, it feels like everyone I know is upset so I must have done something wrong. I'm not good at communicating these feelings. I think they thinks I'm sad because I'm lonely but I'm not. It's by choice. \n\nFirst, do you think I'm selfish? I know they want what's best for me I just don't think they know what is best for me. And second, is it selfish of me to not give things another try in NYC?\n  ---   \n  **tl;dr**: I choose to live alone away from cities. My family want me to work harder to fit in.",
        "permalink": "/r/relationships/comments/56xjru/i_33m_live_a_life_away_from_people_my_family_keep/",
        "comments": [
            "My uncle did this, moved into the wild of BC about 30 years ago. It was the best thing he ever did for himself. Sure it's weird for our family at first, because it's far from the norm and really far away from family (Ontario).They got used to it. He just belongs there. My brother [22M] seems to be the same way, we often send him up there for a few months at a time, I also think my brother may be on the autism spectrum as well. It keeps him calm and makes him really ambitious and productive when he goes up there. I sometimes encourage him to stay longer because when he comes back he seems so refreshed, healthy and put together, I feel like that's when I see my brother at his best. Then the longer he spends with more people here in the city, the more depressed I see him get. I' fairly sure I'm accepting of his life this way, but my parents as well are still stuck on him living a \"normal\" life, but that just doesn't suit everyone! Just sometimes that takes people longer than other's to realize. I think solitude for some people is honestly the best possible solution. Just make sure to take advantage of opportunities to see your family, it's good for you (in my brother's case, good in small doses). \n\nThey'll adjust. Just stand firm that this is what you want to do, and where you want to live and that you're happy and hope they can accept that, be persistent, hopefully in time they'll get a better understanding. ",
            "[deleted]",
            "There is a line between being *selfish*, and *living life as you choose*. \n\nYOU are *living life as you choose* = you are not selfish\n\nTHEY want YOU to live YOUR life the way THEY choose =  they are selfish\n\nEasy. No grey area here, each of you is situated clearly on opposite sides of that line.\n\nPS: I envy you!",
            "My late mother was a die-hard New Yorker.  Though I grew up mostly in DC, because my parents had way too much interaction with both of their families, and rules for visiting were constantly being blown through.  But in her heart, my Mom loved New York, deeply.\n\nBut she was the first one to say that NYC has so...many...people.  And the only way you can really enjoy living in NYC is if you can afford to make a buffer for yourself.   Otherwise, it just gets to be overwhelming sometimes, even for a native like her.\n\nYour family is probably part annoyed that you aren't close - my husband and I are in the Twin Cities, and my NYC-born father CONSTANTLY bitches about how far away we are, even though he admits he really likes where we live - and a little bit jealous you broke the mold and found a nice, quiet, affordable lifestyle.  There's also probably a dash of that John Updike quote: \"The true New Yorker secretly believes that people living anywhere else have to be, in some sense, kidding.\"\n\nYou are not being selfish.  You are self-aware and know what will keep you level.  You don't sound like you're a total hermit - your family visits, you do go out to market instead of having everything delivered - and you know your own limitations on interaction.  There's nothing wrong with that - in fact, there's a lot there that's right.\n\nJust tell your family you're happy where you are, because it's right for you.  It's not about them, it's about what works for you.  I love NYC myself (I'm Brooklyn-born, so it's in my DNA), but man, I can't imagine living there now.  The expense alone just doesn't seem worth it - there are places to live that are pleasant that aren't NYC.",
            "At the end of the day, it is your life. It is you who will have to look at yourself in the mirror and it is you who will be with your thoughts when lying in bed waiting for sleep to come. So, you have to do what makes you comfortable. It is perfectly understandable that your family would want you to get married and have children because from their experience, that is what made them happy. A lot of times, we want other people to do what made us happy and have a hard time understanding how other people doing what would not make us happy, could possibly make them happy. I suspect that this is where your family is right now. They don't understand you.\n\nI can tell you from experience that there is nothing worse than changing yourself so much, to fit into the expectations of another person, to the point where you become a stranger to yourself. There is nothing more confusing and more disorientating than thinking you need to fulfill another person's idea of you so you can be accepted to the point where you cannot accept yourself anymore. There is nothing more draining than giving away pieces of yourself, till you are just a shell of a person. \n\nAnd worse still, after losing so much of yourself, you need to go back to finding yourself, which is another journey in itself. If you are where you are and are comfortable with yourself, then you are better off than a lot of who are living up to society's expectations.",
            "Do you ever visit them, or do they do all the travel? Just asking because that's the only potential selfish aspect of the situation I can see from your post.",
            "If you had a couple of horses and a couple of dogs, I would want your life. Good for you.",
            "I understand that your family misses you. I also understand that it's difficult for most people to wrap their heads around the fact that not everyone needs to get married and reproduce to have fulfilling lives. \n\nYou have to do what makes YOU happy. Sometimes this includes reducing the amount of contact with your family to a minimum because it's making you unhappy. \n\nYou know what makes you happy and you went and got it. Why doubt yourself now when the only issue with it all is the opinions being forced on you?",
            "So, first of all, living life on your own terms is never selfish.  The big decisions like where and how to live, if you're not relying on others to do it or making them do it with you, that's no one's business but yours.  Continue living where you love to live guilt free.\n\nBut one thing that I notice you saying is that your sister visits often, but not that *you* visit *them* often.  When you have an emotional connection with people, and you care about that relationship, you do need to put in work to keep it up.  As an introverted person myself, I notice that often the ideal amount of time that I want to spend with my loved ones is less than the ideal amount of time they want to spend with me.  It's easy to get into a pattern where people keep coming to visit me, but I never go to visit them.  And it's not because I don't want to see them, but it's because they feel like they want to see me sooner than I start thinking \"Oh hey I haven't seen so-and-so in a while.  Maybe I should go see them.\"\n\nIf you care about your relationship with your family, you don't need to go move back to a life you don't like to make them happy.  But you should try to realize that they're expressing to you that they miss you and they want to spend more time with you.  Is there any way that you could make more of an effort to socialize with them?  To visit them more often maybe?  Or schedule trips together?\n\nIt's also possible that that's not what this is.  They miss you, but more that they're worried that you're not living a happy life because you're so frequently alone.  They're projecting their values at you, and trying to guilt you into moving back because they think that's best for you, or they want you to live a life that they think you should live.\n\nI think that it's important to find a way to interact with them on your terms, but caring for their needs, and building a relationship with them that you're happy with.  It might mean going to visit them more often than you otherwise would want to, but then firmly saying \"I'm really happy living in *location!*\" and  changing the subject whenever they try to ask you to move back somewhere you don't want to go.",
            "Living in a quiet village is not exactly living in the woods as an isolated hermit.  \n\nThey may never come around, and maybe it comes from a place of genuine concern because they just can't wrap their heads around your choice.  When it comes up, let them know that you are happy and quickly shut down the conversation every time.  There's not much else you can do, tbh.  Meddlers gonna meddle.  ",
            "They care about you. However, they are saying these things because there is a common perception of a 'good life' that has been drilled into their heads since childhood. Job, Money, House, Marriage, Kids etc.\n\nOften we fail to question our beliefs because they are comfortable, and invisible. And we think that those who deviate from the standard are wrong, or in pain, or suffering, and we want to convince them to change and come back to 'the good life'.\n\nYou aren't suffering, or delusional, or lonely. You're happy, and are leading a fulfilling life. Not all of us gain  happiness and satisfaction from the same path, the same things.\n\nExplain to your family that you were deeply unhappy before in NYC, and now you've found happiness and peace. To go back would make you unhappy again, and they wouldn't want that.\n\nIt's not selfish to to choose to live a life that makes you happy. Yes, they feel that they need you around, want to look at you, talk to you, but asking you to move so they can fulfill their wishes at the cost of your happiness is them being selfish, not you.",
            "Fellow introvert here.  Do what makes you happy :). Sounds to me like you've done absolutely nothing wrong",
            "Just do what makes you happy. They'll come around when they realize they can't manipulate you into doing what they want. ",
            "You're not selfish at all. They are for trying to force you into doing what they want. It's your life. Live it how you want to live it.",
            "You rock.  \n\nKeep on, man. Stay the course, if it makes you happy. ",
            "To quote Oscar Wilde, \"Selfishness is not living as one wishes to live, it is asking others to live as one wishes to live.\"",
            "I don't see this as selfish at all. Your family needs to accept that you are more comfortable where you are. You can always make trips to visit them and vice versa. I live across the country from most of my family and we make it work. ",
            "You're not selfish, enjoy your solitude.  If you never go to visit them, do that sometime instead of always having them come to you.  \n\n",
            "As long as you take care of yourself and don't turn into one of those feral old men who never bathe and wander around looking like an old hobo and muttering to themselves, I'd say you're fine. Maintain hygiene, keep up your social skills, and there's nothing wrong with it.",
            "How did you set up the life you live? This is something I'm very interested in doing ",
            "If they were worrying you have mental health issues I might agree, in the sense that I would be worried about anyone I know who decided to become a modern hermit. You have good reasons but it's one of those situations where it is impossible to convince others that it is the right one.\n\nBut that's not what they're saying, they are saying it is inconvenient for them that you don't live nearby. That they want someone to hang around with, to go out with, to have grandkids/niblings they can coddle.\n\nOrder your thoughts and send them an email. Give them the facts: You hate crowded and busy places. You moved away from NYC to get away from that. You love your life here. You live cheaply and healthily in beautiful country and get all the socialising you need online and with them. You're never moving back so stop asking. A family is not something you ever wanted so don't expect a wife or grand kids from you. You're happier here than you've ever been so please stop calling your decisions elfish. It's more selfish you want me to be unhappy. Please stop talking about it.\n\n>First, do you think I'm selfish? I know they want what's best for me I just don't think they know what is best for me. And second, is it selfish of me to not give things another try in NYC?\n\nNo\n\nFirst off, kids moving away from their hometown is standard in modern America. Most people seem to move at least several hours away so even if you were an epic level socialiser you'd probably still live somewhere that would make visiting inconvenient.\n\nSecond you're not going out of contact. By the sounds of it you are on the computer most of the day so they can message you any time. You also don't object to them visiting either I assume?\n\nThird, making you live in NYC would make you miserable but would only make them a little more happy. They miss you, but they don't spend all day in bed crying that you are gone. Even if they did, it'd be their job to get over it. It'd be a small benefit for them compared to a massive loss for you.\n\nFourth there's nothing you being in NYC provides that is vital to them are irreplaceable. They're not sick and need you to care for them. They're not kids who need you to look after them. They're adults and can find their own entertainments.\n\nAs for another try you are 33 years old. I think you figured out this is what you want by now.",
            "You know what's selfish? Other people telling you that you must live your life on their terms. *Especially* when the life in question isn't how you want to live.",
            "That sounds like a great life in all honesty.\nDon't live a different life out of guilt.",
            "I'm a bit jealous of you. Most people have an innate desire to have social contact, even if they're cynical.  \n\nMaybe you're selfish. But even so, so what? We're all selfish to an extent. You know what's best for you so you do what's best for you. There's nothing wrong with that as long as it isn't harming other people. Maybe, but you don't have to give things another try in NYC. If you're fine alone and that's how you are, you don't need to change to fit what other people's standards of how humans should behave.",
            "Damn I am jealous. I really want to move to a small town with a good chunk of land and a dog. Not too far out into the woods or anything, but far enough that I don't have to interact with anyone I don't want to.",
            "just a thought: you might actually qualify for what DSM used to call \"schizoid personality disorder\". DSM is the american psychiatric manual. This was used to refer to people who aren't close to others, don't have a need to, and are only close to first degree relatives; among other things of course. Check it on wikipedia. In the recent version of the DSM, schizoid was removed as a distinct personality disorder because it's not that well validated [source on this: medscape], and because it was so controversial. The relevance to you is: it was controversial because people with schizoid aren't suffering, aren't a danger, aren't dysfunctional, etc. They're just different, they deal with things differently, perceive differently, and so on. There is no need to label them as having a disorder and send to treatment when there's nothing actually wrong. So that's a thought with regard to your case and your family's attitude. Good luck! ",
            "It's your life to live. They can miss you, but if they love you, they'd rather miss you and have you be happy than have you around all the time and you're miserable. \n\nThey don't like solitary life. They can't imagine not having a family. They think those things will make you happy like they make them happy, and that's why they suggest it. They just don't understand that solitary existence makes you happy.\n\nYou already tried their way. That's how you know it doesn't work. Now it's their chance to show you whether they care about you enough to see you be happy.",
            "You are living the dream of so many people!\nStick to that what makes you happy :)",
            "No, you're not being selfish, your family is by demanding that you change your life and make yourself less happy to cater to their wishes. If they can't accept you for who you are and the choices you make, then that's their failing, not yours.",
            "My first thought is they might think you chose this life due to depression or another mental health history. They might think they need to reach out to you because they think you're hurting. If that's a conversation you're comfortable having, you could explain to them that you're perfectly happy and this is the life that feels right to you. \n\nSide note? I'm super jealous. I'd live this life in a heartbeat. I grew up in the NYC suburbs and moved to a much more rural area but still have more human contact than I'd like. Kudos to you for living the dream.",
            "You aren't selfish. You have to take care of your own health, whether that be physical or mental. Having to endure social interactions that make you uncomfortable on a regular basis can negatively impact your mental health. You did what was right for you and they should respect that.\n\nDon't give things another try in NYC, keep figuring it out. You should talk to a mental health professional, just in case, because if you have another serious condition it could creep up and you could lose control. Trust me, it gets the best of you before you know it. No it's not exactly normal to avoid all people, and it CAN have an effect on your mental health.",
            "You're living my dream.  ",
            "Your life sounds amazing. Keep doing what makes you happy. This life is yours, not anyone else's. ",
            "Your life sounds like the perfect life, not gonna lie. I don't think you're being selfish; too many people compromise on what they want to make others happy and to \"fit in\" but you've made something for yourself. As long as you're visiting them for holidays, keeping in communication, etc. they should be content. While they might want grandchildren and argue that they \"only want the best for you,\" their vision of your perfect life and your vision do not jive. \n\nYou express yourself very well in writing. I would suggest an email or letter to your family (before the holidays, probably) expressing all of this and laying down some boundaries; i.e. not to corner you at holidays about this subject, and not to incite the family to gang up on you about your choices. ",
            "My Uncle Joe did what you did, but back in the 50s.  He bought a ton of land up in the mountains and lived there, mostly by himself, for the rest of his life.  He spent ten years digging a pond and building a dam to have water generate his electricity.  He lived in a giant barn and slept in a trailer.  He had a wood burning stove.  He went into town once in a while to get food, but that was about it.  He loved it and was super happy.  \n\nHe was like my dad's dad to him and we were the only ones who ever visited him and we did so often.  Everyone else thought he was crazy, but we loved him and we loved going to see him.  Once in a while, he would come to our house, but it was painfully obvious even when I was a little kid that that sort of living just wasn't for him.  No big deal.  We just went to see him instead.  Some of my best memories of being a kid were spent at Uncle Joe's.\n\nWhen he died, he left all of his property and all of his land to my dad because he was the only one who gave a crap when he was alive.  (Oh, you can bet every other relative out there came out when he was dead and pitched a fit that they didn't get anything.  My dad spent years in court fighting these idiots and finally won.)  \n\nI hope that your family comes around and realizes that you're happy and happier the way that you're living and tries to connect with you rather than change your mind.  I definitely don't think that you're selfish.  In fact, I totally get it.",
            "You are selfish for living a life you prefer? If you enjoy your life, you have nothing to change. It's your life to live how ever you see fit. NYC is a beast of a city that isn't for everyone. Hell most cities provide a lifestyle that isn't suited for everyone. Keep doing what your doing. As long as you're happy, eventually people will realize they are being selfish for wanting you to change to accommodate their lives.",
            "I agree w/majority here that you aren't selfish, if you are happy then they can visit you if they miss you.\n\nIt's awesome/refreshing to see someone living a happy life and not always struggling to move up.  Kudos to you sir.",
            "Your life sounds glorious! Don't give it up!",
            "Is it selfish to be happy?  I suppose it is if you debate everything that goes along with what makes a particular person happy.  *But selfish doesn't automatically mean bad*  By that logic, anyone following their dreams is selfish.\n\nSome people go their whole life striving for happiness.  It's the ultimate dream for everyone.  You've found it.\n\nOf course I'd miss my brother if he chased a lifestyle that ultimately led him far away from me.  But I'd also be envious and proud of him as well.\n\nI see where your family is coming from but I don't think they grasp where *you're* coming from at all.  They may be happy with their lives in NY and miss you, and want grandbabies, but doesn't that ultimately make them selfish as well to ask you to sacrifice your happiness for theirs?\n\nThey must not grasp the appeal of your lifestyle which makes it hard to respect.  I think they see it as one would their adventurous child running off to travel the world backpacking and eventually it'll be time for you to satisfy that phase and come home, marry, make babies, and live \"sensibly\"\n\nIt's not for you.  I envy you that you've found your spot in the world and you should never give it up.  In fact for you to give it up for a woman and family somewhere that would make you miserable I think *that* would be much more unfair to that hypothetical family.\n\nI don't think you'll ever get your family to truly understand you but calmly, without an ounce of frustration, responding that you are truly happy with the life you've made for yourself is all that they should need to hear and you don't owe them anything more than that, especially if they don't strive to understand or respect your stance in return.  They don't have to like it.  They don't have to understand it.  It's not their life and that's ok.",
            "You just keep being you. Livin' the dream, you are.\n\nThis is how future conversations should go:\n\nThem: \"You should start a family!\"\n\nYou: \"Uh huh, ok. I'll do it tomorrow.\"\n\nThem: \"Listen to me... blah blah you have to be something you're not because or else the world is going to explode and it makes me feel bad!\"\n\nYou: \"Oh, ok. Are you done?\"\n\nThem: \"You're selfish!\"\n\nYou: \"Telling people how to live their life is selfish.\"\n\nThem: \"But blah blah blah\"\n\nYou: ::Hang up the phone:: / ::Leave::\n\nThey are disrespecting you, grow a spine. Maybe sending an article or two their way about Sensory Processing Disorder might help them understand but maybe not.\n\nNew York City is *awful* in many ways. It's an amazing city, but it's awful too. You couldn't find a worse place for someone like you to live unless you went to China or something.",
            "Youe life sounds very appealing to me. I would live a similar lifestyle if I could.",
            "Dude you're living my dream.. thank you.\nI hope one day to follow in your foot steps.\n",
            "Shit I wish I could leave the city and live in the woods (with good, high speed internet)",
            "Most of these posts are right (you should stay the course and do what makes you happy) but are missing when it comes to dealing with your family.\n\nYour family is concerned about your lifestyle. It's different from what is \"normal\", and that makes people concerned that you aren't really happy. Imagine if, your sister decided to gain a ton of weight. Like, 600 pounds. That's the thing that would make her happy in life. And then she starts doing it. Now, your parents, her friends, and you would probably be concerned. That doesn't necessarily make someone selfish or a narcissist. I think the big fear a parent has is, after dying, from the afterlife they see their children with an omniscient presence and see that their children hate their lives and regret their decisions. (Gaining a ton of weight is not the same as living on the outskirts of society, it was just the first type of comparison that came to mind.)\n\nYour parents sound like the type of people whose concern comes from care for your well-being, as opposed to malice. But that doesn't mean you are making the wrong choice. You're an adult, and have enough life experience to make a decision like this. You are living life on your own terms, and if that makes you happy, go for it.\n\nIf you feel like you're a good writer, I recommend writing them a long letter. Understand where they are coming from, but tell them that this makes you happy. You love your job, you have online friends, you love your house, let them know these things. It sounds like you enjoy when your family visits, maybe take the impetus to visit them sometimes (that's the only thing I would say is slightly selfish, if my friend always makes me go to his house and never comes to my house that would upset me.)\n\nYou can end your relationship with your parents if you want to, but it sounds like you don't want that, and it doesn't even seem necessary right now. Give them a chance to understand.",
            "Sounds to me like your living the life. Any tips on how I can do the same?",
            "I want to be like you. I think what you did is pretty awesome. Do you mind sharing how you did this?",
            "Your parents are being selfish by asking you to come back.\n\nIf you are happy and comfortable with your living arrangement you should not change it to make other people happy. \n\nI also don't particularly enjoy the company of other people. I work from home mostly, and really dislike any days I have to go into the office and see people. I find it exhausting. \n\nI don't particularly have many friends - as quite frankly I don't enjoy doing the things people my age do. I live with my partner and my dog. I enjoy going for walks and going about my daily business in peace. \n\nThat's just me. My sister is the polar opposite and ensures that her days off work are booked solid of seeing people and doing things. I couldn't think of anything worse! I go to breakfast with my mom and step dad once a month.\n\nAnyway, i'm rambling - continue doing what you are doing. As long as you're happy there is no need to change!",
            "You are not at all selfish.  Your parents are asking you to value THEIR happiness at the cost of you being miserable- and if that's not selfish and entitled, I don't know what is.\n\nMy experience has been that people who love being around people, or who love having a family etc., are often fundamentally incapable of grasping that anyone could be truly happy without these things.  Your parents may fall into that category.\n\nYou can't change their minds.  But you can end the conversation.\n\nThe next time it comes up, have a statement prepared.  Tell them, \"Mom, Dad, I am happy living this way.  I have plenty of friends online, and being away from the bustle of the city has done wonders for my well-being.  If I want a family one day, I am capable of making that decision and taking action on my own.  I know you are concerned for me, but I have explained this many times, and I'm sick of discussing it.  The topic is closed.\"\n\nWhen they bring it up again, gently remind them that this topic is no longer up for discussion.  If they persist, change the subject, hang up the phone, or leave the room.  Refuse to engage.\n\nIt'll upset people, but they will eventually get used to the new status quo.  It beats being hounded about this for years to come.  And you should remind yourself that THEY are why they are upset- you are simply defending your right to choose your own path in life.  Their inability to accept that is what creates the friction, not your choices themselves.\n\nPS- your life sounds amazing.  If I could work from home full-time, I definitely would.  Otherwise we sound very much alike in our preferences.",
            "Honestly this is super common. And the funny thing is it IS selfish, but of them, not you. \n\nTHEY are being selfish. They have plans for your life like you aren't a person who is of state of mind to make your own decisions. But you are. You have your own desires, feelings, dreams, hopes, goals, comfort levels, etc. \n\nYou are happy. You feel like your life is your own. And if is playing out in a way that makes you feel good. So you did it. BUT it goes against their idea of happy. \n\nThe only thing you can do is to tell them no, mean it, and stick with it. \n\nA lot of people have to do this with their families. I did. My SO did. My friends often do. \n\nIf you go against traditions at all you become a victim of it. Because they can't understand it they thing it is wrong. They would be telling you the same thing if you were gay and wanted to marry a man. It goes against their vision of how your life \"should\" play out and they try to emotionally manipulate you into changing into the person they want you to be. \n\nIgnore them. ",
            "You aren't doing anything wrong. You're doing things against the lifescript. Which is not a reason to stop doing it.",
            "You have one life, life it the way that makes you happy, not others. They are the selfish ones, want you around for themselves. Just keep ignoring, sounds like your life is pretty nice and planned out.",
            "Your life sounds great! It's good to see people do the things they want to do, and not sacrifice your own happiness for your parent's contentness (because let's be realistic you doing something that makes you unhappy for them won't really make them happy). I aspire to that.",
            "You may not live how most live, but that doesn't mean you're living wrong. You made a conscious choice and you're happy with it. In a lot of ways I envy you. No catty coworkers or office poltics. No heartbreak. No drama. I can see the advantages. \n\nYou obviously know you chose this and are free to choose differently any time. You also know you can choose not to. You do you.",
            "They're the ones being selfish for telling you how to live your life. ",
            "You sound happy and well accomplished. That should be all that matters. ",
            "You're not selfish at all on both counts.",
            "No you are not selfish. You're a modern day hermit and that is a valid life path.\n\nDo some googling on it. Fascinating stuff out there.\n\nAs long as you're healthy and happy, don't change.",
            "I don't think it's selfish. If you're living your life, not hurting anyone and are happy then I think it's selfish for your family to try to put their feelings about how you live YOUR life over your feelings. \n\nTell them you're happy and they should be happy for you. Tell them you don't want to start a family now or maybe never. I would also tell them that they need to accept your decision. Make sure they know that you love and miss them as well and you don't want to be made to feel that you are letting them down. ",
            "You sound like you found a little slice of heaven there!  I would stick to my guns.  Invite them to visit, have a nicely appointed guest room and maybe you visit them as much as they visit you.\n\nRegarding your solitary life and starting a family:  parents don't want to think you are alone and have no one to share your life with.  They may also be thinking about grandkids.  They love you and don't want you to wake up at age 50 with regrets.  That said, romantic relationships can be utter bullshit and if you're happy by yourself, then by all means be happy!  Acknowledge verbally that you recognize that their comments are coming from a good, loving place, but that being happy on your own is a critical precursor to anything else.  \n\nI would not go back to NYC.",
            "You say you feel bad that they miss you, but do you miss them? Because you sound happy the way you are in your post. \n\nPersonally, I'd write them a letter saying how much you love them and care about them but that the city they love was wrong for you. You never felt comfortable there but now you've found a place you love. Make it clear that you appreciate their concerns because it is a sign of their affections but you won't be coming back. I'd also include some pictures (if you've taken any) of your home showing all the nice things (like here is the sun rising over the trees outside my house, here is my favourite spot to come up with new game ideas, etc). \n\nOnce you've attempted to share the beauty of your newfound happiness, either they'll be happy for you or they won't.",
            "Absolutely not. You are living your dream, not their dream for you. I would (metaphorically) kill for your set-up. They are asking you to come back to NYC! If they cared, they'd at least be trying for a smaller town in NY. They are calling you selfish because they are trying to manipulate you and that is a great way to do it because most people hate to think they are being selfish. \n\nI'm also a little uneasy about the we miss you pleas because it sounds like you talk regularly and your sister visits a lot. I guess they maybe miss having experiences with you, but it's more likely they miss the ease of having you nearby which I don't feel is your problem. \n\nFurthermore, anything after you've said no three times moves into harassment. Shut them down.",
            "Nope, you are not\nbeing selfish. You are living *your* life. You don't owe them anything. They can visit you whenever you'd like them to and if you feel comfortable then go and pay them a *visit* in NYC. \n\nDon't uproot the new life you have created for yourself (which may I add is very brave and independent of you, kudos) because your parents think you are \"sad\" or \"lonely\" - the only one that knows that is you. If you feel happy where you are, that is what matters. \n\nGood for you for taking the reins in your life and deciding where and what you want to do. Who knows if maybe they are even a little bit jealous that you were able to do this on your own. Some people want to do that kind of thing but have co-dependency issues with those around them and can not fathom moving away from family. I'm proud of you.",
            "Doing what is best for you, is not selfish at all. Maybe go and visit them a little more, but continue to live your life the way that makes you most happy. ",
            "[removed]",
            ">I'm much happier and more comfortable.\n\nYou're a lot better off than most people. Keep on doing what you're doing, dude!",
            ">And my parents are calling me selfish for not even trying.\n\nYour parents are selfish because they want you to birth grand children for them. Don't let them guilt trip you.\n\nHave they ever lived anywhere besides New York? New Yorkers tend to think New York is the best place on earth and think people who disagree are nuts. That could be part of it.",
            "In a different generation, you would have been called a mountain man, and we'd have thought no more about it. Your lifestyle choice only seems strange to your loved ones because in a highly connected world it's much more unusual for someone to opt out of the kind of life they wanted for you. There's nothing wrong with you, and it's your right to live in the way you're most comfortable, as long as you're not causing harm to others. (Your family's hurt feelings don't count, because they don't outweigh the huge negative effects living in a crowded city had on you.) ",
            "Stay where you are. Maybe visit them a little if u can. But don't uproot your life and risk your own happiness to make other people happy. It's YOUR life not theirs. ",
            "They love you and want you near, but are showing it in the wrong way. Just go visit more. I think that would be a good middle ground. ",
            "You appear to be aware of what existence makes you happy and comfortable, and have chosen to live that life. That's not a selfish choice if you are happy and healthy.\nThe fact that this lifestyle does not conform to some \"societal norm\" clearly makes your parents uncomfortable.\nHave you considered the possibilty that your family feel they may be at fault for the lifestyle choice you have made?\nPerhaps you could visit them in NY, and reassure them that you love them, but also make it clear that you are very happy with your life and that the choice does not reflect on them as parents.\n\nIt sounds to me like you have made a great choice.\nNot many people, at the age you made the choice, are self aware enough to create the life that suits them.\nCongratulations.",
            "This is far from selfish. What other people have posted is spot on. You are living how you choose and every person has a right to do that-to find happiness. \n\nYour set up sounds amazing, by the way. This is something I would like to do, add in a dog maybe, that my family doesn't understand either. No family plans, not big on living for my career, just getting by and being happy would be fantastic. All the power to you and good luck with your family. Stay persistent and maybe if they visit you they would understand better. ",
            "Your family is being selfish by demanding that you give up your happiness in order to provide them theirs. If they love you, they will have to accept that you are doing what you need to do to feel comfortable with yourself. There's not much more they could ask for, right? \nI think this is a problem that a lot of us in our thirties, and sometimes younger, face when we come into ourselves. It took me a long time to figure out that the reason that I was miserable is because I was trying to be what my family wanted me to be rather than who I am in my heart and soul.\nYou're not wrong, and you shouldn't feel guilty. You're not responsible for their feelings. That's something they need to figure out on their own. Kudos to you.",
            "Who's being selfish here?  You're happy.  They need to appreciate that fact and realize you don't exist to make THEM happy.  There's obviously love and affection, and these concerns come from a good place from them, but for anyone to tell anyone else how to live their life (when they're not hurting a soul, and in fact quite the opposite)... that's a bit off putting.  I agree with u/ObviousNo in that you need to shut this down each and everytime they bring it up.  Your needs are yours:  not theirs.  ",
            "They miss you so they want you to change your entire life around to suit their desires, and then they have the gall to call you selfish? I hope you see how incredibly backwards this is. \n\nThis is literally the thought process. \"He won't do what I want or give me the things I want (ie another family and grandkids). How selfish!\"\n\nThere's nothing selfish about living the way that makes you happy. It IS selfish to expect others to go out of their way, and outside their comfort zones, to make you happy.\n\nExplain to your family that you're happy, not lonely, and that their pressure to change your life to suit what they want is unwanted.",
            "Dude, I wish I could live this life you're living. I hate the city, and if I could afford it I would do the same and buy land live in solitude. I love being alone, I think you're living a life you chose and you're happy doing it so don't let anyone else talk you out of it. Just make sure to still keep up with family and with your parents, we don't know what we have 'til it's no longer around.",
            "You are living a life that you love and are happy with.\n\nIt is selfish of them to insist that you give it all up and try and live a life that you are unhappy with and do not want in order to fulfill their empty expectations of you.\n\nIf they want to see you more, they can visit or skype.\n\nIf they want you to get married and have kids, then they can keep on wanting that. That's fine. They can wish with all their hearts for that, but they can't reasonably ask you to do that if you don't want to.\n\nImagine telling your mother \"Mom, I feel like it would be right for you to live less like you do and more like I do. That's what I am expecting and I'm *really* unhappy and upset that you're ignoring my feelings on this. I think you'd be happier if you left our family home and moved into a small house on some land like I have. When are you going to give up this stupid 'family life' that you've got going on and start really living?\"\n\nThat sounds crazy, doesn't it?\n\nWell that's kind of what they're telling you to do.",
            "Write them a well though out letter, explaining how you feel, and emphasize that you have never been happier. ",
            "Hahaha fuck NYC, good for you man. You've done very well for yourself.",
            "Show them this post and hope they understand.",
            "Youre living my dream honestly just tell them over and over again that youre happy as you are ",
            "Nope. Your happiness matters. They need to adjust to your adult choices. ",
            "It's your life. If you are happy do what makes you happy and if they love you as family should then they will agree with your choice  ",
            "Set up a discord channel and invite them to come in and hang out with you, and take the time to email them periodic updates and let them know they're in your thoughts.\n\nI'd say that'd be a pretty good compromise.  If they continue to press you to move back to NYC, show them that it is THEY who are not making any effort in the relationship.",
            "This honestly sounds like a beautiful life. Invite your family to visit but don't compromise your happiness just cause they say so.",
            ">First, do you think I'm selfish? \n\nSure. I think a certain level of selfishness is essential to a happy and healthy  life. You're living your life in the way that is best for you. We all do that. I think that your parents are being more selfish though for wanting you to change your entire life to accommodate their desires.",
            "You're a grown man, you make your own decisions.",
            ">First, do you think I'm selfish? \n\nNo.\n\n>I know they want what's best for me I just don't think they know what is best for me. And second, is it selfish of me to not give things another try in NYC?\n\nNo. It sounds like you made the best decisions for yourself. Your family misses you, so they are taking the bad step of using guilt to try to get you to move back.",
            "It sounds like you are doing just fine. There is nothing selfish or wrong about living life on your terms. You are not sitting around doing bad things to purposely hurt other people. You sound like you are an introvert who enjoys your solitary life. I can understand this way of living. I am an introvert myself, and people don't always get it. \n\nI don't think you are doing anything wrong. It think it's wrong to get angry at people for living a life that they are comfortable with. They are projecting how they would feel in your situation on to you, when you are doing just fine. I think you know what is best for you. It doesn't matter if you are on the spectrum or not as far as that goes. People should respect your choices, as long as they are coming for the \"right\" place. You have a right to your life, your decisions, and your boundaries.",
            "You're like my brother. People will never stop asking. Just come up with a canned answer and just use it every time someone asks. Eventually people will stop asking. People will either understand or they won't, and those who do will respect your decision.",
            "You aren't selfish. You have to live your life in a way that makes you happy and fulfilled. You can't be either if you live your life for someone else. Healthy relationships - from business partnerships to romantic connections and everything in between - are built on communication, respect, and trust. Ask that they trust you to know what's best for yourself and respect that decision as many times as necessary.",
            "No. You are not being selfish, they are. You are happy with your life which is pretty damn amazing because most people aren't. Your family wants you to move back FOR THEM, not because it's what's best for you. I think you should just explain to them very clearly that you are happy with your life and they should be happy for you. Live your life how you want, not how others want you too. ",
            "If you're happy where you are, why bother changing it?\nIt's your life. You do what you want. \nThey can visit on your terms if they should accept. \nIf you feel better where you are then no one should be telling you to do otherwise\n\nThat's just selfish of them. Take care of you. Whether anyone wants to admit it to themselves or not, it's true: YOU are the only person that is going to be there for you for your whole life. People come And go. But you're always gonna be there for you",
            "You're saying to your family \"I do what I want, and you do what you want.\"\n\nYour family is saying \"we do what we want, and you should also do what we want.\"\n\nHow are *you* the selfish one?",
            "Lots of people move away from their home city. It's a normal thing. Your parents will just have to deal with it like other parents. Don't go back to that city if you are not happy in that city. \n\nAs far as living a solitary life, that is really your choice. If you're truly happy that way, then go for it. Sure, most people will get married and have kids one day, but not everybody will do that. You are just one of those people who may never get married. ",
            "Can you compromise and visit annually if you don't already? You don't even have to go to NY, you can arrange to meet them for a short vacation somewhere more relaxed to spend family time together. ",
            "You are allowed to be selfish for decisions that effect your life and your life alone. You do not owe anyone your company and no one has a right to demand it. They can visit if they want to and you could plan a trip to see them but a family is not necessary. Tell them you will cut them off if they continue to harass you. ",
            "I have so much respect for you sir. I'm 24 now and over this past year I've done what you have minus the moving away portion. I live with my dad, go to work, then come home and go out whenever I need anything. I honestly enjoy spending time by myself and being me.\n\nWith that said, do whatever makes you feel most comfortable, which I'm assuming is your current living arrangement. If you do end up moving back amongst the family I'd totally keep the place tidy for you and enjoy the time away from the world.",
            "If they are wanting you to completely step out of your successful life and comfort zone for them to have grandbabies, which you don't want anyway, who is being selfish? It surely isn't you.",
            "Oscar Wilde said something along the lines of, \"Selfish isn't living how you want to live, it is expecting others to live how you want them to live.\" I think this greatly applies here. Also, not ragging on the possibility of you being on the spectrum, but you also might just be someone who likes to be left alone. Nothing wrong either way. And I don't see what's selfish about not trying to live a life you are pretty sure you won't like or be successful at, and potentially dragging a partner and children down with you. \n\nActually, you are kinda living my dream life. Best of luck. ",
            "It's disrespectful of them that they aren't respecting your decision on how you are choosing to live your life.\nTHEY are the ones being selfish trying to guilt you into doing something you clearly have not been happy with.\n\nThey clearly don't respect your choices and are being manipulative in trying to guilt you into moving back. Why not be happy for you, as you are doing what you enjoy and like you said, don't stress about money.\n\nI just keep wanting to talk shit about them. I think it says more about their unhappiness and possibly jealousy on their part because what you did is pretty gutsy and maybe they wish they could do the same. They may not want to do exactly what you have done, but maybe they wished they had taken that job in california, or gone back to school, whatever.\n\nWay to go in being your own person. Don't let them get you down. Be you. And continue to own it. Be sympathetic to their wishes for you, but gently let them know their views, goals, and ideas for your life aren't shared. Families live apart all the time. They do miss you, but they need to cut the chord. \n\nVisits, vacations, weddings funerals - you can still see them. And hello, phone calls l, texts, emails, Skype, whatever else is out there.",
            "How can you be selfish?  They are asking you to give up a life you love and have worked for in order to make them feel better.  THAT's selfish.\n\nMom, Dad, I love my life.  I've never been happier, just the way I am.  Surely all any parent can wish for is a child who lives a happy, fulfilled adult life.  I will not talk about this any more with you.",
            "Sounds like your comfortable and happy with life, that's what all parents should want for their children. I don't get how you're being selfish. ",
            "People have different means to happiness,they need to comprehend that you are happy this way.",
            "If you're happy live your life. Maybe vacation to them so they can see you're okay. Keep telling them positives in your life living out there even if it's how nice town looks or the weather. \n\nIsolation can be okay but you have to keep good check on yourself. I did bit of this (not as far as you) and found it had its pros and cons. Make note to have health check ups but for your mind as well as body. It's easier for these to slip when no one else is there to point it out or talk to face to face. Since if your health fails you might be forced to give up peacefully alone time ",
            "You can't live your life to make others happy, especially at the cost of your own happiness.\n\nThat being said, it's awesome that you do have a close relationship with your family. I have much envy.",
            "you're not selfish. you're living a life you're happy with.  there is nothing selfish about that, but most people don't understand alternative lifestyles - I know, I live one.  if anything, i'd say your family is selfish for wanting you to give up your peace and happiness because THEY want to be happier about your life.  they don't want what's best for you, they want what's best for them.  don't move.  explain to them that you're happy and you won't be happy there so you're not moving.  they don't need to understand it, but they do need to accept it.  they also need to stop trying to guilt trip you into living the life they want and accept you for who you are.  that's what people who love you do.",
            "I think you're doing awesome and I just have a question as someone who feels the same way. How do you deal without ever wanting a wife or what about when you're older?",
            "You are not being selfish. They are. They want to move home because they miss you. Doesn't seem like they care what is actually good for you or what makes you happy. You live your life however the hell you want. Do what makes you happy not someone else.",
            "You're not in the wrong.\n\nYou have the right to live your life the way that makes you happy. Your family sounds unhappy because your life didn't turn out how they had envisioned. That's still not your fault.\n\nInvite them to visit, keep the communication lines open (if that's what *you* want), and continue living the life that makes you happy.\n\nI only wish more people could see past the LifeScript like you have. Way to rock the life you've been given!",
            "You are living the life I desire. I don't see anything wrong or selfish. It would be selfish to make someone come with you to live like that just because you like living like that. But you are not doing that. They are trying to do that. So they might be selfish.",
            "I have absolutely no advice for your situation; I just wanted to come here and let you know that you are what I aspire to be. Just reading about your life in this post was one of the most calming things I've seen in a while, and I can't express how jealous I am. Both I and my wife are software developers as well, but I've not been so lucky as to find a remote work position to let me live in a place like that where it is quiet and simple. But to live away from people, in some quiet place somewhere, and work from home every day? Good lord I'm jealous, dude.\n\nGood for you. Hope you figure out how to navigate the whole family thing, but for now just know that I'm jealous lol",
            "You're not being selfish, you're doing what makes you happy.  They are the ones bring selfish by pressuring you to do what they think you should do.  It's your life, live it the way you want. ",
            "Recently, it was put to me that the reason my family views me as a weirdo they need to try to fix, change, or cajole, is because I don't fit into their 1950s mold of what \"normal family\" is. I am ok with this, but they are not. Thus, they will always try to convince me that it's my fault for living in a large city 30 miles away, as to why they never visit. My husband must be unfocused, that's why I'm the breadwinner. We don't have kids because we're selfish. \n\nThese are not my problems, these are my family's problems. Just like you coming down off your mountain is not your concern, it's your family's concern. They don't get you, they likely never will. Keep doing what you need to do, what works for you. As long as you're not intentionally hurting people and keeping in touch enough to satisfy you (if not them), then it's all ok. ",
            "Did exactly the same thing you did.\nEnded up moving back due to pressure from the family.\nRegret it immensely.\n\nFollow your own path.",
            "If being happy at no one's expense counts as selfishness, then...\n\nNope, I got nothing.  Thats not selfish.  Not even a little bit.",
            "Maybe you'll find a girl who wants the same things and you guys can live a little cottage lifestyle together without being in each others business all the time or socializing like butterflies. That would be super cute, I wish you luck.",
            "Golden words of life - you do you, unless you is an axe wielding psychopath.",
            " Your lifestyle is my  dream . holy sheat",
            "Sounds like you've carved an awesome life out.  They can visit and make an effort if they miss you. ",
            "I am actually on the spectrum and I can tell you this, you are not being selfish, you're happy, have your own home, good employment and don't have to worry about money? It seems to me like you've reached a near paradise, and could very well live in peace and happiness their, the real question is, do you think, many MANY years from now, when you're on you're deathbed, which decision would you regret?",
            "Brother you life sounds amazing. You family will say that because they are family, they love you. \n\nPersonally I would consider visiting them more often and maybe staying for a week at a time but by no means move back to the concrete jungle. \n\nYou have a life YOU love and your family doesn't get it; and that's okay. \n\nJust try to see them more often and take it from there ",
            "Selfish of them. You're thriving, they should be happy for you. Did you suffer when you lived in NYC? Were they blind to it? Just remind them what things were like when you were there, and make sure they know about your new life and how it has dealt with those issues.",
            "That actually sounds like a badass setup you have going man. You don't owe it to your parents to live in a big city which will make you unhappy, just for their convenience. Everyone is different, everyone wants different things, and if you ever end up having a family so be it. But you should *in no way* feel obligated to move for their satisfaction, as you are living your life in a way that makes you happy.",
            "Tell you parents you want them to divorce and live in separate states. When they decline, ask them if they're being selfish. We all get to make \"selfish\" choices about how we live the brief life we have been given. You have to live and be happy, on your own terms, just as they know they must. \n\nAll I'll say is don't cut them out of your life. Let them visit -invite them for a holiday -and go home to see them once in awhile too. You only get one family and they don't live forever. But live your life, your way and on your terms and it's no one's right to force you to do otherwise.",
            "I think you've made a healthy choice for your life.  I respect making that decision and I hope you can pull your family to respect that as well!",
            "Sounds like a great life to me! I understand where you're coming from, but your life isn't about pleasing others, it's all about keeping yourself happy. As long as it doesn't cause harm to others, by all means do it, I say! And don't feel guilty for finding your own piece of happiness. Enjoy!",
            "They call you selfish as if it's a bad thing. As if you're not supposed to live life the way *you* want to. What a joke. \n\nEverybody has their own life. This one is yours. Just remember that, it belongs to you, no one else. If you choose to share it with others, that is your choice alone to make. ",
            "Lol. \n\nYou're so selfish for doing what you want to do. \n\nCome as do what we want you to do instead.  \n\nWhy is their selfishness ok but yours isn't?",
            "Unless you rarely make an effort to visit them and they almost always bear the burden of making the trip I wouldn't worry. They might be wrong, but clearly it comes from the fact that they love you and miss you. Because you love them and they love you its not unreasonable for them to want to spend more time with you; they're worth the sacrifice of visiting them more regularly (because it seems like you don't spend a lot of time together already). ",
            "tell them you're not a city boy  \nthat living in new york was a lonely world.  \nSo you took the midnight train  \nGoing anywhere  \n",
            "First off, living in the city is not for everyone. Especially for someone who can't handle a lot of commotion and craziness and what seems like chaos. From what I've heard of about autism, these are things that typically those who have it don't enjoy.\n\nSecondly, I'm a suburban boy and I would love to move out to like Montana and a small town, with a decent internet speed of course. What you described sounds amazing, and quite lovely.\n\nAs for your family and the question at hand, is it selfish? No. No more than that of a 18 year old going off from nyc to his dream college in California and start a life out there after he graduates. It's your life out there, live it. I see my dad's family once a year,  people can't expect others to have their family revolve their lives around them.",
            "Hey dude, my uncle is essentially Grizzly Adams. The man is happiest with a hammock and a dog alone on a mountain. He tried the social thing and ended up addicted to booze and herion. \n\nIf you're happiest where you are right now then that's just something that they need to accept. It can be hard for other people to understand it, maybe try inviting them over a few at a time for visits? Take them on your route and let them observe you interacting with the locals. What they need to see is that this way of life works best for you and that this is how you're happiest. ",
            "This is your life. Live it the way you need to so that you are happy, content, and fulfilled. You're not being selfish, they are. They want you to sacrifice your happiness for theirs. Not that great of a family in my opinion. Keep doing you OP and live your dream!",
            "It's not selfish, imo they're the ones being selfish for being upset because an adult made a decision. \n\nI wouldn't move back just becasuse they want it, see what's best for you, you can still visit them and vice versa. Also, i envy you.",
            "If you're happy with your life as it is, you're not hurting anyone directly with your actions then I don't see anything wrong at all.\nI'd go as far to say that you're living a life many people living in crowded and busy cities would be incredibly jealous of.\nI think it is probably more down to your family wanting to see you and spend time with you, also probably their own ideas about what \"happy\" and \"normal\" are. What is right for them may not be right for you.\n\nI think you seem to have a pretty good handle on what you want, keep on living the dream.",
            "It sounds like you got it all figured out, so why would you wreck that? Some people like the bustling of the city, some people like the calm of the village. There's nothing wrong one way or another. I have an uncle who is single (early 50's) and lives in a small village. Of course he might be putting up a facade but during family meetings he always seems the most energetic, not weary of life at all. I don't think everyone in the family looks at him favorably but he's a good person with a big heart (always helping people) and he's chosen a life of quiet reflection which I respect. I think it actually takes guts to go against what is expected of you and it's not the \"easy way\" at all.\n\n\nI don't think you're selfish. You're who you are and whatever makes you comfortable and happy in this life without harming others should be what guides you. However, they are selfish if they want you to give up your happiness just so they can feel like they have a \"normal\" son. If they would prefer fake social norms over real happiness then they need to do some soul searching.",
            "You said it yourself \"it's the best decision I ever made\". That's you're answer. Stay where you're at, it's your life. Sucks the rest of your family can't see it that way, but they love you and should understand. ",
            "I don't think you're selfish. And if you aren't lonely, and you have enough money to live 30 years the way you are, then that's fantastic.",
            "Dude Op, I wish I could do the same thing as you. I'm tired of living around people. I could never fit in either. Living by yourself while playing video games and working at home sounds like heaven! ",
            "[deleted]",
            "Our society mistakenly thinks being alone = lonely. ",
            "You are not selfish, as others have said.\n\nThough, if they're the ones who always come to you, maybe it's time that you pay them a visit home. Even if it's just for a few days a couple times a year, I think they would really appreciate it. If you're already doing that, and it hasn't helped, then you need to tell them to drop the issue.",
            "I do not think you are selfish, and I think you're right, they want what is best for you, *they just aren't right about what is best for you.* To me it sounds like your family is coming at this from a place of love and concern...but as others have said, they are wrong. If you are happy with your life of semi-seclusion, then there isn't a compelling reason to move back to a city of over 8 million people.\n\nI think your best bet is to find out what their motivation is and then address those reasons as best you can by having a direct conversation about this issue with your parents (I assume most of the pressure is coming from them).\n\n>my parents are calling me selfish for not even trying.\n\nI think you should counter that it feels selfish to you that others want you to conform to what they think a \"normal\" life is, even though it isn't the kind of life you want or enjoy. Reiterate that you chose the kind of life you are currently living because you thought it would make you happy - and it has. Can they tell you *why* they think you should be living a different life? It sounds like it isn't simply that your life isn't \"normal\" and they think it should be. They said they miss you. Are there things you can do to help them feel more connected to you *that are still within your comfort zone?* If you are willing to \"compromise\" with them to become more connected you should think about what you are and are not willing to do ahead of time.\n\nHere are some suggestions:\n\n\n* Social media: do you have a social media account such as Facebook that you (actually) use to stay connected? If not, would you feel comfortable doing so? I'm not talking daily selfies with your lattes, but maybe every once in a while post about how awesome your tomato harvest was or \"wow, that was a crazy snowstorm\" and also use it to \"like\" the crap your family posts. You can use the facebook chat feature to have conversations with family members.\n\n* You say you have lots of online friends. You have to be connecting with your friends over something - do any of your family members also have an interest in those things? For example, if you play a particular online game, do any of your other family members also play or could you could get them interested? I think it could even work if the person you got to join you wasn't one of the people bugging you about being too far away, such as a niece or nephew.\n\n* Do you go back to NYC to visit family? What if you had scheduled visits? Twice a year you return home for a week or a long weekend or whatever (Christmas and some other time, maybe?) Having the visits scheduled in advance might help your parents feel better.\n\n* Family trips: if your family has a habit of going on vacations together, do you ever join them? Could you?\n\n* You said one of your sisters comes to visit a bunch. I know you like seclusion you obviously don't want to turn your place into the family hotel or vacation spot, but perhaps others are waiting for an invitation to go visit.\n\n* Piggy-backing on the above - if you were willing to have family come visit more often but the idea of everyone all up in your space feels overwhelming, could you make an addition of a guest room onto your house? It sounds like you have the land and the means to do so.\n\n* The very last suggestion I have is the most extreme, but I'm going to throw it out there anyway: would you be willing to live closer to your family? I'm not talking about finding a house in the NYC suburbs, but is there a place that you could move to that would make things easier to bridge the physical distance? For example, a place that still meets your specifications for being rural, being in the climate you prefer, etc... but is perhaps closer to an airport so they can easily visit? Or even moving geographically closer so they can more easily drive to you? I understand that is a very extreme compromise that would require you to uproot the life you are very satisfied with and could also be expensive, but it was a thought.\n\n\nI'm not suggesting you do all or even most of the above, I think that would be too much and would make you unhappy. But if you would feel comfortable with any of the suggestions you might want to offer those up as a \"compromise.\"",
            "I'm a you do you sort of person so I say power to ya.  Is there a possibility that they're worried about something else?  Are you a physically healthy person?  700 lbs stuck in a bed? Too quacked out on cocaine to deal with people?  As your post sits, I think you're all good, so I'm wondering if the family isn't worried about something they don't want to bring up.",
            "You do you.   Its not selfish to be happy.   You're still communicating, theyre welcome to come see you on your terms, or you're welcome to do short visits back to new york to visit, but you're an adult.  You live where you want, and do what you want, and are happy doing it.",
            ">I can't do those things.\n\nYou can but you don't *want* to. And that's a perfectly good reason.\n\n\n>selfish\n\nThey're telling you to live your life on THEIR terms, while calling you selfish? That's rich.\n\n\nYou like your life. You're happy with it. You're not a drain on their finances. ",
            "It seems to me you do fit in an environment that is comfortable and healthy for you.\n\nYou seem to be self-aware and engaged with humanity in ways that seem good for your well-being and health.\n\nYou just keep on keeping on. You seem to be doing fine at this point.\n\nIf - one day - you get upset, angry or sad about your lifestyle - that will be the day you can seek some counseling or move to a more active environment.\n\nI wish you all the best with your chosen lifestyle! You take care! :)\n\n\n*Nana internet hug*",
            "Your life sounds awesome. Keep on keeping on.",
            "Your family says it is selfish because they miss you. Which maybe yes, is a tiny bit of selfishness. But you have carefully thought through your choice of moving away, you said you cannot be happy in NYC, and you are happy here. So in order to live a life that makes you happy you need to have your family miss you a little. I think it is an acceptable tradeoff, especially considering they can come visit anytime.  ",
            "I mean, everyone's at least a bit selfish (except for say...the most altruistic of people who devote their lives to charity). But that's because we all need to live our lives balancing what's best for us to be happy and what makes the people that we care about happy. \n  \nIt sounds like you're not doing anything egregiously wrong here. You are happier living where you are and I think that you'll make yourself miserable moving back to NYC. People here like to say \"don't light yourself on fire to keep someone else warm,\" and that applies in this circumstance. Be polite, but firm with your parents. \n  \nThat being said, perhaps you could compromise a bit more by making a few more trips back to NYC. It sounds like they really love you and do miss you. Maybe you could plan to stay out in New York for a week or so every few months, or come up for a weekend once a month to see your family. Or, if you have hosting capabilities, invite them out a little more often. Showing that you're making an effort to be more involved in them will probably go a long ways. ",
            "There's nothing wrong with you or your choice to live your life the way that is right for you. It would be a different story if you were unhappy living away from people. I understand living away from people. I live away from people, but ive always been happy alone. Ive never felt the need to be with people or have an SO. So, since I don't have that need, the only people that I keep in my life are people who I fit with. I have a low tolerance for peoples inane bs. I can get along with anyone and am outgoing but I'd rather have quality socializing than quantity. Something I try to explain to my doctor(I'm bipolar and do counseling with him) is that when I have my head on straight I feel incredibly socialized just from working outside with my hands around my dogs, cats, chickens, the outdoors. Spending time with a bunch of people won't make me feel more socialized. It can wear me out and then my next day is wasted. When my head is out of whack, socializing definitely doesn't make me feel better. I could be in a room of people I get along great with and I won't be connected with anyone, I'll feel lonely, that's a waste. If I go work outdoors though I can feel connected. Anyways, I'm rambling but when you don't fit the social 'norm' ,and you have no problem with that, it won't make you a bit happy to force yourself to fit it. That's other peoples expectations and they have nothing to do with your happiness, even if they mean well. People don't often understand thought processes different from their own or what is 'polite' ,and it makes them uncomfortable. It's selfish for others to impose their guidelines on another person.  It's just a way for people to validate their choices. I don't mean to say that your family is purposely doing that. It just happens to be a common cycle of behavior in society that happens all the time. People equate being alone to be lonely. They are totally different concepts. Just because there's one doesn't mean it's followed by the other.",
            "As a New Yorker - you are living the dream! ",
            "You don't need to go and start a family. You might find someone you click with, who shares your values, and maybe that's your future, but it doesn't have to be. You get to decide. If you're happy/content and healthy, then live your life. You sound confident and strong. Just keep with that.",
            "Yeah. You can stop being you and go live nearby and then they'll miss you even more.",
            "Maybe go to visit the occasionally? ",
            "Invite them to visit you. Hold fast.",
            "Dude i want you to know, you're living my dream. Im currently studing in the IT field and i honestly haven't tried my hand at programming so sadly i dont think i will be able to follow your route anytime soon, but low living costs, a house to myself, and an internet connection is really all my ambition is willing to strive for. \n\nI grew up and am still living in the San Francisco/ Bay Area region and have 0 desire to live here when i move out. Nothing about it appeals to me except quick easy access to great seafood, but i dont have to be in a big city for that. I hate going into the City a sentiment im sure we share but even the suburbs are a hassle. There is a certain degree of convince of services sure, but amazon gets better every year and there will come a point where couriers will be competitive with if not cheaper than personal transportation costs.\n\nYou do you man, it sounds like you're living the dream to me",
            "Do you want a family at all? If not then you really have no reason to leave your little island. ",
            "How often do they visit you? \nI would be really sad if I never saw my son or brother, but I wouldn't ask for an introvert to move back to one of the biggest cities in the world!\nCan you schedule for family reunion time at your place? Maybe once a summer you host them all for a week, and once in a while for a holiday like thanksgiving. ",
            "I don't think you are selfish, I think you are smart. So many people go years and years doing what other's think they should do. You figured out what is the best for you. They may just not understand how you can be happy living away from people. I suggest trying to help them understand that it's what makes you happy and that you would love having them visit. Maybe you could go visit them here and there. But I would not move back to NYC if it makes you unhappy. period. ",
            "It sounds like you're family is trying to guilt trip you. But to make it simple if where you are is where your the happiest then that's where you should be. Also you don't need to move back to have a wife and kids and do the whole family thing, I'm pretty sure you can do that anywhere. I'd explain to them how you felt living there and how you feel in your new home and hopefully they will understand that living there is better for you. ",
            "I don't necessarily think this situation is unique to you personally.  I think that most families who have a loved/wanted member move away get sad and miss that person.  It's pretty natural for them to want you to come back.  \n\nYou're certainly not selfish for doing your own thing, in fact that's quite healthy.  My advice would be to keep doing what you're doing:  live off by yourself, cordially keep them in your life with the insistence your not coming back and just live.  Try not to let this stress you out, You seem to be doing ok OP. ;)",
            "Left NYC 2 years ago to somewhere less crowded, but still populated. I wonder if I really just wanted to be around fewer people all along. I like how I don't really see many people aside from work or stores, so I mostly only interact with people I like. Going back to NYC because of family and because I feel like I'll miss out being away forever, but maybe I'll leave to somewhere more secluded eventually.",
            "I also want to hop on the envy train here and say you are living my dream. ",
            "Whenever one of them starts guilt tripping you, immediately hang up and turn your phone off for an hour or two.",
            "You sound really happy with your life. That's a pretty rare thing. Personally, I would advise that you not give that up. Perhaps you could have a deeper discussion with your family about it.",
            "My dad once told me to \"live on [my] own terms.\"  \n  \nSounds like you're doing just that.",
            "It's ok to be \"selfish\" like this. But it's not ok for them to be selfish - the real problem here - in asking you to give up your happiness for them, even if it may be understandable that they'd like you closer. They're not always going to be around. But you will always have to live with you.",
            "Your family are the selfish ones here.  They want you back because they miss you, not because they think you'd be happy in NYC.  It's all about their wants, not your happiness.  You're happy where you are, and you weren't happy in NYC.  To me, this is a no-brainer.  Stay where you are. \n\nI see that your sister visits you.  Does anybody else?  Have they always tried to make you feel guilty about things?",
            "That sounds like a dream scenario to me. Your family is being selfish to want you to do something that you are uncomfortable with. Live your dream. ",
            "Forever alone...but happy?",
            "I think it's entirely your own choice. You walk your path and they walk their and it's important that they understand that. Tell them that visiting is fine, but make it clear that you are a lot more content with your current lifestyle. Them not accepting your choices will put a strain even on a good relationship. Atleast try and discuss it with them.",
            "I just want to add that even if you got married, had kids, etc. your family would still probably baulk at your choices unless they fit their mold. If you cross that path, you could find someone very similar, who wants seclusion and to live outside of social norms; kids or no kids, doesn't \nmatter. But I worry your family would wonder what's wrong still. They would want access and not understand. You need to let them know this is by choice. ",
            "As a person who tends to thrive in social environments, I can understand why you would want isolation. There are many dynamics to social interaction which I can understand the urge to be away from.\n\nIt may be autism on your end, but that's irrelevant if you're happy. It sounds like you've had plenty of time to learn skills that make you a strong and reliable person. Building a house, software engineering and whatever else you do are both lucrative opportunities, so I can understand your family wanting you to have kids. You sound like you could support them financially.\n\nThat aside, more often the not, even capable people are unable to utilize their skills because they are miserable in life. That's something that stems from people who aren't capable or interested in family life having kids.\nIt may well be a very unselfish thing to not have a family if you aren't interested. \nFamily life is pushed on people from a young age socially despite the fact that the world is overpopulated and filled with leechers anyway. There's nothing selfish about not wanting to add water to an overflowing pot.\n\nHaving said that,  I'm not here to defend you from your family. I'm merely pointing out the fact that if you're happy, you have no reason to allow others to inflict their misery on you, which is what they're doing whether they mean to or not. Most parents don't seem to understand this, but when they want their children to live a specific style of life, they are projecting their wants onto those kids. A good parent would allow their kid to grow in their own direction and help when necessary instead of trying to direct their life, though often that's not what happens. \n\nDon't let them get to you. It's your life, do what makes you happy and understand that even if they don't like it, they aren't the ones who will have to live with the decisions they want you to make, you are. It's simple really. Just keep yourself as your priority.\nIf I were you I'd get them to explain why you not having kids is selfish in their minds and see what they say. Chances are they haven't considered it. That, or they want grandkids or something. But I mean, that would be pretty selfish of them, huh? Haha.",
            " * The vast majority of people need and want to be around other people. To be happy, they need friends, family, a spouse, children.\n * There are people that live solitary lives by necessity. They aren't happy, and wish they had people, but for one reason or another can't.\n * Finally, there is a small group that lives a solitary life and is happy that way.\n\nYour family may think you are in the second group, so encouraging you to be more social is in your best interest.\n\nIf you are sure you are in the third group, you can tell them that. But it won't be easy, because people in the second claim to be in the third, often even unaware of it themselves (i.e., they live solitary lives because they've given up, but if they did get a chance at a social life, they'd be much happier).",
            "You're not selfish. You're a grown man making decisions for yourself. They must learn to respect your own decisions for your own life.",
            "Your life, you live it the way you want.",
            "Living a life that makes you feel content is not selfish. You have achieved something remarkable, which a lot of people never manage to achieve. Find your own way to explain to your family that you living a content life is valuable and they should frankly be happy for you, even if they do miss you which is also okay, and that they really need to consider what they are saying when they try to guilt you away from a good life (namely, that they are being selfish in this instance rather than you).",
            "That would be hard for a family to not take personally. No one's bringing this side up, but your folks probably tried to give you a good life, and in their eyes, you ultimately rejected it. Live the life that makes you happy, but maybe make an effort to see your family more often - on their turf. You say your sister visits you a bunch - why not return the favor? (maybe you already do this.)  Another thought; you say you've saved a bunch of money. If your folks are reluctant to visit, why not offer to pay? Family means different things to different people, but I think you're just missed.",
            "Good for you! It's great to find what makes you happy.  \n\nPeople who can't understand that different things make you happy are the ones who are wrong and selfish.  \n\nTell them you're not interested, and that topic is no longer up for discussion, and you hope you can continue to have a good relationship, but if they refuse to stop pressing that issue, you're not going to want to talk to them any more either.  \n\nIt is not remotely selfish to live the life that works for you.  ",
            "I'm jealous of you.  Can I be you?",
            "Is let them know you're happier there than you would be in the city, you appreciate the type of life you have right now more and love the relaxing environment you're in. You're not selfish for wanting to live your life in a certain way (within the law), and there's no reason you should feel that way, you've done nothing wrong ",
            "Dude if you are happy,  stay where you are doing  what you are doing.  \nAll you can do is try to make your family understand that if you move back to NYC to appease them,  you will be the miserable one. \n\nThat being  said,  maybe you  could make an effort to visit a little more? \nMaybe that will help your parents cope with you being  gone.  ",
            "Let them know you aren't the next Unabomber.  You just like open space and peace and quiet.",
            "You know what?  If you are happy, that's all that matters.  You cannot live your life for anyone but yourself.  I congratulate you on making the decision to move out of NYC and giving yourself a good life.",
            "The type of lifestyle you live is not typical and can be hard for others to understand. Myself personally, I would go nuts. It would make me, and a lot of others, feel pretty lonely. This doesn't mean that it's wrong for you to thoroughly enjoy that lifestyle, though.\n\nI'm guessing what it is, is that not only do they miss you, but they worry about you and hope you're okay. To them, living in New York it's probably impossible to understand how someone could like living away from anything like that. Your parents *chose* to live in New York, now they just need to understand that you chose to live where you do.\n\nNext time they ask tell them how happy you are where you live. You don't need to defend yourself, just tell them that you are happy. If they start calling you selfish you shouldn't feel bad. It's hypocritical because they are the ones being selfish, expecting you to live with them just because they want you to.",
            "Life is far too short to worry about what other people think…",
            "Long answer: no go to be unhappy\n\nBut visit them more often. ",
            "Channel your inner Ron Swanson. \n\nYou'll know your gut to be right.",
            ">First, do you think I'm selfish?\n\nYes, as you should be... I can't stand when people act like doing what you know is best for you is sooo awful. You're happy and you aren't hurting anyone, what's the problem? They can fuck off.",
            "i applaud you, just keep doing what you are doing if it makes you happy, your family will understand, it seems that your sister already has, they will also come around for sure",
            "Do what makes you happy.",
            "I am very much a loner, though not to the extent you are. I was actually able to form a romantic relationship with someone who respects my need for space, for example. But I definitely understand where you're coming from: I work from home as a developer and it has dramatically increased my happiness. But before that I was so depressed, so I did a lot of research on the subject, and here is what I know:\n\nSometimes it's hard for people to understand the desire to be alone. They might think there's something wrong with you and that you need help, even though you've actually found a way to be comfortable and live life. The avoidance of socialization (sometimes called \"asociality\") is usually associated with a few psychological disorders, but not always. Autism is one of them... but that does not mean that you are \"broken\" or \"wrong\" even if you are autistic. The important part is whether or not you have anxiety/fear; anxiety indicates a disorder that might need treatment. But there are some rare people who just don't want or need much interaction with others. Educating your family a little on asociality could help a lot!\n\nOn the other hand, the \"selfish\" statement implies some cultural beliefs about family... Are you the only boy (or worse: the only child)? Do your parents feel you have a duty to continue the family line? That can complicate things with your family, and there is no easy way to deal with that. You will either have to take a few chances on things you might not like, or lay down the law and tell your family that it's not going to happen. Try to be gentle... if your parents are expecting grandchildren it will not be easy on them. Do your best, even though the pressure and tears from them are probably part of the reason you did what you did in the first place. Try to remember that it's very hard for others to understand you because you are so different from them.\n\nIf you need to talk about this let me know. Like I said, I'm not in as deep as you, but maybe that's not necessarily a bad thing: I know how to cross the line into the world of extroverts and come back alive!",
            "if it makes you feel any better, i'm not isolated or a hermit and my parents constantly pester me to move back close to home. maybe it's not necessarily about your lifestyle and more about them missing you.",
            "Read \"Party of One: The Loner's Manifesto.\" I'm an introvert, and I laughed all the way through it. It might leave you feeling not so different. There are others like you. You have community because you are online. Be open to luck and possibly meeting another introvert who understands your boundaries. Be firm and assertive with your family. Enjoy visits from people who get you.",
            "We, as human beings, weren't meant to live completely alone, and yet you're not completely alone. You have a level of human interaction that feels comfortable to you. On the other hand, your family loves you and wants to be with you, and they want what *they* feel is best for you. The problem is that YOU already know what's best for you.\n\nLet them know you appreciate that they mean well but they need to stop trying to guilt you into doing what they want. Don't feel guilty. Of course you're going to do what you want. It's your life! Be \"selfish\" and don't go anywhere you don't want to be.\n\nBtw, if you asked them to move closer to you, would they consider themselves selfish for not wanting to move? Would they consider you selfish for asking such a thing? Food for thought!",
            "Good for you for finding your own way :-)",
            "Nobody but you can decide what is right for you, and you are the only person who can know what is exactly right to make you happy throughout your life. \n\nMaybe use your financial comfort to fly your family out when they're missing you, and show them your way of life and happiness.",
            "They probably just need reassurance and reminding that you are happy just the way you are. Maybe explain in a way that would help them understand- encourage them to move out to the countryside and build their own house and live in seclusion, and ask them if they would be happy doing that. Try to explain that they're just very different lifestyle choices that belong to two very different types of people. <3",
            "I wouldn't give in to their demands if i were you. \n\nYou could, however, consider buying a house in NY near the city. It'll bring you closer to family, but not necissarily in the city.",
            "Nawh, I understand how you feel. \nIf it doesn't bother you being alone, then it's okay to be alone.\nThat doesn't make you lonely. I also understand that your family misses you and they are viewing how you might feel in their own perspective. You are not selfish at all, I don't see you bothering anyone or forcing someone to live the way you do. \n\nI think it's best to calmly explain to them that you need a stress free life from town. Or that you need some peace and quiet while programming . You can also to visit them once in a while. Maybe that'll keep them at ease seeing you well in person. ",
            "Fuck that noise,  if your happy living in the middle of nowhere then keep on living there. Their problem not yours. ",
            "This life sounds very appealing...I'm currently in socal and am constantly depressed over cost of living. ",
            "You are living my dream life! \nIt would be ridiculous to give up what you've created and built for yourself just to please your family. Like others said, they can visit and there is skype.\n\n\nCompared to NYC, I live in small town (~300,000 population) and I find it crazy busy and stressful!",
            "I don't know if selfish is the right word to describe your parents, but \"unreasonable\" definitely is.  It is unreasonable to expect someone who prefers solitude to move to NYC, of all places. And it is unreasonable to expect someone who is well-settled and happy to pick up and move to another place for no other reason than to keep other people company.  \n\nI don't live in the perfect solitude that you do, but I am very socially isolated.  I have no SO, no children, no close friends.  And while I stay in contact with family through texts and emails, I live far away from them physically and emotionally--which is how I prefer it.  If I lived closer, I know I'd be constantly turning down invitations to parties and \"hanging out\".  I love my family, but only from afar and in small superficial doses.\n\nI think they finally get it, but I know it makes me the black sheep in the family. \n\nBut over the past few years, I have tried to be less mysterious because I realized that my aloofness was pissing them off.  When I get a text or email or voicemail, I try to respond quickly and not leave people hanging.   I make an effort to fly down for someone's milestone birthday or graduation party.  I have gotten a tiny bit better with opening my doors to traveling family, as long as they give me ample notice.  I do what I can, in other words, so that I don't feel so guilty when I must say \"No.\"  \n\nIf my parents tried to guilt me into moving back to my hometown because they missed me, I'd make it very clear to them that it wasn't going to happen.   This bluntness would probably piss them off, but it would make me feel a lot worse to do something as crazy as that.",
            "Not selfish. So good to find your happy place.",
            "Honestly... Why do we feel the need to \"fix\" introversion? I see teachers trying to do that to my three-year-old son and it drives me nuts.",
            ">my parents are calling me selfish for not even trying\n\nYour parents don't get to choose how you enjoy your life.",
            "I think you've made a healthy choice for your life.  I respect making that decision and I hope you can pull your family to respect that as well!",
            "> They want me to come back living in NYC, they say I should get out of my solitary life and start a family for myself. I can't do those things.\n\nYou can still marry, etc if you wanted to. A friend of mine has a husband who lives by himself in the country and she lives with friends in the city. They have 2 adult children and she visits her husband once a month,  but call each other at least once a week. It works out well for them.",
            "I'll second what someone else said and suggest you write down your thoughts to your family because you are really good with words.  Just be firm and reassure them that it's your life and you're happy with it; as long as you're not harming yourself or others, your life choices are yours, and nobody else's concern.\n\nIf you have the means to visit them a little more often, it might be good for you and them, because it doesn't sound like your relationship with them is strained, per se.\n\nI know the feeling somewhat.  I'm reasonably close to my parents and sister, and have 1-2 close friends ... But people just exhaust me.  I've found over the years that I'm just too introverted for some people, and they don't know how to react to that.  I used to get upset with myself about it, but no longer.  I'm a good person who treats others with respect, as I'm sure you are.  As long as you are those things, other people's judgments of you are irrelevant and not worth your time.",
            "You've decided to live a different life than your family. You've chosen a lifestyle they don't understand, especially when dealing with new yorkers. I am from St. Lawrence county. I don't know if you've been up that way ever, but it's quite isolated and probably not too far from where you're living as far as a type of lifestyle is concerned. I have quite a few friends in nyc and my fiancée is a new yorker, what I've found after meeting a bunch of new yorkers, epsecially if they were born there and never left; have a really difficult time understanding why someone would want to live anywhere else. I've told plenty of folks from nyc i prefer more rural places and I've gotten looks that border on disgust. A lot of them just don't get why people like to live away from major cities and huge populations.\n\nUnlike you, i consider myself a people person, but i also need my space. I am the type of person who will talk to a stranger like we've met before, but when i don't want to be around people or I've hit that \"saturation point\" i become a miserable fucking asshole. It just becomes, too much. I look for places to get away, i become quiet, if people push me i become agitated and aggressive. I simply want to be left alone.\n\nI live in the SF bay area now and i hate it. The place sucks. It's full of people the cost of living is ridiculous and i bust my ass for what actually amounts to peanuts in this area. No one talks about anything other than their work and everyone is juat looking to find that golden opportunity in someone esle. If it weren't for the sweet job my fiancée got, I wouldn't be caught dead in the area. That's how i feel about it, and i fucking LIKE people. I like meeting interesting folks, sharing a drink or two with strangers and generally being around friendly people.\n\nMy point to this rambling is, don't go back to nyc and try to force yourself into a mould you know you cannot happily fit in. You are being selfish, i guess, but it's your life you're allowed to be selfish and uncompromising abour things that are really important to you. If you don't think you'll survive in nyc and have a healthy, rewarding life that you want to live, then don't move back there.\n\nWhat you probably can do is meet them halfway. You should probably visit more often if that's something you don't do much, they should visit you, too for that matter. Your parents do clearly love you and care about you. To them, people from nyc who are literally no more than a few feet away from perfect strangers all the time, a guy who decides to go out and live in the woods must have something wrong with him. People like you and i on the other hand think it's perfectly normal to want your space, privacy and god forbid honest to goodness quiet. \n\nDon't feel guilty about living your life the way that is of value to you. Now you may want to date around someday. Having a companion you connect with and love is worth it, but if you're not interested now that's fine. If you're not interested ever, that's also fine. You don't owe your parents any grandkids. Also, don't isolate yourself entirely simply because you haven't had too many friends in the past. It is good to have someone to talk with, share a beer with and sometimes just sit in silence together. True friends don't need to fill the silence. You may have that with your sister though. It sounds like the two of you have a healthy relationship and she spends a decent amount of time visiting. \nRemember that your family may be putting pressure on her too, to try and convince you to come home, which isn't fair to her if she just wants to see her older brother.\n\nI get the isolated living, i really do, i miss it. I miss not having anyone around that i don't want around and i miss knowing that i can go to my family plot of land in the Adirondacks and know that i am the only person for miles. That kind of existence recharges me. Gives me space and a place to think, a place to do my own thing. If that's what you're comfortable with and truly love, then don't compromise that, even for family. It's better that they see you happy 4-6 times a year rather than every weekend, dating a woman you don't care enough about to really be with and looking like shit every weekend because your psychological needs are so far from being met. There is some compromises to be made though. You've got to visit your parents more. They miss you and if the only bad blood between you and your family is that they wished you were around more, well you're pretty lucky to have parents thaf miss you like that. \n\nGood luck man, I'm a bit jealous of your living situation. It sounds like you have at least got that figured out.",
            "> First, do you think I'm selfish?\n\nIt's not selfish to live your life how you want, as long as it's not harming others. The second bit is the bit that's up for debate to some degree. \n\nA utilitarian approach would be to figure out how much you'd hate going back to NYC, and tally up the small amounts of dissatisfaction that your family has for you not being around. You'd also have to subtract off any dissatisfaction from them feeling like they've pushed you into coming back. ",
            "I don't think you're being selfish at all, but let me play devils advocate.  Being alone is great for you and might be forever.  Right now it is a choice, if you're distant for too long, your relationships could suffer, your aloneness might one day turn to loneliness and when that happens being alone might no longer be as much of a choice.\n\nSo going forward, it is important to balance your desired lifestyle with your long term relationships.",
            "You know the answer to this. It's just hard to deal with. You must live to make yourself happy or else you're simply wasting your life. ",
            "I don't think you're selfish. You've carved out a life that works for you, in a place that works for you. If you don't have any interest in living in the city, or dating, or having a family that's all perfectly okay.\n\nThe next time someone brings it up, tell them that you are not lonely, and in fact, are quite happy with your life. Remind them that you're not comfortable in social situations, and that you find your solitude soothing and relaxing. Then, tell them you don't want to discuss it again. If you ever change your mind, and want to move closer to your family, you'll let them know, but for now you're quite content with your life.",
            "Honestly you worded it perfectly here! It's hard for me to verbally express my feelings as well. What I would do is show them this that you posted, or write them this exact thing. It is well written and gets your feelings across in an understandable and nice way ",
            "The box of normality will be abject hell.  Live your joy.",
            "There's a difference between being alone and lonely. You sound awesome and your life sounds so beautiful and idyllic. You're not selfish, you know what's best for you. Keep on trucking.",
            "It is not selfish at all, it's selfish when others try to control someone else's life & try to make decisions for their happiness. I would love to move away from people, but my family is just the same & my bf's family is also that way. It gets miserable when you don't get to do things that make you happy because of others.",
            "I see this much like the you're a woman you should have kids! bit.  For me for that it was a constant refrain of \"I've got a cat!\"... like that really made any sense as a response but I just played it like it totally made sense.  When my husband and I were dating (nearing 40) it became even worse, so it was \"but we already have a cat\"... like that made sense, eventually they stopped.  Cause now I'm old enough where carrying a child is high risk and I figure they don't want to bring it up any more.\n\nAs someone who others feel I \"randomly moved to\" (and I wasn't even isolated, I just didn't know anyone, it's a decent sized college town I moved to) you just keep having to stand up for you and what matters to you.  You, you just want to live the life you love and enjoy.  \"I'm really happy with my life!\".  \"I miss you too, but I really love it here and I don't plan to move back.\"  and if you feel it \"I'd love to see you, can you visit soon?\"... or maybe you can visit.\n\nTheoretically it's selfish of you to live your life cause you're thinking of you, but isn't that what parents are supposed to do, raise their kids to live their own life?  Isn't that what you're doing?  No, I DO NOT think you're selfish.  The chances of me moving back to a big city are \"haha are you kidding\" and \"oh hell no, been there done that, not for me\".\n\nPeople getting upset because you're doing you and succeeding does NOT equal you did something wrong.  My mom would love it if I was all girly and loved the girly things she loves but it's not ever happening... cause that's not me.  Sure, I still don't really \"connect\" with her, but I love her and just smile and nod a lot.\n",
            "A lot of people, I'd say almost all, derive a really important contentedness from their relationships with other people. Especially their partners and kids. It probably appears to your family that you are missing out on something special. But if you're ok then you need to have a talk with your family. \n\nLet your family know that you trust them, you trust that they love you and they want what's best. Let them know you would like that trust returned and assure them that should you end up unhappy you know you can turn to them for help. Until that happens, ask them to understand you've found a precious peace, you have that contentment within yourself and it hurts when your loved ones can't accept it. \n\nAlso, they may feel less worried if you had some sort of emergency contact plan that you shared with them. If any of my kids lived your lifestyle my biggest worry would that they'd get hurt or sick and no one would know. Carbon monoxide, choking, an injury are valid concerns.  Perhaps if they knew you had a local contact that could call them or vice versa should something happen it may give them a little peace of mind.  You might think of is as a little system redundancy. \n\nHow many days would pass before you were missed? If you were found unresponsive how would your family be contacted?  Do you have a CO detector and a fire extinguisher? As a mom, I'd be much more at ease if my kids took that kind of proactive approach and shared it with me. \n\nIt sounds like you have a nice thing going where you live. You also did a really nice job explaining your feelings to a bunch of strangers. I'm sure your family is incredibly proud of you, and they will worry no matter what but you can probably alleviate some of it if you're so inclined. ",
            "First of all, you are not selfish for living your life the way you want, they are selfish for wanting you to conpletely change your life to something less comfortable to you. \n\nTo be fair to them, you didn't mention any red flags that makes me think they're doing this deliberately. Your lifestyle could be considered really depressing to an extroverted outsider, so this does seem like misplaced concern. Do they know about your online friends? Because i was a little worried until you mentioned them, as longterm isolation is a huge risk factor for pretty much any mental illness. \n\nDo you find this lifestyle has worsened your social skills? Lack of use could make these skills deteriorate, but I could also see them inproving due to isolation because you're not constantly expending this energy and have a \"safe space\" to retreat to when the socialization is overwhelming.\n\nIn the end, if this is what happiness looks like for you, try to get your family to see that. Your parents may have trouble understanding this especially,  but as long as they don't harass you about it you can just remind them it's your life and you are happy.",
            "They are being selfish, not you OP! If your happy now why change things?",
            "You get to be selfish. It's ok to create the life you want to live. As long as you're not hurting anyone or depriving them of the life they want to live, you have no one to apologize to.\n\nI am feeling similarly, along with my partner. I'm not on the spectrum, but he suspects he is. We are both introverts on top of it and are getting ready to move somewhere pretty remote. Four hours from the nearest city, and we couldn't be happier. \n\nMost of our family has been supportive, but one doesn't get it. And that's ok. Another one complained about how inconvenient it will be to visit us and our eyes just twinkled and we said \"Oh, that's TERRIBLE!\" :-P\n\nYou get to decide how you want to live this one life you get. I sincerely hope you're enjoying the solitude as much as we plan to! \n\n\n\n",
            "You seem pretty eloquent through text -- maybe you should write your feelings out? :)\n\nalso, good on you for figuring out WHAT you need, and acting on it :)",
            "Honestly? It sounds like you're living the dream and they're incredibly jealous. Clearly your family believes that the way you're living is pleasant, or else they wouldn't consider it indulgent. They wish they could live like you. I'm from Texas and have only been to NYC once, but I'd think that if you grew up there you'd learn that being crowded, never alone, and paying a ton for your own space is just what you have to put up with to be an adult. That's normal for them. They have to put up with the downsides of living in a huge city, and they're probably unconsciously angry that you've found a way around all of it. \n\nYou do you, visit them once a year and remember why you left, and then go back home to your fresh air and freedom.",
            "I think they're right about trying to have a family or relationship.\nThey think you might regret it later on in life and as they're family it's their duty to tell you these things. Nothing wrong with giving it a try!",
            "I agree with the other people who've said that you should stick to your guns and live your life the way you want to live it. If this lifestyle makes you happy, then go for it. \n\nMy only caveat would be that even though you are a young man still you might want to think about putting a plan in place for when you are older and might, but hopefully won't, lose your mobility and/or need extra care. I imagine as you live so frugally you would be able to save up for something that would suit your needs. \n\nAlso, it might calm your parents fears if they knew that you were in regular contact with someone such as your online friends. It might calm them to know that there is someone you speak/write to everyday who might sound the alarm if you didn't make contact. I know that this is a doomsday scenario, but I think they would like to know that you wouldn't be left for days if you slipped in the shower or became ill or something?\n\nDoes that seem reasonable?",
            "I don't think you're being selfish for living your life the way you want. But it might be nice for your family if you got an airbnb in New York a few weeks a year and visited them. If you see them more often and they realise how happy you are with your life it might make them more accepting. ",
            "They're the ones that are selfish for not allowing you to be happy living life the way you want to.\n\nIt's like when parents tell their kids they have to have children so they can have grandbabies and the kids are being selfish for not breeding.\n\nWanting someone to alter their life, or live the LifeScript^TM because that's what they want you to do, or that's what you should do, or whatever... is the one being selfish. They're selfishly looking after their wants, or their jealousy instead of being happy for you.\n\nGo visit them every now and then... and have them visit you. And if it becomes a one-way street where they never want to come to your ends... continue the relationship over the phone. Or don't... if they keep calling you names.\n\n/r/childfree, /r/justnomil, and /r/raisedbynarcissists have a lot of similar situations and advice. Maybe you'll find some parallels there.\n\nAnd I probably have more online friends (through music) than IRL. I've even met some of them IRL after talking online for years... they're no less of a friend than someone you see in person or talk to over the phone.\n\nKeep doing you. Don't move back.",
            "Aside from your family's wishes, do you have any desire to have a romantic relationship?   Your post suggests you do not.   If you actually do, then ultimately your family may be more accepting of your situation (fwiw).  If you have no interest in ever finding a partner, do you consider yourself asexual?  Or do you value your isolation more than what a companion could bring you?   I'm sorry if these questions are too invasive. ",
            "I fully support anyone living their life the way they want. If your happy where you are then absolutely stay there. I do wonder if there is more going on here then they wanting to be closer to you. Maybe they can't fanthom you being happy in your current set-up or as others have said they hope this is step 1 in getting you married/having kids.\n\nI do wonder though if a compromise can be reached. In my travels of the US once your outside of a city it becomes way less populated. Could you find a spot outside of NYC and replicate what you have created where you are now? You get to be outside of the city and keep your current set-up but your closer to your family. Perhaps find a New York subreddit and see if anyone there has any suggestions on where to live.",
            "[removed]",
            "Bulllllshit. I mean ok im glad youre happy....ish. but humans are social animals. Connections are important\n\nLive in your isolated place if you want to, but make an effor5 to connect with people who live nearby in real life. ",
            "I cant believe no one has said this (or at least I think), you are pretty much giving the two extremes. NYC is as city living as you can get, and the same with having moved away to the middle of nowhere. \n\nThere is definitely some middle ground here. There are probably hundreds of small upstate NY towns that are pretty secluded but still over easy enough access to NYC. Maybe this can be an option for you and could make both your family happy and yourself. ",
            "Have you ever considered going to a psychologist/psychiatrist to ask about your tendencies?  There's nothing wrong with wanting small town life but it is a bit troubling to not want friends in real life and only want them online. There might be something you can do with proper help to be better with people instead of just giving up. You don't need to live in NYC or have a family but having real friends in real life who aren't your family could be great. I don't doubt at all that you're happier now than you were but that doesn't mean you can't be even happier with help.",
            "I recommend four years in the military. It is a great system for people who have these issues for a few reasons. One: It is one of those contributions to / interactions with society that gets people to leave you alone pretty much for the rest of your life. It is a get out of judgement free card in a lot of ways. Two: It is a logical system in which an E-5 tells and E-4 what to do, an O-2 laughs at an O-3's jokes all the time, etc. The rules of interacting are stupidly simple for a reason. Much of the chaos of regular interactions are gone. some crave this, and it puts their careers in ruin. Some are pleased by it, and it makes them great Soldiers. Channel your Forrest Gump stereotypes, here. Three: You can enlist for the number of years you want. You can handle a three or four year commitment, and enjoy the GI bill that pays for your next degree after you get out. Four: You learn a lot about how government computer systems and contracting for them works. Five: It's a good kick in the ass for your fitness (not sure if this applies).",
            "A lot of people here are siding OP I understand that. He's an adult he can do whatever he wants etc etc.\n\nBut nevertheless it's still strange. He didn't leave the city to live in a suburb or a farm. He said he lives alone in a small village in what sounds like literally the middle of nowhere. Apparently he works from home, and he said himself he has no reason to go out since he doesn't like people.\n\nBasically I'm saying OP sounds antisocial as you could possibly be without being agoraphobic, and maybe the family is right?\n\nEdit: I was gonna try and not say this because it sounds really mean, but honestly OP sounds autistic as fuck. ",
            "What are you going to do when you get older? Or if you got sick? I bet a lot of what your family is afraid of us who is going to take care of you when you're older. Parents always want to make sure their children are going to be taken care of after they're gone.",
            "First things first, no need to move back. However, it is important to visit people occasionally. I moved halfway across the country to avoid my parents, but I still come back every 3rd Xmas or so to visit, and they come visit me every summer. Start doing the same with your family. A couple of days in the city won't kill you, and giving your family permission to come visit you might help them understand your lifestyle more.",
            "Humans are social creatures.  It may take 5, 10, or 20 years, but one day you'll regret it.\n\nYou're a software engineer, or for lack of a better term, a computer geek.  I know a lot of people like you.  Prolonged absorption in using them does shape your mind, like anything else.  I think it can encourage anti-social behavior.  I've met personally at least 3 people who were successful computer engineers but quit because they felt it was an unhealthy.\n\nI just have a sense you're going to be very unhappy one day.  You're in the middle of life, and you've spent at least 2/3 of it in school, college, and jobs.  Living in a fast paced city like NYC might not be for you, and maybe you are just tired for the moment.\n\nIn the end, it's your life.  You could be doing a lot worse.\n \n\n",
            "[deleted]",
            "[removed]",
            "[removed]",
            "Life is most interesting out of your comfort zone. Stay as you are and risk leading yourself in to a dead end life you eventually regret. People and society bring opportunity for change, your family likely just want you to understand this. Listen to them at the very least.",
            "So first off, man live your life if you live for someone else then you're going to be miserable, however, let me be the devils advocate.\n\nI'm a huge dnd nerd I just gobble it up and for years I played with the same group. Over time that group fell apart but I still wanted to play so I went out and met some new people and offered to DM for them. Now these guys were long time buddies and they were big online gamers so they had a friend who was similar to you that they had never really met in person save for I think the occasional birthday party, and he also wanted to play. The thing is we set up in a game shop which was in the city, it was crowed and full of people playing other games. So obviously their friend was apprehensive about joining us.\n\nBut for me dnd is about the social interaction, I have no idea how people enjoy playing via chat or the web so I was not down for him playing remotely. Eventually he caved and joined us. He was quite and awkward for the first bit but once he got into his own he really jumped in and became a large vocal part of the group.\n\nNow you and I are opposite human beings, in that I love people and I flourish in crowds so of course I also do stuff like stand-up and improv. So I invited my friends to a few shows and most importantly was open mic improv. Eventually our quite friend tagged along and actually fell in love with it. And more importantly fell in love with a girl at improv. Now this was some time ago and I've since moved but they're still together and he's really come out of his shell.\n\nSo while yes live how you want, maybe just get out there a bit, try new things because maybe there's a social circle out there that you haven't found yet that may change your life."
        ]
    },
    {
        "post_id": "90skfh",
        "author": "Severe_Landscape",
        "title": "UPDATE: My [23F] mom [54F] doesn't want me to apply for a job because it would involve relocation.",
        "url": "https://www.reddit.com/r/relationships/comments/90skfh/update_my_23f_mom_54f_doesnt_want_me_to_apply_for/",
        "score": 2877,
        "num_comments": 52,
        "created_utc": 1532207446.0,
        "selftext": "Previous post [here](https://www.reddit.com/r/relationships/comments/8tdev3/my_23f_mom_54f_doesnt_want_me_to_apply_for_a_job/).\n\nMy post didn't get a lot of attention, but I wanted to update the people who commented and sent me PMs.\n\nI applied for the job. I landed an interview. I got the job.\n\nI told my mom the day I got the call for the interview that I applied for it, and now I had an interview in a few days. She wasn't too pleased that I didn't tell her I applied for the job anyway, but she quickly got over it when I informed her again that I would love to get the job and if I did get it, I saw myself staying with the organization for probably the rest of my life.\n\nShe became excited for me, and the day before I left to go to the interview, she expressed how much she was proud of me for following my dreams, like she did not, and not letting anyone stop me, like she did. She wished me good luck and told me that she knew I'd do great.\n\nI start the new job in a few weeks, which will give me plenty of time to get my things together and prepare for a huge move in my life. My boss is extremely excited for me (tbh, I think she helped get me the job. I listed her as a reference, and she knows most of the people I'll be working with), and can't wait to see me succeed in this new position (conservation is a small world).\n\nThank you to those who told me to go for the job anyway, because without that push from strangers, I don't think I would have applied.\n\n**tl;dr**: I applied for a dream job with a dream company, landed an interview, and accepted the job. I start in a few weeks. My mom is excited, my boss is excited, I'm excited. I still can't believe this.\n\nEdit: Thank you everyone for the congratulations and well wishes, they are very much appreciated!!",
        "permalink": "/r/relationships/comments/90skfh/update_my_23f_mom_54f_doesnt_want_me_to_apply_for/",
        "comments": [
            "That's a great update. Many congrats on the job and good luck with the move!",
            "Great to hear your mom came to understand what a great chance this is for you and express her turnaround with encouragement. You’re very lucky. Make sure to visit her",
            "I think there's a wonderful lesson in here about growing up, and being a child, and being a mother.\n\nIt sounded like she wasn't ready to let you go, but when push came to shove, she had a growing moment and saw you for the grown up you now are. Sometimes adulthood is not given, you have to take it, even taking it from the people you love.\n\nYour relationship with your mom will never be the same as it was, when you were growing up. That relationship has morphed. What you have now, is a new relationship, between two adult women, who will grow together as adults. It's a beautiful thing.",
            "Yeah, congrats man. And what do you know. Parents are supportive when you let them see something is important",
            "Well, that de-escalated quickly. :-D\nCongratulations on your new job!!",
            "Congrats on your new job! I’m really happy for you! Enjoy your new position! I’m sure you’ll do great! Do yourself a favor and get a haircut, or paint your nails or something to feel good about yourself before your first day so you feel extra confident. That always made me feel good before starting a new job. ",
            "Congrats on the new job! I think the lesson here is that you'll be treated like an adult when you start acting like one. I had the same worries as you (I lived almost all my life with my mother) but when she understood I was determined to move out of my country she knew it was the right choice for me. I don't regret it one bit and my mother is incredibly proud of what I've accomplished.\n\nSo, enjoy your time with your mom and be ready to kick ass in your new job! I'm sure it will be very exciting and you'll learn a lot!\n\nThe best of luck!",
            "I’m so happy for this exciting update! Congratulations! My daughter and I have a similar situation; it was just us from the time she turned 1 until I met my fiancé a few months before she turned 14. We are super close and it will break my heart if she has to move far away, but if it’s to achieve her dreams I will be 100% supportive. It will be hard but I want the best for my baby; I want her to live her best life and for all her dreams to come true! It sounds like your mom feels the same way. Good luch, go out there and live your best life!!! ☺️💖🥂",
            "About 8 years ago I had a dream to come to America and pursue my dream employment while escaping a toxic relationship between my mom and me. \n\nAbout 7 years after finally going through with it (I was 20 at the time), I can say that I married my soulmate, own a beautiful home and am in a stable emotional state while keeping my mom further than an arms length. Honestly I get along better with her now, since she values my time with her now more than before. \n\nI guess what I am trying to say that focus on your excitement (which I can hear from your post). When you do eventually start having doubts when you encounter bumps in the road, keep your course. Second guessing yourself won’t change reality and will only deter you from reaching your ultimate potential. \n\nGood luck and hope everything will be great. ",
            "Congratulations!!! That’s fantastic! Well done, and I hope you enjoy the move/ adventure :)",
            "Didn't see the original post until this thread, but, read both and I'm so happy it worked out for you AND your mother is supportive. My own mother is like a best friend as well, and I know how much her approval means to me so I can only imagine.",
            "You made the right choice.\n\nI faced this same choice a few months ago, only my mom had just had a stroke.  She was bummed about me leaving, but she had an attitude of \"you should have your adventure.\"  As much as I miss her and worry at times, the move has made all the difference.  \n\nGood luck on your adventure! ",
            "Delighted for you, OP. Best of luck with the new job! ",
            "I’m so happy for this exciting update! Congratulations! My daughter and I have a similar situation; it was just us from the time she turned 1 until I met my fiancé a few months before she turned 14. She’s almost 17 now. We are super close and it will break my heart if she has to move far away, but if it’s to achieve her dreams I will be 100% supportive. It will be hard but I want the best for my baby; I want her to live her best life and for all her dreams to come true! It sounds like your mom feels the same way. Good luck, go out there and live your best life!!! ☺️💖🥂",
            "Traveling is fantastic for the soul. Highly recommended it. I moved from Buffalo, NY to Napa, CA at your age. I am 27 now and living in Australia. I come from a loving family, too. Mama may not want you to leave her, which is normal for a loving mother. You’re old enough now to take chances and figure this whole life thing out. \n\nGood luck!",
            "Congratulations, I don't live with my mum but I live very close by and she pushes us to move even closer, I hope when the day comes that my husbands work means we move away she will be as happy for us. Good luck with your new job! ",
            "Congratulations!! We need all the env conservation people we can get!! You do important work and bless you for not chasing a life of material possessions! You sound like you have a very good head on your shoulders so you will go far. Best of luck to you!!!",
            "Your story is why parents need actual friends. Being best friends with your child can lead to the temptation to stunt their growth so that you don't lose your best friend to the rest of the world.\n\nI hope your mom finds an avenue to meet new people. Loneliness is no fun.",
            "Congrats.  Looks like you learned a lesson or two!",
            "I'm proud of you, OP! Great job!",
            "Great to hear, glad you've got her support with no fuss. And congrats on the job and move, I hope its everything you wish it to be.",
            "#CONGRATULATIONS!\n\nOne state away isn't very far in the grand scheme of things. Good luck with everything!",
            "congrats, but I'll never understand that reaction. \"OP, don't you dare apply for that job\" \"sorry I applied for the job and I will like it\" \"omg OP I'm so glad you didn't listen to the people who told you not to apply for that job\".",
            "That's awesome, OP! Your mother probably just needed time to adjust to the idea that you're growing up! I'm glad she's giving you her full support now.",
            "As an aside to everything else said, please tell your mom it's never too late to follow her dreams. ",
            "We see so many stories of controlling parents, it is great to see a happy ending to a story were they are excepting.",
            "Good on you. My parents didn't approve of me traveling the world. I did it anyway.\n\nSometimes they forget it's your life and not theirs.",
            "Congrats! I just graduated with a similar major (Forestry and Wildlife) so I know the struggles of landing a year round job in our field, but I’d rather do something I love for park of the year then something I hate year round.\n\nGo out and be the change you want to see in the world!",
            "Reading your previous post, 4.5 hours is very doable to see each other for major holidays and events. I live that far from my parents and can see them easily for the weekend or holidays. For a change you could also plan a day where you meet in the middle for a long lunch. My sister and I do this sometimes.  Congrats!",
            "Excellent, congratulations!  Enjoy the new ride!",
            "I'm so happy for you!!! Congrats!!",
            "I'm glad that this has a happy ending.  Congrats!",
            "Massive congratulations and good luck for your new job.\n\nJumping ahead, if you get lonely in the new place, taking a class/learning a skill or volunteering are all good ways to meet people and have some company outside of work (I'm assuming you are single although it's silly, I know lots of people who were/are in couples in their early 20s).",
            "Congratulations! And great luck and success going forward!!!",
            "Congratulations OP! How exciting for you. Lovely that your mum was also able to express how proud she is of you and be so happy that you are following your dreams - sounds like she did an amazing job with you to help shape you into the strong and determined woman you are. All the best!! ",
            "I am proud of you for applying and taking the risk. Moving away for a new job was one of the best things I’ve ever done. Enjoy it!\n\nBe a “yes person” for a while. Anytime someone invites you to do something, say yes! You’ll meet new people and try new things. :)",
            "Rest of your life?? What kind of job is it? ",
            "Congratulations on landing the job and good luck with your move!! ",
            "Congrats. A friend of mine just moved from New Jersey to Tennessee for a job and I thought me moving 45 minutes from home was far. It’s tough at first but you’ll be fine! ",
            "Congratulations! You go girl!",
            "Awesome!!\n\nI feel like sometimes this sub forgets that parents are just human. And like all humans, they  can express themselves badly and misspeak. \n\nYour mom's sad you're leaving, you will be too one day when you have kids and they leave. But that doesn't mean she's not happy for you or that you shouldn't go after opportunities for her sake. "
        ]
    },
    {
        "post_id": "edzous",
        "author": "Redflagboyfriend",
        "title": "(update) My (38f) boyfriend (42m) says I'm way to sensitive",
        "url": "https://www.reddit.com/r/relationships/comments/edzous/update_my_38f_boyfriend_42m_says_im_way_to/",
        "score": 2875,
        "num_comments": 168,
        "created_utc": 1576984619.0,
        "selftext": "OP\n\nhttps://www.reddit.com/r/relationships/comments/ec7cyo/my_38f_boyfriend_42m_says_im_way_to_sensitive/?utm_source=share&utm_medium=mweb&_branch_match_id=540369761782055008\n\n\nI'm on my phone but I wanted to give an update because people like them.\nFirst off, thank you for all the replies. Emotional manipulation is hard especially in a relationship. For me, I like to see the goodness in people and I trust people, which are great qualities, it can also set me up as a target. Thank you for confirming what I was seeing and feeling, it's difficult to see these abuse tactics from inside, so much so that you start to actually think what this person is speaking truth because why would they tell you differently. I mean why would your partner be intentionally hurtful?\n\nOn to the update\n\nI didn't want to ghost him because I think that's mean so I sent him a short text that said \"I don't feel that we should see each other anymore. I wish you the best of luck.\"\n\nHe sent me a couple of wtf texts, with the last one saying \"you didn't honor your promise to me. I'm not trying to hurt your feelings but you don't keep promises.\" Followed up with \"I'm a really awesome person, you'll come to your senses and figure it out. Let me know when you are brave enough to be an adult relationship.\" Ending with that \"I don't deserve to be treated this way and I will not tolerate it but you're amazing and I love you. Please don't contact me again\" \n\nThere was more, it was pretty lengthy but that's the core of the message.\n\nI read it and said oh okay, don't worry to myself and blocked him.\n\nSo not a big drama, it's just over and I'm done. I'm going to take some time to myself and do some home projects that I've been meaning to work on and enjoy the holidays with my friends and family.\n\nTl,Dr I broke with him and said some stuff, I blocked him and taking time for myself\n\n\nETA:I just woke up and was reading all the comments while drinking my morning coffee. I wanted to say thank you to all of you for your kind words. I'm really touched by your words of encouragement and shared experiences. \n\nThank you to the kind stranger for the gold! \n\nWe don't know each other but I truly feel like I have a hundred people in my corner supporting me, it's feels really good. So thank you!\n\nI also want to let you all know that I have blocked him on all forms of communication IG, FB, text, email, the works! But I'm totally prepared if he ever tries to reach out again, I think silence is the best road to take on this one. \n\nThank you again for the support, it means more than I can express. I hope all of you have a wonderful holiday and 2020 is everything that you want it to be!",
        "permalink": "/r/relationships/comments/edzous/update_my_38f_boyfriend_42m_says_im_way_to/",
        "comments": [
            "I honestly felt kind of proud reading this update. Good for you! I think you’re really putting your foot down and showing yourself that you won’t accept to be treated badly, and only good things can stem from that. I really think you have much better things ahead",
            ">\"I'm a really awesome person, you'll come to your senses and figure it out. Let me know when you are brave enough to be an adult relationship.\"\n\nGross. Congrats on getting away from somebody that talks like that. I wish you the best.",
            "I can imagine the feeling of panic when he sent the don't contact me again text, I was in an abusive relationship and that's a last stitched attempt to switch the power dynamic back to his terms.\n\nWell done in walking away and respecting yourself.  Taken me far too long to learn that.",
            "His messages are honestly so pathetic it makes me chuckle.",
            "Glad you are going to enjoy your holiday with people that support you.",
            "Just because he said it doesn't mean it true. Those messages are textbook manipulative and scarily familiar, but it's great you say you'll be fine. You will get through this. Keep your head high and surround yourself with people who are good to you (meaning they not only do nice things, but more importantly they don't treat you poorly).",
            ">Let me know when you are brave enough to be an ~~adult~~ abusive relationship.\n\nYou should never need to be brave enough to love someone. If you need bravery to survive them, you dont need them. \n\nOP don't go back, if you do you will be actively telling him you want that behavior to continue in an escalated manner",
            "I went back and read your original post. Oh, heeeeelllll no. Good for you for dumping him! And good for you for doing it with a short text. He really didn't deserve more.\n\nHe thinks he's very \"emotionally intelligent\"? Oh Lord help us... And his responses when you broke up were super manipulative.",
            "You can cross-post this to r/niceguys, they'll love it",
            "As someone who has been through something incredibly similar I still see the manipulation in his words and would be surprised if he didn't pop up again.\n\nIn one breath he's telling you that you'll come back to him: \"you'll come to your senses and figure it out\".\n\nThe next he's telling you how great he is by loving you despite the supposedly terrible things you've done: ''I will not tolerate it but you're amazing and I love you\".\n\nHe's belittling you whilst telling you he loves you like he's hoping that you will see how wonderful he is and you will be grateful he still cares about you despite your so called behaviour.  \n\n\"Please don't contact me again\" is more about making a show as to how unreasonable he thinks you've been and I honestly don't believe it means its the end for him.  He's still trying to manipulate you into thinking you're in the wrong and should or will come back to him.\n\nI'm so glad you've made the smart strong choice to stay away from him because I can tell you 100% guaranteed that if you fall for the line about how much he still cares about you or consider for even a second that you were ever in the wrong then you will give him free pass and strength to continue isolating you from other people by wrongly calling you unreasonable.  I fell for this once and it ended really badly for me.  Keep him blocked no matter what.",
            "Good for you. Really dodged a bullet. He sounds like a textbook abusive type. Like this shit \"Let me know when you are brave enough to be an adult relationship\"  LOL oh lord. Boy bye.",
            ">you didn't honor your promise to me. \n\nDid you make some pinky swear? \n\n\"I'm a really awesome person, you'll come to your senses and figure it out. \n\nNo, he's not. And COME TO YOUR SENSES? \n\nLet me know when you are brave enough to be an adult relationship.\n\nSeriously, enjoy your holidays. He is a brat.",
            "Good work! I'm very proud of you! Take some time and learn from this so hopefully the next guy will be awesome.",
            "Holy crap.  I just had to read your first post and double check the age of this guy. What a fucking baby!! I cannot fathom what a self important tool this guy is... \" I FeEl LiKe I'm Not  A pRiORiTy!1\" \nYeah, no shit!! The conversation was between you and your friends! I'm so glad you're moving on from this self absorbed loser, OP. You've always been ready for an adult relationship- he was totally projecting!",
            "I feel like I've dated this man before. Except I did it for 2 years. Trust me you made a GREAT decision",
            "Good for you. This guy has some serious emotional issues but has zero self awareness with regard to his lack of emotional maturity. From what you described it sounded like he was doing some serious projecting.",
            "Good for you!! Felt pretty good, didn't it?",
            "This guy is so full of himself. Ugh. Narcissism :( Good luck!",
            "Thumbs up for your courage and intelligent initiative. Emotional manipulators should indeed be met with this kind of response. I hope we all find the courage you found if we ever come across a dumbass like your ex. Happy holidays! 🎄😁",
            " Is his name Mike? Lol. I went on two dates with a guy who said similar things. Very creepy and bizarre.",
            "Ew, he went full size n r/niceguys at the end there",
            "Epic bullet dodged. I’m so happy for you.",
            "Good for you but honestly... people like your ex are fully expecting you to run back to him. So just... if there are other ways he can contact you, don’t be surprised if that’s what he does when you don’t start messaging back",
            "Congrats on ending this early, and walking out of it with your head high. I wish you the best of luck!",
            ">I read it and said oh okay, don't worry to myself and blocked him.\n\nDon't forget this bit.",
            "Repetitively saying, I am going to breakup with you is not healthy. You did the right thing. A relationship is about accepting a person not about giving up on them or giving an ultimatum. After a point, the breakup threats start to lose their power and soon it would turn to worse threats which makes the relationship toxic.",
            "OMG Is that promises line right out of the he assholes handbook? No I'm not honoring my promises to you, we're done!! Good for you OP, for seeing right through that bs.",
            "The dude is a total abusive narcissist. Stay faar faar faaar away from him!",
            "OP, you did great! Your text sounds like it was perfect - respectful yet firm. Brilliant! \n\nI hope you have a good network of friends and good people around you. And I hope you have a lovely winter holiday!",
            "He sound like a major nice guy",
            "Emotional manipulation is the worst - I'm glad your ex showed his true colors in the beginning of your relationship. \n\nIf you ever feel confused r/emotionalabuse is a sub for people who have or are dealing with this kind of manipulation, feel free to visit if you ever need confirmation that this was the right choice.",
            "I don't know you, but I'm so proud of you.",
            "It's never easy to break up. I'm glad you got out when you did since what he did was incredibly manipulative. I will second what the poster below said and say I feel proud you stood up for yourself. Hopefully you can get to those projects and spend more time with your friends and family without feeling guilty!",
            "Wow he was a real drama queen",
            "His text screams major nice guy. You dodged a bullet on this one. What's concerning is he wasn't happy about you making plans with a friend, and that's a huge red flag.",
            "Haha this guy is a toy. My ex would alternate between telling me I am awesome and then that I would never find anyone to like me. I broke up with him and I am now engaged to an amazing man. Abusive men always make a last desperate attempt to make you feel unworthy of anything better. I am glad you didn't cave in.",
            "Good for you, now stay away! It’s incredibly annoying when people threaten to break up over minor issues. It’s really disproportionate and kind of takes the conversation hostage because when you like someone you obviously don’t want them to break up with you. It’s okay when you do it over a real deal breaker, but not as a matter of routine!",
            "Nailed it. Great work.",
            "Good for you! You deserve to be treated with respect!",
            "Honestly you dodged a bullet with that one.  You should be following narcissist subs for more understanding. \nI'm wishing you best. Stay strong",
            "Yikes! I didn't even read your OP, but that guy sounds manipulative if. Also like a nICe gUy.\n\nI'm glad you left him. Well done, OP!",
            "gald to read this! have yourself some merry holidays wirh your friends and fam!",
            "Congratulations on breaking free. Gaslighting is an Escher print of a trap with the nightmare fuel of a Dante. \n\nI hope your holidays are a good dose of wholesomeness!",
            "He will end up contacting you again, it probably won't be a week before he does. Block him on all platforms.",
            "[removed]",
            "I didn't even read your first post but I also read those texts and said \"oh okay\" mentally.  Good riddance.  \n   \nHe sounds like someone who read a few psychology articles on setting boundaries and limits, but he has no self-awareness.  So instead of combining those lessons with normal behavior, he's applied them to a world view where any time he's unhappy... it must be because you wronged him.   It's really impressive how he says he doesn't deserve to be treated this way, in regards to being broken up with.  Uh, no one is obligated to stay with you no matter what you \"deserve?\" .....",
            "Good for you.\n\nBecause he was both pathetic and incredibly manipulative.",
            "haha, \"you can't fire me cause I quit.\"  OK, bro.",
            "I love when these manipulative people are arguing with you to take them back while simultaneously insulting you. I’m really glad you were able to see through this guy’s BS, OP. He’s probably working himself into a lather that you caught onto his manipulative tactics so quickly. Heeheehee",
            "Wow I’m 29f my bf(29m) is doing the same thing. Anything he doesn’t like he threatens to break up with me or does so and then takes it back. It’s definitely a form of manipulation. He refuses to compromise, it’s his way or the high way. It’s hard, he’s the first man I have real chemistry with and i know he has baggage he ignores like most men. I’m just unsure what to do and not strong enough to leave. I commend you on your strength.",
            "Good for you. His goodbye messages really take the cake.",
            "If only I'd done this a few years ago.  My manipulator has since passed and I am going through a lot of anger.  It would've saved me a lot of angst now if I had simply ended the relationship a few years ago.  Kudos!  You did the best thing!",
            "Just read your previous post and was shocked when I saw that he is 42. I’m proud of you. You deserve better and just started down the path towards finding it.",
            "\"Let me know when you're brave enough to be in an adult relationship.\" My response ti that would be \"Next time I'm in a relatiinship, it WILL be with an actual ADULT - not a 42 year old toddler.\"",
            ">\"I'm a really awesome person, you'll come to your senses and figure it out. \n\nr/niceguys ! I cringed and I apologize now, but I laughed at this part! I'm really happy you were able to end it with this guy! Hopefully he doesn't find another fish in the sea though 0-0 he deserves no one's love and time!!!",
            "Sounds like he is being insensitive, nothing wrong with being sensitive.\n\nMy mother told me to grow thicker skin, I told her I used to and it weighed me down, so I shed it off and have good boundaries in place of that thick and defensive skin I once had because of her.\n\nSounds like he may lacks empathy for you given the title alone.",
            "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 \nkeep that little boy BLOCKED",
            "i went back and read your previous post and i feel so proud of you!!! good riddance, what a piece of work he was. good luck on your home projects!",
            "This dude is 42????? Jesus Christ. I'd have guessed 14. \n\nYikes.",
            "Glad you ended things. I didn’t even finish reading the first post. As soon as I read that he said that stuff about not prioritising the relationship when you said to were seeing your friend I had to come to the update and hoped you had dumped him. No one needs an emotionally manipulative pathetic little boy for a partner.",
            "I'm so glad you broke it off early. That's why he's 42 and single, cuz no one puts up with that kind of stuff. And I'm glad you stood your ground. There is no reason that anyone should make you feel bad or guilt trip you in that situation, you literally did nothing wrong.",
            "Honestly, that’s a good point too. Hard to argue that logic. I’ve heard lots of people talk about being in committed relationships for several years and they break up via text message and I was just curious if times have changed and this is the new norm.",
            "This guy is definitely a \"nice guy\" and it sounds like you did the right thing.  He sounds incredibly manipulative and emotionally abusive.  Take it from someone who was in several abusive relationships, when it starts with emotional abuse, it usually ends with physical abuse.  You dodged a bullet.  I'm proud of you.",
            "So proud of you for taking a step for yourself. No ones happiness comes before yours.",
            "Good for you. You did something that's hard for most people. You deserve to be in a happy relationship. Never settle for less and use your past experience to make your next relationship better than the last.",
            "\"I'm a really awesome person...\" this kind of tooting of one's own horn in this context (a breakup or even serious relationship discussion) has always turned out to be a major red flag for me.\n\nI am new to your story, but what a great update. You are strong and I believe in you! Keep taking care of yourself <3",
            "I totally agree, he sounds like a POS, I was just legitimately curious if this is the new norm now.",
            "I love this update. Short sweet and to the point. You acted maturely and he obviously did not. He ironically doesn't see his childish and immature behavior literally while he's going on about how to \"be an adult\"... Just great stuff. Dude is a moron, you're not. Congrats on handling this situation like a boss. Enjoy the holidays and move on. Cheers!",
            "I love happy endings.",
            "Sounds like a good story for r/niceguys",
            "I am SO PROUD of you, OP! You’re a brave & smart person to do what you did. This dude is a manipulative butthole, & wanted you to come crawling back.\n\nGo enjoy your holidays & a grand New Year!",
            "I am glad you got out of a toxic relationship and I wish you all the best for your future.",
            "He’s the sensitive (and manipulative) one",
            "This was the first post I read of the bunch... And just from reading his texts to you... You are better off.",
            "👏👏👏👏 YEEEESSSS! Good for you for standing up for yourself!",
            "He sounds like a narcissist. So happy you were able to avoid him and get out before it was too late.",
            "I really don't want to doubt op but it looks like op deleted most if not all of the story and only has an update, sorry if I missed something.",
            "Wow he really went full nice guy mode with those last couple of texts. I wish OP the best:)",
            "He's FORTY TWO and doesn't want you to have friends? Lol bye, dumbass. You can come to brunch with me.",
            "Your story is uplifting and the perfect way to handle it! Those phrases that you mention are something so close to what my ex would say, if you happened to be in RI/MA I would love if it really was my ex and he had to deal with this in response to his manipulations! Perfect! Proud of you!",
            "I can't believe a real live person, much less a man in his 40s, talks like that. You dodged more bullets than Neo inThe Matrix.",
            "Talk about dodging a bullet! Go you!! He sounds like a real winner... /sarcasm",
            "His reaction honestly make me laugh so hard.",
            "Well done. I hope you find the happiness you deserve with the right person.",
            "His responses are totally immature and weird. Not what I would expect from a 40yo. You've done the right thing here. Being threatened with a break up every time he doesn't like something is pretty unhealthy and horrible. All the best lovely lady",
            "[deleted]",
            "I don’t know if I missed it but how long had the two of you been together? I give you props, no doubt in my mind that you did the right thing and you avoided some serious BS in the future. I hope you meet the love of your life soon!\n\nI’ve been out of the dating game for a couple decades now, but I’m curious… Is breaking up with people via text message the new normal? I can understand not wanting to meet them in person to do it, but I feel like at least a phone call is deserved? Am I wrong in this?",
            "[removed]"
        ]
    }
]