[
    {
        "post_id": "bgh020",
        "author": "NotCallum1990",
        "title": "I [28M] don't want my MIL or my other in-laws to help with our baby anymore unless she changes. How do I convey this to me without causing a rift?",
        "url": "https://www.reddit.com/r/relationships/comments/bgh020/i_28m_dont_want_my_mil_or_my_other_inlaws_to_help/",
        "score": 2872,
        "num_comments": 350,
        "created_utc": 1556029593.0,
        "selftext": "My husband [30M] and I [28M] have a 6 week old baby daughter. I am currently a stay at home dad and taking on most of the childcare. Occasionally my MIL has been helping me out but it has been causing a lot more stress than usual since she has been staying over and sleeping in our guest room.\n\nThose past weeks we have been dealing a lot with baby colic. She has been difficult to comfort unless I hold her and she does get very upset when my MIL holds her. My MIL is a lovely woman but you can't explain that to a baby. I have been trying to explain to MIL that I appreciate her help around the house a lot, feeding times, laundry (baby's clothes). I have been telling her that but when it comes to the baby crying her head off I'd appreciate if she let's me hold her. When I tell her that, especially when the baby is crying and clearly wants me to hold her, my MIL gets visibly upset. Close to crying even because she thinks I'm pushing her granddaughter away from her. \n\nThis mainly comes from her refusing to respect that I don't want her to kiss the baby on her lips, which is a disgusting habit my SIL also participates in. My MIL invites my SIL over as well to coo over the baby despite my daughter crying because of colic and overstimulation. She's not used to any of this. \n\nMy husband is not backing me up on this because of course it's his mother so now I have to talk to her without causing a rift.\n\nTl;dr MIL and SIL do not respect boundaries regarding my daughter of 6 weeks. If this continues I'd rather exclude them for a while. How can we fix this?",
        "permalink": "/r/relationships/comments/bgh020/i_28m_dont_want_my_mil_or_my_other_inlaws_to_help/",
        "comments": [
            "Your problem isn't your MIL or SIL, it's your partner.  You need to sit him down and have this out with him.  He then needs to handle his family.",
            "> My husband is not backing me up on this because of course it's his mother so now I have to talk to her without causing a rift.\n\nThe issue here isn't your MIL. It's your husband and his unwillingness to set boundaries with his mom. Honestly, if you and your husband can't get on the same page with how to deal with his mom, she will always get in the middle of your family. \n\nHas he always had issues setting boundaries with his mom? It honestly may be time for couples counseling. Why are you with a person who can't prioritize you and the family he is building with you?",
            ">My husband is not backing me up on this because of course it's his mother so now I have to talk to her without causing a rift.\n\nHuh? No. Now, you have to talk to your husband, and HE has to talk to his MIL. \n\nIf he *still* won't get on board? Since you're the one home, tell her you don't want her for overnights for a while (read: ever). When she wants to come over for an afternoon, say no to some visits. You may not have just given birth, but colic can make anyone hormonal. ;-P You and Baby need to get into a nice schedule, and guess who doesn't dictate it? MIL. She sounds nice and all, but this is your baby. \n\nAnd I'd wear your baby around during their visits. Like, MIL gets some cuddles or does a feeding--scoop! Baby goes right into the carrier/Bjorn. And MIL does some laundry.",
            "If your husband isn't able to understand/and or do the work to have a conversation with her... You aren't left with many options besides doing it yourself. \n\nPerhaps sit her down and tell her that bonding with your daughter is incredibly important to you. Sandwich this comment with how much help she is offering, and that you appreciate all of her hard work around the house. \n\nSometimes you need to be really direct in your statements to get the point across. Reiterate that holding your daughter and bonding with her is very important. Period. \n\nAs for kissing on the lips, explain that your baby's immune system is nonexistent, and that you don't feel comfortable with spreading germs. Or you can be more blunt! Whichever approach works best. \n\nTruly, your husband should be doing this. I also had a clingy, passive-aggressive MIL. My husband didn't see the problem. I had to sit him down, and say that I am not asking, this is a requirement. (I don't ever make demands- so the gravity of what I saying finally drove home how I felt about the situation. Btw, I also had problems with her holding the baby, trying to feed the baby formula (when I was still breastfeeding), monopolizing my husband's time. Eventually, we had to ask her to leave because she failed to respect our decisions. \n\nI asked my husband not long ago- when our son was almost one- what he remembers about that time. He said something rather enlightening. He said that those first few months were a fog, that the stress of supporting the family and never having a break (first going to work and then coming home to help out with the baby so that I could shower), just about drove him to the breaking point. He was eventually diagnosed with PPD (did you know that 1 in 10 men also get PPD? Thankfully, this fact was shared with us in the hospital), and was on medication for about 3 months. He also didn't really see the issues that I was having with his mother, because he was always working or caring for the baby. \n\nI wanted to offer you this insight, because it may be helpful to you and how you approach your partner.",
            "Maybe it's time Grandma goes home.",
            ">My husband is not backing me up on this because of course it's his mother \n\nThis comes up soooooo often on r/JUSTNOMIL. The husband is so accustomed to being a \"good son\" and letting MIL run the show, that it doesn't seem to compute when that comes into conflict with being a good father, or being a good husband. (To be fair it can definitely happen with daughters of overbearing mothers as well, but that isn't the scenario here.) And unfortunately when you have a MIL with baby rabies that often brings the three roles into sharp conflict. \n\nYour husband needs to realize that he is a father first, and that it is his job to prioritize his baby's **needs** over his mother's emotional **wants**. If your husband trusted you enough to have a child with you, he needs to trust you to advocate for that child even when it means he might need to have a difficult conversation with his mother.",
            "Okay. Having any guest sleep over when you have a newborn is just not convenient. Unless this woman is doing all your laundry, prepping meals, cleaning and tidying like it’s her full time job, *It is not actually helpful*. \n\nYou need to take this to your partner. \n“It’s been 6 weeks. Your mom has been so helpful. Going forward we will need less help, which means having an overnight guest, even if it’s family, adds stress. Let’s scale back on those types of visits, so that when we have your mom and sister over, we can just be a family and spend time with baby. Right now, it’s so constant that baby ends up overstimulated, leading to hurt feelings and resentment. The sooner we can get back on track the better; not because I don’t want her help but because we all share a better dynamic if she can just be grandma, who visits; as opposed to grandma who is a long term houseguest”. It’s in his mom’s best interests to have that bit of distance with baby; part of the joy of a grandparent relationship is that novelty: you don’t see them all the time so you capitalize on time with them and light up when they come. If mom is always there, and has held her when she didn’t want her to hold her, that hurts their relationship. \n\nBasically: when it’s your parent it’s your problem. This is on him. He’s not home throughout the day? Great! So he isn’t witnessing the dynamic here. You want to remind him that this is in everyone’s best interests, or there is a real risk of resentment and that’s a much harder conversation to have than “hey mom we so appreciate your help. Going forward we won’t need those overnight visits so regularly but we still want to see you lots! We can’t thank you enough for being there when we needed you” (past tense!). Remember that post-partum can strike either of you in these 2 years. Having a baby is hard and weird; boundaries are important. \n\nIs your partner usually so willing to let you be uncomfortable in favor of his family or friends?",
            "Yeah definitely right about it being your partner who needs to set the boundaries with his family. They will only resent you if you do it.\n\nI also agree with you about kissing children on the lips I know it is completly non sexual and a show of affection but this is how you pass herpes onto children. I also do not like people sucking their babies dummies etc to clean them.",
            "If you're approaching differences like they're \"a disgusting habit\" then you're going to hurt and alienate your in-laws, and you're going to engender resistance rather than cooperation. You guys do need to set boundaries, but those boundaries need to be agreed upon between the two of you, then communicated to your in-laws. So the first step is actually talk to your husband about what boundaries you need. Tell him you need his help and support in backing you up, but you also need to take his opinions into account \n\nSet boundaries firmly, but try to set them positively, too.  \"Please kiss her on the top of her head or her cheek,\" will meet with less resistance than \"don't kiss her on the lips.\" You may need to change to more negative wording, but save it for if an escalation is necessary. \"I need your help with this while I calm her down,\" may come across better than \"She wants me.\"\n\nAlso keep in mind, though, that it's actually really good for people besides you to soothe your daughter, even if it takes longer at first. It's good for your daughter to accept more than one caregiver and it's good for you to be able to have an actual break. The process can be anxiety provoking at first, but it really is a good thing.",
            ">I'd appreciate if she let's me hold her.\n\nYou are being way too passive here. Go get the baby yourself when the baby cries. If MIL is already holding the baby, demand she give the baby to you. If she refuses, say \"listen to yourself. You are preventing the baby's own father from holding her. You are being ridiculous. This is my house, my baby, give me the baby and then we can talk.\" Be authoritative and firm. \n\n>when the baby is crying and clearly wants me to hold her, my MIL gets visibly upset. Close to crying even because she thinks I'm pushing her granddaughter away from her.\n\nLet her be upset but don't let her hold the baby at all. If she's upset that's her problem. If her teary face makes you upset too, then tell her to leave the room and/or you leave the room and go to a different room, close the door. \n\n>This mainly comes from her refusing to respect that I don't want her to kiss the baby on her lips, which is a disgusting habit my SIL also participates in. My MIL invites my SIL over as well to coo over the baby despite my daughter crying because of colic and overstimulation. She's not used to any of this.\n\nIt's your house, right? If you don't want SIL over, then don't let her in. Meet her at the door and tell her that you know she loves the baby, but the baby is napping (or trying to nap) and you are not accepting visitors. But that you would love for her to come over on Thursday (insert whatever day you're comfortable with here). \n\nMake it very clear to MIL and SIL that your baby only takes visitors during certain hours of certain days (that are convenient for you). You love that they love your baby but they are interrupting your time with your own daughter and making your life harder. Keep your daughter in a separate area of the house and stay there with her. MIL can help cook for you in the kitchen for example, but the baby won't be in the kitchen. Stay close to your daughter when MIL is home, so you're the nearest one to attend to her when she cries.  \n\nMIL and SIL already don't respect you (or your husband) and just want to act how they want. There is no reasoning with them because you've already asked nicely and timidly and they just steamrolled right over you. So, be authoritative. Set up house rules and baby visiting rules. Enforce the rules. Don't argue with them, just tell them this is how it's going to be. \n\nThey're not going to like it, but they don't have to like it, they just have to obey your wishes.",
            "Gonna need to embrace that rift.",
            "I read somewhere that kissing children on the lips can cause bacteria from tooth decay to pass to the baby, not to mention HSV. Head that off because it’s gross and dangerous for baby.",
            "Just want to add some perspective as I’m seeing a lot of “you need to talk to your husband” comments.\n\nMy wife is awesome. We have a great marriage. We respect the hell out of each other. We have great communication. It’s the easiest relationship I’ve ever had.\n\nHer parents are her kryptonite. It’s our only big fight. She always sides with them because she doesn’t see them as people who can change or that will understand the boundaries I need (because we’ve tried enforcing them in the past and they sort of get it half right and you would literally need to handhold them to get them across the finish line).\n\nAnyway - we just had our first kid, she’s 3 months old and the in-laws stayed in town for 4 months. About 6 weeks leading up and 12 after she was born. They came over a few hours three times a week. For me, it became more of a chore handling in-laws than it was handling my child.\n\nMy wife and I are pretty self-aware and sensitive to our surroundings and are pretty in tune with our child’s needs. Watching the grandparents try and console the kiddo with attention and holding her when really she just needed a bottle was always a little frustrating. Because we know our child’s full rhythm and what need is coming next, so we want full control to meet those needs.\n\nI will also say, a lot of friends pretty much encouraged me to chill out and try to find some peace in the chaos. My instincts were to shut everyone out if they didn’t play by my rules. I would still like to do that and didn’t gain a lot by letting others dictate a little, but the time has officially passed and it’s just the wife, myself and the babe now going forward.\n\nI say all that to offer support and say, even if you’re awesome and your partner is awesome and your baby is awesome ... family throws a wrench in those gears.\n\nSo I’ll try and offer some ideas inspired by some of my circumstances and see if we get you anywhere.\n\n1.) Stay in your room with the door closed. This is your safe space. You don’t owe anyone your time or company. If you need your room, take the baby and just camp out. Do it all day for all I care. People are worried about their feelings being hurt, they’re grown ups. They can learn to deal with their emotions and if your husband wants a certain grandparent relationship then set boundaries with him that he can navigate what that looks like when he’s home from work and has time to facilitate grandma and aunt time.\n\n2.) Make the help errands. If they really want to help, send them out to get you lunch. Buy diapers and formula. Run the dishwasher. Even get specific, just put a list together of chores like swifter the kitchen, bleach down kitchen counters, take out the garbage. Just make a list and then put it out there as an offer. You might be surprised that they’re happy to help with those things, or at the very least you will be validated when they throw a fit that they don’t actually want to help, they just want to hold the baby.\n\n3.) Take advantage of the company with a date night. Just an hour out the house. It’s sort of disorganized and not essential, but it does a few things. It gets you used to the baby not being in your presence 24/7. It recreates your marriage dynamic where it’s just the two of you as a team, not the two of you facilitating the rest of your families feelings. And you’ll probably enjoy it which will help you feel less resentment to the family staying with you.\n\n4.) Be pissed off and know that it’s not forever. Don’t feel guilt or shame for being frustrated. Don’t feel like you’re overreacting. Trust your instincts, your not being over protective. I think grandparents and family sort of turn your child into a toy or object of their affection and lose all aspects of awareness that this is another human that you’re trying to care for. They have their own interests in mind and it’s hidden under the mask of “being helpful”. You can be understanding that they’re having a hard time understanding your needs and attempt to not feel resentment towards them, but don’t feel like you owe anyone something just because their feelings are hurt.\n\n5.) Just keep being creative. If the day is just creating stress and anxiety ... you lost that day. It’s just ... it’s a day that sucked. But maybe the next time a day starts, you’ll sort of know how to handle it better as you learn in your new experience. Maybe you don’t like that they try and take over baby duty during meals or at certain times of the day. Maybe at that time of day, you go on a walk, or take the baby to the grocery store to “try it out”. Just keep shaking up the routine so you can have a little control over it.\n\nAlright, these are just spit balling ideas. I’m a big anxiety/depression person and having a kid destroyed a lot of the boundaries I established because now I owe my baby to everyone. It’s really hard and needs a new learning curve, but things are good now and going forward. So there’s potentially light at the end of the tunnel.\n\nAlso, anytime a family member moves into the house ... it spells trouble. Take this as a frustrating experience and start planning our boundaries with your spouse for the next trip or visit from family so you can start to feel like you’ll have more control over your environment in the future opposed to building long lasting traditions that make you uncomfortable.",
            "Firstly, when you have a new baby and people offer to help you, they should be doing the things you need them to do, not just playing with the baby. \n\nWhen you tell someone not to do something in regards to your kid, like kissing them on the lips, and they refuse to comply, that's grounds for getting kicked the fuck out until they learn to be respectful of someones wishes for their own child. \n\n&#x200B;\n\nYour partner needs to have your back. The fact that your kid is only 6 weeks old and he's not supporting a very valid wish of yours means you need to get into marriage counselling asap. This will only get worse.",
            "If your SO won't back you up, the problem isn't with your in-laws. \n\n&#x200B;\n\nUse the \"doctor's orders\" excuse for the mouth kissing.  No one but the parents should be kissing baby at all while she's this young.  Explain to them that they are putting your child's health at risk, and that needs to stop. \n\n&#x200B;\n\nThen tell MIL that you'd like to try parenting on your own during the day, and her overnights won't be needed anymore.  Hire a maid to do the cleaning if you can't keep up with it.  Make DH pay for it. \n\n&#x200B;\n\nBut mostly...get your DH on  your side.  It doesn't matter that he thinks you should be grateful for the hlep. (Note: hlep might look like help, but it's not.)  If your MIL helped, instead of hleping, maybe you would be.  Tell him that YOU and his daughter need to be his priorities, and that he needs to stop putting his mommy's feeling above his husband's feelings, and his daughter's health and safety.   Really, he should be having this chat with him mom and sister, and dealing with all the boundary setting and enforcing when it comes to his family. \n\n&#x200B;\n\nIf my husband told me it was my responsibility to deal with his mom, he would regret those words...because he would NOT like the way I choose to deal with her.  Tell him that he can help you handle this gracefully, or watch you scorch the earth.",
            "Not the main point, but your mother in law and anyone else should avoid kissing your daughter on the lips because they can pass on herpes virus this way.  Even if they have no recollection of ever having a cold sore, they can shed virus without any symptoms and infants are especially susceptible to severe manifestations of the herpes virus. It’s super rare, but when it does happen it can be life threatening for the infant. Not saying this to worry you, but providing you with a legitimate medical reason to try to curb the mother in laws kissing habits.",
            "You have a 6 week old baby. She doesn’t want nobody else comforting her but her parents. She only knows and trust you two, my kids honestly cried whenever my mom held them until they were 2 😂 it takes time to build that bond that baby so little she’s not capable of having trust with that many people. These are special weeks that should be spent with your little family. They are only this small so long, I wouldn’t be having people that cross the line so many times spending the night at my house, they can visit but on your terms",
            "Maybe try switching up how you're explaining this to your partner:\n\n* Baby has colic - this is stressful for the baby AND for you, her primary daytime caregiver\n* Your mother/in-laws, despite their very best intentions, are increasing your stress when they try to help - you are beyond grateful for their intentions of being helpful. However, their intentions aren't matching up with reality, and reality is what matters here.\n* What YOU, as the primary daytime caregiver needs, is minimal stress, so that you can provide the best possible care to your daughter.\n* While it would be great to find a situation where your MIL/in-laws just listen to you and actually provide the assistance you need, that's not going to happen without a LOT of stress on your part. You don't need more stress.\n* I'd give your husband two options - either he explains to his mom that she needs to back off while you're parenting unless you specifically ask for assistance, or his mom needs to stop coming over while he's at work. If he chooses option a and your MIL doesn't fix herself, option 2 happens regardless.",
            "Kissing a baby on the mouth is an absolute no no. Kissing them anywhere on the face, especially if you are not the parent, is a no no. Their immune systems are too weak, and they can contract herpes from cold sores, which can actually kill the baby. And you can carry the virus for cold sores and not have cold sores.",
            "I would agree with other comments about you needing to talk to your husband about the issue, but I would also suggest you talk to your mil and sil at the same time. This is your baby, I have a baby as well and had to talk to my mother about kissing her on the lips- hsv can be deadly to a newborn, definitely address this! About the colic and crying, just put your foot down and take the baby to a quiet place to take care of her away from your mil. Explain to them she’s very little right now and she gets overstimulated and she needs less attention... when she’s older it’ll be easier. Just reiterate that you appreciate all of her help and are thankful she’s there to help, however, you need time with her as well. This whole world is new to you and the baby. It takes time to get to know each other. Btw I had very little help from my mother and mil, they seem to have good intentions.",
            "Mouth kisses from relatives are never good in my opinion. Kiss on the cheek? Totally acceptable. Forehead? Sure. Tip of the nose? That's cute. But kissing on the lips? No thank you. I have almost traumatic memories from childhood being forced into uncomfortable kisses on the lips from Grandma. I wish my parents would have put stop to that shit early to save me the awkward conversation once I was able to object. Nip that shit in the bud!",
            "Congratulations!\n\n*You are learning how to parent!*\n\nNO ONE will be as desperately crushed as a tiny toddler when you tell them, \"no.\"  You want to hear heartbreaking sobs?  You will, when you tell your tiny daughter that she can't have something or do something.  \n\nThe absolute worst tears in the world.\n\nAre you not going to parent because it's going to hurt you, too?  Are you going to give in because if you don't, your baby will hate you?\nWhat about discipline?  Off the table because she will get super upset?\n\nTraining, m'dear, this is *training.*\n\nAlso?  Your child is infinitely more important to your and your little family unit than your MiL.  If she has issues, *she can use her mouth to tell you human words.*  If this stirs up, say, anxieties, then she can book a few sessions with a therapist.\n\n**Your baby cannot advocate for itself.  It is absolutely helpless.  If its parents won't step up because they fear conflict, then baby's life is already kinda fucked.**",
            "If he (your partner) won’t do anything about it... then I’d politely say to said MiL and SIL if they can’t respect your wishes with YOUR child, since you as the parent know best... then while the help has been  greatly appreciated you’ll no longer need or accept it. Be strong! The baby is more important right now than grown people fighting.",
            "Set house rules that apply to ALL visitors. Such as\n\n1) when baby cries she is returned to you when  you request her.\n\n2) no kissing the baby on the lips\n\n3) no inviting other people around unless the homeowners (who are at home and have to deal with the visitors) agree. This one is just plain manners.\n\n4) any other annoying thing people are doing.\n\nPeople who can't follow the rules aren't allowed inside/are asked to leave for a set amount two days or whatever works for you (adult time out if you will). Advise your partner you are doing this because it's will help you care for the baby. If the house gets shabby because no one's helping you, then welcome to parenthood. Sometimes the house is a mess.",
            "So in my experience. I can have a meltdown freak out on my mom but my husband cannot. I feel like that might be the same with most people and their in laws. \n\nEither you need to just have a full on for real talk with your MIL and pray it goes welL. OR it’s definitely your partner’s job to get that real with her. It is hurtful to be pushed away but honestly, big picture, it isn’t a big deal as long as that relationship is till nurtures and she doesn’t feel excluded all the time. I’m sure you can find a happy medium if you’re just honest and blunt.",
            "How does the baby do in a carrier? If your daughter tolerates it, I highly recommend baby wearing when MIL or SIL comes over. It gives you a little more control over them taking the baby from you. If they offer to take the baby, you can just say \"I just got her settled, but I'd love some help with (insert chore of choice here)\" \n\nAlso, when it comes to kissing the baby on the lips, don't ever feel bad about reaching out and removing the baby from their hands. That is a boundary that you should have no qualms reinforcing. If anyone ever gets mad at you for protecting your child, they can kick rocks. You just tell them that forehead kisses are welcomed and encouraged, but that your pediatrician recommends no mouth kissing. If you have to show them pictures of babies who have contracted herpes do it. Just be extra nice during all of your other interactions, they'll get the hint,",
            "It goes like :\n\"Thank you so much for your help while we made sense of this new tiny little thing in our lives. We got this now and you need to leave and let us get on with it.\"",
            "On a side note... my daughter cried for two months over colic. She was probably in excruciating pain. I didnt realize it at first seeing as I am a pretty young mom... I was encouraged to try gripe water and it solved so many of the colic issues! Please try this if you haven't. It's all natural and a great stomach settler. Helps them pass gas and burp. Have you also tried different formula?",
            "I agree about the lip kissing, Lips are for lovers and mafiosos that are about to die.",
            "I’m glad someone fucking agrees with me. Kissing kids on the lips is fucking weird.",
            "Peds nurse and mother of 3 checking in. Why is your baby crying so much? That is not normal. Does the baby have a normal eating/wake/sleeping schedule at this point? Eating a full feed every 3-ish hours, awake for a bit and sleeping in between? Making normal diapers and stooling every day for formula and almost every feed if breast feeding? Perhaps your baby has intolerance to milk or formula. Perhaps the baby has reflux, this is the most common cause of an unhappy baby as it causes pain and they can’t rest happily. I am happy to help trouble shoot if needed or feel free to schedule an appointment with her pediatrician.",
            "Maybe say you got it now and thank MIL for the time she's been there? I know 6 weeks things are still pretty miserable and you could probably still use some help, But maybe it's time for another friend/Family to come over since MIL won't get the hint to back off",
            "Everyone needs to go home and leave you guys alone. Your husband needs to put his foot down and tell them while they are appreciated, your daughter is having an adjustment period and not doing well with all the stimulation. If they are offended, so be it. Do they have a habit of overstepping your boundaries often? Don't be afraid to tell people to back off.",
            "My opinion is a little different from most of the ones I read. Take it as you will. As a couple, you won’t always agree on things, and the same holds true in your role as parents. Is your husband willing to support you even if he doesn’t agree? (I’m assuming you’ve shared the reasons you don’t want the other family members kissing baby on the lips, but perhaps I shouldn’t assume that).  If he’s not willing to support you, there’s your issue and that’s what needs to be dealt with.  If he does support you but doesn’t want the conflict, then handle the conversation with the in laws instead of making him do it. I believe in being direct and think it’s more fair for you to not put him in the middle. If this is between you and MIL, then handle it between the two of you, like adults.",
            "I remember feeling like this after my first child.  After the second one,  you realize that the baby will be fine and you should just go take a nap,  get your nails done,  make a nice supper,  workout.... or anything else that being a parent makes it hard to do. Good luck dealing with this and my only advice is to try and not burn bridges.    It would be a shame if the reason you alienate the grandma is that she \"kisses on the lips\".",
            "Your husband needs to stand up for you or else this behavior will continue. It also sounds like sitting down for a family meeting could be helpful. Reiterating that the baby is colicky and you’re not trying to keep the baby to yourself is a good start. Thanking them for their help but also reminding them that they need to follow your rules because it’s still your house and your baby. I also have a husband who doesn’t want to tell his family anything but if he doesn’t stand up for you they will figure it’s ok because your husband isn’t saying anything. New babies can really complicate family situations so it sounds like starting with getting support and then having some open communication with everyone would be your best bet. Good luck",
            "I'm so sorry you gotta experience this. It's so frustrating and upsetting when family refuse to respect your wishes. My brother was like your husband. My SIL expressed to him about not wanting his mom to kiss her baby on the lips (especially because she has cold sores) and to stop trying to hold her kid because the kid wants her not his mom.\n\nIt is best to talk to your husband because if your husband doesnt have your back, que the mom telling your husband how you dont like her or some shit. And your husband needs to understand the concerns you have whether he wants to or not. Kissing on the lip is unhygienic. Insisting she holds the baby as the baby cries is frustrating for you AND your daughter. Clearly your husband refuses to set boundaries with his mom and the SIL. \n\nIf you address it, there will be a rift no matter what. And your MIL might even try to get your husband to talk to YOU about \"overreacting\"which you are not. I think going \"MIL, I appreciate the extra hands around the house. You've been helpful with the chores around the house that gives me more time to focus on my baby. I understand you want to help more but you're definitely doing a lot already which I'm grateful for. As much as you help out, I do want you to leave taking care of my baby to me when she's crying a lot. I know you want to help console her, I appreciate your efforts to but i know what to do when she cries and what helps soothes her\" or something like that. She'll still he offended considering she already got offended by the lip kissing. Maybe phrasing it as her being so helpful before telling you to stop might make the pill a little bit easier to swallow.\n\nIn my brother's case, he didnt feel comfortable addressing the issue at all until my SIL basically snapped at his mom. And his mom was trying to play the \"I'm just trying to help, idk why she doesnt like me. I just wanna be there for the baby\". Like if she was holding the baby's intention at heart then she obviously would be listening to your concerns and respecting it. After the whole blow up, he finally addressed it but it was too late by then because my SIL had enough.  Now with his 2nd kid, he's more active in understanding my SIL concerns so the blow up doesnt repeat itself. So yeah, talk with your husband again and if he refuses, let him know you will do it because your child safety and health comes before his mom and SIL feelings. \n\nI wish you more support in your experience. I tried supporting my SIL by actively calling out the elders in my family when they try to do what your MIL does. Like saying \"stop holding her, she doesnt want you. Give her back to the mom\" which helped my SIL not have to deal with the awkwardness of confronting more people.\n\nEdit: a word",
            "Is it possible your husband isn't backing you up because he doesn't agree with you?\n\nBabies get colic, and they cry a *lot*. Especially at six weeks, what your kid is doing is not out of the ordinary in any sense. \n\nIt sounds like a lot of this is your personal hang ups, and maybe some territory issues between you & your husband's family. \n\nI agree that the kissing on the lips thing is weird, but you should be articulating this to your husband, and *he* should be talking about it with his family, talking about the health concerns until your kid's immune system gets stronger.",
            "You need the ongoing support of /r/justnomil.",
            "The newparents and beyond the bump are great subredditss for new parents. Congrats on your new baby and good luck with your MIL",
            "I agree with all the posts so far saying it’s your partners responsibility.  You should not have to be in this position, your MIL is not part of your nuclear family unit...your partner is and they are the ones that must deal with their family units.\n\nIn other news...is it really disgusting to kiss family on the lips?  Or just the baby?",
            "To me, it sounds like you may be focusing on the bad parts and not the good. Seems like they're easy to talk to. Tell them exactly what you're saying here. Show them this post even. I've found that people may communicate but not like they need to pr want too. Tell them what's happening is affecting you and other aspects. Tell them everything. Don't be shy or ashamed. You're the parent you make the rules. Some people love to help, I'm that person, and I find myself helping toooo much to the point it hinders. Seems like they're just trying to help in any way they think they can but not understand the affect its having. You may say \"hey this bugs me\" and they fluff it off cause you're not making it as big of a deal as it is to you! If they know that it's really does affect you and your life and relationships they may open their eyes.",
            "To be blunt:  you can't.  there are no magic words to make someone magically stop being a jerk and not resent you for it.  What you need to do is be a papa bear and do what's best for the baby.  If that means hurting MIL's feelings then so be it.  \n\nYou and your husband need to be a united front.  Enlist your pediatrician in explaining to you husband how MIL and SIL are putting your child at risk of all sorts of horrible stuff.  Your DH needs to grow a backbone and learn to stand up to his mother.   His #1 relationship job right now is to be a good dad and husband, not worrying about being a good son.   \n\nAlso, tell  your DH that help isn't help if it isn't wanted.  Maybe next time he's doing something, barge in and make a mess of it.  When he gets mad exclaim that you were just helping and he should be happy.  Then later point out that's how you feel about MIL trying to take over parenting duties.  \n\nAlso take a break from having MIL over so much.  She's acting like she's a third parent/mom to the baby.  Nope - baby already has two parents.  MIL is extended family and needs to back off.  \n\nYou need to establish firm boundaries and consequences for breaking them, then follow thru with the consequences.  It might get ugly, but you and DH are the parents and baby needs to bond with you guys, not MIL.  MIL needs to go home and stay there.",
            "I had this issue with my in-laws.  They felt during their visits they should hold the baby 100% of the time.   I spoke with my husband is a manner of the baby's needs over, your parents are driving me crazy.   Newborns need to bond with their parents so when baby cries please return them so that bond can grow.  Grandparents bond is important but the parents is more important.  Parent rules need to be followed.  Grandparents hard their turn to be parents, a grandma's role is different.   You can explain to your husband the needs of the baby and how you need to be there for baby.  Spare his mother's feelings.  Yet get your way",
            "I would find a calm time and neutral place to talk I.e. if you can maybe meet for coffee for a half hour while your spouse watches the baby and just say something like “I don’t want you to feel I’m pushing you away from the baby, but she just has colic and calms down better if I hold her. She did live inside me for 9 months after all, of course she’s more familiar with me.” and then address the kissing on the lips and say it’s not something you are used to, or say that you’re concerned about transmission of colds and flu, could even say “what with all those anti vax wackos out there, you never know what you’re exposed to.”  (Also here to say I have had HSV 1 from childhood due most likely to a family member who carried it for what it’s worth) \n\nIf she gets over emotional after that ... tell her thanks but her help is no longer needed.",
            "That's rough.  If you're the stay at-home parent, then you're the boss of that household.  Everyone (including your husband) needs to appreciate that you're the leader, and respect your wishes and boundaries.   Do your best to be strict on this.  Also, let your baby cry a little. My oldest niece is a clever manipulating girl because, being the first child, she was coddled too much.  Congrats on the baby by the way!  I'm gay too, and wondering if and how parenting will work out.",
            "Can I suggest the book Where to Draw the Line by Anne Katherine to help you set and enforce some reasonable boundaries? \n\nI think it would sound something like \"MIL, it seems like right now being here is upsetting you, and I can't split my attention between you and the baby. Why don't you go home and we can try again another day.\" \n\nThe more you do it the easier it will be. \n\nYou need a similar line for kissing. \"It seems like you're forgetting or ignoring that I told you I don't want you do to that. We can't have you around if you don't obey the rules we set in place for our children, so you need to go home now.\" \n\nWill it allow you to get what you want with no drama? No. MIL will push back, make a big deal, escalate the emotion, guilt you, whatever. But when she sees she immediately loses access to her grandbaby when she doesn't respect boundaries, she will probably start remembering how to behave. But it will be rocky for a while until you get there. \n\nYou need to fight this battle now, otherwise it will continue happening for other issues, as the baby grows.",
            "> My husband is not backing me up on this because of course it's his mother so now I have to talk to her without causing a rift\n\nNo you don't; and I know you've been told this but it bears repeating: you have a husband problem. If he isn't on the same page with you, and he's dismissing your concerns regarding your shared child that you're raising for the most part, **that's unaceptable**.\n\nI'm not going to tell you to divorce him over this, but you should be made aware that this is where things are headed. It would be wise if he was made aware of how grave this situation is, and that a rift in your marriage is what this is causing.\n\nNo other solution is possible here, I'm sorry. You trying to solve things with your in laws by yourself will in some ways just reinforce the problems that will end up destroying your marriage.",
            "Of course it’s always difficult to approach sensitive people about sensitive subjects. But maybe you and your husband and MIL and SIL need to have a family meeting. Lay out your ground rules and if they cannot follow them, they will need to call to visit on your terms. This would be a great time to tell them that they will still be, after her parents, the most important people in her life.",
            "If MIL can’t respect the rules of your house and isn’t actually helping I’d tell my partner she has to leave. You’re the one at home and it doesn’t sound like she’s actually helping just adding to the stress. \n\nFamily constantly wants to comes over to see baby but sometimes they just want to play with the baby. That’s fine but they have to acknowledge sometimes you won’t want to see them if they can’t actually help. People don’t like that boundaries change once babies come here but new baby means new rules.",
            "Maybe suggest your husbands mother accompanies him to work and \"helps\" all day to understand how \"helpful\" it really is when someone doesn't do things the way you need them done and then is emotional when you correct them. \n\nThat's slightly passive aggressive and probably won't help in the slightest... however I feel your frustration and everyone else has given fabulous advice.",
            "Everyone pitched in on the MIL advice it seems. I just wanted to say, every baby I've known to be colicky has been that way because of a problem with their formula or breastmilk. Try switching to a different formula or if you are sourcing breastmilk from a bank, etc, try something else. She may be having an allergy or intolerance in her food.",
            "This sounds oh too familiar. No real advice but stand your ground. This is your baby and you and your husband make the decisions. Not anyone else. If she doesn’t want to take a stand then hopefully he supports the one you make. Good luck.",
            "I want to send you hugs! Colic is such a hard thing to go through. When my nephew had it as an infant the whole family was stressed and it was really hard. Hope baby feels better soon.",
            "Sorry if this has been said but as for the colic, give a dairy free formula a shot. Possibly even soy free as well.",
            "Similar thing happened to me. My family was singling out my son and not giving him equal attention and just being plain assholes to him. I wasn't seeing it. After my wife told me and gave me examples, then the blindfold came off. Do what's best for your son. You're his parent.",
            "Uh! I agree your partner should say something. This is a beautiful time in your life together that y’all should be sharing without added family stress. \n\nAlso, her not being present during this time is not hurting her relationship with her granddaughter. I lived 12 hours away from my parents for the first 3 years of my son’s life. It has not harmed my son and my parents relationship at all, he thinks they hung the moon.",
            "NTA. You are her parent, she is the grandparent. Your daughter is SUPPOSED to like you better. She is overstepping and your partner needs to gat over his who \"be greatful\" thing and support you. You are her primary carer, and he needs to support what you are saying in regards to what is best for your daughter.",
            "You are the SAHD. You need bonding time and not this stress. You are her primary care giver and parent, of course she will prefer you! For her to think otherwise is just being bratty. \n\nThey have waaaay worn out their welcome, And it’s time for them to go.  I would be putting my foot down big time with my SO. Please know you are doing a great job!",
            "His allegiance should be to you. I think it's his place to put his family in their place. There is no way I could handle In-laws staying in my home, especially during this time of bonding for your family.\n\nI wish you the best.",
            "I am in the same boat, my Mil has lived with us before our child was born, I know the stress and the pain that goes with it. My mil is wonderful but I cannot talk to her like it was my mum. It is a very fragile relationship. It also get frustrating when you have an opinion but it feels like it is always 2 against 1. Anyways.. here is how I handle similar situations \n\nUse fact - stress the point that your child has a low immune system and kissing anywhere on the face and head can risk the baby getting sick. \n\nTell this to your husband and that he needs to introduce the idea to his mil. It really needs to come from him.\n\nUse the sandwich technique if you have to (positive/negative/ positive e.g.. I love it how our baby has family that love him. But I read x article and it suggests not to kiss anywhere around the face or head. Perhaps we can suggest to your mum and sister about other ways of showing affection. \n\nOr show him the articles (Google will show you an array). Make it his idea that he doesn't want anyone kissing the baby. \n\nWith the crying part. At the time of it occurring you will have to say something. Again use the sandwich technique e.g. thanks for your help, I am so grateful. I WILL take the baby as I know she just needs me. I will make sure to hand over the babe for special nanna cuddles once she is settled.",
            "Your husband is seriously failing you right now. It is very difficult to be a stay at home parent, especially with a high needs infant. He is, at best, ignorantly assuming what you need/want while you are home all day with a screaming baby. At worst, he is blatantly ignoring what you need/want because he doesn't want to deal with his mommy. In either case, this an issue with your partner that you need to resolve asap. \n\nTell him that you desperately need him to help you, to back you up, to be on your team, and to listen to what you actually need right now. Then lay down some very concrete boundaries that he needs to convey to his mother. It's up to YOU to figure out what those are. Do you need a complete break from mil for a few weeks? Do you need to allow visits only when your husband is home? Do you want her to come over for a few hours once a week? Remember that she is not entitled to your time, your home, or your baby.\n\nIt's not difficult for your husband to tell his mom \"Hey we really appreciate all your help so far. For now, we're going to hunker down as a family for a few weeks to get through this colic stage. We'll let you know when we're up for company again.\"",
            "Hey, congrats on your baby! That's exciting! That being said, I think it's okay to sit down with your MIL and explain what \"attachment bonding\" is. Your baby knows YOU. Your baby loves YOU most. Your baby needs YOU for comfort. That is how babies work. You have every right to want to hold her when she's upset, because that's how bonding works, and it's a crucial process between caregiver and child. She went through this process with her own children. It's possible that she just wants to go through it again. Totally normal to want to snuggle the hell out of a baby. Just not okay right now because you have a sick, fussy baby in need of comfort. \n\nIt's your house, man, and your baby. She needs to respect boundaries or leave. That includes not kissing your colicky, newborn baby on the lips. Your husband may or may not back you up, but this won't be the first or last time you'll need to lay down the law regarding how people treat you or your baby girl. I have the sweetest dog in the world, and she loves babies, but my sister didn't want my dog near her newborn, and that was fine by me because it's important that she know I respect her decisions as a mama. That's a level of respect you deserve, too, as a new papa.  \n\nJust FYI, though, colicky babies can be pretty traumatic for the parents. We are trained to respond to crying babies AS SOON AS FREAKING POSSIBLE and not being able to fix the problem for the baby can be very stressful. Take care of yourself, manage your stress, and if you need a break, take one - a colicky baby will likely be as fussy today as it was tomorrow, until one day, for no fucking reason that any of us can discern, it gets magically better. \n\nGood luck!",
            "It's time to get your MIL out of there so you can raise your baby. Why does she need to sleep over? Talk to your husband.",
            "I(we) sincerely appreciate all the help you have given but we really feel as though this is a integral time to bond with the baby. We also want to fully experience being new parents as much as possible. If I need any advice, I'll call or text but we would really appreciate some space right now.  (I would set aside Sunday dinner or something for them to visit and have family time. Hopefully your hubs can be there.)\n\nThe next time someone kisses baby on lips: please do not do that. The baby's immune system is not fully developed and cannot handle many common germs that do no harm to those who have a fully developed immune system. I appreciate the sentiment and the love, but please avoid mouth to mouth kisses right now. \n\nYou will have to advocate for your child even when it's uncomfortable for you or no one will help, all through her life. Get used to it. You're her protector, it's your job. Your husband should back you up, always. If he doesn't, talk to him and try to work through a compromise. Speak the truth, even when your voice shakes. Best of luck, Papa Bear.",
            "Wear your baby when MIL is over. Show your husband this thread to get him on side.",
            "You can un-invite guests into your home at any point. It should be even more understandable if you're caring for a newborn.\n\nYou should of course be as polite as possible, but it's not your responsibility to manage other people's feelings.\n\nI agree this message would be best delivered by the blood relative, in this case your partner. I hope he comes around.",
            "Omg I hate when people kiss babies that aren't theirs!!!",
            "At the very least, they need to understand that kissing baby on the lips can be life threatening. Do research, but I remember reading about a case where a baby contracted a cold sore and almost or did die. It's very serious, plus whytf they don't respect you?",
            "As far as the kissing on the mouth or face thing goes. Gather images and information about Herpes Simplex 1 and show your husband, SIL, and MIL.",
            "I never experienced colic with my three kids but my sister has. I wanted to offer some tips for you to try such as Gripe water, special formulas made just for colic also and there's this crazy position I've heard works wonders for fussy babies. I believe it's still on YouTube but my daughter who had a lot of stomach troubles loved it. I have to comment on the kissing of the lips of babies. I myself did it but as a mother I thought nothing of it. It's my child and a baby I adore. That's just how I saw it and plus I was the mother. I didn't like anyone else doing that though and as they got older I didn't do it. Anyone who sexualizes a peck kiss to a child is the perv though. But if it makes you uncomfortable that's understandable and it's your right to tell them not to kiss your child on the lips. Your situation sounds stressful enough being new dad's and the added in law stress isn't helping. Raising a baby isn't a picnic by any means but all those fussy sleepless nights are very much well worth it! I hope it gets easier for you both.",
            "First of all congratulations on becoming parents and welcome to the club. It's going to be a hell of a ride. :)\n\n&#x200B;\n\nSecond everyone here who said this is your husband's problem is right. It is HIS responsibility to set boundaries with his mother, and he needs to stand up for his family and prioritize you and his daughter over his mother. As someone with a sometimes overbearing and difficult mother, I know how hard that can be, but he HAS to do it. MIL probably has a bit of a \"women are better at taking care of babies\" thing going on in her head, but it needs to stop, and your husband needs to be the one to do it.",
            "Leave your husband out of it and talk to her kindly but firmly;  MIL, I really appreciate your excitement over your new granddaughter.  But I have to tell you that our pediatrician says no kissing the baby by ANYONE anywhere on her face and hands until her immune system is more mature.  She also says all people around the baby must have their whooping cough booster vaccinations.  (This might only apply to older people than you and your husband, check on this before talking to her.)\n\nI hope you can understand that this is the situation.  It is not meant to interfere with her bond to you as she gets older.  Please don't feel offended, but this is necessary.  \n\nAt a later time, tell her you consulted the pediatrician about the colic, and she gave you instructions on helping the baby calm down.  It's important for you, her primary caregiver, to be the one calming the baby.   Thank her sincerely for her help, but don't get dragged into a debate about it. If she takes offense, rock the classic \"I'm sorry you feel that way, the last thing I want is to offend you. But I need to do this myself.  I'm sure you can understand that.\"\n\nThen do things that include her in, like posting pics with grandma and baby on social media, giving her kudos.  Ask her about what her son was like as a baby.  Deflect her by asking about her life.  But hold firm on your position.\n\n\n\nTaking control kindly but firmly now will  become a habit, because you'll need it with people without boundaries.",
            "Sounds all too familiar with what I have recently went through with my own mil. I kept asking my husband to talk with his mom about invading my boundaries as a first time mother. He did not follow through with a talk with her and shit hit the fan. The tension continued to buildup resulting in a huge verbal argument. I’m secretly happy it happened because I felt as though I needed to stick up for myself and let her know I was not going to be bullied into doing things her way. Unfortunately things are not back to normal yet but it needed to happen so she knew my boundaries needed to be respected. \nGood luck and I hope things work out better for you.",
            "As a stay at home parent I know this is hard for him to swallow, but this is your JOB. Whatever it is that he does, I’m sure you wouldn’t second guess him. You’re trying to tell him that with every bit of knowledge you’ve gained during an INTENSIVE 6 week parenting crash course, you know what’s best and that is NOT your mother in law putting your baby in an uncomfortable position just to make herself feel better. You have the authority right now!!!",
            "Just be honest. It's your kid, NOT THEIRS. If it causes a rift, so be it. They need to let you be a mother and learn their place. It's bullshit when people think they can do whatever they want. Especially the kissing on the lips thing that they refuse to respect. Sometimes you need to be hard on people or they don't change. \nMy way or the highway. \nGood luck.",
            "I was and am the same with our child. A few moments of him being upset and I just politely take him back, we didnt and dont do cry it out either aside from tantrums. He was exclusive breastfed which made It easier as a little baby to do, and it's just continued. My husband doesnt necessarily always agree with me, but weve talked and he understands my veiw and supports me. Talk to your partner",
            "Firstly congratulations on becoming a Dad ❤\n\nYou could also try googling the 4th trimester and have your hubby and maybe even MIL and SIL read up on this. This is a HUGE time of transition for your bub learning how to function outside the womb. Things can easily become overwhelming for her. She is still figuring out and bonding with her parents, everyone else needs to respect that and give you all some space.\n\nHopefully you'll be able to get Hubby on board at least. Wishing you all the best.",
            "Just to play devils advocate. Do you correct MIL over many things to do with the baby? Does she feel like a failure unless it’s just doing the washing, tidying etc. If she feels criticised she might be on the defensive as soon as the day starts? \nThe kissing thing....I don’t kiss my own baby on the lips, they don’t kiss back like little tots so I find it a bit odd. I kiss my baby all over! In saying this, kissing a baby usually doesn’t do much harm unless they’re ill or have cold sores. In these cases they shouldn’t kiss her at all!!",
            "You and your husband need to present a united front, I get that MIL maybe thought that she would never have grandchildren  from her son etc etc and wants to be all up in the baby's face but she needs to respect that you and husband are the parents not her, of course daughter wants her dads before she wants a mostly unfamiliar person. Perhaps get MIL involved by asking for general baby advice (even if you don't need it) to reassure her she is valued",
            "Sometimes you can not solve problems like this without a rift. You do not have control over anyone else’s feelings. \n\nYour partner needs to back you up. This is the real issue. Maybe you take a day off or two while he is there with his mom. Allow him to experience what’s going on. \n\nKissing babies on the mouth is an issue due to germs and bacteria. Your newborn has no immune system and can’t handle what’s in another persons mouth. MIL needs to be reassured she will have a relationship with her grandkid and right now is not the time to bond with people outside main care takers. She has literal years to do this as your child ages. Consider giving directive answers to correct her behavior. “we kiss on top of the head, thank you!” “When she is crying like I wear her in the carrier please hand her over.” “We have guests over in the mornings only when we are all fresh and calm for right now.”",
            "The baby is 6 weeks old now and it is time for MIL to back off.  Thank her nicely for all of her help and tell her that now you got this.  She can return to her usual life and activities.  You will call her if you need her.  At the same time invite her to come over for dinner on the weekend.  This will convey your parameters for how often she is going to be seeing baby.",
            "maybe you will find my own story useful.\n\nmy MIL came to live with us to help with the newborn. turns out, she's horrible at it and was actually hurting our son's development. my wife finally agreed MIL needed to leave so we sent her back. it's been half a year but i think my wife is still harboring resentment towards me that is getting worse. like, she cannot accept that her mom was such a bad caretaker and instead blames me for driving a rift between her and her parents, even though at the worst point (when we sent MIL back), she agreed that it was best for the baby and for us.\n\nso that's what i'm currently dealing with. and my wife refuses counseling, whether it's for herself or marriage counseling.",
            "New babies are a very exciting but also a very draining and stressful time for families. Most of all for you, her parents, but also for grandparents - especially if it is a first grandchild. It sounds like your mother in law is well-intentioned but you're having trouble communicating your needs and boundaries to her effectively. If your husband refuses to speak with her one on one, insist that he join you for a conversation with her, and explain to him that your mother in law will probably be LESS hurt and rejected hearing it explained by her son than her son-in-law.   \n\n\nOn a practical level, it sounds like it's time for mother in law to go home. Once she's home, or maybe before she leaves, plan a visit when she can come over and have uninterrupted time with the baby, holding her and cooing and generally showering her with love. Even if baby is crying, let grandma have her time with baby - baby will be okay crying for a few minutes. If you think you can offer grandma some pointers to help her soothe baby, that might be helpful, or perhaps suggesting a book she can read to help her learn soothing techniques, like Happiest Baby On the Block.   \n\n\nFinally, you mentioned a \"disgusting\" habit of grandma kissing baby on the mouth. Although I can understand why you might find this unsavory, it's quite common in many families and cultures. If you can, I suggest letting that one go; if it is a real concern for you in terms of spreading germs or you just can't stomach it, I would be very careful in explaining to her that you don't want her to do that, offer her an alternative (eskimo kisses? kissing baby's face?) and do not bring it up in the same conversation as the issues with grandma soothing baby or grandma moving home.   \n\n\nAbove all else - try to be patient with yourself and with her. This is a hard time, and tempers run thin; but if she is generally a supportive and loving mother in law and grandmother, remind yourself that this difficult time will soon be behind you as baby becomes more settled. The wonderful relationship that can exist between grandparents and grandchildren is certainly worth the effort of keeping things civil now.",
            "Do not let people kiss your baby on the lips. Many adults have cold sores (herpes) and this is exactly how babies get it.",
            "If you have a problem with a grandmother kissing her granddaughter on the lips, then I would politely suggest that you have a problem with boundaries, not her.",
            "I didn't see anyone bring this up, so OP please know that this gross habit can give your baby cavities! Babies are not born with cavity-causing bacteria and they have to pick them up from an adult! Totally reasonable to defend your boundaries here.",
            "I really hate when people don’t listen to parents’s worries and needs. You need to speak up more. And tell them straight forward that “ no kissing my baby on the mouth, you can on her cheeks but that’s it” and also when the child is crying “give her to me “!!!! Point blank and make sure every word is said perfectly.",
            "It's poor hygiene for a baby with little to no immune system \n\nList some things you are happy for help with but that you will handle the crying  situations.  \nThat it's not you stomping on her feelings it's you wanting to comfort your daught you never get these precious hours back and absolutely no kissing on the lips this was advised by midwife or healthcare professional.",
            ">My husband is not backing me up on this because of course it's his mother \n\nThis comes up soooooo often on r/JUSTNOMIL. The husband is so accustomed to being a \"good son\" and letting MIL run the show, that it doesn't seem to compute when that comes into conflict with being a good father, or being a good husband. (It can definitely happen with daughters of overbearing mothers as well, but that isn't the scenario here.) And unfortunately when you have a MIL with baby rabies that often brings the three roles into sharp conflict. \n\nYour husband needs to realize that he is a father first, and that it is his job to prioritize his baby's **needs** over his mother's emotional **wants**. If your husband trusted you enough to have a child with you, he needs to trust you to advocate for that child even when it means he might need to have a difficult conversation with his mother.",
            "In laws don’t listen worth a fuck",
            "Go take a walk or go to the store while she is there. Or take a nap. Trying to control stuff leads to frustration and exhaustion.",
            "My dad kissed my niece on the lips at 2 years old. It looked like he was a pedifile. My family did a lot of kissing when we were young. It was terrible. We were isolated and I didn't kiss a girl till I was 20. \n\nIf the baby cries against your in laws something is very wrong with them. The baby knows. \n\nIf you're mother in law is actually living in the apartment, you've got to get her to change her attitude towards the baby. It's too bad that she's got her own idea of who the baby is. You might not get through to her. \n\nIn my experience babies can sense when a person has low self esteem or is feeling adult issues with themselves. Babies don't like that and cry or frown when they see it. We were born being able to read emotions. \n\nI wish you could have more independence. \n\nA counselor might help in this situation to help you and the mil express your situation in an overseen situation. Don't bring your husband but bring the baby. \n\nThat's what I think. \n\nIt looks like the mil cares more about her image as a gm rather than respecting your boundaries as the m and most important figure in that babies life. That's not the relationship gm is supposed to have with the baby. Especially if their kissing it too much. Stimulation is bad for babies I think too. They need calm cause their learning and trying to make sense of what is night and what is day.\n\nTell your husband he is more your husband than his mother's son.",
            "I think calling kissing babies on the lips within your own family a \"disgusting habit\" is overreacting. It's totally understandable to limit this if your MIL or SIL have any communicable diseases, but I don't see what the big deal is if that's not the case. It might make you cringe, but is it worth fighting over?\n\n&#x200B;\n\nEDIT: turns out it's not good for babies. I had no idea! Share the info with your MIL and SIL!",
            "I went through this with my mil. She wanted to help by babysitting so I could clean or run errands. This stressed me out because I don’t want to be away from my baby and my baby doesn’t want to be away from me. I am perfectly capable of watching my baby, ordering groceries or takeout, and cooking or cleaning while baby naps. It also bugged me because she wouldn’t just say she wanted visits with baby, which I would have accommodated, but insisted on acting like it was helpful to insist on being in my space all the time. It wasn’t! \n\nIt’s only help if you want it, otherwise it’s “hlep.” Your mil and sil only want to feed their baby rabies and they’re justifying it to themselves and your husband by calling it help. Explain to him how it makes you feel and how it affects your baby. Explain that their motives don’t matter—in other words, well intentioned or not, the fact is that their presence isn’t helpful and it needs to be addressed. Your husband needs to set boundaries with them that you’re comfortable with. Aim for a certain amount of visits per week or month at times that are convenient for you and baby and put a stop to the cohabitation and babysitting. As the primary caregiver I think it is fine to insist on a level of interaction that works for you. Your husband doesn’t just get to decide that his mother gets to coparent with you because he’s decided it’s helpful. Good luck.",
            "Kissing a baby isn't a disgusting habit...",
            "I scrolled to see if anyone else had suggested it yet, but I don't see it so you should take this over to r/justnomil. They are lovely people and will be able to help you talk to your husband as well as set boundaries with your MIL in the future. Bottom line is though as others have said, you have a husband problem and you need to get him on board before you confront the MIL. Good luck, OP.",
            "Oh OP, I’m sooo sorry. My second was colicky and it was... something. Possibly the worst 3 months of my life. I was in full-on survival mode, and has zero patience for any shit that didn’t involve making sure my kids were adequately taken care of. I remember being so tired and out of it that if you asked me a question that I didn’t already have an answer to, my brain would just freeze and I couldn’t form an intelligent thought. Right now the focus needs to be on getting through the next couple of months without killing each other. Since you’re the one at home and doing the bulk of baby care, making your life easier should be your partner’s main concern, not making sure his family feels involved. Who cares if the laundry falls behind, if there are a few extra dishes in the sink. You have a newborn! It’s normal for chores to take a backseat, it’s all part of the adjustment period. I get the feeling that your partner might feel bad that he isn’t able to share the load equally (which is normal in a dynamic where one spouse works), so his solution is to have his mother do his “half” and then he feels like he’s contributing. I’m a SAHM. Would it be “helpful” for someone to come in and do all the laundry? Sure... in a matter of speaking. Personally I would rather do the laundry myself if it means not having someone in my feet, involving themselves in the way I choose to raise my kids. It may seem like I’m “just at home anyway”, so anyone should get to drop in whenever they like, but that’s not the case. That’s still MY time, and I get to decide how I want to spend it. And i definitely don’t want to spend it entertaining my husband’s family. Tell your partner that you want to figure it out on your own and that it’s stressing you out to have them over all the time without him there. He can either tell them to back off, or you can tell them, but they’ll probably take it better from him.",
            "Shit, cause that rift!",
            "You should Google “Baby dies from Kiss” and show that to your partner. I’m not saying that your MIL or SIL have any communicable diseases but babies do not have the same immunities built up as an adult does so the mouth kisses should be a huge NO!",
            "You can have your family read this:\nI'm a first time mom to a now 16 month old who had awful colic. Had. She grew out of it. But during that time she was extra and in need of TLC. \nYou look at this child the same way you would a vunerable adult; they need you to care for them the way they need comfort- not how the other (grown) person wants to care for them. It's not their job to make you feel good about yourself, it's your (and their job) to meet that kid's needs. With colic, it's a special formula, end of story. Respecting that shows respect for that human, regardless of anything else. \n\nThe rift is okay, believe me. My MIL can say whatever about me and who ever is dumb enough to believe it was never going to see my side anyways. My job is to protect my child, and I know you're reaching out because you know it's your and your husband's job too. This is all said with love, and with the knowledge that you can do it.",
            "You may want to check out r/justnoSO and r/justnoMIL",
            "Have you considered that there may be some cultural differences at play in how you and your in laws do things like show affection?",
            "Well watch out what you wish for...At six weeks I don't think you have a life long issue.\n\nbut training the child to allow some separation with comfort is a life skill. I had both a niece and nephew that couldn't be out of sight of their parents and it was a problem. Both have turned out fine but I would trace it back to childhood without ever being comfortable without the close contact with their parent. \n\nCrying while being held by you grandmother my be disturbing (to you) in the short run but having a child cling to you until they are 8 years old is worse.",
            "Get sassy, answer the door and tell them hubby isn’t here and come back later when he is. \nPlan outings. Take your daughter out and tell them to gtfo of your home. \nThis isn’t good. Your partner needs to handle his family. \n\nAlso, CONGRATULATIONS !!!",
            "I always kissed my own children on the lips. But someone elses even a close friend or family member seems gross",
            "Awkward conversation to have with yourself",
            "I'm I the only one thinking your not being fair either, your mil has brought up her own children n as your married to her son I'm guessing you think she did an OK job of it. I get your her daddy and you feel like you know best but the truth if the matter is she doesn't know your her daddy, or that your husband is either at this age there eye sight is only just starting to be able to see in colour and still can only really see about 6 inches away from her face. I can understand how your mil will be filling if at the first sign of your daughter crying you step in. Plus your making a rid for your own back by doing this as it will get to t he stage where your mil withdraws her help altogether if you keep stepping in and taking your daughter away from her. I'm a qualified nursery nurse/early years practitioner and a mum of 4 and step mum of 2 so do have a lil insight into children n parenting. You sound an amazing attentive daddy and your daughter is lucky to have so many people in her life who love her and want to be part of her life. Give your mil time alone with your daughter even if you feel like your right arms been cut off without her being close, in the long run it helps for her to develop a strong bond with other adults so that she grows up a well round young lady with self confidence.\n\nI also don't agree with the kissing thing as well. You'll be surprised just how strong a 6 week old baby's immune system is even though we all think it's very poor plus I'm a great believe in if you protect your children from ever thing that can have germs/bacteria on you are actually stopping there immune system from developing as it's never had to fight off any. Plus give her time and everything she can get her hands on will end up in her mouth and you can't spend the rest of your life anti=bacing everything within an inch if it's life just in case it may have germs on. I'm guessing this precious little princess is your first child, please try and relax a little and enjoy these moments as all to soon she won't be a little baby any more.\n\nWhy don't you try one morning/afternoon a week leaving your daughter with her grandma and go and enjoy so you time. It will do everyone the world of good. Sorry if people don't like my opinion but I stand by it. Hope you get everything sorted out soon whichever advise you take x",
            "I wonder, does the baby cry when her father comforts her and do you take her away from him when she does?\n\nMy mother was a big help for my first born and taught us a lot about infants. Maybe you can learn from her. He will need to get comfortable and bond with his caregivers now. \n\nHe was a difficult baby until about 3 months. I had to grin and bear it when my son cried because he did not feel comfortable. My wife would consistantly take him away from me until I said he has to get used to me too. We endured the crying. Maybe this is what needs to happen too.",
            "Grow a set and tell her to hit the goddamn road. Its your kid.",
            "How about grow a backbone?",
            "At this point the non rift option is gone. You have already given your husband a chance to fix the problem, he declined the to take the high road. Now because if his inability to support you as a mother, your the one who has to deal with his mother. Now the issue will breed distant, frustration and contempt between all of you.\n\nFlat out I would sit them down and tell both him and her that, you are the mother not her. You expect her to respect your authority and heed your wishes. There is no other options and there will not be a discussion. You will not politely ask agin. If she can't or won't abide your expectations  she needs to go. \nI Would also let my husband know that you are disappointed in his reluctance to support you as a  mother and you feel abandoned as his partner. \n\nRemember a well spoken person never speaks out of turn. Don't rush into a fight unprepared. Have your thoughts and emotions collected and in check. When You go to them with this issue speak clearly, concise and unwavering. \n\nWhat your asking is not unrealistic or malicious. \nYou need to set extremely clear foundation for the boundaries regarding your child. It seems like both of them need to be reminded that you will not to be fucked with, ignored or railroaded. You are absolute, steadfast and will do what is right for your baby even at the cost of hurt feeling.",
            "Baby colic  try getting baby dophilus at either a health food store or a better grocery store, it usually clears up the problem very quickly.",
            "You're a new mom. Please don't feel uncomfortable telling all of them you don't want any more help. Thank you, but it is causing me and the squish way too much stress. Love y'all, I will call you when we're up for company. Bye bye"
        ]
    },
    {
        "post_id": "4zo0cs",
        "author": "exgirlonthephone",
        "title": "My (26/F) boyfriend (28/M) has become suspiciously close to a model (26/F) he photographs, and has a practically naked photo of her as the wallpaper on his phone.",
        "url": "https://www.reddit.com/r/relationships/comments/4zo0cs/my_26f_boyfriend_28m_has_become_suspiciously/",
        "score": 2871,
        "num_comments": 400,
        "created_utc": 1472208965.0,
        "selftext": "Throwaway account because my boyfriend is an avid redditor. \n\nHe's a fashion photographer. Meaning he works alongside many beautiful women in his profession. Stylists, hair and makeup artists, and of course, *models*. \n\nThis is actually how we met. \n\nI modeled my way through college and he photographed me, after which we became friends and eventually started dating. We have been together now for almost three years. I've since stopped modeling, but he is still a photographer. Never once in our relationship has he given me any reason to question his fidelity. With the exception of me, he has never dated or even befriended any of the models he has photographed. \n\nThat was, until, Rachel came into the picture. \n\nI've met Rachel. She seems like a fun chick, the type of girl who draws a lot of positive attention just by entering a room. She's beautiful but her personality really shines through. She makes you feel like you're her best friend when you're talking to her. A very *cool* person through and through. \n\nThat said, I'm not the only one who feels this way. My boyfriend also adores Rachel. The first time he photographed her, he stayed late at the studio and discussed ideas for their next shoot for nearly three hours. He was actually late for a night out with me because of it, but he's always had terrible time management so I didn't think anything of it. \n\nThe lateness has now become a steady, recurring factor in their shoots together. They hang out long after the stylists and makeup artists leave the studio. \n\nThey also text a lot, and he's always smiling to himself and laughing when he reads the messages she sends him. At first he would show them to me and try to include me in on all the fun (without me asking) but he abruptly stopped doing that around two weeks ago. He tilts his phone away from me now when Rachel messages him. \n\nI'm not the jealous type but if my bf had a history of doing this with the other models, I'd let it slide. The fact that he is *only* like this with Rachel (and me, I suppose) makes me wary of what might have transpired between them. \n\nRachel herself has stopped talking to me. We used to communicate and have an easy, casual friendship via IG and Snap chat, but she pretty much ignores me now. Guilty conscience? I don't know. \n\nThe real kicker is, my boyfriend now has a photo of Rachel as the wallpaper on his phone. He's apparently proud of the concept and the editing, and claims it has nothing to do with Rachel herself, which is totally believable, but ... doesn't sit right with me. I told him that and he told me I was being irrational. \n\nRachel is single by the way. She and her bf broke up around three weeks ago, so you be the judge. \n\nI really don't want to fall into the jealous gf trope but what else am I to think? I don't want to make crazy demands and accuse my bf of cheating on me, even emotionally but he really does seem to be fond of this girl in a way that really hurts me. He has other female friends and he doesn't act that way with them. He's capable of being friendly with a girl without flirting or acting suspicious, but with Rachel it's different. \n\nHe has slowly become very attached to her and I feel like I'm losing him. I have expressed this to him a couple of times but he always tells me I have nothing to worry about and that he and Rachel are just \"kindred\" when it comes to photography. The long nights, constant texting, and phone wallpaper mean nothing. Oh btw, she's practically naked in the photo and it wasn't taken for any sort of publication; just for fun. \n\nAm I being irrational? Unreasonable? How would you feel in this situation? What would you do? \n\nTL;DR - photographer bf has been growing very close to one of his models and acting dismissive of my concerns regarding their work relationship. He has a practically naked photo of her as his phone wallpaper. Wtf am I supposed to think? \n\n**mini update:** He and I are meeting for lunch in an hour.\n\n**extra mini update:** He confessed. More on that later. \n\n**micro teacup update:** I'll give you guys the full story as soon as this post is kicked off the front page. Correct me if I'm wrong. I don't think we're allowed to post updates until the dust has settled on the original. \n\nIn any case, thank you so much for all the advice and overwhelming kindness. I'm kind of a mess right now but I'm lucky enough to have an amazing support system and a clear head. That's all I really wanted out of this unfortunate situation. \n\n\n**OFFICIAL UPDATE:** \n [Original Post](https://www.reddit.com/r/relationships/comments/4zo0cs/my_26f_boyfriend_28m_has_become_suspiciously/)\n\nFirst of all, I’d like to thank everyone who left a comment on the original post. Your advice, your words of encouragement and support, and even your criticism has helped me immensely. Thanks. Really. \n\nSecond, I’d like to address a few things: \n\n1. My boyfriend — sorry, ex boyfriend — has never taken nude or even partially nude photos of me. Although I modelled in high school and university, my primary focus has always been stage acting. He took my head shots. That’s how we met. Not that it really changes anything. Just a bit of insight, I guess. \n\n2. When we were younger and when the relationship was newer, I would accompany him to his shoots all the time. But my own career is very time consuming nowadays. I know of multiple model/photographer relationships where they accompany each other to every shoot, and I’ve nothing against doing that, but I personally would rather just trust that my SO is on their best behaviour. Obviously what happened here kind of squashes that … but I stand by it. If I have to be there in order to make sure my SO faithful, chances are they’ll find other ways to cheat.\n\n3. I’m flattered by the offers, but no, I will not be meeting anyone for drinks anywhere. Sorry for the bluntness, just … yeah.\n\nOkay, now for the good stuff! … or I guess, the bad stuff. \n\nI met him for lunch Friday afternoon. We went to our favourite sushi joint overlooking the ocean, and I ordered more than I could handle, stuffing my face while trying to decide how to broach the topic of Rachel, but most importantly, our relationship. I went into that meeting with a righteous, ass-kicking speech prepared, but I forgot every word of it almost immediately after we sat down. I guess he could tell there was something on my mind, because he asked me if I was alright, if he had done anything to upset me. *Snorts.* Yes, Ian, you’ve upset me very much, actually. As soon as I gathered the confidence to look him in the eyes, I point blank asked him, “What’s going on between you and Rachel?” His mouth flew open as if he were completely and utterly taken aback by the implication, but I cut him off with, “DO NOT bullshit me.” \n\nI tried my best not to let anger get the best of me, I really did. I wanted to stay cool, calm, and collected like so many women on this sub. You know the ones. Those intense stories of cheating husbands wherein the wife takes to /r/relationships, garners a ton of support, and then updates us later with a well-constructed, storybook post detailing the evidence she has collected against him and the meeting she had with her Uncle or sibling, who just so happens to be a divorce lawyer … ? \n\nYeah, I’m not a badass like that. I wish I were, but I’m honestly just an overly emotional doormat and I knew going into this meeting that I was either going to cry or gouge his eyes out with my mind. Because I had somewhere to be later, I took a hard left and got super, SUPER angry.\n\nHe could see it in me, the anger bubbling over. The people in the restaurant were starting to stare at us, too. In order to save face I threw money on the table (with tip) and told him to meet me in the parking lot. If I’d had a switchblade on me, I can’t say for certain I wouldn’t have channeled my inner Jet and beat his Shark ass to the pavement.\n\nKidding. Totally kidding.  \n\nWe met inside my car. He climbed in after me, his head down as though he were ashamed or … I don’t know, GUILTY?!?!?!?!?!\n\nI asked him *how*, and he explained everything to me. No preamble whatsoever. \n\nThe moment he met Rachel he felt some type of way towards her. He couldn’t tell whether it was just a silly crush or something more, but he knew she felt it, too. *How cuuuuuuute*. \n\n**BARF.**\n\nThey kissed the first night they met. The night he nearly stood me up. \n\nThey had CRAZY, **emotional**, *~forbidden* sex the night she and her boyfriend called it quits.\n\nAnd they’ve been fucking ever since. \n\nHe mentioned he has always used a condom with her, but I don’t care. I’m getting tested. Oh and because so many people asked in the original post, I figure I should mention Rachel was the one who was broken up with in her previous relationship. I don’t know why or how. I didn’t ask and I don’t care to know.\n\nFunnily enough, Ian said he doesn’t want to be with Rachel, he wants to be with me, and he even provided text messages to show that he’s the one who decided not to pursue anything with her on official grounds, but I told him I give zero fucks about what he wants. And unless he can go w/o his eyes, he should get the fuck out of my car and erase me from his mind before I erase him. \n\nI literally said that.  \n\nIn any case, I went home later that day, posted an update for you guys on the original, and drank. A lot. \n\nMy friends and family, and most of Ian’s friends and family, have rallied around me in support. I guess he told his mother we broke up and how it happened, because she called me this morning and said she’s disgusted with her son and that if I need anything at all, she’s always there for me. \n\nFor real, you guys, I’m going to miss his family. They’re good people. The best people. \n\nThis is my first “adult” breakup, by the way. The type of breakup where you’re required not only to break up with your SO but with their family and friends, as well. These people you’ve spent so much time getting to know and growing to love, are suddenly not in your life anymore and it’s … well, it’s kind of daunting, really. Daunting and sad and infuriating all at the same time.\n\nSo, that’s the conclusion to this story. That’s what happened. \n\nThank you again to everyone. \n\nIf I have anything to add, I’ll do so below.\n\nTL;DR - he admitted to cheating with Rachel and then I dumped his ass.\n\n**note:** To the person who said violence is never the answer and I should never have threatened my ex - *You're right, you are absolutely right, but if you're ever in a situation where your lying, cheating ex refuses to leave your car the first dozen times you asked, I dare you not to lose your shit and say things you don't mean just so he gets the fuck out (and doesn't see you cry).* \n\n**microscopic update:** So far, his mother, his teenaged step-brother, and two male friends of his, have reached out to me saying how disgusted, ashamed and embarrassed they are on his behalf. On top of three mutual friends. It hasn't been two days yet, you guys. \n",
        "permalink": "/r/relationships/comments/4zo0cs/my_26f_boyfriend_28m_has_become_suspiciously/",
        "comments": [
            "So she broke up with her bf 3 weeks ago and yours started hiding messages she was sending him 2 weeks ago? Not to jump to conclusions but that's an interesting timeline. \n\nAlso, having a semi nude pic of someone you're hanging out with as your background when you're with someone else is totally inappropriate no matter how good the editing is.  How would he react if you had a similar picture of one of your male friends as yours?",
            "Yeah, I've watched exactly this play out with a friend who is married to a fashion photographer.\n\nSorry, who *was* married to a fashion photographer, before he \"upgraded\" her to his \"Rachel\"",
            "It sounds like you're so worried about being considered a jealous person that you're not taking any action to something that is incredibly inappropriate. This isn't just something that's in your head... Your boyfriend is basically acting like he's single and your one of his friends whose sat at his whilst it happens.\n\n\nI couldn't give two fucks about if he likes the concept of his photography, that doesn't justify having a girl as his wallpaper when he's actively texting her and acting like a schoolgirl when she texts him.\n\n\nIf this was me I'd be asking for a discussion about what he feels is appropriate and how he'd feel in your shoes. Stop worrying about coming across as 'crazy'. You're well within your right to be questioning nearly all of this...",
            "I think what is telling here is the fact that his behaviour has changed. He's gone from being open with his messages from her, to hiding them. Why the change? I understand that some people like to keep their friends' messages private, but to go from being open to suddenly hiding them is odd.\n\nI think the change in Rachel's behaviour towards you is highly suspicious too. \n\nI'm not really sure where you go from here if he keeps dismissing your feelings when you bring it up. I think maybe I'd ask him outright if something was going on and tell him that I don't want to be cheated on or lied to and that if he was falling for someone else I'd rather that he just left me. Obviously you have to find your own approach. \n",
            "> The long nights, constant texting, and phone wallpaper \n\nPoint out that these things bother you, and *don't* let him tell you, \"you got nothing to worry about, babe\" or \"you're being irrational\". These things are bothering you, regardless of whether he's sticking his dick in her or not, and he should respect you enough to not just dismiss your feelings.\n\nIf you say, \"You're upsetting me with your behaviour,\" he doesn't get to say, \"No I'm not.\"\n\nBut if he continues to walk over your boundaries, you need to have enough self-respect to walk away. ",
            "If my girlfriend had a practically naked photo of some other dude she hangs with as wallpaper, I'd be in rage. \n\nIMO, he's acting at least disrespectful towards you.",
            "Let's just ignore everything to do with her and him for a second and just focus on him and you. He dismisses your feelings and calls you irrational. That's the biggest red flag in your entire post. \n\nWhat would you do for him, if he came to you with this same problem? Would you prioritize his feelings? Make sure he felt that he was your number 1? You might even drop your relationship with the other person just to show that the one you love is your BF. If he can't even do the bare minimum, which is acknowledging your feelings, then don't you think your relationship may be very one sided? \n\nHe may be emotionally or physically cheating, from everything you've said it sounds very likely. But even if he isn't, I just don't think he's a very good partner and I think you should re-evaluate your relationship with him.",
            "[deleted]",
            "> I really don't want to fall into the jealous gf trope \n\nStop being cool with shit you're not cool with. ",
            "[removed]",
            "Time for an exit strategy for you.",
            "So...she and her bf broke up 3 weeks ago.\n\n2 weeks ago your bf started hiding her texts from you.\n\nHe gaslights you and tells you that you're being \"irrational\" for being worried about this.\n\nHe started dating you after you modeled for him.\n\nHonestly, I don't blame you for being suspicious and you're not being unreasonable at all. In fact, I think the most worrying thing is that he jumps to gaslight you and make you feel insane instead of saying \"I'm sorry, I see how it can be misinterpreted, but I promise this is platonic. What (reasonable) things can I do to assuage your fears?\"\n\nTo me, his response shows a distinct lack of respect for your feelings. Even if he wasn't actually cheating, it's awful of him to tell you that you're being irrational and refuse to even hear you out and try to reassure you.\n\nIn the end though, the question is: is this someone you want to be with? Would you be okay with this being the way he behaves when you have concerns about his behavior with another woman? What does that say to you about him? Putting aside the issue of whether or not he cheated (I'm guessing he's absolutely emotionally cheated on you, if not physically), can you live with the fact that your boyfriend reacts to your worries in this manner?",
            "I was seeing a guy for 3 years that was an artist that mostly painted women. He talked to a lot of women that he painted. I was one of them. So when I saw that there was a women that he spent a lot of time with I didn't question her either. I was like you and assumed it didn't mean anything but still had that weird feeling. Turns out that women was his girlfriend the whole time. I never met her nor did he mention her. \n\nI don't know how that helps but I understand how your feeling about questioning it. If you feel like something is up like that gut feeling I would say go with it. Because something isn't right. Don't ignore it like I did. I loved this man and it hurts. Best of wishes to you! ",
            "I'm a photographer. While the phone wallpaper thing isn't unusual in this profession, if it makes you uncomfortable, your boyfriend should respect your wishes and remove the photograph instead of calling you irrational. \n\nFuck the concept and editing, and fuck his \"kindred\" relationship with Rachel. I've never met a decent Rachel in my life btw. Good choice on the name. \n\n",
            ">With the exception of me, he has never dated or even befriended any of the models he has photographed.\n\nAre you sure about this? Are you just taking his word for it?\n\nIf you met through modelling and it to be expected he would be attracted to another model later. He is obviously attracted to her and if Rachel let him, I'm sure an affair would ensue.",
            "Your username is saddening",
            "That's the problem...he dated you, which means he thinks of his models are more than just subject matter...which means that this was always a possibility.  \n\nIt sucks, but you're right, something is going on...or going to happen, soon.",
            "I don't know if this is even relatable, but this reminds me of what happened with my last girlfriend.  We had been good friends for 4 years and started dating. Her fb profile pic was us together at a bar.  A few months into the relationship she started hanging out with a group of guy friends from high school.  \nShe was happy to finally have friends in this town and started spending a lot of time at (we'll call him Gary)'s house. I couldn't go there because they have three cats and I'm allergic.  \nSlowly she started spending more time with them and less time with me until eventually I barely saw her. I confronted her about it several times and every time she assured me it was completely platonic and I had nothing to worry about.  \nThen a party happened that I only heard stories about.  \nEver since that party everything changed, her fb profile pic was her and \"Gary\", her phone background changed from us kissing to her and her new friends and she spent all her free time over there.  \nTwo weeks later we were broken up and she told me a sob story about her undiagnosed PTSD and that she isn't emotionally able to date anyone.  \nOne week later and she's now dating \"Gary\".  \n**TL;DR: Time priorities and display pictures matter.**",
            " If my boyfriend was constantly late for date with me because he was too busy flirting with another girl, I'd be furious. If he was constantly texting another girl in my presence I'd be putting a stop to that real quick.. If he had a photo of another girl who wasn't me or a family member as his background on his phone, he'd be a single man very quickly.\n\n Honestly sweetie, this sounds like the behaviour of someone who is cheating, who wants to cheat or who is going to cheat. You deserve better. Let Rachel have him and find a man who wants you as his wallpaper. ",
            "Sad to see your mini update, sorry OP :(",
            "What is it with guys **always** saying that their SO is irrational in situations like these? I am REALLY pissed that so many men actually say this when being confronted by something as obviously absurd as HAVING ANOTHER GIRL AS YOUR CELL WALLPAPER. \n\nHow many times do you glace at your phone in a day, OP? Be it for time or anything else. Well every time your BF does he gets to see this half nude picture of Rachel. That's just fucking absurd if you ask me. \n\nYou are not being unreasonable or irrational. He is. You deserve better. ",
            "Girl, it's time to snoop. ",
            "You know, there's always posts like these. In my opinion, it never matters if your bf has cheated or not because you can feel his attraction to her and his growing tension and distancing with you. I'm so sorry this is happening to your relationship. You said he was fond of her in a way that hurts you and I think when that is true it never matters what cheating has happened or not. You are feeling saddened by his split attention and it's not ok to feel anything but #1 in a relationship. Your examples of him being late meeting you because he's spending extra time with her, and the sudden secrecy when they text demonstate his priority. It's really stupid that your boyfriend doesn't have the self awareness or respect for you to remove himself from this person. Because that is what loyal, respectful and responsible partners do when they have a crush outside their relationship. \n\nFor me, if he can't see what is wrong with this scenario that would translate to a direct incompatibility. However, you could always give him the chance to see what you are seeing and either limit contact with her (no more staying after the photoshoot or being alone with her at all, no more texting her when you two are together, whatever other boundaries you feel comfortable with etc) or completely cut her off (I think this is the only real solution if you stay together btw because of their current enmeshment). I think you've tried already though. I would just let this relationship go and find a more mature partner that isn't so reckless with your heart.",
            "There's an old joke that comes to mind:\n\nThere's a great flood and a deeply religious woman is trapped on the roof of her house. Her home is completely submerged. As she sits waiting to be rescued a row boat with a man and a boy comes by and asks if she'd like to get in. She refuses, saying \"The Lord will provide.\"\n\nAn hour or so later, with the water level still rising, a larger motor boat with several passengers (some of which have been rescued from their homes) comes by and calls over to the woman, asking if she'd like to get on. She refuses, saying \"The Lord will provide.\"\n\nAnother hour passes and the water level continues to rise and, as luck would have it, another, larger boat, carrying many rescued passengers and looking for more comes by and hails the woman to get on. Again she refuses, saying \"The Lord will provide.\"\n\nThe water keeps rising, no more boats show up and the woman drowns. She ascends to heaven and the lord himself is there to meet her at the pearly gates. \"My lord,\" says the old woman, \"I've always been deeply religious, i've lived my life piously and virtuously! Why oh why did you allow me to drown?\"\n\nGod is exasperated: \"Lady, I sent three boats!\"\n\nMy point is: how many more signs do you need, woman? Do they needs to be fucking right in front of you while he takes pictures before you'll do the reasonable thing and ditch this loser?",
            "To answer your question, no, you are not being unreasonable, you are responding to your gut and trying to rationalise it whilst your gut is screaming WAIT, WHAT??\n\nI think I've been on this sub too long 'cause I know how this is going to play out:\n\n>1. You confront him\n>2. He gives you the trickle truth \n>3. You confront him again\n>4. More trickle truthing\n>5. You confront him again...\n>6. Breakdown and admission of guilt, probably that they boned two months ago already\n\nYou're already at stage 2 btw. What man has a photo of a semi-naked woman as his phone wallpaper for \"the composition\"? ",
            "Easy, ask to see his chat history with Rachel. If he's apprehensive (calls you irrational, paranoid, etc.) or erases it, it practically confirms that AT THE VERY LEAST they are flirting.\n\nAll that you told are all red alarms, be you the jealous type or the over-comprehensive one (and for what I can see, you are in the latter). \n\nIn my humble opinion, GTFO before you are hurt.",
            "Whenever someone responds to you telling them about how you *feel* with \"You're being irrational,\" they're trying to pull one over on you. Feelings aren't rational in the first place, so it's irrelevant. They do this to try and sidestep the actual issue and turn it into a different discussion. ",
            "Still waitin for the update! ",
            "Fidelity isn't just about avoiding putting your dick in strange.  It is about avoiding situations where you will be tempted to do so.  You meet someone of the opposite sex who is sexy, smart, hilarious, and you actively want to spend time with, and you need to go \"this is going to be fucking trouble if I keep it up...\" and you back away, because your SO means more to you.  It fucking sucks, especially when \"we haven't even done anything we are just good friends\", but you are planting seeds in fertile soil.",
            "So where is the update?",
            "Has the update of what he confessed been posted? Does anyone know ",
            "He started showing up late to plans with you because he's hanging out with Rachel. (This in itself is problematic as he's wasting your time - expecting you to just wait around for him until he's ready. Next time this happens give him 20 minutes and then go do your own thing.)\n\nHe started to hide his phone when Rachel texts him right around when Rachel was back on the market.\n\nHe has a almost nude photo of her set as his phone background. \n\nRachel started to ignore you. \n\nThis is all really inappropriate and weird. I'd sit down and have a serious talk with your bf about boundaries and respect. And if he just brushes you off or tries to pin the problem on you being jealous, I'm sorry but I don't think it's worth sticking around for someone who doesn't respect you. ",
            "Here's the thing, my wife doesn't snoop on my phone, I don't guess, I mean I haven't caught her.  But on the other hand, I don't send texts or emails that I wouldn't be fine with showing her.  Bottom line is, if someone is hiding or not sharing something, it's because they KNOW they're doing something they ought not be doing.  It's pretty simple.  I've had conversations with women on Facebook and text before, and not one of them would I hesitate to show the wife if she felt insecure about them.  If I knew she felt insecure I'd show her without asking \"here, read, don't need you thinking stuff that ain't happeing is happening\".\n\nShould he have to show you his texts?  No, should he be willing to?  Absolutely.   If he's being faithful nothing in his texts should be something he's ashamed of or feels the need to hide.",
            "There is this girl in my boyfriends  group of friends that I immediately didn't trust. She would always brag about how they grew up together and call me a \"hot bitch\". At first I thought that was just how she was (we are in our late 20s).  Until one day she became very affectionate towards him. I brought it to his attention that it made me uncomfortable and it needs to stop. You know what he did? He said no I don't think she thinks about me like that but, I understand. The next time she was out with everyone he was talking to her. I walked by he grabbed me and asked if i was upset they were talking. I said no, its fine. She then started touching his beard, calling him cute, and rubbing his chest. He gave a look and walked away. He had no idea I was even in eye sight of it. He doesn't talk to her outside of her happening to be out and now he doesn't talk to her much when we are. Just the initial hey. \n\nTHAT is how it needs to handled. None of this irrational bullshit. If you're uncomfortable he needs to respect that. ",
            "He wants you to break up with him so he can be with Rachel. He's too weak to end it himself and it'll work out a lot better for him if he suddenly needs comforting from her.  You should beat him at his own game and ask him to marry you ;)",
            "Waiting on that update! Trust your gut. ",
            "In a relationship, it is not just impropriety that is a problem.  Even the *appearance* of impropriety can be very damaging to a relationship.  \n\nYou have every reason to have a big problem with him even if there is no smoking gun.  ",
            "Sorry but he is either cheating or going to cheat soon. Dump his ass.",
            ">extra mini update: He confessed. More on that later.\n\nHe confessed to cheating? Or to crossing boundaries?",
            "These are all signs of them hooking up. I'm so very sorry. My ex did the same thing. We were all friends. Then not. They did stuff together as friends and didn't invite me. I tried to rationalize just like you are.\n\nWe had a 2 year old at the time (now 25), and it was pretty devastating. Count yourself lucky you don't have kids with him.\n\nBased on what you said you're not paranoid. I know you're hoping that's the case and it's just two creative types sharing a friendship, but it's not. He feels she's a 'kindred' spirit. That's a tip of an iceberg.\n\nHang in there.",
            "I'm dying for a full update! ",
            "Checking this regularly to see if there's an update yet. I'm so curious.",
            "Lol, I'm actually a model named Rachel and I frequently get people, and especially photographers becoming infatuated with me because of my personality..... Difference being I find it disgusting when 1. A taken man shoots explicit photos of women that are clearly just because he finds them hot- there's a very clear difference between a good photographer that makes money off high end bikini shoots and then the majority of male pgotographers who are just total disgusting sleazebags who worship models and relish getting them semi naked in the studio 2. It's disgustingly unprofessional. On her behalf too. \n\nJust leave him, these men are never emotionally faithful. He's a worshipper, he'll continue to find Rachels and coax them into getting in their underwear for him. You can do better......",
            "> He tilts his phone away from me now when Rachel messages him.\n\nComments like these always blow my mind when I read them. Especially when they're embedded in the middle of a few paragraphs. \n\nHe's **actively** hiding something from you. What is he hiding? No idea. Literally could be a million things. But the first time he decided to tilt the phone away from you was *because of something*. It didn't just happen. He didn't just become secretive on a whim after three years. He didn't think, \"Holy shit, /u/exgirlonthephone might be able to see my texts when we're together and I want privacy for no reason now so I'm going to start tilting my phone away from her\" out of the blue one day. \n\nWhile he and Rachel were texting, something occurred in the exchange that made him think \"Fuck, if /u/exgirlonthephone saw these texts, she'd be mad. I'd better start hiding them\", so he started tilting his phone away. Hell, it could have even been unconscious. But either way, he did it. Something happened that made him realize that you couldn't see the texts. \n\nMaybe they're talking about fucking each other. Maybe they're talking about a deep, strong emotional bond they've discovered. Maybe they're talking about how flat her ass looked in one of the shoots from last week. \n\nEither way, they're talking about something that he's decided you can't see. If nothing else, you should ask him what prompted him to start turning his phone away from you when he talks to her and see what type of excuse he's able to think up. ",
            ">doesn't sit right with me. I told him that and he told me I was being irrational.\n\nThere's plenty here that looks bad, but this is the line of doom. Even if there's nothing going on, there's also nothing irrational about not wanting a photo of another girl to be his wallpaper. The fact that he said it was is A) much more of a smoking gun that he's cheating--otherwise why so defensive? and B) a disrespect for your reasonable boundaries even if he is not cheating. ",
            "He confessed to cheating? If that's the case I'm sorry it played out like that OP. At least it wasn't a long drawn out snoop fest and now you know. I'm sorry for the heartache.",
            "Wait. He confessed to cheating with her??",
            "I would talk to him about it. Just gently and nin accusatorily lay out how you see things. They broke up 3 weeks ago, your bf started acting different two weeks ago. Rachel barely talks to you now, another recent change. He may have stopped showing you her texts because there's nothing interesting to share, but tilting phone away isn't a good sign. ",
            "The photo by itself might not be that big of a deal since he is a photographer. It's their inappropriate relationship that is the big issue. He sounds like he is emotionally cheating at a minimum and I would expect it to escalate if things continue this way. If you want to try and save it, he needs a come to Jesus talk. ",
            "Your boyfriend has boundary issues at the very least. All relationships have mutually agreed-upon boundaries; your boyfriend is pushing them and then dismissing you when you speak up about it. Like, this is 101-level empathy, and he's failing magnificently at it.\n\nIf it were me? I'd stand my ground. \"I feel the amount of time you've been spending with Rachel is inappropriate, and it isn't in line with what I understood the boundaries of our relationship to be.\" Be ready to have a tough boundaries talk, but frankly, there's no easy way to have this discussion.\n\nFor the sake of seeing it from both sides, I thought about how I'd react if I was on your boyfriend's end (I'm in an open relationship so it's a bit different, but the important concepts about boundaries are similar). I can't imagine saying *anything* but \"I didn't know you felt that way; I enjoy having a close friendship with this person but it's important to me to try to create a situation that you're comfortable with.\" At MINIMUM, I'd say \"I don't think your request is reasonable,\" and then offer an alternative or negotiation, **never** just shut them out.\n\nSorry, OP, but my assessment is that your boyfriend's either a garbage communicator or something's not on the up and up. You're not being unreasonable, and your feelings are valid regardless of whether they're rational or not. It's okay to feel jealous; the key is how you handle that feeling when it comes up.",
            "You guys have been together for 3 years. Talk to him about your feelings!!! \n\nYou're a bit suspicious of his relationship with Rachael, even if you don't want to be. \n\nYou're his girl but you have a feeling you two are not as close as you used to be. \n\nI'm not blaming him for anything but with 3 good years under your belt it's perfectly normal to have these feelings when another girl has his time and attention for work. \n\nTalk to him. You don't have to blame him, you just need to let him know his girlfriend is feeling uneasy about a few things in the relationship. \n\nGood luck",
            "He is almost certainly cheating on you, and given that you've raised the issue a couple times already and he's been dismissive I think you have only a few options: (1) just break up with him; (2) snoop through his phone while he sleeps or is in the shower; or, (3) suddenly show up at his studio after one of his shoots with you. ",
            "He's totally shagging her or trying to...\n",
            "I don't care about any of this other stuff.\n\nHe has a photo of a non-important woman in his life, and is trying to claim it's because of his artistry. He could have the same beautiful photo of *you* but he doesn't.\n\nThis is honestly gross and if I were in your position I'd be leaving his ass immediately. There is literally no way I'd let that slide, ever.",
            "Her suddenly ignoring you/blowing you off is because she resents you for getting to be with your bf. That combined with your dude's secretive behavior... he's cheating on you. Even if it's not physical, definitely emotionally. I'd bet on physical too, though.",
            "I was in such a similar situation, and literally ALL THE pieces of your story are identical to mine. Like, every part other than the professions they worked in. \n\nHe was cheating on me.",
            "I feel really bad for you and this totally sucks but it's obvious he's already balls-deep. :(",
            "You already updated, but quick comment, she is furthering her career at the moment with your boyfriend.\n\nAfter that he is probably dead weight to her, so you have a chance as the eternal second choice.\n\nYou know what to do.",
            "Saying \"I don't like that you have a photo of your parents as the background on your phone\" is irrational. Saying \"I don't like that you have a photo of a nearly nude model with whom you are inappropriately close as the background on your phone\" is not irrational. Just gonna leave that there.",
            "I doubt you'll see this OP but I'm also a photographer and my gf is a model. \n\nWe don't do shoots unless the other is present. She doesn't shoot with other guys unless she has a friend / me, I don't do shoots with other girls without her. \n\nI care more about my relationship than I do my photography, I wish you the best. ",
            "> He tilts his phone away from me now when Rachel messages him. \n\nThat's a serious red flag. He knows you suspect something and he's taken steps to protect himself. If he hasn't had a password on his phone before, he'll have one now. If he doesn't, snoop through his phone. Yes, I know I'll catch flak for this, but he's acting really weird and sitting around waiting to catch him is going to take forever. ",
            "Would you want to be with someone capable of doing this for the rest of your life? Even if he hasn't been cheating, this isn't acceptable. Do you share an apartment together? Can you afford to move out ASAP?",
            "Yeesh, photographer or not.....if my man had a picture of another girl on his phone I'd be livid. I don't think everything is kosher here. ",
            "It sounds like something happened between them around when she broke up with her boyfriend and the new status of their interactions just hasn't been (or won't be?) communicated to you yet in an honest way. \n\nCan you find out what the cause of their break up was from mutual friends who know the ex boyfriend? Or from the ex himself? He may know something that is being kept from you, so if there's a way to find out (without starting super drama that you know you can't handle) then it's worth thinking about. \n\nIf your SO is protective of his phone then there's probably info on there that could clarify just how bad this is, too. But personally, I couldn't deal with this level of disrespect even if they aren't sleeping together. He's putting her ahead of you in multiple ways that you can already observe. \n\nIf you asked him to keep their communication only professional and not to spend time together outside of when all the staff are on site (essentially, end the \"friendship\" and spend no time alone together) would he agree to that in order to make you feel more secure? Or would he call you crazy?\n\nIf you showed up to one of their shoots, either during the shoot or after when they are usually alone, what kind of reception might you get?\nReally, at this point it might be time to show up during that alone time and see what they're doing. Or if they're even still in the studio at that point. You're his girlfriend so it shouldn't be weird for you to show up if he's delayed. If you think he'd have a problem with that, then that's worrying as well.",
            "update us op after you confront him, we're here for you! ",
            "Rachel broke up with her BF three weeks ago, and you BF has been secretive with his phone for the past two weeks?\n\nEven if they're not doing anything, you're completely justified in being upset that he's prioritized Rachel over you.",
            "I was in this relationship. \nI was young and naive. He had the same kind of excuses, wallpapers. Everything. \nWe split a couple of years ago and have since had confirmation he had been having an affair with one of his models for a long time. \nI hope you don't have to go through what I did. \n",
            "Their behavior isn't appropriate for someone in a relationship in my opinion, but the thing that I think is the icing on the cake is that you've expressed your discomfort with the situation and he's blatantly ignored it. If he is cheating, he's gaslighting you, but even if he's not, his blatant disregard and disrespect of your feelings is enough to end it.",
            "OP, this isn't always the case, but there is a lot of sound advice given here. You're not being paranoid and the whole situation you've explained definitely paints a very fishy picture, one that anybody would worry about. I liked the idea someone suggested of asking if you can go to the next shoot with your BF shooting Rachel, his response should be very telling. Also, maybe you could have a serious sit-down with him and explain to him why you feel the way you do. If he still isn't listening, show him this entire thread - although his not-listening is reason enough to seriously consider ending it.",
            "Trust your gut. I was worried about being the jealous, nagging girlfriend once as well. Turned out I was right and being cheated on and just blamed everything on myself because I had \"no reason to doubt him.\" I didn't find out for almost a decade. Instincts are a powerful thing. Personally, knowing what I know now, those txts would drive me crazy and I'd be snooping while he showered. Bring on the down votes, it's the truth. ",
            "So, how long have your boyfriend and Rachel been dating? They seem happy.\n\n ",
            "You raised an increasingly growing concern to your b/f. He has pushed that concern aside however his behavior has increased that concern enough for you to come here. I think it's fair that you sit down with him and ask him what is going on. That you've never been jealous before but also that he's never acted this way before. If he dismisses you again, that in itself is a concern as this is not normal behavior for you either and he should realize that this is not a small issue for you and therefore requires some effort on his part work this out with you.",
            "So, to use your language from your post, he:\n\n* adores her\n\n* is very attached to her\n\n* only acts like this with Rachel (besides you)\n\n* tilts his phone away from you while texting with her (hiding inappropriate content)\n \n\n* took the wallpaper photo for \"fun\", not work related\n\nAnd then when you say the wallpaper pic isn't sitting right with you, he tells you that you are irrational?!  WTF, just *what???*\n\nThat is some hard gas lighting. \n\nI think he wants the comfort of his relationship with you or wants you as his safety net while he has his fun with Rachel. And I really don't think they are done with their fun yet. \n\nI imagine it's not so fun from where you're sitting, though. He has gone into Inconsiderate Asshole territory, at the very least. \n\n\n",
            "It's over, start getting ready to exit his life.",
            "I think it's pretty clear that you've laid out all the reasons why you should most definitely be concerned about this.  You listed multiple ways in which his behavior has changed since he met this woman and he has a history, albeit a small one, of picking up models he photographs if they strike his fancy(you).\n\nThe especially worrying part is that the change in behavior wasn't the one where he is open with you about the shoots and all of the professional stuff - he's suddenly guarding his messages with her and having inappropriate photos of her in non-work locations.  Then you find out she broke up with her bf shortly before your bf got shifty?\n\nThere are too many red flags here, and if he won't see your point of view about this, you have some decisions to make.  \n\nPlease don't let him use yours and his backgrounds in the arts to wave away all of the shifty shit he's up to.  You can be a photographer without blowing off dates with your SO to hang out with a \"kindred\" spirit.  He crossed the professional line, here.",
            "My ex had this exact same scenario. He claimed they were just friends, had her as the background to his phone, would tilt his phone away when she messaged. And he was cheating on me the entire time. \n\nThe sudden shift in the texting with tilting away his phone is what would bother me the most. ",
            ".... Id say at the very LEAST he's being emotionally unfaithful. I'd say he's cheating. He'll deny it, but it's only going to progress. \n\nGet out while you can with dignity \n",
            "Your boyfriend has a picture of another girl as his background and you're \"unsure\"? Come on OP don't be so dense. You know what's happening. He tilts his phone away from you when she messages him (so as not to be seen publicly?) hmmmm........I just WONDER why ",
            "Oh dear, I'm sorry.  Good luck.",
            "We don't really need to spell this out for you. I'm sure you know exactly what is going on.\n",
            "I've never felt more certain of anything. He's cheating on you. Does no one else see this? ",
            "\"Dear BF, you're acting inappropriately around Rachel and I've asked you to stop multiple times. I have zero history of being jealous or wary of you and until recently you've never given me a reason to be. However, you're acting with her the same way you did with me when we got together. You can call me irrational all you like but that doesn't make it true. I'm tired of listening to you deflect instead of giving me real answers. I will give you the opportunity to be honest here and if you're not then we are done no 'buts' about it. I will not play second fiddle to another woman. I am better than that and worthy of having my SO's attention and love as well as consideration for my feelings.\" ",
            "Plot twist the model is actually his gf and your the side chick..........",
            "Hey OP saw this on my main page and wanted to wish you luck. I hope the worst isn't true.",
            "It's extremely telling that your inclusion in his texting conversations and her communication with you ceased. That's obviously when their relationship became inappropriate. Everything else is almost justifiable, but that really gives it away.\n\nI think you have sufficient evidence to snoop on his phone, if you need more concrete evidence. If I were you I wouldn't even bother, just walk away.",
            "She was single 3 weeks ago..... and stopped talking to you 2 weeks ago......\ntilting the phone away when he never did that before...... \n\nummmmm yea..... there is something going on\n\nI would just bail but if you need evidence I would snoop (you've been given good reason to).... People hate that but he will never tell u the truth and you have a right to protect yourself emotionally and from std's.    Good luck.",
            "You really need to have an open discussion with him about this and come to some compromises on his behaviour. I'd feel the same way you do in this case - in fact, I probably would've started feeling a bit jealous way earlier than you have - and the amount of private texting etc. sounds over the top considering he's in a relationship.\n\nI'm not saying he is cheating on you; it really could just be that they're getting very close. However, I don't think it's a level of closeness I would be comfortable with anyway, and could easily be that they haven't done anything but are developing feelings for each other. Honestly, either way, something needs to change.\n\n(Obviously if he has actually already cheated on you, then you should dump his ass, etc.)\n\nSorry this isn't more helpful. But you're not being paranoid at all.",
            "Regardless of how proud of a photo he is, it seems pretty disrespectful to me to have a picture like that as your background. Tilting his phone away from you and trying to keep it away is a pretty shitty thing to do to",
            "I've feel the same way as you. I don't think you're being irrational. I'd sit him down and have a serious convo. Don't necessarily accuse him of anything (unless you think you've got enough evidence). Instead tell him (again) how his relationship with Rachel makes you feel, especially as of late. Explain to him why it bothers you and ask him if he's having second thoughts about you alls relationship. Ask him to be honest. Even if it hurts. Based on his answers ou be the judge on whether or not he's being honest. ",
            "You are not being irrational. He's just slowly eased into these new behaviors so you got acclimated to each new little thing. When you look at the bigger picture it's pretty obvious that he's likely cheating with her. Of course there is certainly a possibility that he's not, but either way he's definitely, 100% overstepped the bounds of what's acceptable with friends when in a relationship. You definitely have the right to ask him to tone things down, i.e the sexy pic of her he has on his phone.\n\nHonestly, the picture alone is enough for me to say you just end things with this guy. Cliche I know; the internet is always fired up to tell women to break up with their mean nasty boyfriends, but I really can't imagine a legitamate justification for that. Photographer or not, it's pretty clearly hurtful (and what does it say to strangers who notice?) for him to have a sexy photo of another woman as his phone wallpaper, particularly one that he knows personally (it would be one thing if he just liked having a porn-style background, but it's *personal* in this case).\n\nI think the fact that he didn't change it despite you voicing your feelings about it closes the relationship. It's just such a dick move in the first place, and then the fact that he has the balls to keep it up after you pointed it out just indicates to me that he really has no concern for how you feel, and that is the hallmark of a cheater.",
            "I mean, whether he's sleeping with her or not, he's having an objectively *very inappropriate* relationship with this girl as a man in a relationship. You are uncomfortable with it. Set boundaries. I wouldn't be okay with this behaviour, most people in monogamous relationships wouldn't be, and in fact *he* probably wouldn't be comfortable with you having this kind of relationship with another man. He needs to own that, and then put your needs above Rachel.",
            "I think that he is already ready for cheating on you with new model girlfriend named 'Rachel'",
            "Kind of weird and sort of un professional when it comes to photography. Pro-photog do maintain relaitonships with their clients, but in a more professional way. Lets ignore the whole her being a model concept and say.... Is it ok for your partner to hide things from you?  What would happen if you asked him about this directly? I hate to be the \"show me your phone so I can trust you person\" but is there a logical reason why he's hiding these messages from you?  Did his password on his phone recently change?  \n\nHonestly, from what little you wrote, and what we can speculate is most likely something could have happened. He's interested and falling in love with her... and well  that's that. But think of it this way, if this is true, you're better off without someone you can't trust fully. \n\nI know many creative people who do nude modeling, sculptors and photographers... none of them behave in this manner. ",
            "The fact that this other woman stopped talking to you kind of confirmation IMO. Anyway, could you show up at his work place when he is working late?? Solid proof to me is the best thing.\nThat being said, he is dismissing your feelings...that is so very wrong of him. Doesn't sound too good on his end.",
            "I'm so sorry. I don't think there's anything for you to do here except gird yourself and break up with him NOW, so at least when you look back on this sorry incident, you can be proud of how much dignity you had in the face of gross betrayal. Best of luck. You really do sound like the total package, and you'll one day meet someone who would rather chew his own arm off than throw that away.",
            "\"Don't want to fall into the jealous gf trope\" my ass.  He's given plenty of reason for concern.   Not sure what you can do about it, though, besides cut your losses and proceed as if no amount of asking him or trying to keep him would do any good.  I'd quietly walk away and see if he came after you or not.  Very hard to do.  But unless you're married with kids, I think I would just disappear from his life quietly and let him figure out what he lost if he's going to.   ",
            "I have a burlesque photographer friend who is devoted to his wife, so not all photags cheat.",
            "You're not being irrational.  Having a picture of another scantily clad woman as your wallpaper when you're in a relationship is just not okay.  He's trying to make you doubt your gut feeling, which means your gut feeling is right.  ",
            "Oh shit! This really, really doesn't sound good. You most certainly are not being irrational, and he is behaving very inappropriately. It really does sound like major boundaries have been crossed between the two of them... :(",
            "Wow. I don't know where to start with this. There is so much to unpack. The thing that really jumped out to me was him dismissing your feelings as irrational. That is not okay. You have very good reason to feel the way you do, and even if you did not, dismissing someone and calling them irrational is not the way to deal with something. Calling someone irrational and dismissing them is a cheap tactic that he is using to get out of a sticky subject. Somehow, this is what men always say when they are caught being inappropriate. Gaslighting is a favorite of people who cheat. This is one big thing that makes me think he is cheating. You seem to be very rational about this and do not seem to be the overall jealous type. You seem to go out of your way not to be. If he were not guilty, a normal response would for him to look at what has been going on and talk to you, reassure you, etc...\n\nI also think at the least, he is having an emotional affair, although I do suspect it's more than that. He is prioritizing her over you by being late for nights out and what not. That is not okay. His phone habits and change in behavior are exactly the description of someone cheating. Don't even get me started on the suggestive picture of her he has on his phone. That is in no way appropriate. It's interesting how he chose a photo of a woman that he is so deeply invovled with to be his favorite because of the photographic elements. I can almost guarantee you that this is no coincidence. \n\nI'm not sure what advice I would give you. Most people who cheat will deny it until you have hard proof otherwise and will gaslight and try to make it out as you being insecure and crazy. Sometimes you will never know for sure. I would leave a relationship if I had strong doubts and my partner had given me reason to have such doubts (I stayed once and will never do it again), but that may not be what you want. I won't even assert that leaving is what you should do, as I am not exactly objective. \n",
            "Don't trust him. I'd take a peek through his phone when he falls asleep.",
            "You're probably going to have to snoop to find out the truth. Or you could trust that he isn't sleeping with her. Your call, but you aren't getting the truth out of him until it's too late.",
            "A lot of people here have given you good advice, so I'll just say... I feel you. I used to model a LOT (now just part-time and for extra money), and I dated a photographer for a short while. Needless to say, I left him. He didn't cheat on me, but with his \"playboy\" attitude (before he met me.. all his friends claimed I \"changed\" him but what ever I don't believe that) and his job, I knew I wouldn't be able to trust him long-term. I hope this works out with your boyfriend and that Rachel kindly fucks off. ",
            "Something fishy is going on here.  I'd investigate further.  I don't really condone snooping,  but it might be the fastest way to find out if something is up.  ",
            "If it looks like a duck, quacks like a duck, walks like a duck etc. etc.\n",
            "I shoot and you can bet they aren't my wallpaper on my computer or phone.",
            "I hate to say it, but i think you know exactly what's going on here..\n\n\n\nAre you guys living together? Just wait until it's time to renew that lease and see how kindred he is",
            "Yeah... I hope you're in a position to support yourself financially or at least have relatives you can rely on.\n\nYour relationship is about to end.",
            "Girl you already know he cheated",
            "Yeah don't trust him he is acting cagey and it seems as if they are actively talking about probably what you think. I'm not a coincidence person it can't explain it away. If it's not acceptable for you cut him lose.",
            "So he got weird with his phone a week after she became single?\n\nI think you know what that means. I'm sorry.",
            "\"I know you and Rachel have a working relationship and I really respect that, but I feel like it's become more than that and there are things that are making me uncomfortable. Can we talk about this?\" \n\nIf he gives a shit about you and your relationship, he will listen and he will make compromises with you. If he makes excuses and doesn't listen to your concerns or consider how uncomfortable it's making you, then you need to decide if this is someone you want to be with.",
            "Check his phone while he's asleep or in the shower",
            " they were having an emotional affair, but it has turned physical.",
            "I can understand being proud of your work but that's just weird. ",
            "It's probable that he is cheating on you. He doesn't deserve you ;_;",
            "Void of actual facts (like seeing him kiss her), all you have is your gut to go on.  Your gut has given you enough to write a very long story of what's going on.  When I read this story, it sure sounds rational.  You need to directly talk to him about this.  Be prepared for anger, defensiveness, gas-lighting  or lying.  If your gut suspects any of these once you tell him, as hard as it is, he's not your guy.  \n\nIf he reacts with sympathy and gives you a story you believe, who knows, maybe it's something else.  Doesn't seem like it, but maybe.  If he is compassionate, but tells you he fucked up, you need to be prepared to make a decision on if you forgive him or not.  \n\nAt the end of the day, the worst thing in all of this is wondering, and the best thing to do about it is to do something about it.   You sound like the kind of person who will.   You sound like a great person and if he's fucking up, he sounds like he's about to make a big mistake.  If that's the case, don't let the bad apple spoil the bunch.  Good luck!",
            "You are not being irrational. He's just slowly eased into these new behaviors so you got acclimated to each new little thing. When you look at the bigger picture it's pretty obvious that he's likely cheating with her. Of course there is certainly a possibility that he's not, but either way he's definitely, 100% overstepped the bounds of what's acceptable with friends when in a relationship. You definitely have the right to ask him to tone things down, i.e the sexy pic of her he has on his phone.\n\nHonestly, the picture alone is enough for me to say you just end things with this guy. Cliche I know; the internet is always fired up to tell women to break up with their mean nasty boyfriends, but I really can't imagine a legitamate justification for that. Photographer or not, it's pretty clearly hurtful (and what does it say to strangers who notice?) for him to have a sexy photo of another woman as his phone wallpaper, particularly one that he knows personally (it would be one thing if he just liked having a porn-style background, but it's *personal* in this case).\n\nI think the fact that he didn't change it despite you voicing your feelings about it closes the relationship. It's just such a dick move in the first place, and then the fact that he has the balls to keep it up just indicates to me that he really has no concern for how you feel, and that is the hallmark of a cheater.",
            "Have yall been intimate on a regular schedule? Or has it been more intermittent? Could also be a sign if he don't antitank no more.",
            "I'd let him know that his behavior with her seems more than just professional and despite your conversations about it, he doesn't seem to care about how it's affecting you. Tell him that you'd rather he be honest with you before he ever sneaks around on you. Ask him who he wants to be with and if he's willing to calm it down with this girl before he loses you. Who does he love? Tell him that you won't stand for this type of behavior with another woman because it's disrespectful to your feelings and relationship. A partner who's willing to cast aside their significant others feelings like that has a skewed set of priorities. And that's what worth focusing on more than anything. ",
            "[removed]",
            "I think you should have access to his phone 24/7.\n\nMe and my gf both have iPhones and each other's thumb print will unlock either.\n\nShe's welcome to view my phone 24/7 and she does occasionally. I'm welcome to view her phone 24/7 as well but I rarely check, maybe monthly.\n\nIn the past my gf was cheated on so she's a little insecure, so this helps. I don't mind because I have nothing to hide. \n\nHe will argue he wants privacy and for you to respect his privacy.... that's bs. Tell him you want access to his phone 24/7(and he can access yours) or else your gone.\n\nGood luck girl.",
            "There's certainly a lot of warning signs something is going on but I'd make sure you find out the facts first or at least delve deeper before assuming he's cheating straight away, maybe he isn't despite everything who knows? ",
            "block her number put it to spam and add your number under her name, and see whats going on.",
            "^ what I was going to say, but you explained it better:)",
            "I would ask him if he would consider a 3 some with Rachel, just to see his reaction.",
            "[deleted]",
            "Did you see lost in translation. Cause you should see lost in translation. ",
            "This may be wildly unpopular, but have you considered opening the relationship? Granted, this is almost always a terrible way to go when used to try to fix a relationship - opening up should only be done when both parties have a strong groundwork of trust and open communication, and are on the same page as far as where the relationship is. I only mention it because it sounds like he and Rachel get along really well. It's entirely possible that they are wonderfully compatible, and that having her in his life would make him happier and more loving - toward you as well. If this comes to a head and you ask him to choose, he may not choose to be with you. But if you can accept that he loves and cares about you without the security of an exclusive relationship, you might wind up with the best of both worlds. Of course, naturally you'd be able to explore relationships outside of this one as well, and maybe find another person who adds love to your life. Anyway, If this is something you're comfortable with considering, or even if it isn't, you should sit down and talk with him about Rachel. Acknowledge your own feelings about the situation, and communicate explicitly how what he's been doing makes you feel. ",
            "Of course I don't know your exact situation...but I am a photographer who works in the same genre.\n\nIs he screwing her?  Maybe.  \n\nOR, she is his muse.  The person who gives him inspiration for his art.  Really, this is a 'real thing' and it's legit.  \n\nIs it a close relationship?  Yes.  Is it the same as screwing?  No.\n\nIf they are 'kindred' then she really could just be his muse.  This is not uncommon.\n",
            ">he really does seem to be fond of this girl in a way that really hurts me.\n\nWhy does this hurt you?\n\n>He has slowly become very attached to her and I feel like I'm losing him.\n\nWhy does this mean you are losing him?"
        ]
    },
    {
        "post_id": "bt4rrs",
        "author": "BFTCaccepted",
        "title": "I[32F] feel like my husband[33M] is in denial about his feelings towards me. Married 11 years with 2 special needs kids, I got fat and dead bedroom... How can I fix things with him?",
        "url": "https://www.reddit.com/r/relationships/comments/bt4rrs/i32f_feel_like_my_husband33m_is_in_denial_about/",
        "score": 2865,
        "num_comments": 304,
        "created_utc": 1558852040.0,
        "selftext": "If you saw this yesterday I apologize it was taken down because I somehow fat fingered something to look like a link thu breaking a rule, and while I had great responses I was unable to reply etc.\n\n**TL;DR:** 2 special needs kids. SAHM to basically be able to do all the therapies and appointments. Am huge now. Husband never has sex with me but swears he loves me and is attracted to me. Works late and very little interaction. Feel like he's with me not to be the asshole who leaves his wife with 2 special needs kids. Didn't celebrate my birthday and mother's day was not much better.  He may be on the spectrum a well. **\\*\\*How can i fix this mess esp the dead bedroom/lack of love?\\*\\***\n\nWe've been married 11 years. High school sweethearts...well started dating right after high school. Not each other's first boyfriend/girlfriend but I've only had sex with him.\n\nJack and I have been married for 11 years. We have two kids. Both of our kids had special needs with our oldest being extremely high functioning and gifted and our younger child being in the moderate category for autism. Our youngest is 4.\n\nJack is a very successful person and while I had a promising career when our oldest child had issues we decided since I made less and had better medical background I would stay home. He was happy to do this as his own mom stayed home but it was hard for me as I always saw myself working and being successful. I'm being vague because he does read this sub. I took our oldest to all therapies and was an aide in preschool for him. Honestly without driving it was over a part time job and some years over a full time job.\n\nMy life became all about pushing this child uphill and itworked Now you would never know he had severe challenges. He still gets social therapy and needs anxiety help but really he just seems like a super smart child,\n\nWe were both still very much in love and decided to have our second child. This was before we knew our older one had aspbergers. Our oldest was diagnosed when our younger child was mere months old. With a newborn I still did all of the therapy, driving and preschool stuff with my older. Around age 2.5 it became apparent while our younger child was hitting milestones he regressed. He is one of the small percentage of children who regress after the age of two. I admit this fucked with me bad and I was suicidal. I was put on medication and am dealing well with it but I felt like my child was stolen. to go from fully verbal and conversational to mute and right when his brother was graduating all his therapies save social skills therapy was a huge mind fuck. I was gutted. I began putting on more weight and my eating for comfort got out of control. I'm now trying I sti to accept where our youngest is and take happiness in what strides he is making. l take on childcare and therapies. I'm never home long enough to clean and organize it and when I am I'm usually so beat and tired to organize the toys they dump etc. Forget spring cleaning it never happens. My husband was always messy so it just adds to it being a shithole of clutter(not filth the trash is taken out and dishes done but messy clutter and unwashed walls with kid prints on it). I feel I never get a break. He is worse off than his brother in many ways but he is also the happiest kid.\n\nWhen we got married I was 130lbs and 5'8. Looking back I think I was extremely attractive but had poor self esteem as I was not American ideals and was bullied a lot for my \"ethnic looks\". After our first was born I struggled to lose weight but I did. After our second I was losing weight until my oldest was diagnosed with aspbergers. I then comfort ate. Currently I am 260lbs. The heaviest I have ever been. I'm on depression medication. Our house is a mess, I'm always stressed out and just exhausted. Jack has always been overweight but it never bothered me. I'm talking around 220 most of his adult life and he is 5'9. He is now 245. He does have some health stuff but it's minor and not severe. His professional life is super bright but due to our children's needs you wouldn't tell how well he is doing for himself.\n\nMy birthday he \"forgot\" because I was depressed and did not want to go out due to my younger child being kicked out of a preschool so we didn't even cut a store bought cake. His birthday came around and he got himself something expensive and nice and I also got him a nice gift and card. I planned a surprise party for him. I'm trying to have the kids make him a father's day gift. I make sure every day to tell him how much I adore him and love him.\n\nI feel unloved. We never have sex anymore. The kids reject him because he barely interacts-if I am honest he may have aspbergers himself- so I am putting them to bed. I ask him and he says he's tired or work or whatever else excuse. Today he turned down a bj. Not even a bodily response when I was trying to initiate it. He says it's just the kids, stress, work, exhaustion, his back hurts literally everything.\n\nHe swears he loves me and is attracted to me still but the lack of sex unless I literally beg him bothers me. He jacks off so I know it's not a testosterone thing. I've offered counseling and he says he loves me and doesn't know where it is coming from. I'm starting to feel like we're married because I am a SAHM and can bring our special needs kid to 100000 appointments and he worries if we divorce who would do it not to mention he probably would feel bad if he left me because our kids.\n\nI love him so much but either he is in denial or I am crazy. I want to stay married to him. I don't think I could ever love someone the way I love him but I don't think he loves me anymore- and again he swears he does. I just don't get how we would have sex every day then every other day after our first was born then three times a week after our second was born to now I'm lucky if I get it twice a month and I have to harass him for it. He doesn't initiate it. It kills me because I just feel ugly. I also suspect he is upset the house went to hell but I feel like I can't keep up both my kids are in therapies granted my oldest who is gifted is just in a private social group but still I never have a break.\n\nHe works until 8pm most weekdays and I feel it may be a choice. When he gets home he's on his computer or takes hours on the bathroom where he hides from us. When he is home he seems irritated with everything. We do date nights a few times a month but it's either silent or me filling conversation. I'm so lost and I don't know where to start. When I ask him what I need to do or how I can fix this he reassures me he loves me and is just tired and nothing is broken.\n\nI was raised by a single mom so I really don't know what to do here and if I am being crazy. I'm too ashamed to ask my female friends because they joke their husbands bug them for sex too much and they are tired. Is it normal to have a super dead bedroom for over a year in long relationships? I just want to fix this. I love him.",
        "permalink": "/r/relationships/comments/bt4rrs/i32f_feel_like_my_husband33m_is_in_denial_about/",
        "comments": [
            "I’m so sorry. Reading all of that, of course you feel down.\n\nYou said he makes a good living, yes? Could y’all afford for a maid to come in, just once a week, to tidy up the house?\n\nBetter yet, maybe hire a professional caretaker to handle the kids for 1-2 days per week. Taking them to appointments, taking care of their needs, etc.\n\nIf you could free up just a bit of time for yourself, where you can handle other household tasks, prep healthy meals that can be stored in the freezer for the rest of the week, or even just go do something you used to love for a while, I think the entire energy of the home could be changed. You just need help.\n\nOne idea could be that you hire a maid, yes, and then also hire a professional caretaker to take care of your kids 3 nights a week for an hour or so. With that time, go work out—it sounds like this weight issue is causing more problems than just physical discomfort for you, it sounds like it’s really hitting your self-esteem hard, as well.\n\nTL;DR: You need to call in reinforcements of SOME kind. I agree that your husband should be coming in earlier and helping around the house more, but sometimes our spouses need to see us make a big, difficult change ourselves, and then they can begin to see the light, and follow along.\n\nNot that you haven’t already been shouldering the burden of so many responsibilities in this relationship already! But sitting down with him and saying, “I’m unhappy, and I’ve identified some of the key reasons why, and here’s my game plan for how to fix it: I’m getting a maid to come clean once a week, and I’m hiring a professional sitter to watch the kids while I go work out three nights a week. I think we’re both unhappy coming home to a filthy house, and I know my self-esteem has tanked since gaining this weight, and I genuinely think that coming home to a bright, clean house and feeling like I still have *some* time to focus on just me, will dramatically improve the energy around here, and even in our relationship.”\n\nGo ahead and find out the pricing of maids and professional sitters in your area, reconcile it with your budget, and lay it out for him so he can see the benefit.\n\nAlso, there’s a great chance your husband does in fact love you tremendously still, but he’s feeling so bogged down and sad about where he is in life right now, sex just sounds difficult. Men are emotional creatures, too, and sex is an emotional act. Masturbation is a basic release, but sex requires intimacy and vulnerability. If he’s feeling overweight, in pain, worried that he’s disappointing you, and overwhelmed about his house, his children, and his job, (have you asked him why he stays so late? Maybe he genuinely has a lot on his plate?) sex isn’t going to sound great, despite what we’re told about men basically being animals when it comes to always wanting sex.\n\nStart to contain The Overwhelm, beginning first with things that you can do on your own, (since he’s rejecting the idea of couple’s therapy ATM) and see if the mood and general calm in your house begins to improve.\n\nObviously, again, this isn’t your fault or your sole responsibility, (I hope I don’t sound like I’m saying this is on you?) but since you’re on your own for right now, take charge where you can, and see what things can change, so you can gradually take steps toward a healthier, happier home environment for you and your family.\n\n**Edit:** OP, check below this comment for a LOT of great recommendations for resources! Lots of Redditors suggested some great ways to get help that sound perfect for you!",
            "I second the childcare option 1/2 days a week. I think if you have some time to yourself to get things going as far as weight loss by prepping healthy food for the week and maybe some alone time with yoga or some other healthy activity-I liked spinning, It will do wonders for your\nPsyche. Also, getting your hair/nails done can do wonders for your self esteem. Work on you.  If by then he doesn’t seem to be responding to your pleas to fix your relationship, you may want to rethink your relationship. By then, with some self confidence, you’ll hopefully have the strength to do what you need to do. Therapy is also a wonderful thing.",
            "Oh my God this sounds so hard on you. You have so much on your plate. I think that the main problem is that you need to take care of two high maintenance children 24/7. Most people would feel exhausted and depressed and like everything is up in flames all the time. On top of that there's the relationship peoblem with your husband.\n\nThe first thing you should do is find a way to have some free time. Some time to feel like yourself again and you'll feel a lot better. Did a sitter, or a maid. Maybe friends or family. Anyone that can take some of the burden off of you. Work your problems out with a therapist and press on the marriage counseling. \n\nBest of luck",
            "Among other things, your husband may be unconsciously afraid to have sex and accidentally end up with a third kid. \n\nFor now, change what you have the power to change. See a therapist for your stress, depression and eating disorder. Get some respite care so you’re not a slave to the kids/house 24/7. Find a couples counselor. Go away for a long weekend without the kids. The dead bedroom is a symptom of a bigger set of problems that need to be addressed.",
            "You mustmustmust call in some reinforcements. Hire a maid or sitter if you can afford it.  Ask a friend or family member to sit with the kids so you can clean, work out, meditate, whatever. Put your shame to the side and confide in a friend; I know what a difficult proposition this is but I bet you'll be pleasantly surprised at the love and support you will receive. Even if someone will just help you take the kids for a walk and let you vent, that would do wonders. Being a caretaker is exhausting and if you don't take care of yourself, you're no good to anyone else.\n\nIt sounds like you're probably already doing this, but depending where you live (I'm assuming U.S.) you should be able to access a variety of support services for your children. In addition to school-based special education programs, there may also be personal care assistance, a community companion, or a safe place where you can drop the kid(s) off after school hours for activities and social time. Just an hour to breathe sounds like it would amazing for you. I work in this field, please feel free to inbox me. \n\nLastly, your husband has GOT to acknowledge the tenuous state of both your emotions and marriage. This will never get better if he continues to bury his head in the sand. He needs a serious come to jesus moment.",
            "Your husband also sounds depressed. Has he  been seen by a therapist?  I think it would behoove you both to put this at the top of your list. If he HAS been seen, low libido (yes, even while sometimes jacking off) can be a major side effect.  He could ask to transition to a new medication. \n\nSecondly, PLEASE hire someone or reach out to a close friend about cleaning your home. You cannot be happy in a messy home. And there is someone out there who loves you and shows love through acts of service. Reach out to her. \n\nThird, it doesn't take a ton of effort to start losing weight.  This will come across differently to different people, but I'm talking to YOU and it sounds like you'd like to lose weight. \n\n\nFourth, and this can be done at any time, is self care. Take a bath. Read a book. Light a candle and just sniff it. Sit in the back yard and admire the clouds. Go out to the mall and just look at jewelry. Cross stitch, or whatever your hobby is. Rent a movie YOU want to see. If you want to be with your man, get someone to watch the kids for a night and go out with just your husband. It doesnt have to be anything extravagant, but if theres anything you've thought \"I wish I had time to do that\", DO IT.  \n\n\n**Make yourself a priority. Yes, that will mean letting something else slide, but you are also important and you can't keep up if you don't fill up your fuel tank.**\n\n\n\n**My weight loss regimen recommendation:** \nStart small. Cut dessert and empty calorie snacks for three months. Add in sliced raw red peppers or celery. Add Greek yogurt flavored with fruit.  Don't worry about exercising. Do you already cook? Great, make spinach salads once a week (grill some chicken breast and add to a bowl with baby spinach, a touch of cheese, some tomatoes, berries, onions, and a hint of dressing. Change it up as you see fit).  Don't cook? Awesome! Each place you eat will have lower calorie, more nutritious options. No, they won't taste as delicious,  but they'll be serving a purpose. And remember, just starting with 3 months. Not weight goal. Not an exercise goal. Just a goal of changing your relationship with food. You're eating for fuel, and nutrition. And you're doing it so you feel more able to keep up with your kids and to feel more confident about your body. \n\n\n\n**My cleaning regimen recommendation:**\nIt will take one day. All garbage out first.  New bags in all trash cans. Find all the laundry, sort it, start it. Keep it going as you work on straightening the rooms. Start one room at a time. Usually I start in the bathrooms. Anything out of sight is a new project, so just clear counters and floors. If you find dishes, they go to the kitchen, but dont you dare start washing them until every other room is clear. At this point, take a break (sit down as needed, but distractions get put away through the rest). \n\nYour home, while not spotless, is liveable and will make your brain clear. Next, disinfect bathrooms, vacuum floors, and keep that laundry going. Empty leftovers out of the fridge if it's been a while. Wash the dishes with your friend, or leave them for the cleaner. Dusting is a cleaner's job, or can be saved for a different day. As is mopping. As is anything super gross. Get someone to do it if it's bad, and then work to maintain it or hire it out if you dont have the time. This is worth the expense.",
            "Here’s what you do.\n\n1. Hire a maid to tidy and clean your house 1-2 days a week. They honestly are not as expensive as you might think, and there is NO SHAME AT ALL in having help around the house. You are doing an amazing job as a mother and as you said, you don’t have time to be housekeeper as well. Organise this ASAP - living in a clean and tidy house really will make you and your husband feel so much better. Trust me on this. \n\n2. Look into how much it would cost to hire a professional nanny to take care of the kids, even if it’s only for one day a week. Having that time to yourself, in a clean house, to do nothing but relax and FUN things, will really improve your mood. This will help rub off on your husband,too.\n\n3. Lose the weight. I know you’ve gained a lot and it must feel like you’ve got to climb a mountain, but you CAN do this. It’ll make a huge difference in your self esteem and your husband’s sex drive. Think back to what you used to eat (and how big your portion sizes were) back when you were 130lbs. If you start making those same food choices again, you will eventually get back down there. You don’t *have* to work out, though it’s beneficial - you’ll lose the weight just from consuming fewer calories. A great place to start is My Fitness Pal. \n\n4. Ask your husband what he needs, what he’s stressed about, and how you can help. He may be feeling overwhelmed himself, but keeps it all inside.",
            "Couples counseling STAT. If he won’t go, you go. You can’t continue to take care of everyone else’s needs when you’re not taking care of yourself. \n\nYou’ve been a superhero doing what you’re doing. He needs to meet you halfway and take some of the care taking load off of you. He can’t come home and hide in the toilet anymore. These are his kids and he needs to start acting like it. \n\nBut seriously, you’re with your rights to demand he participates in counseling with you. You guys sound like you have a lot of issues you need help unpacking.",
            "I have been exactly where you are. My husband and I have been together years. We have four children. One has BPD, one has autism, one has ADHD, and my youngest is dyslexic. I am SAHM and my husband works like 70 hours a week. While we are still working on getting our home where we want it we did get our relationship back on track. \n\nFirst thing we did is get a calendar and start planning our weeks together and making time each week for an evening together, even if it was at home to have dinner and watch our show together. That time is sacred and we do not discuss tough topics during that time. We also schedule 30 minutes once a week to touch base with each other on how we are feeling, discuss tough topics, and bring up any issues we need to address. These things started to help us become more connected to each other as individuals instead of parents or partners. \n\nSecond thing we have done is we make it a point to touch one another. A hand brush across the back as you pass behind them. Hand on the knee while watching tv.  Hugs when he gets home from work. Any kind of casual touch. It has helped us become more affectionate with each other. \n\nThird, and possibly the most important for us, we stopped talking negatively about our life. It’s so easy to be unhappy and dissatisfied and it takes real work to make this kind of change but it really helped us. We started making real plans for our future. We decided instead of being negative about the things we are unhappy about we are going to work together to change them. A big component of this is being supportive of the other person when they are having a down day and do your best to keep them motivated to make the changes you need to make. \n\nWe did this two years ago and now we are so much closer and have a great bedroom life. Our children have all their conditions under control and managed. We have made plans to fix up and sell our home to move out of state next year. We have taken two vacations where we hadn’t taken one in the past 7 years. We are working on losing weight together with DDPY. I hope some of this can help you. I really feel for you.",
            "First of all I wanna say that you're an amazing mother for your children! They're lucky to have you. But yeah, you're husband needs to parent his children as well so he can get to know them and you can balance the work load. You guys needs therapy or other intervation to work out your problems.",
            "Sorry - this is off-topic for the question asked. For your younger child, has he been evaluated for Landau Kleffner syndrome? My son had similar symptoms.\n\nIt's a rough situation - I know you're probably burnt out on appointments, but I'd recommend therapy. And just realizing you're both going through hard times.",
            "I'm Autistic and I was raised by a single mom, my husband is also probably on the spectrum though he passes as nuerotypical in almost every way, I know deep down that our common ground and thought patterns are the same. He just has much fewer physical symptoms than I do. I see his rituals, his stims, his patterns, I see the way he struggles with change. \n\nAutism research is coming out so fast right now that doctors can't even keep up. It's as if every strange kid that knew something about them was different became a researcher to figure out what it was and the results are flooding in. We are now learning that most people aren't diagnosed with autism until they are literally disabled by it. In the same way that you suspect your husband may be on the spectrum, it's entirely likely that you are as well. You may not have as many of the physical symptoms, but you are clearly very sensory-seeking (touch and taste) and I'm sure I don't have to tell you that women with autism are more likely to be depressed, anxious and have suicidal thoughts. Women with autism are often skipped over because we tend to mimic behavior better than men are able to. \n\nI highly recommend you do some research into the r/autismtranslated #actuallyautistic community, it may help you with understanding yourself, your younger son, and your husband better. It could improve all of your relationships\n\nIn regards to the weight gain, I also was obese most.of my life because I had a strong need to comfort eat. I lost weight after I was diagnosed ADHD and started meds, that helped me fix my disordered eating habits. What helps me the most now is chewing gum and I have a stim toy from Ark Therapeutic, so much better than chewing gum, it's a necklace I can chew on and after I got it, it made me realize how much of my desire or eat was literally JUST a desire to chew. It has changed my life.\n\nAaaaand finally I agree that your husband is stuck and in denial. And I agree that he's probably on the spectrum because he has some fairly obvious executive dysfunction issues. This is super common in adults that were never diagnosed, they hate change so they wedge themselves into a spot and undercut themselves to avoid having to make any significant changes, they just try to problem-solve the immediate threats to keep the whole situation stable and that's about the most they are capable of doing, abstract big life changes are incredibly difficult to even imagine, let alone execute. \n\nHe's not willing to think about his problems, so he doesn't. So yes, he is still in love with you but he's not willing to address any of the issues in his life because he can't/doesn't know how. Executive dysfunction on a huge scale is something I experience a lot, a few examples: can't come out as gay if you haven't been in a gay relationship, can't be in a gay relationship unless you come out as gay. Can't get a job without experience, no job will hire you without experience. I want to see a doctor to feel better because I know my life is a mess, but doctors only make me feel worse?? I can't be openly autistic if I don't have a diagnosis, but if I can't hide my autism, that must mean I'm not really austic/don't need a diagnosis?\n\nAll of those are walls that controlled my behavior and would get me stuck. I did eventually get unstuck, but the only way to do it is to force yourself to think about the unpleasant things and have someone talk you through it, help you through it. On a small scale I experience executive dysfunction when I'm lying in bed and I CANT get out of bed. Sometimes my husband has to carry me to the bathroom so I can start my day and make it to work on time. It's like I'm a turtle stuck upside down and I need someone to flip me over\n\nYou gotta flip him over. But I warn you, it is a can of worms. If he doesn't want to look inside you can't make someone. You can't make someone be happy. If you usher in a diagnosis for him, it won't help him if he doesn't realize he's stuck. I'm sure he absolutely does love you and he doesn't want to live without you (like you feel with him, and he also wants to see through his end of the deal, caring for you as a partner and being a father.\n\nThere are things you both can do to address the dead bedroom. If it helps you any, I have also been in this situation. The energy it takes to masturbate is much less than the energy it takes to have sex with someone and fulfill their emotional needs and this can be hard to manage for us spergies. One thing that helped me, was learning about emotional labor. When it takes effort to do emotional things but we plan and allocate our energy accordingly so our partners and relationships don't suffer for it. \n\nBecause I am attention and touch seeking, I found it helpful to make an agreement that if they don't have it in them to have sex, we cuddle naked for a half hour instead. My desire for sex is honestly 85% a desire to be held and cuddled, 5% a desire to feel like I'm sexy, 5% a desire to feel like I'm a good wife, and 5% horny. I can do other things to make myself feel sexy, and feel like a good wife, and get off. I can't cuddle myself. So he makes time to do this for me and honestly the skin contact over time helped wake his libido up. Another helpful thing was kinda loosely planning sex. I track my cycles and there are just times when we tend to have sex. It's basically become part of our routine. I promise it's not as unsexy as it sounds, it's honestly less like we plan for it and more like our bodies do. We just know we're going to want it then. So like if I'm horny and he's not in the mood, I'm not bummed out because I know there's a time coming in the near future. He also makes an effort to spend more emotional labor on giving me attention, especially if he has to shoot me down\n\nAll of that said, these are all super easy to accomplish when you aren't busy with kids. Let alone kids that the world doesn't understand. I agree that you guys are super undersupported and it is Impossible to develop better relationships with others if you can't even develop a relationship with yourself while you're stretched past your limit. Others have made suggestions on what to do in that arena and I hope you find those suggestions helpful\n\nAaaaand finally I wanna add some words of Hope and encouragement that you find a channel of communication with your younger kid. Maybe they will be hyperplexic, maybe they will be gifted with art. There's a channel in there somewhere, I wish you the best of luck finding it",
            "I read this whole thing and didn’t read one thing about you doing something for yourself. I honestly feel like, along with other people’s advice, that you should find something that brings you joy. Because regardless of what happens with your husband and kids you still need to be happy. Your kids want to see you happy as they grow. \n\nIf working again is what would bring you joy, find work you can do part time, if some kind of hobby brings you joy, find a group of fellow crafters to meet with and do projects with. \n\nFind something that brings *YOU* joy.",
            "[removed]",
            "idk if this can be any help at all, but when i was in nursing school (i’m an rn), i would see a lot of postings for people looking for nursing students as babysitters or home aids for the elderly. a couple of hours here and there of help could probably make a big difference for you; nursing students that are looking for a little extra cash are great bc they HAVE to be CPR certified, are usually very patient, & many are looking to get into peds once they graduate.",
            "I hate to say it, but you already know that your weight is one of the main reasons for this change. Having two special needs kids is very tough on a marriage. You’re doing so much for them. But you also need lose the weight for yourself. Look into “calories in, calories out” and download My Fitness Pal.",
            "[deleted]",
            "I would insist on counseling. He likely needs individual counseling, sounds like he himself may be depressed but some things you write here. Don't just offer counseling, be form that you need his involvement for things to get better.",
            "I think he is trying to save your feelings. He might still love you, but not be attracted to you physically anymore. I'm not trying to be shallow when i say you probably need to lose the weight in order to bring back the physical attraction.\n\nPeople like what they like, and if you were literally half your size (130) vs being 260 now, that may be hard for him to accept",
            "I don't think that your weight gain is related to or a reason for to the disconnect/disinterest in sex. Plenty of people in your weight range are sexy, desirable and have engaged and involved partners. I think if you blame yourself or feel like you don't deserve a physical relationship, it's going to be an uphill battle to get back to a better place.\n\nI wouldn't normally tell my entire life story in a reddit thread, but we seem to be living the same life. I'm just further down the road than you are. \n\nI have two boys with special needs (autism - different places on the spectrum, but higher functioning) and a younger daughter who would probably be called gifted/neurotypical. \n\nMy ex husband had colon cancer the year before we split up (and he recovered). He suffered from depression for most of his adult life. He was eventually HIMSELF diagnosed as being on the spectrum. You might want to consider this as being possible with your husband - many families find dad or mom is a little autistic. We became very disconnected over the final 5 years or so of our relationship. \n\nWe worked on all of it. I eventually lost 100lbs just before the cancer diagnosis (went down to about 205 from a high of somewhere over 300, also 5'8). It didn't make any difference, we were just so far gone and he didn't know how to work on it without me doing all of the planning and work. I think between the kids, the stress of everything that happened, I also wasn't working..   It was too much. We'd also gotten together young (I was 19) and we had changed dramatically as people. With him being a little autistic, I'd been basically coaching him as to how to become a decent husband for YEARS. It was exhausting. I couldn't fight this final battle too. I couldn't ask him to step up and love me properly anymore. I needed him to know what was needed and just DO as needed. So, it ended.\n\nI got a job, I kept the house, and it was a rocky time for a while. Eventually, he figured out how to be a single parent and so did I. The kids adjusted really well. We have a great routine and a positive attitude. I've had a few long term relationships over the past 6 years since we separated, he eventually found a new partner and they have a house together. She seems to be good for him and the kids like her too. I'm recently out of a relationship and on the cusp of starting something new - slowly. Things are going well, I love my work and I have the house under control. Currently I'm about 235, 42 years old and I feel secure, sexy and pretty happy. It took a while to get to that place, but I did get there. \n\nThat's my story. \n\nIf you want to work on it, please realize that what has happened to you is HARD and it takes both people working on it and being conscious of the other's needs to make a difference. You can't shoulder all of the blame here. You can't do all of the work to save it. You can't be the only one to acknowledge that there is a problem. \n\nWhat would have really helped in my situation was: my ex stepping up in a meaningful way. I would have wanted him to remember my birthday and mothers day, touch me when we were both in the kitchen at the same time, try to do things to make me happy, try to fix things. I think I should have returned to work rather than staying home - my mental state improved dramatically when I felt I was doing meaningful work that supported my family. We should have pressed the issue of taking time specifically for us. We didn't have family support in the way of babysitting or any acknowledgement that things were hard. \n\nThat said, I'm not sure that it would have saved anything, but it might have helped. \n\nI really, really feel for you. If you ever need to reach out, I am around and seem to have lived all of this. All the best, OP.",
            "You said you had self esteem issues since you were younger and I think it is the main driver of your current problems. You may love your husband but you need to love yourself more.\n\n&#x200B;\n\nLook at what has happened so far: you sacrificed the career you wanted for your family. You are taking care of two high-demand kids, with virtually no support from your husband, who disappears all day every day. He may be on the spectrum and therefore has difficulty seeing your point of view anyway. On his birthday, he treats himself; on your birthday, you wait for something from him. You neglected a healthy diet and lifestyle for yourself while pouring all your energy into your kids. You don't mention friends or a social life, but I'm guessing those are nonexistent. Now you are begging for scraps of affection from a husband who is living comfortably while you are suffering.  \n\n&#x200B;\n\nSome of these decisions are understandable, and a sign of your love for your family. But when you look at the big picture, doesn't it seem downright cruel to yourself? Would you ever make a friend or loved one live this way?\n\n&#x200B;\n\nPLEASE start putting yourself first. Carve out time for yourself. Get help from hubs and/or a cleaner. Make time for an exercise routine. Make time for your hobby or something you enjoy doing. Plan outings with friends and family aside from your husband. \n\n&#x200B;\n\nWhen you take better care of yourself, it may rekindle things in your marriage. But even if it doesn't, at least you will feel stronger and that will help you decide what to do next.  Good luck.",
            "It can be hard when you're juggling family and work to Invest time into a relationship. Add to that all the worries of having 2 special needs children and you have a lot of other commitments that will take away valuable time. \n\nI think you both need to go to couples therapy. Clearly the current situation is not working well for either of you and something will have to change if you both want to stay together. He cannot say nothing is broken if he's never home or upstairs hiding away.  \n\n\nI think if you can get the right support, perhaps he will see that time for both of you to go on dates or see mutual friends together will help. If you don't have happy times together then the relationship becomes a burden. \n\nHe does sound depressed and I wonder if the stress of the 2 kids being special needs was too much for him to cope with and it just spiraled from there? you both had something of a grieving process perhaps when your son regressed and while you have learned to cope your husband has not.. Just a thought",
            "If your youngest is 4 then both your children are very close to being in school.\n\nMaybe go ahead and put your 4 year old in preschool.  I assume your older child is at least in kindergarten if not older and in full time school.\n\nSpend your free time on yourself join a gym see a registered dietician.  Also don’t forget to check in with your primary care doctor.\n\nNot everyone is cut out to stay at home with babies.  It’s hard work and not always mentally stimulating.  \n\nConsider looking into going back to work if you can find a nanny.  Other options include part-time work and hiring a housekeeper.",
            "It sounds like he may also be depressed. This was how my father acted when he was depressed. Maybe you can convince him to see a doctor?",
            "I'm really sorry for all that you're going through. People have given some great advice so I'm not going to reiterate it, but I used to work in disability advocacy so I wanted to bring up a couple of options you might consider exploring. The state I used to live and work in (Minnesota) was admittedly more progressive on this than most, but the point is that there are likely state programs that could help you get some relief, one way or another, even if it's not as extensive. I know you've been going through this as long as your children have been alive, so I apologize if you are way ahead of me and already know about this stuff. Anyway, disability things to look into:\n\n\\-Becoming a \"paid parent\"/being recognized as your children's personal care assistant/direct service professional (PCA or DSP). I know parents sometimes feel guilt around this but as you recognized, it's like a full time job, doing all these things. So if you can get some reimbursement, definitely look into that. Alternatively, you could look into getting part time help from a PCA or DSP.\n\n\\-Some states have programs to provide assistance to families of children with disabilities that technically make more than the threshold of income. Your comment about how your husband makes decent money but you wouldn't necessarily be able to tell due to costs made me think of this. You might be eligible for services, even if you don't think you are.\n\n\\-Disability community. I did not have any experience with the community prior to my job but I was blown away by the community there. Parents, other family members, professional advocates, self advocates (people with disabilities themselves)... don't count them out. There are facebook groups, in-person support groups, and more. I knew one high functioning teen girl with autism who had a support group of autistic peers to spend time with and this was really helpful to her. As your kids get older, this might be helpful. Look into local disability nonprofit organizations for support and resources.\n\nOn weight loss: if this is something you'd like to pursue, come join us on r/loseit! I'm on a \\~weight loss journey (gag) myself right now. Sometimes I kick myself for not starting sooner, but the truth is that for whatever reason, I wasn't ready until I was ready. Nothing wrong with lurking and gaining information until that point arrives.\n\nI wish you the best and hope you will take some of the advice in this thread-- you absolutely deserve a break and I hope things work out for you.",
            "I’m not sure if anyone added this and it seems like you may be well connected to resources with your different therapies but definitely check out your community center board and see about available respite care options. They can connect you with people. Typically, there are funds and grants for this and people who work respite care are knowledgeable about children with special needs. You deserve a break and at least a minute to do something for yourself. I’m sorry so much is going on. It sounds like you feel lonely. You have  done everything you can to support your children. There is support out there for you too.",
            "It seems like you need to invest in help.  You mention your husband bought himself something expensive for his birthday so it doesn’t seem like you’re struggling financially.  Why not invest in some household help? Have someone come and clean the house every couple of weeks.  Invest in a meal delivery service, if only for a little while, to give yourself a break.  Insist on therapy with your husband, it doesn’t sound like he refuses to go, but said nothing’s wrong, and maybe he doesn’t think so, but YOU do, so take him.  Was your husband exhibiting evidence of being on the spectrum before the kids were born, if you think back and say no, he may just not know what to do with them.  Perhaps try teaching/showing him.  Insist he comes with you to put the kids to bed, show him how you do it for a week, then the next week he does it while you’re there with him.  It may also not be that he’s not attracted to you, but is also stressed and worried and doesn’t know what to do, but therapy can help that too.  Bottom line, a housekeeper twice a month, meal delivery and THERAPY to start.",
            "First of all, I just want to let you know how amazing you are. This is a lot to go through and it sounds like you are an amazing mom that always puts her kids first.\n\nA lack of sex is not always an indication of how much your partner loves you or how attracted to you they are. At least, not in the face of this much stress. For a lot of people, stress absolutely kills their sex drive regardless of who their partner is, so I don't think that his behaviour necessarily means that he is in denial about his feelings. I think that it indicates that he has very avoidant/escapist coping strategies and doesn't know how to relieve that stress productively.\n\nIt sounds to me like you might view self care as a luxury that neither of you can afford in the face of your children's struggles. But that lack of mental health maintenance is causing a ton of emotional/physical problems. Of course that's easy enough to diagnose as the problem and much harder to fix.\n\nI would take time with your husband to think about and discuss what you both need in order to feel healthy mentally. That might include more productive strategies for coping with stress, including strategies that can help connect the two of you emotionally. \n\nI agree with others regarding calling in backup of some kind in the form or childcare or housekeeping or even meal prep. Spending more time maintaining your mental health will make the other problems just a bit easier to tackle.",
            "You mentioned that food has become a coping mechanism for you, which is how things started for me too. It quickly turned into binge eating disorder. This is mostly unrelated to your other problems but please talk to your doctor about this!",
            "This comment really helped me turn myself around. Have a read. \n\nhttps://reddit.com/r/getdisciplined/comments/1q96b5/_/cdah4af/?context=1",
            "I’m sorry to hear all this, I must say though, you sound like an amazing mom who would do anything and everything for your kids. Of course, with this comes a price, you have no time to take care of yourself. It’s so hard to know where his head is. However, it sounds to me like he could be more helpful with the kids. You said he comes home and spends a bunch of time hiding in the bathroom. I think this needs to be addressed. Like where is your time? Sorry, off topic but I thought it was important to mention.",
            "I’m sorry things are so hard right now - no wonder you’re exhausted and frustrated.  It sounds like you need to start taking care of yourself some and stop worrying about everyone else 24/7.  I like what other people have said here...  if you’re making a decent income then use some of it for child care and / or help around the house.  Try to get away from the kids and home and do some thing for you too!",
            "Since you expect your husband to be on the spectrum too, it might be very well the case that he doesn't realize his emotions. This is not uncommon with people with Aspergers, whether they are high functioning or low functioning. That means sometimes you'll have to push him. \n\n&#x200B;\n\nSit down with him and tell him: \"I love you very much, but I believe you do have a problem. You experience sensory overload quite a lot, also your symptoms fit the criteria of depression.\" Have the list of criteria ready and check them off with him. He most likely is not aware he has a problem. \n\n&#x200B;\n\nThe 'atypical' way in which people who are on the spectrum experience emotions can often cause being reserved and not actually processing emotions. Your partner doesn't want help, because he doesn't see the problem (he genuinely doesn't see it). I think actually making him realize the problem would make him more willing. When it comes to sensory overload, a lot of people benefit from noise-cancelling headphones. \n\n&#x200B;\n\nApart from that I agree with the top comment.",
            "I read somewhere that, if parenting is a 24/7 hour job, then parenting special needs kids is 24/7/60/60—24 hours a day, 7 days a week, 60 minutes an hour, 60 seconds a minute. It is FUCKING HARD and frankly it sounds like you’re killin’ it as a mom. Give yourself some credit!!! Yes, you and your husband gained some weight, so what. You are both stressed to the max. If food helps you cope, well, it’s not ideal, but it’s better than alcohol or cigarettes or opiates. \n\nSpecial needs kids are also very hard on marriages. Sadly many marriages do not survive when a baby is born with special needs. But obviously you’re wanting your marriage to survive and thrive. So kudos to you for that. \n\nI am guessing that your husband still loves you, but is rejecting you sexually because he feels guilty and depressed and inadequate and stressed out, and that makes him not want sex. Maybe there is some bullshit going on at his work that he doesn’t want to burden you with so he keeps it to himself. And that’s a good insight that he may be Asperger’s himself—there is a genetic component, after all.\n\nI agree with the other comments. You and your husband need help. Housekeeping help, and caretaking help. And I’m a huge fan of counseling. If he won’t go, then counseling for you definitely. Not because there’s something wrong with you, but to help you develop some coping skills and techniques.",
            "It sounds like you two need to sit down and make goals on how you can be happier and healthier. I know it's hard since you are both in demanding situations, but you are both in a negative spiral which you need to break. \n\nFor example, you set yourselves a goal that you're both gonna commit to a whole foods paleo diet (or what ever you fancy) for 12 months together. You could also decide to stop drinking together (if that's an issue).\n\nFind a way to exercise that fits your circumstance and make it fun! It all starts with you two sitting down together, confiding in each other and then creating a plan on how you can get the most out of life. You're overweight and overmedicated, these things feed each other. You have to confront the issues the cause you to sedate yourself. Break the cycle!",
            "You truly sound like a lovely person. Huge congratulations on getting your oldest to where he is today. That took a mountain of love and effort. Sounds like your marriage is currently not in a good place. I think you need to carve out some time for yourself to exercise. Give yourself half an hour every day. Start by walking, ramp up slowly. You will start to feel better about yourself and soon, you will start to look better. Exercise has been described as a magic pill, and truly, it is. It won’t fix everything that is wrong with your life, but it will help you feel better and that will spread into every book and cranny of your life. Once you start to look and feel better, your husband’s interest in you MAY reignite. But if it doesn’t, you will have tried, you will feel better about yourself and you will be in a better position if the marriage ultimately does break down. You can’t fix everything, but if you do this one thing, you will feel better about everything. Sorry I can’t be more help...this is the only thing I know.",
            "My God woman, you are incredibly strong and resilient to be going through all of this alone. I have a small grasp on how hard it is to raise one special needs child, but two? We need to take a moment here to appreciate your inner strength. Those kids will have a great role model with you. That being said, you didn't really mention how you feel about your body. Do you want to change it or do you maybe just need to feel sexy again? I would chat with him and see if maybe the lack of confidence is what's killing your bedroom instead of your weight gain. Otherwise you could try finding an activity that you enjoy doing (like swimming, running, kick boxing) that you will commit to 3 times a week to improve yourself. Exercise can also be a great emotional outlet, so I recommend that regardless of your body image. \nI also second the maid/caretaker/therapy answers. You have a lot going on and you need help. That much is obvious to strangers on the internet. I'm unsure about the cost of those things, but I would reach out to your children's doctors and see who they reccomend. Also you might want to find communities/support groups for parents with special needs children. That way you can vent and receive helpful input from people who are going through the same thing. \nI hope you and your husband can work things out, and I'm sure you both will because it really sounds like you love each other dearly. I hope you can update us with good news soon. Best of luck!",
            "Why do you not stand up for you and your kids? This man needs to get off his ass and be a present husband and father. I'd tell you to have him leave, he's useless.",
            "[removed]",
            "Well how low functioning is the younger one? Will he ever be able to live by himself? I suggest getting help from the state",
            "I grew up thinking I had to do everything myself. Never had a maid. Not too much of an idea even how to have fun. I don't know if this is part of your problem. Just something to consider.",
            "You both sound depressed to me. You might want to seek out help for both of you. You also might want to set up some me time for the both of you. Having your life revolve just around your kids is good, but it can lead to us neglecting ourselves. You might want to also look for support groups for parents with autistic kids. Good luck op",
            "Aw, I’m sorry you’re going through all this. I’d recommend seeing your own therapist, it feels amazing to discuss your weekly life with someone regularly. Also, maybe suggesting your husband goes to therapy as well. I also am a firm believer of exercising! It helps with depression, makes you feel good, helps you lose weight. Then, consider what type of food you’re eating - I can’t imagine having 2 special needs kids, so I’m sure it’ll take time to figure out but eating healthier will be a wonderful addition to losing weight, having a better mental state, and feeling good about yourself. The food we eat is directly related to depression and the cause of sooo many cancers. \n\nAs someone else said, getting a maid in there to help with the bulk of cleaning every week or other week will be sooo beneficial for you. Then, you’d have an easier chance keeping it clean. \n\nAlso, hiring someone to help with your kids a few times a week will take off the burden so much, so you can go out with your girlfriends, have sex with your husband, or go have some serious necessary alone time!! Best of luck, you can do this! Start going for a walk everyday - it’s summer! Find a new place to explore or even walk around your neighborhood/house - that’ll always kickstart exercise!",
            "DOUBLE POST!\n\nSERIOUSLY LOOK INTO RESPITE CARE IN YOUR AREA! Nearly every family with kids with special needs that I have known have outside caretaking as the cornerstone of their success.",
            "Any chance your husband is dealing with depression too? When my depression gets bad, I'm kind of like this too and I guarantee it's the shittiest thing ever for my wife.",
            "I grew up in an environment where my parents had a similar relationship.  My father truly loved my mother, but only showed it by being a good provider. He was a good father to me but not so great to my brothers. My mother felt totally unloved for years. And it wasn't about weight or special needs kids or a dirty house because she didn't have any of those issues.\n\n\nWhat happened with them is that my father (who i strongly suspect is in the spectrum) just could not give my mother what she needed.  She tried to tell him many times that she was unhappy and needed affection and love (and sex). They went to counseling a couple of times.  But my father just could not comprehend that his behavior was causing his marriage to disintegrate.  He was perfectly happy. He was able to do what he wanted and have it all. He didn't need (or want) a strong physical relationship to be happy and he didn't ever feel unloved because my mother did everything he expected and more.  He just couldn't get it through his head that my mother needed something he didn't understand and he didn't make much effort to meet her needs. \n\n\nAfter years of this, a predatory man began showering my mother with attention and she ate it up like a starving person finally getting gourmet food after years of nothing but the minimum to survive. My mother had an affair with him and eventually left my father. She was in an abusive relationship with that man for the rest of her life until she died.  Not a happy ending for anyone, least of all her. \n\n\nYou're human and you have needs. And limits.  It's time for marriage counseling. You have a lot invested in this relationship and if it can be salvaged, that's the ideal for everyone.  You are probably right about your husband being on the spectrum, he strongly reminds me of my father. That means he has some deficits that he probably had no idea about. \n\n\nIt's also time for individual counseling for you to figure out what you really need and how to get it. You need to step back from your endless responsibilities and get some help. Childcare and house cleaning support would go a long way. You need to get yourself emotionally healthy.  \n\n\nI always wondered whether my parents marriage would have survived if my mother had been a better advocate for herself.  I wondered whether my father ever understood how serious these issues were - he always said he was blindsided when she told him it was time for a divorce.  Your husband may be in the same boat. He's getting by and had no idea how dire the situation has become. \n\n\nBut it's also possible that no matter what you do, he won't ever change and won't ever be able to meet your needs. If that happens, you need to really evaluate whether this marriage is worth staying in.",
            "On top of the great advice everyone else has given, it sounds like he has depression. I think you both would really benefit from some therapy, and also scheduling regular alone time, but also a date night where it's just you two and no kids. You're both working your butts off and need time to relax and be yourselves",
            "There is some awesome advice ITT but your husband must address his health issues. \n\nEarly 30s with “some but not major” health issues means it is only going to get worse, and it will get worse faster if you guys don’t address it. Especially since he is the sole provider for you and two SN kids.",
            "I really admire you for how well you're doing. Stuff sounds hellish, but at the same time objectively you've been a boss. You've been able to help your kids make medical progress, you dealt with your own very understandable mental health challenges, you've enabled your husband working and being successful, the trash is getting taken out and the dishes are getting done, you're still married, I'm not hearing anything about drug/alcohol problems or serious money issues. It still makes sense that you feel as bad as you do/are worried about things. I'm not saying your problems aren't real, but that despite your problems you've done well for you and yours.\n\n&#x200B;\n\nOne thing I do want to point out. You seem to have the logic that if a. your husband doesn't want to have sex with you or act a certain way romantically then b. your husband doesn't love you. On top of that you've come up with a very convincing narrative to back it up of, \"he only stays with me out of guilt.\" You're taking your husbands actions and interpreting them as if they're about you. And maybe they are! But there's a variety of other explanations. What if you trusted him that he does love you? I think then that implies that your husband is having challenges of his own with the life y'all have together. I hope he can be honest with you both if that's the case, but if not it's your job to take care of yourself, which there is tons of good advice for in this thread.\n\n&#x200B;\n\nIf you did trust your husband that he loves you, could that change the conversation between you? Even if he does love you it sounds like he's not expressing that love in a way you can feel and hear, in a way that nourishes you and y'all's relationship. Your desire for him observing special days, talking during date nights, and having sex with you is ultra reasonable. If he's not going to be able to give you those things then it changes the terms of your relationship and you get to decide if that's a relationship you can live with. Could you ask him to love you differently? Could you ask him to do things that make you feel loved? Could y'all work together on connecting, recognizing you both might have limitations, but also that if he's gonna say he loves you and have you trust him then he needs to show it too?\n\n&#x200B;\n\nGood luck, this internet stranger is rooting for you and your family <3",
            "Can you find a support group for parents of kids with special needs?  I think your husband is overwhelmed and doesn't know how he can help you with the kids.",
            "Raising kids is stressful and hard. Add in another kid and having to manage their exceptionalities and your life is double, triple, quadruple hard. How much time do you have for yourself, to be your own person, to do your own thing?  Can you carve out one night a week that you are out of the house and your husband is on parenting duty? It will be hard. He won't do things the way you do them, your kids will be annoyed that the routine is adjusting but they will be just fine. He won't do it perfectly but as long as the kids are still breathing when you get home don't ask any questions on how it went - just assume he managed because he is a competent parent and did just fine.  Even if it was a few hours of everyone crying and everyone melting down - that shit does not concern you. Your husband will figure out a way to deal with it and get through it, just like you've managed to deal with it and get through it. \n\nOn your night off you need to find something that is rewarding only for you - a yoga class, a painting class, sitting in the library in sweet silence and then going to a restaurant to buy yourself a glass of wine and read your book, meeting up with friends, taking night school, having a therapy appointment, taking a walk, snuggling puppies at an animal shelter, volunteering at a food bank, you can exercise with the goal of only getting a mood boost - do not exercise to lose weight, just move your body and have fun.  . No chores, no work, no errands for the family - completely and 100% YOU. You've been a mother, and an educator, and a therapist for your kids since they came out.  It's been a full time job 24/7.  Now is the time for you. Take it. Protect it. Enjoy it.   \n\nOnce you have that down every week for several hours away from the kids, try and find respite care - maybe a saturday late morning so you and your husband can go on a date? Lunch, a movie, a walk. Get to know your husband again. Relax with your husband, let him get to know you. No errands, no chores, no kid duty. Just have fun with your spouse. \n\nI think if you could take back some time for yourself, and your husband can take back some time with you and you both can start to relax it might help the dead bedroom. is it possible that he is depressed as well?  When my husband was depressed sex was off the table. He just couldn't deal with the added pressure and trying to have sex and possibly failing yet another thing in his day was just unthinkable so he avoided it at all costs.",
            "\nI don’t have advice really.  Sorry. \n\nI can relate to you in so many ways other than being married as long as you have.  My oldest is on the spectrum and my youngest might be? We don’t know yet. I am stay at home and yeah it is so draining so it bleeds into other things.  One is I am the only one cleaning and taking care of certain things so I feel I am drowning. \n\nI am about to juggle a ton of appointments for therapy also. I can’t drive at the moment so it is even harder.  Huggles x 10. You are not alone.",
            "I work in care.\n\nYour burning out, probably both of you by the sounds of it, I work 40 hours week and go home, your doing 168 hours a week. \n\nPlease get some help before you start to hate your kids (yes it happens) it is very sad to see it. \n\nIt sounds like you do not like the size you are, download my fitness Pal, it'll track what you eat and give you a goal (don't miss anything out, even if you go over)\n\nHow much processed food do you have? If it's lots it will affect your mental health",
            "Going to go for a more wild shot here- consider that your husband may also be depressed. Guy's being run down completely into the ground, it sounds like his wife is having a hard time, and it sounds like his kids are going through a lot. The jacking off honestly is part of it, I don't think he *doesn't* love you, especially considering how much he puts on himself to support the family.",
            "Special education facilitator here. There are many early intervention programs for kids showing signs of disability like your youngest. I would contact the local school districts special education department. You need to contact the district office. Often they will evaluate and offer services. I would start there. He may even qualify for developmentally delayed and be offered a program ( usually at age 3 or 4). These program and services are at no cost for the family and he cannot be removed from the program for behavior. I would start looking ASAP. That will free up some time for you to get yourself together. Get back in the gym. Get the house clean. Plan a trip for just you and your husband. Early intervention is key! And it will make your life a lot easier. PM if you have questions on where to start for the younger son. If you tell me what state I can direct you to resources. It will take a lot of stress off your relationship.",
            "You sound like such a sweet and loving mother and partner. to echo everyone in this thread, you just need a hand! if you can find a way to carve out some time to reclaim your independent identity and pour some of that love into your own cup via personal time and taking care of your body, you will feel so much better. good luck to you, friend.",
            "Girl, just wanted to chime in and say YOU FUCKIN ROCK.\n\nHoly shit, look at all you have accomplished. Right now you are in the thick of it. In a few years time, you will see all of this hard work as incredible. You have no idea how special you are. You are prioritizing what you need to because of everything on your plate which is more than anyone really has to go through with young kids. I am so enamored by your post and your ability. \n\nTo piggy back on suggestions - try 2x month mandatory date night. You plan one and he plans one.\nIf you can afford it, outsource an eating plan delivery service so you feel better about you. I am a sugar junky when I'm stressed. If you feel you've spiraled, go ahead and reverse track. No big deal. \nIn 6 months time, mommy make over- hair, clothes, massage.\nSet personal goals for yourself and prioritize them. \n\nKeep doing you, you sound awesome. \n\nAnd yes, call in reinforcements and get a maid. \n\nBig HUGS.",
            "Like a lot of others have said, if he’s doing well for himself and is successful at work why cant he afford to hire a cleaner a couple times a week or someone to help you with your kids ? Its worth asking if it will save your marriage",
            "There is a book you can get and read together it’s amazing it’s called Real marriage  the truth about Sex,Friendship and a life together read it together then talk about it I think it will help you",
            "Lots of other people suggested hiring a caretaker, but I think you should look into govt resources in your state/country for disabled people or people with disabled children. I have a disabled sibling who gets a caretaker paid by the govt for 30 hrs a month so my parents can run errands, go to work, etc.",
            "He sounds just as depressed, I would let him know how his lack of no actions is effecting you and the kids. Ask him to open up , men or some men dont know how to experss or Express  their feelings when needed . I have even tried ultimatums if my husband gets stubborn about. Although it seems you want to please everyone I believe you doing your mom job is important enough , but focusing on how you are doing mentally and physically is only something you can fix as for your husband as well once you both get to that point I'm sure your relation will flourish",
            "There's a lot of great advice here that I probably couldn't top, so I just want to say hang in there! It sounds like you've done well by your kids in some tough situations -- that's great, and it says a lot about your strength as a person and dedication as a parent.",
            "My advice may be poorly worded but it's from the heart.every word is true and has the best intensiona behind ut..we are all different not meaning you or me is wrong  just different and while your mom paid for 6 weeks of community collage and they taught you fancy words compared to my 8th grade drop out ..I still feel my advice is every bit as sound as yours thank you sir and have a good day",
            "I’m sorry this is the state of your life right now. \n\nAlready, it’s not fair that you’re a stay at home mom with this huge responsibility of taking care of your special needs kids, while your husband goes out to work every day. \n\nThen, when he comes home he is equally uninvolved. Sure, he’s tired from work, but you’re tired from being home and taking care of two kids all day. It’s not fair that he gets to escape and you accept your fate as a “stay at home mom”. You being a woman doesn’t mean you have to handle the family alone and your husband gets to be as uninvolved as he chooses. That’s not equal or fair. \n\nYou need to consider daycare/childcare, and possibly go back to work yourself, just to get your mind off things the same way your husband gets to every single day. \n\nAs far as the no sex, I am also a female that needs sex to feel loved/validated by my boyfriend. If I was only having it twice a month after begging for it, I would be destroyed. \n\nIf he cares about you/your mental health/your marriage, he will agree to go to counseling with you where you can sort out your problems/stresses hopefully enough to have sex again. Again, I reiterate, making kids was a 50/50 effort, and raising them should be the same.",
            "Lose the weight. Lose the weight and work on yourself. You are taking care of your kids, which is commendable, but you also need to take care of yourself. I got fat too and it is all my fault. I have been working on it (20 pounds down so far). People will tell you he is supposed to love you the way you are, but that is a bunch of well intentioned bs.",
            "Maybe because you’re extremely obese????",
            "I just wanted to say that the weight gain is not all your fault. Those anti-depression medications cause people to gain weight.",
            "There's so much to unpack here so I apologize for the length of my response.  \n\nLet me start by telling you a little about myself. I'm a 41 year old woman who is the mom of two kids on the spectrum. Mine both are high functioning but while they both have genius IQ's they struggled with things that are as simple as tying your shoe or remembering to take a bath. I was a SAHM for 12 years until my divorce for exactly the reasons you stated. There's 11 billion appointments and with the amount of constant reminding and looking after my kids it took it seemed ridiculous to have me go to work.\n\nI'm telling you this so you can know I speak from experience and empathize with your position because there's several things that are going on here. The one I relate to the most is your depression, especially over your youngest's abilities. My youngest was my hard one. I lived in constant fear of being called from the school and just felt like this big huge failure as a mom. It was and still is a difficult road but back then I had depression so bad. I have to tell you, you need to get help. That means therapy plus meds. If your meds and therapy aren't helping then you need to change them.  You have to take care of yourself or you will not be able to take care of anything else. I suspect your husband might also need some therapy for depression as well. The disappointment and despair you feel when coming to terms with the life you pictured for your kids will never happen is no joke.\n\nI also think despite yall being busy and tired you need to see about getting into therapy together. These issues with your husband will only grow until everyone is so miserable that the whole thing implodes. Talk to your insurance company and see if they allow for respite care. A lot of them do if not, then look into your local autism support network and treat that like your second job until you majestic friends with at least two other autism mom's so you can trade off child care.  You and your husband are going to need some kind of way to have time to rest and reconnect and you can't do that with the kids around.\n\nHere will be the most unpopular statement I'll make.  I know you're tired. I know you're depressed. I know you feel unmotivated and it seems pointless but....clean up your house and take care of yourself. I almost hesitate to say this but honestly I have to. When I was a SAHM my house was spotless. I made home cooked meals every night. I'm only telling you this so you can see its doable. It takes planning and it takes resisting the temptation to let yourself off the hook because you're tired but it CAN be done. I want to be clear when I say I'm not telling you to do this for any other reason than yourself. There's no way you can even begin to start to feel better when everywhere you look there's a mess including in the mirror and your husband. You can't control your husband but you can control yourself and your environment.  My ex husband was messy as well and never lifted a finger and my house was still clean. One of the things that best improved my outlook on myself was to start taking care of myself. I started out dressing a little better then experimenting with my hair then make up etc. In the end I had a better self image all around.\n\nThese things will all take herculean efforts I'm not gonna lie. But I believe in you. You can do it.",
            "I am so sorry. It is time to hire help or apply for benefits for your children. It is also time for you to have a very clear conversation with your husband. It’s great he works and makes money. It is not ok he has saddled you with enough life responsibility to utterly destroy your life. Something needs to change, you can not continue this way. I would begin to look for a therapist for yourself and talk to husband about going to couples therapy. You can change things but it will be you doing the work. I wish you luck ❤️ you are an absolutely incredible mother. Your children are beyond lucky to have you.",
            "OP I’m so sorry you’re dealing with all this, not surprising you’re blue. I agree w other commenters that you should bring in some help to free your load a few nights a week, both in the form of care and a maid (even 2x a month will make a difference)- you deserve time for yourself too. Your life as is sounds overwhelming to say the least. \nAlso, I’m not sure if you’ve heard of r/keto and r/ketorecipes but I recommend you check them out if not. I lost weight fairly effortlessly following keto after feeling like the scale would never move for me. I’m not saying you should follow this way of eating, but part of why I like it is because of how positive and supportive the community is- the energy of the sub has really helped me stick with it. \nOP I wish you only the best of luck!! Sending you good vibes <3",
            "Read the post and some other comments and it sounds like your weight is a major issue not just for your marriage, but for the way you view yourself.  I know from experience how hard losing weight can be and how easy it is to put it on when you have no time for yourself.  Is weightloss something you are interested in?",
            "Some excellent comments from others - but one thing I have to say is it seems like your husband is in the depths of white collar hell. From what you say, he clearly hates his job. \n\nYou mentioned you are ethnic - is he ethnic as well? If he is, depending on how his upbringing was, he may be very reluctant to open up to people about this. He may have been raised in the kind of household where he was pushed into his particular career, and sky high expectations were placed on him since primary school. \n\nIt’s bloody hard for a provider to admit that he is struggling.",
            "Im sorry but all the love in the world wouldnt make 260lbs attractive",
            "Having read your story twice, the Keto diet popped into my head multiple times. I’ve been in a somewhat similar circumstance, and the depression is the real enemy here. \n\nFood can provide an emotional high as strong as any drug... but like any drug, is a viscous cycle.  Food in to feel better, depression worsens as weight gains. \n\nA true Keto diet (look up a few clean Keto cookbooks on amazon) will help with the weight, but actually is amazing for mental health. To put it as simply as I can, ketones are created in your body in response to not having eaten the body’s favorite fuel, sugar/carbohydrates.  These ketones, along with other processes, switch the brain to “survival” mode and allows you to literally think clearer and sharper. I don’t know the science behind how or why, I just know that it works. \n\nIt worked on me, and if you google it, it works on many others. Weight loss on a Keto diet is a perk, the mental clarity is the real advantage.\n\nAnd if somehow you take this to heart, you can get your family involved as well because there is a chance that it can help with their special needs also. \n\nI’m sure I’ll get my head bit off for this... but I have been in your shoes and this is the only real advice that I can give....  the problems with husband and kids and relationship stuff are a result of everyone eating the “standard American diet”. Cut out the sugar, and I truly believe that you’ll be amazed to see the other issues in your life begin to fade away. \n\nAlso, a last point... this is not your fault and you are beautiful. :)",
            "The solution to this is simple, but hard. Men face similar problems all the time. We get fat. We stop feeling sexy. We stop exhibited the qualities our partner originally fell for. The biggest thing here is for you to start feeling attractive again.Based on what you've written, that means losing weight is number 1 on your itinerary. \n\nPeople are going to give you some touchy feely crap about how he should still want you if fat blah blah. Ignore that shit. The problem isn't necessarily your weight, the problem is how you feel about yourself bc of the weight and the lack of sex, and the apparent absence of activities you enjoy.\n\nThe key is you need to feel sexy again. Stop feeling sorry for yourself and find your discipline dammit. Start intermittent fasting, no food for 16 hours, eat during an 8 hour window. Stop buying sugary food. Being overweight is a choice in a sense, you are probably eating your feelings and feeling sorry for yourself and giving up. Make the decision to start exercising and eating well. At your weight you will probably drop 20 lbs the first month if you do that, your body doesn't want to carry that extra at all.\n\nOnce you stop prioritizing eating over being healthy, you are on your way. The 2nd obvious problem w your life is you are not prioritizing YOU. You need to start going out and doing things YOU enjoy. THERE IS NOTHING LESS ATTRACTIVE THAN A SELFLESS PARTNER WITH NO INTERESTS. Stop trying so hard. Be more selfish. Leave the boys with your husband or get a sitter and GO DO THINGS YOU ENJOY. You are in a terrible headspace right now. You have no balance to your life. You have adopted the selfless mother role and it is ruining you. For the love of god get your head out your you know what and become a whole person again.\n\nThis may sound harsh, but I have told myself just about everything I just told you, and my life has significantly improved as a consequence. Don't let people coddle you. You have it rough, but you are also fucking up. Take responsibility for yourself and your future. If you need a kick in the ass, just MSG me, we fats need to stick together. If you do what I tell you, your life will be MUCH better this time next year. Future you will love you for it.",
            "You've got a lot going on here. There are so many different directions and issues in your post, I can understand why everyone isn't functioning at peak. Hell, normal 8-5 childless couples are exhausted at the end of the day. You two are doing more than enough to drain yourselves physically, mentally, emotionally, and whatever else is left. So, don't feel bad. You are accomplishing a lot!!\n\n> **How can i fix this mess esp the dead bedroom/lack of love?**\n\nHowever, this is what is in bold and this is probably the one thing we can help you with. First, obligatory mention to /r/deadbedrooms. This is the sub for ongoing support here. You can post multiple times, unlike here, and get specific follow up that you need. \n\nNext, everyone has said it. You have to start by losing weight. You need to decide if that will be by a diet or if it will be by a lifestyle change. I've had two kids and I lost weight both ways. They both work but they both have pros and cons. \n\nDiet - the best is calorie counting. MyFitnessPal helps you watch what you do. Count calories in a healthy way. Substitute lesser calories things like cauliflower instead of rice and you'll lose weight at about 1-2lbs a week. Check with your doctor first, though. \n\nLifestyle - If you get all of your food at Whole Foods and literally eat things like chicken and salad (watch the dressing) then you'll not only drop weight you will have 10x more energy packed into your body. Seriously, eating organic, whole foods, is like putting premium gas in the car. You will run so much better. \n\nSo, it's up to you. If you focus on your health, the rest should come around. \n\nFinal thought - google oxytocin and autism. I've seen some crazy things from an autistic kid who started an oxytocin nasal spray, prescribed by his doctor. But, it's emerging research, so it's not everywhere yet. It's worth your google energy! \n\nBest to you!",
            "A great way for couples to bond together is to get in shape together. You hold each other accountable for any cheating and lean on each other for support. Without a doubt, if the two of you lost weight together, your sex life would improve.",
            "r/intermittentfasting",
            "What a depressing life, I'd have a hard time popping a boner too if I were him. Sorry you have so much on your plate. Having kids, especially special needs kids, can really tank a marriage. You should push for counseling to see if he even wants to stay/work on things with you.",
            "I hate to be *that person* but maybe lose the weight. It really fucks with good relationships when a partner gets fat 🤷🏻‍♀️\n\nI know I’ll get downvoted (🖕🏼) but wouldn’t it be nice if it *was* that simple??",
            "I would go with it's not you, it is the situation. He is probably really stressed and that has lowered his sex drive. He also works so much because he wants you and the kids to be secure in case something happens to him. Home life is also more stressfull than work life, so work is more appealing leading to more guilt and stress. Regardless of your sex life or interaction with your husband you should look into maintaining a healthier eating habits.",
            "[deleted]",
            "You must be incredibly strong. Raising two kids isn't easy. On top of that dealing with a cold bed is just heart breaking. I have no advice for you. Just admiration. I also don't get the American obsession with a certain body type. I'm sure you're extremely beautiful. I pray it gets better for you.",
            "You know how to start fixing: you hate the mess in the house, you feel unattractive. \n\nIt seems the real problem is the how. Idk how you can, but check to see where you can incorporate exercise even it's ten min of yoga with the kids. Check your wardrobe. What makes you feel good? Even if you don't think you look sexy, some fabrics will make you feel sexier. \n\nAs for the house, you need reinforcements. Idk if you can get a cleaning service,  family help, or get the kids to help, but you need HELP. \n\nIdk if that will help with your husband, but those two things are bothering you. He may feel responsible for your unhappiness.",
            "Thank you for sharing this!  \n\nI actually just got dumped because of some of the similar things you are experiencing.  I was on the other side of the spectrum tho!   \n\n We don’t have children together, but he has a disabled father and I had a grandmother who needed a lot of assistance.  I traveled 3-4\nTimes a week for my job and he stayed home.  He did lots of great things for others and around our house.  I didn’t mind!  \n\nThe one thing you have in your favor is you communicate with him.  If something is bothering you, communication is key.  I would say if your husband works as much as you say he does... it’s stressful and tiring!  Idk what kind of work he does, but if he deals with people in anyway... it takes a tool on you mentally more so than physically.  Idk if ur allowed to speak of God on Reddit ( I’m super new). But God plans our lives out to give us challenges and overcome!  You both are fantastic people for taking care and providing for your children!  You may need more date nights ( find a babysitter for your boys). Annnnd I gained weight while In my past relationship... so if you make you a priority when you have time...\nAnd get back to feeling better about YOu, maybe things will start to get back to the way they were.  When I gain weight I don’t have the same positive energy to give the sleep with me vibes! \n\nI know relationships are a challenge and life is t always as planned... but good people who love each other can save anything if they take steps to help things along.  \n\nI messed up by always being tired.. by whining because my body hurt from idk what... and most importantly not giving him more love!  Sooo I hope your hubs finds this and starts taking time for you, but start taking time for you too!  \n\nOhhh and if you have a Fitbit I joined this program called stepbet!  It was fun and easy to do with walking more!  You win back your money if meet your walking goals!  Check it out if you want and hang in there darling!!! It will get better!",
            "This may have already been suggested, but The Life Changing Magic of Tidying up may help if you can get your husband to watch the kids or hire a nanny for a day or two. It'll help you get rid of a lot of stuff; less stuff=less clutter to clean. With less to clean you may feel less motivated to comfort eat and possibly more motivated to do active things like take a walk with the kids or play with them in the yard which will help with loosing weight. That could lead to better mental health. The decluttering method can be stressful and cause a lot of emotions to rise up but I've experienced it as a good thing and emerged from the other side with less weight on my mind. It helped me be more concious of what I buy and how i spend my time. The r/konmari subreddit could serve as some inspiration if you're interested.\n\nWorking on something tangible that you can control should have some effect on the intangible. Husband may take notice and feel less encumbered too!",
            "Gosh this is tough, I'm sorry! Have this conversation with him, tell him you want to lose weight for you and him, and ask if he will help. Ask him if he has a fantasy or something that you guys can use to spice things up? Do you guys use calendar app? You can put reminders for him, so he can see and know to do things. Try to initiate but also let him know what you want and expect. Maybe you guys could go to marriage counseling? Perhaps paying for babysitters or something to have you and him time? Best of luck!",
            "Hours in the bathroom? Sounds like a porn addiction is contributing to the dead bedroom on top of everything.\n\nThis is complicated and beyond what many of us face but we will try to help. My advise is getting couple counseling. Ask your husband to commit to cleaning the house WITH you. Make it fun. Play some music or a show in the background and each week focus on 1 room at a time. Or do the KonMari method of cleaning. Living in clutter is horrible for the dynamics of a home. \n\nLastly hire a nutritionist and put the family on a new diet program. You could both lose weight, maybe go on walks and exercise together. \n\nYou deserve to give it your best effort this and next year. If the relationship doesn't work out, you can live knowing you did your best!\n\nAnd hey, maybe it wont work out. But you'll find happiness with or without him. So dont let anyone or anything keep you down. I'm hoping you find your happiness and love yourself.",
            "I dont want to give medical advice, but you should do some reading about fasting. It changes my life, as cliche as that always sounds",
            "You guys both need a very good couples therapist. One who will help figure out your issues and not just assign you \"weight loss\" on your first visit. This is a real problem about your emotions and feelings and your husband's lack of being present in his life. Maybe there is a problem about a lack of attraction on either of your parts, a therapist will help you with that and give you solutions that aren't weight loss. No matter what happens, he needs an attitude adjustment. If he just isn't attracted to you after all you've sacrificed for him (your earning potential, your sanity, your body) then you should divorce him, take his money to care for the kids, and find someone who thinks youre sexy at your current weight. It's not as rare as people in this thread think it is because they are only considering what they are attracted to.",
            "Making improvements to your own health with make you more sexually attractive. Showing yourself let-go makes you seem more attainable and less desirable. If you want the bedroom to spice up then start treating your body right and he will come around",
            "Hit the gym guuuurl. \n\nDiscover brazilian jiu jitsu, fall in love with it. Start training religiously. Get fit, skinny, banging body, suddenly boom your husband starts wanting you again and damn he might even get a little jealous of all the sweaty jacked dudes you're rolling around with on a daily basis.",
            "[deleted]",
            "Why are you asking? You know exactly what you need to do? Are you hoping someone here is goign to tell you that you don't need to lose weight?\n\nYou've literally doubled in size. Like, LITERALLY, doubled in size. Lose the weight. That's it. Thats the only advice you need. In fact, I would argue that you don't actually need someone to come help around the house/help with the boys. I suppose even with this I don't know enough about your life to make the call but, if you've been doing the SAHM thing this whole time, you should be decent enough at it.\n\nUnless you're in appointments from 8am to 8pm every single day, you should be able to juggle doing basic chores and managing a diet. You really don't even have to work out that much, just diet and find some time to go on walks every night. \n\nSeriously, you've put on 100% of your weight, that would kill any relationship. You know exactly what you have to do. Don't do anything else or make any other lifestyle changes until you've fixed this thing and seen what it's done.",
            "You could try fasting.\n\n&#x200B;\n\nEdit: It's good advice, I struggle with weight myself and fasting works, I dunno what you guys are up about.",
            "The first problem is yourself.  You can change yourself.  Your attitude belongs to you.  Your weight belongs to you.  How you respond to people around you is your choice.  Look up books by Viktor Frankl for a few thoughts on this.  For this problem, setting goals, then achieving them is key.  Please emphasize that addressing this problem is key to doing anything about the other problems!\n\nThe two of you together can do something about the relationship which is the second problem.  Either of you alone can't fix it.  Only working together will get you there.  Others have given excellent suggestions of ways to address this which I won't repeat.  It is past time to have a heart to heart talk with him and get him to recognize that things can't continue the way they are.  You mention that he also might be on the spectrum.  If so, he will be especially reluctant to do anything positive.\n\nThe third problem is the children.  As a father of a child with Asperger's, I can empathize.  Look into local groups that can help with your children's socialization.  Just seeing a counselor is not enough.  We spent a couple of years going to a weekly group meeting in a city 100 miles away so he could have the experience of interacting with children who have similar issues.  Most important, the program focused on social skills such as how to behave in a restaurant (order a meal, act appropriately while eating, leaving a tip, thanking the server, etc).  While this sounds redundant, it is exactly the type of skill a child with Asperger's needs to learn.\n\nYour husband sounds disconnected from his wife and from his family.  Think about ways to get him to choose to reconnect.  Set goals for yourself and encourage him to set goals for his own improvement.",
            "You should take a vacation together",
            "I know I’m kind of late to this, and I’m sorry for all of this. But I believe I CAN give you some advice on weight loss. Many people believe to loose weight you just need to exercise. But you can loose weight just by changing your diet and eating healthier! Which will also make you feel better and make you actually healthier.\n\nFor starters start transitioning to only eating organic.",
            "For me I wouldn't mind if my SO got large but I would have negative feelings if there was, as far as I can tell, an attempt to be attractive before myself, simply eating cleaner or doing some workout. Dont have to be a super model but someone working to be do they can be attractive to me is major points and flattering",
            "[removed]",
            "How are y’all even supposed to fuck if you’re both that fat? I’d say lose that weight then y’all will start fucking again",
            "I can't stress enough on this, any change you want begins with you. Taking care of yourself means you get to care better for your children and husband. Now it seems that you don't have time to spare after your daily duties , but you have to find time for yourself, exercise releases feel good hormones , helps you feel better about yourself. Eating healthy has a similar effect .\nDon't try to take up too many things at once, do it slowly but diligently. Don't get anxious when you don't see results , keep at it. These kind of things take time.\nBut once you start seeing the results , you will start building up confidence and that will start a loop of amazing things :)\n\nOne more thing, YOU ARE STRONG,  you have done so much already , believe in yourself.\nAll the best , you are going to make it :)",
            "i posted a long comment but didn't realize a word word get my comment removed. i will try to repost later.",
            "This may sound crazy and take into considrration, that I'm non educated and kinda un-smart..\n  But I feel like an affair could be beneficial in alot of marriages ..nothing will get your mans attn like you getting attn from another man..I've been married 32 continuous years and I know an affair helped , if not saved my mirriage..\n  And dam what a plate full you are dealing with.you have got to find a way to get a  break  or you gonna stroke out..idk what the answer is but if you dont take time for yourself to relax ,disengage and de-fragment ..you gonna be leaving these awsome kids to the mercy of the world..that's not good..so  at all cost you have got to find an outlet for your frustrations..my apologies here guess it's the man in me talking but the affair i mentioned would provide a nice much needed distraction from life ..if you was to follow my advice ..tell the man you choose to have an affair with that I said.\"your welcome\" hell if we were close enuff I would volunteer to be the man to take your mind off your problems and I'd attempt to sweep you off your feet and be your knight in shining armor.id make you feel good about yourself improving your general mental state of mind. And I would put you threw extreamly rigorous work outs that would improve drastically your physical health  and that in turn would boost your mental health which in turn would boost your physical health which in turn would boost your mental health and this would proliferate at an exponential rate..I would have you auditioning for, and landing  a roll on baywatch ....well you get my point right .? Cutie feel free to message me and we can discuss contingency plans ( wink wink)\nAt any rate..have yourself a sexy weekend , I'm sure you deserve it.btw I'm paul 49 ,in florida",
            "Open it up.  Give him a Hall Pass or something.  He will appreciate it.\n\nSex and love are separate.  It seems he loves you.",
            "You should divorce if you have 2 special needs kids. Obviously your DNA and his were never supposed to mix like Wtf. Are you two cousins?"
        ]
    },
    {
        "post_id": "52dyiw",
        "author": "fathermtmedcpic",
        "title": "My [25F] fiance [25M] father [60'sM] sent me a dick pic and I am not sure how to proceed",
        "url": "https://www.reddit.com/r/relationships/comments/52dyiw/my_25f_fiance_25m_father_60sm_sent_me_a_dick_pic/",
        "score": 2850,
        "num_comments": 270,
        "created_utc": 1473681489.0,
        "selftext": "I have been dating Buck for 4 years now we met in college, really amazing guy, good looking. His family mainly his sisters and mother [55F, 24F, 27F] have been really welcoming and really welcomed me and my mother & sister into their family. They are a close family so we all live in the same city and they normally hang out every Saturday. I am pregnant with our first child. We both have our dream jobs and everything is fine apart from his father \n\nI get aggressively hit on by men when I go out, it's part of the reason why when I am in a relationship I rarely go out to bars or anything like that. If my friends want to hang out we normally go to the mall and even then some guys comes up and talks to us. I am not a cheater, I hate cheaters my father cheated on my mother and it tore my family apart. So I have gotten my fair share of unwanted dick pics is what I am trying to get at. So one thing I will never do is cheat on buck. \n\nHi father and mother are divorced and 2 weeks ago I met his father for the first time. His father lives on the other side of the country in New York with his new wife. His father flew out to see his children and this was my first time meeting him in person. He seemed nice enough completely different from the rest of the family. He seemed really cold and to the point. \n\nWe exchanged details just to you know, stay in contact because he is my fiance father. His father seemed rather closed off and he stated he hated leaving NY and hated people in general. Buck and his father are not close like he is to the rest of the family. They seem to only communicate because they are father and son. They just don't seem to really like each other. \n\nOver night I got a message on Facebook from him and it was a picture of him holding his dick, one flaccid and one erect. With the words after it \"You Like red?\" I have red hair so that's why he called me that. \n\nBuck is still sleeping and I am not sure how to address this with him and my friends will just cause a huge fucking drama, like they always do. I just need some advice please \n\ntl;dr: boyfriends father sent me a dick pick \n\n",
        "permalink": "/r/relationships/comments/52dyiw/my_25f_fiance_25m_father_60sm_sent_me_a_dick_pic/",
        "comments": [
            "You have to tell him. There is no happy ending from not telling him. Either he finds out later, or his father keeps harassing you.\n\nWhen he wakes up, an easy script is \"Hon, your father sent me a dick pic and I'm really creeped out!\" and take it from there. He should be the one to handle his father from now on.",
            "Your friends don't need to know, your bf does.",
            "Wake him up and show him. Don't bother telling your friends about this.",
            "Man, no advice, but I am just seriously shocked.....what was your father-in-laws end game here? He must be off his rocker if he thought any of that would go down well. ",
            "[deleted]",
            "I'm sorry that happened to you. I had an ex with a creepy dad too. He had an actual folder on his computer with \"hot chicks\" in it with SEVERAL of my photos saved from FB :/ The ex in question didn't think it was weird... Hence, ex. There's no shaking that gross feeling :(",
            "You should NEVER tell your friends something like this. There is no need to embarrass your fiancé or risk having your friends think your fiancé is a weirdo just because his dad is.",
            "Tell him as soon as he wakes up.",
            "[deleted]",
            "Tell your bf immediately.\n\nRespond to his father. \"Thats is disgusting and offensive-please dont contact me again. and then block his number.\"\n\nReconsider any wedding invitation you might have issued.\n\nDont tell your friends.",
            "Yes, you need to tell your fiance as everyone has said. But also, you absolutely have the right to tell your friends despite the obscene amount of people taking issue with that. Everyone has the right to talk about sexual harassment with whomever they  want.",
            "Is there an account on record of sending a random dick actually paying off? I don't understand how people think that shit can work out of a someone you are already having sex with, even then it might not work every time. ",
            "Why the flaccid pic?  Noone has ever wanted to see a flaccid penis; I don't even look at my own.",
            "I'd be tempted to say \"not impressed,  your sons is a lot bigger.\" Because I'm immature. ",
            "You should take screen shots and send it to the father's new wife",
            "Is your boyfriends father Anthony Weiner???",
            "Don't just tell him. Show him. Ask what he thinks the path forward should be.",
            "Sounds like your husband just found the PERFECT excuse to never talk to his father again. ",
            "Sorry but I read the title as fiancée (female) and really laughed at the opposite situation, where the father in law is sending pics of his dick to son in law...  Like defending his territory! ",
            "You should educate him about the use of commata.",
            "Post it on his father's wall",
            "You tell your fiance.  It's that simple.",
            "Why do guys think this is a good thing to do?  WTF",
            "Tell him. Then tell everyone else.",
            "I'm interested to hear an update on this. Glad you told your BF. ",
            "\"I'll need to discuss the content with Buck before I give you my review, thanks\"",
            "I am hoping the father was drunk and is not actually so stupid to think the OP wanted to see his dick. OP you have to tell your fiancé and I would so not be alone with his father. That is so creepy and gross how can a man his age not know how creepy and pathetic that was?",
            "Send him back a picture of himself. When he goes, \"WTF?\" say \"I thought you liked seeing pictures of dicks.\"",
            "Yeah,  you NEED to hold this asshat of a father accountable for his gross-nasty messages.\nFirst off,  I would screen shot the hell out of those nasty pics.\nSecondly,  show them to your bf. You should have him on your side, backing you up. His dad likely thought he could get away with this sort of BS bc he likely has acted this way to others in the past. Teach him a lesson! I'm sure your bf will be as pissed off and disgusted as you are,  and he needs to know this occurred.\nThirdly, I'd look at Douchey Daddy's Facebook,  locate his wife,  and send her a message that her husband is a pig who likes to sexually harass his son's girlfriends, bc if he would do that to his own SON, imagine the affairs he must be having on her. \nDon't just be silent.  Men get away with this sort of crap bc women let them get away with it! Don't be a sheep, stick up for yourself! \nBe the wolf, Red!",
            "Post it online on some gay site and reply back to the dad with the link ",
            "You should tell him, your fiance probably knows that his father is a creep and that's why he is not close to him, maybe he tried the dick trick with another of her girlfriend before. \n\nAnd you don't have to tell your friends, if they always cause a huge drama it's better to deal with it privately.",
            "\"And my friends will just cause a huge fucking drama, like they always do.\"\n\nWhy do you need to tell them? You only need to tell Bucky.",
            "Might he have Alzheimer's? Or dementia?",
            "I just don't understand why on Earth people post stuff like this here. You know exactly what to do, you know exactly what we're going to say, so go do it. Tell your fiance \"Your dad sent me a dick pic\".",
            "Looks like he situation is being handled. I just wanna add, kudos to you for handling it in such a mature fashion, and realizing that bringing it up with your friends is a bad idea.\nKudos to Buck for taking up for you!",
            "Good on you for telling him right away,  I'm sorry you have to deal with such a shitty situation.  Don't tell your friends unless you discuss that with your fiancé.  He must be mortified AND furious,  friends can sometimes (intentionally/unintentionaly) hang that shit over peoples heads.  Neither of you need that.  Good luck to you and your future husband ",
            "What the fuck goes through peoples minds sometimes???  OMG this dude is a whack job!  What did he even expect to come of this??  \n\nSo sorry you have a piece of shit FIL-to be.  Sounds like he doesn't deserve to be a part of your lives, but also not like you are missing out on much.",
            "Show your fiancée. Avoid this schmuck like the plague. I pity his wife. ",
            "If they get into a fight you better record it.",
            "Tell your boyfriend, and tell him things like this are signs of mental illness. Make sure they know to get him checked with the doctor for signs of dementia, etc.",
            "Damn, this is a textastrophe",
            "Yeah you need to tell Buck. And I would never interact with his dad again.",
            "Glad you told Buck. This is a family matter, and no reason to tell your friends. ",
            "You have to tell your fiancé. \n\nThis is great by the way. Incredibly entertaining post. ",
            "Does he by chance take Ambien. It'll make you do weird, potentially inappropriate things. \nThat drug forced me to delete my Facebook. That and I hate Facebook. ",
            "Tell your boyfriend/fiance immediately.",
            "Tell him as soon as he wakes up. Just tell him his father sent you a message and hand him the phone if you need to. ",
            "You tell him, and together the two of you formulate a \"fuck the fuck off\" response to send to him, as a group message/speakerphone call with both of you present. Once you have said your piece, sit back and let Buck handle it with your support.\n\nAlso: eeeeeeeeeeeeewwwwwwwww. What a fucking creep!!!",
            "Honest question. Does a dick pic ever work? I doubt any guy ever got laid from this stupidity. I might be wrong though. That's why I'm asking.. ",
            "I have no words. So sorry you have to deal with this bullshit. ",
            "I don't advocate this kind of behavior normally, but I'd put him out on blast.",
            "You have to tell him, I know u don't wanna cause drama but the dad is harassing you and there should be consequences for him ",
            "You have to tell your fiance. Show him the message and block your father in law from Facebook.",
            "It seems weird that someone who was cold to you would do this.  Perhaps he is trying sabotage the relationship with you and your fiance because he doesn't want to have one and doesn't want to go to the wedding. ",
            "Please give us an update. I feel so sorry for your fiance to have to deal with a parent like this ",
            "It's already been said, but I think you did the right thing and its great that your fiance is being supportive of you and placing blame where it belongs: his inappropriate father",
            "Just show him the Fb message so he can see for himself!\n\nWhat advice were you hoping for apart from this?",
            "I would let your DF know and I would get his step mother's phone # and forward the pics to her.",
            "You should have screenshotted the pics and forwarded them to his wife as well.  He sounds like a piece pf work",
            "> and my friends will just cause a huge fucking drama, like they always do\n\nCan you take us through this scenario? How would they even cause drama? ",
            "Is his father Anthony Weiner?\n\nTell your fiance, send screencaps to the father's wife.",
            "Um, obviously you have to tell your fiance. That's a no-brainer. What I'm confused about is why you have gotten so many unsolicited dick pics. What kind of weirdos are you giving or have given your number to? I have gotten hit on many times and can't say I've ever gotten a dick pic. But I also don't give my number out to random people...",
            "[removed]",
            "I don't get why you had to exchange contact information. especially if your fiance barely speaks to him. and if you really needed to get in touch with him for whatever reason you could just ask your fiance. something is fishy here.",
            "[deleted]",
            "Pics or it didn't happen.",
            "[deleted]",
            "[deleted]",
            "That's hilarious and pathetic. Just mock it and present it in mockable dismissive way. ",
            "[deleted]",
            "Um. Tell your fiance and report your fil to facebook. Ypu could even publicly ahame him on facebook if you're up for it.",
            "I would tell your fiancé that you want to take a break because you are not sure about the family you are about to join long term.  I think during that break you should fully examine the entire relationship and all encounters with his family to ensure you still want to pursue a marriage.",
            "Looks like you picked a great family eh?",
            "So, ah, DO you like red?",
            "Honestly, if I were you, I'd consider my future with Buck. You're talking marriage here - a legal contract - with a man whose father sent you an unsolicited picture of his dick. You're the only one who knows yourself best, but will you be able to ever look FIL in the face again? How will family reunions go on? Holiday family gatherings? You're going to just forbid him from coming? Do you think Buck is going to stand up to his dad and cut all ties forever? Will you feel comfortable letting your kid go over to see their granddad?"
        ]
    },
    {
        "post_id": "3bgrmt",
        "author": "confusedboy1100",
        "title": "UPDATE I [19M] had a gay experience with my friend [19M] I thought we were both straight. Feeling confused and don't know where to go from here",
        "url": "https://www.reddit.com/r/relationships/comments/3bgrmt/update_i_19m_had_a_gay_experience_with_my_friend/",
        "score": 2851,
        "num_comments": 254,
        "created_utc": 1435544132.0,
        "selftext": "Edit: [OP](http://www.reddit.com/r/relationships/comments/3bc8ia/i_19m_had_a_gay_experience_with_my_friend_19m_i/)\n\nI'm getting a lot of update requests, and Danny just headed home so I figured I'd go ahead and post. I have exciting stuff to tell you guys! First I wanted to say thanks to everybody who commented, you all really helped me calm down and stop overthinking everything. I appreciate it a lot.\n\nWhen Danny showed up we were both really nervous and awkward at first. I was really scared to say anything, but I broke the tension by telling him how much I had enjoyed the night before. He broke out into a huge grin and turned bright red, lit up like a christmas tree. He told me he was so relieved, and that he had been obsessing over it all night worried for the same reasons I had been. \n\nI told him that it was my first sexual experience ever and that I was questioning my sexuality now. He told me that he had been questioning his sexuality for a while, and that he had feelings for men before, but had mostly seen me as just a friend until last night, when he realized that I was kind of sort of coming onto him in a really roundabout way. It's funny, I didn't really think of myself as coming onto him but I definitely made that statement hoping something would come of it...\n\nAnyway I told him that first and foremost I valued our friendship and wanted to stay friends whatever happened between us. He agreed strongly. He asked me if I was okay with working out our feelings together (read: having sex until we figure out how we feel) and I told him yes. After all this heavy conversation we decided to play some CS:GO together like we usually do but we ended up in bed together instead. Afterwards we talked some more and discussed the possibility of a relationship. He said he feels like we know each other well enough that he wouldn't feel like we were rushing in, and I agreed with him. He asked me to be his boyfriend, and I said yes! I'm so happy about it, too! I've never felt so attracted to anyone before.\n\nWe haven't told anyone yet, but decided not to go out of our way to keep it a secret. The area we live in is reasonably tolerant and neither of our parents are anti-gay, which I am grateful for. I am worried about telling my sister, who has recently become a born-again christian and had a lot of horrible things to say\nabout the supreme court ruling on FB. I'm also a little concerned about telling our other two friends, but I think after the initial shock wears off, they'll come around.\n\nNow, I'm not super duper concerned with slapping a label on my sexuality and calling it a day (thanks to you guys, I appreciate all the advice in that regard!) but the more I think about it, the more I think that I really am gay, or at least gay-leaning bisexual. It kind of feels like the best time to be realizing it with the gay marriage ruling happening. Every time I think about it I feel giddy.\n\n   \n**tl;dr**: Talked it out, sexed it out, we're a couple now! Thanks for helping me stay sane, reddit!",
        "permalink": "/r/relationships/comments/3bgrmt/update_i_19m_had_a_gay_experience_with_my_friend/",
        "comments": [
            "This reminds me of a joke.\n>They say one in every four men is gay, so there must be one in my group of friends. I hope it's Michael - he's super cute",
            "Let me add to the chorus of congratulations, but add a small warning: now comes the real stuff. \n\nDon't let the surprise and weirdness of your beginning overshadow that you've just started your first real relationship. Enjoy it! Date. Go out. Try new things together. I would be sad for you if this was just a hook-up thing. \n\nThe best relationships are between people who are friends AND lovers. Be both. ",
            "This is fucking cute as shit. Thanks for cheering up a dreary New England day over here, OP.",
            "I went through the whole am I gay or not gay thing and I got the same advice - Don't label yourself.\n\nI think a lot of Bi guys go through this. I wish I was gayer so I could just say \"I'm gay.\" But there are some women I find really attractive. \n\nEventually I just stop caring about the labels. If a gay guy asks me if I'm gay I say yes. If I'm talking to a girl I'm interested in I just don't mention that I also like guys. \n\n",
            "I have a big shit eating grin on my face reading your update. Happy for you guys - just enjoy a new exciting relationship and all the giddiness that comes with it. ",
            "You guys are just the sweetest! This is the best possible outcome. I wouldn't wait too long before letting your respective parents know though, I'm sure they would appreciate hearing it from you rather than finding out accidentally or though gossip.",
            "> I am worried about telling my sister, who has recently become a born-again christian and had a lot of horrible things to say about the supreme court ruling on FB\n\nTell her if she insists on following the old testament that she should get her husband's or father's permission before raising her opinion.",
            "First of all, congrats. This is a good update. \n\nMy only concern would be rushing to immediately call it a relationship, but good luck to you I hope it goes well!",
            "I know that this isn't what you want to hear, but this isn't going to work; it's not a proper foundation for a relationship. I'm referring of course to Counter Strike. A cooperative puzzle platformer like Trine, or something with a little story depth to it like the Portal 2 co-op is much better suited to the beginning of a budding romance\n\n(Sorry, the update made me all happy and silly. I think I'm funny.)\n",
            "Woo! Great outcome, I hope you two are happy together",
            "Congratulations, OP! I'm glad things turned out well for you!",
            "*Hugs* happy for you! ",
            "I'm so happy for this update! Wishing you all the best!!",
            "Yay, I'm glad to hear such a nice update!\n\nI am all about being 100% open and out of the closet if it is at all practicable, but you should definitely not feel any pressure to label yourselves or tell people that you have a thang going on.\n\nI have to say though that\n\n>working out our feelings together (read: having sex until we figure out how we feel) \n\nIs pretty much 75% of young adulthood for most gay men.  Have fun and play safe!",
            "[deleted]",
            "When are you guys getting married?!\n\nJust kidding. Congrats.",
            "This is the hands down the cutest thing I've seen on the internet in ages, dog/cat pics included. Good on you guys, happy summer loving in your first relationship!\n\n\n",
            "This is the cutest thing that showed up on my feed all day. I'm thrilled for you guys and I hope you keep making each other feel happy and loved.",
            "My son is only a little younger than you, and this situation does not surprise me. He and I talk about sexuality, LGBTQ rights and the recent changes in public opinion. Judging from his opinions and the opinions I hear his friends express, I don't believe many in your generation will feel the need to limit their sexuality, or to label everything with hard definitions like \"straight\" or \"gay\". Once you remove the social stigma placed by older generations, people are just people and sexual contact feels good either way. I hope this is true, and as each generation sheds some of the social stigma placed by the previous, I think we can all start getting to know each other and treating each other better. I'm glad that you found resolution in your situation, just know that there are those of us your parents' ages who hope that your generation can step outside some of the hateful behavior that people our own age fall into.  I think more LGBTQ teens are hurt by the social stigma and the backlash that can hit them for being them than they are hurt by confusion over their own identity. \n",
            "Hi hi can I just say that this is the cutest thing I've ever read that involved a blowjob??  I'm so happy for you two!  It's awesome that you two were friends beforehand so you already know each other pretty well.  Most people _dream_ of dating their best friends and you two have it so lucky!\n\nI reckon that you should probably flesh out the opinions of your friends and family and try to see what they think about homosexuality and gay people in general before coming out so they aren't completely shocked when you decide to come out, and also so that you aren't shocked by their reaction.  I had a friend who came out bluntly to his parents and was subsequently kicked out of the house since his parents were homophobic and they had been having problems beforehand with him.\n\nBut all in all, I'm happy for the both of you and hope that everything works out! ^.^",
            "I'm so happy for you! ",
            "This has been such a heartwarming story, I'm so glad things turned out ok! #allthefeels",
            "Congratulations! Have fun, stay safe, and good luck!",
            "OMG this is the cutest best update ever!",
            "This is the update I was hoping would happen for the both of you. Stay strong. ",
            "Yay! This made me really happy for you. I love it that he got a big grin and lit up like a Christmas tree that must have felt awesome. You both sound really mature for discussing everything out and I'm so happy that these days young people don't have to feel so scared or worried about their sexuality. When I was a teen not even THAT long ago, my gay friend agonised over coming out to anyone else for so long because of social attitudes. It's great how much better things are now.\n\nHave an amazing time with your new bf!",
            "In a sea of posts involving grossness and jerks and idiocy that I see here on reddit, I **LIVE** for happy updates like this!!! I don't know you at all but I'm so so happy for you and I feel like the internet is a beautiful place again\n\nCongrats, good luck with telling your family, and I'll be hoping for lots of happiness between you and Danny!",
            "omg could you stop being so freaking adorable?!? I can't take it!! XD     \n(but seriously, Congrats!)",
            "Awe!  My heart is beaming for you both!  If you could only bottle the butterflies you feel!",
            "Awe congrats! You two are completely adorable :)",
            "Don't let anyone ever tell you how you should live, if it's okay for them or not, no matter if it is your sister or your parents. You must do what you want, you must do what you feel empowering for yourself. Fuck anti-gays, fuck society, fuck everyone that doesn't accept it. ",
            "1) Yayyyy! \n\n2) Read Eve Sedgewick's Epistemology of the Closet. I amy lad you're not concerned w labeling, but if that anxiety ever flares up again, it's a great look at/takedown of how we categorize sexuality. ",
            "About your sister: If she loves you now, she is still going to love you.  She might be weirded out about your relationship.  And she will probably still be convicted that it is wrong.  And she might even be flaky and ignore you for a while but in the long run, she is your sister,s he loves you and she will come around.  I'm a christian and my brother is gay and I never batted an eye when he told me my dad is about 100x more conservative than I am and even he has come around and is friendly with my brother's boyfriend.",
            "Congrats!  Wish you all the best. Very wonderful that you found out young and are able to be yourself.  You both saved several young women from having unhappy, confusing, possibly painful relationships with you by not pretending to be what you aren't.  I respect you guys for your honesty with yourselves and others.\n",
            "I am so excited for you. Honestly, it is a great thing that you have realized this and (hopefully) haven't had to deal with any pain or persecution for your sexuality. Basically, I'm really happy that coming to terms with your sexuality is bringing you happiness instead of pain :)",
            "I had my fingers crossed for you when I opened this up! So glad for you both, take your time and enjoy things at the pace you both want to go at.",
            "Be prepared. I was, am still am, in the same situation as you. Thought I was purely straight, have a best friend who confessed to me, etc. \n\nI have a father that lied to me that he was okay with homosexuality. When I told him, he disowned me. I have a family that does not understand me, especially how I am bisexual, not homosexual. I have the issue of wanting to express myself to others that I'm bisexual, but can't handle the attention or concerns of others, so I never tell anyone. Whenever I talk about my boyfriend, I always say girlfriend.\n\nI'm sure we're not the same, but get ready for your future life now as a bisexual. Congratulations, and have a lovely life. ",
            "Didn't get to comment on the original post but my girlfriend and I saw it and were rooting for you all day, hoping for a good update.  Congrats and I'm so happy this worked out for you!  Good luck to you both, and as long as you keep communicating with each other while you feel this out, you can only get the best results!",
            "I think this is the start of a wonderful, trusting relationship for you to work out your feelings together. Follow your heart and enjoy it! ",
            "Aww, this makes me smile :D Wish you guys all the best! ",
            "This is the best update ever! So many congrats!",
            "I'm glad OP is finding himself. Not a lot of people can say they've done that. Cheers OP!",
            "Congrats! You felt with your heart it seems. I wish you the most positive experience coming out, & keep going with what makes you happy! No label, just \"it feels good & makes me happy\"! ",
            "Yay!",
            "Reminds me of one post where a girl had surprise lesbian sex with her room mate and became an item. These type of posts are always so cute :3",
            "Super late to the party, but you don't have to worry about changing life-styles or slapping on labels. \n\nFuck that noise. Just be yourself, you're you.",
            "Gay marriage was just legalized in all states...so like five years from now are we gonna see an update where you guys are married? That would be really cool, and reddit would love it!",
            "Sorry about your sister. Hopefully she'll accept you for you and if she doesn't then she isn't worth your time.",
            "Congrats!\n\nIf you do choose to inform I hope you can do so in a  matter of fact way that does not make you appear to be apologetic or afraid that you are disappointing anyone. With my family I update them about life changes as a courtesy to help them stay informed and not because I need or want their approval. I'm quite close with my Mom and Dad but they know Radio does what Radio wants. My sister is the disapproving sort as well which is why we aren't close. That's her choice though.  ",
            "This update made me feel giddy :-)",
            "I'm smiling from ear to ear after reading your update! Congrats on being emotionally brave not just about having a same sex attraction but also for being so straightforward with the person you're attracted to. No games, no bullshit. I'm impressed.",
            "Have fun, you two!! Love is great, no matter where it is found - so happy for you guys!",
            "THIS IS ADORABLE. Also, just do what you think is right. You don't have to label yourself gay. There are a ton of ways to describe yourself. Queer, bi, pansexual, whatever you want. Bicurious, heterflexible, make your own label. You do you. ",
            "we are a month after and I wonder how your relation is going and if you have told anybody. I discovered your story today and thought it was very touching and positif. \nHope you guys are doing ok and didn't get any trouble since then :)",
            "Can I tell you I just AWWWWW'd at the part where you said yes to being his boyfriend? :D \\^_^ Also, I hope things are going well on your end! Love to hear an update if you still check this account!",
            "Tears of joy over here! Enjoy it :)",
            "Why is this so fucking adorable?",
            "Congratulations!",
            "It's nice to get to explore this and have fun with someone you're already close to. Hope you guys really enjoy yourselves!",
            "Congratulations OP! I wish you both the very best c:",
            "Congrats! I'm very pleased for you, OP :)",
            "If you don't want a label just say it as it is, you have fallen for a guy and you are happy. ",
            "Aw Bless !! I'm so happy for you !!",
            "Awwwwww you guuyyyyys. That's a sweet update, all the best for you two! ",
            "So god damned cute!   \n  \nI was all smiles while reading this, brought back a lot of memories.  \n  \nHave fun and enjoy life. There will be some ups and downs but when you are dealing with the downs remember the ups.",
            "First of all, thanks for updating! I was waiting for this. Second, I wish both of you the best. This is a story which deserves a happy ending ",
            "I love this, omg.",
            "Hey man. I was coming in here just to say if it feels natural to you go for it, but you already figured this out. ",
            "I'm glad you're happy. I wish you all the happiness in the world.",
            "The best thing you can do is be open with everyone about your sexuality and relationship with him. :-) All the best! And have fun! :-) ",
            "Playing CS:GO with your SO is awesome. My husband and I do it all the time. It's our most common event on lazy date night. \n\nJust sayin'.",
            "*Awwww!*",
            "I am so happy for you both.",
            "You guys are stinkin' cute. Best wishes as you go forward from here. Just remember to keep being honest with each other and trust your gut.",
            "Hooray congratulations on being adult about talking it all through, such a hard thing to go through. Good luck!",
            "Glad it all worked out ",
            "Ranks? ",
            "Well. This story was pretty hot.\n\nCongratulations, guys!",
            "1) Yayyyy! \n\n2) Read Eve Sedgewick's Epistemology of the Closet. I amy lad you're not concerned w labeling, but if that anxiety ever flares up again, it's a great look at/takedown of how we categorize sexuality. ",
            "When will you tell your parents about Danny?  I suggest informing them before your sister. ",
            "Good for you! Brilliant finding a partner in a close friend!",
            "What a perfect time to figure this out about yourself. That is impressive. Good luck!",
            "Good for you, glad it worked out!\n",
            "This is fucking adorbs. I'm glad things worked out for you! ",
            "Glad things are got sorted! May you two find happiness together!",
            "Congrats man, this is awesome!",
            "CS:GO then Sex? That's the life\n\nBut anyway, congratulations OP. I'm sure that you gonna be very happy!",
            "Gay, strait, bi, are only mask / name tags created during/around the victoria era, over sexuality.\n\n",
            "I don't have anything clever or useful to add except that was dang cute and and I'm truly happy for you, OP. Wish you the best! ",
            "Yay! Congratulations!! Happy for you two. :)",
            "Jumping in on the chorus of how adorable this is and I'm so happy for you guys! You handled this all so well. Don't slap any labels on yourself. Just be into who you're into. ",
            "YAAS",
            "Bravo!!",
            "God this is adorable.",
            "I was really hoping to see an update from you! Reading your post made me giddy and I am super happy for the two of you! Enjoy it and congratulations on your budding romance! :)",
            "This is such a cute post. All that not knowing and fucking and then knowing. So adorable.",
            "Fuck yeah congrats :-). Enjoy the ride. Or rides, depending on how adventurous you get in bed.",
            "Well if your actually attracted to him then your likely gay, its possible your only gay for him, and it may just be a passing phase. But if it feels right go for it if it grows into more then great. Congrats",
            "This is so cute!",
            "Sometimes I really wish I was gay so I could play video games all day and just have sex.",
            "Sometimes I really wish I was gay so I could play video games all day and just have sex.",
            "This is the sweetest thing I've ever read in my life, hands down.",
            "I NEED to find out how they are doing. This is so cute!",
            "That is fucking awesome!",
            "D'awww. That's cute. :3",
            "Ah you guys! Good for you!! Now you can look forward to a long and loving relationship :) ",
            "i'm smiling from ear to ear. Becaause of... reasons, I can't disclose why your story made me so happy , and specially the update :) Someone close to me had a similar story and I gave him the same advice as Reddit did to you yesterday and all turned out just as good!!! :D So happy!!!!!!! ",
            "I agree that this is so cute!! Congrats and I would really like to hear more about how it's going in the future. Enjoy each other this summer and see where it goes naturally when you guys go back to school, don't try to force anything!",
            "Man I can't even imagine how confusing that must have been. What a crazy ride you've been on.  Happy to hear things are working out for you! ",
            "Thanks for the update, congrats and have fun!!",
            "Sexy! Hehe I think any weirdness you initially feel is to be expected. The times I've been with guys (bi guy here) and been out and about can feel like that, simply because you hardly see it, which of course is gradually changing. \n\nBonus story: was in Manchester UK last week and there are so many guys out, holding hands and cuddling in public etc. This currently astounds me, and seeing it makes me very happy. It's not something I ever see around where I live, but I can see that changing.",
            "This is just the cutest post ever. So happy for you too! So much research to do together now :D be safe and enjoy!",
            "This is so sweet it makes my day :D",
            "Please let us know how it goes with your sister. I'm kind of fascinated by conservative Americans at the moment.",
            "No better romantic relationship than one where you began as good friends, regardless of gender.    \nCongrats to you both for talking it out like adults and embracing who you both are instead of shying away from it and making your relationship awkward.    Best of luck to you both",
            "Your post just made my day OP. Thanks for the update and a heartfelt All The Best, and have fun!!! Yay to love! ",
            "I've totally been checking for updates all day, I'm so happy that this is the news!!!!",
            "GOOD FOR YOU!!! = ) CHERISH IT!",
            "Now my straight relationship with my bf is threatened by your gay relationship. I will never get married!\n\nJust kidding. Congratz. \n \nPS Is this story real? Sound too much like a fantasy.",
            "I am sorry but pal, that was the hottest thing I've ever read. I think you should just tell us more about your relationships and sexual life 😂",
            "Super hot story!",
            "That was adorable, gosh. Definitely cheered me up. I hope things are still going well for you two!",
            "Listen, like, I get that you're happy right now but am I the only one concerned by how quickly all of this has happened?\n\nLike you never gave guys a second thought until your dick was in his mouth, and that was only yesterday?\n\nI really don't mean to shit all over your party here, if you're gay or bi or whatever step on the scale you are then congrats but it all seems very rushed in my opinion.",
            "This is just so fucking sweet. :)",
            "Hurrah!  So pleased for you OP!  \n\nTake your time about telling people - you're not daft so you can work out who to tell and when.  I know it will be very difficult not to sing it from the rooftops (and I would be with you 200%) but you have to be smart ;)",
            "Nice on, OP. \n\nRe: the label - you don't have to label your sexuality.  It's whatever you want it to be.  I suggest \"awesome\". :D",
            "Have fun. Relationships have their ups and downs. It will be a learning experience for you. No mater what happens in the future, I hope you look back fondly on your first relationship",
            "Cutest thing I've read all week. Best of luck to you two!",
            "I can't really think of anything else y'all need to do except for one thing:\n\nfuck with people. \n\nWhen you do decide to tell mutual friends, make sure you do it in a way that has them questioning their own sanity. I understand if you want to tell your parents in a more sit-down fashion, but if you have anyone you're comfortable doing this with, play a game where you and Danny see how much you can act very slightly couple-y around people and see how long it takes them to either realize that you're a couple or make a joke about you two being such good friends that you might as well be a couple... and then just start kissing or something. IDK if you actually wanna do that, but it's also just fun for me personally to imagine that.",
            "You may be demisexual, which means you can't experience sexual attraction without emotional connection. ",
            "Like it or not, you're gay.",
            "[deleted]",
            "[removed]",
            "1 in 12 is not enough! recruit! recruit! recruit!!!"
        ]
    }
]