[
    {
        "post_id": "3syote",
        "author": "musicmage4114",
        "title": "[Update] I (24M) addressed my CEO (60sM) informally, and was subsequently rebuked by another executive (40sF). What happens now?",
        "url": "https://www.reddit.com/r/relationships/comments/3syote/update_i_24m_addressed_my_ceo_60sm_informally_and/",
        "score": 2851,
        "num_comments": 298,
        "created_utc": 1447635952.0,
        "selftext": "Link to original: https://www.reddit.com/r/relationships/comments/3styvp/i_24m_addressed_my_ceo_60sm_informally_and_was/\n\nFirst of all, thank you to everyone who took the time to reply to my original post! The general consensus was that I had handled the situation well, or at least as best as I could have, given my situation and experience. Even those of you who thought I'd screwed up said so in a way that was sensitive and respectful. So thank yous all around!\n\nNow, on to the update!\n\nI mentioned in my original post that I had only sent one of these notifications to our CEO once before, and no one had said anything then. **When he replied to me that time, it was only one word: *\"Thanks.\"* No salutation, no signature. Just that one word.** Understandable, he's a busy man. But this is very important for understanding what happened this time.\n\nI got into work this morning and opening my email. Among my various other usual emails, I saw that the CEO had responded to my original notification email at about 7:30 pm last night (a Saturday!) He had kept intact the original list of people to be notified, so everyone who had seen my original message also saw his reply to me, including Janice. This time, it was three words, but I could feel the deliberateness of every one.\n\n*musicmage4114,*\n\n*Thanks.*\n\n*Stanley*\n\nSo yeah, I think it's pretty clear where he stands on this whole business. I feel a million times better, since the CEO is clearly a *very* classy guy. My boss also saw his response and also told me that I'd done everything right, and not to worry about it.\n\nSo everything worked out okay! Thanks again to everyone who helped me stop freaking out!\n\nTL;DR: CEO sent a three-word email that cleared up the whole situation and put the nosy executive in her place. :)",
        "permalink": "/r/relationships/comments/3syote/update_i_24m_addressed_my_ceo_60sm_informally_and/",
        "comments": [
            "> musicmage4114,\n\n\n> Thanks.\n\n\n> Stanley\n\n**OOOOOOOOOOOOOOOOOOOOOOHHHHHHH**",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "You'll run into plenty more \"Janices\" in your career. They're everywhere. They're insecure people who make up for their insecurities by pointing out everyone else's mistakes. Stanley - along with your manager and everyone else there - probably already knows what a pain in the ass she is. Glad it worked out. With experience, you'll learn which criticisms to sweat and which ones to ignore.",
            "From your tone, this seemed accidental, but this email did more damage to Janice than you probably know:\n\n>Dr. President,\n>\n>I apologize if I have been presumptive in addressing you by your first name. Janice informed me that it was improper, and I intended no disrespect.\n>\n>Sincerely, musicmage4114\n\nSeriously, opportunities to help a mean person hang themselves are not that common and you just helped Janice with her knot.",
            "[deleted]",
            "I worked for a company where this dofus named Bill was always running around in brilliantly color Cosby sweaters and tripping over things and making dorky jokes. I liked him and would joke with him very often. There was a long hallway in our office with a door at the end. I am exiting said hallway one day with Bill close behind and hold the door for him while sorting mail, I look up and notice he's stopped to talk to someone. \"Bill! It's not my job to hold the door for you!\" He laughs and jokingly speeds through the door. \n\nI go to my quadrant of the office and my boss is on me lightening quick. \"Why were you yelling at Bill?!\" Uhhhhhhh... \"You can't talk to the CEO like that!!\" Whoops. So I chill out on Bill and politely wave at him but no more dirty jokes or high-gives or asking him for money for the soda machine.\n\nA week later he asks me why I've stopped joking with him and I'm like \"You're the CEO and Karen said I can't talk to you like that\" Bill says, \"Oh screw Karen, she's not funny at all\" and that was that. ",
            "Thanks, Stanley.\n\nHaha. That's great. Screw you, Janice.",
            "Fucking Janice. I had to work with a lady named Janice who was just like that. You handled this very well.",
            "Ha! I read your original, and most people covered that you handled it in a classy respectful way, so I didn't add my two cents (since it was their two cents as well).\n\nOnly a few people said Janice (and maybe the CEO) would take it as a slight to Janice (however unintentionally). Now that she's been put in her place by the CEO, perhaps you should start addressing her as Mrs. Janice Lastname. ;)\n\nKidding!\n\nBut seriously. Fuck Janice.",
            "You hear that, Janice? \"Stanley.\"\n\nThis is why nobody likes you, Janice.",
            "I like Stanley.",
            "\"Janice, take a pill\"\nStanley\n\nGood for you OP!  The work world is not easy and you handled this well--although I wouldn't be surprised to see another update regarding some passive-aggressiveness on Janice's part.",
            "The best part is that Janice took a solid three years to build up the courage to use his first name. Lol. ",
            "Your CEO doesn't screw around. He managed to do in three words what most *managers* need to do in HR meetings that last half an hour. I can see why he's the CEO.\n\nNo drama, no mixed messages, everyone is now on the same page.\n\nMaybe it's because I'm still rather young that I believe \"professionalism\" to be the least efficient way to conduct business. You are putting up a charade with PC terms, and communication that is almost *saccharine*. Give it to me straight---we're here to do business, we're not here to coddle people and their delicate sensibilities. We don't need to go to HR for what should be light-hearted jokes, and we don't need to be sent emails from our leadership about  how our CEO needs to be addressed. We're here to work.\n",
            "Glad Janice got coREKTed",
            "Does your aquarium have pufferfish. And what are their names. \n\nWhat is your favorite fish.\n\nDo you have a tesselata eel?",
            "Where I work, its very frowned upon other employees to criticize each other. Coaching and training should come from your manager, and if you do have a problem with another employee the expectation is that you speak to *your* manager, who will take appropriate action. You all work for the same company, you're all on the same team. Janet sounds like a bootlicker who gets off on making others look bad, but its going to bite her in the ass someday.",
            "I don't know about rules on cross posting but this is perfect to be in justiceboner",
            "musicmage4114,\n\nThanks.\n\nYour biggest fan\n\nStan",
            "Just a heads up: by name-dropping Janice in your follow-up email, you made her look like a meddling busybody to the CEO.  While that doesn't seem inaccurate, you've potentially pissed her off, and she may or may not be the type to make your professional life more difficult.  In the future, if you have to make a damage-control email, just say \"it was brought to my attention that [blank].\"  If they know Janice, they'll assume it was her.  If they want to know who said it, they can ask.",
            "This is why what you did was right. CEO's need to know how their EA's are treating people on their behalf. The EA to our CEO acts like the gestapo and says things like: \"Dr Smith said that *something that is obviously her opinion and not an order from him*\" and people have got no come back as they don't ever talk to the CEO, they talk to her.",
            "Your CEO rules.\n\nAnd Janice can suck AALLLLLLL of the dicks.",
            "So much said in three words! Now you can continue to call him Stanley, and not care what Janice thinks!",
            "I'm important.  You will not call me by my given name.  Instead, you will address me formally.  You will also suck my balls and clean the shit stains out of my underwear.  You will do this because I am important.",
            "Oh, Janice. Bless her heart. ",
            "You might want to bring a small tube of aloe to work tomorrow for Janice's burn.",
            "Your next message should refer to him as Stan the Man.\n\n(Not really but you get it)",
            "You're junior-- simple mistake. He's the CEO for a reason, because he doesn't get hung up on stupid shit. I work in consulting and I was at a client site recently, some of our client team wigged out about where the CEO was going to sit because apparently he has a seat he likes...in reality CEO could care less about where he sits. Mid-managers create weird mental prison cells for themselves. ",
            "Ahhh, the cc'ed email of retribution. Feels good, man.\n\nI'm glad all is well, OP!",
            "From now on at this aquarium, Janice sleeps with the fishes.",
            "Best update yet!",
            "Your CEO is awesome.",
            "HAHAHA FUCKING JANICE\n\nStanley is a gem.",
            "I spent so much time trying to figure out why everyone thought the word 'thanks' was such a burn.",
            "Chandler, OH MY GAAWWWWWWDD.",
            "You're 24, so maybe you have not had sufficient experience yet. But fact is: As CEO, my first objective is the profitable operation of the company.\n\nI used to be in senior management. I answered to no one but the CEO. Fact is, petty office squabbles pissed me off more than anything else (and my CEO told me the same thing).\n\nSo with Janice starting shit for something that clearly has zero bearing on the bigger picture (profitable operation), she just got on the CEO's not-bad-but-not-so-good side. You, on the other hand, just got on Janice's shitlist, and you'll more than likely encounter petty passive aggressive bullshit with her for the rest of your time there.\n\nFrankly, I wish people would just focus on what's actually important instead of office politics. Leave the politicking to those of us sitting in the board room.",
            "Funny thing, this happened to my father once.\n\nWalking down the corridors of Ainsworth, he bumped into the ceo and billionaire Lenny Ainsworth. Our family name is pretty unique and my father has been in the industry for decades. \n\nMy dad, typical goes \"Lenny ! How in the hell are ya!\" And len's minder (he's in his 80s) goes postal. Len just turns to him and tells him to shut up :P",
            "Every single thing about this situation is heartbreakingly stupid on many levels. What a life.",
            "Goddammit, that CEO is the fucking balls.  I love the way that was done.",
            "I have never refered to any executive by anyone other than their first name. Janice is a weird person. ",
            "My first duty station was a headquarters unit in the Pacific, working directly for a Marine Colonel (O-6) who worked directly for the Lieutenant General (3 star, O-9) in charge of the Marine Corps operations in the theater. I was a Lance Corporal (E-3) at the time. In the office where my desk was, my boss (Staff Sergeant, E-6) sat about 2 feet behind me and was privy to every conversation I had.\n\nOne day, after being there for a few months, the Colonel came over to my desk and was asking me some questions about a work thing that I was doing for him. I remained seated while talking to him. For those of you not in the military, that's a massively disrespectful thing UNLESS the person you're speaking with has given you permission to stay seated.\n\nSo we finished our conversation and he left with a hearty \"Thanks, Lance Corporal!\" to which I replied with an equally hearty and warm \"No problem sir, anything I can do to help.\" My boss even commented on how well the conversation went down.\n\nWell not 20 seconds later a new guy (Gunnery Sergeant, E-7) came over and decided to school me on proper etiquette when talking with officers. So to avoid anymore perceived disrespect I stood (srsly, at my desk) and listened to him lecture for a minute or so until my boss finally turned around from her desk and said, rather curtly, \"The Colonel cleared him day 1, Gunny. Anything else we can do for you? LCpl Trees is pretty busy right now.\"\n\n**Moral of the story**: 9/10 people who correct you on stupid shit like titles and how to address a superior are either dicks, don't know what the hell they're talking about, or more likely a combination of both. Err on the side of caution, but let the person you're talking to decide how they should be addressed. Not a 3rd party.\n\nYou did the right thing initially based on how you were trained and given that previous interactions didn't cause any issues. Janice is just a nosy bitch.",
            "Stanley threw some serious shade in those 3 words.\n",
            "We all know Janice in accounting don't give a fuck.",
            "This is awesome. I'm sure CEO was chuckling while writing it. \n\nIf I ever called the CEO of my company, \"Mr.Smith\" instead of first name, I'm pretty sure he'd never stop laughing at me about it. ",
            "daaaaaaaaaaamn, nice move Stanley. ",
            "what if he replied\n\nLOL musicmage4114\nChill\n\nThanks.\nStanley",
            "You handled the initial correspondence perfectly.  Janice could have easily brought the \"error\" to your attention without cc'ing your boss, and it could have come across as helpful.  Instead she was a tattle tale.  I work in a non profit as well and can understand how sensitive all the politics can be.  I would never throw a co worker under the bus the way she did.  ",
            "Stan the man",
            "Perfect. For the record I missed your first post, but I have never ever ever met a professional who prefers to be called Mr. so and so over their real name, and I'm in a very snooty profession. Whatever problem Janice has is her own problem with authority, and oddly for women it's especially important to be breezy and casual with your male superiors so I'm shocked she doesn't know that well into her career. ",
            "Haha, fuck you Jealous Janice!",
            "Nothing says \"We're actually busy and getting something done ere\" better than not having an attitude of enforcing titles.  Sounds like you work in a good place, and Janice got the public dressing down she roundly deserved.\n\nAlso, it sounds like even your boss doesn't like Janice.",
            "Our CEO is always referred to by his first name and will wander up behind you in the kitchen and cheerfully say, \"Wotcha!\" in greeting.\n\nI've worked for charities whose board and CEOs were Knights and we'd still refer to them as 'Ian' or 'Harry', never Sir.",
            "If your CEO insisted on being called 'sir' or even 'Mr.CEO' he would be a terrible leader.  That's not leadership.\n\nWhat happened here is Ms.MiddleManager wants to be powerful, and have special privileges, and if the CEO doesn't even get the Mr.CEO treatment what is her reason for wanting it?\n\nShe will never be ultimately in charge.  People like that can't lead.\n\nYou did nothing wrong, if anything the follow up email apologizing was probably pointless.  I can't imagine how uninterested the CEO would be in some shit like that.  You called him by his first name.  The fuck.",
            "Literally just laughed out loud because this is *awesome*. For the win!",
            "can't wait for update 2 when janice resigns from sheer embarrassment ",
            "Wait, so are you going to address him as Stanley from now on? ",
            "I need to know.\n\nHow did Janice take it?",
            "For a second, I thought you meant he actually called you musicmage4114, and I was like \"OMG HE USES REDDIT AND SAW THIS POST LMAO\"",
            "I'm a bit late to the party, but yeah, you handled this all perfectly, and totally professionally. I would not have kept as cool a head as you when I was 24, that's for sure. Good result too. Well done!",
            "b/c janice in accounting don't give a fuck...",
            "As someone who worked for many years with a Janice (though my Janice preferred the BCC more than the CC - which is even more irritating imo), this update was satisfying as hell. Thanks OP (and Stanley!)",
            "Fuck yeah, Stanley! ",
            "I was like...unless you are in Germany (or some other culture where you address someone by title and last name for business) this lady has a stick up her arse.",
            "UP YOURS, JANICE",
            "Oh man, this has made my morning! ",
            "Because Janice in accounting don't give a fuck",
            "Absolute savage",
            "He knows your Reddit account? Abandon ship!",
            "Stanley just doesnt like Janice.",
            "I bet Janice feels prettttty dumb lol",
            "Brilliant.",
            "Just to clarify, your follow up email was a bad idea, regardless of what the consensus here is. It was bad because in the process of apologising, you name-checked and therefore angered Janice, and it would be extremely clear to the CEO that Janice would feel this way and that you did it on purpose. This sort of in-fighting is bad in an organisation, and as a junior person, you're in no position to do it. You also skipped hierarchy in doing this and by not pursuing it via your line manager, and this sort of insubordination just isn't acceptable. This is bad office politics. The CEO's response hasn't legitimised your actions, but hopefully everybody will move onto another drama and forget about it.",
            "To be honest, some people can be having a shitty day and decide to lash out at others. Could be their SO, kids, or coworkers. Shit happens.",
            "Not quite a CEO, but I work for a multinational insurance company, and I address my third and fourth line supervisors by their first names.\n\n",
            "He is clearly muchos awesome.\n\nIf it helps I often have to communicate with academics who often don't provide titles so if they sign off with full names or even just first names and I've never communicated with them before I always start with \"Dear X (if I may?)\"\n\nThat way if they prefer to be addressed more formally they are \"usually\" more polite about telling me. ",
            "I am so impressed by your CEO that I wanna give him a Reddit gold. ",
            "sweet! :)",
            "Oh how awesome is this. Big smile on my face this morning. I'm glad this turned out great for you.",
            "I can't imagine that kind of relationship with our boss, I almost froze when he walked by with a trustee. They don't even look at you. ",
            "Yay!   That ended well.  I like Stanley. ",
            "I work at an aquarium. First name basis for everyone.",
            "I have the biggest justice boner right now.",
            "Dragging the boss into Janice's issues was needless game playing, it could have backfired. You made an enemy out of a nobody.",
            "I mean, it is proper formal respect if you have not met someone to go as formal as possible to show you know your spot in the organization. That does not demean your title but accordingly to the work they may have put in and deal with people who have dedicated longer than 365 days to this organization. I highly suggest you remember this-- you were told when you meet him, but have never met him so Janice is correct in her saying he extends the invitation. No matter your intentions, you are just a small employee and need to nod at this hierarchy no matter your personal beliefs or what you were told in orientation. Think about how disconnected that orientation is from the CEO. Networking in a professional manner is a lot like playing chess. Other than that, Janice is an uptight b",
            "[deleted]",
            "Relationships ... yeah right. Middle names known from applications paper work. 9-5 ",
            "I have my own similar story to this. Wasn't my boss or anyone in my company though. \n\nI manage security door cards for our building as one of my duties. We have a number of tenants who will email and request replacements. One time a admin emailed me to get a replacement for \"the honorable judge Judy.\" (We have a court room in the building)\n\nI responded to ask a question and referred to Judy as simply \"Judy.\" The next three or so emails this person reasons by saying \"the honorable judge\" each time Judy's name is mentioned. I just continued to respond to \"Judy\" because fuck that. \n\nPeople can be such twats. ",
            "Make her fall for you. Go to her place. Finger her HARD. When she's down and out begging for your penis, then leave. REAVENGE.",
            "meow!!!\n\njeez women can be so catty haha"
        ]
    },
    {
        "post_id": "4uupnu",
        "author": "casja",
        "title": "UPDATE! Me (22F) with my boyfriend (26M) of 2 years; he's against the idea of getting a pet but I'm lonely and my job is stressful.",
        "url": "https://www.reddit.com/r/relationships/comments/4uupnu/update_me_22f_with_my_boyfriend_26m_of_2_years/",
        "score": 2844,
        "num_comments": 327,
        "created_utc": 1469627647.0,
        "selftext": "ORIGINAL: [reddit!]https://ud.reddit.com/r/relationships/comments/4u46o4/me_22f_with_my_boyfriend_26m_of_2_years_hes/\n\nMy first post didn't get a whole lot of attention, but I figured I'd update anyway, as it's a happy one.\n\nThe TL;DR of my last post was that, after recently moving cities and experiencing a lifestyle change (boyfriend started working 80-100 hours/week) I was feeling stressed out and drained from my job, which involves animal research, and thought that getting a pet would really help me (as it has in the past). Since we really don't have time for a dog, I wanted to get a cat, and while he initially agreed to it, my boyfriend sat me down 8 months ago and reiterated that he wasn't super into cats and that since I seemed to be adapting well if I would hold off on getting one. Since then, my mental health has gone down a little and I wanted advice on how to talk to him about it.\n\nFirstly, I got a couple of PMs and comments telling me that my boyfriend doesn't have to work that much and that I shouldn't be okay with it. This is a little naive, people. Everyone that has his position works as much as he does and he loves his job, so he needs to put up with the hours for about 5 years until he's moved up the chain of command. So that's not really up for discussion and never has been. He loves his job and feels fulfilled at work, which is something I want for him.\n\n\nONTO THE UPDATE...\n\n\nI got a lot (a looot) of comments that sort of told me off for wanting to make a plea for a pet that my boyfriend wasn't on board with so I initially decided not to broach the topic and keep it to myself. \n\nHowever, I guess I was closer to my breaking point than I realized because the next night when he got in at midnight, after having a long and stressful day that had put me in a bad headspace for the evening (even after going for a 5k run and lifting some weights) I just sort of had a breakdown in his arms. He was flabbergasted and worried and asked me what was wrong.\n\nI sort of... snotted, hiccoughed, and cried as I told him that I felt really lonely and was upset that he'd asked me to hold off on the cat, that I was very sad that I interacted only with animals that hate me and that I can't get attached to all day, and that my colleagues find that their pets ground them; that I couldn't continue coming home to an empty house and that pets were really important to me.\n\nHe was very shocked to hear all of this, stroked my hair for a while, made me tea, ran me a bath, and said we'd have a serious talk when I got back from my conference (monday & tuesday). I was a little put off by the fact that he wasn't talking about it right away (but understanding because by the time we got to bed it was probably 2am).\n\nI was at my conference until last night, but when I got in at around 8PM, I was surprised that our condo door was open--my boyfriend was home (never happens)! I was even more surprised when he came to the door, grinning, with a big Maine Coon cat in his arms that I'm very familiar with--my childhood kitty that lives with my parents. \n\nWell, I was pretty much a mess after that, happy and sobbing all over Snuffles (Snuffles rather frantically twisting his body in 1000 bizarre ways trying to get away and thereby avoid salty tears and snot), and my boyfriend explained: we were \"borrowing\" Snuffles for the next 7 weeks from my parents. He then said with an even bigger grin that he was serving as my cat \"in the interim of waiting for your new Abyssinian kitten to age to 10 weeks, at which point we'll give Snuffles back and bring in the kitten.\"\n\nMy heart was so full. I was surprised that he remembered my brief mention that I thought that an Abyssinian would be a good breed fit for us (not super vocal, very friendly, short hair, indoor cat). I definitely never expected him to pay for the cat or anything, but he has put a deposit down and I will go pick a kitten from the breeder's litter in the next couple of weeks!!\n\nI asked him what had made him change his mind the full 180 degrees and he just sort of explained that he was only ever \"sort of\" against the cat and thought I had been doing just fine mentally, so I didn't need one, and just figured we'd get a dog once we'd moved out of the city centre in 5 years or so, once both of us have reduced our hours.\n\nHe also is still a little bit concerned that a cat isn't going to be a fix-all, so I made an appointment with a psychologist I used to see and will be driving to my hometown next week for a \"check in\" with her. \n\nI thought he didn't want a cat because his dad thinks they're an \"unmanly\" pet, so I asked him as much, and he rolled his eyes and said \"Look, the CEO of Snapchat can't even find a hotter partner than I can and he definitely isn't dating someone that is getting a PhD. There's literally nothing in the world that is a threat to my manliness\" \n\nAlso, just like I thought (because I know my boyfriend well, not just a \"magical rationalization\" I \"made up just because [I] want a cat\"), this morning I woke up to my boyfriend spooning Snuffles instead of me; he'll be fine having a cat. \n\n\n\n**tl;dr**: we good, he wasn't actually really against getting a cat, so we're getting a kitten, and in the meantime I get to hang out with my old buddy.",
        "permalink": "/r/relationships/comments/4uupnu/update_me_22f_with_my_boyfriend_26m_of_2_years/",
        "comments": [
            "He borrowed your childhood cat back for you on top of getting you a kitten?  Awwwwwwwwwwwwwwww.\n\nSo this tells me two things.  One, you have a great man there.  Two, you need to be a lot more clear about talking things through.  See what wonderful things happen when you do?  Hopefully next time it won't take a breakdown - that's not good for you OR him, sweetie.\n\nAnd why aren't there pictures of Snuffles?  Threads concerning kitties demand kitty pictures!",
            "Didn't read the entire original post, but I am happy that he compromised with you.\n\nAs the mother of two kitty fluffballs, I can absolutely say that they do wonders for your sanity. I think that if it weren't for them, all of the stressful situations, breakups, moves, lonely nights, etc. that I've had to go through over the last 6-7 years would have been a lot more difficult to bear.\n\nI do second the suggestion of a 2nd kitty though, so that the new one won't suffer from loneliness/depression/separation anxiety.",
            "I'm curious why you work in animal research, when it is clearly having such a negative effect on your mental health. I worked in a lab animal program at a major university for a while, and never found myself feeling \"bad\" for the animals, disliked by them, etc. I ended up leaving, though, because I found the job too monotonous and not engaging enough. I went to grad school, and now I have my dream job working as an Aquarist (I've always liked fish/sea creatures more than other animals). I'm 29.\n\n\nIs there any chance you can find a more fulfilling and less draining career path? Or is animal research just part of grad school? If you're doing your PhD in neuroscience, or something similar, though, I'm guessing it's going to be part of your daily life for a long time to come...",
            "OP, I am very happy for you that your boyfriend saw how much you needed an animal. That's wonderful.  I'm just asking that you pleaseplease strongly consider getting two kittens instead of one. Why? You guys both have incredibly full schedules; sometimes you travel. The kitten will be bored and lonely while alone. Only cats tend to get obese and depressed. Two kittens are less work than one, as they play with each other and keep each other company, and as adults they are loving companions. Two cats will still love you as much or more, as they won't be depressed.  (I have done kitten rescue work for 11 years and we always try to get kittens placed in pairs).\n\nHappy for you, again! Yay, OP!",
            "We have an Abyssinian and she is so lovely, I hope yours brings you as much joy as ours does for us, such a great update! ",
            "As someone who had a cat and worked long hours:\n\nhaving toys around to stimulate a cat's mind and hunting instincts while you work is really good, if you end up going with one cat. Something like the Kong Cat Wobbler, where you put food in and the cat has to bat it around to get the food to fall out, is really great for that.",
            "I'm not crying, you're crying.",
            "Cats aren't pack or truly social animals. Some cats don't even want a \"friend\". Please read about feline social structure first before listening to advice that isn't well researched.",
            "Abyssinians are beautiful! Congrats. they are active and not usually lap cats. Consider getting a cat tree or exercise wheel. ",
            "Awwwww. Maine Coons are awesome. I met the most amazing Maine Coon named \"Glory\" once. Asked on the spot if I could adopt her, and was told there was a long waiting list.",
            "I'm glad he's letting you pick it. At first I thought he'd just went out and bought a random cat for you, which is the dumbest idea ever.",
            "This actually made me a little teary. I would totally have had the same reaction as you. Congrats on having an awesome bf and lots of kitty snuggles!",
            "> that my boyfriend doesn't have to work that much and that I shouldn't be okay with it. This is a little naive, people. \n\n80-100 hours is not a normal work schedule. it is not naive to call out ridiculous hours. a week is 168 hours. 9 hours sleep per night is ideal, which leaves 5 hours in a week to spend time together or do some kind of hobby. and that is if you include commute as a hobby",
            "The only thing that concerns me is that it sounds a lot like you guys don't have much time for a pet. Maybe I'm misinterpreting your schedule, but I hope you realize that cats need people around,  too. They aren't \"independent.\"",
            "Please also keep in mind that cats are not just accessories to make you feel better, they're family. They can and often do live up to 20 years + so take the ownership seriously. \n\nAlso, this may get me downvoted but it's really a shame that you both didn't adopt and instead bought an animal from a breeder. There are droves of abandoned and perfectly wonderful animals at local shelters that need loving homes.  ",
            "Aw, that's a really lovely update OP! I'm glad everything worked out for the best!",
            "I'm crying with joy!! Thanks for this great update and congrats!! ❤️",
            "I'm so happy for you, having my two kittens has helped my mental health so freaking much and I hope it does for you too. It's nice just to have somebody there, even when they're not able to talk back they can still communicate in small ways how much they appreciate you.\n\nI'm glad you get to spend time with your childhood cat too, my last cat I had since I was a preteen and he will always hold a special place in my heart. I hope you enjoy this time with him :)",
            "My fiancé works far-ish away and I work very close.   I had a cat before but she passed due to cancer.   I said to him I really needed a companion when he wasn't there and that pets offer so much more than just meows and poops.   \n\n\nHe reluctantly agreed to having a cat and I found the perfect little meowball and we are both so elated with him.   I'm glad it worked out for you.   Pets are so much more than just....pets.   They are family and they have a sense of empathy we don't quite understand.",
            ">I sort of... snotted, hiccoughed, and cried as I told him that I felt really lonely and was upset that he'd asked me to hold off on the cat, that I was very sad that I interacted only with animals that hate me and that I can't get attached to all day, and that my colleagues find that their pets ground them; that I couldn't continue coming home to an empty house and that pets were really important to me.\n\n\nEhh, I think your boyfriend did a really great thing, but does this not come across as very guilt trippy to anyone else? He said multiple times he didnt want a cat and then is faced with a sobbing girlfriend. Idk... people are praising him but it doesn't sound like you gave him much of a choice.\n",
            "I work from home and have two dogs. They have saved my mental health. ",
            "I didn't see your first post, but I'm so happy for you! As a fellow person who needs an animal friend, I'm glad that he was able to understand and compromise... and I bet he will wind up wrapped around that kitty's tail too. Congratulations and all the best to you guys and your new kitten!",
            "Yay OP that's great. I love when these things work out! I brought a cat into my life when I was anxious, sad, and stressed, and my life was compeltely changed. Although I definitely agree that therapy would be an excellent resource for you.\n\nI see a lot of the top posts suggesting getting a 2nd cat. I would not stress about this potential future decision and do not let the adamant views that it's the best decision to make stress you out anymore. Cats are very independent animals, and some cats prefer being alone and the only cat in the house. Cats can become very territorial and mark their territory, and trust me when I say the result of this is the worst smell imaginable. It can also be highly stressful to see them not get along.\n\nSo get your one kitty now and if you decide to get a 2nd cat in the future, get one after you consider all the pros and cons :) \n\nThat being said, adopting two kittens at the same time is generally a good way to avoid any problems. So if this is an option, feel free to go for it! \n\nBefore anyone downvotes me because they disagree with what I have to say, I have had eight cats in my lifetime. I have had cats that were the only cat in the household and I have had as much as three cats at a time and this is my experience with the matter. \n",
            "It's extremely important that you post another update with kitten pictures when you get it in a few weeks. It will definitely be an important resource for relationships or whatever.",
            "[removed]",
            "Whoever on here was telling you off for wanting a cat when your boyfriend didn't want one and for even wanting to talk to him about it, needs to bug off. Seriously. Communication is SERIOUSLY everything in a relationship, when done right. You obviously have a FANTASTIC boyfriend, and I wish you all the best. Go snuggle up with your furry and non-furry boys and get some much needed rest and relaxation. ",
            "I want to be happy for you but I also wonder if you're prepared for the reality of having a kitten. Kittens need more attention and stimulation than grown cats, it's highly recommended if not necessary that you have other cats already. If you had adopted from a shelter instead of a breeder that just churns cats out for money they would have told you that. It's disappointing to see this post end in you supporting a kitten mill.",
            "[removed]",
            "This is my favorite update I've ever read on this sub. I'm crying right now!",
            "Abyssinian are a fantastic pick, I had one when I was younger and she was wonderful! Loyal and playful, so so smart. She used to ride on my shoulder when I was walking around the house haha",
            "Fact: Maine Coons solve everything!  He did a wonderful thing! Give your borrowed kitty a chin scritch for me...I miss mine everyday!",
            ">I was even more surprised when he came to the door, grinning, with a big Maine Coon cat in his arms that I'm very familiar with--my childhood kitty that lives with my parents.\n\nDays gone by without having a sob at an adorable pet story: 0",
            "This is a lovely update. I can relate to wanting a kitty, but it's not a good time for me right now. I'm so glad you were able to compromise. ",
            "My heart is full for you! I wish you all luck. You seem to have a great person in your life (:\n\nI also work in animal research and having the ability to go home to my rats and love and spoil them means the world to me. ",
            "Hi OP,\n\nI recently started working from home in a job which is pretty highly pressured. I'm pretty anxious generally too, so I get easily frustrated, especially when there is no one to vent to. \n\nWhen I get like that, I will force myself to stop working and go and find my kitty to give him a little hug. It doesn't make the anxiety go away, but it's a reason to get away from my desk for a minute or two to regroup, and it takes the edge off. Nothing is more relaxing than hearing a kittyboo purring loudly. \n\n",
            "This guy is worthy of a Salt n' Peppa song",
            "awww-thats super-give your bf a reddit hug",
            "This is the cutest ending to an r/relationships saga ever!!!! How wonderful that you get seven weeks with Snuffles :) I've had my Aby for twelve years and she's the love of my life, best of luck with your new kitten.",
            "Um, does your boyfriend have a brother?",
            "Good grief, I'm crying. I missed your original post, and now just seeing the update, and oh my goodness, I'm so happy for you!!!\n\nEdit: my fiance and I had to live apart for three months a couple of years ago and my cat definitely got me through it. So many warm fuzzies right now.",
            "I call bullshit. No way on hell you're hotter than Miranda Kerr",
            "So, you cried and got your own way? Nice.",
            "My boyfriend surprised me with a kitten because of this same reason! My job in research is grueling and some days I don't even eat after 15 hour days, but as soon as I come home and my cat comes up to me I feel relieved! I hope you have a wonderful life with the new kitten!",
            "[removed]",
            "Awesome boyfriend! Total keeper. ",
            "I've just been through a breakup that ripped my heart out because my partner wasn't nurturing enough of me (and never really liked my cats). To hear a story of such a sweet gesture warms my heart and gives me hope for my own future and search for a partner. Best of luck with the feelings of loneliness!",
            "Awww! I hope you post an update when you get your kitten. I'm so glad it worked out and your boyfriend sounds amazing.",
            "How wonderful! My partner wasn't a cat person when we started out together. When our beloved Siamese died at only four years old he used some excess loan money (business van didn't cost as much as he borrowed for it) to buy me an Oriental shorthair, she loves him way more than she loves me, they even wrestle together. He is no less manly for it :D They aren't a fix all but they really do help so much.",
            "I am so happy for you!  \n\nI actually teared up a little reading this.  Made my day.",
            "Maine Coons are the absolute BEST!!! I'm so happy for you! Enjoy that baby.",
            "Yay!!\n\nAbyssinian will be a perfect fit! I liove with abyssinians for a few years now and the are so affectionate and clever. They are great companions! \n\nMy SO is allergic to long hair cats but is completly ok with abyssinians.\n\nI'm sure your parent's maincoon is awesome too. ",
            "This made me so happy! Congrats. :)",
            "Just wanted to comment, my 2 fluffy buddies are my lifesavers. My Maine coon is by my side whenever he can (to the point of not being able to pee without him). Animals will always be in my life, they are my babies and I hope your new kitten becomes a huge fixture in your life! ",
            "Ah I love this! So sweet. ",
            "This is a really lovely update, and I think your boyfriend sounds like a great person (as do you!) Thanks for making me smile, and enjoy your kitty time!",
            "I love this happy ending! Cats are great pets when you're lonely, and when you're not!",
            "Not much to say here except that your boyfriend is an awesome man and that if someone ever did something like this for me I'd be over the moon. Congrats on your reunion with Snuffles AND your new kitty, girl!",
            "I'm glad that you're happy! What a nice surprise!\n\nBut couldn't he have sat you down and explained his plan before going through with it?",
            "Wow. I'm so glad you partner listened to you, took action and did something so genuinely just to make you happy. He's thoughtful and considerate. I'm happy to hear you get to visit with your old buddy and get a kitty. YAY!",
            "Adorable! I just wanted to add that I found my cat (he was a stray) when I was in law school and he was a great comfort to me during some very stressful times in my life. My boyfriend was kind of iffy on the idea of a cat but has come to love my cat as much as I do. I often wake up during the night and my bf and cat are cuddled asleep! I hope your cat brings you so much joy and that your bf sees how great cats can be!",
            "Hmm. What you clearly need to do is compromise and have a baby instead. /s\n\nCongratz on the cat!",
            "Oh my goodness he is so sweet!  Keep that guy.  I've had two Abbys and they are the best cats too!",
            "Holy shit I am literally tearing up. What an awesome boyfriend you have! I'm so happy it worked out!",
            "I wish all the updates were this happy! 🐱❤️❤️",
            "I'm sooo happy for you! Your boyfriend is amazing for being so thoughtful.",
            "That's so sweet, I teared up reading it :')",
            "My SO wants a Maine Coon cat when we move in together. He also wants two silky chickens lol. He already has a dog who is living with his Mum and a bird with his sister. He's my perfect match haha. So happy to hear the update, he's a great partner.",
            "I thought he was just going to have picked a kitty out himself, which IMO isn't ideal since animals are still individuals, but this is perfect. XD you get a cat you already know and then you get to pick out a new baby! Ahhh so good.",
            "As a cat lover, this overjoys me. You have someone special right here. Sometimes men need the tears and the actual emotions tied to see the seriousness, as sucky as that is. He has gone above and beyond for you, getting Snuffles for you!!!! That is one of the sweetest things I've heard in a long time, especially to hear he was cuddling with the cat!!! I hope this fills that void for you and the three of you live a happy life together!!!",
            "Loved reading this update,  so happy for you!  Please keep us up to date with how your mental health picks up :)  best of luck!! ",
            "Your boyfriend is a winner! This whole update just makes me squee!\nHave fun with your kitty!",
            "Good job getting a cat. I had a similar situation happen and got a dog. Since my husband didn't want pets, I am charged with being the sole caretaker of our dog. I'm not able to go to most social events or even stop at a store before I go home because I have to let him out for a bathroom break. I love my dog, but it's sometimes hard getting things done that I need or want to.",
            "That is the sweetest story ever. I'm so happy for you. Cats really are magical and able to help out your mood. I have a chronic illness and my babies have helped me through some really tough times. Good luck to you and your new family!",
            "I'm sorry you are feeling that lonely. Trust me when I said I've been there. But quite honestly, I think there are some other things you should be doing to help your mental health in addition to your new cat.\n\nPets can definitely be therapeutic animals. They bring a lot of joy in your world. Just be careful and keep a look out for signs of  depression.",
            "Don't let that man go!",
            "This made me happy :) he totally loves you, cute.",
            "</3 snuffles gonna get stolen by boyfriend!\n\nLol I'm glad you're getting better op",
            "Ah, what a great update and I'm happy for you OP! I hadn't read the original post until just now, but as a owner of multiple cats (even at one point living in a studio apartment) I was disappointed in the number of people who said that all cats smell, and that unless you practically have a cleaning OCD you're always going to smell the litter. This just simply isn't true. As long as you use a good litter (\"World's Best Cat Litter\" really is the best), scoop the pan once a day, replace every other week or so, no cat or cat home will smell like piss or poop. \n\nHair? Well, yes. One of my cats is black and white. I swear she purposely sheds her white hair on my black pants and her black hair on my white pants. 3M makes a great lint/hair removal roller.",
            "That is love. Good luck in everything!",
            "Awwwww that's so sweet! Your boyfriend sounds awesome :) a bit off topic, I'm curious about your work! I'm very interested into doing research and was hoping you could give me a few details if you have a minute. Researchers that work with animals are few and far between so it's always nice to learn more about the job from them.",
            "[deleted]",
            "I am so happy to read this, OP! I am in a similar situation you were in: I really REALLY REALLY want a dog, finally live in a house with a fenced yard, have a job with stable hours (who would allow me to bring the dog sometimes), and in general am finally, after 11 years of waiting, in a place where I could have one. (I grew up always having at least one dog.) But my boyfriend, though he loves dogs, isn't \"emotionally ready\" for one. Like you, I reached a breakdown point (when I got my hopes up that I was going to get to pick out a dog for my birthday, only to be mistaken) and surprised us both by breaking down sobbing when it was clear a dog wasn't in my immediate future. We haven't had a larger talk about it yet because a slew of things have happened in the meantime, but we're scheduled to talk about it next week at a dinner date. I hope he can be as open as your very nice fella. I am reaching a point where having a pet is non-negotiable. ",
            "I'm very happy for you and all, but uh...where's the kitty tax? ",
            "[removed]",
            "This is some of the healthiest relationship stuff I've read in a long time.  You both are keepers.  ",
            "I don't know what I would have done through my PhD (also animal research/neuroscience) without my pets. I have two awesome pups that keep me grounded and happy. Even now in my scientist position I look forward to seeing them every evening when I get home. Glad to also see you're seeing a psychologist because while pets help greatly, they don't solve all the problems. Good luck with the PhD, and hang in there.",
            "Please post pic of giant Maine Coon and/or sleeping man spooning giant Maine Coon",
            "One of my favorite updates ever. Good for you guys!",
            "So, when is the wedding? Great guy. Great girl, too, I'm sure :-)",
            "I teared up reading this. Happy for you, op!",
            "Beautiful story! Thanks for sharing it. \n",
            "This is written so similarly to another update post that was posted 20 hours before this, the one about leaving the cousin off the invite list..",
            "So happy for you! Sounds like you've got a great boyfriend there too.",
            "[removed]",
            "Girl, takes this lesson; if you're having an argument and you haven't yet cried, you haven't really tried.",
            "What's wrong with Miranda Kerr?"
        ]
    },
    {
        "post_id": "5e1mg2",
        "author": "LostSonMissHim",
        "title": "I [59 M] recently lost my son [26] and don't know how to deal with potential speakers at the funeral (Update)",
        "url": "https://www.reddit.com/r/relationships/comments/5e1mg2/i_59_m_recently_lost_my_son_26_and_dont_know_how/",
        "score": 2846,
        "num_comments": 40,
        "created_utc": 1479694667.0,
        "selftext": "**Update** I'd like to thank everyone for all of the kind words and incredible advice that they have sent through both threads. I have not been able to respond to everyone, but please be assured that I have read every one of your comments, and I appreciate them all. Everyone is doing well on our end, and while the pain is still immense, sharing memories ad photos with his friends has helped a lot. I'm so proud of him and everything he did in his short time with us.\n\nOriginal Post: https://www.reddit.com/r/relationships/comments/5cuvee/i_59_m_recently_lost_my_son_26_and_dont_know_how/\n\n \nI'd like to thank everyone who responded to my first thread. Your words were so kind and helped me out with a difficult situation. I'd also like to offer an apology, as I feel I misstated some things in my original post. My difficulty was not from finding out what kind of person my son was just before his death. Additionally, I got lots of posts giving advice to the likes of \"I would let them speak,\" which baffled me slightly, as I hadn't thought that that's what I was asking. I had never considered keeping them out of the funeral and letting them speak their words, however when I re-read my original post, I can see how I didn't make it clear that I was already working with them on delivering their speeches. For this lack of clarity, I sincerely apologize. However, I read all of the comments in full, and I greatly appreciate everyone's input.\n\nTo update, the funeral took place yesterday was was, perhaps fittingly, a weirdly wonderful affair. My wife his, younger sister and I spoke, as did 4 of his friends. We decided to hold the funeral in his adopted city rather than here for 2 reasons: First was because we all know he loved that city so much, and Second was to make it easier for his friends to attend. (I should state, pretty much everyone in our hometown was in a position to travel, but his friends aren't, as they are students and it's midterm season for them.) Although people had reached out to me, I was stunned by turnout. I didn't get a proper headcount, but the room that I though was relatively large was down to standing room only.\n\n\nThe family's speeches and 3 of his friends were relatively normal for a funeral, and recounted fond memories of his life and personality. The 4th friend to speak was not.\n\nQuite simply, he wanted to roast my son, namely in the style of a comedy central roast. When he pitched the idea to me, I was a little hesitant, but I decided to give him his moment. Part of it was one of the few aspects of my son that remained constant throughout his life: he hated tradition for tradition's sake. He was always someone who would question (sometimes at unfortunately inappropriate times) why everything is the way it is. Think along the lines of \"Why is the bride supposed to wear white?\" while acutaly at a wedding. A second part of my decision to allow it was because a common theme I found out through his friends was that he was quite a joker himself towards the end, and would do anything for a laugh, going as far as making himself the butt of the joke just to get a positive reaction from them. Finally, I agreed because he was completely upfront with me about what he wanted to say (he handed me his script) and said that if I was uncomfortable with it or the idea, that he would still be honoured if he could give a more traditional speech. \n\nThis led me to the one difficult in the funeral, namely, where do I put this joker? Do I do it at the beginning to set a tone, or at the end to leave on a high? I discussed with my wife and his friend, and we agreed on a compromise, where he would give a short talk at the beginning to set the mood that wouldn't be all sad, and then he delivered his main set at the end, so we could all leave without tears in our eyes.\n\nSo, as weird as it might sound, I think we all had fun at the funeral, and I was incredibly touched to have met so many of his friends. While I still sort of feel that I' mourning 2 people, I was so proud that my son broke out of his shell when he left. I know his friends are wonderful people, and I can only imagine how happy my son was up to the end. \n  ---   \n  **tl;dr**: The funeral went well, and I was touched by the support his friends showed.",
        "permalink": "/r/relationships/comments/5e1mg2/i_59_m_recently_lost_my_son_26_and_dont_know_how/",
        "comments": [
            "[deleted]",
            "One great sign of a wonderful person is how many people are smiling while talking at the funeral and calling hours. My grandpa died when I was five and my memory of it is laughing while someone I don't think I ever saw again bounced me on their leg. \n\nIt's fucking awful that you have lost your son so early but he sounds like he made a lot of people smile during his short life. In your original post you sounded out of sorts about not knowing the man he grew into. This is a pretty common part of growing up and it sounds like he was in the weird transition stage between 'college kid' and 'grown man'. It's not out of the ordinary for you to lose touch in that period while he finds himself. I know I act very different with people I made friends with as adults versus the people I knew while I was young and awkward. It doesn't mean that he didn't feel comfortable being his 'new self' around you, it just means you were robbed of the opportunity to get to know each other on even footing as independent adults. I am so sorry that you didn't get to know him as the people his friends knew- I hope they shared as much as they could with you about the man they loved.\n\nIt was incredibly generous of you to hold a service in the city for their benefit. I hope you got some great stories out of it.",
            "Your son sounds amazing. I'm glad you got to see him through his friends' eyes.",
            "I've been thinking of you and hoping that you're well. \nThis is one of the most touching posts I've seen here, ever. I am so comforted by the idea of a room of people genuinely just appreciating and accepting a loved one who has passed, honoring them in such a sweet and funny way, while really celebrating the person for who they were. Kudos to you for working through your grief and getting the service together. Also, for doing it in his adopted city so that his friends could pay their respects. That was incredibly thoughtful and selfless of you and your wife, and while I am heartbroken for your loss I am so touched that you let your parental selflessness extend to the funeral arrangements. \n\nI'm sure the grieving process is only beginning, but please know there is a whole community here with open arms if you need a kind word. ",
            "My little brother died last year. He was killed by a bear at 27 years old. It was tragic and confusing and absolutely devastating. My mom is still not back to acting like herself. \n\nThe week following his death we heard stories from people who knew him later in his short life that sounded nothing like the kid we knew! We learned so much good and bad things about him. He had a whole other side that we never saw but man did we appreciate knowing that now. He was so complex and grew up to be an amazing man. \n\nA year and a half after his death, now that I've experienced the loss of a few friends and experienced their funerals etc. when I look back at the worst week of my life and at my brother's memorial I can honestly say... it was fun. \n\nI wrote and delivered his eulogy and then opened the floor to whoever wanted to speak. I made the entire room laugh throughout my speech. I made fun of my brother for allowing me & our other sister dress him up like a girl; gave him hell for \"choosing\" such a ridiculous way to die and poked fun at his mumbled speech and ridiculously smelly feet. \n\nThe crowd was shocked at first but completely loved it! My brother was a ridiculous person. He was goofy and inappropriate. He drank too much and made friends with anyone who would listen. He bucked tradition and loved making people laugh. The mood in the room changed drastically after that. People came up to tell stories about my brother and kept the room giggling. It was up beat and fun. It was an excellent representation of how my brother would have wanted people to say goodbye: with tears in their eyes but smiles on their faces. \n\nFunerals are not for the dead, they're for the living. If there is any way to make them less sad, less heart breaking then I say do it. \n\nYour son sounds like a very cool person. I'm sorry for your loss. ",
            "No father should ever have to bury their son. I'm so sorry for your loss.",
            "I am so glad to hear that it went well for you and your family. I hope your heart finds peace and healing quickly. <3 ",
            "Thanks so much for coming back and giving us an update. I'm very sorry for your loss.\n\nI remember reading your first post, and although I didn't have any advice to give, I am really glad that you came back to give us this update. ",
            "I am so sorry for your loss.  I lost a friend in a car accident last week and I swear your original post described every bit of him - I thought you were his father at first.  Semi-secret social life, moved away to a new city, etc, etc.  I am glad the funeral went well and his friends came out to support him and your family... that is all one could hope for during such a painful time.  I am truly sorry for your loss.",
            "I just want to offer you condolences and comfort. You seem to have honored your son well. I'm very sorry.",
            "[removed]",
            "It sounds like through this experience you bonded with his friends, and they and you will have a meaningful connection that will keep your son's memory alive. I'm so sorry for your loss, but glad you all found a way to honor his life. ",
            "OP, could you please crack a window? All of the onions that you're cutting are making my eyes water...\n\nI'm so glad that your son's funeral was as enjoyable as it could be. I lost a friend of mine a little over a year ago, only a few years older than your son, and while the funeral was tough, we managed to laugh as well - one of his favourite songs was played as the opening (Bodies, by Drowning Pool), which lightened the mood considerably, along with us all chatting and remembering the good times at the wake afterwards. \n\nEmbarrassing childhood stories came out, along with us poking fun at some of his little idiosyncrasies... it sounds strange to say that a funeral was fun, but honestly, it's what my friend would have wanted it to be like. \n\nI'm sorry for your loss, and for missing out on your son breaking out of his shell, but so glad that you were able to share some fond memories with his family and friends. ",
            "My friend's funeral was Saturday as well. Many friends sang his favorite songs like \"It Comes and Goes In Waves.\" His girlfriend of 9 years read his writings. Brother did as well. It was rough. My condolences.",
            "> Part of it was one of the few aspects of my son that remained constant throughout his life: he hated tradition for tradition's sake. He was always someone who would question (sometimes at unfortunately inappropriate times) why everything is the way it is.\n\nSounds like my kind of person.  I'm really sorry for your loss.  I'm glad you the funeral went well and you learned more about your son.",
            "I'm sending you mass amounts of love. This is a heart breaking yet beautiful story. ",
            "You are an amazing father. May a million lights shine on you and your family through this incredibly difficult time",
            "I am so sorry for your loss.  You sound like you raised a good son with plenty of people that loved him.  \n\nGo with peace and love.",
            "> I know his friends are wonderful people, and I can only imagine how happy my son was up to the end. \n\nTotally crying at work now.  OP, I'm so sorry for your loss, but you are handling it impeccably.",
            "Funerals should be a celebration of their life rather than a solemn affair simply morning the loss. From the sounds of it, he got a funeral he'd have loved! ",
            "I'm so sorry for your loss, and so heartened by your celebration of his life and friendships.",
            "I'm glad it worked out and that you were able to celebrate your son's life.",
            "I'm so sorry for your loss.",
            "I lost my friend recently; the funeral was yesterday too. If it wasn't for the age difference (my friend was 28), I would have thought it was your son. I want to thank you for posting about this. Oddly enough, reading your story helped me process my feelings about the loss of my friend.\n\nTake care. ",
            "Happy update! Glad to have seen this. \nMy condolences again. ",
            "I am sorry for your loss.",
            "This follow-up brought tears to my eyes. I'm glad that your son had family like you, with character enough to give his friends and preferences a chance instead of worrying overly about what all of your friends and family thought. It sounds like everything went as well as could ever have been expected, given the situation. I'm very sorry for your loss.",
            "I don't know if this helps but don't cry for not having him anymore, smile for having had him.\n\nEnglish is not my language tho. Sorry with your loss."
        ]
    },
    {
        "post_id": "ahtgdj",
        "author": "DisastrousProfession",
        "title": "29M I want to replace my wedding ring, how do I tell my 29F wife",
        "url": "https://www.reddit.com/r/relationships/comments/ahtgdj/29m_i_want_to_replace_my_wedding_ring_how_do_i/",
        "score": 2838,
        "num_comments": 505,
        "created_utc": 1547952678.0,
        "selftext": "I just want to say up front that I'm a dumbass and I know it, and this whole situation is my fault, but I do need help. My wife and I were high school sweethearts and got married very young. We went to the same college and got married when we were both 19 year old sophomores. I love her and we definitely made the right decision, and I would do it all over again exactly the same way with no hesitation except for one thing-the ring that I picked.\n\nNow when I was a teen I was definitely a douche. I'm talking affliction tees, hair gel, recreational MMA, macho bs. We picked out our rings together, and of course I wanted my ring to look cool. My wife, who is brilliant and always has been, chose a classy and timeless style for hers, and I did not.\n\nFriends, my ring is large, clunky, mostly black, and has a cringy design on it in silver along with a band of lab created fire opal inlay. I thought it was so badass at the time, and could not understand what my dad was laughing about when he first saw it. Well I sure get it now. \n\nI've matured a TON in the last ten years and have slowly come to hate it. I am very self conscious of it at my professional office job, and sometimes even take it off if I have important meetings with clients. I feel horribly guilty every time. \n\nI've gently broached the topic of maybe getting a ring that looks more professional, but my wife has pushed back, saying that we picked our rings together and have had them for ten years and that's really special to her. I absolutely do not want to hurt her feelings. How can I approach this in a way that would make it easier for her to accept, short of doing a full-on vow renewal with new rings (suggested by my best friend; is the nuclear option due to cost)?\n\nTLDR: I was an idiot teenager when I got married, picked out an Ed Hardy level wedding ring, need to replace it without hurting my wife's feelings.\n\nEdit: Thank you all for the great advice! I have a lot to consider, but I have a lot of new ideas now. I don't want to post a pic of my ring because I don't want to be able to be identified from this post, but you can find pics of similar rings by googling the descriptors I used, like some people in the comments have pointed out. ",
        "permalink": "/r/relationships/comments/ahtgdj/29m_i_want_to_replace_my_wedding_ring_how_do_i/",
        "comments": [
            "Can you tell her that you really want to replace your ring with something more adult and professional, and that your current one isn’t a good reflection of that. and want to put your previous ring in a shadow box on your bedside table, or frame it? Just tell her it’s purely about the aesthetics and you want something to match a more mature style ",
            "I think the way you phrased it here in your post is really great. I'm so happy that a couple of 19 year olds getting married didn't end badly. I love that you cringe now to think of the person you were, but love to think of how great she was. \n\nIf you get a simple gold wedding band, it wouldn't be to get rid of the old one. You'll always have it. \n\nOP's wife, how great that he is here talking you up, and worried about hurting you. Please let him let go of this 19 year old fashion choice. Imagine if we all had to walk around the world with the accessories we picked out at 19.",
            "I'm married.... And I personally have 4 wedding rings. I still have the originals, but I also have a copper-colored silicone one for hiking and camping, tiny thin one(and two backups) for wearing to work at my very hands-centric job, and another, actual copper ring just because it appeals to me. My husband has multiple silicone ones and a copper to match mine, as well as his original which he now considers his \"fancy\" ring. I mean, yes, the ring is a symbol and whatnot, I get that, but in the end, it's just jewelry. My husband and I are so married it probably wafts off of us like a stench, lol. I'm sure you guys are the same way. Approach it with love and honesty and a little bit of bald-faced flattery. \"Honey, you were more mature than me when we picked out these rings and yours is classic and elegant. Now that I've grown up a bit myself I'd like to have a ring that reflects that. I'm so proud to be married to you, but I'd like to be proud of my ring, too.\"",
            "I was this wife. My husband wanted to get another ring (still likes his original one, just wanted options) and I was totally against it. I was very sentimental and didn’t even like the idea of EVER taking my wedding band off my finger.\n\nHe bought himself a silicone ring and asked me to put it on him. When I did, he told me how much he loves me and that our marriage is about our love and not our rings. That got it through my head and then I was fine with it...and then I got a second ring too. :)",
            "Due to the nature of my job, I have a ring I wear to work and then I have a ring I wear off the clock.\n\nMaybe you could just get a simple ring for professional wear and use the other one when you're home. I know your goal is to get a replacement ring, but sometimes we take a hit to make our SOs happy...",
            "Can you frame it as wanting to buy both of you a new set of rings for your tenth anniversary? Not quite as costly as a vow renewal and I know couples who have done this.",
            "Talk it out with her, but make sure you don't use words like \"professional\" because that word just sounds cold and passionless. Explain to her that you've grown up a lot and you want a new ring to symbolize your growth and maturity as an individual and together as a couple. Maybe you could frame it as a 10th-anniversary thing (which is already one hell of an achievement, especially getting married so young) so she can have a genuine, sentimental attachment to it. It's cheaper than a vow renewal and just as sentimental/romantic.",
            "Maybe have your wife read this post?  You lay out your feelings clearly and they're reasonable.  This would help her understand where you're coming from.  Then see where she's coming from, and see if there's a creative solution that satisfies both your feelings and hers.\n\nAlso, this post made me laugh-- you're a descriptive writer!",
            "> short of doing a full-on vow renewal with new rings (suggested by my best friend; is the nuclear option due to cost)\n\nTBH I agree with your friend, a vow renewal would be ideal. It doesn't have to be expensive or the \"nuclear option\" by any means, it can be small and intimate, private and low-cost. There's so much more flexibility with a renewal, it doesn't have to be like a second wedding. \n\nI think it would be a good idea to add in a small ceremony of removing the old ring or having it made into a keepsake such as a necklace or placed in a display case to commemorate the past, present and future together. Don't deny your past, embrace the growth you have made both as individual and as a couple.",
            "Depending on your budget and your ring, why not finding a jeweller to melt your ring and make a new one or remodel it?",
            "[removed]",
            "[deleted]",
            "This is slightly dishonest, so take it with a grain of salt, but... \n\nMy DH has gotten several new rings. \n\nThe first time was because he gained weight and his ring was too tight. Does your ring fit exactly the same as it did 10 years ago? Would a different size be more comfortable? Considering yours is not resizeable maybe she could compromise about this. \n\nAnother time he switched to the silicone rings because they were more comfortable and safer when he was active, like at work and the gym. He wears a solid black one and it looks classier than I expected, in a casual way. They protect from degloving injuries which are surprisingly common. He still wears his regular ring on dates and stuff. \n\nHe also lost one swimming and we had to replace it. Probably dont do that. ",
            "Hi.\nMy bf and I are 8 yrs together and he bought our first ring. But after 5 or 6 years, my ring was horrible. So I told him I wanted to change mine, and he didn't like it, because it's our first and it means a lot to him. So, I told him that I would still use the old ring, but as an necklace (pingent? I really don't know the translation) BUT\nTalk to her and offer other options. Say what have been bothering you about it.",
            "We've been married 4 years and my husband has had 3 rings. His fourth and hopefully the one that will last for years now, is arriving in a few weeks. I don't mind at all as long as he lets me get him the new ones he wants. \n\nHe mentioned replacing my rings for our anniversary this year and I didn't want that at all. I'm super attached to my original rings. We did, however, get matching tattoos on our ring fingers so we have permanent \"rings\" no matter what we wear.\n\nI think if you explain that you want a ring that reflects your maturity and enlist your wife in helping you choose one (maybe it can be your Valentine's present from her?), she should understand. Maybe you guys can even recite your vows again when you get it.",
            "It's your ring. It's on your finger. You have to wear it so you should be happy with it. That's a reasonable ask. It's a symbol of your commitment, she could have put a Ring Pop on your left hand and you'd still be married and in love. \n\nJust tell her that while your feelings haven't changed, your taste level has. Ask her if there's something meaningful she would like you to do with the original ring. Ask her to help you pick out a new one, since she has better taste. But ultimately, she's just going to have to get over it. ",
            "Your ring obviously holds a lot of sentimental value for your wife, and I think that's really important to acknowledge. If you want to get a new ring, I suggest you approach it in a way that recognizes the emotional aspect, not just appearance.\n\n\"Wife, when I look at Old Ring, it reminds me of when we first got married and how happy we were.  And in the last 10 years, we've made so many more great memories. I would love to get something that makes me think of not just our wedding day, but every happy day we've had since then. Would you help me pick out something that symbolizes that?\"\n\nAnd come up with some reasons why New Ring is symbolic of your relationship now, and do something with Old Ring that will feel meaningful to her.",
            "Approach it with her that you'd like to upgrade, not replace both of your rings.  Same process as last time, you pick them out together.  If she loves her ring, figure out how to add a band or a stone to it.  Both of you should be able to love your rings.",
            "You could also put your ring on a chain or something as a keepsake to wear.",
            "We _soooooo_ need a picture of this ring ... \n\nBut anyhoo, can you suggest that you get an alternate ring for work or other similar situations? Still keep and wear the old one at home, but use the newer one elsewhere? \n\nMy wife has a \"fancy\" ring that we used in the ceremony, and a more robust/plain \"work\" ring, since she constantly uses her hands at work and the \"fancy\" ring might have the diamonds popping out etc. ",
            "Please show us!!!! You tease",
            "i think you should say it like you're saying here, it's totally reasonable and respectful. maybe you can still wear the OG ring when you guys go out :)",
            "This post is useless without pictures. ",
            "Do you work out? Ask if you can get one of those silicone rings that athletes use.\n\nOr you can get a \"work ring.\" Just leave it at work when you go home and put it on when you get in the office.",
            "Okay first off, we need to see the ring. I mean cmon you cannot leave us hanging after that description. \n\nOn a serious note, the only way to navigate this situation is to have an open and honest conversation with her before purchasing a new one. Tell her the real reason why you hate it so much. Professionalism is a part of it, sure, but it sounds like you’ve grown way past the person you used to be and this piece of jewelry doesn’t represent who you are currently. It doesn’t represent who you are in life, not just the office. \n\nThen, ask her about her hesitations. If your current ring has sentimental value for her, then you can still keep it. Maybe you can put it in a box or turn it into a necklace or something else. Maybe it can make up a part of a new ring. \n\nIf you’re religious and “blessing of the rings” and the specific ring used in your marriage ceremony is important to her, then perhaps you can have your religious leader perform another ceremony on whatever new ring you get. It doesn’t have to be a whole entire affair. It could just be the two of you and a witness. \n\n\nYou need to explain to her that what you wear on your hand is important to you and it needs to be something that you don’t despise. It isn’t fair for you to be forced to wear something you hate. I have a feeling if you have a serious and open discussion, you will find common ground. Good luck! ",
            "I wanna see this ring.",
            "My husband just threw his into the river a week later.\n\n\n\n\n... It was an accident, he was swimming and it flung off his hand,  but the general principle still holds!",
            "Shadow box. Explain that you want a modern more sleek ring, but that you cherish your current ring (even if you hate it) and that you wouldn’t dream of getting rid of it. Frame it in a shadow box, and place that in your bedroom as a nice surprise for your wife while investing in a more traditional band. ",
            "Maybe you can compromise. Ask her to come with you to pick out a new ring, but keep the ring you do have as a necklace instead (that way you can potentially hide it under your shirt). \n\nI think it's awesome that you even want to wear a ring in the first place. ",
            "\"I love you and I love what our rings symbolise. We've grown together over the years and I'm glad that our bond has only become stronger and more beautiful with time. But part of that growth includes tastes and my style has changed. I worry that as a part of this, my wedding band doesn't fit the corporate image I'd like to get across as well as my own aesthetic. Please don't think I would ever give up something that has demonstrated our love for the past decade; I would love to get the ring incorporated into some nice cufflinks or something, so that it remains with us, but I would also like to switch my band for something that I feel better fits the man I am now. You will always be my wife and the woman I love, and I want you to know that a new ring won't change the beautiful memories I have of our marriage, but will be a part of the ones we make going forward.\"",
            "When I went ring shopping, I learnt there's a whole industry for weddingring upgrades and add-ons. It's not so uncommon to change wedding rings. When getting our rings my husband and I discussed what we would do if one of us lost their ring (it happens).\n\nA wedding ring is an important symbolic item, but that means it should add to your life. (My husband and I didn't want to fret about potentially losing a ring, so we agreed on using the remaining ring to make new ones, meaning both get new ones. Now we happily wear our rings without worrying about losing our rings.)\n\nYour wife is invalidating your feelings about your ring. She has feelings about the ring being good enough then, so it's good enough now and a new ring won't be the same as that specific ring you used for your wedding vows. Her feelings are valid too, but they do conflict with yours. Can you have a conversation without the goal being making decisions? A talk where both can say how you feel without being agreed with (you can validate someone's feelings without agreeing with their suggestion) and without one of you being righter than the other. It's easier to listen when you don't feel like you have to \"win\" to be heard.\n\nGetting new or another ring to celebrate an anniversary is a thing too. Combine it with vow renewals and you create new symbolism with the new rings. It does cost some, but it doesn't have to cost an arm and a leg. Your marriage is not worth more the more expensive a new set of rings is. It's worth more when you can work out this issue. Your feelings of discomfort matter too and communication is important within a marriage.",
            "Maybe see if you can have the ring modified? So it's the same ring it's just more you now. :) ",
            "Be honest. Say what you said here! Explain that you’ve grown a lot during your marriage to her and you no longer see that lame design as an accurate reflection of our devotion to her. You want to pick out something timeless and classic like she did, because you feel like your love for her is timeless too. Wearing something trendy that went out of style is not how you want to display your marriage to the world; you want it to look more beautiful and enduring than that! Tell that as it stands, your embarrassed of your juvenile taste a decade ago, but you want to be proud to wear your wedding ring. Say you are proud to be with her and you want a ring that reflects that! ",
            "If my husband came to me and said “hey hun, I think I want a new ring. I got this when I was 18 and it’s just not my style anymore. That cool?” I’d say sure. Guys rings are so cheap it’s not a big deal. I don’t care what ring you’re wearing as long as you’re wearing one. ",
            "OP is there any chance that your ring is titanium?\n\nIf so, a perfect excuse to change it is that, if you ever break your hand or finger, a hospital wont be able to cut through the titanium, and thus would have to cut your finger off. This was a thing we had to take into consideration with my husband and his job. \n\nSure, it’s extreme, but you could add it to the list of reasons to upgrade. ",
            "As a former jeweler I've seen this a lot here is my advice.  Remarry her, re-propose redo the wedding, new ring and all for both.  You're better off financially now then you were 10 years ago.  Doesn't have to be a big ceremony but make it sentimental. Frame your old rings with your wedding photo from 10 years ago in a shadow box and keep it somewhere in your house.  So that way you don't get rid of it but still have it around. ",
            "My husband lost his first ring in the ocean on our honeymoon. The relationship, not the ring, is what matters. Just tell her how you feel and I’m sure she won’t mind.",
            "I can’t help you until you post a picture",
            "Have her help you pick out the new one. Might be fun! Make sure she gets lots of extra kisses for being such a champ!! ",
            "I am married. If my husband told me he wanted to change his ring, I wouldn’t care. If he said he has decided he doesn’t want to wear a ring anymore it would be a thing. \n\nThis feels like a non event problem. ",
            "You could get a professional one and use it daily, but wear the old one on a chain around your neck. Or use someone else's suggestion of doing that for a 10yr anniversary and get a new set of rings for the both of you. It shouldn't be to hard to discuss this so long as you give it pride of place in a nice box or case. ",
            "Maybe ask if you could have part of the current ring added to a new one? I don't know what the one you have looks like (enough to suggest a more specific part) but if you like one or any of its components you might have it attached to a different ring, or even have a jeweler/Smith redesign your ring completely using the original materials.",
            "Have you asked her for an anniversary present if she would pick you out a new one and tell her what style you want. I know she’s sentimental and has said that but have you asked her to pick it out and asked for it as a gift and tell her the new one would be special to you because she’d be the one picking it out. Or possibly even a little renewing of your vows ceremony too would also sweeten the deal.",
            "A new ring has no value to her. You need to make sure the old ring doesn't lose its value, and add value to the new one somehow. ",
            "My parents got new rings for their 10th anniversary as a gift to each other. Maybe you can frame it as a romantic gesture like that. Or go renew your vows? ",
            "I would tell her that that ring was chosen 10years ago. Since then you made so many memories together and you as a person has grown so much that you are not that person anymore who would choose again that ring. You’ve become a better person that the person 10 years ago (I’m sure also thanks to her) and you want to see this progress on your finger to remind you how far you’ve come.",
            "My husband did something similar but he choose a fancier band and after awhile wanted just a plain gold band. \n\nHe kept both and wore the plain one to work and the fancier one when we went out. The rings are a symbol of your love and commitment, but hold no power. If you were to lose one and replace it, your marriage would still be as special and strong.",
            "Changing wedding jewelry is actually super common. Most often it’s women who do it, but men do too. So just know that this is not a crazy idea. \n\n\nSecondly, just because you get a different ring doesn’t mean you are tossing out the old one. You still have it. \n\n\nFor example, I have two wedding rings. One is my proper diamond engagement ring and band. The band though is too small to wear alone and I don’t like wearing a crazy bling ring everyday. So for daily wear I have a cheap, plain titanium band. Doesn’t make my “real” set any less meaningful or special, doesn’t mean I love my husband any less or value our marriage any less. It just means for me and my personal style, most days I dress down and occasionally like to pull out the stops. \n\n\nI tell you all this so you have some ideas how to frame it to your wife. Just as the two of you grow and change together, it’s ok for your ring to grow and change. ",
            "Post a picture of your ring to r/ATBGE and link your wife to the thread. ",
            "Instead of replacing the ring how about having it dipped in gold or white gold or whatever you like? That's more of an enhancement to the ring while keeping the original. ",
            "Well since you both have been married for 10 years, why don't you renew your vows and get a new set. Yall can get a keepsake box filled with pictures of you both from the past ten years, maybe movie tickets from a date you went on, and put your old rings in there on a chain. Then you can both go back to a jeweler and pick out another set of rings and recreate you guys getting married 10 years ago. \nI've known quite a few couples who have a couple sets of wedding rings that they've gotten throughout the years so retiring the old set for a new set isn't that weird. Then, say 10, 15 years down the line, yall can renew vows again and get another set of rings. ",
            "I actually have three bands, and my wife has at least 5. Now, aside from our original bands we exchanged vows with, all the others are silicone rings by Enso in a variety of colors. \n\nI absolutely agree that the bands you picked out together are very special, but no reason you can't get another to wear daily. ",
            "Can you have a metal smith reuse the material of the ring to make a new design?  Every couple decades of marriage, my grandmother would have her wedding ring modified.  I understand the sentimentality of keeping your original ring, but changing it shows that times change and you have matured and changed.  BTW, this is why I always recommend a simple band... We got ours made out of titanium by a dude in his garage.  It is the thinnest, lightest band I've seen and only cost us $70...we actually made a profit on our marriage.",
            "Maybe wear the ring around your neck and buy a more professional one that suits you, buy a long chain for your neck tho",
            "Suggesting a vow renewal and giving her a new ring too is a great way to address the problem without addressing it. If she asks why, say you wanna be like Beyoncé and Jay Z who had a glamorous vow renewal last year ",
            "I'd ask her what specifically about it matters to her. Would she be okay with you wearing it on a chain around her neck and getting a more traditional band for your finger? Or keeping the same materials but melting them down and recasting them as something a little classier? Or having it in a display box in your home in a place of honor? Basically, communicate and find the common ground you'd both be happy with. Best of luck :)\n\n",
            "Maybe you can wear your ring around your neck on a chain instead ",
            "I say you both get new rings as a ten year anniversary. You don't have to splurge like crazy on it or something, just wear it on your off hand. Then put your current ring on a chain and wear it closer to your beart",
            "Get her an anniversary ring or a pair of diamond earrings and get your new ring. She would probably feel differently about the sentimentality of her ring if she didn't like it. ",
            "It sounds like she’s hurt that you want to toss aside that important memory of hers. Maybe suggest that you pick out 10 year anniversary rings together and make that a tradition of yours and you can collect them into a nice display or something for the grand kids to look at when you’re 80. Or allow her the option of choosing your replacement and maybe revamping hers with side jewels or an engraving.\n\nMy point is, make it an activity and memory that you two do together and put a more positive spin on it.",
            "Why don't you suggest you both get upgrades. You a new band in a more tradition style, and hers an \"anniversary\" band with some sparkles.",
            "I think this is a communication issue. Maybe show her the post? Tell her how embarrassed it makes you feel but it's not a reflection on your relationship. It's not like you want to stop wearing it altogether. \n\nAs a woman, this doesn't seem like an issue at all to me. ",
            "In addition to what everyone else was saying I have a silly (hopefully good) idea:\n\nWhat if you did a silly \"re-marrying\" of her? \n\nNot that you guys ever fell apart or anything ever went wrong. \n\nBut has there been something you two always wanted to do, and you could somehow cheesily communicate to her you want a new ring, but you understand that to get a new ring you have to re-marry her, so you can romantically ask her again to marry you and have a silly little adventure? \n\nThis way she can laugh and enjoy the whole process of it, you two bond a bit, and then finally you get a new ring without resistance. \n\nJust an idea :) ",
            "Buy a quality chain and wear it around your neck, under your clothes. \n\nGet a new ring and ask your wife to help you pick it out. Try to make it sound exciting and sentimental. \n\nGood luck, this might suck. ",
            "It's about what the ring symbolize and not the ring itself in my opinion. I have ten different wedding bands I use and switch between on a daily basis. ",
            "Make it a big deal. Do a 10 year celebration type thing and you do the same thing you did when you originally picked them out. \n\nI would personally explain your point of view (how you've both matured, and how you feel you've matured beyond your first ring), while clearly stating that you understand her point of view, and you want this to be just as special. I'd also look at doing something special with the first rings. I'd assure her that you want them commerated, not just thrown away or shoved somewhere in a box. There's some really beautiful shadow box like things for rings specifically. ",
            "Well, you are the one that has to live with this ring, not your wife, so you have the last say. Talk to her again and tell her you will get a new ring, you love her so very much and don’t want to feel embarrassed when people see that you are married because you are so proud to be her husband but the ring just ruins it for you, and that if she wants to you can both pick out new rings together. ",
            "Renew your vowels. Then you can update your ring with the same meaning",
            "A lot of people renew their vows and/or get new rings for their 10 year anniversary. And I don’t think her feelings would be hurt if you wanted to get a new ring for yourself, it shows just how much you’ve matured. ",
            "You could do it as a celebration of your 10 year anniversary. Get her an eternity ring, and you get a new band as well.",
            "Show her your description in this post. You love her, the ring not so much. She'll understand. ",
            "Renew those vows. Suggest a promise ring exchange at vow renewal 🤷🏻‍♀️",
            "I got a super nice and super expensive engagement ring from my fiance. It really wasn't suitable for my job. It was completely impractical. So he got me a cheap band and had the other one put on a chain so I wore it as a necklace. I did feel horrible explaining the situation but once he came to work with me for a day and saw that I have to stick my whole arm up a cow's bum, he understood. I did however change careers in the mean time. ",
            "I'm talking out of my ass and just brain storming here, but how about suggesting that since you guys have had the ring for so long it's about time you both have a new ring?\n\nMaayyyybe even renew your vows? Something like that? I guess somehow try to include her and not just change your own ring so she feels more open about the idea. Plus, woman loves another reason to get more jewelry. Heheh",
            "Something tells me your wife also thinks your ring is ridiculously gaudy and would love to be included to help you pick a new one. Highlight that you want her to help you and you want something that matches hers because she’s your go-to classy girl.\n\nI say you display your old ring prominently in your house (maybe in a modified picture frame?) as a testament to how you and your marriage has grown.",
            "Can we please see the ring? I’m pretty curious about the fire opal and what it looks like. If your uncomfortable sharing that’s also fine. \n\nJust explain to her exactly what you said here and I think she sill understand.",
            "Wear your original on a long chain under your shirt and have a plain band on your finger \nThat way you are still wearing it and u feel more professional maybe you could renew the vows and include it in that buy her an eternity band?\n\nEveryone's happy except your wallet",
            "What if you planned a vow renewal? That way the replacement ring would have significance and reflect a new chapter together?",
            "OP, if you only knew how adorable you sound, then and now. Your wife loved the teen boy you were and the ring you picked out reminds her of the version of you she fell in love with. Neither teen you nor the ring are probably as cringy as you think. But i totally empathize with your desire to wear a ring that reflects your more mature taste and the image you want to project. \n\nI'll bet this is a is a common problem, someone in the couple wants a new ring, and the partner is pushing back. I would talk to some experienced jewelers maybe online and see if they have some suggestions about how to frame your point of view to your wife. Be sure and tell your wife what you said here, that she was brilliant, classy and always had great taste, and you wish you had also had those qualities back then. I'm sure she would rather you had a ring you could feel comfortable in, than to be taking it off at work, yikes! Be sure to bring this up to her when she is feeling particularly appreciative and happy with you.\n\nPersonally i think a new ring can symbolize your love as well as the original one, but i have an open-minded  creative way of doing things. Maybe tell her that you will keep the original ring and wear it sometimes on date nights? It'll be especially romantic then. ",
            "Accidentally lose the ring.  ",
            "Maybe have a customized ring, where your old wedding ring can still be a part of the new one. You get what i mean?",
            "Your explanation for why you want to change it is very understandable. Just tell her what you told us. \n\nIt’s a sentimental object, you can put the old one in a safe place. ",
            "If you can add on to her ring with a halo or extra band  maybe you could buy that and do a private viw renewal with friends. Like a really nice surprise dinner deal and a few friends. Maybe using a new ring for that could help? Total crap shoot of an idea but it's cheaper than full on vow renewal (still no idea why those are such a huge extravagant thing now)",
            "Renew your vows and get a new ring at the same time maybe? Get your current ring redesigned?",
            "Maybe get a chain long enough to hide the ring under your clothes and put your old ring on that.  \n\nThen for your 10 year you get yourself a new ring and her a necklace, that you pick out together and then you each have 2 pieces of jewelry to represent and she doesn't have to feel bad. ",
            "You could do what my dad did. He went swimming in the ocean on their honeymoon and lost the ring. I think he later lost the replacement in a lake. I think he’s on his 4th ring at this point because he keeps losing rings in large bodies of water.",
            "Ask her if you could give it to her on a necklace or tastefully display it?",
            "I’ve been there.  My ring is beautiful and classic but not comfortable. It’s just like a three dimensional rose of diamond. I don’t know why I thought it wouldn’t bother me. Anyways. I’ve been married 16 years. About 2 years ago I started asking for a new ring.  Just something flat to my finger.  My husband didn’t understand. Was kind of put off by the idea. Never got my replacement.  Even though I continued to ask (when it was a holiday and I was asked what I wanted). This Christmas my dad gave me a bunch of heirloom jewelry that was his moms and her family’s. Including a flat to your finger ring.  It’s actually my great grandmas wedding ring.  I had it make smaller. I wear it when I’m not with him.  I hope that you also guiltlessly happen into a new ring. ",
            "You could get it melted down and then use the same metal/s in a new ring, and perhaps the fire opals put on the inner part of the ring. It'll be the same ring you both chose together, just in a different form.",
            "Buy yourself a new ring and gift your old one to her as a necklace. This may have to be one thing that her feelings get hurt over if she doesnt see your point if view. Have you told her your so embarrassed taht sometimes you take it off? That may help her understand.",
            "Can you offer to wear the old one as a necklace where it can stay “close to your heart” (but really just as an excuse to wear it under your clothes and out of sight)?  Combine that with a new, classier ring for your finger and maybe eventually she will warm up to the idea of retiring the old ring altogether...",
            "I personally wouldn’t mind if my husband wants to upgrade his ring. We see our rings as tokens that evolve over time with our relationship.\n\nAlso, your wife may be open to an upgrade as well. ",
            "Can’t you just upgrade your rings for your anniversary? I’m sure she would be down for that. ",
            "I have a creative idea. Do you have any of the cringy clothes from back then?  Could you find similar pieces in a thrift shop?  Start dressing like that again.  Joke that you are matching your ring.  Styles have to go together.  It could lead into a conversation about the way you love the way her style has evolved over the years.  It’s fair to say you are allowed to evolve too. ",
            "My husband has two wedding rings. One fancy one that we got together and a tungston carbide one. He's worn the fancy one twice because he's worried it will get damaged, since he works with his hands alot.\n\nMaybe offer to get a matching new set for both of you.",
            "Is there a way you could incorporate part of your current ring into a new ring? Perhaps removing part of the ring and placing it onto a new one or melting down the previous ring and using it to make a new one. Many jewelers will do stuff like this.",
            "I think the only solution to your problems here are to amputate ring finger.  ",
            "I don't think it would be that big of a deal to be honest. You picked out the ring, so it's not like you're telling your wife she had bad taste or anything. Nor are you saying you don't want to wear a ring anymore or anything like that. Just that you got a ring you liked at the time and you no longer feel it fits your personality.\n\nOn a side note. I've been looking at hammered silver rings myself, and those look very classy and aren't too expensive, if you're looking for leads on the new ring.",
            "My wife and I renewed our vows, so took that as my opportunity. ",
            "I'm sorry but why is type of thing even an issue? Talk to your wife and explain you what you want. It's your ring after all. You're the one wearing it. \n\nIf your love is as strong as you think, she'll say, \"Ok, let's go look. How much should we spend?\" And while you're looking make sure the notice what kinds of pieces are catching her eye - make a mental note and buy her a beautiful new item on your way home from work next week or next anniversary.  \n\nIt's ok for her to be disappointed that the original ring won't be worn forever. She'll get over it and hopefully be happy that you're happy.",
            "Just tell her that you have grown, and that your more mature, and how you really feel, that you still love her with everything in you, but this ring doesn’t symbolize your love anymore, you want something more mature and more, you! Just be honest with her! Make sure she knows you still love her, just dislike your ring. Good luck! ",
            "Why dont you turn rhat ugly ring to a necklace and use it under the clothes and find a new one for ur finger , then u will still have the ring and tecnically using it , and u can still be professional and serious at ur job ",
            "Ask her to marry you again. With a new wedding totally different, even the rings. ",
            "Why not just take it off at work?  I don’t even wear mine. \n\nOr go on vacation to a tropical volcanic isle and accidental drop it in the volcano.",
            "It may be possible to get your ring coated/ plated with a precious metal so that it now looks more \"normal.\" Then it's still the same ring, but looks the way you would like it to now. \n\nAlso, what about doing a vow renewal and getting vow renewal jewelry and putting (NOT sneaking) something about supporting and loving each other through growth and change and only letting it keep your marriage growing stronger in the renewal and having your new ring, if u get a whole new ring, be symbolic of THAT idea. It's sentimental enough that your wife might be ok with that, because it's a positive symbol of growth together within your marriage rather than a perceived rejection of the moment she cherishes. ",
            "My husband got a ring that he cannot use for work now (chemistry), so for our anniversary he got us both new titanium rings. I chose to wear both (we moved to another country where you wear ring on the other hand, so I have one on each hand now) and he wears only his new one. I thought it was very thoughtful of him and I was happy he thought of something that works for both of us. I'm sure tell your wife it's just uncomfortable and clunky now, she'll understand. I probably wouldn't mention that you hate it.",
            "I don't understand how you can't have this wholesome and open communication with your wife? Tell her exactly what you said here, don't broach anything. Just give her the truth. ",
            "My opinion probably won't matter cause i don't believe in material things.  But i would say talk to her. If you want to replace your symbol of marriage it's not like you're getting rid of it forever just changing the looks. My dad was at work and his wedding ring broke and hasn't had one for 10+ years. They went to the renaissance festival and he found a cool looking ring so they bought it and he now has a wedding band.  My mom changes all of her rings every few years.  She has her original wedding ring in her jewlery box. If my boyfriend and i were ever to get married (but we dont care too) he works with his hands and cant physically wear one and my hands swell to much and theyre just uncomfortable i cant wear one either.  \nI don't know you or your wife, or much about marriage but is it about taking to eachother? Who knows maybe she's ready for an upgrade too? ",
            "Get a silicone wedding band. Pretty common these days. ",
            "Just tell her the truth but give her an option to get a new ring as well. Women love new rings. ",
            "Rings are very personal, and your style changes over time.  It's why I have never understood the thing where the \"perfect\" proposal includes a surprise ring that's supposed to be permanent.  Even with a lot of hints, ultimately, it's really easy to get a ring purchase wrong.  I'm a big fan of proposing with a placeholder, and shopping for the ring together - aside from taking the stress off the guy, it means you can establish a budget, find a shop, and work with a professional to figure out what will work within personal style and budget.  (Yes, I chose my ring with my husband.  I'll detail the story if you want it.)\n\nSo what you need to stress to your wife is that you still love her just as much - if not more - than the day you chose the rings.  But 19 year old you is different than 29 year old you.  So what you want is a ring you never want to take off to prove that to her - and right now, the ring your 19 year old self chose doesn't match that depth of emotion.  You are proud as hell that she's your wife, but you're not proud of the symbol that represents that.  You want something as timeless as your love for her.\n\nThen suggest she comes out with you as you shop again so you can share that experience, and ask if she would like a 10 year anniversary piece for herself - I'd suggest a fire-opal pendant to match the fire-opal in your original ring. (A real opal, not the lab variety, obvs. ;) )",
            "Not sure if this is mentioned, but I’m sure a good jeweler could incorporate parts of your existing ring into a new one. Maybe use the same metal in making of new one, etc. I also wear a silicone one now due to my job as some have mentioned and keep my good one in its box. Good luck Brother.",
            "If this hasn’t been suggested yet-boiling down the ring and crafting a new ring from the metal of the first ring. Yes this is extra but it also is the same metal you’ve been wearing for the last 10 years in a nicer package, which sounds like her argument here. ",
            "You can just tell her what you put here. If you’ve matured enough to become embarrassed by the ring, chances are she has too. ",
            " I was an idiot teenager when I got married, picked out an Ed Hardy level  wedding ring, need to replace it without hurting my wife's feelings. \n\n&#x200B;\n\nThat's how you tell her.",
            "Foe your 10 year anniversary renew your vows and get her a new ring to go with your new ring. ",
            "Get her one first and then get yourself one then) ",
            "Why don't you propose melting it down to make a new ring with that one",
            "Why not keep the ring and get a silicone ring. You can get 3 for $75 on amazon or something. No need to get rid of it",
            "I work in a gym and can’t wear my rings for safety reasons. So I just got a simple black silicon ring. It’s what I wear most of the time now because I worry about losing my wedding set or damaging it. I’ll wear the real ones for special occasions. So I still have the sentimental stuff but my everyday ring suits my current life better. So that might be a good compromise for your situation, keep the original ring but get something simple and cheaper for everyday wear",
            "Renew your vows and get a new ring for the ceremony.  If she doesn't want a new ring most people get another band added to their set. This way everyone gets an upgrade reflecting their new selves.",
            "My wife won't stop asking if she can get a new ring (one without a stone on top that will slash everything and anything).  I might not be able to relate, since we both have several that we wear (the ones from our wedding and then silicone ones for working out or travel or whenever we don't feel like wearing bulkier rings).\n\nWith that said, can you pose it to her in a way such that you want something more \"professional\" and minimalist for work or outings?  By no means does that mean you'll get rid of the one you two picked out and you won't spend a lot of money on its replacement. By doing so, you are helping to prolong the life of your more 'special' ring. Maybe get some nice ring holder off etsy? ",
            "'I would rather get a new ring that we can choose together, that will remind me of our eternal promise to each other, then take my ring off because I feel embarrassed about it.'",
            "Could you melt the metal down and have it redesigned into a new plain ring? At least then a part of the old ring lives on in the new one so it's a nice compromise",
            "jesus. if you can’t talk to your spouse about something like this then for f’s sake just do it. \nEDIT: my hubby lost his. what can i do. be mad? no. we just got a new one. not gold as the original. too broke for that. titanium. not a big deal if you get over the emotional stuff. ",
            "If someone hasn’t said it yet then you could wear it as a necklace and just tuck it away. Then get a professional-looking one.",
            "Ask her to pick you out a timeless one? ",
            "You could just melt it all down and reshape it into a plain band or go into a jewellers and ask how they could melt it to look more sophisticated. That way it’s the same ring technically but you can re-personalise it :)",
            "Ten years ago, my (now-ex) husband was deployed to Iraq. He wanted to have a tungsten wedding ring to replace his diamond and gold wedding ring. I picked it one for him, he wore it and actually ended up wearing it even after he was back in the US because it was more durable and comfortable. He kept the diamond/gold one and would break it out for special occasions.  That solution worked for us. \n\nNow, had I known he was taking it off regularly while he was looking to hook up with tag chasers...(hence the reason he's an ex)",
            "Just show her this post.  I wouldn’t want my husband to have negative feelings everytime he looked down at his wedding ring. ",
            "I’m sure she will take it fine. We got married in the spur of the moment after winning some money in Vegas. My wedding ring was a 10 dollar ugly ass ring from Ross.  I got a new one a few weeks later. But lost it lol. ",
            "Nah man, own that shit. ",
            "My husband has 3 wedding bands.\n\n1. The original band was made of black titanium. We picked it because it was lightweight, black, and one of our favorite local bands when we were teenagers was called Titanium White. We have been together since we were in high school. \n\nThis did not work out. My husband works construction, so all of the black wore off over the years. Also, titanium is super strong, so if he injures his hand, the finger would have to be amputated because there is literally no way to get the ring off. It also can’t be resized, because it can’t be cut. A 24 year old’s hands get quite a bit larger over 15 years of construction work. We still have the original ring in our jewelry box.\n\n2. After about 2 years, because the black was wearing off, we got my husband a duplicate ring. Then he had a “work ring” and a “nice ring.” We had to get a bigger size, and so he can still wear this one outside of work. \n\n3. We buy black silicone rings with a green line in the middle. These are his work rings. He’s had a couple of close calls getting his real ring caught on things, so the silicone ring is a safety thing. He’s ripped 3 of them off his hand already. They are cheap and prevent serious career ending injuries. \n\n\nSOLUTION: Tell your wife you need a “work ring” and continue to wear your old ring as your “home ring.” \n\nLots of people do this.\n\nI’m a nurse, and most women wear only a band at work because stones will tear gloves or scratch patients. Some of them don’t want it to get lost while washing their hands. I knew one nurse whose diamond went down the sink drain on the 6th floor of the hospital, which went straight down to the sewer. My diamond was set by a jeweller whose mom was a nurse, so he rounded the prongs smooth so they wouldn’t tear gloves :). Lots of construction guys won’t wear rings because of the risk, and I know more than one who is missing his ring finger (look up ring degloving).\n\nAs long as you keep the original ring, I think it’s entirely reasonable to have 2 rings for 2 settings. You wear different clothes at work and home, so this is the same thing.",
            "You’re the one who has to wear it every day of your life... you should like your ring. If the budget were the issue then I’d understand her resistance, but as long as your ring is a reasonable price and won’t strain you financially than I don’t see why it should be her decision at all. You can keep the old ring for sentimental purposes, but no need to wear it every day. Put it in a necklace and let her wear it if she’d like (and it sounds like she wouldn’t), while you get a more professional ring and wear that. It’s just a symbol of love anyway—as long as you both love each other then that’s the only sentimentality that matters. ",
            "\"Lose\" the current ring then buy a new one. ",
            "You can wear the old one as a necklace and buy a more classy one.",
            "You're thinking about this too hard man, you picked it out, just get a new one, take her with you if you wish. Honestly I went with a silver ring with a small Superman symbol that I can turn around and hide. There's also tungsten rings that can look nice for something temporary as well.",
            "Why not modify it? It would still be the same ring, just looks different. Tell her it represents a phase in your life that you are not the person you were before, at least in outlook of life but essentially still the same person, just like the ring.",
            "Pretend you lost it, easy",
            "You could also purchase one of those inexpensive silicone rings that’s used by people in workplaces where the rings can be caught on dangerous tools or where working with electricity. They look decent, are fairly inexpensive and you’d still have your “real ring”. That’s what my old boss did and I think it worked well for him. ",
            "Maybe you could have it melted and made into a ring you like better, but it’s still the same ring but a style you prefer? (I know nothing about these things so I don’t know if that’s actually a service people offer)",
            "Why not get a more timeless style for your fingers, but wear the old ring on a chain around your neck? That way you can tuck it in out of sight if you're in a professional setting, but you'll always have it with you?",
            "My suggestion would be to ask if she would mind if you could either have it recast to look more professional, but it'd still be the same ring. Or if you could get a new ring and add part of the old to it so that part of the ring is still there.\n\nAlso, rings wear down over the years. My grandparents had 3 sets of rings because of how long they were married (60 years). Their rings changed, but their love was always constant. ",
            "You could possibly get actual parts from your old ring made into your new ring on the inside of the band or as tiny inlays !",
            "Let her pick it and keep your original next to your bed",
            "Melt it down and have it remade \n\nTherefore the ring evolves with you as person and your relationship together\n\nBut still the same rind \n\nOh and buy her a diamond - always helps 😋",
            "If you are religious, tell her you want a new ring and maybe your priest or pastor would give it a blessing or allow you to renew your vows. That’s the angle I would take at least",
            "Have the conversation about the ring with your wife again and suggest the two of you pick out a new ring.   At the same time get a thin chain for your current ring and wear it inside your shirt.  I really think if you explain your reasoning thoughtfully she will agree.   I'm guessing she doesn't know you periodically take the ring off briefly at work.   I think sharing the reason you do this will help sway her.   I have been married a long time and I wouldn't be upset if my husband wanted a different style but it would bother me if he didn't want to wear a ring. \n\nThe description of your ring gave me a smile! ",
            "I would ease her into it by suggestion a vow renewal, then changing the ring will be during a special and meaningful moment :) if I was her, I’d think the same, but if my husband suggested we go somewhere beautiful and renew our vows with a new ring, I’d totally be all in!\n\nAnother alternative is could you get it re-plated in gold or silver? Or, could you get the current opal put into a new ring so it holds sentimental value?",
            "My parents replaced their wedding bands when my dad retired.  He worked as a millwright welder and master carpenter so his original band didn’t even fit on his hands anymore.  Now he has one that fits so he can wear it again.  They’ve been together for 35+ years so it didn’t really affect their relationship if that’s what your wife is worried about. \nMy husband is an electrician and when we got married I bought him a titanium wedding band.  He only wears it when we go out and will use it to open beer bottles.  ",
            "Maybe you should accidentally lose it and be devastated , you could make a thing of it and renew your vows and exchange rings again but this time with a new ring",
            "There is a thriving business for upgrading engagement or wedding rings. \n\nOp should talk to his wife and both go for a classier rings. It is so common now. Sometimes people even wear two or three rings on the same finger.\n\nJust take her to a fancy jewelry shop and let the sale person talk to your wife.\n",
            "My mother lost her original wedding band that matched my father's when she was cleaning snow off her car one day. It flew off her finger. Since then, I can distinctly remember her wearing three different rings. She picked out two (the third was her engagement ring; it was not being worn at the time she lost the wedding band), but dad definitely had an opinion and was involved in the process. (Dad, on the other hand, has never replaced his, so far as I know, because he only wears it for special occasions. He's a mechanic and things on hands or around necks is not the best life choices). \n\nMy point is that replacing the band isn't uncommon and while the initial wedding band has deep sentimental value, there are absolutely reasons to replace. Be honest with your wife, but keep it positive and focus on wanting to reflect the new depth and intimacy if your relationship as it has matured. Offer her the option of including part of the original band in the new one: say a silver band with black inlay? ",
            "Talk to her, tell her \"I love you, I wouldn't change anything but I want to get a new ring because I want to get something that better matches yours to reflect the bond that we share.\" I think simply talking to her and explaining your reasons wont hurt her feelings. After all its not the ring thats important. It's the love you share and the vows you made.   \n\n\nAlternatively reaffirm your vows and both of you get new rings to symbolize the 10 years you've spent together. Get family and friends together, have a nice party and at the hight of that party both of you either say new vows or repeat the vows you said at your wedding all those years ago.   \n\n\nThe first option in my opinion shows that you care enough to talk to her about your feelings and how you want to better represent something thats so important to you. The second option while more money is wayyy more romantic in my opinion ",
            "Just say that you would like to get a ring the reflects the man you have become because of her. This isnt trading in.  Its a small way of showing how much you matured together. Place that ring on a chain. Hang it up. Or wear it. Its still special. Theres nothing wrong showing you have grown. Just respect her feelings and make a healthy compromise amigo!! You got this!! ",
            "Could you have your ring refashioned into something else? The opal part into a necklace for her or maybe a tie pin for you? Then it's still there and meaningful but you get a new ring. \n\nOR put on/lose a load of weight so it doesn't fit and you need a new one.",
            "Maybe get a new ring and do a romantic gesture and have HER propose to you with it.  I think itd be really cute",
            "Have you seen staghead designs? My fiancé loves them! All classic and they have budget ones. \n\nNo advice on how to tell her, but your reasoning seems incredibly logical, so she will understand even if you just get her to read your post. The main idea is that you still love her and your relationship, just not the ring. It’s time to get a new ring so you can happily show it off and then brag about her of course. ",
            "Maybe tell her that you'd like to get another that looks more professional and classy but that you are going to keep the current one you have too? She may be more inclined if she knkws you aren't geyting rid of the one you got when you were younger.",
            "Buy her a new one too.  Make it a 10 year anniversary thing. \n Wedding rings don't have to be a one shot deal.  Think of it like having more than one pair of shoes or a jacket.\n",
            "I'm sorry, but this is a hilarious problemto have. \n\nProps dude, all the luck with your conundrum.",
            "Go pick a new one together, go for a nice dinner etc",
            "Get a chain and put the ring on that around your neck. That way, you will always be wearing your ring and it can be under your shirt collar.",
            "What if you guys renewed your vows, and both got new rings together? She can wear both, and you can get one that suits you now. It might feel special to her if you choose them together again ",
            "Could you see about wearing it on a chain or something so it's hidden and you're still technically wearing it every day, and get a new ring to wear for work?\n\nObviously you should discuss this with your wife too.",
            "If she is acting petulant than just accidentally lose....she is in the wrong here.",
            "I work in a factory. I’ve got my original plain gold wedding ring sitting the the beside table and wear it for special occasions. But for daily wear I have a couple of $30 silicone rings. My wife understands that it is a requirement of my career and doesn’t mind at all. ",
            "Advice is covered here, I would like to say just how sweet it is how you talk about your wife after all those years. Very refreshing and hope inducing :)",
            "Get a nice necklace chain and wear your ring as a necklace, make sure the chain is long enough so you can hide it under clothes (not sure if this works with a big bulky ring though). Then get a new pair of rings for your 10th anniversary.",
            "I suggest you tell her that you are embarrassed by it and give her your honest feelings and add that you feel sometimes like you want to take it off in a professional environment but you really want a ring that you do not ever want to take off because you want to show the world you are married. \nMaybe suggest a vowel renewal and get her another wedding band and then suggest you also get a new one to signify the beginning of a new decade of marriage. ",
            "You can point out that a new, more classic ring will look more like hers.",
            "I don’t think it’ll hurt her feelings. She’s probably always hated it but put up with it because she loves you ",
            "You tell her exaclty what you've written right here\n\nyou can keep the old ring as a memento of sorts, if she's worried about the \"memories\" accociated with that ring\n\nyou should never wear something you're not comfortable with. this goes for clothing, and accessories",
            "Instead of a full on vow renewal you could have the new ring blessed.  If you are religious of course.  My original ring required so much work that it needed to  be remade.  The blessign of the rings was really touching and helped with the sentimental attachment.\n\nIf you aren't religious, recreate the proposal with her giving you the new ring?\n\nDepending on the material of the original ring it could be melted down to be used in a new ring.  You need a true custom jeweler.  That's what I did.  They had to add some new gold but the original gold was all used.",
            "I would say keep the ring you have now for sentimental value (not wear it but don't get rid of it). If I were your wife I wouldn't mind you buying a new ring for the reasons you've said. Like you said, you've matured a lot in the last 10 years and want your wedding ring to reflect that. Who knows maybe you two could both get new rings as a ten year mark of your love and growing maturity ",
            "Offer to renew your vows with it lol",
            "show her this post. it's clear from just this that you care plus I dont think it should be a big deal and hopefully she'll understand",
            "Just tell her you want a new one, no probs. She probably wants the same. Now post some pica of it",
            "After 10 years being married, i think it's entirely appropriate to renew your vows, and that would be a great opportunity to present it as wanting to show your continued commitment.\n\nYou could even get something that compliments and matches your wife's, if she is determined to keep the existing one.  \n\nYou might want to share how you feel the style was previously a way if expressing yourself, but you want your new ring to express the love in your relationship.\n\n",
            "As it’s been ten years you could suggest redoing your vows as a form of showing your growing and maturing love for her. At the same time you could suggest about looking at a new ring for you to fit the more mature version of yourself ",
            "Maybe I'm not as sentimental, but when my husband came to me saying his wedding band was bothering him, I asked him what he wanted to do. He had in mind another band he wanted and I said he should go for it. \nWe wear our rings all day, every day. I think you should be comfortable wearing it. \nChanging the ring does not change the marriage.  As the decades wear on, people grow. I'm sure there is a way to incorporate your old ring. Whether on display somewhere in the house or made into different jewelry. I hope your wife comes to realize that you just want to be comfortable wearing your band. ",
            "Women get new “upgrades” for anniversaries all the time. Just talk to her. It isn’t like she will be crushed because she picked it out and you’ve been living with hating it for 10 years. You picked it, liked it at the time and have changed. Men’s rings are also not that expansive. I say go for it. ",
            "Are there elements of your current ring that can be reused in a new one? Maybe you could redesign the current one you have and get some of the things you don’t like removed and get it resized so it’s not as chunky?\n\nYou could suggest that to your wife and tell her her much it would mean to you if she helped you redesign yours, and especially <i> how much it will mean to you to love the new design for the next sixty years of marriage you will have together.</I>\n\nAnother option would be to buy each of you 10 year anniversary rings. A lot of couples do that, after all ten years is a great achievement. Keep the old ring, and pick something new that you love. This is what I explained to my boyfriend when we talked about rings: I want to see and help design my ring because I’m going to wear it for the rest of my life. I want to look at it and feel so full of love because of what it means; but that won’t happen if I can’t enjoy or be proud of it. As far as I’m concerned it’s like a tattoo, it’s on your body for the rest of your life so think about it carefully. It doesn’t have to be ostentatious or expensive, just special between two people. ",
            "She sounds super controlling. Many people choose not to even wear their rings, they shouldn't need to consult their partners to choose this. Tell her you need to do this and you'd like her to join you at the store (or online browsing?) if she'd enjoy that.",
            "I don’t think this situation you’re in is as dramatic and hard than you’re making it out to be. Just tell her you want to change it and give the reasons. If she’s reasonable and doesn’t get hurt too easily (which is an issue on its own), then it should be no big deal. ",
            "Maybe turn your old ring into something your wife could wear, like a necklace? I guess if it’s material that can be melted down or shaped? This way she will always have that as a reminder. ",
            "When I met my husband he had several affliction t-shirts 🤣🤣🤣only for bed but still. So glad they’re gone now. I think maybe like someone else suggested asking your wife if she would be okay with a silicone ring",
            "As a married woman this would not bother me at all, people's tastes change over time and a piece of jewelry that holds so much meaning should reflect that. I would keep the old ring as a keep sake.",
            "I worked for a jeweler for quite sometime. He cast gold & silver at his studio-using the lost wax casting process. He could melt down the metal from original rings and re-cast a new ring using some of the metal (mixed with some new casting grain).  That way you would be wearing the metal from the 1st ring of ten years and have a new modern/mature style. Find a good jeweler. If you don’t like the ring and it makes you cringe I don’t see how having it in a shadow box or wearing it around your neck will make things better.  Also honesty is key. Working in the jewelry industry I learned that both men & women aren’t always in love with their first wedding or engagement rings. Their tastes change over the years.  Good luck! ",
            "Tell her you wanna keep the ring ..but you want a different design. Even if its not true..better yet, you tell her the old ring was melted down to make the new one. \n\nYou win. \n\nNow, you have to have confidence to pull this off. You don't ask her....you do it....then tell her. \n\nMy advice, find a small charm about the same color. Give it to her and then explain that it came from your ring after the melt-down redesign. Ideally you want to tell her at the same moment that you are placing the new jewelry on her. You tell her you had it remade using the same metals because it's important to you since you both picked it out together so long ago. \n\nBasically hit her in the romance and use a gift of jewelry as your smoke screen. Perception is reality. You can do this.",
            "This is not that hard of a problem to solve. Just be honest. My husband has two rings. I don’t care which one he wears as long as he is happy. Please be honest with her and yourself before  you take your ring off for a meeting and loose it then you will really miss that ring. ",
            "If you were my husband, all I would need to hear is that you want a ring that more closely matches mine!",
            "Can we see a picture?\n\n",
            "Maybe you can have a small piece of it cut out and incorporate it in a different ring as part of the design....?",
            "Why don’t you pitch it as a renewal to your commitment? It’d be like renewing your vows, but it’s your ring. The only catch is she might have to get a new ring too haha",
            "I think just be honest with her and say you would like something more mature OR if you are ten years in what a lovely time to renew your vows and also get a new ring!!!",
            "[deleted]",
            "Tell her you would like a ring that matches her more since you said she has a more classic one an tell her you want her to come with you and choose a nice one. ",
            "When my dad lost his wedding ring after my parents had been married for a few years they renewed their vows when he got the new one so that way it wasn’t just a new ring that they bought and it was a ring that also was connected to a ceremony so that way it could also be special to them. It might be nice for you to suggest renewing your vows (a lot of people do this after 10 years of marriage actually) so that this new ring can be special to you to. I know this option is not really one you want to do, but I think when my parents did it they just did it with the two of them so it wasn’t a really expensive ordeal. \n\nMaybe you could also go about fashioning the old ring into something you would use frequently on so that way it’s still something you can use, just not constantly on your finger. I’m not an expert in men’s fashion so I don’t know many things you could turn it into but maybe you could get someone to make it into cufflinks? ",
            "I'm probably late here, but reading your post, obviously you've talked to her beforehand, but maybe explain how important it is to show that you are married to her, but at the same time look professional. Let her know that you want to keep the old ring, and wouldn't mind wearing it once in a while for, but you would like to be able to look more professional and people know that you're married.",
            "Shouldn't be a big deal. Have her read your post or just tell her your reasoning. I wouldn't care if my husband wanted a new ring. ",
            "This is interesting to me.  My wife and I both have multiple bands for different purposes cheaper metal rings for casual wear, the real deal more expensive rings for date nights and stuff, and silicone rings for work (we each have like 12 different colors of silicone rings because they come in like packs of twelve).   \n\n",
            "Why don't you ask to do a vow renewal. Re-marry her and show a new commitment to your marriage together. And as part of that you can both get new or refreshed rings to signify the next 10 years. Then turn it into a tradition. Every 10 years renew vows and get new rings. \n\nUltimately rings are just things that symbolize your commitment. It shouldn't matter which ring it is. My wife and I swap our wedding band out all the time! She's a surgeon and I do word working, so we are often putting on the latex bands and forgetting for weeks at a time to switch back. ",
            "What about getting a new one (after talking with her) and keeping the old one as a necklace or hang it on a wall in your bedroom. Also maybe if she helped pick out the new one it would still be something you did together.",
            "Tell her you want one that matches hers so they look great together! My husband has gotten 4 different rings in 4 years.. some days he likes to wear the black one some days he likes to match my gold ring and sometimes when he’s working he puts a silicone one on. ",
            "Start with  “you were right and I was wrong”. ",
            "Tell her you’d like to replace it with something more fitting for your maturity level, you’ve obviously grown up a lot over the last 10 years. Pair it with a new ring for her, if she wants to keep her original wedding band suggest an eternity ring? I’m sure if you sit and explain it all to her she’ll understand that wearing the ring makes you feel like a silly little boy rather than the man you feel she deserves. Good luck and keep us all updated.\nEdit; I agree with some other answers, wear the old one on a chain or frame it :)",
            "Someone else may have already suggested this. I must specify: you cannot do this without talking to her first. \n\nBut have you thought about getting a jeweler to melt down your ring and recast it to something you'd like?\n\nThat way, it's still the ring you got 10 years ago together, just looks different. ",
            "Ask her to help pick out a ring that signifies how much you have grown as a person and that you have turned into the classy person she always was. Perhaps keep the old ring somewhere to keep the sentimentality of it for her benefit. ",
            "I don't understand why your wife is upset. You're the one that picked the ring to begin with. It's a piece of jewelry that you wear every single day-- it should be something you like. \n\n&#x200B;",
            "Can you get the original wedding ring dipped in platinum or titanium so it's the same ring you used during the wedding, but looks like a standard wedding band?",
            "This is so beautifully worded and adorable. I love how kindly you are speaking of your wife. What if you present her with a couple ideas? So she knows you're still wanting a ring, just a more professional one. :) Good luck OP! ",
            "What if you keep it, but get it plated or something if possible? That way it's the same physical ring, but in a form you like. ",
            "Ask her if you can have it melted down into something a little more timeless and fashionable for yourself. I have seen men do this with treasures jewelry from their family, like a ring from their mother or something, they will take it to get melted down and reprocessed into something new. It’s still the same ring tho, the memories and sentimental worth attached to it won’t change. \n\nI can’t see why she’d have an issue with it if it really is just about the symbol of what it means. It would still be the same ring, just melted down and made anew. It could be a beautiful symbol of the maturity and growth you have done as a man (this is an excellent way to spin this) ",
            "Honestly that ring sounds badass and I would rock the shit out of it.\n\nBut, to each their own.",
            "Can you outline the reasons you want to get a new ring (professionalism, personal growth) and ask if there's a way she would feel comfortable with the replacement? Like if you gave the ring to her or put it in a frame with a wedding photo or something. If you feel really uncomfortable about it then I think it would be good if she could work with you on a solution. Maybe she doesn't know how uncomfortable you are? More talking required here. ",
            "Perhaps you could tell her you want a new ring that matches the timeless and classic design she has. It may help if you found a ring that had similar elements (metals, appearance, etc) ready to go, to show her you had been doing serious thought.\n\nOtherwise, I would remind her it's not the ring that's important, it's what the ring symbolizes- That you love her and want to be with her forever. I think acknowledging her feelings will be key here - that you understand the sentimentality of having the same rings you picked when you got married. However, you also don't want to be embarrassed by your ring because you love her and are proud to be married to her. It's just that your sense of style was terrible as a teen, and as you've matured, you want your style to also be more mature. Perhaps you could even suggest the idea of having *her* pick out your ring for you, because she clearly has good taste and it would mean a lot to have something so personal picked for you by your wife. Good luck OP! ",
            "So this is what I did with mine. I started to get eczema bad on my hand, so I had to stop wearing it before hand anyway. Not even a month into marriage the diamond piece fell out. It was a $400 ring, I went to the jeweler whom I bought it from and they said I should have gotten a warranty and they couldn't do anything. Don't go to Kay.\n\nAnyway, I did get it fixed somewhere else for $20 but was weary of wearing it anywhere else. My solution, wear it on date nights but for casual use and to work wear a simple one, you can get really cheap tungsten carbide ones, which was mine, on Amazon for like $25. There are great looking ones on there, and my wife liked the idea. Another idea is putting it on a chain as a necklace and wearing it under your shirt, with a replacement on your finger.",
            "Why don't use the same ring to create a knew one that you like.",
            "You can give her the ring on a necklace if she values it so much. Do the vow renewal and wear that ring instead ",
            "I have like 6 wedding bands. Silicon and tungsten primarily, and 1 gold one.  I switch them up based on what watch I'm wearing. ",
            "Explain it to her the same way you did her (or show her this post). Let her help you pick out your new ring and if the one you have now means so much to her, buy a chain and let her wear it around her neck.  I know the rings you get married it are important and meaningful, but that is not what makes a marriage. My husband lost his wedding band less then 2 years after we got married because is slipped off his finger in the cold. It was his grandfathers ring that he was married with and it was engraved with his name and the date they were married. We were heartbroken but we bought another one I said a few words to him and put it on his finger ( we never told his family what happened). We are coming up in our 21st anniversary.  ",
            "Bro, just be like \"Hey, so this ring I chose when I was an idiot...I don't like it anymore and it's messing with my confidence at work. I'm going to change it so it's less flamboyant.\" My wife would totally understand...",
            "Can you potentially reuse the ring in the creation of a new one? Keep one or two of the stones, maybe grind the metal down, etc? That way it's still the same ring, but it's more your style?",
            "Since you've been married 10 years and matured a ton, why not suggest having a dinner party (maturity level 10) to celebrate your marriage. Ask her to pick you a classy ring, you could choose together, to signify your maturity and deepening of your vows, perhaps get her ring engraved instead of a new ring.  Exchange rings at your dinner party in front of your closest friends and family. ",
            "See if it’s possible to melt your current ring down and use the metal to create a new design. That way you essentially have the same ring you got married with, it’s just been revamped! ",
            "Maybe have a vow renewal and trade out rings then.",
            "Don't see a problem. Be honest with you wife. Love is in the heart, not in the ring. Keep the original one as memory. Also, you both may want to get new par of rings for an anniversary.",
            "If shes as kool as you say I think she will kinda laugh it off ",
            "Dude. Just talk to her. Actually just show her this post. 😂 im dying of laughter on the inside just imagining in 10 years my bf coming to me saying how douchey he used to be and how he picked out the most badass ring back in the day but now he gets why his dad laughed his butt off at him. Like really. Wish I could sit and laugh with your wife when you tell her. I’m sure she will have no issue with you getting a more classy ring and maybe putting this ring in an old box to one day bring out when your 90 and show your grandkids the mistake you made. 😂",
            "Plan b: get a necklace and wear it under your suit? ",
            "Can you buy a new band for you and an additional band for her? Like a 10 year wedding anniversary",
            "Am I the only one? Name checks out.",
            "My husband is on his fourth wedding ring in 11 years. He twirls it around when he's thinking and he's dropped and lost several of them. His replacements have all been less than $50 on Amazon. \n\nThe ring isn't the important part. It's the vows you made and the license you signed. You should 100% get a new ring. Have a convo with the wife about how you've grown and matured. \n\nHell, there are plenty of women that get new rings for big anniversaries. Get one! Get her one! ",
            "You picked it out? Then it's not going to hurt her feelings. Don't expect her to pay for the replacement though, of course",
            "Show her this post . Speaking as a female and a former wife ... I would melt if my husband described our relationship the way you did . I think she would read it and totally understand . ",
            "I don’t have any actual advice. But I want to tell OP that I busted out a giant laugh reading your post. Good luck finding a workable solution!!",
            "Bro, you should ask if she really likes the ring you chose, if so just tell her you'll hold on to it, but you feel you would be better suited for the work place with a plain ring. Honesty is where is counts. Or you can go the other way and \"lose it\"",
            "Ask to renew your vows, both of you melt it down and made into a new one.",
            "Can you melt down the current ring to redesign it into something more classy?",
            "I can't wear my engagement ring (white gold, diamond) at work because my job is too hard on it.  When it came time to pick my wedding band I picked a yellow gold wide band.  I just switch out.  Days I don't work, I wear my engagement ring, because it was the expensive one.  I work with my yellow gold ring. My job has chemicals and was wearing off the rhodium finish of the white gold.  Point being, just tell her you would like a simple band for work to be professional but will wear your original band on days off.  Then just \"forget\" to switch out.  I am surprised after 10 years, she hasn't outgrown your ring....",
            "My husband has his wedding band and also a qalo ring (silicon band) that I got him for work. He wears his qalo about 90% of the time and wears his real ring for special occasions. Maybe you could get matching silicon rings? Or pick them out together? ",
            "Would it be possible to change the ring in a way that it would look presentable, like getting it plated in monochromatic gold or silver?",
            "Super late to the party, didn’t read all the comments. Buy a chain or something for your original band so you can still wear it every day. Point out that a classy ring is the best front facing option. ",
            "As the wife, it wouldn't bother me one bit if my husband wanted to change his ring. It's HIS ring and I'd want him to be proud of it. As long as he's happy and represents himself as married, he can have a whole collection of rings. ",
            "Is it rude that I want to see a picture of your ring, lol ",
            "Is there any way you could like shrink it. Like take your original ring and make it smaller like a normal wedding band size. ",
            "Pics of the ring or GTFO",
            "Pitch it as a memory thing. You guys have been married 10 years, so every decade as you two grow/progress through life get a new ring every 10 years that reflects those changes. Save the old ones in a memory box side by side. Gets you a new ring, starts a tradition, and encapsulates how import rings are to your wife",
            "Maybe you can wear it on a necklace or something and wear one of those silicone ones? That way it’s not like you’re completely replacing it ",
            "First I would say keep your current ring for sentimental reasons. Second I would say there’s no reason for you to not get yourself an upgrade that fits your style more. Maybe if she’s that emotional about it you could renew your vows with the new ring. ",
            "OP, Tell her to read this Reddit post.",
            "Most women just want their men to keep their ring on.  And here you are wanting a nicer ring that reflects who you and are proud to wear it.  Get another ring bro.",
            "Tell her everything you told us here. The ring symbolizes your relationship, but also symbolized who you were at the time you got married. You’ve grown as a person since then, and you feel like the ring doesn’t reflect you anymore, but this doesn’t mean you love her any less or think any less of your marriage. You’ve changed, your relationship has changed with it, and if anything, a new ring would symbolize both your marriage and a reflection of who you are as a person. Maybe even pick out the ring together so it’s something you are both choosing. :)",
            "Tell her that it's special to you too, and that's why you want some elegant and classy to represent your connection. Definitely take her with you for ring shopping and choose together!",
            "Get married again. Seriously. It's a fun reason to get your friends and family together and will give you a totally solid reason to get a new ring. ",
            "If I were you I would suggest a few things: \n1. Ask your wife to come pick out a new ring with you.\n2. Maybe both of you get new rings as a 10 year anniversary present and you put the old rings and a wedding picture into a shadow box to display in your home. \n3. Suggest a cow renewal with new rings. ",
            "Can we see it? So curious",
            "Tell her u will buy a necklace and put the ring in it closer to your heart and get a simple band for everyday work",
            "A simple gold band is relatively inexpensive and I don't see how it would hurt her feelings tbh ",
            "Could you maybe make your new ring with your old ring ie: instead of a black band have a silver but still keep the fire inlay? Or something like that? ",
            "Maybe suggest designing a new ring using the old ring. That way you have everything from the ring in a newer classic design. ",
            "I think you should just keep it. It’s like a testament to how much you’ve changed and matured, so you never forget that. Idk my opinion ",
            "You'll have to get to the bottom of why your wife doesn't want you to replace it :) \n\nGo propose to her all over again with a new pair of matching rings. Tell her you will continue to wear this around your neck (your albatross ha ha ha). Get some dollar store tiara and top hat and take her for a night out as new-newly-weds. \n\n\n\n\n",
            "Plan on getting new rings for your next anniversary together. Even if she balks tell her it’s ‘to renew your love’.  Until then you could put your current ring in her jewelry box and start wearing a silicon ring that’s more your style until your anniv.   But really try to make her understand that your tastes in jewelry have changed since you were a dumb kid but your taste in women hasn’t. ",
            "Personally I'd just buy another one if I hated it so much.",
            "Why not just have two rings? My husband and I each have a couple rings. I got him a few inexpensive spares because he works with his hands and I didn't want the original \"real\" ring to get ruined. He got me an inexpensive spare for when we travel, because I'm so afraid of losing my \"real\" ring. You can still wear the original one sometimes -- say, on special dates, anniversaries, etc., to make your wife happy, and wear the new one to work. I switch back and forth between my rings all the time depending on what I'm doing. I wear the \"nice\" one when we're out or on special occasions, and I wear the other one when we travel, or if I'm doing stuff where I'm afraid of messing up the ring (like when I'm cleaning or something).",
            "Buy her a matching chain to put your old ring on so that she can wear it around her neck!!! ",
            "What about a compromise like taking the stone from your current ring and having it set in a new ring?\n \nI mean, after almost 20 years my husband has his original but is now wearing his 3rd ring due to body changes and comfort issues. Some friends of ours change their rings out every 5 years as a celebration of how long they’ve been together.",
            "Just ask her. It's not a big deal, or it shouldn't be. People change over time, and so do their styles. Changing your ring doesn't mean you're changing your wife, it's just better reflecting who you are at this time - which is someone still committed to his wife, who just wants a ring he likes more.",
            "I think the way u put it was nice and it makes sense! tastes change and some jewelry always looks alright and some does not. ",
            "I wasn't a big fan of my first ring that my husband proposed with - it just didn't match my personality, so about three years later (when we made more money) I asked for a new ring for Mother's Day.  I got to find the perfect ring that I love - and it was cheaper than the original.  I will keep the first ring and I can make it into a necklace or save it for our daughters if they want it.",
            "Maybe you guys can both get new rings to mark ten years together? I'm sure she'd love that ",
            "Dude just buy a cheap ring for work. I bought 3 different wedding rings for like 20 bucks. If you feel guilty tell her you'll only wear it at work. Then maybe you forget and wear it home once or twice and see if she likes it. ",
            "Can you take your ring to a ring maker to repurpose it to be professional? Like remelt it or something ",
            "Just do it. Wish and Amazon have some great options. I bought a titanium one for $20, and wear a silicone one out of a pack during the week. ",
            "Just get a classy one for work and professional settings, and still wear the black one in front of your wife!",
            "Several ways to go about this.\n\nFirst step should be to tell her about your hang up and asking her opinion in replacing it.\n\nThen discuss the how. Are you both getting new rings while you renew your vows? Are you keeping the same band but having made some changes to it? Does it become a framed piece or a necklace?",
            "Have you heard of an NFL ring? Tell your wife that you can literally be \"microchipped\" to her with it. I bet she would like that! ",
            "In all honesty I can't imagine your ring even though you described it. My parents melted their rings down and made new ones if that helps? They both decided to update but didn't want to replace the original due to sentiment. It meant the kep the originals but they were incorporated into new designs?\nMaybe if you suggested this is might be a happy compromise? ",
            "What's wrong with recreational MMA? It's a great hobby!"
        ]
    },
    {
        "post_id": "60b785",
        "author": "hypocriticalfatty",
        "title": "[Update] How do I[33F] make myself attracted to him[54m]?",
        "url": "https://www.reddit.com/r/relationships/comments/60b785/update_how_do_i33f_make_myself_attracted_to_him54m/",
        "score": 2839,
        "num_comments": 63,
        "created_utc": 1489944372.0,
        "selftext": "[Link to original](https://www.reddit.com/r/relationships/comments/5ytggt/how_do_i33f_make_myself_attracted_to_him54m/?ref=share&ref_source=link)\n\nI just wanted to thank the people who replied to my original post and say I appreciated it. I did end up calling it all off. Then I pulled my dating profile because I decided I want to concentrate on getting myself together again. I need to go back to therapy and go back to improving my health again. Leave dating until I can make better choices about it.\n\ntl;dr Called it off and decided I need to concentrate on myself instead. Thanks for the kick in the pants.",
        "permalink": "/r/relationships/comments/60b785/update_how_do_i33f_make_myself_attracted_to_him54m/",
        "comments": [
            "Good for you. You deserve good things!",
            "Thank god. I was genuinely worried about you, OP. That post made me so sad. I'm so happy you've made such progress. Keep it up, girl!!",
            "Good call OP, be proud of yourself ! :)",
            "This is great news! I remember reading your post and seeing a lot of my former self in it. I had a string of terrible dating experiences and finally decided I had had enough. I stopped dating altogether and have been dedicating the past 6/7 months to focusing on myself and my health and I have never felt stronger. You definitely made the best choice. ",
            "Sounds like you're already on your way to a happier place :) Yay. Good luck.",
            "I'm so glad to read this update.\n\nAll the best of luck to you.",
            "Congratulations :) it takes a lot of strength to do these things sometimes. All the best for your new life! ",
            "Yeay you OP! You rock.  ",
            "Such a strong move!! You should be so proud of yourself!!",
            "Absolutely in no way should you settle for any less than being adored.  Being lonely is miles better than being emotionally abused.\n\nNo matter what you look like, loving yourself comes from within yourself and its not at the end of a diet, in the gym or behind a surgeons scalpel.  We all have our flaws and that's OK, it doesn't make you any less worthy. \n\nAll the very best in finding yourself xo",
            "These are the posts I wish I would see more of around here. \n\nGood job on realizing that you can do better!",
            "Happy to see this update!  You deserve so much more.  I am glad you're taking action.  We are rooting for you!",
            "Spending time on yourself can do wonders.  I've spent the past couple years out of relationships just to make sure that I could be happy with myself and it was one of the best decisions I ever made.  Now all relationships are additions to an already rewarding life and I'm not controlled by fears of losing it.",
            "This update makes me happy. Regardless of the type of relationship we choose to pursue, we all deserve respect and kindness. Good luck in your life pursuits. :)",
            "I'm glad you're working on yourself before jumping into a poor relationship, OP. You acted in a wise way that will nurture and honor you in the future.\n\nAlso, I think you should really look into \"attachment theory,\" since it sounds like you have severe issues with attachment. You seem to have some combination of attachment anxiety (you feel you *must* be in a relationship, even with a terrible partner) and attachment avoidance (you're terrified of too much intimacy and run away from partners who would *actually* be loving and caring toward you). These issues often, though not always, go back to traumatic experiences with family and partners in childhood and early adulthood and can keep anyone from a satisfying and loving romantic relationship.\n\nBesides seeking therapy with a counselor who is trained to deal with attachment issues, I also suggest you pick up some books on attachment theory. Here's a good starting reading-list:\n\n1. Attached, by Amir Levine\n2. Wired for Love, by Stan Tatkin\n3, Insecure in Love, by Leslie Becker-Phelps\n\nGood luck and I hope this information helps!",
            "I'm so happy to read of this update.\n\nYou rock, OP.",
            "I'm so happy to read this update! Good luck to you!",
            "Good job OP, I'm glad you went with this decision. ",
            "You made the right choice, OP.  Good on you.\n\nDefinitely go and concentrate on yourself.  You can be the person YOU want to be, OP.  You can do this.  For what it's worth, this Internet stranger believes in you.  ",
            "Glad to see this update! I remember the OP, and it was heartbreaking.",
            "You are making a great choice! :)",
            "So happy to see this. Go forth and kick ass.",
            "Good! A lot of people wouldn't have had the strength to do that. You'll be much happier without him.",
            "I've had times where I've really had to go for it, for myself. Where the reality wasn't acceptable and the honest answer was right there and living the lie was not acceptable. More and more it became a mindset I chose to adapt. Good on you.",
            "Mental health is hard to deal with. You will have bad days sometimes. I know I do! But it is so important to get help and find loving, supportive people. I'm proud of you for taking the step to better yourself, OP!",
            "Nice work! You deserve better!",
            "THANK GOD! You are a human deserved of respect and happiness, and that has to start with you respecting yourself! Well done lady, we're all cheering you on. ",
            "I remember your first post. Congratulations OP, I'm proud of you!",
            "Good job OP. You deserve much  better than that.",
            "I'm so glad to hear this OP. You absolutely did the right thing.",
            "Proud of you. You'll find the right guy!",
            "Good luck and you made the right choice, remember... one day at time. If you stumble there is always tomorrow keep your head up.\n",
            "Good for you! That guy sounded so horrible. Try to enjoy the single life. Don't ever settle for someone who doesn't make you happy. It's much better to be alone than to be abused. ",
            "Great job OP! A great first step towards being who you want to be. Give yourself the care you deserve!",
            "That is strength. I wish you the best, and hope that it all works out for you!",
            "I actually checked on your original post a few days ago to see if there was an update, this made me really happy to see! Best of luck.",
            "Best decision you could ever make. Proud of you <3",
            "So glad to read this post, OP. You deserve happiness. <3",
            "That's a good, but difficult call. Good on you",
            "Proud of you OP, never forget that you're a person who deserves happiness, good things, and good people.\n\nEven prouder for recognising that you might need help from a therapist, it's a huge step, and a lot of people don't realise when they need to ask for help, or are ashamed - it's never anything to be ashamed of!",
            "As a wise woman once said, \"if you can't love yourself, how in the hell can you love somebody else?\" ",
            "VERY glad to see this!! Good job. I really hope\nYou find happiness! ",
            "I'm sorry you had to deal with that monster. He sounds terrible.",
            "Good for you. You don't deserve to be used and taken advantage of even if you get something small out of it. \n\nYou do you, and get to a good place! Best of luck. ",
            "Good job. You almost took an L",
            "Good luck OP! Thanks for posting. You've totally got this. ",
            "Your welcome and happy cake day!",
            "After reading your first post just wanted to say good on you. It isn't always easy trying your best but you surely won't regret it, so keep on keeping on! Take care and be safe!",
            "So glad to see this!! Good for you! ",
            "I am rooting for you! You deserve to be happy. You're already on the right track by being kind to yourself and taking care of yourself. ",
            "So glad to read this update! I wish you all the luck in the world. Hope it all works out for you.",
            "This is a super rational way to handle this. Be proud of yourself. #adulting",
            "Glad to hear ! Let's go OP ! Time to make some changes ! You CAN do it ! ",
            "How did his fat ass take it? Did you tell him off or are you ghosting him? Just curious because he sounds like he'd be a nasty person to break up with."
        ]
    }
]