[
    {
        "post_id": "4fe8c5",
        "author": "spottedpenguinowl",
        "title": "I [24F] got pregnant 5 years ago and my boyfriend at the time threatened to ruin my life if I tried to get child support from or contact him in any way again. Now I got a check and letter in the mail saying he [25M] wants to be a dad and that he's sorry. I'm pissed. Help",
        "url": "https://www.reddit.com/r/relationships/comments/4fe8c5/i_24f_got_pregnant_5_years_ago_and_my_boyfriend/",
        "score": 2841,
        "num_comments": 849,
        "created_utc": 1461015728.0,
        "selftext": "When I was 19 and a sophmore in college I had a boyfriend I thought I really loved. Looking back maybe it was just teenage puppy love infatuation. Not sure but I guess it's not important.\n\nI need some advice because I know I'm very biased and what I want is what's best for my daughter but I think my feelings are getting in the way of that. \n\nI had been with \"Tom\"  for about 8 months at that point. He was on the baseball team and very popular. \n\nBut one day I discovered I was pregnant and told Tom. He freaked out and got super pissed. He demanded I get an abortion, said he would not stay with me otherwise. He did offer to pay the full expenses of it though.\n\nSo I went to the clinic and...I couldn't do it. I'm very pro choice and told myself the logical thing to do would be to have an abortion. But when it came down to it...I just couldn't do it. I admit part of it was that I was afraid but I also felt an attachment for my baby. The thought of getting rid of him/her made me feel like throwing up.\n\nSo I told Tom that I did love him and I wasn't trying to trap him but I simply couldn't have an abortion. Maybe we could look into adoption but abortion was out. \n\nTom said he had never loved me and while I was fun I was now causing him too much trouble for him to bother with me anymore and I was right, I wasn't going to trap him. He said I was free to choose to keep the baby and he was free to choose to have nothing to do with me or \"it\" and to not even think of trying to get child support from him.\n\nI won't go into details but Tom made it clear he would make life as miserable as possible for me if I tried to contact him again, get child support, etc.\n\nMaybe it was wrong to do but I figured all that trouble and drama just wasn't worth it and I would make my own way. I was, however, devastated and completely heartbroken. I admit it really fucked me up.\n\nI never spoke with or saw Tom again. I did consider adoption but in the end, long story short, I chose to keep my child. \"Faith\" is 4 now. It's been a long and hard road but I graduated college and got a job. We live in a tiny apartment and finances are tight but we make do.\n\nI love Faith like crazy and I do not regret the choice to keep her whatsoever. She makes me a better person and we have a good life.\n\nHowever three days ago I received a letter in the mail. It was from Tom. Inside the envelope was a letter and a check for $3000. This is what the letter said\n\n\"*(My name), I know this is coming out of nowhere and I'm sorry but I didn't know a better way to do this.*\n\n*I am so sorry for how I acted 5 years ago. I was selfish and a complete jerk. I know that doesn't begin to cover it. These past five years have really had an effect on me. I got a job at (blank). I started hanging out with different people. Good people instead of college jocks. I know I ran from my responsibility and I treated you  with callous cruelty.*\n\n*I know I can't undo what I did but I want to make it right. Here is a check for $3000 for Faith. I know that doesn't begin to cover what her expenditures have been but I wanted to show I am serious about what I'm about to say.*\n\n*I want to be a part of our daughter's life. I will go as slow as you like. I would very much like to set up regular child support payments as well as pay off whatever back child support I owe you for the past five years, including hospital appointments during your pregnancy. I know I don't deserve it, but I want to meet my daughter and be a part of her life in whatever way I can. I want to help her and I want to help you and start making up for the terrible way I acted.*\n\n*Here is my contact information. I am willing to do what you ask of me. Thank you for your time. Tom.*\n\nI was/am blown away. I'm also beyond pissed off. I'm thinking of the pregnancy I had to deal with after getting dumped like that. Exams and papers I had to write. Giving birth to her on my own. The late night feedings, all the diaper changes, the constant crying, trying to afford clothes to keep Faith warm during the winter as she grew while also making sure she didn't go hungry, the tantrums, the first steps, first words, the potty training.\n\nHe wasn't there for ANY of that and now he just wants to come waltzing into her life like nothing happened after doing whatever he felt like now that Faith is out of the unfun baby years and she's a well behaved child who can now carry on a conversation and knows how to use toilet and doesn't wake up every two hours.\n\nFaith has started asking questions like where is her daddy, how come she doesn't have a daddy and I've been doing my best. I've been saying Mommy doesn't know where Daddy is (true until now) and she doesn't have a father because Daddy wasn't ready to be one when she was born. Maybe that's the wrong answer but I am doing my absolute best.\n\nI'm thinking of how Tom hurt me and bailed when life got hard. I can't stand the thought of him doing that to Faith. She's a sweetheart and quite sensitive. She doesn't understand unkindness, she makes friends with everyone and is very innocent. I've done my best to teach her to be a calm, kind, respectful person and everyone loves her.\n\nHowever I do know she needs a good male role model in her life and I do feel guilty for not having one for her. I haven't had a boyfriend or dated since Tom because all my energy and focus has been on graduating college, getting a job, and being a good mother to my daughter.\n\nI never really thought about Tom much after Faith was born but now that I am with this...intrusion into our lives I think I hate and despise him. I want him to just go away.\n\nI wanted to not even cash the check and to tell him to take his money and shove it but my parents and close friends reminded me that that is Faith's money and she is entitled to it and I agree.\n\nAt minimum I want to get some child support going because Faith deserves all the financial assistance and opportunities she can get.\n\nHowever I know if I get regular child support Tom will want to be in Faith's life and frankly, I don't want that. I don't want him to hurt her and bail when life gets hard, because it IS when you have a kid. I also feel like he doesn't deserve her. 4 year olds are a lot more fun than infants. How convenient he suddenly shows up and wants to be a \"dad\" when the hardest part is out of the way.\n\nBut. I honestly do want what's best for Faith. I think she deserves to have a GOOD daddy. I just don't think Tom is. I think Faith is better off having no dad than a bad or half assed one.\n\nShe deserves the money. But am I right to take the money and not give Tom any access to my daughter?I can't stand the thought of him hurting her. The thought of dropping her off at his house where I don't have access to her makes me want to scream and run away.\n\nPlease help me think clearly. Am I out of line for taking Tom's money but saying that's as close as he will ever get to her? I am not convinced in the slightest he has changed. I feel like this is guilt money and I want to throw that check in the trash. But it's Faith's money, not mine.\n\nFaith and I have a good life and I feel like Tom is going to ruin that. But is it right to keep Faith from her biological parent when he has sent the money? I hate feeling like I owe her him because of that.\n\nPlease give me some advice and tough love if need be. I'm willing to listen if it's in the best interest of my daughter.\n\n**TL;DR College boyfriend dumped me after I got pregnant and threatened to ruin my life if I tried to talk to or get child support from him. Almost 5 years later I get a $3000 check in the mail and a letter apologizing for what he did and saying he wants to be a dad. I want to tell him to stay the hell away from us but I want what's best for my child. Advice?**\n\nEDIT: Since I have so many people asking, yes Tom is listed as the Father on the birth certificate",
        "permalink": "/r/relationships/comments/4fe8c5/i_24f_got_pregnant_5_years_ago_and_my_boyfriend/",
        "comments": [
            "I am a man and I have full physical custody of my four children because the judge granted me that right (and also because of the mother bailed several times)\n\nWhen the judge gave me the custody, one thing he said reverberated to me, \"It is for the best interest of the children.\" And that is what you should decide, for Faith's best interest. I empathize with you. I was, am, and have always been there for my children, two of them were born seven weeks premature and raising them was the hardest thing I've ever done. I have no life. I haven't gone out on a date in nine years. I work two jobs and give my whole life up for the best interest of my children. She got it so easy. She floats in and out of their lives whenever it is convienent for her. But the children love her. I can't stand in between them and their mother. Someday when they are old enough they would make their own decision. But for now, if she disappoints them, hurts them, poisons their minds, I will be there, constant, loving, and heal them to my best ability. That's my job and responsibility. And that's what I'm doing. \n\nTake care, and whatever you decide, I wish you the best. ",
            "You have every right to be pissed.\n\nHowever, I think he has tried to sensitively approach you. People make mistakes, and he made a big one. 20 year olds are young and immature. It in no way justifies his actions, but he will have matured and changed since then. I don't think it's fair to assume he will do the same things now that he did then.\n\nI wouldn't let him meet Faith right away. But I think she has a right to know her father, Otherwise she will probably try and find him when she is older, and could resent you for keeping him from her if she finds out he tried to be involved. I would meet with him, let yourself know and trust him again. See if he actually pays child support for like 6 months and tries to build a relationship with you before introducing them. If he can do that, and puts in a real effort he might be allowed to slowly transition into your lives.\n\nIt's ultimately your choice, and you definitely have every right to feel anger. But I dont think your feelings and emotions should dictate your daughters right to have a relationship with her biological father. He could be a changed man completely, and could from now on be a positive and wonderful addition to her life that she will be thankful for.",
            "He is more than likely a vastly different person now than he was when he was 20. I'm completely different at 26 now than how I was at 20 (female, but still). \n\nHe tried to be sensitive about it by sending you a letter and a check. He didn't ambush you or make demands. I say proceed, but proceed with caution. ",
            "[deleted]",
            "[deleted]",
            "Do not cash the check, save all communication from him (letters, texts, emails), and GET A LAWYER. Immediately.\n\nRight now he is acting like you are at liberty to say yes or no depending on what you think is best for your daughter, but that could change very quickly if you decline, and you might find yourself in a custody suit. I would ask for a few weeks to think about it, and then get good legal advice.\n\nIf he sues for it, he will win visitation and joint custody (depending a bit on your state and if you are both in the same state). You need to go into this with full understanding of your rights as a co-parent, and not just the lovely story of cooperation and fatherly involvement that he is spinning for you right now. I'm not saying he isn't sincere, just that he may not be so open to your opinion if you say no, and legally he is not required to consider your opinion at all.\n\nGood luck!",
            "> and now he just wants to come waltzing into her life like nothing happened after doing whatever he felt like now that Faith is out of the unfun baby years\n\nBased on his letter, I don't see it that way at all.  He admits to knowing what he did was wrong, and he says he's willing to go at whatever pace you deem necessary.\n\nYou, understandably, seem to carry a lot of resentment about how things went down.  Anyone in your situation would be pissed.  I think the thing to do here is to look at the bigger picture and not let your anger guide you.  That child support will allow you to do amazing things for your daughter's quality of life, and you can treat those back-payments as a windfall to improve your situation -- whether that's to pay down debt or to finish putting yourself through school.\n\nYeah, it sucks, and yeah you'll have to swallow your pride, but I think you should do it.  Eventually, Faith will glean together enough information about her dad to go looking for him.  It's better that you get to help set expectations and frame the ways in which they'll interact.\n\nHere's the thing -- keep that letter and cash the check.  It's going to carry a LOT of weight in court.  And you should make sure that you get legal backing on this child support with the help of a lawyer (some form of Legal Aid, which will help people with low income), so that it's court-ordered and not a function of him suddenly wanting to be part of your daughter's life.\n\nRemember, this guy walked out on you once because he didn't agree with your actions.  It's not like it can't happen again.  If you have the law on your side, you're in a much more stable position.  He can't just decide he disagrees with your parenting decisions and then withdraw the financial support.\n\nIs his name on the birth certificate as the father?  Because that'll help, too.  There's always DNA, but getting that is a little more difficult.",
            "Before you take the money - I think you need to talk to a lawyer about custody, child support, etc.  Don't give this man access to your child until you've figured out what your options are - and what your rights are.",
            "I, too, became a single mom during my sophomore year of college and, like you, made a life for myself and my daughter with no help from her biological father. He paid child support sporadically at best, emotionally abused me via text messaging, popped in and out of her life for almost 6 years. It was so, so hard on my daughter. \n\nAbout 2 years ago, he changed. I don't know what happened, maybe he got some therapy, I don't know...but he wanted back in her life. So, despite my feelings, I let him have visitation because my daughter deserved to have a relationship with her biological father and to have the chance to decide in the future what she'd like his role to be in her life. It was really hard at first, and he's screwed up, but he is slowly earning back my and her trust. He and I get along fairly well and things are looking up. So...people do change. \n\nAs for what you should do now, I would suggest that you don't cash the check, don't speak to him directly, and get a lawyer and work with them to arrange support and visitation. If he truly wants to be in her life, he'll do what he needs to do. \n\nYou should be proud of yourself and the life you built for Faith. Having her dad start coming around regularly won't take away from her relationship with you, so don't worry about that. If you have another man in your life now that she has a fatherly relationship with, having her Bio dad around won't change that either.\n\nYou've got this.",
            "**LAWYER.**\n\nBefore you reply to him or cash that check, **talk with a family lawyer.**  Since he's on the birth certificate, he most definitely has allllll kiiiiiiinds of rights as well as obligations, and these are the things you need to know about.  TODAY.\n\nFor all you know, he's already contacted a lawyer, right?  This might be a way to establish certain rights, reaching out like this and sending you a check?  IANAL, so I don't know, but the law is often very *subtle*, so be sure you cover all the bases.\n\nLawyer before *anything.*\n",
            "As a 19 year old, he made some awful decisions. But suppose for a second that at 25, he wanted to start doing things right, he wanted to say 'what's the best thing I can do today, given I don't have a time machine?' Honestly, a letter with a cheque in it and a desire to respect your wishes is a good start.\n\nDefinitely talk to a lawyer. Take some time with this. But ask yourself what he could do, today, to make it right. ",
            "My mom got pregnant with me when she was young as well. My biological father didn't want anything to do with me and wanted her to get an abortion. She decided to have me and have nothing to do with him. Every now and again he would try to contact her out of curiosity asking for photos of me but she would always decline. She said it was because she would rather me not have any contact with him at all than have him be in and out of my life and leave me to blame myself for his not wanting me. I am so happy that she made this decision. I had a strong and stable support in my mom and my grandparents. I am very glad to not have had a wishy-washy dad. I actually did meet my half-siblings and they told me he was very much as my mom had expected. \nI don't know what's best for your specific situation as you say she doesn't have another father figure (I had a close relationship with my grandpa) but I do think if you feel he will not commit to having a daughter, he doesn't deserve to be in contact with her at all. ",
            "Without reading any other comments, I just wanted to point out that from my experience there is no age that children are easy, but to be completely honest, infancy is a time that I look back on, now with children ranging from teenage to kindergarten, with a nostalgic sense of simplicity.  While it was demanding, I now realize that it is one of the \"easiest\" times to be a parent.  There were no difficult behaviors to confront, no decisions that I agonized over.  It was just a helpless little human that needed my care.  I'm not saying this to make you feel like what you did was easy, because I'm sure it wasn't.  Only to let you know that all ages have their challenges, and if he becomes part of her life, he has by no means \"skipped the hard parts\" (at least not the only hard parts).  What he did, how he acted was immature and unkind.  It sounds like he has grown up, and has recognized how awful his behavior is. That is a good start.  First of all, take his money.  Kids are expensive, and as absent as he's been, it will take a lot of cooperation from you to become a part of his daughter's life, even if he goes to court.  Maybe he'll get some visitation, but it doesn't sound to me like he just wants visitation, and I'm willing to bet he will be willing to abide by whatever rules and schedule you set, as long as you give him the opportunity to prove he is serious about becoming a part of her life.  I can completely understand your trepidation and desire to protect your daughter from having to go through this, but please don't deny her the opportunity to have another person that cares about her.  That being said, be very upfront about how far behind he is, and how hard he will have to work to show you that he's serious, how long of a process that might/will be.  Let go of your anger towards him though, because if he can be the father your daughter deserves, you don't want to be the person that is keeping her from that.  ",
            "Get in contact with lawyer before ANYTHING ELSE. Don't respond, don't cash the check, call a lawyer TOMORROW MORNING. See what they say, and go from there.\n\nSome things to keep in mind:\n\n* That child support is a great opportunity for Faith. College isn't cheap, and if Tom's willing to give, you might as well make sure it's helping her succeed. \n* Just because he's biologically her father doesn't mean he automatically gets to be Daddy just because he sent a letter and some money. You can feel this out. You can write him back and have letter/phone correspondence until you decide what's best for Faith and yourself. You can be honest with him. You don't trust him, and you're afraid for your baby. You need time and more than just a letter and some cash before that changes. Don't be insulting, but make sure he knows how angry he made you.\n* Depending on how this all works out, it may be an opportunity for you to be able to forgive him and move on. I know that's the last thing on your mind, but you could get some peace out of it.\n* You don't HAVE to forgive him. You're a grown woman. But just because you hate him doesn't mean Faith should be forced into a position to hate him too. That's why you should try to be objective. I know that's impossible. Maybe you can show the letter to a friend or family member, and see what they think. \n\nI don't think that him sending money should mean that you are forced to share Faith with him. Don't feel guilty over the money, but make sure that it's not going to be used to blackmail you. Honestly, **if** he's being true in his letter (we don't know him, you do), that's a huge step for him to take. He may have regretted the whole thing very early on, but didn't feel like he was worthy of contacting you until he could make right financially. Nobody but himself really knows his motivations here. Your job is to figure that out. **If** he *really* did change, then better late than never. No, that broken heart won't go away. You'll never get those sleepless nights or those never-ending days back. But there's at least a small chance that maybe Faith will get something out of it. ",
            "I would suggest meeting him in person without your daughter to talk about the letter and money he sent you. Kind of like an interview to see what he's like now. Do this a few time if need be. If he's serious about being there for his daughter he'll do it without hesitation. At this point, there's no reason to even think about any custody hearings (In case he ever brings it up and tries to pressure you). Just visitation on your terms if you eventually deem him worthy of being in the presence of your daughter. Definitely file for child support, but make sure there's no ambiguity about implications for visitation when you do. I'm not 100% sure about how the system works, but make sure he doesn't use it to play you or anything. ",
            "I've seen this happen with a friend.\nHer ex started dating a new woman who found out about him having abandoned their child and pressured him into being involved in his child's life.   Her ex still has little to no interest in the child and all arrangements for visitation and custody and handled by the current girlfriend.\nNot saying that is happening now, but it's entirely possible.\nGood luck OP",
            "There is a lot of great advice here already, so I'll just add my .02. I have shared joint custody of my son for several years. I got full-time custody of him last year. One thing I have learned is that you never need to rush a decision like this. You have a child together. That is not going to change, ever. You have plenty of time to wait until your first reaction dies down to figure out how you really feel about this in the long run. You can take weeks to get back to him if you want. Everything will go smoother if you give yourself time to feel all your feelings and then make a decision.\n\n> I was/am blown away. I'm also beyond pissed off. I'm thinking of the pregnancy I had to deal with after getting dumped like that. Exams and papers I had to write. Giving birth to her on my own. The late night feedings, all the diaper changes, the constant crying, trying to afford clothes to keep Faith warm during the winter as she grew while also making sure she didn't go hungry, the tantrums, the first steps, first words, the potty training.\n\nIt's completely understandable to feel angry and resentful about carrying this burden yourself. You have come so far on your own, and that is very impressive. However, I doubt he feels like he is \"off the hook\" because the hard years are over, so now he can enjoy the easy ones. He probably feels a great sense of loss on having missed out on all those memories and milestones. Yes there were hard times, but they are also precious memories that you and your daughter will share as a bond for the rest of your life. He can never go back and change his despicable response, or get back the years that it cost him, and he will have to live with that until his dying day. He will feel sadness and regret about those decisions countless times for the rest of his life. So if you think he is in any way getting off easy, hopefully that will give you some comfort.\n\nWhen my son's mom and I are at an impasse, or getting into an angry conflict about how to handle a situation, that's always the time to stop and ask myself: What is best for our son? Rather than trying to push my perspective on her, I ask her the same question. It changes our focus from each other back to where it belongs.\n\nShe will be better off with his financial support, no doubt. It remains to be seen what kind of father he would be. He seems to have learned some humility, but I agree it would be foolish to invite him deeply into your daughter's life right off the bat. She will definitely benefit from knowing who her daddy is, and that he cared enough to at least try. If she found out years later that he tried to be a part of her life, and you decided to take that chance away from her, she will never forgive you. My personal recommendation would be to take it really slow. Give him a couple months to make good on his child support promises. If he still seems sincere, maybe bring her along to a lunch with him without introducing him as her daddy quite yet. Let them size each other up, see how he responds to her, see if he respects the boundaries you put in place. If it goes smoothly, try a longer supervised visit, and so forth. There is no reason to blindly trust him immediately, but I also think it would also be a mistake to assume he is completely insincere.\n\nI know a lot of people think you should take him to court. It's a personal choice, with many trade-offs. We have managed to stay out of the courts, and it has saved us a metric ton of trouble and expense. The truth is, if he is sincere and reasonable then you are way better off never going to court. Once you involve the courts, there is no way to go back. It could easily make him feel threatened. If he hires a lawyer, the lawyer would do his very best to scare him into being as aggressive as possible, because this is how they make money. No doubt a lawyer would do the same to you. I am not saying you shouldn't consult a lawyer to get questions answered and explore your options, but really take your time and think carefully about the consequences of taking him to court. The courts very well may end up 'forcing' him to pay child support when he already would have, while also forcing you to do things you don't want to concerning custody. That would be a net loss.",
            "If he wants to be a father he can pay the backpay for the last 4-5 years of child support firstly. After he does that and proves that he really wants to provide for his child and not just swoop in after you've done all the hard work you can start trusting him and working on some sort of contact. ",
            "Don't do anything with the money until you've decided that you want him in her life. Because if you decide you don't want him to have contact with her and you touch that money, he can end up using that to sue for some kind of custody.\n\n**Talk to a lawyer who specializes in custody issues, and take their advice on how to proceed.**",
            "I know I am very late to the party here, but I think you should seek legal counsel. \n\n- Is his name on the birth certificate?\n\n- Have you cashed the check yet? (my advice is to NOT CASH IT until you speak with a lawyer)\n\n- Are your parents in the position to give you any material support at all for covering basic legal fees?\n\nGirlfriend, I have so many feels for you. I went through a pregnancy alone at 23. This was in 2011-2012 so we gave birth around the same time. My son is now 4. \n\nIt fucked me up hard. Going through pregnancy alone, abandoned by someone you thought loved you, having to bring your baby home by yourself...it was the hardest thing I've ever done and I swear to god it has left emotional scars that will never go away. I guess some people can deal with it better than others--it's not like I'm the first woman to be abandoned and abused during pregnancy right??! For whatever reason though, this was just the deepest, most visceral, primal, horrific betrayal I have ever and probably will ever experience. Looking at my tiny baby and sobbing because her father is gone, the late night feedings being exhausted and alone....that shit will stay with me forever. \n\nSo I just want to say, it's really easy for people to waltz in and declare that he's a changed man and you're being too emotional. I think you have every right and evidence to be very cautious about this man's presence in your life and your daughter's life. And as of right now, you don't actually know anything about him. You are good to be cautious. I applaud you. \n\nI think you need to consult with a lawyer and go over your options. If you agree to some kind of visitation and child support, YOU NEED IT DOCUMENTED. I'm not saying to be difficult or try and be combative. But for your protection and your daughter's protection, this should be a mediated process. You don't even have to go to court in some cases, a lawyer can simply draft the paperwork and file it for you.\n\nPeople say it's in the best interests of the child, and while I think that this is sometimes true, it's sometimes not. Right now you don't know that. \n\nThat being said, Tom damn fucking sure as shit owes you that money. You and your child have every right to take it. It's up to you to decide how hard you are willing to fight to keep him out of her life, and if he really is a decent guy now, it might be dragging your daughter into a pointless fight for your own personal hurt feelings. \n\nCan we talk about why you think biodad will ruin your life? ",
            ">But am I right to take the money and not give Tom any access to my daughter?\n\nYep. File for child support using the information he gave you. Child support and visitation/custody are separate issues and he is not entitled to visitation just because he is paying child support. Considering your child is 4 he is about to be in a world of hurt financially with back child support, errands, and fines. \n\nTo everyone else, do NOT let men walk away from their financial responsibilities. If they threaten you for filing for child support, press charges and get a restraining order. DO NOT kowtow to their misogynist bullshit. ",
            "Take the check and the letter down to a lawyer's office. Tell them you need to know how to go about setting up child support, visitation, and what to do with the check. You can allow Faith to have a relationship with her father without having one with him yourself. Go through the courts and set everything up that way. If he chooses to give up his visitation days, that's his choice. You can't force him to have a relationship with her, but you can let him try. \n\nTrying to keep him away will look horrible to the courts. ",
            "You've received a lot of great advice, and your first stop should be a lawyer's office, as so many have pointed out.\n\nOnce that is somewhat settled, or at least after the initial process has begun, your second stop needs to be a therapist's office. Whatever happens with Tom, whatever kind of presence he ends up being in Faith's life or yours, however much joy or disappointment he brings for your daughter, you have a lot of emotions to sort out on your own. And the very best thing you can do to be supportive of your daughter and her relationship with him is to get yours sorted out.",
            "A lot of people here are saying they wish they'd known their dad, and I really respect that experience but I want to say as a counter point, I knew my dad a little and he was a POS. I'm really glad to be the only daughter of a single mother, our bond is amazing, she is my best friend and I would be perfectly happy to be a single mother of an only child myself because of my experiences. I don't long for the man who abandoned my mother at 3 months pregnant, I wish it had been easier for my mum of course but we have a great unit without him. I just wanted to provide another perspective. Good luck.",
            "> the hardest part is out of the way.\n\nThe most physically tiring part is out of the way, but it doesn't get 'less hard.' :)\n\nWith the level of resentment you have shown for Tom in this post, Faith would be able to tell, and that wouldn't be a good relationship example for her.",
            "I think he is repentant and I think you need to do what is best for your child.\n\nThis is a very personal subject for me, I am the result of an affair and when I was a child it was clear that my own father would have opted out of a relationship out of me if he had any sort of choice. He adamantly refused to pay any child support and made it pretty much impossible for my mother to take him to court over it. We went without. My mother worked herself to the bone to support me and my siblings and this last year of my life I'm coming to the realization that I lacked a lot of parental attention as a result of that, many times it felt like I had to be my own parent and many issues I had as a child went unchecked and undiagnosed that have followed me into adulthood.\n\nIf my father, at any point in my life, came forward and told me he wanted a positive and loving supportive relationship, it would have been **life-changing**.  If I learned that my mother turned down his support and the potential of a relationship with my father, it would absolutely crush me to learn this.\n\nYou can pissed off at him all you want, but don't punish your daughter for that.",
            "> Tom made it clear he would make life as miserable as possible for me if I tried to contact him again, get child support, etc.\n\nHahaha, cute threats. He knows legally you'd win.\n\nYou don't have to decide today if you want him around again. There's no rush. But *do* go to court for the back child support, he legally owes you that.\n\nLike you said, you need to make sure that Tom won't disappear once the novelty wears off.\n\n\"Tom, based on how you abandoned me, I cannot trust you. I do not know what kind of person you are. Maybe you've changed, maybe you haven't. Before I expose my daughter to you, you'd need to prove that you won't disappear again and leave her heartbroken. Gaining that trust takes time. I will be filing for child support payments and back child support, because that is what you legally owe me.\"\n\nAnd get a lawyer before he tries to file for custody.",
            "This is just one person's perspective. I haven't read the other comments, and they'll probably disagree with me, but I think you should give him a chance. I was raised by a single mom. My dad left us when I was 1 year old, maybe a little less. My mom never really talked about him, until I started asking when I was about your daughter's age. When I was 7, she arranged a meeting for us.\n\nI met my dad one time in North Carolina. Once. That's weird to say. I have met my dad one time. My mom brought me to his parents' cabin. That was also only one of two times that I got to meet my dad's parents. His father died a few years ago, and I felt more sad than I thought I would. I lost my \"real\" grandpa in 2006, and losing this second one that I'd never gotten a chance to know left me more empty than sad.\n\nAnyway, when I was 7, my dad brought his two (new) kids, and that's also the only time I ever got to meet my half brother and half sister. We hung out for a weekend at the cabin. We got to ride in a pontoon boat and swim in a lake and play hide and seek. My dad kept up the calls for a little while after. He always told me he loved me at the end, but it didn't last. I don't know if it was my mom that discouraged him from calling, or it me being 7 and having the attention span of someone who is 7, or just him being him . I would ask her why he left or why I didn't hear more, and she just told me that he was lazy, and it wasn't that he didn't love me, but he wasn't the type to work for a relationship.\n\nThat went on for a lot of years. When I was 20-21, my grandpa had died still pretty recently and I was feeling pretty raw and hurt from that loss. I started drinking a lot and one night, decided to look up my dad on Facebook and call him. I even found an interview he'd given a magazine about a book he was working on. That went on for a few years, just drunk dialing my estranged father to talk to him. I found out that we had a lot in common. Where my mom is a staunch religious, right winger, my dad is super liberal and we had a lot to talk about. We were more similar ideologically than my mom and I. He's the only other atheist I'm related to, and that made me feel strong again, after the loss of my grandpa.\n\nAt one point, my half brother begged to come see me. We planned his visit a few times, but it never happened. My dad divorced my brother's mom when he was nearly an adult, and I dare say he's just as fucked up as I am. I know nothing about my half sister, except her name and that she looks a lot like me.\n\nMy dad used to send me a text message every day. It started maybe three years ago, when I was suffering from depression amidst some serious relationship problems and bouts of heavy drinking. Something nice and uplifting, every morning around 6am, like clockwork. I think he sent it on the way to the bookstore, where he worked part-time next to his job writing for a newspaper. I guess he doesn't work there anymore, because the texts stopped. One night, I told him that I appreciated it, even if I didn't text back, which I never did. His birthday was a few weeks ago, and I didn't text him anything, because I didn't know what to say.\n\nI was on a plane once during a study abroad in Russia, summer of 2008. I was flying alone, and ended up next to this Russian guy. He was an ex-pat who lives in Charleston, SC now. He told me I should talk to my dad while I can, even if it's awkward, because he'll be gone one day and I'll regret not doing it. That was 8 years ago, and I want to take his advice so bad, but I just don't know how.\n\nI said a lot of things in this post. My mom was amazing, just as I'm sure you are. Raising a kid is fucking tough. I was diagnosed with type 1 diabetes at 6 years old, and my mom dealt with it. She was the best goddamn mom that has ever walked the planet and I want to give her every award that exists because she made me a capable, compassionate human. She gives me so much, and she always has. I love her more than I will ever love anything else, ever.\n\nThat said, I still wish I had had the opportunity to build a relationship with my dad. I think about it every stupid day and I wish I didn't, but even though my mom stepped up to be everything I needed, even though she's the strongest, most amazing parent and she raised me right, doesn't mean that there isn't my dad just out there, living his life every day too, and yeah he sucked. He abandoned us. But he has my nose and he likes to collect comic books and his favorite show is Firefly, too, and even though he fucked up and maybe it's too late for us to have a relationship, it's not too late for Faith and her dad.\n\nPeople fuck up. They do really dumb shit and they hurt the people that deserve it the least. It's your call and all the abandoned daughters won't end up sad like me, but I'll tell you from one sad daughter's perspective, I would rather he had tried back then. Now that I'm grown, I just don't know how to build this relationship, and I find myself resenting my mom (who doesn't deserve it) and myself for being a bad daughter (I don't think I deserve it either?) rather than him. I think you should at least give them that chance to build something more than what I have.",
            "Please talk to a lawyer. This is probably not actually going to be up to you. If he is legally established as the father, and he could go through the courts to demand paternity testing to make that happen if he wanted, then he is going to have the responsibility of child support and the right to visitation. The courts would probably order limited visitation at first, but without serious reasons they're not likely to deny it all together. Cooperating and negotiating with him may actually give you more input than resisting, but you need someone knowledgeable with the law in your area to help you navigate this.",
            "Above all, consult a family lawyer NOW. \n\nOr even cross post at /r/legaladvice\n\nWhether or not you want Tom back in your life as well as Faith's, make sure you understand your legal rights and options before you decide on what is best for both you and your child. Do not cash in that check and make sure you consult a family lawyer who will protect your interests.\n\nI would also advise that in terms of child support, make sure you get a legal arrangement in paper with lawyers present. As you mentioned, you are worried that Tom may bail or go in and out of her life. Having court orders and legal papers will at least insures he is financially responsible for Faith. \n\nGet a lawyer now. ",
            "You've gotten lots of good advice in this thread, OP, but I don't think this has exactly been said: Child support in *in no way* \"buys\" visitation (and certainly not custody) rights -- they are two separate issues. Tom owes Faith financial support by sheer virtue of the fact that he fathered her. The amount of support and whether or not he gets visitation rights are best determined by legal avenues.\n\nAlso, kudos to you for making a tough decision at a young age and doing what your heart told you was the right thing! You sound like a terrific mother and I sincerely hope this situation gets resolved in favor of what's best for Faith. I wish you all the best.  ",
            "My dad abandoned me shortly after my birth. He fell off the face of the earth and he never contributed or added anything to my life other than this huge gaping hole throughout my childhood and adolescence. My mother kept him out because of reasons she's still never shared with me. I forgive her but I wish she had made a different choice. \n\n\nI remember every year on my birthday blowing out my birthday candles and wishing he would find a way to me. Whether it was by letter, email, or just showing up out of the blue to see me. I really wanted to know him and for a man to love me like all of my friends' dad's did. In February this year I got a call that he had died. He literally drank himself to death. I was able to meet his brother and sisters and my grandfather but it wasn't the same. Seeing photos of him left me feeling empty. And when I saw him holding a small girl in one of the pictures, his sister, my heart broke and I couldn't imagine why he couldn't have found time to hold me. To love me and be my dad.\n\n\nAnyway, my point is that Faith deserves to know who her dad is. This isn't about you or what you had to go through these past four years. This is about what Faith needs. You can hate him and resent him but growing up without a dad left me incomplete. I'll never get that chance to be walked down the aisle by my dad and I'll never get an opportunity to hear the sound of his voice telling me he loves me and is proud of me. Maybe I'm wrong and you should cut contact completely and he doesn't deserve to know Faith but this is just my perspective. In the end you know what's best for your daughter. You sound like a wonderful mother and I wish you the best of luck with your decision.",
            "I totally understand how hurt you feel. As a man and a father I am disgusted by how he treated you. \n\nHowever, you should remember that he is Faith's father and (unless you skipped the part where he signed them away) he has certain rights. \n\nIf he chose, he could take you to court to get visitation. \n\nYou should totally file for child support as another poster suggested. \n\nAs for visitation, try your best to put aside your feelings about him. Is it fair that he skipped out on you and Faith? Absolutely not. However, getting to know him will be good for Faith. Also, try to remember, you aren't taking him back as a partner, he's just getting to visit his daughter. \n\nTry and be civil and work out a plan that works for you. If you two can be civil maybe you can keep from having to hire an attorney. Either way (lawyer or no) don't agree to anything that you can't live with for the foreseeable future (a long time) because once a precedent is set or an agreement is signed it won't be easy to change it. ",
            "I met my dad for the first time when I was eight years old, in a therapist's office. It changed my life irrevocably and mostly for the worst. My dad most likely wanted me back in his life to get his child support reduced. My mom asked me before they went to court I think if I wanted to meet my dad, and while I don't really know how much my desires mattered in the court's eyes, I said yes. But I said yes based on the years I had spent growing up fantasizing that my real daddy would come back some day and he'd be the best daddy ever and love me. Well, the kind of man who would abandon his child, especially one who already had other children and knew what he was abandoning, isn't the type of man who is a great dad when he is around. My dad initially acted very interested in me, calling me on the phone, taking me to do things, making me cd's of music I liked at the time. My mom, understandably, made him jump through a lot of hoops to get to see me, and before I was allowed to meet my step mom, siblings, and other family. As soon as I was allowed to spend weekends at his house, all that interest dissipated. I know my dad loves me, but he's always struggled to show emotions. No more phone calls, I was never told about or invited to family functions, except once when my brother wanted me at his birthday (they only celebrate \"milestone\" birthdays), I was expected to do all the work to upkeep the relationship. Besides all of the other dysfunction, (which is beside the point, I'll elaborate if there's interest), this all caused me to spiral into a deep depression with suicidal thoughts at EIGHT. Anger problems, anxiety, OCD, all developed around this huge event in my life. The shattered expectations really did a number on me. And how do you explain to your eight year old that her dad just isn't even a fraction of everything she thought he would be? All this led to me failing school, years of therapy, medications which caused weight gain I still struggle with to this day. My whole life is different, with very few positives, because of meeting my dad. My positives being my brother, and a few other relatives that I'm close to. I don't tell you this to discourage you, but to give you a POSSIBLE outcome of all this. I am very fortunate to be a functional human being. I most likely have all that therapy and meds to thank for that. If you choose to allow him into your daughter's life, (and I'm not sure you have a choice) get your daughter a good therapist and any other preventative support you can think of. The best thing for it is to help her be as grounded as possible before she's hit with all the very difficult and confusing emotions that will come with this. Make the transition as slow and smooth as humanly possible. I could say a lot more on this, and I've had a lot of time to reflect on it, so if you need anything feel free to PM me.",
            "Ask for the entire 5 years child support in back pay for you to even consider thinking about it.",
            "There is so little love in the world. No matter how angry you are at him, please don't poison your daughter's chance to get her father's love.  Be wary, because maybe he is still an ass, but very seldom do people regret taking the high road.",
            "Talk to him, call him on the phone. Meet with him before you have him meet Faith. 19 year olds can be really stupid, and guys especially are more immature. He really might have changed. ",
            "I'd say talk to a lawyer before going forward, and find out if you can get child support without giving him access to your daughter. It may be that you can do that considering  his past actions.",
            "I'm curious...if you haven't seen him in five years how did he track you to your apartment with enough certainty to send a 3k check to that address?",
            "I understand that Internet advice forums are full of douchecanoes who say “you *must* act like all the awful things I did to you didn’t happen any more and you must accept me back into your bosom, because I’ve chaaaaaanged”.\n\nBut the $3,000 check and the offer in writing to catch up on back child support show a certain level of seriousness here. Money talks.\n\nThat doesn’t mean you have to forgive him; it doesn’t cancel our your right to be pissed at him; it doesn’t mean that he will, ultimately, fulfill all his duties to you. As others have said here, you need some guidance from a lawyer and probably also from a therapist. But I think it’s in your daughter’s interest not to simply brush him off.",
            "> Am I out of line for taking Tom's money but saying that's as close as he will ever get to her?\n\nYes, that is out of line. You can't have it both ways - either he's a part of her life or he isn't, but you don't get to pick and choose. You don't get to take his money and shut him out. This isn't about you or your feelings, or how unfair it was that he didn't put any work in when she was a baby, it's about what's best for your kid. \n\nIf it's best for her that she knows her father, then she needs to know him and spend time with him. If he's a piece of shit and he will \"waltz in\" and then disappear again, then he doesn't deserve to be a part of her life. You need to talk to him and make an informed decision. \n\nAnd, OP, this is a decision that's going to affect her literally for the rest of her life, and you CANNOT make it based on your hurt feelings or your resentment. You have to put all of that aside and be coldly logical and rational and decide based purely on the evidence and consequences in front of you. ",
            "Get a lawyer, and i'd argue meet up with him in public without faith there (but maybe bring someone else or the lawyer). Talk about what you went through and find out whats going on in his life face to face which means the sudden change (and also see if he might drop out again.)\n\n",
            "I was gonna say screw him, he had his chance and F up but I read what Assmouthorboth said and I may have to rethink that advice, I would go slow and see why the change of heart and at that point decide what to do, but I would still nail his ass to the wall for cash and this is coming from a guy. ",
            "This is such a hard situation. My dad left when I was about ten after being in and out of my life beforehand. Be started meth when I was about 3. He put my mom through hell. It was better when he left and I resent him a lot. But I also have some pity for him and love him even though I haven't been able to find him and he hasn't tried to contact me at all. Realistically I shouldn't give a shit about him and im hoping it gets to that some day. \n\nMy main point is your daughter will probably love him no matter what. I wouldn't want her to resent you. I don't resent my mom but I really hated it when shed say things like \"he'd talk to you if he wanted to, he knows our number\" or \"your dad was here earlier, I told him you were almost out of school but he had to go\" (then I never saw him again). Stupid things of my mom but I totally get how she feels. It's really not fair and a fucked up situation. I don't know if there's much you can take out of this but once she'll get older I'm sure she'll have so much more love for you realizing all you went through. Even if I love my dad the love I have for my mom towers in comparison.\n\nGood luck with everything and I hope it works out. I'm sorry you have to deal with it all but you sound like an amazing mom!",
            "I think it says a lot for him to step up now.  He has matured a lot and is trying to make reparations for the wrong he did to you and your daughter and it shows when he says \" I will go as slow as you like.\" and \" I want to help her and I want to help you and start making up for the terrible way I acted.\"  I perceive his intentions not so much as \"whee, missed the rough years and now that Faith is fun I want in\", but instead as \"I was an awful human being and want to rectify that as much as possible.\"  At the same time I understand your hurt and anger.  \n\nIf I were you I would respond to him, saying that you will accept the $3000 on Faith's behalf and would be willing to speak with him with an attorney present about any future connection between him and your daughter. You might also consider meeting jointly with a counselor so both you and he can communicate your respective feelings of anger and regret.",
            "This really hits home for me in a way. One of my early memories of my father was of him kneeling in front of my like a dying man and crying, begging me for forgiveness. I was 5 years old, just like your daughter is now. At the time I didn't understand at all what my Dad was asking of me right then and there. I didn't have a concept of just how long I hadn't seen him. As a little girl I just knew my Daddy was sad and I wanted him to be happy again and take me to Waffle House to play the Slap-hands game he taught me previously.\n\n\n\n\n\nI didn't comprehend the weight of his sorrow but even today I remember his apology, on his knees in front of me, for having little to do with me until I was 5. Not many people get that gift but he gave it to me. He's been in my life ever since and has been a profoundly positive addition.\n\n\n\n\n\nIt is understandable to be so very angry with him. My mother was with my father. She... puts up with him. But when I was growing up I saw very little actual animosity between them besides the occasional arguments about who was buying school clothes that year. Both of them are amazing parents and I think *YOUR* daughters father has a true potential to be as well. \n\n\n\n\n\nWhen it boils down to it, though, it's not about you. It's about what is best for your daughter. Her dad contacted you in a way that is appreciable- he gave you the option to make the second move on your terms. I like the letter and the money, it shows initiative.\n\n\n\n\n\n\nIn my experience with my own father, her dad will ALWAYS regret not getting to be there during those first years. He knows he fucked up. He will never get it back. But the good thing is that he didn't wait until she was 10 or 12 or 18 or 25 years old. She's only 5. At least for her mind, gaining a daddy might be a relatively easy concept to digest. His being 'away' might not have as huge an impact on her worldly awareness as it would with her growing up.\n\n\n\n\n\nI turned out alright. :)",
            "[deleted]",
            "For your daughter's sake yes. You have evry right to describe and express your emotions. He is focusing on the daughter he pretty much disowned and rejected. Conversion can be real in some instances. Having worked for many many years in Children's Protective Services (throughout the ranks) and leaving as a high ranking official, I saw cases like these hundreds of times, unfortunately not many ended this way. I remember at times publishing notices all over the US and foreign countries if it was thought that the alleged  father might be in these places in trying to do what was in a child's best interest and also doing what the law mandated. So a father identifying himself voluntarily is (based on my experience) wonderful.\n\n Youthful indescretions can be painfully regrettable. Give Tom a chance to prove himself, sort your head out , retain an attorney, you will have to go to court, establish paternity, he will of course need to file for some type of possessory/managing conservatorship, child support by court order, the court will automatically appoint an attorney ad litem for the child, set up visitation rights, of course after a home study etc has been completed on Tom  and so on and so forth.\nFaith deserves the opportunity. Tom made this move voluntarily not through force or order by a family court- in my experience big difference.\nYou say: I honestly do want what's best for Faith. I think she deserves to have a GOOD daddy. I just don't think Tom is.\n\nI see where you are coming from,I won't try to change your opinion on this, because your emotions are valid. Remember however that Tom has every right under the law once paternity has been established to petition the court for joint custody etc. So get legal help because you will definitely need it.\n\nGood luck to you and Faith.",
            "You may not have the choice to keep him away from the kid. He could sue you for custody, which may very well be supervised and short in the beginning, but if he sticks to it then it'll become unsupervised eventually. If he is the father then he does have rights. \n\nBut you should go through the court for everything. For a proper custody agreement and child support (and getting all the back child support he owes you!). By taking the initiative you'll feel a lot more in control of the situation and be able to act rather than reacting to whatever he does.",
            "Don't do ANYTHING until you talk to a lawyer. \n\nI understand exactly how you feel. I would so want to send back a torn up check.",
            "You need to consult a lawyer about everything. Check the local women's shelters to see if there's a pro bono legal service out there for people in your situation. There are serious legal implications for setting up a child support plan. \n\nWhat does the birth certificate say about her father? ",
            "I'm just going to say: the time you guys were apart is typically pretty transformative. I would *hate* 20 year old me(I'm 28). I was an insensitive mysoginist asshole. Now? I'm pretty much the opposite. \n\nI would meet with *him* then decide if he can meet your kid. He didn't have to do this, and the amount of difference between who he was and who the type of people who would own up to this kind of thing are is massive. Might be worth it. ",
            "Consider crossposting at /r/legaladvice.",
            "You were forced to grow up because you were a single mom. He was forced to grow up as the guilt of leaving you a single mom sunk in.  It does sound like it's possible he has matured, and I would proceed, but with caution.  I would not cash the cheque, speak to a lawyer, and meet up with him without Faith.  Talk to him, establish a relationship to the extent that you can try to assess his sincerity.  Tell him right off the bat that while you hope he is sincere, in protection of your daughter you aren't going to take his money or allow him any contact unless it's done legally and through the courts.  His letter said he'd do anything you ask, so ask him for full blown legal involvement.  If he jumps at it, I would say he's likely sincere.  If he balks, he probably isn't.  In which case, go after child support because your daughter deserves it.\n\nIn the end, if he's sincere and has changed, your daughter deserves to know her father.",
            "I know you're angry, and you should be. But I just want to say, I changed more from age 19 to 24 in terms of personality and outlook than I did in pretty much any other 5 year period in my life. \n\nThis guy is essentially a total stranger in terms of who he is. Judge him by the incredibly shitty thing he did, but also remember that he very likely has changed. Not saying he's not a bad person, who might get tired of being a dad in a few weeks and leave your daughter an emotional wreck - he totally might.",
            "Time for some tough love.\n\nI think you are legitimately angry and bitter for how Tom treated you when you got pregnant. That was awful. But five years is a long time. Long enough for a person to change. I don't think his change of heart has anything to do with the hard part being over. I think he's genuinely sorry.\n\nIn the end, he had a right to see his child. And Faith? She had a right to her father. Not just his money but his presence in her life. Don't take that from her ",
            "Um, I know the money would help, but IF you take the check, you maybe have admitted his role or started a legal relationship. Do NOT cash it until you get legal advice.\n\nI don't know if I would make it easy to have him come back in. Right now he has no legal rights because it is not proved that he is the dad. He really doesn't seem like a good kind of guy to have as a dad. To have the ability to threaten you like that is horrible.\n\nDo some research and find out if he has a new wife who can't conceive or some other odd story like his parents leaving all their money to grandkids, etc. I mean, how did he even know where you were or your daughter's name? And truly, if he has changed, there should be proof of volunteering, good work, good friends, etc. Find out.\n\nIf he is fairly decent now (but what could ever make up for what he did to you and Faith?) consider before talking to him how you would like things to go, how slow for Faith, etc. I totally agree they should not be alone. Ask the lawyer about custody agreements because if he doesn't like what you say he could go to the court and ask for half Faith's time--or even full custody. You are the mom that raised her so that is huge, but he might say his finances are better or he is marrying a woman with children and so can offer her a good home, etc. You don't know what's going on!...yet.\n\nSometimes in these circumstances, people vanish. You can understand why. Also, if he's stalking you, if I were you, I would change my user name and maybe eliminate this post in a little while...\n\nP.S. The 3K seems like a weird choice of money. It's not near enough to make up for the hospital bills--notice how he dangles that out there, thinking you'll be tempted--but it's really not a lot. Did a lawyer decide he should offer you that amount? Is there a cut-off for something for that amount of money? Is it exactly your monthly bills (might show stalking)? Whatever happens, cash or return, make a Xerox. Hope I'm wrong and it's simple, OP, but please be safe rather than sorry.",
            "It's a tricky situation. \n\nFirstly, don't cash the check. \nSecondly, lawyer.\nThird, meet with him?\n\nYou are right to be pissed. You had to do everything on your own.\nBut maybe now you won't have to. \n\nIt was 5 years ago, he was still a child in many ways and a lot can happen in that time frame. You don't know what's happened to make him change, but without talking to him and finding out, you won't know his true motives. \nMaybe letting you and Faith go is his biggest regret.\n\nIf you decide to meet with him, don't bring Faith. Because you deserve answers and an in person apology. You need to get things off your chest (\"you weren't there for all the hard parts, how convenient you want in now that all the sleepless nights and diaper changing is done\" or whatever you want to tell him). \n\nI will strongly suggest that you do not bad mouth him in front of your daughter (I don't think you have, but keep not doing it). It speaks volumes about who you are and how Faith sees you. \n\nBest of luck in your decision. You need to do what's right by Faith and yourself.",
            "I know this will probably get buried in the fray but I just wanted to say I know the feeling of betrayal, the hurt, and the strength it takes. I was 3 months along when my BF of 4 years broke up with me over a text saying \" he just wasn't happy anymore,\" devastating doesn't even begin to describe it. \n\nI remember on the hospital tour before I gave birth, there were all these happy couples and then me alone. I hid in the back of the pack and broke down and cried on that tour. Even now 4 years later I can still feel the sting, the sadness. \n\nMy ex didn't even come to the hospital to sign the birth certificate because his new gf forbid him from coming to the hospital very early on. \n\nMy ex came back around earlier than yours when LO was 6-7 months old, but I remember struggling with these same fears, my only consolation was that LO wouldn't remember if he flaked out of our lives that early on, an opportunity you don't have. \n\n3 years later  I will say my ex is far from the perfect father figure, he sees LO for a few hours every other week and drops him off early and shows up late every single time. If he's not feeling well, stayed up too late, or his allergies are just bad he will cancel last minute. He has no idea what being a parent really means, when I'm tired I certainly can't bail. \n\nBut all in all I think it's better that he sees LO when he does, LO calls my husband dad and rightfully so , much to my exes shagrin. I'm not jealous of the time he misses or his lifestyle honestly I pity my ex for missing out in the most wonderful experience of my life, and thus is time he will never get back. \n\nWhen LO gets older I know I will be able to Honestly say I tried everything I could to foster a relationship b/w him and his bio father, which to me is worth it. Although I can certainly understand if it's not worth it for you. \n\nGood luck op",
            "I understand your anger, and you are completely entitled to it, but when it comes to parenting there are a lot of times when you need to put your feelings aside and do what's right for your child.  I think you should take some time, find a way to swallow your pride, and get a feel for how he actually is as a father in baby steps.  At 19, 5 years is a long time and people tend to change drastically.  If it turns out that he's still not a nice person or is a shit father then go to court and put a restraining order on him.  I think your daughter deserves to know who her father is, for better or worse and you could probably use the financial support.  I also agree that you both are entitled to the money he sent but if you want to keep it for her then that is perfectly understandable.\n\nAgain, you are entitled to your emotions and I completely understand why you feel the way you do.  I wish you the best.",
            "I think you should meet up with him, without your daughter for a start. Try and figure out how serious he is about this... He may truly have matured, and may regret his decision every day. I understand that he hurt you, and I would also have a hard time forgiving that, but I think you should meet up with him and see if it is in any way possible for you..",
            "I'm sure you heard it all from other comments, but keep in mind the letter said he will take it as slow as you like and that he wants to pay for child support.  If you want to let him back into your life, and more importantly, the child's life, it's on your terms.  He already agreed to it.",
            "Before I worried about whether he should be in Faith's life, I would check out the law in my state to find out what legal rights he has to her. Remember, if you don't have it in writing/voicemail/video or some form of documentation legally it doesn't exist. I'd definitely keep that letter in a safe place as he's admitting to ditching you and her. \nIf he's contacting you he clearly wants to be part of her life, and if he's still a giant mega-dick he's not going to just go away. If he's likely to get visitation anyway, it's better to allow that gracefully than in a vicious fight. Find out what the law says, and then go from there. If he's changed, and a lot of people do in that period from 19-24, having an extra adult to help out will be useful to you as well as the financial support. It would be good for you to date and enjoy life as more than just a mother. It seems unlikely he would come out of nowhere with a sizable sum of money with the intention to show up and bail. I get that you hate him, I certainly would, but this sounds like a case of cutting off your nose to spite your face. He'll never have the relationship with your daughter you do--he hasn't been there--but it would be good for her if they could forge a healthy bond. Also, if he has changed, he'll prove useful to you both financially and as a support person. Essentially, he's offering you this deal: I will give you money and free time in exchange for access to my daughter. Your daughter gets the benefit of two parents and an extra set of grandparents. The more adults she has that are decent people--and I really think if he were a full-on mega dick he'd never have come out of the woodwork. He'd have kids with his \"real\" family and forget you. It would be a lot simpler for him to find another girl, get married, and have a set of kids with her. Now when he dates he'll have to have the baby mama conversation with his new girlfriend. Plenty of 24yro women are not excited about dating a guy with a kid. It seems like he wants to do the right thing, and if he's grown into the kind of guy who steps up and takes responsibility for a huge fuck-up, well, he sounds like he might be the kind of adult worth having around. Maybe. Find out your rights, cover your ass legally, and meet with him first yourself. If you have friends in common, ask around and see what sort of guy he has become. ",
            "One thing I haven't seen mentioned - say Tom has grown up and is a decent guy now. The amount of pressure that even partial visitation would take off of OP is enormous. I'm in a somewhat similar situation, except I immediately filed for child support and son's father has never shown more than a cursory interest in contact with him. I can honestly say the HARD PART IS NOT OVER. If I had, say, every other weekend off? God, that would be amazing just for my mental health. Just saying, there are positives to visitation other than what's been mentioned here. \n\nAlso, question, how did he get on the birth certificate if he was absent since before faith was born? In my state, if the parents aren't married, the father has to sign a statement at the hospital accepting parental rights, OR (as in my case) the state legally established paternity by getting a DNA test. ",
            "People change a lot in 5 years. You, yourself, have changed. It's entirely possible that he really has too and is genuine in his desire to be in his daughter's life and be a good dad to her. I would say to take things slowly for a while and see how it goes. But letting your grudge for him get in the way of your daughter knowing her father is probably not the right choice. He at least deserves a chance, for her sake. Not a million chances, but maybe just one. ",
            "Get a lawyer before accepting or declining. Believe me.",
            "If I could say one thing - what seems logical to me, even if it isn't the thing that would be easy to do:\n\nIt's understandable you'd hate this guy, Sounds like he was an ass and you don't ever have to forgive him no matter how he has changed. But I think you probably owe it to your daughter to see if there's something positive he can contribute to her life.",
            "It's not so much him being entitled to meet his daughter, it's that your daughter should have the right to meet her dad.\n\nI suggest setting up child support through family court regardless of your decision.\n\nJust remember that a lot of maturing happens between 20 and 25. He took a very careful approach and wasn't pushy. Perhaps meet him on your own a few times before. Make it a public place so both of you will be forced to be in control of your emotions and not lose your cool. \n\nAfter that, take your daughter to meet him. Again, make it a public, but fun outing. Park and ice cream or something. You don't have to tell her that he's her dad yet, if you don't want to.\n\nBut I do think you should at least try it out.\n\nIf your daughter searches for him later and finds out that you sent him away, she will be way more hurt by you than she could ever feel towards him.",
            "My mother raised me without my father being in the picture. This was not her choice but his. I grew up constantly being stood up and disappointed by my father and it really, really sucked. That being said, I am so happy and grateful that I found out on my own how much of a deadbeat my dad is. My mom knew how he was but still let him come around. If I had grown up with my mom constantly shielding me from getting hurt by him I would likely resent her for it now and possibly even doubt that what she thought of my dad is true. He may end up being a wonderful father, people CAN change (it's very very rare but it can happen) and for all you know you're going to be keeping Faith away from an awesome dad. Or he might end up being a complete asshole who stops showing up and stops calling in a of couple years. Your daughter will have YOU and that's what is important. If he stops showing up or stops calling, that's when she will appreciate you the most. So coming from a girl who grew up with similar father issues, I would let him try. I would resent you for keeping me from my father later on in life if I was Faith. ",
            "\"Hey Tom, it is great you are telling me you have changed, but lets look at this realistically, change can cover a lot of ground, you could be just about anything by now, and I take my responsibilities as a parent pretty seriously and and don't let men I barely know just walk on in to my daughter's life. So first I'm going to need to spend a bit of time with you working out who you are now before I can work out whether to fight or facilitate your contact with her. This is not me attempting to rekindle \"us\" or any such nonsense, that boat sailed long ago. Because being a single parent and sole provider for a household is an incredibly busy thing,  the times available for this are limited. I can meet you  at (name of public place) at any one of (list of times) or if none of those times are suitable  I can see what's available later on.\"\n\nThen put a private detective on him to see if he's an obvious danger.",
            "Give him one chance. One chance is all he gets. If he fucks up he's out of her life forever. They could develop a wonderful relationship. Faith deserves that chance. ",
            "If I were you I'd Google his name or see if you can find someone (maybe a lawyer) to run a background check on him. Worst case scenario, the check is fake, he's had legal trouble and has no where else to go or is looking to mooch of off you.\n\nEdit: Is he on the birth certificate?",
            "What state do you live in? \n\nI'm a single mother and have been through something similar.  Feel free to message me if you would like! ",
            "Get your butt to a lawyer ASAP!!!  \n\nBased on my state, visitation is NOT your decision.  The sperm donor can go to court and proof paternity.  At this point standard child support and back support is determined by the court.  You will be given a say but the court officially determines child visitation.  Since he has zero relationship with the child it will probably start with once a week supervised visits.  YOU DON'T GET TO SAY NO!\n\nGet some legal advice and stop reacting emotionally.  Get a plan and start protecting your daughter. ",
            "There are a few different levels to this.\n\nFirstly, who is Tom now? Lots of people are selfish assholes at 19-20 and grow into civilised human beings. You haven't seen him today, you don't know what sort of person he is. But to have written that letter, there are better-than-decent odds that he is a better person today than back then. If your only basis for thinking he's going to be a bad dad and abandon her is that he did it at 19, well, that's probably not the best reason for thinking it *given that you have evidence right here in front of you that he has improved himself.* Now, whether he's changed *enough* is a different matter. He could be a *better* person but still not good enough to let into Faith's life. But you can't really judge that without talking to him, and doing so with an open mind.\n\nSecondly, does Tom have a right to see Faith? Probably, since he's the legal father. And thirdly, does Faith have a right to Tom's financial support? Yes, she almost certainly does.\n\nI know some people are saying lawyer up and clam up, and you should certainly discuss this with a lawyer before doing anything else. But the long and the short of it is, Tom does have the ability to establish a legal right to access, Faith does have a right to the money, and your only basis for saying no is a panicked rejection half a decade ago by a dumb teenager. I don't think you will look good legally, never mind anything else, if you don't engage with him constructively and try to fairly assess his fitness to be in Faith's life *today.* You need to reconcile yourself mentally to the idea that, unless he's proven to have a criminal history or abuse allegations you don't know about, he will probably be able to see her sooner or later, and you are going to have to deal with him as a co-parent. \n\nThat means, no matter how legitimately hurt and angry you are about what happened, you have to separate those feelings from what you do today. Get some therapy. Not because you're *wrong* to be angry - you're absolutely right - but because you are going to need some psychological strategies to cope with what you're going to need to do here. Honestly, rightly or wrongly, the courts don't care that this hurt you. The courts only care about whether Tom can be a positive presence for Faith going forward. They expect you to do that too. That's what that \"best interests of the child\" thing is about. So, get some help and start girding yourself for it. It's the only way. You can't magic him back out of your lives, as much as /r/relationships gets a justice boner out of thinking you can.",
            "So, please keep in mind that I'm speaking not as a parent but as a child who was kept from her father for a long time (I'm 24 now, and I do see my father). \nTom did you very wrong, he hurt you very badly. But regardless of that, he is your daughters father, and she didn't make that decision - you did. I can't say if Tom had changed or become a better man, but bottom line is this- He is on your daughters birth certificate, legally he is her father, and if he wants to see her, he has the option to do so. Legally, he can fight you for visitation if he chooses to. For better or worse, this gives you three options. 1. You can ignore him and hope he goes away (doubtful) 2. You can tell him that if he wants to see her he needs a court order. 3. You can talk to him (Alone or with lawyers present) and try to put aside the past and give him an opportunity to be a father. Maybe he will be just as much an asshole as he was then, maybe not. But your daughter isn't going to stop asking where he is, and if you keep her from him, one day she will find out. \n\nI get how you feel, he fucked you over, left you high and dry on your own pregnant at 19. He broke your heart and then went on about his way. I'm not trying to minimize that. But at the end of the day, child support for your daughter is going to make both of your lives better, and having a father in her life may also make her life better. What went on between you and Tom shouldn't mean that Faith gets the short end of the stick. Even if you hate him, don't make Faith hate him unless he earns it.\n\nMy mother didn't meet her dad until she was 16. Her mom wouldn't allow it and her father is kind of an ass. But she always resented her mother for not letting her see him. My mom refused me a relationship with my father for years, and still hates him. She let her anger at him be more important than her child having both parents who loved her.",
            "Do you know his family? What kind of people are they?",
            "I had a similar situation with my daughter and her father. Him and I never dated but did live together (really messed up situation but we were both using each other). When I got pregnant and decided to keep her he basically peaced out. His mother was apart of my pregnancy but he was not. He decided when I was on the way to the hospital to have her that he 100% did not want to be a part of this. So that was that. She has my last name and he's not on the birth certificate. I never contacted him. \n\nWhen she was a year and a half I met someone on a dating site and we started dating. A few weeks later I went on the dating profile to delete it, and there was a message from her father. Now, my number has been the same for 10 years and he was not blocked from my Facebook and we have many mutual friends. Why he messaged me there is a mystery. He asked about her. \n\nFrom there I was extremely hesitant but I decided to do a DNA test to appease him and such. Of course it came back he was the father. He slowly started to come over and see her. \n\nShe's about to turn 4 and he has become a decent father to her. He sees her once a week and they have a blast together. He's still not on the birth certificate and she still has my last name. We have not find through the courts but he gives money once a month for her. \n\nI, personally, have not forgiven him for everything he put me through with the pregnancy and her first year, but I have not denied him from having a relationship with her. \n\nCurrently I am okay with him being on the birth certificate but I want her to still have my last name. \n\nSince your daughter is older maybe you could ask her if she would like to meet her dad? He seems genuinely remorseful and like he is committed to being a part of her life. I suggest you meet him before you let him meet her and discuss things. I don't think you need to go as far as getting a lawyer right away since he seems like he's serious about money and being a part if her life. You first need to take care of the emotional situation before you worry about child support and custody. ",
            "Get a lawyer. Then get a couples counselor. It would be wise to have a mediator help you both through the anger you feel towards him and how he treated you, and what he can expect to have to do to come back from that. Ultimately you two getting along will benefit Faith the most in the future. Plus the counselor can make sure hes committed to continue in her life.\n\nOnce those are done, then he can see her. ",
            "I think people change an awful lot between 18 and 25. And you should give him a chance. ",
            "[deleted]",
            "This isn't about you. This is about Faith and what's best for her. And what's best for Faith is financial support and a chance to know her father. I don't blame you a bit for being pissed. I would actually be somewhere beyond pissed, myself. But that's not going to be productive for Emily. \n\nProceed with caution, but you do owe it to your daughter to proceed. Consult a family law attorney and look into some family counseling, so that you can all three learn how to move forward together. ",
            "That is a really tough situation you are in. Others have given great advice so I don't really have anything to add, however I just wanted to say kudos to you - you sound like an awesome mother and it's really inspiring to read about what you've got yourself through. You rock!",
            "You don't need us. You need an attorney who can tell you what the law is in your state and what your options are. But if you do decide to set up child support payments, do so through the court system so he can't pull any shenanigans later. It has a shady feel to it that he wants to do this kind of thing off the books.",
            "I know you are looking for advice in this situation OP, but I just want to say my hat is off to you for stepping up and being the best parent ever when the father left.  Tears rolled down my face when I read your post imagining all sleepless nights and hard work you've put in.  You are an example to us all of an outstanding human being! ",
            "he owes you money and kids are not cheap. get legal help. ",
            "No matter what else you do, please get child support for your child. ",
            "I don't have any advice as far as dealing with this emotionally, but I do think it could be helpful for you to post on /r/legalAdvice. Best of luck with everything, I hope whatever decision you come to makes you and your daughter happy!",
            "Okay,  so here's my two cents.  You have every right to be mad at him,  but you were both young,  and being a father is a terrifying concept to a young guy. Right now he's trying,  so maybe give him a chance.  That doesn't mean introducing him to faith as her father, or letting him take her for nights,  but maybe let him be introduced as Tom and have dinner in a public place a couple nights a week at first.  Once he's shown to you that he's going to stick to this for a while,  maybe add him playing with her a day or so a week,  and then let him babysit her for an hour or so.  The point and fact is that by doing this slowly it gives him ample time to run before she starts calling him daddy and gets overly attached. But I do think that giving him a chance is in everyone's best interest.  \n\nEdit: words",
            "As someone who did not meet his father until being 36 years old, I can tell you that my mother always felt great resentment that my father did not try to financially provide for his children.\n\nFortunately for me, and unfortunately for her, I did meet my dad when I was 36. He's a great guy. He's a wonderful dad. He's a great role model to me. And I missed him for much of my life.\n\nI sincerely hope you will consider talking directly to Tom and determining his commitment to this. He sounds like he has sincerely turned over a new leaf and regrets his past actions. I believe this shows signs that he would be a great father as he's willing to admit his mistakes and step up to his responsibilities.\n\nGood luck as you decide what to do.",
            "As a single mother for the past 17 years I understand how you feel. I am sure you have sacrificed many times as you must being a single parent. I worked for a family attorney years ago and from what I saw as long as he is not a drug addict or a criminal with a serious record he will get rights.  Your daughter one day will ask you questions and you don't want to be held accountable for keeping her dad away. Make this work on your terms. Go through the courts and make it all official. Voice your concerns and make sure its taken slowly. He is a stranger to her at this point bur if you do this amicably you will have more control. This man made a huge mistake. At least he has come back to rectify it. 17 years and that day will probably never come for my child.  ",
            "[deleted]",
            "First get an attorney and find out what your and Faith's legal status is at this time.\n\nI think you need to think very carefully about separating your hurt from making good decisions about your daughter's future. Five years is a substantial amount of time for people to make major changes in their lives. It's very possible that Tom sincerely regrets his actions and wants to be there for his daughter.\n\nKeep in mind, if you deny him any contact he could go to court to force the issue. The courts won't care that when he was younger he broke your heart. What they will care about is that he is the bio-father and what his current status is, his ability to provide etc. and barring any concerns may well award his visitation etc..\n\nYou have the opportunity now, if what he is saying is true, to control the pace and circumstances of this father and daughter meeting. \n\nA good therapist might help you do that. I know these things cost money so look into community mental health programs or family programs. Perhaps you could even make his paying for a therapist to handle these transitions as part of your conditions?\n\nTom may have hurt your feelings but he might never hurt hers.\n\nLooking forward (you think the easy phase of parenting has arrived...it hasn't...my eldest is almost 40...you have a lot on your plate still) should you keep them apart Tom may well arrive, when say she turns eighteen, introduce himself and make you the bad guy in all this. I don't think you'd want that either.\n\nAgain, I urge you to think about setting some reasonable goals with the help of professionals. Along the way you will have a chance to observe and assess Tom as will a therapist. If there are any issues that might suggest that Tom is a danger physically or emotionally to Faith then you can take the information to a lawyer. If however you see he has matured and would be a good father let them know each other. \n\nYour hurt isn't the issue here...I know that sounds cold but what is most important here is Faith and her future.",
            "How does he know your address and daughter's name?",
            "I see this from multiple similar angles. \n\nI was the child in a similar situation. My mother toward the end of high school was dating a jock who looked like he was going to get a full ride to college. They broke up before he knew she was pregnant, when he did find out she claimed it was someone else's. The other man is on my birth certificate and I grew up thinking this other person was my dad. At 31 I found out the truth, after a whole childhood and young adulthood and having 3 kids of my own, my mom finally told me. Then I meet this man, my real father, who breaks down into a sobbing mess the first time we meet, apologizing, wracked with guilt. I think he still is to this day. But I had this void my whole life, I had a dad on paper but we never connected and at the end of the day I was an abandoned child. When I met my biological father everything clicked. My manerisms, my sense of humor, that I finally had someone I looked like in my family. I wouldn't ever deny that of a child. EVER. Even if their father was a piece of crap, I'd still find some way for them (within reason) to be connected to that person and be able to have their own relationship separate from mine and free from all the debris of that.\n\nI was also the \"step dad\" in a similar situation. My ex-girlfriend met a man, got married, got pregnant, and then left him because he'd knocked up a couple of other women and abused her. We got back together, she divorced him and I stepped into the father role. However, we were always honest with our son about the fact that I wasn't his biological father, even though I loved him with all of my heart. We did our best to keep him connected to the bio-dad's family through a grandfather, but the bio-dad never had any visitation, never sent a card, no money, never called us to see how he was, nothing; Until our son was 15 or 16 I think. Then they made contact over facebook and my son lit up seeing brothers and sisters and a man who looked like him. It wasn't comfortable for me, but it was still the right thing to do. I don't have to like his biological father, my wife certainly does not. But at the same time I can't deny them their own opportunity at a relationship and hope that the bio-dad has matured, but even if he hasn't then our son gets to learn that for himself, as hard of a lesson as that can be. We can't always save our children from every disappointment.",
            "Do it. Don't invite him over for coffee and to meet his daughter, not right off the bat, but you can't let your anger towards him affect her chance to have a relationship with her father. If it makes you feel any better, I got pregnant at 18 and my son's father pulled a similar thing once our son was 11, minus the money, lol. But, he really HAD changed, and he's a great dad. You can't expect him to be the same person he was at 20. He's come to you in a very sensitive way, imo, apologized to you for what he did, showed remorse, and respects your (probable) desire to move slowly with this. He's willing to do what it takes for his daughter, and that right there is a sign of a good parent. Give him a chance. Meet up with him, talk on the phone, get over your own unresolved feelings over the issue, send him some pictures and see where it goes. Get comfortable with him before you decide to let him into her life. She doesn't have to know that any of this process is going on until you're comfortable with her knowing. My son's father and I exchanged letters a few times before I even told me son that I'd been speaking with his father. Move at your own pace, but don't deny your daughter this chance. Also, don't cash that check until you've established open communication with him and trust his intentions are true. ",
            "I'd suggest meeting up with him for lunch one day, only the 2 of you, to see if he is serious and see what he has to say before making up your mind because you don't know what kind of person he is now he could have changed a lot",
            "I keep seeing replies from both aspects of the parents... But i haven't seen any where the daughter is concerned.. \n\nHere's another idea to think about. I'm a fatherless daughter. As in i grew up not knowing my father, until i was about 10. Hes a jerk. But i found that out on my own, my mom did keep him away but i begged to meet him. She did what she felt was best and i am so thankful for that. I got to come to terms with who my father is on my own time. \nWhat do you think Faith would want down the road? Maybe now isn't the best time.... But perhaps some time later?\nAs for the letter/check and such... \nI often times saw my mom grapple with having to deal with my father when it came to me.. I could see it wasn't easy for her, which only adds to my respect for her. Sort out how you're feeling.. As it sounds like youre coming from a place of anger (utterly and completely rightfully so)...that may not be what is needed for the deciding factor. \n\nSorry if this seems jumbled it's way early.. ",
            "I think it it your duty towards your daughter to at least give him a chance. While he absolutely treated you horribly, he might have genuinely changed and his effort seems sincere. If you keep him out of your daughter's life and she goes looking for him in 15 years and discovers he wanted to be a part of her life but you kept him away, she will resent you for it. You might not like it, but for her sake (and not because of the money) you should probably try. Best of luck!",
            "Do not cash the check. Take it, the letter, and any proof that you have of the threats from when you were pregnant to a lawyer before you do anything. Get their advice before you act. ",
            "Having the child support payments due to you for the past 4 years and hospital expenses and future child support is quite a good deal if he seems to have changed. Granted, you know him and not anyone here and he could very well be a sociopath being sweet for a short while only to have a Jekyll and Hyde moment once things get tough. There are a couple of things you need to take into consideration. Having extra money means you can have a more comfortable life yourself and be able to provide for your daughter some things that you might not have otherwise been able to provide. In addition to your daughter having a man in her life, having a man in your life might be good for you if you totally don't despise the biological dad. I would suggest you to meet with Tom without Faith and spend time with him. In addition to the interest of your daughter, you need to take into consideration your interest and if you can handle Tom being in your life. Who knows you might like the person that you see. People can change and mature a lot. Take it very slow. Spend time with Tom before deciding if you want to let him be a part of your life or your daughter's. If you want to keep the money and not see Tom. Tell him that you wish to keep the $3,000 which is for Faith. However, you don't feel it is in your or Faith's interest for him to come back into both your lives and that if he wishes for you to return the cheque, you would comply. He might be a different person now but that is not a pardon for his previous actions. I would advise you to see him. It might be a chance for you to have a complete family. Heck, you might even end up liking the new person you see. Give it a shot.",
            "\"The thought of dropping her off at his house where I don't have access to her makes me want to scream and run away.\"\n\nIs that maybe because you've made your entire life about your daughter? Which is admirable but could cloud your judgement in this situation. You should speak with a family lawyer right away to figure out a type of custody agreement you're okay with. ",
            "Well, I am not going to say some sort of crap like time heals all wounds. Time heals SOME wounds, and I certainly understand being very protective of your child. Very protective, because I have had my own ups and downs through these things that I don't really want to share with Reddit. \n\nI will say that the older I have gotten the more I understand how human emotions can change. Love can change to hate. Anger can change to acceptance. Sadness can change to strength. Immaturity can change to rational thought. Fear can change to confidence. All of these things, even in the extremes, have happened to me in my life.  Denying that may happen is denying basic human nature. \n\nNow, I say they COULD happen, not that they will. Unfortunately, if it were me I would have to shove the fear aside, sit down, and draw up a plan. A roadmap of how I would be able to navigate the waters. Leave it, revise it a  week later, and add any additional thoughts you had. My plan would have to be as logically fool proof as I could make it to protect my little girl.\n\nShare it with friends and family. Get a buy in from your support system, and see what they think. It will not work out exactly the way you want (never does), but I think you have a responsibility and obligation to try. It is going to be hard. But, I think it is the right thing to do. \n\nHe could have matured since college, and frankly if he was a meatball in college it was probably best he was not in your daughters life then. He was not ready, which is exactly what he said. Not his fault. He was not old enough to be ready. You could not have magically made him so. That is why kids should not have kids. It is time for you to own up to your mistakes (not that your daughter is a mistake, but getting preggo that young is not recommended for obvious reasons) as well as him. Now the question is if you are mature enough to navigate the waters to create a happy, healthy two parent environment for your child?",
            "Maybe it's best that you do take the money, because it's the least he could have done/is willing to do.  Your acceptance of this first check doesn't obligate you to anything, ANYTHING at all with him.  His note backs this up.  And then, if you'd like to take him up on his promise to provide more child support, I'd say that you should take it...and you need to remember that this money doesn't yet guarantee him ANY visitation, but that you are accepting what has been owed you for years.\n\nI have never been in your position and I cannot even imagine being there, so please take me advice with s huge grain of salt.  That being said, the basics (meaning the heartless) part of this is that he did father this child; he does owe child support; and he needs to pay enough to catch up on whatever total he owes over the time he left you alone.  He needs to pay it with no questions asked and with no interaction with either you or your child.  I think that now that he's acknowledging his child (about time), this is the first place to start for you.  Accept the money THAT HE IS WILLING TO PROVIDE (sorry for the caps, but I can see this guy dodging anything he's not legally required to give) and then put him on the spot to set up (and confirm, legally) the future payments that he will be required to make for the next 15 or so years.  \n\nIf, during that time, he wants to see \"his child\", he can do so when his payments are up to date.  And maybe not until he has at least a year of regular, legit payments under his belt.\n\nDo not give him any leniency at all, OP.  He hasn't earned it either then or now.\n\n",
            ">I think she deserves to have a GOOD daddy. I just don't think Tom is. I think Faith is better off having no dad than a bad or half assed one.\n\nI think you should at least give him a chance so you can decide this. He hasn't shown you whether or not he can be a good father since he's been completely absent. I know you're upset but I think you should at least give him an opportunity to prove himself before you decide to not let him.",
            "Not sure this has been mentioned, but keep in mind that sometimes, a meddling parent can send a letter for their irresponsible children, in hopes of having access to a grand-child. While this is unlikely, I just thought the sub should consider that he may have little (someone wrote it for him) to nothing (wrote it without his knowledge) to do with this request.\n\n",
            "You have to look at what is in the best interest of your child. I know that you may be pissed at him (rightfully so), but for your daughter to have her father in her life, can be flurry good for her. \n\nI would suggest letting him jump in and skate to father of the year. However be open minded. Meet with him to see if he has changed. People don't change, but people do act stupid. Was he always a good person before you got pregnant? \n\nPerhaps he acted foolishly and not is trying to make things right. You don't owe him anything, however you do owe it to your daughter to have a (good) father in her life and if, after you have vetted him, you think he would be good for her, it may be the best decision you will ever make.\n\nNot sure about your romantic situation, but perhaps you two could make it work? Doubtful as there is clearly issues over the past 6 years, however, if he has truly changed, you may see yourself drawn to him, as he is the father of your child. \n\nNobody on reddit has perfect advice but if you take one thing away, it should be to be open minded and tread slowly. \n\nAll in all, this is good news and you should take it that way. ",
            "Your daughter deserves to know her real father.\n\nGive him a chance.  Take it as slow as you and your daughter need.\n\nDo not talk down about her father.  No matter how terrible he was to you, it does not matter.  This man is her father and the impression she has of him will stick with her forever.\n\nHave him explain to her his mistakes.  This will teach her a valuable lesson over time.  She can see the power of forgiveness.\n\nThe pictures at first idea is a great start.\n\nEdit: I wouldn't worry about losing custody.  He hasn't been in her life for 4+ years.  The court won't just hand her over to him without MUCH investigation and consideration.  If it ever gets to court, they'd most likely put him on a progressive scale of visitation to see if its something he can maintain.  The court will very much keep in mind that this man is a stranger to this little girl.  Don't worry.  The system can be very messed up sometimes, but even I as a divorced father can see that they usually get it right when it comes to a child's best interest.",
            "> I've been saying Mommy doesn't know where Daddy is (true until now) and she doesn't have a father because Daddy wasn't ready to be one when she was born. Maybe that's the wrong answer but I am doing my absolute best.\n\nBefore I say anything else, I want to say that this is a very good thing to say to your daughter. I think that it's important for children to learn these things early as possible. Kids aren't stupid and many adults don't get that children are fully capable of grasping these kinds of concepts. You're doing a really good job and I'm 100% positive that if you continue to treat her with the same respect you give other adults, she will grow up to be one of the most well-rounded, mature people you'll ever have met.\n\nTo your situation, this is really difficult. Honestly, there is *not* one correct answer. Anything you do could have good and bad in the end. I think, in my own opinion, you should meet up with Tom (alone, not with Faith, but also in a public place) and talk to him about exactly what his intentions are at this point in his life, what made him suddenly change his mind, etc.\n\nBut, I think you should *definitely* tell him how you feel about how he's only coming for the easier parts of being a parent. How you don't think it's fair that he gets to join in on her life only after you struggled for 4 years to raise a screaming crying baby. Your job at this point is to gauge his reaction. Is he going to respond with understanding, empathy, and a guilt-ridden conscience? Or is he going to be arrogant and self-important?\n\nHere's what I believe; if he responds by defending himself, you say *hell no* and drop the $3,000 he gave you in his lap and leave. The only way to really believe him (at this point at least) is to see him become humble, to see him say that he was wrong, he is regretful, etc. He has to say what he said in that letter, but in person, to your face. You'll be able to decide if he's worth keeping around after that.\n\nIf, you do decide to let him meet Faith, and maybe have him become a dad to her, you should set some rules for him before you do. \"I can't start off by letting you see her once a week, or even alone. I will only let you see her if I'm there, and ____ times in (whatever timespan you prefer). At this point, I'm thankful for the money you've given us, but I don't want to receive any money until I'm certain that this is the best thing for Faith. We can set up a time for you to meet her and I want to see what she says or does when we tell her who you are to her.\"\n\nThat's another thing I think is important; let Faith decide if she's happy to meet him or if her first response is \"where have you been\" or something like that. She might be 4 but I think her reaction will give you the best idea of how to handle this. When you're alone with her (after meeting Tom) then ask her if she wants to continue hanging out with him, or if she'd rather not see him.\n\nBest of luck to you. I truly hope everything works out for the best, *whatever* you decide to do. Just remember, that no matter what you do, I think you'll be making the correct decision. Use your intuition and I think you'll be fine.",
            "I am late to the game and you probably won't see this.  But, I'm going to ask you to stop, take some deep breaths, and search your heart. \n\nMy oldest daughter was rejected by her father and he has never been involved in  her life. She's in her 20s now and this has caused her enormous heartache. Knowing that your father wants nothing to do with you changes who you are.  It's a sadness I'll take to my grave, but it's even worse for my daughter.\n\nPlease think this over carefully, and make the best interests of your daughter a priority over your feelings.  You have every right to be outraged and afraid, his behavior back then was deplorable. But if you spend some time getting to know him as he is now, you'll be in a better position to judge just how much he's changed.  If he seems sincere, you can slowly build up her exposure to him and perhaps over time they'll end up with a good relationship.  \n\nA relationship with her father, with his warts and all, can and likely would be better than no relationship at all. Living with the knowledge that your father didn't want you is soul-crushing.",
            "Being a parent is one of the most confusing times. There is no right or wrong answer for something like this. Of course every good parent is going to want to do what is in the best interests for the children. \n\nI had 3 children in my first marriage. After things didn't work out with their father and I, he still wanted to see the kids. I have always felt that children should have two parents in their life, so despite my feelings I allowed them to see their father. I didn't want my kids to resent me because I kept them away from their father, even though I did it with the best intentions. He would only see them maybe twice a year and over time the kids pretty much seen his nastier side as well. I have always made it well known to my kids that I didn't think that he is a good father and that I really don't like them to go and see him. Over time they finally admitted that I was right and that they didn't want to see him anymore. \n\nPeople can change. While I haven't seen it with others that I know, I have seen it in myself. I am night and day if compared to the teenage me. \n\nMaybe just set up a time for you to meet up with him for coffee (without your daughter) so that you can judge what to do next. Maybe do that for however long you need. If it takes 2 months of going for coffee with him before you make up your mind if he should be in your daughter's life, then so be it. If he really does want in his daughter's life and is willing to go the distance, then he will understand his past mistakes and own up to them. He will also understand why you are so hesitant as well. \n\nI hope that everything works out for you the way that it should. Good luck. ",
            "OP, thank you for posting this.  Faith's money should go into a CD for her college.  Any other child support is up to you, as long as dickhead Tom agrees that he will not have access to your child at all.  Not having a father is nothing compared to having a father who breaks promises and disappears.  This sounds cynical, but I just don't believe people fundamentally change THAT much from college-aged to now late twenties.  Tom is still the same guy who left you to have a child alone.  I'm sure you don't want him to color your child's life the way he has colored yours.  ",
            "As most people have said. Do what is best for your child. Living without a father will cause her many more issues than you or her need. A father figure is helpful in the development of most children. \n\nThe money will help make sure she is supported and make sure she gets all her needs taken care of. \n\nHe is willing to admit he is a dumbass, and that is proper, he was a dumbass. But people grow and he probably isn't anywhere close to the person you dated for 8 months. \n\nI would personally suggest to VERY Slowly let him in your daughter's life. Despite your feelings of hatred and abandonment that he gave you, in the end it will help you and your daughter to have child support/a father figure in her life (when that time comes), and give your daughter the best possible chance in life. \n\nThe worst that could happen is he is still a dumbass, doesn't see her often and pays for many things she needs in the future (like a college fund). ",
            "Judging from the letter (albeit, his past actions contradict it), he has stated that he will go as slow as YOU like in being reintroduced to your daughter.  While he wants to be a part of Faith's life, I disagree with your statement that he just wants to waltz back in; from the letter (all I have to go on), he is giving you the power to choose the pace this process takes. \n\nTough decision either way, but you hold the power in this situation and can dictate the process.  Best of luck.",
            "Tom is growing up.   I think you have to give him a shot at proving himself, which doesn't mean bringing him into her life right away.  He needs to show that he's dedicated to this and that it's not for selfish reasons.  \n\nI don't think he's walking in like nothing happened -- he made it very clear that he realizes his mistakes.\n\nAt the end of the day, do what you think is best for the little girl though.  Good luck!",
            "I'm a single dad and mom couldn't handle it. I have had sole custody of my autistic son for the last 3 years. She loves the kid, sees him 2 weeks/year on holidays. \n\nIn my case, I try to encourage the kid's mom to see him. \n\nHowever, she has never threatened me nor my son of anything.\n\nPeople here are telling you that people change. I am telling you that if at any point in life he has been threatening, it can happen again. \n\nSure, people change, but he has it in him.\n\nYou are and have been the only support for the child, and sometimes, it is better not to exchange money for abuse. In some cases, money is too expensive.\n\nIn the end, OP, you stand alone to make your decisions. So far, all of your decisions regarding Faith were good ones.\n\nTrust your guts OP. Nothing else matters, and certainly not the money.\n\nYou've got this, as always.\n",
            "hey, \n\ni grew up without my bio dad because my mother despised his choices. true he didn't make good choices but she made sure there was a gulf between us, and by extension a large part of my family. i later connected with my dad and got the other side of the story. what I found out was that he wanted to be a part of my life but couldn't stand the constant pain and berating on behalf of my mother, he couldn't stand knowing he had children whose lives he wanted to be a part of but she would vehemently deny his ability to do so. in turn my father simply numbed himself to the reality that he had children. completely disconnected from that part of himself and never learned to be a parent to us. my dad came to my college graduation. the only significant event of my life he was present for. when I saw him there I was completely floored, like all of those emotions of being an abandoned child and I just wanted to run to him and spend all my time with him. unfortunately we couldn't maintain a relationship as I was too resentful of his actions and he was too detached from parenting, all i can say is it destroyed me. It causes a lot of grief to feel like you come from no where. Like the people who brought you into this world don't actually care if you're alive or dead. This dude cares. While I would recommend being cautious I think you need to test his sincerity for a long while before introducing them. You need to do the leg work to find out the type of man he is today. He says he is willing to go as slow as you want so what I would suggest is coming up with a payment plan, he has to consistently demonstrate the financial commitment without expectation of a relationship while you use the time to suss out his character and also his ability to stay involved and do the leg work. If he can demonstrate over a years time his sincerity of keeping his commitments and staying in contact with you within your boundaries then you can slowly introduce him to his daughter. If you flat out reject him now he may very well just table the idea forever and never learn to be a part of her life. But I can guarantee you she will grow up and want to know him. You can lay the ground work now for that to be a successful relationship or you can deny the possibility by forcing estrangement for the next 15 years. It is your choice. Just know at some point she will want a relationship with him, and she'll want that until she decides of her own accord that his character is not worthy of having her a part of her life. But before she gets a chance to discover that she will very much seek out a relationship with him at some point. You have to take the long view into account while thinking through the possibilities and putting as many safe guards in place as possible. I'm sure it sucks to be the primary parent (responsible for all the non-fun) while someone else get's to play holiday dad due to the restricted access. But she will be grateful for that and if she doesn't get it she will try to later. ",
            "Here is what I think may be in Faith's best interest. There is NO WAY IN HELL that you'd be just dropping her off at his house for at least the four years that he has been absent. And I don't think any judge in the world would grant it considering the circumstances and the conversation between you and the father. I do think that it would honestly be in her best interest to have the chance to meet him at least. Under your direct supervision.  And maybe he has had a change of heart. Does that mean you should just forgive and forget the absence for the last almost 5 years? Definitely not. It isn't fair to either of you. And you could also let him know that even the slightest screw up and you'll keep his toxic behavior away from her forever. The damage is done as far as her wondering about a Dad or Father figure for so long. So there is a slight chance to start repairing that damage. Kids are smart. If he is a piece if shit then she will pick up on it. I'd make it VERY clear that if he plans to enter her life that you'll press for everything you can squeeze from him financially. Im not siding with this guy at all. To me...the guys who can make a baby and then run when its time for responsibility are some of the worst pieces of shit there are in the world. But as far as your daughter goes....until/unless you let her meet her father she is always going to wonder about him. Even if you find someone who is her Dad...she will still always wonder about her father. I know there are gna be tons of people on this sub who aren't gonna agree with me. They'll say to cut him out forever, get her tons and tons of therapy, maybe some medication. But honestly sometimes that just isn't the correct answer",
            "Nothing can change the fact that he is your daughter's father.\n\nBut it's going to take a lot of work and time before he could ever be considered her dad.",
            "OP, I think it's important to at least try to see if he has changed and deserves to know your daughter. If he has, do not let his past actions and your resentment of them keep Faith from knowing her father. As people have said, talk to a lawyer, then talk to him.\n\nThat's not really what I came to say, though. From what many people are saying, lawyers and armchair lawyers alike, if he really wants to he will gain visitation of Faith no matter what. If/when this happens, please do not let your opinion of him alter how you speak of him to Faith. Don't bad mouth him or tell her all of the bad things he's done. The explanation of why he was absent can wait until she's older and can really understand it. Speaking from experience, loving two parents who hate each other and express that hate regularly is one of the most confusing and painful things. Keep your opinion of him to yourself and if she asks questions about the past do your best (as you have been with \"he wasn't ready to be a dad\") to explain it without anger. I'm sure you know this because you sound like an amazing mom, but you hate him so much. That emotion can be easily picked up on by children, and it hurts. \n\nBest of luck with everything. ",
            "You are right to be pissed, but consider what is best for your child. Ideas like \"he skipped the hard part\" don't help Faith *at all*. Just because you were frazzled with early motherhood, doesn't mean she shouldn't have the opportunity to have her father in her life.\n\nI would say let him meet her, spend some supervised time with her, and then see how things go.\n\nThe issue isn't the pain that Tom caused you in the past, the issue is whether or not his presence benefits your (and his) daughter *now*.",
            "You have every right to be angry but I do think this letter and money is a sign that Tom has grown up significantly and just might be able to be a good support for you.  I grew up without a farther figure so I'm biased but I urge you to consider the possibility that this could actually work. ",
            "You keep saying \"I\" and talking about what he did to \"you\". It's not about \"you\". You are sounding like how a lot of other angry and bitter females talk women they can't or haven't forgiven their child's father for hurting \"them\". You have to understand, you were both still school aged. I'm sure your baby made you more mature. He didn't mature until late. It sounds like he admitted it by telling you about he's \"now\" around some good people. You took a chance keeping your child which was a gamble and wasn't guaranteed to work. Yet you took that risk. You owe it to your daughter to \"try\" to let her father. One day she will probably ask why her dad wasn't there. Are you going to tell her the story about he tried to reach out? Or are you going to tell her a lie? You don't want your daughter sitting in a counselor office or on a talk show stage crying about her dad didn't care. If you don't give him a chance to see if he will be in her life. She will grow up in life thinking her did \"never\" tried to be in her life.",
            "Economic: Your child has a right to support from her father.  It is not for you to decide to tear up the check or deny her that support.  If it was a neutral third party who was making the decision as to what was best for Faith, what do you think they would do?  They would make the father honor support obligations.\n\nParental: A child deserves the opportunity to know both of their parents unless there are powerful reasons otherwise (drug use, violence, etc.).  As a conceptual matter, you do not owe Tom any sort of relationship, friendship, forgiveness, etc., but are you prepared to deny your daughter those things because of the way you were treated?  People change.  \n\nLegal: If he is going to be a part of Faith's life, it should be made official.  Birth certificate, visitation/custody arrangement, etc.  Do some homework.  Is his place child friendly?  Supervised or non-supervised?  What does he do for a living?  Criminal record.  Etc.  If you try to work this out informally it can save everyone a LOT of money.  Most states have calculators to determine support.  Reach an agreement on past-due support and come up with a plan.  Keep in mind that the support obligation really has nothing to do with the right to see one's child, so don't think of this as \"he needs to pay or he can't see Faith\" scenario.\n\nPersonal: Holding a grudge is like taking poison and thinking that the other person will die.  I realize what a lonely nightmare this must have been, but don't you deserve peace?  If not forgiveness, perhaps some level of understanding and acceptance.  Remember, you had a choice to be a mother, he didn't have a choice about becoming a father (you made that choice for him).  He reacted in about the most unproductive/irresponsible/disappointing way possible, but people can change and what level of interaction with him is best for your daughter?  ",
            "This sucks. So sorry.\n\nBut I think when we choose have kids we need to make sacrifices to make them as good as a life as possible.  In my opinion (after getting a lawyer and setting up official child support) you should explore the possibility of introducing him to her life.  Its an unfair sacrifice for you, but it might be whats best for her.  You don't have to forgive him or be his friend, but in your shoes I would try and give him a chance for your daughters sake.\n\nAnd for yourself: get out and date again!  Start living for yourself as well.  If you are happy and have your needs fulfilled you will be a better mom.\n",
            "The way I see it, you decided to make him a father by keeping the child. His reaction was terrible but he was probably in panic since he actually had no choice in the matter. Since the child exists, you have a right to child support, he has a right to meet the kid and the kid has a right to two parents.\n\nUnless he's a terrible, terrible person right now it will probably be better for your daughter to have a father in the picture. It will be unpleasant for YOU to have to deal with him, especially if you keep focusing on how unfair this is towards you, but that's nothing to do with your child's best interest. Also I guess later in life it might be nice for her to e.g. have the right to inherit him.\n\nSo, find out your rights, find out if he's a terrible person (a junkie or something, I am not even talking about whether you personally like him because that is not the definition of whether someone is a good person), but don't prevent your daughter from having a father just because \"I put in all the work omg so unfair\". You need to remove your own anger from the equation.",
            "It's not Faith's money. It's your money. You've paid all of her bills- rent, electricity, diapers, food, toys, clothing, medical care, etc. up to this point. Sorry, but that annoys me. \n\nAnd unless there was an initial order for him to pay support, there's no back child support (at least in my states), so the check is kind of a bonus. As much as it sucks, I'm pretty sure you don't have any choice in letting him see her.",
            "It's clear that there is a high level of resentment towards Tom that you feel. It doesn't take a therapist to see that, but I'm sure that it would help to talk to one.\n\nUltimately, regardless of how you feel about Tom, you probably won't say no to his money. You and your daughter deserve that money, and much more.\n\nComing to terms with the notion of having a relationship with Tom (obviously not a romantic one, but a relationship as parents) while you harbor serious resentment is beyond what we as people, with human emotions and feelings, are capable of without some seriously hard work and willpower.\n\nYour love for your daughter will prevail over your hate for Tom. Your daughter will grow up to recognize and appreciate the strength it took for you to cast your feelings aside for her sake.\n\nYou're entitled to feel angry, and you're entitled to express that to Tom. As much as possible, so long as you shield your Daughter from  experiencing those feelings, then there is no reason that can't be a healthy output right? Perhaps a trained therapist would know better.",
            "While my situation is different, I completely understand the sentiment behind your words. I have full custody too and my ex has visitation. It is frustrating that he gets to show up and be \"go to the zoo and drop the kid back off\" Dad, but never \"up all night with a crying infant\" dad or \"worrying that his job is going to be in jeopardy because the kid is sick again\" dad. It's not fair and it's not going to be. And it does make me angry. \n\nHere's the big however- even if he's not stepping up to the plate as a dedicated parent, I think any time that my kid gets to spend time with his dad in a positive way is worth him not being there at all. You are very correct in your instincts to be wary of this guy right now, but if there's the chance he can work his way into being a positive influence in your child's life, I think it warrants an investigation. \n\nI wouldn't let them meet right now, but there are things he could do to prove that he means what he says. Establishing child support would be the biggest right now. Helping with some of her needs (food/clothes/school supplies) could also be in the cards. Reading some parenting books could be another. If it gets this far, going to see a family therapist with you to discuss if and how to introduce him to his daughter would be another. \n\nI can't speak for you, but for me there will always be anger toward my ex that I went through the toughest time- the baby stage- completely alone. And that parenting will always fall on me disproportionately. It's not fair, but it's a part of putting your child first, like you've done so excellently already. ",
            "Definitely talk to a lawyer first and solidify full LEGAL custody so you don't get a challenge there.  Have him pay!\n\nThen, take the child support for a while.  If he keeps paying it consistently over a period of, let's say, 6 months -- get a babysitter and go see him by yourself.  Interview him.  See where he's at.  Whether what he's saying in his letter is real or not.  And by all means tell him what you think and your feelings about how he left.\n\nIf that goes well, and he seems genuine and apologetic, do a supervised visit with Faith.  See how he interacts with her.  You don't have to jump right to solo time.  Do lots of supervised visits before you leave her with him solo.\n\nAbove all make sure you're comfortable with it.  You may hate him, but you're certainly not alone in that -- there are millions of single mothers out there who hate the fathers of their children, and vice versa.  This isn't about you.  This is about you trying to figure out whether you can provide a safe and healthy avenue for your child to see her father.  And, in terms of him being involved in the hard work of taking care of an infant -- well the sad reality is that in previous generations men didn't help with raising young children anyway, and many still don't even today, even if they are around.  I know it's been 4 long years but there are many more years to come that have their own struggles.  Someone once told me parenting doesn't get easier, it just gets different.  Different ages, different challenges.  So, if he wants to help -- take the help.  But give him a piece of your mind first!",
            "I'm gonna give you a little tough love, because everyone else is living in fairy tale land telling you what you want to hear\n\nIf you're in the states, while you may want to keep him from his daughter, you very likely don't get any say in it. Barring extenuating circumstances, if he wants custody, he can sue and will probably get it (visitation rights, not likely full custody). Maybe you can talk to him and explain your reasoning, and he may be willing to give you time and earn your trust before pushing anything, but ultimately it's not going to be your call to make.\n\nFurthermore, this may be hard to hear but do you really want to keep him away because you think he will be a negative influence on your daughter, or because you think it's unfair he didn't have to put in the work? Don't be vindictive. His actions show he's changed, at least for now. If you don't believe that's permanent, then tell him it's a possibility for the future but you need more time. He sounds like he may accept that. But if he's really trying to turn his life around, for both his and your daughter's sake don't be vindictive. You don't have to forgive him, though, but it may not be the best choice to keep him from her.",
            "Honestly, it sounds like he made a shitty life choice, and he wants to fix that. He isn't asking to walk back into her life like nothing happened. He is asking to support her, pay child support, including backpay for child support he should have been paying all along, and to form a relationship with her *at a pace entirely controlled by you.* You will, of course, do what you want. I, however, think he sounds like a stand up *human.* Like all humans, he is deeply flawed, and he has made some serious mistakes. The way he treated you was a mistake. The way he treated his relationship to Faith was a mistake. He, however, knows that and is trying to make up for that. By all means, screen him! I think, however, you would be doing Faith a disservice if you didn't at least give him a chance, and it's a disservice she may blame you for one day.  ",
            "My dad left while my mom was pregnant and I never saw him until I was 16. It turns out he tried to get in contact and involved when I was 3 years old, but my mom shot him down because she did not want him involved. I SEVERELY resent her for it. At 16 i found him online and contacted him, and he told me what happened. I then confronted my mom about it and she confirmed he'd tried to get involved several times, but she kept saying no (he did pay child support however, i also did not know this). I hate that she took away my chance of having a dad just because she was mad over their breakup. I went 13 years without seeing him when he wanted to desperately and was paying child support. I later found out there was even a court case about it where he tried to get access but they said no too because he hadn't been there for the previous 3 years! I regularly meet up with my dad now for coffee and catchups, and I haven't spoken to my mom once since leaving for uni. OP do NOT ruin your daughters chance at a relationship with her dad because you're upset with him. Think of her first.",
            "As someone who's father peaced before I was born, and then spent 20 years of my life in court with my mom over child support- let your daughter have a relationship with her father if he wants one. I will never have a relationship with mine, and I will never forgive my mother for the hatred she has that got taken out on me, the years of her talking on the phone with lawyers I had to listen to, and the literal lifetime battle the two of them spent fighting against each other with the guise that it was \"for\" me. \n\nI'll never forget my friends in 2nd grade- I thought they were shunning me from the group, but they were excluding me because they didn't want me to feel bad that I couldn't take part in the daddy-daughter \"Indian princesses\" camping trip they were going on.\n\nIf your daughters father is that bad of a person, your daughter will realize it on her own, but let that be something she chooses, don't choose it for her.\n\nI've spent my whole life finding fake dads in mentors, and no matter how great they are, none of them are actually my dad.",
            "Tom's letter sounded sincere, and people DO change a lot throughout their early 20s. Think about how Faith might feel when she gets older and finds out you kept her from her father when he tried to reach out and make up for what he'd done before? I don't think she would be happy about it. He's her father, for better or worse, and I think Faith deserves the chance to know him, even if he doesn't deserve the chance to know her.",
            "In my opinion, you're acting a little too much on your emotion instead of thinking clearly. I understand that you don't want your daughter to get hurt but you're only going to hurt her more in the future when she finds out that you're the one that kept her father away from her (if you decide to do that anyway) Tom was a huge jerk for what he did five years ago but you don't know how much he'a changed since then. He mentioned that he stopped hanging out with college jocks and started hanging out with better people and let me tell you that being surrounded by the right kind of people will definitely help change a person. You keep bringing up how hard it was while she was an infant and that she's so well-behaved and innocent now (I congratulate you for doing a great job for that by the way) but Tom doesn't know any of that and it's wrong to assume that he's aware of how behaved or not his daughter is. For all he knows, he might think she likes to run around in the mud and sing at the top of her lungs the whole day. You can't assume that he chose a convenient time to come into her life because he's completely unaware of what she's like. I understand that you have your reasons to want to stay away and hate him but don't let that get in the way of Faith and her biological father possibly having a really good relationship with her. I'm a psychology major and I've seen the effects of not knowing who a person's father is or not having a relationship with them can have. Everyone deserves a chance to redeem themselves and every parent should be given a chance to have a positive impact on their children's lives. Get help from a lawyer if you want but don't deny Faith a chance to have a positive relationship with her biological father, especially now that he's trying. I guarantee it'll bite you in the ass in the future when she starts searching for him on her own and finds out you were the one that got in the way. Best of luck to you, OP!",
            "OP, you're bitter and mad. These are two *perfectly* understandable reactions to have in this situation. BUT, you absolutely cannot pass on that attitude to your daughter about her father. You know those girls who people always say have daddy issues? This is where it starts. You have a unique opportunity to let you daughter have access to her father. Take it. It doesn't mean that he immediately have complete access. Go slow. But let him be a father.\n\n>But am I right to take the money and not give Tom any access to my daughter?\n\nThe law won't allow this.",
            "I grew up with a father who was nothing more than a presence in the home. There was no love or emotional security from him. Just because a father is present doesnt make him a parent. If this man truly wants a relationship with his daughter and can be a positive presence in her life she deserves to have that. He wasnt emotionally or mentally ready to be a father when you got pregnant. He has obviously grown up and wants to be part of her life now. They need to be introduced and need time to get to know one another. Seek out legal advice so you can be well informed. I did chuckle when you said the baby years were hard and now its easy. My daughter is 18 and I thought the baby years were a breeze. Wait till your little one gets older. You dont know what hard is lol.",
            "It's been 5 years. Let her have a father. Yes, you hate him. But he is ready now and late is better than never. He isn't trying to waltz in when it's easy, he just finally realized what he did and is trying to make baby steps to repair the damage. Get over your relationship with him and let your daughter have her dad.",
            "Do not contact him.  Do not cash the check.  Get a lawyer pronto.",
            "This situation absolutely sucks and I feel terrible for you. It pisses me off as well that parents think that they can just walk in and out of a child's life like this. He sounds like an asshole. You have every right to be pissed off. I would be if I were you too. It sucks that he didn't sign over his parental rights when he decided to abandon his child. Then you wouldn't have to worry about this.\n\nI think in this case, since he says that he has changed, you should let him see the child, for her sake. Because I think if you don't and she somehow finds out in the future that her father came back after all those years wanting to see her and you didn't allow it, she will be pissed at you. \n\nStart off very small. This person is a complete stranger to her. It all should be on your terms and he needs to respect that for now.",
            "Lawyer, lawyer, lawyer. Find one in your area who knows the laws in your state and get good, solid advice on setting up a legally binding child support and visitation schedule with Tom. Don't contact him, cash the cheque or say anything to him untill you have this legal support  in place. This is to protect your child and ensue that both you and Tom engage in a equitable, clear and legally binding co-parenting arrangement right from the start. A few dollars spent correctly now on legal advice now could save you thousands down the line if things go belly up for any reason. If he is serous about being in Faiths life he/ his lawyer should be prepared to work with you/your lawyer to get this right from day one. Co-parenting doesn't have to be adversarial but it does have to have clearly defined boundaries which comply with the laws in your area. Don't leave yourself open to future troubles by skipping legal involvement now!",
            "I grew up with a single parent, so when I see stories like this I almost always say \"No fucking way\" about meeting biodads. Not because I hate my biofsd for leaving, but because he is a **stranger**. At no point in my life did I ever wish I had him there. The only times I ever asked about him was when I felt self conscious because everyone at school prodded me about it.\n\nI find it interesting that reddit is quick to say \"blood doesn't make family!!! Just because two people created you doesn't mean they are worthy of your time or emotions!\"\n\nYet in this case its: \"At the end of the day, he *is* her father\"\n\nPause for a second: No he's fucking not. Biologically maybe. But having sex with someone to create a child is like the easiest part of becoming a parent and it only makes you a parent on paper (litterally) \n\n1. I agree with reddit and say talk to a lawyer. \n\nHowever...\n\n2. Treat him as you would treat any other strange man that appeared in your life. He doesn't *deserve* to visit or know **your** child until you get to know him and trust him. If you started dating a man would you introduce him to your daughter right away? No! Most single or co parents wait months or even a year to introduce SOs to their children. I say, take the same approach. ",
            "[removed]",
            "First of all lawyer up. A lawyer will help you not make mistakes that would help Tom in court if you decide that got don't want him in your family's life. Things like don't cash that check, the court my take it the wrong way. And don't let him see your daughter before talking to your lawyer. \n\nSecond, and this is just my opinion, but I disagree with everyone saying that he deserves a second chance. That he has matured. He's 5 years and threatening you too late for all that. People are talking about how she deserves a father and he deserves a second chance, bull shit. She's been fine without him and he went above and beyond to not be a father and avoid child support 5 years ago.\n\nOther users talk about meeting with him before he meets your daughter, this I agree with. You are going to have to get a feel for if he is a right fit for your family. \n\nThis is just me but he wouldn't see my daughter until he was 100% on 5 years of child support. \n\nAnd the usual disclaimer, ultimately got have to do what you feel is right. ",
            "I think you have to accept the money. It is not yours, it is Faith's. Even if you just sock it away in a savings account for her, she can decide to set the whole pile on fire when she turns 18. If she wants. \n\nAs far as visitation, I agree you should talk with a lawyer. Usually you can at least get a consultation pro bono.",
            "I would say out the bitterness aside and be the better person and give the guy a fair chance. I'd file for child support. Back support and give him a fair visitation schedule. Your daughter deserves it. \nIts okay for you to be mad at him and even hold a grudge for as long as you need to. Its not okay to prevent her from knowing him. \n\n",
            "Saying you don't want the father of your child in her life because he chose to bail during the \"hard parts\" ~~is a selfish~~ may not be the best way to approach the matter. I've seen this situation first hand, as the child. I'm not saying you are selfish. But he was very young and so were you. You must consider what is best for your daughter NOW, and financial assistance is a big thing not only for you, but also for her (think savings for college, keeping dinner on the table, having a nice house or reliable vehicle). Definitely talk to a lawyer and set up child support payments. Also, if he has actually changed, visitation may be good for her too. She is at the age where she will be making friends and may wonder why she doesn't have a father. She might resent you when she is older if she finds out she had access to a father figure but was denied that relationship. Ultimately it is up to you, but I would consider meeting with him and a lawyer. Do what you can to ensure your daughter has a successful and healthy future.\n\nEdit: And she does not need to allow him to have a relationship with her if she does not deem it viable. But pursuing child support could be very beneficial to the child's future. Following through with the situation legally would likely be in the best nature for her daughter, and if through this process it turns out that the father has changed and is successful, why not allow Faith to have a relationship with this man? Obviously if it turns out he is scummy, she shouldn't pursue it. But the situation could turn out for the best.",
            "There are two possibilities, (1) Tom has genuinely grown up and is a different person now, his apology is sincere and so is his intent to be a father to Faith, or (2) he hasn't truly changed, he's still the awful person he was to you back then.  \n\nI am the type who believes 20 year olds are young enough that they can genuinely grow and change.  If Tom is a case of (2) above then obviously you shouldn't let him get involved, but what if he is in case (1) and he has truly changed and improved as a person?\n\nIf he is in case (1) then it would benefit your daughter to know him and to receive his financial support.  The fact that he hurt you in the past and you resent him for it has no bearing on the present if he has changed as a person.  I suggest to analyze who he is at present and not get hung up on the resentment you feel over his past actions.  The answer to \"where's daddy?\" should not be \"we don't see him because mommy still resents him for his past actions, even though there is evidence he has changed into a better person.\"  ",
            "He is going g to have rights. That's a given. You can't stop it. And yes she deserves a good daddy but he is her daddy. He's what she's got. \n\nMy ex did the same things and he also denied he was the father. He spread awful rumors. \n\nWhen she was three or four he came back. \n\nHe's been great ever since -ten years he's been great. \nYes I'm still mad. I'll always be a little mad. \n\nBut she loves him. We live in the same neighborhood and he helps repair my house. He's family even if I don't want him to be. \n\nSorry you're going through this. I'm hoping to works out like my thing did. ",
            "Do not cash the check.\n\nTalk to a lawyer before you do anything. You could find yourself self fighting a custody battle in the  near future ",
            "Woman here. And I see your side of it. He's not waltzing back in though, OP. He's crawling back on his hands and knees and eating a shit-ton of crow for all of the pain he is realizing he put you through. Imagine the day this hit him like a thunderbolt, the ramifications of what he did- to you and his kid! Awful. The forgiveness part is *really hard*, isn't it? Because it doesn't undo the awful stuff he did. That's already happened. So if you can't change the past, you have to work from today on and figure out what is best for your child. *First and foremost see a lawyer*. Cashing that check may put you in a legal bind somehow that you've agreed to let him back in, so do check and see what legality that opens up. I have no other advice to give except I hope this somehow works out good for all of you.",
            "Playing the devil's advocate here. Tom certainly did a real PoS thing to you back in the day, no question. However, think to yourself, how much have you grown in the last 5 years? Personally I don't have children but I imagine you've grown a lot in that time frame. Now think, that many people, certainly not all go through quite the level of emotional growth in their early 20s. It isn't necessarily fair to instantly assume that Tom is the same Tom you dated 5 years. From the sounds of your post you saw the letter and thought only of all the hard times you've gone through, which is completely understandable, but I think it's fair to say Tom has likely encountered some emotional distress over the whole ordeal as well. I'm not saying his situation was anywhere near as bad as yours was, but I'd be willing to bet it was enough to give enough basis for self reflection and growth. \nFrom personal experience, I was homeless 6 years ago, right after graduating highschool. Not because I was the victim of some tragic life event, but simply because I was an immature 19yo that made terrible life decisions. Now, yes people who haven't seen me since that age would likely jump to the conclusion that I'm the same lowlife loser as I was back then. But I'd say I've grown a tremendous amount in that time as a result of my experiences. I graduated university, landed an excellent career related position, and generally am doing pretty well. I'm not the same person I was when I was 19 and I'm sure neither are you, and I'm sure neither is Tom.\nAgain, not everyone goes through this developmental stage in their early 20s. I've met some middle aged folks who seem like they'll never mature, but it's worth giving him a chance. At the very least, it's only fair to your daughter for her to know the truth about her father. Again I don't have children so I don't know the potential impacts and damages the effects of Tom's presence in your daughter's life could have, but that being said, I imagine you should be able to quickly come determine Tom's character and determination to be in your daughter's life as a good father. If you think things aren't going good in a few months, cut him off.\nI wish you the best in your journey, and I hope you find peace, and allow yourself to forgive the 19 year old boy who was not ready to face the challenges of adulthood, even if you don't let him back in your life.",
            "Think about your daughter. Let Tom see her etc. Let him support her. You don't have to love/date Tom... \n\nYes he was a douche for bailing. But let your daughter have a father...\n\nThe past is done. You will only punish your daughter for not allowing her to see her daddy.",
            "Tom has thought long and hard about what he did and realized how much of an asshole he really was. He probably told his college bros about the kid and they filled his brain with all this \"fuck that bro, you better ditch that girl and the kid\" and he was foolish enough to believe them and was immature enough to think it was even acceptable. \n\nPeople change over time and the fact that he took the time to contact you and to send money, plus offer to pay any back pay shows how committed he is. He covered every base possible to pay for things, which is all he can offer to do at this point. \n\nYou're right - he wasn't there for the exams and the feedings at 2AM, and you will always have that on him. Faith will always know that you were there 100% and he wasn't. \n\nGive it a shot, you owe it to Faith from a financial aspect and she deserves to know who her dad is.  If at any point you feel that he's not holding up his end of the deal then bail.   \n\nPeople change, maybe Tom has for the better. ",
            "Your daughter deserves the chance to know her father. Don't go dropping her off at his house, but give him the chance to have grown up, just like you grew up. It was unfair that you were forced to grow up so fast and I think you did a fantastic job, but don't let your bitterness take away something from your daughter that could be wonderful. Get to know him. Allow him to get to know you and Faith, slowly. #Go to counseling together for the first 20 times you let him see her if that makes you more comfortable. To not even try is selfish in the extreme. No father is perfect, but if he wants to spend the rest of his life trying to make it up to her and that would improve her life, then you both owe it to her. This isn't a favor to him, and it has little to do with your anger. It's for faith. ",
            "Considering how he dropped you like hot coal when you got pregnant instead of taking responsibility in some way, I'd imagine he might do something similar if he ever has to face the responsibility of being a father.\n\nAs it stands now he has an idea of how it is to have a daughter, and that idea probably involves only having to experience all the easy parts of fatherhood.",
            "---PLEASE READ THIS---\n\nI am not going to judge here, but I am gonna hit you with some truth that you need to hear. \n\nMy motto is this: there are 2 sides to every coin, and even if one side is waaaaaaaaay more justified than the other, we should still try and look at it from both sides, because we aren't looking for justice here. We are looking for a way to understand the situation completely and objectively, and then to find the most optimal way that both parties can resolve the solution as peacefully as possible, both on their own end and with eachother. \n\nOn your side, he left you, a young college student, to take care of a baby all by yourself, and now wants in after all the hard work you have put it in. You are angry and hurt, and understandably so.\n\nOn his side, he was a young college student, with a lot going for him. He likely had a lot of aspirations in life and a baby might interfere with this. He likely wasn't too serious about the relationship, given that it is college and all, and he didn't want to get tied down with a baby. But most importantly, he was likely so angry and horrible to you because deep down, he was frightened of the baby jeopardizing his future and all the responsibilities it entails in raising one. That is a BIG undertaking, especially for such a young person and likely he wasn't as ready/willing as you to accept that responsibility so suddenly. Now I am not justifying his actions, but again we aren't looking for justice here.\n\nNow he has come back, humbled himself greatly, given you a check for $3,000 and told you he will do whatever you ask to make it work because he understands fully the pain he has caused. He has put the ball in your court completely on this. I don't think he would run away again after giving you so much money, and you would be better off taking the risk of him running away again instead of denying your daughter (and yourself) the chance for better financial support and more importantly, a father figure for Faith. I think on his end, he has done the most he can to resolve his error in probably the best way possible.\n\nNow as for you, to resolve your side of this, I think you need to try to understand his point of view (even if it was a wrong point of view), accept that he made a mistake, and bury the past and if you can find the strength, forgive him. He can't go back in time and fix what happened then, but he can do the best he can to make it right NOW, and that is what he is doing. You seem to be, as you said, pretty bias in projecting your anger on to him and making assumptions that he \"Only came back cause it got easier\" or that because he left before means he will do it again. A person can change a lot in 5 years, hell a person can change a lot in 1 year, and you shouldn't condemn him for a mistake he made so long ago. Another important thing to note is that we aren't defined by our past decisions or experiences, but how we deal with and resolve them, and Tom seems to be a good example of that.\n\nYou also need to remember that his offer really isn't so much about you and him as it is about your daughter. Him supporting her has nothing to do with your vendetta against him. He isn't trying to get back with you (I presume) and he isn't trying to attack you, he is trying to provide for his daughter. That being said, he IS trying to make it right with you, too by helping you with back pay and financial support AS WELL as give your daughter a father figure, and this is all on your terms too, so you really can't ask for much more than that. \n\nYou denying access/support from him to your daughter would be both unfair to him (Yeah he made a mistake, but we are human, he has feelings too and is doing everything he can to make it right), unfair to yourself (Grudges are unhealthy and you would be missing out on money that you probably need) and especially unfair to your daughter if you deny her the chance for a father figure and financial support.\n\nI sincerely hope you resolve your own issues with him and that you can both work together to give your daughter a happy life :D\n\nEDIT: As others have pointed out, obviously he actually could still be a major douche and have ulterior motives, in which case you should be careful. Meet with him and discuss both of your legal options thoroughly as well as how you plan to have him enter her life (If you even decide that, which tbh sounds like it is probably the best option as he does truly seem genuine about this, you don't want your daughter hating you for not letting her see her father) to ensure he isn't screwing around. ",
            "Have you ever tried to look at from Tom's point of view? He was probably 20 years old at the time and having a baby during his college career and at such an immature age is a shock. He tried to run away from reality and it's now probably coming back to haunt him in which he is now desperately trying to fix. \n\nI don't blame you for still being piss and you have the right to be angry. But ask yourself this... has he really changed? Best way to truly find out is by meeting with him and see for yourself instead of constantly asking yourself this question. If you truly believe he didn't change, then don't see him, but like I said if you're thinking too much on it, then go see for yourself. 5 years is not a long time but it's also not a short time, but people do change. \n\nTake slow and take it easy. Whatever decision you choose, there is no right or wrong answer. ",
            "It sounds like youre being petty and wanting to put your own needs for revenge above what your daughter needs. While what he did and what said is wrong, you cant expect much different from someone who fears their future will be ruined by an event that is unavoidable. For that, I think youre 100% in the wrong.\n\nI can understand why he said those things five years ago. Its not right, buy I get the sentiment. He probably was just afraid his future would be affected. Now that he's matured, he understands what he did/said was wrong so hes trying to make up for it.\n\nDid he do anything specifically to you or did he just say these things?\n\nEither way, I think he should be a part of her life and you shouldnt let your grudge stand between a father and his child. What kind of a parent would you be if you did that?",
            "It's not about you, it's about Faith. Assuming he's not abusive, Faith deserves a father in her life, regardless how you feel about him.\n\nEven if you're angry with him, you don't have a right to think you can not take the money and therefore deny his right to be in Faiths life. Now that he's here and willing to commit, you no longer can deny him access.\n\nSo let all that hate go, meet up with him, set up payments, and agree on visitation.\n\nEdit: spelling",
            "He fucked up. What he did was wrong. But for your daughters sake, I would at least give him a chance. Cash the check (SHE DESERVES IT), go to a consultation with a lawyer (at the very least to get yourself protected) then meet with him a few times and feel out what type of man he is now. In the letter it seems like he realizes he messed up in a huge way and is not trying to rush it. I say do it. Because you are right, your daughter deserves to know her father. 20 year olds are dumb. There is no real excuse, but it's a good reason. But of course, do what you feel is best for your daughter. Put her first, like you always have, and think about what she deserves.",
            "Frankly fuck him. Regardless of money, and I myself grew up poor, she's better off without him or his money. She also doesn't need a male role model. Especially not when he could run at any moment \n\nYou are doing fine. You are one of the finest examples of a mother I have heard about you CAN do this alone you have proven that, you don't need him and neither does faith \n\nHe's just a selfish arsehole trying to clear a guilty conscience and frankly fuck him. ",
            "Ignore the people who say he has a right to her. He does not. As her mother, it is your responsibility to protect her, and children are not a right. They are a privilege. Your family might try to pressure you, but they have no power or say-so over the situation. They're the peanut gallery. ",
            "Faith does not need a good male figure in her life.\n\nI feel like we're always being told that there has to be a male/female role model, but that's not true. You can teach her what a good role model is. Coming from someone who was raised by a single parent. ",
            "I'm late to the post, but here's my advice. The check is written to you. Cash it. You have every right to spend that money on Faith whether it be buying her some new clothes, toys, paying electric bills, putting it in a savings acct, etc. \n\nSet up regular child support payments and file for complete custody if you haven't already. Have him meet you at the park or something. so that he can at least meet his daughter. You have to see how they interact in order to move forward. \n\nAs much as you say You'd rather her have no father than a bad one, you have to at least give him a chance. 5 years can change people a LOT. \n\nDon't do anything you're uncomfortable with and keep track of every phone call or meeting you have with him. Good luck (:",
            "I am behind on this, but I hope you read it and it helps. \n\nFirst, beautifully written. You sound like a great mother with a good head on your shoulders. \n\nSecond, I am a fellow single mom of a three year old. His dad has... occasionally been there, a little money here and there and a visit every few weeks for just a few hours. Rarely any overnights - maybe four total. That's a lot more help than you've had, but it still kills me because he hasn't hit the point your ex seems to have done. Everything else in his life is more important than his son, and it kills me, which is part of why I'm actually moving us away next month. I'd rather him not be around at all instead of when it's convenient to him, because it confuses our child. \n\nNow. All of that being said, your situation is much different and from personal experience, it would take GREAT, genuine change for him to have contacted you the way he has. Unless he was absolutely, 100% remorseful for his actions and sure of wanting to be in her life, I am certain you would have never heard from him. Ultimately it is up to you, and what you think is better for Faith, but I think you should give them a chance to connect and know each other. Some people take longer to grow up, it is no excuse but it is a fact. He may not deserve to know her, but she deserves to know him or she may resent you for it later in life (angsty teenage years, especially).",
            "Write a letter back stating all the things here that you are afraid of, and how you feel about him. Faith deserves a chance to know her father and no one says you have to even like him. The fact that she is four and he is now contacting you might be because it just took him that long to come to terms with what an asshole he was. Not because he is thinking \"I am only going to contact her when the child is potty trained.\" Teenagers tend to be assholes, teenage males more so. Good luck. Keep the money. ",
            "Given that he was basically a kid when this went down (as where you), chances are good he has actually changed.  She should know her father, but this resentment you carry will confuse her.  Even if you say nothing, kids sense it.  I advise you talk to him alone, tell him everything you told us and see if it helps you feel better.  Get to know who he is now, without involving your daughter and if you do at some point become convinced that he has changed (as objectively \nas you can given the pain you feel) then introduce them.  He said he is willing to go slow, you should try.  You'll hate yourself later if you don't. ",
            "It seems like everyone else has covered the legal and logistical aspects of the situation. My parents divorced when I was 4 years old, and I didn't have any contact with my dad after that. My mom wouldn't talk about him, so when I was 12 I tried to seek him out on my own. I got in contact with my brother and sister but not my dad. When I was 15 my aunt helped arrange for me to meet my dad. My mom got pissed initially, but she finally came around, and I went out to lunch with him for my 16th birthday. He didn't try to contact me after that. He doesn't have his life together, and I'm not a priority, but I've come to terms with that. The point is, every child has a right to know where they come from and who their parents are. Of course you want to make sure he's a decent human being, but you should let Faith meet her dad at some point.",
            "My only advice is that even if you don't want to get child support or anything from him, *please* at least get a family medical history from him. Figure out what he and his family are predisposed to and any health risks that should be taken into account, either now or later on in life. (Also, ask for him to contact you if there are major updates to said family history.)\n\nIf you don't think it'll be in her best interests for your daughter to meet her father, that's fine, but please make sure that she has both parents' family medical histories if possible, since it's a lot easier if doctors know what to look out for. Even if it's not the best thing, he's half of her DNA, so anything genetic from his family could show up in her.",
            "Regardless of whether or not you keep the money, Tom can pursue custody.\n\nSo please, for the sake of your daughter, take the money and put into a savings account for her. \n\nTalk to a lawyer or do a shit ton of research about child support, and pursue whatever financial elements you can for the sake of her.\n\nAs for visitation, etc. You don't have to solve that all right now. You don't have to decide everything right in this moment. You can take that step by step with the guidance of your lawyer and research.\n\n",
            "I would advise consulting a lawyer before doing even one more thing.  Lawyer first - then you have information to your and your child's legal protections. Then move forward.\n\nI wish you all the best and hope everything works out positively for you and your child.\n\n*Nana internet hug*",
            "Whatever you do is up to you. But if you decide to let him part of her life, he can start by being in her life not as a parent, but a \"friend.\" Maybe agree to not tell Faith that hes the father. \n\nSomething to keep in mind.. Even if you two agree, there's the possibility that he will tell her. Maybe by accident. Maybe on purpose. Who knows. \n\nJust a thought. \n\nThank you for being a great parent. ",
            "I don't have anything to say about whether or not you allow Tom into Faith's life because you need to decide what her best interest is.\n\nI do want to tell you that what you were/are telling Faith is the right thing to do.  I was very inquisitive about my bio father when I was around that age.  He basically did the same thing that Tom did.  When I was 16, he tried to waltz back into my life after not being a part of it for 13 years.  I had an anxiety attack because I was away from my mom with bad cell service and didn't know what was going on.  He found me on Facebook, and I was terrified because I felt like I was betraying my mom by accepting the friend request.  He stopped trying to contact me within two years of that.  Sometimes I still hope that a birthday card will come, but it never does.  His soul searching may be self-serving, and it may not last, but you should at least really think what would be best for her. \n\nWhen Faith asks you questions, be honest with her.  If she asks the questions, she may understand.  My mother only told me the truth of what I could understand.  If I asked, I obviously would be able to process some version of what really happened.  ",
            "Get a lawyer and make sure that you keep full custody. Then wait until Faith is old enough to have some understanding of the situation and let her make her own decision. He's demonstrated that he's not trustworthy. She should have some say in whether or not she wants to be involved with him. And get her a therapist because the idea that your parent wanted you dead and then abandoned you has got to be a giant mindfuck.",
            "This is one of the most level headed and unselfish thing i read in reddit.",
            "Ask her directly if she'd wanna meet him, and where, when, and how. Let her make the decisions about it. She might meet him and not like him or not get along with him, or she might like him at first, but then not later, whether it's in the first meeting, or after 5, or 10, or 30 times together. You can be there with them the whole time every time. If he's still a bad person, that'll come out sooner than later. ",
            "LAWYER. Like, yesterday. ",
            "I think OP should get to know Tom again, find out his situation more than what is stated in the letter, and go from there. Who knows maybe Tom has another child, or even a step-child that has made him \"see the error in his ways\" or maybe he has just grown up? Op, you have every right to be angry and deeply hurt, so take it slow and trust your motherly instincts. I would never allow unsupervised visitation with Faith & Tom ever, unless you yourself get to know him better and trust him. It will be hard, but I wish you luck. You are a strong woman you can do this.",
            "I don't have any advice but when you said \"However I do know she needs a good male role model in her life and I do feel guilty for not having one for her. I haven't had a boyfriend or dated since Tom because all my energy and focus has been on graduating college, getting a job, and being a good mother to my daughter.\" It almost brought tears to my eyes. I have a niece who is 4 almost 5 in May and she questions why she doesn't have a dad and why my sister's ex boyfriends couldn't be her daddy and it makes me so happy to hear that in that bump in your road you still choose to focus on your baby. I wish my sister and mom could have done that. It's better for her to have a very strong woman figure in her life, than male figures that are not that strong or are temporary. You show her that she is strong enough to do whatever no matter how hard it may be without a man in her life, and with that I respect you :)",
            "I feel like for her you should give him the chance to be her dad.",
            "It sounds to me like he has grown up. If you think it is in the best interest of Faith, then I'd do it. I believe in second chances. I'm not saying it would be easily forgotten but it sounds like he is trying. I wish you and your little girl the best. ",
            "I think you should set up child support with him. You don't have to give him a chance if you don't want to, but keep in mind he was only 19 and in five years he could have changed. Yeah, 19 is still considered an adult, but most people are more mature when they get older especially at that age",
            "Lawyer up. ",
            "I will probably be in the minority for this, and I'm not taking into account anything else except the base of what you wrote, but don't you think he could have actually changed?  How do you know he will be a bad dad now?   I changed a lot in 5 years, and 5 years ago I wouldn't have been a good father but I am now.  Granted I would have never bailed like that but at 19, it's hard for some males to accept. \n\nI'm not saying he isn't the same old same old, who knows.  I think he should have a chance at least.   But take my advice along with others in this thread and do it the right way, the way that's going to keep you and your daughter together and in the clear and the most safe. \n\nSo do what the top comment says but I believe you should give him a chance at least, you do a lot of changing in those years ( I did) and he might be a lot more responsible than he was back then.  \n\nThrowing in an edit here, remember to do what's in the best interests of your daughter here.  It is her actually daddy and if he has changed and is more responsible now and will actually be a good dad, let her have that.   Don't let your hatred and dislike for him get in the way of your choice, make it hers as long as she's safe.  \n\nI also want to mention that before you folks down vote me to oblivion because I know how you guys are, that I'm kind of biased on this as I'm a dad and I can't help but to think of my own child (children come June!), and how I would feel in this situation so that's fueling my responses at the moment. ",
            "> However three days ago I received a letter in the mail. It was from Tom.  \n\nHow the hell did he get your mailing address? just curious",
            "I'm sure my comment will be buried but I should give you the child's side. My mom has kept me from my biological father my whole life I'm (I'm almost 40). She did the same to my sister although my sister had more information and found her dad finally (they worked in the same building) turns out he had done what OP baby daddy did. My mom decided though  to turn down his offer of support. This caused some major drama between my mom and sister. Also my situation has kept my mom and me from being close. A few years ago my moms ex (step dad) gave me the only remaining photos of my real dad and I, the ones my mom had \"lost\" a long time ago. I hope to one day track him down that way. I know your trying to protect your daughter but not knowing about or eventually finding out about a biological reaching out can cause some pretty deep resentments. I honestly have never been super close to my mom just because of that. Just thought I would give you my thoughts as I've always wondered if my real dad ever reached out like my sisters did. Not knowing is worse I think than her getting to know who he is and making her to own decision.",
            "As info,the hard part is most definately not out of the way yet!",
            "I can only imagine all the emotions you're going through. Hugs, you sound like you've given Faith everything you can. Take it slow, and let it all in before the final decisions. \n\nMaybe speak to a lawyer? ",
            "No one can really tell you what is best for your situation. It's such a personal thing you're going through. If it were me, I would start with maybe meeting him for coffee (without Faith of course) just to get a feel for who he is now. If you end up progressing to the point where you let him meet her, make sure he knows he has one chance, and if he bails again he will not have another until Faith is old enough to decide that for herself. He can't think it's okay to just come and go as he pleases. ",
            "I know you've had a lot of responses but I just want to say,\n\nI am a single parent only 21, the dad to my son is unreliable, selfish and was very abusive to me. He is still in my son's life though but only when he sees fit and it suits him. \n\nIn all honesty it would be a million times easier to cut him out of my life, I wouldn't have the stress, worry and not having to try to fight to communicate with him about simple things with our son would be amazing but when I see my son with him and how happy is to have his dad (however bad he is) I wouldn't want him to lose that because I love my son with all my heart and if having his dad in his life makes him happy then that's all that matters. \n\nGo slow, start off with just setting up child support and then Go get a lawyer and set it up where it's slowly supervised visitation for however long and then gradually build up from there. ",
            "I think you have every right to be pissed but I think it's important to let your emotions about him aside for now. Most of us aren't the same person we were at 19 either and he might be telling the truth when he says he's done a lot of growing up.\n\nThe most important part to me, however, is this:\n\n> I think Faith is better off having no dad than a bad or half assed one.\n\nI think you should step carefully when deciding this for another person. I know she's your child but ultimately, you could be deciding whether she has any relationship with her father for the rest of her life. What will you tell her when she comes to you 15 years from now and asks about the real reasons of why her father left? How will you admit to her that he begged to get back into her life at 4 years old and you sent him away?\n\nHe might still turn out to be an asshole father. He also might turn out to be a good one - I think she deserves to find that out for herself. ",
            "How can Tom be on the birth certificate if you never saw him again? When my son was born we had to have a notary watch both me and my husband sign the birth certificate and no one was allowed to fill in someone's name without consent. ",
            "So after 5 years of ignoring you and the kid, while you really struggled.he comes back, after all the hassle with diapers and what not is over. I would cash the money and put them on a bank account for the kid, say thanks but I'be moved on.",
            "I think you two should meet and establish some kind of relationship again because you are probably strangers to each other now. Pour our your feelings to him (either rehearse a monologue or write a letter telling him what you told us) and then establish a plan depending on his reaction. I like the idea that maybe after 6 mo of child support you can slowly introduce them.",
            "Just remember 20 year olds are idiots and have a huge problem seeing the bigger picture. Honestly, you're pretty much a dope until mid / late 20's, so if it took him that long to realize what's important in his life then I would like to believe him. ",
            "I totally understand your anger.  I would feel the exact same way, infuriated that he wants in now after all this time and after completely abandoning his child and you.  It isn't right, and it isn't fair.  \n\nHowever, for someone who royally fucked up, he is probably approaching this in the best possible way that he can.  He admitted he screwed up and apologized.  He didn't try to make physical contact.  He sent a goodwill check.  People rarely change, but it CAN happen.  For your daughter's sake, it is worth finding out if he can be a good father for her.\n\nLike others have said, meet him alone and tell him how you are feeling.  Look into his eyes and see what he is really looking for here.  If he legitimately wants to be a father to his daughter, it may be worth the work of trying to make something of this. "
        ]
    },
    {
        "post_id": "b47frm",
        "author": "Ohlordnotfriday",
        "title": "Friend [37/F] is about to be turned-down for a promotion she has dreamed of for years. I [36/F] know it's coming and don't know how to support her or what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/b47frm/friend_37f_is_about_to_be_turneddown_for_a/",
        "score": 2837,
        "num_comments": 265,
        "created_utc": 1553273679.0,
        "selftext": "Sorry, never posted here before and didn't know I needed a tl;dr (it is at the bottom). Reposting.\n\n&#x200B;\n\nI  used to work on a small team for a division of a multinational company.  We used to primarily be staffed by what were called “old timers”  basically people who were close to being of a pensionable age who didn’t  want the hustle. That culture shifted and a lot of young blood has been  brought in. I formerly worked there and was given a lateral move out. A  colleague “Tina” still works there. Recently an opening for Director  came up and Tina came to me for help. She's been doing overtime and working hard to get noticed for this position. She's well qualified for it and has extensive experience at the company, so she was given a chance to interview for it.\n\nTina  is a single mother who has overcome poverty in childhood,  racists/bigots in the industry and worked hard to support her kids.  She’s had health issues but always fought hard. Tina is tenacious and  hardworking, but there are issues – she struggles in some areas and  while she’d definitely make a great director as she’s contentious, kind  and courteous, the role is evolving and may be a bit of a stretch.  Nonetheless, I helped her with her application and presentation. Beyond being colleagues, she and  I are friends; we spend a lot of time outside of work together (we’re  the only women of color in our respective areas) and share a lot of our  deep feelings and thoughts. She worked hard and put together a good  presentation. I was really proud of her. She presented this morning at  9:30 and got through it and was out by 10:00.\n\nMost  of the other applicants were internal and interviewed yesterday but one  person was recommended by a senior VP in a different department. The  guy who was recommended is a 30-year-old hot-shot (I think he may actually be in his late twenties). He will soon graduate  from an Ivy League MBA and is the definition of corporate style. They  gave him a last-minute presentation slot immediately following Tina. I  attended all of the presentations (I am not on the hiring committee) but  was there to support Tina and see how the presentations went.\n\nWhen  the hotshot gave his presentation, it wasn’t even close. The 20 of us  sat in the room and were dumbfounded. Not only was his presentation  visually appealing but he noticed details none of us ever did and he  developed a pitch that was so innovative that our AVP asked to use a tag  line he created. His technical analysis was so spot-on that it was  spooky. He understood issues facing our business unit without having to  be told and had ready solutions to solve the problems. Questions they  asked him were more about how he’ll do things *when*  he takes over the role. It was made very clear to him that this was his  job and they even provided an unofficial tentative start date. It is  very clear that he understands the industry and his past experiences,  such as professional work experience as well as winning top case  competitions and academic awards prepared him very well. The  presentations were in totally different leagues.\n\nAfter  he finished, he made a self-deprecating joke and took questions. He  thanked us and left. We all sat there for a minute chatting when the AVP  very loudly told the HR director to offer significantly above the  salary and hammer-out a start date immediately and get a contract  signed. The VP who recommended him knew him from the MBA program as the  VP is a case coach there. He said he’d be his reference and they are  skipping all the formalities and going right to the offer.\n\nTina has no idea. She was so happy with her performance and she's *sure*  she nailed it. She did well, about as well as the other candidates, but  this guy is out-and-out in a different league. Just based on that I too  would hire the other guy. She's sitting on cloud 9 at her desk and  planning a celebratory dinner to celebrate her performance (she was told  decisions would be made in a couple of weeks). At this rate, it's  likely she'll be informed that she didn't get the job well before 5 PM.\n\n&#x200B;\n\nI  really don't know what to do or say. If she asks, should I be honest  about this guy's presentation? Should I avoid her the rest of the day? I  want to support her, but have no idea how to even begin talking to her.\n\n&#x200B;\n\n&#x200B;\n\ntl;dr Friend applied for a job she has worked towards for two years. She got proverbially destroyed in the interview but has no idea another candidate is going to get it. She's planning to celebrate tonight about her performance in the interview but will probably find out long before that she lost out. How can I support her?",
        "permalink": "/r/relationships/comments/b47frm/friend_37f_is_about_to_be_turneddown_for_a/",
        "comments": [
            "I wouldn't tell her that she isn't getting the job, but I would give her a heads up that someone else had a really strong presentation, to the point where you aren't sure what they're going to do.  At least that way she'll be a little more emotionally prepared when the news comes.",
            ">His technical analysis was so spot-on that it was spooky. \n\nOne of your VP's is his mentor and recommended him. Spooky isn't the word I'd use here.\n\nEither way, I think you could tell her that the guy gave a strong presentation so she's not totally blind-sided but it's not your place to tell her that she's definitely not getting it. ",
            "On the down side, it's a very difficult situation to be in. But you don't have to be the bearer of the bad news. Just tell her she did great - and then when someone else does give her the bad news, be there to support her.\n\nOne the up side, if I know this guy's type - and I think I do - he'll be in that position for all of six months before being aggressively promoted somewhere else in the company, or aggressively recruited by another company, or get ideas in his head about going into politics, and the position will be open again in short notice.\n\nAfter your friend gets over the disappointment, tell her to keep her resume current and to keep her eyes open.",
            "I so feel for your friend in this situation and I think the slight heads up you mentioned is probably worth giving, just saying \"the higher ups loved you but really lost their mind over this hot shot guy.\" You can try and pivot to celebrating her pulling off a great presentation/interview.\n\n&#x200B;\n\nWhat stands out to me a little here is that, great, the hot shot understands the company and all these things-- but he has the VP as a mentor. Isn't it possible that this VP coached him into giving this perfect presentation? Did you get any sense of that while in the room?",
            "Honestly just be there for her. As cheesy as it sounds, be reassuring that she's done a good job. She can know that she's worked hard to get where she is and maybe this Ivy League guy was just right place right time. The best thing about her is it sounds like she's dealt with hardship before and has a great ability to adapt. She's a candidate with potential to grow well after she's been hired, and that's valuable to some people. ",
            "It isn't a total loss. Young people are now jumping from job to job to get better pay and positions. So in couple years this position might open up again.",
            "I think that just being a good listener and shoulder to cry on is what she'll need. I don't think that you'll need to tell her (since the company will be doing that) and so there's no need to be bad guy here. Just commiserate with her, tell her how great you thought the presentation was etc. No need to mention the other guy. ",
            "I mean how do you know that guy will even accept the position? Your company probably isnt the only place hes interviewing.  Give her a heads up but it's not over until it's over.",
            "The way you began, I thought the situation would have more to do with the age/culture shift. It seems like she was just outperformed, regardless of her added hours and effort over the past two years. However, if the culture shift away from \"old-timers\" is an issue, maybe this might be a good turning point for your friend to possibly branch out to a different arena?",
            "Don't say anything and just support her and say she did a great job- because she did. Tell her that she worked really hard and you are rooting for her.\n\n&#x200B;\n\nThats it.\n\n&#x200B;\n\nWhen she learns she was turned down you can say - he may have had a really strong reference that put him ahead. Since he did. She would most likely think that as well anyway.\n\n&#x200B;\n\nAll you need to do is be there for her, she doesn't need to know that you watched the guy's presentation and every little detail about him. Nothing positive will come from it and its out of her hands. you'll just be putting yourself in a bad position where she will ask \"Would you have hired him?\" and then when you try to either lie and say No she will get upset or you tell the truth and say Yes she will get upset.\n\n&#x200B;\n\nShort, simple and sweet. Be there for the clean up and listen.",
            "You need to tell your friend that the play now is be the new guy’s lieutenant- he’s not from that division and he’ll need a tour guide. He likely won’t be there for long and it gives her an in as the logical successor if she’s seen as continuity of the hotshot’s agenda.\n\nAs for the initial question, you should have straight up told her and not fudge anything...she’s your friend and is entitled to your trust.",
            "I don’t think you should tell her that he had a great presentation- you should just say by the way the team was talking after his, his mentor is recommending him for the job so nothings definite and just a heads up it may not work out as she hoped. But that however, you saw how amazing she worked on the presentation so are happy to help her in any way if she wants to apply to other jobs or companies. ",
            "Tough situation. Keep your personal feedback really positive to her and her presentation but be honest and let her know the last minute candidate seemed to impress a lot of the committee, so it looks like it might lean his way. \n\nThey won’t let the others know until he accepts and once she gets the news I think you should take her out, it’s important to celebrate the wins when they come, even if it’s not the win we want. \n\nSide note, I was that exact person. Internal people interviewed for my job before I came in. On my first call they joked about making an offer right then. I got the job at about $60-80k more than an internal person would’ve been paid in the role. It’s for no other reason than I was way more qualified and I think even at this point, the other candidates have realized that. There are people who have not been nice to me but they are hurting themselves as I’m more than happy to share what I’ve learned. I’d encourage your friend to get close to this guy so that she can absorb all she can for the future and turn this into a positive. ",
            "Don't tell her. If she responds badly, it might be seen by your company as you starting drama. Be there for her when she gets the news, but let the company decide how to break it to her. ",
            "The less you say the better. If you can say nothing, do so. You can't protect her from feeling disappointed. If she pushes you for info, tell her she did well and leave it at that. She doesn't need to know about this other guy, and you shouldn't be telling her about him anyway.\n\nIt sounds like the company used her and the other internal candidates, while preparing the external candidate to blow everyone away. Again, that's not something you should tell her.",
            "It's a good experience to interview for a director level role. There will be other jobs in the future, in and outside of the company. Now she knows she's qualified. ",
            "I wouldn't say anything about the other person. You're not on the hiring committee and have no input. Tell her she did a really good job. ",
            "Considering that you're friends not through work, I think you owe her a heads up.\n\nShe knows you aren't in the position to pick who gets the job, and she shouldn't expect you to pick her if there was a better candidate. However... as a friend, just be honest, tell her she had a fantastic presentation and did everything right, but there was a last minute presentation that blew EVERYONE out of the water. Don't focus on him vs her... its him at a level beyond expectations, he is just at a higher caliber.\n\nHave that celebratory dinner with her anyway! She had the courage and the confidence to go for it and was proud of how she handled herself! Use this as fuel to keep pushing for the next opening. Sure its disappointing now, but this is the first stepping stone. Use this circumstance as an example of how to improve her work, her future presentations, a way to grow.",
            "Good lesson about tempering expectations. A job isn't yours until the offer letter is signed. I would not say anything and just be a supportive shoulder if she gets super bummed out ",
            "I'm confused- you no longer work there, so why would you worry about running into Tina the rest of the day? You don't need to say anything abotu the other presenters. Just focus on what a good job she did and that she should be proud, regardless of if she got the job or not and there will be other opportunities. She can still celebrate putting together a good presentation and going through the stress of interviewing! That's definitely worth celebrating. ",
            "Would u do an aftermath post for this?",
            "Man, now I want to hire him and I don’t even manage people!",
            "Sorry, I didn't see if anyone else made this point but.. I've been thru enough interviews and stories of interviews to know that anything can happen and even when one feels they've nailed it that doesn't guarantee the job is theirs.  If your friend is already celebrating.. I think that's where all of this conflict really comes from.  If she wasn't celebrating prematurely then any special response from you wouldn't be necessary.  \n\nIt's obvious you care for her a great deal and you sound like a great person and you make her sound like a good person too.  But I think she's setting herself up for a huge letdown. That's a mistake a lot of people make, it doesn't make them a bad person or anything like that - I want to make sure I'm not coming off like I'm looking down on her.  \n\nBut sometimes we can see our friends and loved ones making mistakes and we can't prevent it.  We have to try to be there for them on the other side, avoid any kind of condemnation (no \"You shoulda known better..\" stuff), and help guide them to a better future.",
            "Your friend is 37 years old. If she hasn't learned yet that sometimes you lose out on roles not because you were bad, but because someone else was better suited, well, now she knows. ",
            "I hope you still take her out for celebratory drinks for her awesome presentation, even though it wasn't the ultimate winner.",
            "Just be there for her. She'll be upset but will get through it. Take her out to dinner, buy her ice cream, go to the movies, listen to her and check up on her. She'll appreciate it. ",
            "I guarantee that dude had some inside info. Anyone that is naive enough to think otherwise has never worked in a corporate office. There are so many sons, daughters, nieces and nephews here, it's fuckin' bonkers.",
            "well if this guy is so good he probably will decline an offer that your friend could aim for.",
            "Don’t tell. All of us who work know those sorts of things are confidential. It might hurt her but you can both preserve your jobs in the long run. If you haven’t spoken about anything that happened during any of the presentations don’t. It sucks but, you would be breaking confidentiality and it could also hurt you in the long run. ",
            "Just be supportive when she gets the bad news. That's the best you can do as ger friend. ",
            "another vote for ‘other person had super-strong presentation’. \nno more, no less. \n\nyour friend needs to accept the limits you put on that. \nand then you can support her. life happens, and maybe that superstar will not accept, or disappear in 2 months, or maybe your friend will get a different opportunity. or maybe she’ll have to suffer seeing hotshot in the job she wanted so badly, and quit, or choose to remain. \n\nnone of her reactions are yours to control, so you can support her but you’re not responsible for her feelings. \n\nand good luck; this is not fun for you, i’m sure. \n",
            "I would tell her, but also emphasise the fact that when you apply for something, you never know your competition. She may have been the best at the time she did the presentation, but he was better half an hour later. I would emphasise that it has nothing to do with herself as a person as well. Because there are so many things in life none of us can control. Also tell her to treat it as a stepping stone, if she looks at other jobs she already knows how to do a presentation of this kind and it might help her with something else. You had to help her with the presentation, next time she will be able to do the whole thing herself. ",
            "Generally hiring managers don’t deflate second, third, fourth choices until job has been confirmed as filled.\n\nSince you were brought in professionally to that process, you can give vague color, just as any other professional in room would give to your friend or other candidates they happened across.\n\nIf you go beyond that, be sure that your friend doesn’t react badly, eg withdraw her application for role, or resign from company altogether, as hiring manager will rightly blame you for breaking protocol. ",
            "I would say nothing - you’re at work. Be ready to be a friend regardless of what happens. Also - the language you’re using about it makes me think you’d make it worse in sharing the news. “He destroyed you!” like - I thought you said she did well, why can’t you just say “she did well, but his qualifications were more aligned for the  role”. Like just zip your lips. ",
            "Hey, I know I'm late to the party buit I've been in your friends position. I think that it's nice that you are willing to see this hot shot guy's strengths while your friend was an applicant.\n\nWhen I have been in your friends position (and yours too, actually) I've borrowed and stolen all the resources, techniques and ideas from hot shot guy. Use it as a learning exercise\n",
            "Your first instinct is as a compassionate friend, and that is wonderful, but you also need to consider that sharing the results of a private meeting is very bad form and might be considered a breach of confidentiality  by your employer.  \nA strong presentation and job offer are not a confirmed hire. What happens if negotiations with the shooting star candidate aren’t successful or if he accepts another offer?  \nIf she was a strong number two, it is possible she could wind up with the job.  And, If she is a  viable choice for a directors position, she will already have a clear appreciation for the professional ethics that govern these things and not hold it against you personally for not sharing the contents of a meeting not meant for her ears.\n",
            "My be off topic, but this kind off stuff really grinds my gears. Folks make hiring decisions not based on  applicants actual capability, but on ability to interview well. I know so many “slick” people, who dress nice, spend a ton of time prepping for interview, nail the job, but are terrible performers. \nIn my previous position I used to hire folks. And often had to overrule the HR person, who wanted to hire a fresh outgoing face vs. someone who was nervous and less well spoken.  Luckily, in tech side of things it’s easier as you can ask tactical questions instead of strategic. \nAs a MBA from nice school myself, I can tell you that school prepared us to do an interview prep (look up company, read articles about current issues, listen to last earnings call).  That’s all the guy did. RX: in 30 min worth of prep, I can talk strategic issues for Coke, Pepsi, Heinz, Apple, simply by reading last 5 articles from CNBC. \n\nLastly, be honest with your friend. I would not discuss quality of the presentation, but say” the hiring team seemed to really like the candidate X”. ",
            "Career wise, once the disapointment is passed, she should aim to learn as much as possible from him. Having a very strong boss can be a fantastic career accelerator. He won’t stay long anyway. Those are not funny moments but can turn into the best thing ever depending on how she chooses to react.",
            "It's not up to you to tell her, so wait until she finds out on her own. Then you tell her, \"Tina, I saw his presentation, and the guy is out-and-out in a different league. He really deserves the position.\" That's all you can do. ",
            "This is what I hate about corporate culture - people give up their own work life balance with overtime and sucking up thinking that actually counts for something come promotion time. You put in real work, for a reward that may or may not even eventuate.\n\nSure this guy presented well, but you don't know him from a bar of soap. Expect your colleague to feel betrayed, and to maybe look elsewhere for work - she didn't see his presentation so will not be impressed by his qualifications. She'll just be pissed off and rightly so. \n\nAt least give your girl a heads up to let her know that she should go home to her loving family instead of putting in any more overtime.",
            "Tell your friend you still believe in her despite the outcome. Big or small, we don't always get the things we want, but assure her that given all she's been through,she has the strength to progress and improve.\n\nThings will turn out the way she wants them to in the end I think.",
            "Are there any opportunities for her between her current role and the role she just applied to? What would be the next logical step for her to aim for now that this role has been filled?",
            "However you go about doing it, I think the right thing does involve telling her about the other applicant's interview.  I mean the most helpful and productive thing you could do for any person, let alone a friend, in that position is to point out their opportunities and give them a chance to learn from the experience.  If you tell her everything this guy did, not only will it be easier for her to see why he was such a great candidate which will lead to her hopefully seeing it as less about her inabilities but more just about his outstanding job, but she if she's as clever and tenacious as you say then she can actually take some notes, so to speak, and now she actually has a solid baseline of what companies like that are looking for.  It'll help her. I have always felt that whenever possible, it is beneficial for applicants to know what they did wrong or right in the interview and it's actually quite rare when we get the opportunity to *actually know why we didn't get the job/position*.  ",
            "If she were going be told for a couple weeks, then maybe you'd be advised to drop a subtle hint or two. But if she is going be told by the end of the day, avoid her. Let HR break the bad news. Why be the messenger of bad news? You can be there for her to discuss / console after the fact.",
            "The person that posted the job is the one that should tell her. After she is informed and she asks I think you should discuss how well she did in her presentation but no one was prepared for the professional level of the one that got the job gave. ",
            "hugs and icecream can help a lot.",
            "I mean if her performance was good it's still worth celebrating, right? It's valuable experience that'll help on another occasion. Maybe it's not worth raining on her parade when she's celebrating being good, not being the best.",
            "Why do you think the guy was so well prepared and innovative? Was he just amazing or do you think he had a heads up?\n\nAlso- you’re a great friend to her. And a great writer. That was kind of hard to explain and you painted a perfect picture. I hope she takes it okay. ",
            "This is going to suck for her. This isn’t related to the questions you asked but, Do you think the guy who nailed it got insider info from the VP?",
            "OP you can’t say anything to her now. After she’s aware that she didn’t get the promotion, you can reassure her that she did a great job. The thing is that all of us can only do our best; we can’t control what the competition does. She will be upset anyway but that’s about all you can say. ",
            "The hot-shot dude did so well because he was prepped by someone on the inside with insights and information that they knew would turn heads. He may be all talk and turn out to be useless, so you'd better hope he has actual talent to back it up because it sounds like he just knew the right buttons to push. I think that's an aspect worth flagging before *anyone* is hired, bring it up with the committee and do some research on his employment history. Coaching and preferential treatment like this are dirty, and it gives the whole industry a bad name, plus there's the risk of insider information being leaked.\n\n\nLet your coworker know there were some impressive presentations and gently nudge that she shouldn't get her hopes up (but be supportive regardless), she'll be resentful if she spends like she has a raise and pays for it later, she's already counting her chickens before they hatch.\n\nIf she doesn't get the role, keep her in mind for something else suitable with a pay raise. Chances are if this \"hot-shot\" turns out to be full of hot air, you may have to reassign the position sooner rather than later, so keep her on the list.",
            "It's obvious hot-shot and the VP prepared for this together--either formally or informally. It's not spooky. It's grooming.\n\nGo celebrate with your friend. She worked hard and SHOULD BE PROUD OF HERSELF! It is not easy to give a presentation in front of a group let alone a full on job interview/proposal. That is a lot of pressure for anyone and she did a great job. She deserves praise and recognition because this IS a reason to celebrate!\n\nWe all can't get the jobs we interview for. This will likely be a really valuable learning experience for her and a great stepping stone to put in her toolkit next time she comes across an opportunity.\n\nIf she asks for details, do not tell her the other guys presentation was better!!!!\n\nEvery professional knows, you can knock an interview out of the park but if the company is looking for something specific, you might not be chosen for a job. You can't always predict that and it's not a personal rejection. \"A better fit\" is such a generic trope but often times it's true, if the hiring committee has decided they're really wanting to find someone with X attributes to meet the needs of the company that most people won't even know about--and the needs are always evolving. So just remind your friend of this and take her out for drinks when she gets the news.\n\n&#x200B;\n\nIn the end, you can remind her that the big boss and him have a connection, and the choice should feel less personal to her. Remind her that the position may be open again in the future or a similar one, and since she's already given such a great impression with this interview, it is setting her up for a receptive audience next time too!",
            "It’s clear in this thread who understands business and those who do not. \n\nDo not say anything about this candidate or the hiring process to your friend. Doing so can lose you your job and create a world of trouble.\n\nAs for your friend the best thing to do is to let the news occur without interfering. If the guy takes the job she’ll be disappointed but ask her if she did her best and remind her that’s all she can control.\n\nCronyism happens all the time and not everyone that goes to an Ivy League school is smart or talented. Same thing goes for people who are lawyers, doctors, etc. \n\nThere are plenty of people who put in the work but aren’t good at something because they lack natural ability. Do not conflate achievement with talent as sometimes they are not one in the same.\n\nI’m not sure how much some of you think VP could actually do to help a candidate on such short notice. \nSure they could point out sone key things but being slick and smooth well spoken and seeing what others have missed are almost always a natural ability that others lack. \n\n\n\n\n",
            "You're at work on the hiring committee.  Don't tank yourself to let you friend down.  If higher ups find out you are leaking stuff it may not reflect well.\n\nAlso, For all you know he could end up not accepting.  ",
            "Keep almost all of it to yourself - you aren't just friends, you are colleagues. I agree with everyone saying that you can mention there were some really great presentations, but leave it at that. Let Tina know you will be there to celebrate with her if she gets the position or hold a post mortem so that she can better her chances next time. \n\nThe reality is that you never know what is going to happen when applying to positions. She's doing herself a disservice by assuming she is a shoe-in for the position. ",
            "I posted before, but want to give another piece of advice. You can do one thing that can really help her. \n\n&#x200B;\n\nYou can ask the hiring committee to give her specific, constructive feedback. ",
            "I'm obviously too late, but HRM here. Do not give her a heads up. This could compromise your position at the company. I've had to let executives go for this reason.\n\n&#x200B;\n\nYou and your career first,",
            "Do not talk about what you witnessed in the other meetings. Just don't. Aside from being a breach of the expected confidentiality that is assumed with all things personnel related, you have no idea how this will pan out. \n\n&#x200B;\n\nThere is a chance the top candidate will turn down the offer. This happens more often than you would think. If Tina brings it up to you, smile and tell her the truth, that you can't talk about it and nothing is certain anyhow. ",
            "Great. Let me knows how this MBA that was given knowledge prior to his interview messes it all up in his new position. ",
            "Sickening. He was clearly prepped, tipped with info and groomed for the job. You were probably a witness to something very unethical (no matter how often it happens)\n\nWhat a shame. Would bet my last penny his performance at the actual job would not reflect his presentation.",
            "Damn, this sucks. A similar situation happened at my workplace recently and a dear friend of mine was denied a promo for a candidate that was, frankly, awarded the job under some shady circumstances. I waited until the official announcement was made to our office (she works for a diff dept now) and within seconds someone in our office had forwarded her the announcement.... and that's how she found out. I regret not telling her first, I was told the afternoon before the announcement and asked specifically not to tell her by my new manager. Anyhoo, once she found out I immediately invited her over for bong rips and shit talking (it's our thing) and listened to her and talked her out of doing anything rash that might affect future promotions in our dept. Good luck! I'm so over watching people get promoted under shady circumstances. ",
            "also perhaps be ready help immediately shift her strategy to getting a move up job somewhere else, if at all possible in your area\n\nnot give her chance to fall into funk or blame ( young guy got because age-ism etc )",
            "I would tell her how proud of her that you are., and how well she performed today. None of that is a lie. \n\nI would next let her know of this other person, who has some pretty strong qualifications. This can help her to be prepared for a let down. Once she sees his background after the announcement, she will better understand why she wasn’t chosen, and you will have been the friend to give her the heads up as soon as you could. Having been in the room, you will be putting yourself in a bit of a bind, but it will show her your loyalty to her. \n\nThat is all you can do for her for now. You can be that strong friend after as well. ",
            "You noted that Tina has been putting in overtime for 2 years and “trying to get noticed” for a promotion.  To me, that says this wasn’t “her job” to begin with; she applied, was deemed qualified, and was given the opportunity to interview.  People often don’t realize that there is a political game at play.  If you’re not leveraging it, you’re missing out on opportunities.  In this case, the job wasn’t dog eared for someone else from the start at all; it just happens that the right candidate came along a crushed it.  Sure, he may have been groomed for it, but if his knowledge and understanding was superior to the others candidates then it seems obvious he’s the first choice.\n\n\nIn my roles over the years, I’ve known of many people who were getting fired or laid off long before it happened.  It sucks, but it’s also my job to be professional and maintain confidentiality of information.  Should you tell her, no.  What can you do?  Let her talk to you about it.  If she asks, you tell the truth she did a good job, but then, he interviewed with a stronger presentation and greater understanding of issues and their solutions.  These are facts, not opinions.  Deal in facts, not feelings.\n\n\nUltimately, Tina was overconfident and assumed she was better than everyone else.  Rule #1 is you’re never the best or smartest in the room.  In interviews, you never know who the next person is or how well they are qualified.  This is a lesson she learns sooner rather than later.  Harsh, but it’s still the truth.",
            "Everyone here is wrong - I am assuming you are a person of color, as I am, and as tina is. \n\nYou need to give her a heads up on the down low. Its what you gotta do. ",
            "She should absolutely celebrate. Tell her you saw all the presentations and she did herself proud. But tell her that you saw the person they decided to hire, and he was clearly above and beyond anyone else. \n\nGetting a job isn't about being qualified for it, it's about being better qualified than anyone else there. She should absolutely celebrate that she has come this far in her career, that she was in the room and in the running. Not getting a job feels like a total fail, but it isn't. It's hard to know how you did compared to everyone else, but she has you who was there who can tell her she did great! But someone else blew it out of the park. ",
            "Let the company tell her then comfort her the best you can..hell maybe tell her to look somewhere else outside of your company because it clearly doesn’t appreciate her but that doesn’t mean other companies won’t, the hot shot might be “out of her league” but she’s a tenacious hard worker with experience..I’d say she’s still in a very good league of her own..if I were her after hearing the bad news I’d start looking for better positions outside of that company and quit as soon as possible..buts that’s me ",
            " If you fail to tell her the 100% truth, and she finds out that you withheld the facts from her, she will perceive you to be a fake friend.  Tell her everything that you told us. ",
            "Guarantee the hot shot was groomed to give the presentation. Bet he can't walk the walk though.",
            "Sorry to hear what happened to Tina. Pretty typical for management to choose those who do an impressive sales job during the interview, nepotism, or brand name of Ivy League education over loyal and proven internal assets (like Tina). The situation for Tina really sucks, but for her own benefit, it would’ve been a much better use of her time to source her own opportunity supplies at other companies or potential clients for her own consulting practice. Even starting a T-shirt company on the side would have been a better use of time. \n\nWith respect to tonight, just gently ask for her backup plans while hinting about the presentation.",
            "[deleted]"
        ]
    },
    {
        "post_id": "g8zo4o",
        "author": "NightArmadillo",
        "title": "[Update] my (21f) boyfriend (24m) doesn’t want me posting pictures of me in shorts",
        "url": "https://www.reddit.com/r/relationships/comments/g8zo4o/update_my_21f_boyfriend_24m_doesnt_want_me/",
        "score": 2834,
        "num_comments": 225,
        "created_utc": 1587990093.0,
        "selftext": "I just wanted to make and update to this post that I made from about a month ago for anybody interested :) [https://www.reddit.com/r/relationships/comments/ft1whw/my\\_21f\\_boyfriend\\_24m\\_doesnt\\_want\\_me\\_posting/?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/relationships/comments/ft1whw/my_21f_boyfriend_24m_doesnt_want_me_posting/?utm_source=share&utm_medium=web2x) \n\nI took in everybody's comments and my own feelings into consideration and sat my partner down for a serious talk after our fight. (im sorry i didn't practice proper social distancing. i drove to his apartment to have this talk because i felt that it would be better to have this discussion face to face rather than thru text or call as our fight was thru that medium) I also reiterated why this was important to me and brought up all the points you guys made and really made him listen and consider. \n\nAnd surprisingly, he took it really well! There were some tears here and there but in the end he understood my point and he apologized for not being completely considerate of me and my choices. He said he wanted our relationship to work and he was sorry for hurting me through his actions and he'll try to be better in the long run. He also said he didn't want to be that person that takes away my freedom and my choices just because we're in a relationship. (I sobbed really hard at this one lol)\n\nSo overall that turned out pretty nice and since then we've been smooth sailing. We also decided to quarantine together as time apart raised some tension between us and neither of us wanted to catch anything or infect anyone and not adhere to proper social distancing by still travelling back and forth to each other's places. \n\nJust wanna say thanks you guys <3\n\ntldr; boyfriend understood my pov and the points that you guys brought up, apologized and promised to be better! now we're both stuck at home and happy :)",
        "permalink": "/r/relationships/comments/g8zo4o/update_my_21f_boyfriend_24m_doesnt_want_me/",
        "comments": [
            "I feel like these types of behaviors and actions are things that everybody goes through between 17-25. Most people don’t figure out why that type of controlling aggressive nature is wrong until they’re in their late 20s or early 30s. Normal, people typically don’t put those kind of expectations on their significant others because it’s controlling and cruel , but people with cultural or social expectations don’t understand why they feel the way they do and don’t understand how irrational their actions and behaviors truly are. I’m so happy he is willing to learn from this , this will make him a better person going forward.\n\nSo many people I know have had to deal with this type of stuff, with varying degrees of understanding . It makes me sad knowing some people can’t understand the damage they do with this behavior long after the relationship is over, if you could tell your boyfriend this is one of those situations where you’re going to have to learn to understand your actions, and you’re going to have to keep working on a rational perspective. He’s far ahead of most guys and girls his age if he’s able to fix this . Good job!",
            "Another testament to what good and honest communication can achieve in a relationship.",
            "I’m not trying to be a Negative Nancy, but keep an eye out for behavior changes. Went through something similar with my ex, he backed off, but the entire time he manipulated me and it just went back to controlling, only I thought I was the one at fault. That probably doesn’t make a lot of sense, I just really don’t like getting into it. Not saying your boyfriend is a manipulative asshole like my ex was!! I just didn’t know how manipulative he was until I finally got out. Although we were younger than you guys are. So maybe that makes a difference.",
            "How dare you show your legs",
            "I'm glad you feel like you've worked it out. I would caution that his reaction was so over the line in the first place, that you should be careful to watch that his behavior really does change. Apologies aren't worth anything if they don't come with behavior change. \n\n\n>He also said he didn't want to be that person that takes away my freedom and my choices just because we're in a relationship. (I sobbed really hard at this one lol)\n\nThis is a very, very low bar for a relationship. It worries me that it seems like such a wonderful thing that you have an emotional response. To me it sounds like saying \"He also said he didn't want to be that person that who lashes out violently when he's frustrated. I sobbed really hard at that one!\" \n\nI think you need to do a real hard check on your expectations for a relationship being more than a lack of horrible behavior.",
            "Wow I read your original post and I have to say sounds a lot like my ex boyfriend two years older than yours, muslim as well, dated for a few months. He was extremely controlling. I couldn't go to the gym and if I did couldn't wear attire that was too tight or revealing, wasn't too fond of me wearing bikinis, and once on vacation he made me change to a turtleneck sweater because the top I was originally wearing was too sheer. (Light pink long shirt). I'm glad you both came to a mutual understanding and worked through your problems.\n\nUnfortunately for me he was to set in his ways and decided to walk away because of his issues. My advice to you is set boundaries and talk about what bothers you but don't let him govern you.",
            "Showing your ankles in public?! Scandalous!",
            "I am happy you guys overcame it :)",
            "I don't want to be negative but you should be careful, I am an ex-muslim female myself and let me tell you Muslim men are pretty controlling and possessive, no matter how much they tell you that you're free to do what you want they will silently judge you and will slowly try to control you. If he is a Muslim then he knows that Allah won't be happy with 'his woman' wearing revealing clothes and he would eventually want to please his god. Even if he is not religious now there's always potential of him becoming more religious later and then he would want you to cover and later maybe want you to convert. \nBut then again what do I know? he might not be religious at all, I mean there's nothing islamic about having a girlfriend in the first place lol \n\nBut yeah having said that I am glad that you worked it out because obviously this doesn't apply to all Muslim men I just wanted to give you different perspective and I wish you all the best <3",
            "[removed]",
            "This is awesome. Happy quarantine-ing!",
            "I'm really happy for you guys! Lots of maturity on both ends. Wishing you all the best. :)",
            "Hey! Glad it worked out with you and your boyfriend, OP. I'm a white atheist and in a relationship with a muslim guy also. He's (in my view) very religious, praying every day and living by the 'rules'. He understands that his religion starts and ends with himself, if you know what I mean. He doesn't tell me to stop doing something because his religion said so. I'm glad your boyfriend saw that, too. However, for me and my boyfriend religion will always be the biggest issue, it's just inevitable. He wants me to convert if we get married (have been together for 3 years now) while I don't believe in any god. Just a heads up about that, I know you're probably not at that point yet, you're both very young. Anyway, I'm not sure what I was trying to say but good luck to you. I hope it will be smooth sailing from here on out ;)",
            "I'm glad you and your boyfriend were able to communicate effectively and reached a good understanding.",
            "i’m really happy this worked out for you, OP! my ex did the same thing but he’d compare me to “sluts” and the like. Found myself someone who is much more accepting and loving and i’m much happier now. \n\nAll the luck to you both!",
            "Yay for him! Yay for you both!!",
            "He was probably jelous, in not wanting other men to look at your legs.",
            "Reading your original post, I find it a bit shocking that he doesn’t allow you to wear bikinis or two piece swimsuits. Is this common in your region? Where I live, that would be considered extreme or fundamentalist. \n\nEven many of my more conservative Christian and Muslim friends and colleagues still wear bikinis and two pieces. We’ve even had work pool parties and group outings where women were wearing two pieces.",
            "I don’t know OP. You seem to be requiring his permission, make him feel like he needs to be informed of this. But you’re not okay with it. \nRemember setting boundaries is very important but it cannot be set after you let someone cross them.",
            "Im pretty sure he is saying he wants you to wear long shorts and and a full body swim suit cause of his religion and if thats  the case he is a hypocrite cause islam says no bfs or gfs",
            "[removed]",
            "Concentrate on his actions, not just his words. Hopefully he sticks to his new thinking but a lot of people won’t. \n\nI also hope you get yourself a bikini too if that’s what you want to wear!",
            "Waaay too much control over some shorts. Red flag for future controlling behavior if you can’t come to a compromise or sway him your way. But in no way should he always be controlling how you wear your clothes, unless it’s a fun activity thing that has less to do with his control so much as his input. Be careful OP",
            "The proof of this pudding will come in about 2 months, when you have posted many photos of yourself in shorts. Good luck.",
            "Ummmm if he's non practicing then shorts should not matter to him... Muslim men are 100% control freaks if you're smart you will pact your thing's and run like hell..",
            "[removed]",
            "[deleted]",
            "I went back and read the first post. Most of the comments were of the \"empower yourself\" variety telling you that you were doing nothing wrong. They are \\*objectively\\* correct. No one should control you and no one should tell you what you can and can't do with your body.\n\nOn a more \\*subjective\\*, I-like-this-guy-and-want-it-to-work level, I think this situation is more nuanced than a pure \"you go girl he doesn't own you!!!\" posters are willing to admit. The subjective part is your motivation for posting those pics and, depending on that, even though your boyfriend is cool now--it could come back as a problem again.\n\n&#x200B;\n\nIf you took some shorts and b-suit selfies to share with your friends about the fun activity  you were doing (and hey the pics make me look cute!) then no problem. If any part of you was posting those pics to elicit positive feedback on your appearance from men/others then it could become a bur under his skin. And I don't think the \"fragile male ego\" and \"get over yourself\" crowd is fully allowing that most people have not yet reached zen-like levels of self-confidence. But that doesn't mean they're necessarily evil abusers in waiting.\n\nIt means something to people in a relationship if your S/O needs constant sexual/appearance affirmation from others. It suggests there could be problems down the road with other boundaries. Willingness to compromise has to be a two-way street and if every fight becomes \"I won't bend!\" then every skirmish becomes a war and couples can't last too many wars.\n\n&#x200B;\n\nI'm not saying you did anything wrong. That bears repeating. You didn't. I'm just asking if you're 100% on your motivation for posting them. If there's a potentially relationship damaging aspect then you should be honest with yourself that maybe he's picking up on that too.",
            "[removed]",
            "Happy it worked out for you",
            "1) Thank you for updating us on your situation. Its very considerate and I appreciate it. \n\n2) I'm really happy you were able to have such a healthy discussion. It reflects a lot of maturity for both of you, which is always a good indicator about your relationship and its potential to survive. I hope you can remember this moment and continue to move forward in a way that makes each other happy. I wish you the best during these times. Cheers!",
            "I should not of written anything.. someone sent me a text about answering this problem.  Sorry.  I don’t know",
            "Of course it’s okay if I don’t know because I don’t know.. I also think you are not at liberty to tell me it’s alright I don’t know ... because you are not in control of me!!!",
            "I'm honestly more surprised that you were already in summer weather a month ago while here we're under 10°C. How do we get the warmth dammit!",
            "I'm glad that this worked out. I'm curious on everyone's thoughts on a situation that removes the muslim/christian cultural differences and just focuses on a purely western perspective. . . \n\n\n From my understanding, showing bare legs in muslim culture is sexual. In this case, from your BF's perspective/culture, other men could be getting some degree of sexual satisfaction from looking at you which is what made him uncomfortable. . . \nFrom a western perspective, we could change the hypothetical scenario to you wanting to be topless or nude at the beach which would be more sexual at least from an American perspective. Would he be wrong in requesting that you compromise by not being topless on the beach? I feel like this scenario could speak more to grey areas that need are between healthy boundaries and controlling. . . . \n\nTaken to a more extreme situation, what if you wanted to make money masturbating on a webcam? It's your body, but would your boyfriend be controlling to request that you don't do this based on other men finding sexual pleasure? Again just asking for conversation sake.  \n\n**TLDR - what if we minimize the culture differences and focus on the boundaries/controlling area?**",
            "Hello op, I am glad it worked out for you!\n\nA lot of people touched on the point to keep an eye out for him to actually work on it and try to be less controlling (as opposed to just apologizing and not changing) and one thing I wanted to add is to watch for external factors that gave him that initial viewpoint. This can be culture and family (which feels like this is the cause) but that it can pressure him to go back to acting the way he is before.\n\nIf similar events happen in the future, in addition to talking with him again, check to see where the impulse came from (but do not let it excuse his behavior.) A part of changing unacceptable behavior is taking responsibility for it and controlling/be aware of external factors that may exacerbate that behavior.\n\nI hope you are staying safe and good luck with everything!",
            "This is way too much writing for such a little problem. Also how is going to your BFs house gonna spread Coronavirus -_-.\n\nGrow up",
            "Pics or it didn’t happen!",
            "I find that men who are uncomfortable with revealing clothing are projecting. See, they check out all these hot numbers in revealing clothing, so when it comes to their “possession/you”, they are all upset about all the men checking them out. Because they know damn well that’s what they do. So if you have a “man” who is constantly checking out other women, he’s absolutely going to be upset if you are one of those women. \n\nIt’s sad really how society has portrayed men gawking at women to be acceptable. But the moment you are actually that woman, you are put in”your place” by that man. As he continues to stroke it to porn. And your neighbor.",
            "A big fuck you to all of those who accused your boyfriend of being an asshole and advices you to break up with him over this thing. This is proof that things work if you want them to!",
            "Congrats on working it out !",
            "woah. im glad he actually listened to you instead of being aggressive. he clearly wants the relationship to work but you cant let him control the rs too much",
            "I went back to the original post and saw:\n\n> so my boyfriend and i are from different religious backgrounds—he’s muslim\n\nWhy am I not surprised.",
            "A Christian woman dating a Muslim man will not end well",
            "I hope he finds someone like himself.",
            "Let's continue to ignore the elephant in the room: his Muslim background. There is a reason why the worst places on Earth to be a woman are Muslim countries - Islam is the most misogynistic ideology on the face of the Earth. \n\nOf course no statistic would change OP's mind (because love) nor would the hell of a red flag she just experienced herself.\n\nThe odds this of this relationship working out are incredibly slim, but I guess she'll have to learn it the hard way (quite sad, really).",
            "Dump him.... Be your independent self",
            "That’s crazy. I let my gf post pictures of her with no clothes on.",
            "\"my boyfriend is Muslim\" yeah there's your first red flag",
            "[removed]",
            "Hey OP! I’m glad you and your boyfriend worked things out :) it seems he is trying to understand where you are coming from and putting himself in your shoes. I hope he continues to do this for you. I know it can be hard when you come from two different religions. However, im seeing a lot of comments generalising/stereotyping ‘muslim men’ and i hope it doesn’t effect what you think about ‘muslim men’ or ‘muslims’ in general. I think people forget that culture and religion are two different things. While i do know religion plays a big part in some cultures, its best viewed separately. You said you live in conservative country so culture and upbringing might be why he acted the way he did. Might i ask where you live? I live in non-conservative country and Im muslim myself not very practicing though and my boyfriend is, i guess, no religion but doesn’t like that i wear short shorts or mini dresses when i go out. He says and thinks that its a sign that im single and that other men can have a look. I understand and respect his thoughts on it because culturally i come from a conservative background whereas he doesn’t which is interesting. Anyways, OP you and your boyfriend are still young so just enjoy and have fun quarantining together. Good luck xx",
            "[deleted]",
            "[removed]",
            "Post a pic for us so we can judge",
            "You know I believe if you are wearing your shorts on a beautiful day I don’t see what the problem is.. short shorts and long shorts??  I just don’t wanna believe this girl is making her boyfriend sweat because he said once or whatever.. no don’t wear shorts.... I think it’s a power thing and she’s dragging her boyfriend through the mud... and what I can’t believe is he’s letting her have control of the whole incident.. man you gotta stand up and be a man!!\n\nPosting pictures with shorts??  OooOhh man so why are you picking on your man?  Well I thought before it said girl (f) but now they’ve changed it to two males.. I don’t care!!!\n\nI know nothing Muslim relationships and I should never have written anything.. Even more to the point I know nothing about gay relationships., next time can you put all the facts in your story.  Thank you.,",
            "Lol. Your bf knows why he doesn’t want you posting pictures in shorts. I wouldn’t either. Difference is I would never grant you a serious bf-gf relationship.",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "221tki",
        "author": "Ofcourseitsa",
        "title": "Me [30F] with my bf [30M] X4 years, he is planning on cheating this week",
        "url": "https://www.reddit.com/r/relationships/comments/221tki/me_30f_with_my_bf_30m_x4_years_he_is_planning_on/",
        "score": 2828,
        "num_comments": 516,
        "created_utc": 1396476049.0,
        "selftext": "Link to original: http://www.reddit.com/r/relationships/comments/21v8xr/me_30f_with_my_bf30_m_x_4_years_found_text/ \n\nIf I didn't do that right I apologize, long time lurker of reddit and not much experience posting \n\nFor all wondering it went fluidly: I got up, showered, packed my lunch, and left for work. The hardest part for me was saying goodbye in the morning. It's my routine that I wake him up, he gives me a kiss, tells me he loves me and tells me to be safe. It was all \"normal\" to him and he did just that. Tears were threatening to spill over the entire time he was saying goodbye to me, and believe if it had not been dark, he would have known something was up. (I wanted to yell and scream, at him, but I didn't) \n\nI left, treated myself to breakfast in an empty park and waited. The nanny cams that I bought have a live feed option thru your smartphone. I ate my breakfast while watching him clean up the house, watched my dogs torture each other (I left the dishes from dinner last night in the sink on purpose, petty I know but I needed to get some kicks in).  \n\nThen she came over, there wasn't much fanfare, he placed the dogs in the backyard, she came into the living room and then things started happening. I let it happen, I let both of them get comfortable, move into the guest room waiting for things to heat up a little more. I had switched all the exhaust fans on throughout the house before I left( they cover up some noise and the door can be noisy). I parked right in front of my house and managed to open the door without being too loud. \n\nI had decided that just walking in like I normally do and putting my stuff down in my normal chair was the way to go. I closed the door put my stuff down (all while watching them on the camera) and called out as I'm walking down the hall \"Hey babe?! Guess what, I got cancelled! Where are you?\" \n\nScreaming ensued from her(I redditor called it!). Lots of \"Oh my god, you said she wasn't going to be here, what the fuck is wrong with you.\" while scrambling to find something to cover herself. I managed to act surprised and said something along the line of \" Does someone want to explain what the fuck is going on?\" \n\nI managed to not get on my soapbox and preach at the fat slag, I found her fat ass running out of my house covered with a towel and yoga pants around her knees to be much more humorous. \n\nHe was dumbfounded, he could not say anything for at least 10 minutes. I maintained silence as well, I just stood there and stared at him with the \"uh hello.... you need to explain the naked chick that just ran out of my house\" look. \n\nI couldn't stand the silence anymore, I had to break it. I said \"I did nothing to deserve this kind of treatment, this is not the way you treat someone you love.\" I then walked into my bathroom and proceeded to let myself cry silently for about 10 minutes. During that time he came to his senses and was trying to weed himself out trouble using every excuse in the book. Telling me he thinks he is a sex addict and wants help....blah blah blah. \n\nAfter my tears were dry I opened the bathroom door and just said, \"Please get your things that you can now, get a friend to help you with your large things tomorrow while I am here, I am changing the locks tonight and you are no longer welcome here\"  \n\nI proceeded to make myself a bump on a chair watching netflix and cuddling my dogs and totally ignoring the hurt puppy dog eyes and crying fits he was having. \n\nHe took all his clothes and he left, he had a friend pick him up. I had a(married) guy friend(Friends with the wife as well) pick up another lock set and install it for me as I am totally fried. It took me more than a few hours to sort everything out to where I can write it down. \n\nAs for me, I'm hurt, upset, pissed, but I can smile, I have my dignity and I got just what I wanted. \n\n\n---   \n**tl;dr**: Update: Caught him in the act, only a little bit of drama ensued, no police were called, no one fought. He cried, groveled, I stood my ground.  \n\nAs the original was deleated this is the jist: email auto signed in on his computer(mine crashed, used with permission) title of most recent email was something to the effect of \"Can't wait for next week\" He had replied. I read it. Chaos ensued",
        "permalink": "/r/relationships/comments/221tki/me_30f_with_my_bf_30m_x4_years_he_is_planning_on/",
        "comments": [
            "Am I the only one who was waiting all day for this update?\n\nYou are a class act. I completely understand your need to see it with your own eyes to make it stick. \n\nIt sounds like you have a really good head on your shoulders too. Give yourself a couple days to feel crummy and then try and stay busy. I wish you nothing but the best and I know someone amazing will come along for you. ",
            "You done good.\n\nI know it must hurt, but at the same time I know I would have felt the same - I would want irrefutable proof. He's an asshole, and I'm glad you're rid of him.\n\nMad props to you, OP. Hope the netflix binge is going well and hug your dogs for us!",
            "Oh my god you delivered. You're my hero.",
            "I know it hurts but you're a badass and should be very proud of how you handled that. I think I would've grabbed the bitch's hair and slung her out and gotten charged with assault, so good on you for keeping your calm and handling it like a champ.",
            "[deleted]",
            "This is so cool!  \n\nI never understood how someone could look their partner in the eye, knowing they were about to betray them, and not show a care in the world.  My ex wife did that, and I never understood it.  \n\nAnyway, what I've learned since is there are people who don't have that character defect, and who value honesty and their partner.  Don't let yourself go back with this guy, instead find a guy who thinks you standing up for yourself is one of the coolest things ever - when you're ready!  ",
            "You know that anxious lump in your throat that happens when you're confronting someone? I had that while reading your update. Holy shit, I can't even imagine being as collected as you while doing this. I would have been an utter mess.\n\nMake hot cocoa, cuddle puppies, watch good movies, look in mirror and stare at the badass hunk of awesome looking back at you, repeat. You're amazing. <3",
            "Proud of you. An especially good job on not punching either of them in the face.",
            "Original was removed?",
            "I am fucking terrified of men like this. They kiss you goodbye and tell you they love you, and then turn around and put your sexual health at risk. I had a girlfriend who got trich from her bf who barebacked a prostitute. What the fuck is wrong with people. ",
            "You...are freaking AWESOME! This was the most satisfying update I've read in a long time. \n\nYou had a plan, you stuck to it.\n\nI give you the biggest interwebby high five I can and I hope you enjoy this glorious day!\n\nAll the best, OP, and biggest hugs. Know you are kinda my hero now. ",
            "You go glen coco! I am so proud of you, you did something I never could have. ",
            "You're a pretty decent Writer. Reading the Update I actually felt nervous for you as you're describing your Morning and a bit Jittery and impatient at the thought of all that waiting. Then watching; I couldn't have done it. The second I saw it get intimate I'd have to stop. It's easier to empathize when you've been there.\n\nSex Addcit, really? This is now a common excuse? Is it just me or does it seem like no one wants to accept responsibility for anything anymore? It's always some external issue or reason forcing their hand, unbelievable.\n\nThat took some guts and I hope you got what you needed from it. Glad things didn't turn into a shitstorm and you can now move on and start to heal. \n\nGood luck!!",
            "That was some delicious /r/justiceporn",
            "So I feel like I need to point it out, but this may have not been the first time he's cheated. It may be a good idea to get an STD test to just to ensure that you're healthy.",
            "If there were like... reddit academy awards, OP would win /r/relationships this year.",
            ">As for me, I'm hurt, upset, pissed, but I can smile, I have my dignity and I got just what I wanted.\n\nI have read the entire thing, and you know what. If I were you, I would not have changed a single thing. Maybe act extremely casual when I find them in the bedroom, just to fuck them up even more. I had a similar experience (it was only a kiss on a drunken night out) but I made the bastard cry, and that's what kept all my hatred away. \n\nI was hurt also, at the time. But.. only for a day or two. I still had dignity, and I could still smile, socialise, go on with my life. Seriously, we would be good friends in real life. (Y)",
            "I'll never understand how cheaters will act normal with their s/o by kissing them, telling them they love them, etc moments before or after they've cheated. So sad. You did the right thing and I wish you well during this time of heart ache. You so deserve better than this.",
            "There's a ton of \"You go girl!\" comments here already, but I just wanted to add my own. This was amazing and you handled it beautifully.\n\nYou sound like you have a great head on your shoulders, so this probably won't be an issue. However, if for some reason you find yourself missing your ex in the future, or wondering \"Did I do the right thing?\", you can log in and read all these responses to reassure you that yes, you absolutely did the right thing. Any, you have the support of tons of internet strangers to remind you of how strong you were in the midst of one of the worst possible situations.\n\nMajor kudos to you, and I hope you move on from this and have the most fantastic life!",
            "I've been crossing my fingers for you since Monday, OP. Good on you for handling everything with such class. Keep that smile on your face, you deserve so much better.",
            "Was it hard to watch the action as it was going on? I can only imagine that hurt you felt at that moment.",
            "[deleted]",
            "Any way we can read the original? You are pretty darn cool btw.",
            "Wow, how did you buy and set up the nanny cams so quickly?",
            "You are one bad ass OP!! ♥ hugs!",
            "I'm in my break room at work and I literally said \"fuck yeah!!\" XD you go girl! Don't take shit from anyone (:",
            "I've been waiting for this. I just wanted to tell you that YOU ARE FUCKING AWESOME.  I don't even know you and I can't express how proud I am of you to keep your cool and then do as you planned. I've had so many friends get cheated on or catch their SO cheat and still go back. It's ridiculous and a waste of time. Let yo self have a few chill days and TREAT YO SELF. And I don't mean by looking for feelings at the bottom of a pint of hagen daz.  So proud guuuuuuuurrrllll. Cyber high five.",
            "You are my hero! \n\nI can't imagine the hurt or betrayal you are feeling right now, but I also imagine, that there is a sense of a weight being lifted from your shoulders. You'll find a much better guy. I used to be so devastated when a breakup came, thinking \"My relationships never work out!\" And I realized something happy from that: No relationship will work out until it's the right one. :) \n\nHope that helps a bit, you are a trooper, my friend. You got this. We all believe in you!",
            "Holy shit you rule. ",
            "This may well be fake, but I hope not as I relate very well to it. I kind of go emotionally flat and operate very calmly and logically when I'm knowingly betrayed by someone.  Having made mistakes when I was younger that resulted in extended sloppy dramatic outcomes, I no longer am able to allow that kind of chaos to unravel in my life so when I see it coming I handle things much like you did.  Some people find me oddly cold because of it, but they are usually the ones attempting to wield me harm.",
            "Just found this. Am in awe. You are an inspiration. Wish ALL the best for you!",
            "I was waiting for this update!  Well done, OP!\n\nEdit:  I also want to wish you the best as you move forward.  Things will be better.",
            "> I closed the door put my stuff down (all while watching them on the camera) and called out as I'm walking down the hall \"Hey babe?! Guess what, I got cancelled! Where are you?\" \n\nCinéma vérité. Nicely done.",
            "It's going to hurt for a long time. Just know that you are special and deserve someone that sees that. ",
            "Good for you! Don't forget to take time for yourself. Pamper yourself and just work on feeling better <3 ",
            "You are a brave woman. I admire your honesty, you managed the situation at your very best. Walk with your head up high, you are a person with great resources. You will be fine I promise you.",
            "[deleted]",
            "Wow, you are a badass, OP.  Good on you for standing your ground and handling everything calmly.",
            "Wow no one in the last thread wanted you to do it, but now they all think it was awesome. And it was, OP, and so are you. Here's to your future without that scumbag!",
            "Would love to send you a break up gift basket filled with goodies. Sugar and beer will dry up those tears! ",
            "I am sure it has been said about 226 times by now, but you are a badass",
            "This is gold. \nYour original post was removed but I still got a kick out of reading this.\nGood for you :) This is perfect.",
            "Was hoping you would do my suggestion... ",
            "I have a new hero.  You're a champ!",
            "Couldn't read this without letting you know that you have successfully fulfilled everyone's fantasy when there is cheating. It was like movie magic: the set up, the fall, your composure. \n\nBut seriously, you fucking go. Don't know this guy, but no one should ever do that to another person. Hope you enjoy your trip and please know that you are an inspiration to me....as weird as that may sound. Breakups suck, but you are better to rid yourself of this guy now (think about if you were married, or if you had kids). Life has a funny way of throwing curve balls. But, you pick yourself up with the hope that a year from now, you will see just how strong you are in this moment.",
            "You're amazing! Of course you are in pain but damn you are handling this really well. I'm sorry you had to deal with any of this though. You going to let him know you have it all on film? :) ",
            "That couldn't have gone any better! I've been waiting for your update from Australia, not being sure of the timing (it's Thursday afternoon here)... I must've checked about 6 times.\n\nBest of luck to you for the next chapter of your life. No doubt you'll look back and see how things all worked out for the best. I've got high hopes for you =)",
            "This sounds really fake but good job I guess",
            "Found this. I'd be interested to know how your doing 5 months onward?",
            "Dear diary,\n\nToday was a good day. OP delivered....",
            "You are AWESOME! I know it hurts like hell right now but you did the right thing. You're brave and strong and you'll be just fine I know it.",
            "I hope he gets eaten by a bear.",
            "i really hope the best of you by the way. Thank you for sharing your story",
            "If you're near Fresno, I think we should get bottles of wine. You're amazing for following through. Keep us posted. Hugs.",
            "Good job.  Fuck cheaters.",
            "Good Job OP!",
            "Goddamn my heart was beating so fast the whole time I read this post. Go you, you are a serious trooper. You will be 100% better off.",
            "Damn!!!!! That's the way to do it...\n\nIf you want to fuck some slut from yoga class the your going to get your shit and GTFO.\n\nProps to you. ",
            "Way to go!!!  Wish you the best.",
            "What you did was amazing, clever, strong.  I got a little teary-eyed reading this, feeling what you must have felt while you watched your bf be unfaithful on tape.  ",
            "Can we get the original thread? You linked to it but it's deleted.",
            "I'm crazy impressed =]  *high five*",
            "Hope to read about you upgrading after you heal.",
            "Thanks for updating and so glad it went well for you!  **So** glad that it didn't escalate and you didn't have to call the police. You are such a strong person and deserve so much better than him and you handled yourself so well! You are such an inspiration for other people who are looking to end relationships.",
            "In your first post did you say anything about if you thought he had done stuff like this in the past.\n\nThis can't be his first time especially if he is claiming to be a sex addict. ",
            "I am so sorry :( but it'll get better.  Fuck him, so glad you kicked him out.",
            "Wow. Good job. I'm glad you held it together,  you deserve better. ",
            "[deleted]",
            "i'm so impressed and in awe of how you handled this. perfect follow through! good for you, lots of self-care is in order. and absolutely go no-contact.",
            "Wow. I am so happy for you, you are absolutely amazing. Please make a stop in south Florida soon so I can buy you a victory drink!",
            "I was waiting for an update to this, and I have to say, you handled that really well. \n\nI'm glad you stuck to your guns and had him leave, and you left the whole damn situation with every shred of dignity.\n\nYou'll hurt and you'll feel shitty, but you'll get past it. ",
            "BIG HUGS. So very proud of you! ",
            "Kudos to you! I'm glad you stuck it through and did what you needed to do. Enjoy the red wine and love those puppies. You'll be just fine before you know it. ",
            "You are an amazingly strong woman, and you did the best thing you could possibly do for yourself and your future. There is nothing at all wrong with you, and you will do so much better than him. He, on the other hand, will never get anyone as close as good as you. :)\n\nGood job. Stay strong.\n\nHave fun with your binge, it is well-deserved.",
            "You are awesome! Have a super fun road trip :-)",
            "You go girl! No one deserves this and you 100% did the right thing.",
            "Haaha, well done!!! :) Now you have space in your life for an improved partner... but enjoy your freedom for a while first.  ",
            "I'm so sorry :(",
            "You are an amazing women. The control you exhibited and class you portrayed is epic. Good on you for finding out now. Better for how you handled it.",
            "Damn girl.  Well played.  I've been waiting for the update.  All the best going forward!",
            "I'm so sorry honey. You did the right thing. ",
            "You're awesome.",
            "You. Are. My. Hero. That was amazing. ",
            "I'm so, so proud of you. And you handled this unbelieveably graciously. He is a total piece of shit and i'm so glad you got out now.\n\nTake care. <3",
            "*All the hugs and chocolate*\n\nI'm so sorry that this happened to you, no one deserves this. You kept a level head and waited to see how it played it. OP, you did everything perfect. You wanted to see it with your own eyes and you did. It must get hurt, but things will get better. You're seriously awesome and I wish you all the best!",
            "You're a hero. Well done and enjoy your wine, sweets and puppies. You deserve them.",
            "You handled that like a boss. Good for you. I hope you get over him quickly and can move on soon. ",
            "Good work OP.",
            "You seem a very proud and independent woman,good for you to take your stand and kick him to the curb.",
            "This makes me terribly sad for you OP :-( I'm so sorry ",
            "You. are. AMAZING!\n\nI would have never had the girly-balls to do that.  \n\nI was glad to see in your first post that your immediate reaction was to leave him too.  I've never understood those who stay with cheaters.  I could never trust them again.  There'd be no point in trying to work it out. \n\nAnyway, if you feel like talking to someone, you can always PM me! I'm taking a lazy night, so i'll probably have Reddit up all night as well :)",
            "Good for you! Glad you got the closure needed.\n\nWhat a fucking pathetic douche bag, you go girl :D",
            "Yeah girl!  You did awesome!  So much more dignified than when I was in the same situation many moons ago.  You're my hero today!  Onward and upward!  ",
            "Well shit, that sucks overall but you seemed to handle it very well all things considered.  Wish you nothing but the best of luck in your future love endeavors.",
            "f that guy\n\ni'm glad you found it out and can now move on to much better things. don't think twice about him. \n\nbest wishes",
            "eyes welling up while living vicarously through your post :'[ \n\nshared your experience with my boyfriend so that he wont consider being so cruel.",
            "My husband and I both applaud you and your calmness. Keep up the strength you've shown.",
            "\nI am happy you got out of this relationship. I am curious as to the video of it happening. Watching someone else get caught for being such a prick would make my day better. ",
            "I don't know that I would have been strong enough to stick to my guns; you were. Congrats for that and I'm sorry you had to go through this!",
            "This is something i wish i was strong enough to do with my ex-wife when it first happened as i was the fool and she was the one playing. \n\nIt took 9 years for everything to go completely downhill and finally come to a crashing halt.",
            ">Telling me he thinks he is a sex addict and wants help....blah blah blah.\n\nThat's pathetic. What a terrible excuse to cling to.\n\nYou are much better off",
            "You are very strong. I felt sick to my stomach just reading your description of leaving the house, going to the park, and watching them. I can't even begin to imagine what you must have felt. You definitely already know you are worth more than that and best of luck for the rest, you deserve someone good!",
            "Damn, you handled that like a *boss.* Kudos and much luck in healing yourself after this asshole!",
            "8.3/10 OP, I'm so happy you didn't take any of his shit and stood your ground.\n\nThings will look up. For now, just remember how amazing you are :>",
            "This is so insanely satisfying.\n\nI'm sorry it had to come at the cost of your relationship. I hope the road ahead isn't too full of bumps and that you recover well. You handled this (IMO) perfectly. Glad he's out of your life.",
            "Bravo.",
            "/r/thathappened",
            "POWERFUL.",
            "You are pretty damn amazing. Props for keeping your cool. I would have thrown it in his face that I had known the entire time. And her? Sweet baby Jesus, she is a ho. Who sleeps with a guy that already has a gf? And in their own home? At least he had the courtesy to go into the guest bedroom, and not yours(although now I'm thinking he did that to cover his own ass). Ugh. Anyways, good luck! You deserve much better!",
            "This has been on my calendar all day. Thank you for updating. ",
            "What you did was totally badass and took a lot of courage. Thank you for the update and good luck going forward. ",
            "You're awesome. I'm sorry that this happened to you, but thank you for the update. ",
            "Don't forget to hit the gym too, having something a bit physically draining to focus on can really do wonders for balancing out the emotional drainage. \n\n",
            "I don't usually come to this sub, but this story was badass you handled it so well! I don't even know you but I'm proud of you for what you did.",
            "Sorry how everything went down but atleast  you know now what kind of \"man\" you had... You sound like a strong women hope everything works out for you. Stay strong =)",
            "Congrats. You seem like you have a good head in your shoulders. Hopefully, if a healthy loving relationship is something that's important to you, you'll find someone as stable and awesome as you :)",
            "Good job. You did the right thing and got the closure you needed. Kudos. Enjoy the rest of your life without that jerk. ",
            "I must have checked reddit 20 times for this update today. While I'm sorry your hurting I'm glad you caught him in the shameful act. His reaction and excuses prove he would have denied it to the end if you had have caught on post coital entanglement. I'm glad you have your dignity intact and had such a solid plan from the get go. Take the time on your trip to mend. \n\nI wish you nothing but the best and thank you for being such a strong woman, your actions make you a role model to many as you have clearly shown how important standing up for your self and confronting an issue is.",
            "I just want to say you're awesome. Take some time to be kind to yourself and pat yourself on the back. I would've lost it as soon as I saw the email. You're one hell of a strong person. Good things are definitely coming your way!",
            "What he did is totally not okay in the slightest, but letting this happen and then just walking in seems so fucking bizarre to me. ",
            "I'm very sorry that something of this nature happened to you. But the way you handled it was awesome, and even though it was painful for you, I respect you for it. \n\nI once had a girlfriend start a fight with me, only to leave me at school to go \"clear her head\" when we already had planned to do some studying together in between classes. Hours pass and I don't hear from her until she says that she went shopping at the mall before her work shift started, and that she was skipping class because she was still mad about our fight. Knowing her, she doesn't just skip class for dumb reasons, so I make my way to the mall(I'd already been suspecting of her cheating on me) and find her car. I park near it, but not close enough that she could spot me if she were to just walk out to it. I then called her and again got no response. So i continued to wait...and wait...and wait...and sure enough, about ten minutes before she was supposed to be at work, she pulled up in a car with a guy, the guy I'd mainly suspected her of cheating on me with but I didn't have any solid proof, until now. I waited until they started kissing, and snuck up on them. His window was down, so I placed my hands on his door panel and asked \"what the fuck is this shit?\" in the middle of them kissing, he turns and asks me \"I can ask you the same thing?\" she just kind of looks at me, and I can sense her thinking \"OH SHIT WHAT THE FUCK\" then she just exists the car without saying a word. I proceed to tell the guy that he is kissing my girlfriend and he is clueless, thinking she is single and what not. Anyways, the girl gets in her car and says shes late for work, and speeds off. I stick around and talk with the guy about everything, exposing him to the nature of our relationship and such. \n\nI feel where you're coming from, yet you're more strong than I was because I didn't hesitate to take her back, like an idiot. You've got my respect and I wish you the best in recovering from this.",
            "You are one classy chick, you know that? You handled that beautifully - no screaming and making a big ugly scene with the other woman, no backing down and giving into his tears. That must've been so hard but Ii think you will be able to look back on it and not regret anything that you said or did. Well done.\n\nAnd I'm so very sorry he did that to you.  : (   That's horrible. ",
            "Good job, good on you. Reading this almost made me feel sick so I can't even imagine how you're feeling right now. Who the fuck does that to people, let alone someone who they are supposed to love and care about deeply? How are people able to do this kind of shit and go home smiling in the face of someone they knowingly betrayed? I hope karma kicks his ass down the line so hard he doesn't know which way is up.\n\nI'm wishing the very best for you in the future. You deserve so much better.",
            "You dealt with it in the most amazing way possible. \n\nPure class and strength. ",
            "Holy fucking BADASS OP. Just made my day, you deserve the absolute best after this.",
            "Damn, that was cold blooded.\nRespect!\nWhen I found out my spouse was cheating on me (keylogger) I was just dumbstruck.  Though I did confront her immediately. \n\nSometimes I wish for those old Islamic laws for cheating to be reintroduced. Girl gets head chopped off, guy gets a disembowlment. ",
            "I said it to someone else one edit recently but I repeat it for you: being cheated on tells nothing about the person who's been cheated on and tells a lot about the cheater. Don't ever blame yourself. It was not your fault. He was just a shitty dude. ",
            "You are amazing and deserve true love. Wish you the best. <3",
            "[removed]",
            "I think this story is bullshit.",
            "The way you handled it so emotionlessly must have broken his brain. He must have clued in at some point that you'd known about his plans.",
            "This is terrifying. It makes me feel so unsettled and nervous about future relationships.",
            "Wow you are my hero! Keep respecting your self. I believe in letting your words out weigh your slicence.  Basically some times saying less has a greater impact. Save your time the cut him out. ",
            "Remind me never to play Poker with OP...damn how you kept a straight face all week!!",
            "GOOD FOR YOU!",
            "Fuck yes! I'm sorry about what you're going through, but you did good. I just saw you're in AZ but are leaving - wish I could buy you a drink before you go!",
            "I'm so happy for you that have kept strong while dealing with the situation. I'm sorry that he ended up being the scum that you were afraid he was. But good riddance to him. You deserve to be treated better than that. Have a great trip with your brother! Time will help heal, and distractions help until you until you heal.",
            "As someone in a 2 1/2 year long distance relationship reading something like this just makes me feel sick.  I can't imagine the pain you are going through and I wish you the best.",
            "Ah!  I've been waiting to see how this was all going to pan out.     I totally look up to how you kept your cool.   Way to go!  This is all for the better if he's going to be a moron.   ",
            "Good for you ass holes who cheat deserve worse imo.",
            "Bravo! You handled yourself so eloquently. My ex was emotionally cheating on me (in my eyes cheating is cheating whether it be physical or emotional). We where together for three years and I started noticing things, him becoming distant, his phone ringing at 2 am from a friend (who is female) that was going through a rough time with her then boyfriend. I questioned him about it and he said she was a dear friend from childhood. But as the weeks went on I was starting to doubt my trust in him. One day he forgot his phone at home and I looked at his text messages, now mind you I have never snooped or ever had a reason too. But I needed to clear my head with these ridiculous thoughts. What what I found where love texts between him and her. Him telling her how much he loved her and how he couldn't wait to see her. He divulged personal information about our relationship to her. There was a coast camping trip that we had taken and he had taken a picture of the fire and sent her a message while (I was sitting next to him) stating how he wished she was there with him. It was horrible and I felt gross and completely betrayed. The worse part was that I had to calmly wait for him to come home from work 10 long hours passed and it gave me time to talk with my sister and think about how to handle this news as well as how to deal with mr. Douchbag.   When he got home I sat him down on the couch and let him know what I had done and what I had found. The look on his face was satisfaction enough for me. \nI told him he had 24 hours to find another place to live. I left and stayed the night with my sister. The hardest part was not throwing a fit in front of him and saying horrible things to him, but instead I  stayed calm and kept a level head and told him it's over. \n\nSorry for the long winded story. It just brought up memories. Hang in there. It took me a while to get over it. I didn't really let it sink in until about three months later when I was drunk enough on wine. I sat on the couch and cried like a little baby. And it felt like a weight had been lifted and I was ready to move on. However the hangover I remember was horrible. :)",
            "This was such a good and satisfying story. Thank you for sharing, but I am so sorry for what has been going on. Thank goodness you finally caught him.",
            "Good luck moving forward. An empowering read.",
            "Wow. Good for you. You seem like a very strong woman and I'm impressed by how well you handled the situation. Best wishes during this difficult time!",
            "I am...beyond words happy for you. You're going to be okay. Please please please, update us in a few months/weeks/days/whatever on how your life has progressed. I genuinely want to be inspired by your progress. I applaud you! Keep your head up through this phase of undeniable hurt. ",
            "Are you gonna tell her husband? ",
            "You handled it perfectly OP,  all the best in your future. ",
            "You are so cool. Go you. hooray for netflix",
            "you slayed it",
            "Did you or will you tell the husband of the bitch?",
            "Argh. Wish I would've read the whole thing. Write it again!",
            "You made yourself a bump of what, exactly?",
            "You did awesome.  I wish I had had the chance to catch my SO in the act and so end it so cleanly.",
            "I feel for you, OP. You're such a badass! If I were in your place, I wouldn't have handled this as you did. But that kind of post makes me feel like I don't want a serious relationship with anyone in the world. \n\nI wish you the best :)",
            "Holy shit, you are amazing. And you wrote that really well. \n\nWell done. I hope you find someone who appreciates you for being the tough babe that you are!",
            "I'm proud of you for being so strong, someone else might have relented but you stood your ground and that makes you amazing. ",
            "Good for you.  You will always respect yourself for being strong when he's begging you not to dump him.",
            "I know you are in big pain right now, but you are my hero. My ex cheated, and I never caught him or got to confront him. I am proud of you",
            ">I have my dignity and I got just what I wanted.\n\nYou're a hero.21 Gun salute worthy.",
            "I'm glad you have gotten rid of the dirty bastard.  Good luck on your road trip and be safe!",
            "YOU GO GIRL!!! sorry, I had to get that out. I dont even know you but im so proud of you. Im so sorry he did this to you but im glad you didnt let him worm his way back in. Stay strong hun, youve proved you deserve a proper man and he clearly doesnt deserve you.\nWell done for staying cool. I wish you luck with everything.  Thanks for the update. ",
            "I'm glad everything went well for you OP. I'm glad you realize that you deserve better than that trash.",
            "Good for you. Dont let this asshole back into your life either. You deserve much much better than a cheater.",
            "Remember too that he's crying not because of what he was doing but because he got caught and knows the life he had is now gone. ",
            "OP delivers in the highest of calibers. Well done, OP!",
            "you're a fucking boss op :)",
            "I'd say you handled that pretty well. Good luck out there. ",
            "Well played.",
            ">make myself a bump \n\nOf coke?! Jesus, I hope not! \n\nAlso, we'll played ma'am ",
            "I must know your secret (bowing down, bowing down..) to being able to use your brain and common sense (bowing down, bowing down..) during a breakup and not being totally overcome by only emotion. I would pay for classes taught by Your Awesomeness. ",
            "The petty side of me hoped you did something to the fat slug... but wow, your power and your strength to handle this situation has left me in awe of your awesome'ness!",
            "I can't believe you actually went thru with it. I would have been balling in tears. But you did good OP. I know you are hurting but you don't need a guy like that in your life. Move on and don't get back with him. You deserve better. ",
            "Damn good job, I don't know that I would have been able to keep it together as much as you did.",
            "Hugs! Yay that you stood your ground, but sorry that you had to go through this. :(",
            "Sorry this happened, but you handled it beautifully. Be proud",
            "Nothing makes this sort of situation easier to get over except this kind of stuff. Its nice to feel that you've figured them out before they tried to play you, and you turn it on them to make them look like complete fools. I wish none of this would have happened but mad props to how you handled it!",
            "You are my hero!",
            "That went pretty good, but I still think the surprise party with homeless dudes would have been more memorable. ",
            "Great job OP. I'm impressed!",
            "Bravo! I wish I had that kind of guts and grace.",
            "Oh, that boy's a slag. The best you ever had...the best you ever had is just a memory.",
            "Nice use of the word \"slag\"",
            "How in the world did this become so popular? Has this been linked to from elsewhere?",
            "Sweet Jesus, that felt so good to read.\n\nI'm sorry that you're hurt, but you're better off without a cheater, anyway. Good luck to you in the future, and I hope you feel better soon!",
            "Thank you so much for updating and sharing. I am very sorry for the painful situation you are dealing with and I wish you nothing but the best for your future. You handled yourself so well and with such grace and class that is so rare these days. Sending many positives and happiness your way. Good luck friend! :)",
            "Changing the locks on him when he lives there is illegal. Just to let you know. You have to evict him.",
            "I think you did the right thing by breaking up with him and it was an awesome story of how it happened and was really badass. But I guarantee you that I am the only one who thinks that you came out as kind of a badass, but kind of a bitch at the same time. I think that you could have been bit more subtle and just told him that you know he is going to cheat on you, without having to catch him in the act. But that's just the asshole guy in me. The regular guy say way to go badass!",
            ">\"Please get your things that you can now, get a friend to help you with your large things tomorrow while I am here, I am changing the locks tonight and you are no longer welcome here\"\n\nThat can put you in legal trouble for not going through normal eviction procedure.",
            "Just curious on how you found the texts... Were you snooping or did you just happen to see them? I feel like something's going on with my SO but I don't want to go through her texts :/"
        ]
    },
    {
        "post_id": "54bqmy",
        "author": "None",
        "title": "UPDATE: How do me and my friends [20sF] tell our other friend [25F] we don't want her toddler to come on our vacation?",
        "url": "https://www.reddit.com/r/relationships/comments/54bqmy/update_how_do_me_and_my_friends_20sf_tell_our/",
        "score": 2830,
        "num_comments": 76,
        "created_utc": 1474746662.0,
        "selftext": "Link to original: https://www.reddit.com/r/relationships/comments/4t0r8j/how_do_me_and_my_friends_20sf_tell_our_other/\n\nFirst of all I’d like to give a big thank you to everyone who posted something helpful and constructive . Every comment was read, even the negative (unfortunately). I’ve gotten quite a few messages to post an update over the past month. I initially held off because I was nervous about the surprising amount of attention it got and didn’t know whether Lily was an avid redditor or not.\n\nSo, despite our protests, Lily ended up bringing her toddler Elle on our cottage getaway.\n\nJust kidding!\n\nWithin 24 hours of me posting, three of us got together and read over all the messages (now my friends know my reddit username….hiii guysss :/ ). We realized that we needed to get down to business and nip this situation in bud, before things escalated/we felt anymore resentment.\n\nWhile this situation was happening, another one was going on on the side. My friend Ivy had made comments in the past about her and Lily drifting apart, as they are best friends. Quite understandably, Lily is SUPER busy being an awesome mom/fulltime employee so its hard getting friend time in. However, Ivy commented that they had only seen each other twice in past two and some months, and how she seemed like the only one ever making plans to hang out. She’s also the best communicator out of the group, so she decided that she would take it upon herself to speak with Lily directly that night. We didn't want to approach Lily as a group because it would have felt like we were attacking her, so we were more than happy with this approach.\n\nFrom what I was told, she started off by casually bringing up the cottage and how much she was looking forward to it. Lily mentioned that she was excited to spend some time with all of us and that she couldn’t wait. Ivy then led the conversation in the direction of how she really loves spending time with Lily, that she wished it could happen more often, and even though she understood that Lily was a very busy gal, she felt like she was losing touch with Ivy somewhat.\n\nLily agreed, but reiterated that it is hard to find time for all the things that are important to her. So, Ivy continued and said something like, “Hey, I am SO excited to be spending time with you at the cottage this summer. However, it kind of hurt my feelings that it took your fiancée to be leaving for the weekend for you to decide to come and spend the weekend with us. (Not sure if I mentioned this in the first post, but initially Lily said no to the cottage because she wanted to focus on her family all summer. However, her fiancee wanted his own mini vacation, and when she found out it was on the same weekend as ours, she finally decided to come). But that’s okay, I understand that family time is very important to you. I just feel that since we haven’t been getting a lot of time to see you lately, the cottage weekend would be a great place for us all to reconnect. I feel like you need a break from life for just a couple days, since you’ve got so much going for you, and having Elle stay with your family friend while your fiancée is away is the perfect opportunity for you to get some one on one time with us. What do you think?”\n\nSo I’m excited to say that Lily finally saw the light and realized that yeah, this was a great opportunity to kick her feet back, relax, and made plans for Elle to stay with her family friend.\n\nSo some of you may be upset that we didn’t take the direct route that many of you were advising, demanding that Elle couldn’t come to the weekend getaway. However, we wanted to keep things calm/courteous and Ivy did a great job managing it. It might have been indirect, but it solved two problems in one.\n\nAll in all, the cottage was even more fun than last year! It was filled with many two-fours, midnight swims, silly truth or dares questions, and too many bags of sour cream and onion chips.\n\ntl;dr: Elle didn't come and we had a blast :)",
        "permalink": "/r/relationships/comments/54bqmy/update_how_do_me_and_my_friends_20sf_tell_our/",
        "comments": [
            "Good for Ivy for being such a good communicator.  She focused on not blaming anyone and presented a solution that made everyone happy, all while being compassionate about Lily's new very hectic schedule as a working mother.  This was all buttressed by all of you being understanding about the issues that come with new parenthood.  Good for everyone here and I'm glad y'all had a good time.",
            "I think this was handled perfectly, actually! Gentle, no combative and urging her back to the roots of things that made Lily happy before she had a kid. Not that there's anything wrong with her time with her kid, but I'm a firm believer every mom needs time to unwind but feel guilty taking it.\n\nGlad you all had fun!",
            "Woah, am I crazy or did the names get switched?",
            "There are tactful ways to handle situations and you all did great.",
            ">So some of you may be upset that we didn’t take the direct route that many of you were advising, demanding that Elle couldn’t come to the weekend getaway. \n\nMany regulars here are drama farmers. They till the soil with their own mean shit in order to get the biggest, ripest, juiciest updates. \n\nYou love your friend, so you went about it in a compassionate, loving way. And everyone is happy! \n\nExcept the farmers.\n",
            "What is a two-four OP?",
            "The only thing that upsets me about this post is that you assume there's such a thing as \"too many bags of sour cream and onion chips\".\n\nYou did good, OP.",
            "you mixed up the names between the op and this update making it look like you talking to the daughter, not the mom. lol",
            "Break up with them. Find better friends. You deserve love. ",
            "Thank you for helping your friend see she really did need time to relax and detach instead of speaking to her like a child and making her feel horrible for having a kid, like some of those replies on the OP seemed to suggest.\n\nI guarantee Lily IS feeling detached from your friend group, because of her young family and work.  I applaud you for working together to bring her back into the mix, and I'm sure she appreciates it more than you will ever know.",
            "A the stealth distraction approach, nice way to make it work out!\n\nI wonder how many people reading this know what a two-four is?\n\n",
            "What could have been better?  Instead of feeling jumped on and torn, Lily was made to feel important and wanted.  And you got a child-free trip.  Direct confrontation is not always the best way.",
            "I didn't read your original post from a while back. I have a daughter, and I think you handled this beautifully. I have a friend that I have lunch with every couple weeks, and she always politely suggests that I leave her with my boyfriend/baby's father so I can get a little break in. It's the most refreshing thing in the world. I'm happy to hear you had a fun trip. ",
            "Ivy handled that like an absolute pro. I'm glad you all had a good time and no feelings were hurt.",
            "It's nice to see everything work out and you were all able to enjoy yourselves. ",
            "Wow. That's awesome! I don't think it would of gone down so smooth if I was the one talking to her, I couldn't imagine an outcome without her being offended or angry. The idea of her attending happily without her daughter, I did not think was a possibility. So happy it worked out for all of you and that she can get a break from her kid and hubby! ",
            "Sounds like it was handled perfectly.",
            "I'm really happy that this was able to be resolved without any hurts feelings. You know, I have a few friends who are moms, and they told me that having alone time is very important for their mental and emotional well-being. Here's hoping you all can have more outings like this! :) ",
            "As always, never make the case about you (you don't want them to come) but about them (it would be better for the little one not to come).",
            "Well, that worked out beautifully! I really like the solution-oriented approach Ivy took. ",
            "Boring updates are usually the ones that work out the best.\n\nSounds like OP handled this very well.",
            "Wow, this is the best I've ever seen one of these posts turn out.",
            "Yay! Your approach was perfect as she could see your POV without feeling attacked. So glad you had a great time!",
            "AWESOME!! That was handled perfectly.",
            "Ivy was the real MVP in all of this, I hope you can do something nice for her in the future.",
            "Nice to see a /r/Relationships thread not end in chaos and destruction. ",
            "It's nice to see that your friends recognized that Elle is a person and someone very important to your friend and not just an annoying problem to be dealt with. ",
            "Hey, nice work with the tactfulness. That could have ended badly, but you guys weaved through it very well to create a happy ending. Congrats",
            "Wow, that was actually a really diplomatic way to address the multiple problems and resentments that were happening. Good job!",
            "This was all handled very well for this individual situation and hopefully things go well for your relationships going forward.  \n\nI'm a little concerned you might have to have another conversation with her about bringing the toddler to these kinds of events in the future but hopefully that works out.",
            "You switched the names up.",
            "I really want an update when the other \"friends\" had babies... ",
            "Was she able to stay in the cabin with y'all? ",
            "In your OP, Ella and Lilly's characters are switched from this post.",
            "Guess I'll be the only one to say it, zero communication and 100% manipulation. At no point did anyone express your real (honest) feelings to this person. All you did was manipulate her into thinking that she deserved a reason to dump her daughter and go drinking with her buddies. Awesome. You can look forward to this happening again and again. ",
            "By saying words with your mouth",
            "Ok I'm lost...in the last post, you said Ella was your (25F) friend and her daughter was Lily (2F). Why are the names interchanged here?",
            "[deleted]"
        ]
    }
]