[
    {
        "post_id": "kcx4yw",
        "author": "TheMaveric_2187",
        "title": "[1 Year UPDATE] My girlfriend (F 20) cheated on Me(M 21) with her bestfriend..",
        "url": "https://www.reddit.com/r/relationships/comments/kcx4yw/1_year_update_my_girlfriend_f_20_cheated_on_mem/",
        "score": 6731,
        "num_comments": 275,
        "created_utc": 1607950622.0,
        "selftext": "An year ago I posted on his subreddit. \\[Link below\\][https://www.reddit.com/r/relationships/comments/d78jqe/my\\_girlfriend\\_f\\_20\\_cheated\\_on\\_mem\\_21\\_with\\_her/](https://www.reddit.com/r/relationships/comments/d78jqe/my_girlfriend_f_20_cheated_on_mem_21_with_her/)\n\nSo I wanted to provide an update and thank my fellow redditors. I took the advice and broke up and realised that the relationship was really sucking the life out of me and was the worst thing in my life at the moment. Since then I have met someone who understands me and cares for me, theres no drama (Well I once ate the last pizza slice and she got pretty angry but yeah thats the level of the drama). We support each other and she makes me a better human all around.\n\nBecause of my ex i wasn't able to focus on my studies and the breakup combined with the Covid Pandemic gave me ample time for studying and I landed an internship at a big Bulge Bracket company and also Im working on a few personal projects that I love spending time on. The pandemic also gave me time to realise that I was with the wrong person and I love many others who love me be it my family, friends,etc. I feel really liberated.\n\nToday I was looking back at what used to be and I remembered that this subreddit for the trigger point for the change in my life. SO THANK YOU AND YOU ALL ARE AWESOME. Its because of you Ive gone from Crying nights to Happy days.\n\nEdit 1: Some edits based on comments.\n\nEdit 2: HOLY SMOKES! I didnt expect such a reaction. Thanks Guys.\n\nEdit 3: Such Wholesome Comments, Thanks Guys.\n\nTL;DR! - Took the advice of fellow redditors and broke up with my ex and spent probably the best year of my life.",
        "permalink": "/r/relationships/comments/kcx4yw/1_year_update_my_girlfriend_f_20_cheated_on_mem/",
        "comments": [
            "Guy. You ate the last slice!? You'd better be glad she's not coming here for advice on what to do about you! Seriously though, glad things are going well for you",
            "So glad you are happy :) congrats on the new relationship and the internship! \nHave a Merry Christmas and fantastic New Year!",
            "Good for you OP! I hope you’re happy and I’m glad everything worked out :)",
            "Killin it on the career front was the best comeback you could have achieved. Way to go. It’s only up from here.",
            "My girl went from needing space time alone to deal with her anxiety/depression, to being with another dude. I respected her, gave her space and here I am. I really wish I can turn things around like you did. I'm happy for you.",
            "“Living well is the best revenge” - George Herbert",
            "One piece of advice, from a happily married guy, always leave the last piece of [X] for your girl. And let her know. Not as a manipulative ploy, but because it makes her happy. And it'll make you happy watching her eat it.\n\n...plus you don't need the extra calories. If you're anything like me, you can the whole (pizza, box of cookies, entire cake/pie) by yourself. But it's better to share with your significant other.",
            "If she cheats, it's over. No exceptions. #letterkenny",
            "Looking back at the original post is infuriating. You gave your ex way too many chances.",
            "Good for you, buddy. Getting cheated on fucking hurts, but you took it on the chin only to come surging back the next round. Your life sounds good! Always keep working on it. You're doing awesome.",
            "From an incoming 2021 Bulge Bracket SA, congrats on the internship! I know firsthand the amount of work you probably had to put in for that and I just wanted to say that is absolutely amazing and I am so happy for you and your newfound happiness and success!",
            "You cut the final slice in half my man",
            "Same age as you and also 1 year out of an incredibly similar situation... It's nice on the other side, you don't really notice how much life they sucked out of you until you get it back! Cheers",
            "t took me several toxic relationships to learn all the signs of a bad one. I'm really happy you were able to learn a lot faster than me! Wishing you two the very best 👍",
            "Glad you are doing well.  So many people get caught up in the crazy and the drama. If that's your life, time to make some changes.  Glad you made the right choice for you.",
            "I'm glad things are going well :-) (Good pizza is worth fighting for though :-p)",
            "Congrats op. What are you doing for your internship? I also work in said company so if you ever want to talk about company culture or whatever, shoot me a msg",
            "This is what we love to see 💚",
            "Any update on the ex? Not assuming you’d know how she is but if you do?",
            "What happens to the ex?",
            "So, did they get back together? Just wondering since you’re doing awesome and all..",
            "Good to hear!! \n\nAnd all the good luck with the future too",
            "As someone going through a breakup, this was very hopeful to read. Thanks for the update!",
            "Happy for you mate. Not to sound very critical or cynical remember whatever you learnt from the last time. Either lessons for yourself or being alert to certain things. I hope things turn our beautifully good for you :) Sometimes some people are there in your life just for you to know how much you deserve to be loved.",
            "I'm happy for you man",
            "You should probably erase the name of your employer, unless that's not really your employer. That bank's employees are forbidden from associating themselves and their employment in the press unless expressly allowed. Not that reddit is the press, but not that it isn't",
            "...a phyric defeat it it were...... tuned a bad thing into awesoem good. Well done! you had it in you the whole time!",
            "Congratulations!! Best wishes in your new life and career!!!",
            "Very glad 2020 was positive for someone.",
            "AWESOME COMEBACK!!!!! so happy for you",
            "dude this is awesome to hear! glad you're doing so much better, and congrats on the internship!",
            "[removed]",
            "The best revenge is a life well lived. Good for you!",
            "So happy for you! Go get that bread!",
            "Maybe do not list your place of employment on reddit, especially when you're not using a throwaway account.",
            "You’d be surprised how often that happens. Twice in a row for me.",
            "Congrats OP! I'm glad you're growing.",
            "Glad you had the last laugh OP",
            "[deleted]",
            "Very happy for you!\nThat being said, you may want to change the name of the company you're interning at to just \"a big company\" or something along those lines. Most companies do a SM check on things and monitor for mentions. No reason to have unnecessary scrutiny for mentioning them.",
            "Just buy her something unexpected and something she likes to make up for the pizza incident and all will be well.  Alls well that ends well.",
            "awe congratulations on find in someone who actually cares for you :)",
            "\"Once your worst fear comes true, your paranoia can fly back home, which might give you the courage to emancipate your own heart from its abusive cycle of love.\"\n\nYou made the right decision buddy. I promise it gets better from here. Best of luck to you.",
            "> Well I once ate the last pizza slice \n\nBreak up with her. She deserves better.\n\nJust kidding. I’m glad things are good for the two of you.",
            ">Well I once ate the last pizza slice and she got pretty angry but yeah thats the level of the drama \n\n***\\*gasp\\**** You monster!",
            "I'm glad you're doing better now! You deserve all the happiness and success",
            "Well I’m glad you’re doing much better. Some of the comments in the original thread were toxic garbage. It sucks she pulled you back in, but I’m glad you gave it enough of a try that you have no unanswered questions and have happily moved on. Good for you.",
            "Happy for you. I’m in a similar situation. But I don’t know if any cheating as gone on. \n\nMy girlfriend, her “bestfriend” hates me because I stole her from him (her words). Their entire relationship is shady. When I used to question it, she’d either get defensive and make fun of my ex and my history, or she stonewalls - goes silent and complacent. Nothing ever changes. I’ve given her the ultimatum many times but she says it’s fucked up thay I did, idk. Maybe she’s right. Now it’s gotten to the point where I feel so invalidated by the lack of accountability she shows for treating me like shit and sometimes second to him. It’s obvious he wants to be her boyfriend — hates hearing about me, has insulted me, calls her constantly to make sure she’s safe and not upset with Him, she lies about hanging out with Him, we’re not allowed to meet??  I have no proof of cheating physically but emotionally no doubt. I feel like I’m upset for no reason though. The way she makes it seem like no problem or brushes it off makes me feel unjust in being upset. I tell her that if the situation were reversed she’d be furious. All she says is “I understand” and nothing ever changes. \n\n\nIt’s gotten to the point where I get fed up and explode with emotion regarding this. We’ve both called each other abusive in respect to the situation. I don’t know what to do. I don’t want to leave her. I love her so much. but I really don’t want to feel like absolute shit. \n\nI related to so many points, your ex held up many double standards that my current girlfriend does. I’m not allowed to talk shit about their relationship??? But she can constantly shame me for sleeping with girls that she finds ugly. \n\n\nAnyways. I’m at a loss. I’m happy for you, somewhat jealous too. I wish you the best with your new friend!",
            "Absolutely wonderful",
            "What was on the slice?",
            "Yay! I am so happy for you =) I love when we get amazing updates like this. Keep living your best life!",
            "Waiting for your new girlfriend to make her own post about you eating the last pizza slice now.",
            "Glad you are in a better space. Merry Christmas 💓",
            "This should be motivation for any man/women who are in a relationship they shouldn't be in,if you are in that position now you should find some self respect like OP did and end it despite that seems like suicide.\n\nI don't mean just a relationship like the OP's,I mean any unequal relationship that you feel that you have no power in it,that goes from a cheating partner who lies about wanting to reconcile,to an abusive/controlling partner,to a one sided love wether it is labled as Bestfriend or Boyfriend,kick any relationship that doesn't have mutual respect out of your life.\n\nAlso eating the last slice of pizza is really bad,people sometimes get through the whole day just to have that slice at the end,so you feel betrayed when it goes missing.",
            "Do you realize how much nonsense you would have avoided if you ended this the first time?  And then stuck to your guns?  Lesson learned.",
            "this makes me feel a little better, I'm 22 going through the same thing and the I feel right now is crashing on me daily. this is 9 months after too :(, congrats man",
            "Good job ! But man, you are so dumb.",
            "From reading your previous post, \" It was pretty late at night and I didnt want to let her go in an unsafe situation, I chased after her and said I'd give her a ride. \" Really got to commend you for that, I doubt many would have done so. Wish you nothing but the best.  Merry Christmas and a Happy New Year.",
            "I an so happy fir you!  Thanks for the update. You probably know this old saying, \"Hurt me once, shame on you, hurt me twice, shame on me!\" Stay healthy, Pal!",
            "Dude the last slice?!! Do this get a pizza and cut it in to strips put wooden skewers through them to make a bouquet of pizza flowers and surprise her with it. Don't forget the garlic sticks with cheese as a center and extra ranch sauce.",
            "See. It does get better.👏 Bravo!",
            "Good for you......did she try to come back after you broke up?",
            "Thanx for the update, but you’re leaving out some of the story, glad you’re good, but what happened after that last night til now?",
            "This is why i fucking bail when a girl has a guy friend(s) and is so fucking inseparable from him.  Not saying girl guy friends dont exist but not worth taking huge risk like that.",
            "/r/BestofRedditorUpdates",
            "Out of curiosity, where’s your Ex today? Did she get with the dude she cheated on you with?",
            "I’m happy to hear 2020 worked out for someone!\n\nOn the other hand, you got a finance job? Eww.",
            "Getting angry over the last slice of pizza?  Did she specifically tell you she was saving it for herself?  Seems kind of messed up to get angry over something like that.",
            "Stop. Writing. “Best friend”. As. One. Word.\n\nAre you 15, or?",
            "why do people write “bestfriend” as one word? it’s literally been “best friend” since the written word was invented.",
            "My gf (F21) dumped me for no reason . Don't let your girl have several best friends.",
            "never saw the orignal post but really happy for you man. sounds like you’ve got big things coming and don’t let anything stop you from continuing what you’re doing.",
            "This just told me that better days are not far if you're ready to leave the bad one's. Thanks! And congratulations OP! :)",
            "Women are the devil .just stick around long enuff and you will 100% get your heart broke \n\nHell ..you dont know for sure where you will be or what you will be doing 10 years from now , meaning that you cant even really trust yourself  .so how you gone put that level of trust in someone else ,,?",
            "Well done mate , the previous relationship was toxicAF",
            "Glad things are looking up for you. Congrats on your internship, I'm sure you'll make the most of it!",
            "Why does this post look like a big advice for me to just end things",
            "This is why you never get in a relationship with a woman who says \"most my friends are guys\"",
            "NEVER eat the last pizza slice... 😅",
            "She belongs to the streets"
        ]
    },
    {
        "post_id": "eoktfj",
        "author": "theneighborspet",
        "title": "UPDATE: I got out of the friendzone",
        "url": "https://www.reddit.com/r/relationships/comments/eoktfj/update_i_got_out_of_the_friendzone/",
        "score": 6662,
        "num_comments": 303,
        "created_utc": 1579006054.0,
        "selftext": "Two years ago I made a [post](https://www.reddit.com/r/relationships/comments/83qg15/im_m21_in_love_with_my_best_friend_f20/?utm_source=share&utm_medium=web2x) that I was in love with my best friend. I was encouraged to do the dangerous thing and talk to her. We had a very honest conversation and she was very sweet about it and admitted that we did have something between us but we remained friends, with not speaking for a little while to begin with. As the months went by we both started seeing other people although I was still very much in love with her. Eventually both of us realised that we didn't want other people but only each other and a short time after that we got together. We have now been dating for 10 months and we are both extremely happy and are very much in love.\n\nJust wanted to make an appreciation post for the ones who made me talk to her and to anyone who is in a similar situation as I was, it actually is possible!\n\nTL;DR : Told my best friend I loved her, 1 year later we started dating and have been for 10 months\n\nEDIT: Wow I didn’t expect this kind of feedback, thanks to everyone for all amazing responses, and thanks for silver :)",
        "permalink": "/r/relationships/comments/eoktfj/update_i_got_out_of_the_friendzone/",
        "comments": [
            "Love the story, congrats on it working out! \n\nMy own story was somewhat similar, albeit a different ending: Strong connection as friends, we did everything together for years. I confessed my love for her one night, she told me she didn't reciprocate. Thankfully, it did not make things awkward and we maintained a great friendship. I was 7 months into a new relationship, and she confessed her love for me. I couldn't bail on my relationship, so I rejected her. \n\nI ended up marrying that relationship, having kids. She got married and had a baby recently. We haven't spoken in at least 3 years.",
            "[deleted]",
            "This is a great update :) Congrats and I hope it remains good for a long time!",
            "For sure, even if it doesn't end up with you dating your crush, it is such an unbelievable weight off your shoulders.",
            "[removed]",
            "I caught feelings for one of my guy friends and blurted it out awkwardly during one of our marathon phone calls.  We are in an intense academic program together and he said he wasn’t considering dating until the program is finished.  I have taken that as him letting me down gently but my feelings are still there.  I care for him as a human, not only for his D, so I shrugged it off and we’ve maintained our friendship — the more we talk, the more I feel our friendship is growing.  My feelings are still there and they may have intensified with the more I learn about him.  I hope that one day I am able to relate to your post, but even if I don’t, having this dude as a friend is honestly such a blessing that I am just so happy to have him in my life in whatever the context.  It’s rare to find a gem like that, you know?  I’m very happy for you and your partner!",
            "You did the most important thing after you told her: you gave her all the space she needed to think it through.  It took months and seeing other people but if you hadn’t, it wouldn’t have worked out.  Good job!",
            "Yay\n\nEven if it didn't work out it would have been the best thing to do, knowing and getting rejected is far better than not knowing and wondering",
            "The same thing happened to me, but I was the girl. I also admitted my feelings but was ghosted for a while. We just celebrated our 10 year wedding anniversary in December and we are truly still best friends and very much in love,  I wish you both all the happiness in the world.",
            "Congrats on your found romance! However, I still have a beef with the negative connotation of the term \"friendzone\".\n\nWe should be ecstatic that women can call men friends, without the thinking that the lack of sexual or romantic attraction makes a friendship a zone we try so painfully to escape.",
            "My best friend tried to set me up with this guy from his guitar shop. Guitar guy brings his friend to our local bar, I date the friend but become friends with Guitar guy. Two years later, after we'd dated other people but were clearly still attracted to each other, he asked me for a kiss on his birthday and I obliged. That was 16 years, 1 marriage, and 1 kid ago and we're still very much in love. We both agree that had we not been friends before dating, we would never have worked.",
            "The term friend zone is still gross. But congrats",
            "[removed]",
            "[deleted]",
            "This is my own story, too! Best friends for years before getting together. We’ve been married 15 years now. Very happily!",
            "Happy to hear someone having success with making a friendship romantic.\n\nI was in a similar situation; 8 months ago my male friend finally made the move to ask me to be romantic, and I said yes. However, I’m finding him to be aloof in recent weeks and I’m wondering if he is regretting asking me to date. \n\nWe have always had a strong friendship and gotten along very well. Things are great when we’re together, but when we aren’t I don’t hear from him unless I initiate. I’m starting to fear that we maybe should’ve remained just friends bc he doesn’t even try to hang out like we used to.\n\nI’m hoping we can sort things out but I feel sort of hurt that he would’ve asked to escalate our relationship and risk our friendship only to take things so lightly.",
            "Don't do that, don't give me hope",
            "I recently took my shot at my crush and well, a swing and a miss. But we value our friendship and also she is also at a hard point in her life atm. So at this point, I'm glad I didn't ruin our friendship when I pretty much expressed my feelings towards her. I couldn't be more greatfull. I just hope I can be as lucky as you one day.",
            "[removed]",
            "Sometimes you need to really see what's out there to appreciate what you have in front of you. I'm glad she took the time, because I'm sure it will strengthen your relationship over time. When things get hard, she can rest easy and know you are worth the fight to get the relationship back on track. Not many people can say that.",
            "The wine will shine to those who wait. Congratulations! I am so happy to see this.",
            "My fiance and I were like this. We had great chemistry but I was with someone at the time and genuinely wanted a friend. So we stayed friends until things got too awkward... Many months later we caught up again and months after that,we were a couple. \n\nWe messaged each other at the same time,with the same thing,on the same platform. It was pretty funny since we hadn't talked in so long! \n\nWe actually clashed for the first six months we were together but we both felt like there was just this uncanny chemistry,and we couldn't let go. After many talks,honest communication,and willingness to learn,we synced beautifully.",
            "I'm happy it worked out. \n\nI was in love with my best friend for a year but I was seeing someone and the timing was just never right. Well, I broke off my relationship because 1) it's not fair to date someone when you love someone else and 2) I wanted to tell my friend how I felt. \n\nWell, we ended up drunkenly making out in a photo booth at a bar when I told him but then he got distant. For a while I didn't think it would happen and we'd just remain friends. \n\nI was wrong and we've been together two years this July :)\n\nMoral of the story - tell people how you feel, no matter what the outcome.",
            "Glad for you. Wish me luck 🙏",
            "That’s awesome, congrats. \n\nNow you have to keep her - don’t ever undervalue her, respect her, listen to what she says (truly listen), communicate often (she needs to know every deep dark void in your head), tell her how you feel every day. \n\nBest of luck my friend!",
            "Lol I wish this had worked out for me. Now I am just out of a friend",
            "None of the guys that liked or fell in love with me wanted to remain friends :(",
            "What a lovely post, thank you for sharing.  I'm a big believer in Soulmates finding a way, even if it seems impossible at first and it seems like you can only ever be friends, if you're Soulmates then love will find a way. <3",
            "Have been dating my best friend for 4 years and we now have 2 children together. 6 years ago I never would have fathomed. You never know",
            "What a wonderful privilege to be able to be with your best friend. That's something most couples don't have, hang onto each other <3",
            "Prepare to be crushed. I've seen this happen enough times after the non-intrested side goes through a break up and falls back on the safe option that was there all along. Or a rebound.\n\n\nUsually lasts a year till they find someone else or realize they were never that into you to begin with.\n\n\nI just don't believe she would have rejected you when you shared your feelings for her if she was really attracted to you.",
            "The worst that could’ve happened is a rejection and even that wouldn’t matter. Better to know what could’ve been then ask yourself that question for ever. And know you know and are happier than ever. Congrats brother!",
            "That's awesome, congrats!",
            "So well done my man. Faced a same situation and overcame it. Been with her for 3 years now. Wish the best for the both of you! Cheers!",
            "Great to hear! I always tell people to just go for it. If it doesn’t work out, oh well - life is short and then move on to the next!",
            "Its so lovely and heartwarming seeing positive posts like this one here. Wish you guys all the best in your life ❤️",
            "Congratulations, better to tell someone and risk it all rather than never know what could’ve happened.",
            "Congrats this is really great to hear and I wish you guys well. In 2, 4, 5, 10 years when things start to become more challenging and aren't as \"fresh\", I challenge you to think back on these moments and feelings and remember that the fire you have now can exist for the rest of your life. You just have to work hard each and every day to supply that fire with the fuel and care that it needs to burn for an eternity.",
            "Congratulations, this makes me so happy to hear :) I met my boyfriend when we were around 13-14, and we got together a couple years after that. We are both super happy and in love with each other, and it's wonderful to see other people just as happy in their relationship. Good luck to both of you and best wishes ♡",
            "Not every as lucky as you, good for you anyway!",
            "This is awesome dude. Congrats!",
            "Super happy for you guys",
            "This is awesome news!",
            "it seems to me - love feelings cannot go alongside social relations, for example, with negative feelings - the relationship does not change and it always feels that something is wrong, although from the outside it seems that everything is fine.",
            "I love happy endings. :)\n\nCongrats on taking chances....\n\n....and what better chance to take then for the sake of Love. :)",
            "Cute, I'm happy for you. Glad to read you were able to remain friends even when it didn't work out initially.",
            "Lovely to hear! Wishing you everything the best :)",
            "Wholesome AF. Love to see stuff like this. Happy for you.",
            "I love this! Thanks for sharing it with us.",
            "This is such a wonderful story, thank you for sharing. Wishing you both health & happiness!",
            "I met my boo on a dancefloor; neither of us can remember when. Many many dancefloors and afterparties later we eventually became very good friends. I was so flattered when he came to afterparty at my house one time --he knew all sorts people with better speakers, nicer houses. After many hours of cameraderie, everyone else departed on a mission to Taco Bell. He stayed alone with me in my living room and we talked and talked and played music till the next evening. Taco Bell is one of his favorite things so I knew later that he already loved me then. I had my hand on his leg and still it just felt like a natural platonic friendship. We soon were texting and messaging all the time about insignificant things, always feeling the same way about them. A while later I woke up and wanted to make out with him really bad. We were both shy so it still took a few weeks after that to make it happen. And now here we are, 0 kids and hundreds of dancefloors later. Being friends first is the best",
            "Congratulations. This gives me a lot of hope. I am in love with my best friend.  I told him a little over a year ago but at that time he said he wasn't interested in long distance and I can't really blame him.  We stayed good friends but drifted a bit apart.  A few months ago some things came to a head and it reignited our friendship and brought us really close. We have now spent some time together in person and got on quite well. No idea where this road is leading, but I'm glad to see that sometimes it leads to love.",
            "I’m so glad you’re happy. Good for you :)",
            "So happy for you! Marrying mine in 3 weeks on Valentine's day. I was in a Jim/Pam situation, I was the Jim.",
            "So happy to hear it worked out for you. Congrats and good luck!!!!",
            "Gives some of us hope.... even old one's like me 😉",
            "My husband and I were friends for years then started dating. We were together for 11 years, married for 5. Unfortunately he died....",
            "Been there too and it can be awesome. \n\nI was recently divorced and not dating anyone. I became best buddies with a woman and I became almost inseparable. I would ask her how to go about internet dating and such and how to approach women. She was cycling through last men in her life, her former fiancée, her college boyfriend and I started practice dating a woman from my divorce group and asking for advice one how to get lucky.\n\nPeople would always ask if we were a couple or how long we were married and we would mutter we were just good friends... and I didn’t want to screw that up.\n\nLong story short, during a tequila filled night we finally succumbed and just couldn’t keep our hands off each other and we we left the friend zone. she actually said “goodbye friend zone” during the our first time.\n\n1 year as friends, 5 years and counting of much more...",
            "I am SO beyond happy for you! You two- congratulations. A best friend is everything you could ever want out of your lover. ❤ I hope you both all the growth and love you can get out of one another",
            "Omg ❤ thanks for updating! I am so happy for you guys. Really. It melts my heart when I read stories like yours. All the best for you two ❤",
            "I think I'm in a similar situation and have really been wondering if I should say something to her. Part of me is reluctant but this gives me hope OP.",
            "This is one of the most feel good stories I have seen on Reddit in a while.  \nWill say this much because it resonates with me. I have somebody who I have known for many years now. There's always been that \"There's something between us\" vibe going. I chose somebody else who lived closer when I was last single, she got with someone else a year later who was also closer to her... My relationship went on for almost 3-years and hers lasted for around 2-years. Wouldn't you know that we've both sort of come back to each other as if time hadn't really passed. Granted I am healed from my break up and she's still working through hers, but we definitely have chemistry. \n\nShe's ALWAYS liked me and I have always been drawn to her. I know many-many years ago the guy she was with at the time must have caught wind of that chemistry or was controlling because out of nowhere she blocked me for about a year. Was bummed about it but one day she popped back up and we were right back to where things were before. There always has been that undertone where both of us are attracted to each other.\n\nHonestly I see where her and I make a good coupling because we both went through particularly rough break-ups, so we both know what happened to each other and we both are really supportive of each other. But as the old saying goes we'll see...\n\nIn any event I am very happy you have your best friend and make each other happy",
            "Congratulation to you. How wish i have the courage to confess to her",
            "How did you go from being friends to holding hands or kissing?",
            "There are so many stories like this -- it does make me think that it's reasonable to be suspicious when the person you're dating has a close friend of the gender they're attracted to who seems to have feelings for them. Because in this case, it would have been justified for the person you were dating while you were still in love with your friend to be jealous of her.",
            "You either date your best friend or date long enough to see them become your best friend! Congrats!",
            "My hubby and I managed this. Great mates through highschool. Soon after we graduated we both realised that we had a stronger connection then just friends. We've been together for 20 years now, married for 15.",
            "I met my wife in seventh grade. I moved away in eight grade. We did the long distance thing at first.. We went our separate ways but she was my first and only true love. We got back in touch mid 30s and never looked back.",
            "Late to the party but I’ve been with my now husband since I was 15, got married on our 6 year anniversary last September! I told him how I felt originally but he just wanted to be friends at first. Reconnected about 6 months later and we’ve been together ever since! Congrats to you both!",
            "Super happy for you OP! I’m glad it worked out for you two",
            "This is what happens when ur an actually nice guy, good for you 2 dude",
            "He shall forever be known as.. The Chosen One.",
            "That is so sweet. I am a firm believer that relationships that start off based on friendship are the strongest anyway.\n\nEveryone reading this: you have nothing to lose and everything to gain.\n\nI confessed to the girl of my dreams, one of my closest friends in uni. She rejected me but somehow we became closer friends. Fast forward one month and she confessed to me. We’re still dating to this day (one year later)\n\nYou never know what could happen. Our relationship is the strongest I’ve ever had compared to relationships I’ve had based off of romantic flings etc.",
            "My experience was the opposite to the OP. I expressed my love for a girl and she got angry at me and dumped me as a friend. lol\n\nHer loss.",
            "*Sees bro gotten out of the friendzone gives upvote*",
            "Okay, im pretty jealous now, usually if i ever feel like im in friendzone, i wouldnt even talk to her. But wow, you are my hero man!",
            "I fell in love with my now partner while I was with his best friend. I was with my ex for six years, once that ended I had to tell him, and we've been happy together ever since :)",
            "I dunno. I feel like I'm in a similar situation as you originally was. Best friend and I were really close. We end up telling each other how we felt but it was the wrong time. She ghosted me for years after that cz she started seeing this guy, who turned out to be an asshole.\n\nBack in November she reached back out to me and we been talking every since. Yesterday, she calls me and we were on the phone for four hours. At the end of the convo she decides to bring up the past and how our friendship ended. I asked her why she brings it up and she says \"well I love what we have and I really missed it. I'm sorry I cut you off and won't happen again. I'm just scared of losing you again\". After talking to her a little bit more I asked her what she wanted out of all this then, and she says she's just scared to hurt me and doesn't know how to feel. I asked her if she just wants to keep it platonic, and after a few \"I don't know\", she says yes. Now I'm stuck here wondering if I've been friendzone, or she's just scared things happen and we lose the firendship we have, again. I'm more distraught about this little thing than my last break up of my now ex-Fianci we I was with for 8 years. I don't get what girls want sometimes. I have 7 sisters and so many female friends, and sometimes I feel like no matter how much experience I have, Ill never understand women.\n\nI'm glad things worked out for you brother. It's great things fell into place. I hope it works out for me as well, cz I can't see myself with anyone but this girl. But life isn't fair sometimes so I guess I just gotta take the punches.",
            "That’s awesome! I hope it works out for you guys! My story; We met last year and sat across from each other in class for little less than a year, my best friend said she liked him. She didn’t really know him and I think it was a based on looks but towards the middle of the school year I was fighting off feelings for him. (My friend liked someone else) Anyway I didn’t tell him and by the beginning of the next year I had liked him for quite a long time. I told myself liking him over the summer didn’t count but idk rn. He met a girl and they started dating. Right as they were dating did I told him I had feelings for him. He was cool about it and told me he used to like me too. He actually got broken up with and is now single but I’m not going to ask him out because he doesn’t seem to like me anymore. (Btw I’m young but I think I’m in love :( so it sucks for me but I’m very shy so I don’t want to say anything)",
            "And here I thought guys and gals could be just friends without any romantic feelings... I feel dumb",
            "Just curious for the people here where it worked out - how did you handle them seeing other people in that space? What did you tell yourself to 'move on' for a time being?",
            "My relationship with the love of my life is amazing.\nBeen going on for a year now.\nShe was married at the time but very unhappy. Abusive husband, trying to tell her she’s worthless, and a bunch of other bad words, etc. (which is so not true, she’s really the sweetest thing in the WORLD like I am!)\nAnd she finally left him and now we’re officially a couple!\n\nAnyways, I just wanted to say that when her and I met, we felt an instant connection for each other and have become best friends really quickly. And slowly over time, we fell in love with each other. We have so much in common together, finish each other’s sentences, same personalities, and wow! I never believed in soul mates before until me and her happened!\n\nIt’s the best kind of love in the world, being in love with your best friend. Me and the love of my life will always be best friends. We get each other.\n\nVery happy for you my dude and happy that we both found true love and I know I’ll be in love for the rest of my life :)",
            "The man. The myth. The legend. Jumping out of the friend zone. Hell yea! Just remember bro...if it doesn't work out you had the balls to do what most dont/cant act on. Never forget that",
            "Seriously, i have a problem with a \"friend\" that i meet 4 or 5 years ago in the beginning i know she was attracted to me when i was 13 or 14, in that moment i was not interested in relathionsip we were have meeting with some regularity, so we lost the contact with each other while 1 year, now we have 16 and we are back since November meeting every 2-3 weeks she have come to my house sometimes one of this it was at the ends of December and i saw the opportunity of a kiss, so i do it she didnt back down but neither did she follow, the rest of the \"date\" we stay cheating and hagging us in the bed while we were seeing a film, this was repeated this weekend, she cuestion me that \"why i kiss her\" i answer as how would a shameful \"cause i think it was the appriate due to we were two teenagers hugging in a bed\" she didnt follow with the conversation and the rest of the \"date\" it was the same, hugging and watching a film, the girl is attractive but i dont know what to do, pls help.",
            "Wow congrats!! It is very wholesome seeing it work out in the end for people!",
            "Yay for love!! I also got out of the friend zone with my now-husband 7 years ago (to the day!) We were friends for 4 years before that and I was in love with him for 2 out of those 4 years. And now we'll celebrate our first marriage anniversary in June! Best of luck to you both. Work hard. It'll be worth it!",
            "[deleted]",
            "Sometimes lovers make the best friends; and friends make the best lovers. Congratulations. \\~Troy (Flourishing Life Society)",
            "Who's a big boy?! You are!",
            "This is like Jim and Pam :)",
            "I married the girl that put me on the friend zone. We were good friends for more than two years, but I always had feelings for her. I waited for the right opportunity to tell her that I was in love with her. She didn’t see it coming, she was upset and a little confused, because she loved me too but as a friend. She never thought of me like that. But I told her to think about it, after a week she said she wanted to remain friends. I told her that I didn’t want that, and that if nothing more is going to happen between us, then we shouldn’t hang out anymore. We still hung up after that, but not as friends. I told her that I was gonna conquer her, and I was nothing but romantic to her. Eventually she fell for me, and now we’ve been married for two and a half years.\n\nEdit: I don’t understand why the downvotes. Someone care to explain?",
            "Congrats! \nAnd I envy you! 🤭",
            "Congrats! \nThis is awesome.",
            "Honestly the real “friend zone” just means that one person (usually the female) isn’t attracted to the other counter part. However if two attractive people are friends, it could very easily blossom into a relationship. \n\nSo congrats OP, you were always attractive!",
            "You are the friendzone poster child. Congrats!\n\nEdit: why the downvotes, I’m happy for the guy!",
            "I’m happy for you. Although I avoid the friend zone to not have to get out, I know how awesome it can feel to have your feelings returned.",
            "[deleted]",
            "Yea, that's what I hate about women who want to be friends with men they like. They end up being mesmerized by strong macho men who are aggressive a-holes and hate themselves for it. My only consolation is thinking that maybe the women are a-holes too and they deserve each other.\n\nBut I did marry a timid woman to likes a timid man. No bad acting out in this marriage."
        ]
    },
    {
        "post_id": "dfuy2g",
        "author": "Queen_Of_Ashes_",
        "title": "UPDATE: I (28F) am getting tired of my bf (28M) getting upset over inoffensive things that I say",
        "url": "https://www.reddit.com/r/relationships/comments/dfuy2g/update_i_28f_am_getting_tired_of_my_bf_28m/",
        "score": 6585,
        "num_comments": 529,
        "created_utc": 1570695815.0,
        "selftext": "Previous post can be found [here](https://www.reddit.com/r/relationships/comments/cvljeo/i_28f_am_getting_tired_of_my_bf_28m_getting_upset/).\n\nWell, Reddit. We broke up. Two weeks after I posted the above, we got into a fight because I was surprised to see him in the kitchen when I had just saw him in the bedroom. I said, \"Oh you're up!\" He responded by rolling his eyes, shrugging his shoulders and demanding, \"Is that a problem?!\"\n\nI said \"Of course not, I was just surprised!\" and went on to do the laundry. He left the kitchen and went into the bedroom. He gave me one-word answers when I tried talking to him. I guessed he needed time to himself so I went into the living room to call my friend. As I was talking to her I heard him leave the apartment. \n\nAfter I finished talking to her about 20 minutes later, I went out to find him playing Pokemon Go. I tried talking to him like normal and he kept giving me one-word answers, not looking at me. I finally asked him what was wrong. He said nothing. I said to tell me. He said he didn't feel welcome in my apartment because of my \"tone.\"\n\nFor listeners who heard the previous fights, you'll know my \"tone\" and the \"wordings\" of my sentences were things that triggered him a lot. Even if they were innocent statements like, \"I thought you were traveling on Monday?\" or anything else that somehow threatened him and made him immediately defensive.\n\nUnlike other times, where we would launch into a fight that would last hours or DAYS because he would insist I would have a tone, I would say I didn't mean it that way, and apologize, and it wasn't enough, this time we managed to pass through it fairly unscathed (and due mostly to my patience, if I may say).\n\nBut then later that day he told me how annoying my indecision was. That I could never relax. \n\nThat night I wanted to see some friends for a few hours because I had only interacted with him for several weeks at that point and I needed some social time. He said that was fine--he's always said that would be fine (as if I needed his permission). So I went out.\n\n25 minutes away from home and nearly at my destination, he messages me about how he feels lonely, he's going back to his home country soon, he wishes I hadn't gone out, we don't have much time left together, we were supposed to spend the whole day together (this was news to me).\n\nIt takes a lot of effort for me to keep down the anxiety and just enjoy time with my friends before going home.\n\nWe argue for two hours about it, even though there are several times when I point out he's repeating himself, that HE said he didn't even know he would feel that way so how could I anticipate his needs? It occurred to me that he often would do that--wait until it was too late to change something, complain about it and make it my fault. Like when he accused me of leaving him alone to fend for himself at a party for an hour (it was 15 minutes, I was watching the clock knowing he was insecure and didn't like social gatherings), or that I was with my friend he didn't like the whole time (I talked to my friend for less than 5 minutes the whole night because I had one eye on the clock and the other on my boyfriend). Why didn't he get up and talk to me during the party and tell me that? Why did he wait until the party was over and we were home and he held it over my head? \n\nOr the time we got back from a tropical island and he says he \"wishes we could have relaxed more,\" when I was the one who planned the trip and was driving and why did it not occur to him to tell me at any time he just wanted to relax somewhere? I thought it was relaxing because he was just in the car talking with me and playing Pokemon Go anyway while I was doing the driving, was it really not that relaxing?\n\nOr that time he was mad at me ALL day because he thought I was mad at him and I had made some remark that he took personally (shock), and he didn't tell me why he was being quiet until hours later and after I pryed and begged for him to tell me.\n\nThis kind of shit. All the time, you guys, holy shit.\n\nThe day of the reckoning. He finally leaves my country. He's back in his home country. Messages me how he feels like he failed us and he doesn't want to be home. I respond compassionately but say he needs to get rest because he's been traveling so long and hasn't eaten and I wanted to give the discussion of his feelings the time and love they needed and we couldn't when it was 3 AM there and he had to be up for work at 7 AM.\n\nHe goes cold. He goes to bed.\n\nHe wakes up. Still cold. One-word answers. I'm used to it now.\n\nBut now I'm fed up. \n\nI call him out on his behavior. I tell him I'm sick of him going hot and cold with me. He says I didn't \"comfort\" him the way he wanted me to. I reiterate what I had said. He reiterates that it's not what he wanted to hear. \n\nWe break up later that day. We're both sad. Despite the bad times we had good times too, otherwise it would have been easier to let go. I'm disappointed in myself for saying I still didn't recognize the emotional abuse. I said we could try again. He says we couldn't. We both cry. We both apologize. We both thank each other for the good times.\n\nNext morning. He wakes up. Pissed. Mad I didn't give him a chance. Mad he has nothing to show for our relationship. Mad at all the sacrifices he made.\n\n(Sidenote: after the last fight I posted about, he had said to me: \"I look at all the sacrifices I've made and I wonder, what have you sacrificed? Are you worth it?\" To give you an idea, that is the most hurtful thing anyone has ever said to me, and it was the beginning of the end of our relationship. I opened up my home to him, cooked him vegetarian meals, tried to introduce him to other people so he didn't feel lonely, took him out and explored the country with him, tried to cheer him up, planned all our trips...it was NEVER enough. What was I sacrificing? My time. My energy. My mental health. My personal freedom. My social time with my friends. Everything.)\n\nIt was like he always expected the worst in me, and would only ever see what he wanted to see.\n\nSo we haven't talked since, after he chewed me up and spit me out and accused me of never listening to his feelings and always blaming him for everything. That I should have told him how I felt sooner, that I should have heard him out on an apology (that he apparently had no intention to actually get better from, just feel bad that it happened at all and repeat the same behaviors as infinitum).\n \nIf any of this rings true to you...please get out. I started reading, \"Why Does He Do That?\" since I saw it recommended on this sub several times a day. It's opening my eyes to what I put up with. The unhealthy behaviors. The emotional abuse. The mental exhaustion I have suffered.\n\nI won't lie. I miss who he was in the beginning. The sweet guy. The promises. The love. The care. The above-and-beyond romantic gestures. But they had vanished only months into the relationship--after we exchanged I love you's--and then the jealousy came out. The insecurity. Nitpicking what I said and how I said it. Even how I apologized wasn't good enough. His controlling tendencies. He demanded I not talk to my friends about it—even after the break up he asked that I not talk to our mutual friends about our break up. \n\nI could never make him happy.\n\nPlease, please, if you read this and think it reminds you of your relationship...please know you can do better. I am single now and have been the last two weeks, but the moment we broke up I felt relief. I felt a weight being lifted off of me. I have my time again. I can do what I want, when I want, without worrying how he will feel or how he will react or how long our fight will last or trying to manage the anxiety he made me feel.\n\nIt can get better. \n\nLook up “signs of emotional abuse” and click the link with over 60 examples. Google “why does he do that PDF” and just read the first ten pages online. If it resonates with you, then know that you have taken a very essential first step towards a happier, healthier you.\n\nI know I still have some ways to go. I am still trying to convince myself it was an emotionally abusive relationship, that I was not overreacting, that I can't go back, that I can do better, that my future self deserves better, that he was not the one. I had been so sure he was. But I just have to keep trusting my gut. It's hard not messaging him. I feel pathetic for even considering it. I used to be stronger. Maybe I'm still strong. I just have to get it back. Keep practicing. Keep being strong.\n\nAnyway. Thank you for reading.\n\ntl;dr I left my emotionally abusive relationship. Thank you to everyone who messaged and helped me see what he was doing was not okay. Thank you for the brave people who post about their unhappiness with their spouses and helped me see things must be able to get better. For making me feel less alone. Just...thank you. &lt;3\n\nEdit: The overwhelming support. I can’t keep up but I’m reading every comment. Thank you for helping to convince me I’m not crazy. Thank you for sharing your own painful stories. Thank you for reaching out and leaving comments or messages to send hope and love. Thank you for your support. You are all lovely people, and I hope you are all enjoying happy and healthy lives and relationships. Take care of yourselves.",
        "permalink": "/r/relationships/comments/dfuy2g/update_i_28f_am_getting_tired_of_my_bf_28m/",
        "comments": [
            "[deleted]",
            "I'm so glad you're out.  Just one piece of advice- do tell your mutual friends.  \n\nTell the one you're closest to in that group of friends the full story.  Then slowly clue in the others.  Be kind, polite and don't pan him.  Just make it clear that you really tried and it's really sad it didn't work out but he never seemed to be happy with you etc.  Maybe give general indications that there is more to the story.  If they ask further just say you tried hard but it just wasn't enough for him.  Say you hope he can find whatever he's looking for.\n\nDo this because he will absolutely trash you to these people.",
            "Proud of you, OP. Hang in there. ❤️",
            ">  He says I didn't \"comfort\" him the way he wanted me to. \n\nThen tell me what comforts you.  A hug followed by complete silence.  Food.  Movie night.  Reassurance.  Affirmation.  Ideas to fix the thing.  It's like, fuck, dude, be an adult.  \n\n\n>I reiterate what I had said. He reiterates that it's not what he wanted to hear. \n\nThen tell me what you need to hear.  It's like, *fuck,* dude, **be an adult.**\n\nGood riddance to bad man-baby rubbish.  I left a guy last year for a lot of reasons, but what made it hard was that he had narrowed his world to me and only me.  I couldn't leave him alone and helpless, but that's how he manipulated me into staying for so much longer than I wanted to.  Healing is going to be quite the journey, and I'm proud of you for starting it now.",
            "u/LeBronzeFlamez, u/Will11994, u/kelsnuggets\n\nThank you all for your comments previously. Here’s the update if you’re interested. Best to you ❤️",
            "Hey as a person who is at this very moment leaving a relationship because my life is falling apart before my eyes and my bf can’t help but feel sorry for himself (because it is just too taxing on HIM that I was about to die, among too many other shit stuff) I want to say..\n\nYou don’t have to be abused to leave. You are allowed to be happy in your only life. If your partner can’t give what you need, you have to leave. You can find a new way to be in a different form of relationship, where what you like in each other can stay intact (not with abusers though those have to go)\n\nYou don’t have to be beaten to rock bottom. You are allowed to be happy. You are allowed to make choices that are good for you, just because you deserve it. The only thing that is wrong in life is to hurt other people, and when we do we have to own up to our mistakes and apologies. \n\nLive your life in love. It’s cheesy, but like. Try to be good to everyone, including yourself.\n\nETA: this is not to argue with this post, which is great and I am so so so proud of you OP. Let’s go be happy",
            "Good for you! Too many people stay in terrible relationships out of the belief that they can’t do better. Wrong! Being single is better than this.",
            "Hey, I just got out of a horribly abusive relationship myself, both sexual and emotional and so manipulative. One thing that hit me with your post; \"I miss the old him\" - I felt that way too, I missed who he was at the beginning when he was affectionate with me and understanding of my mental health and just all around really sweet and loving, but then I realised that him never existed. He was always the guy who abused me; he'd put his ex through similar shit and they broke up a year before I met him, tried to cheat on me right before we met the first time (ldr) while texting me how much he loves me the whole time, there were a lot of red flags in the beginning of the relationship I missed too. He was always a scummy person I was just blinded by love and wearing rose tinted glasses the whole time. The old him I fell in love with only existed as a front to lure me in and get me to be so infatuated with me he could abuse me as he wanted. The man (or boy from the sounds of it) you fell for probably never existed either, falling in love just blinds us to these things",
            "[deleted]",
            "no advice here, but you sound like a very fun and caring person- planning the trip and doing all the driving? Pretty sweet. Taking care of those you know feel vulnerable in unknown social settings? Extremely kind.\n\n You can't ever win when the goalposts are constantly moving. Sounds like your ex bf needs to do a deep dive into why he's unable to stand beside someone in a relationship as an individual who can communicate, self soothe, and have an overall self awareness about his own dysfunctional tendencies. I get a sense he is jealous of your ability to interact with the world in a more adventurous and positive way. Luckily, his bs is no longer your issue!",
            "Something I really recommend is writing out all the bad stuff, like you did here but with as many details as you can possibly remember. Then in those moments that you miss him and question everything, you can have tangible evidence that you made the right decision. A year from now your memories of the emotional abuse may fade and you might have an easier time remembering the good moments. I went through something similar and it always helps to reread how it really went.",
            "Good for you ! This reminds me so much of my ex, I'm sorry you had to go through this.",
            "Fucking hell, that relationship sounds just downright exhausting!  Life's too short to walk on eggshells and constantly tiptoe around trying to avoid unwarranted hurt feelings of an insecure partner. \n\nI'm such an asshole I'd probably have told him that \"those issues all sound like\" you\" problems.\" I have zero patience though lol. Kodos to you and having patience as long as you did. You absolutely sacrificed your own comfort and feelings to make him feel better first and foremost though it was a losing battle. \n\nGlad to see it you recognized it was unhealthy and not the relationship for you though!",
            "You are now free to live a normal life and he is free to spend it with his true love, Pokemon Go.",
            "The getting mad about something after it was too late to do anything about it (but saying nothing when it could’ve made a difference) sounds just like me ex. It’s like he wanted to get mad. It was super mentally abusive. Good riddance. \n\nYou’re free now girl..spread your wings and soar.",
            "I have nothing new to add. I lived this shit for 9 years. It fucked me up to the point of psychiatric hospital for 5 weeks, drug addiction to stop feeling so useless etc and eventually 1 year in rehab. During which I left his ass and started my life over. After rehab I was 2,5 years single (he pulled a number on me, OP). I took my time to heal, to find self-love, self respect, self-esteem etc. His gaslighting fucked me up so bad. I always walked on eggs, I always doubted myself. At some stage I stopped talking because I was scared that he would find offensive words in my repertoire that he could use against me. Spoiler: He always did. He challenged my words, my thinking, my tone, my intentions, everything. I was LITERALLY too afraid to talk. And I was 41 at the time, can you imagine. Never ever again.\n\nSo so so happy for you and how you handled it - like a champ.",
            "That was too much to put up with: good decision.",
            "Sounds like a massive human-shaped migraine just lifted. Good for you, OP. That man sounds like an exhausting nightmare and I pity his unsuspecting future partners.",
            "\"Please, please, if you read this and think it reminds you of your relationship...please know you can do better. I am single now and have been the last two weeks, but the moment we broke up I felt relief. I felt a weight being lifted off of me. I have my time again. I can do what I want, when I want, without worrying how he will feel or how he will react or how long our fight will last or trying to manage the anxiety he made me feel.\"\n\nI second this. I got out of a relationship similar to this and I've never been happier.",
            "[deleted]",
            "I dated a guy like this. I'd make an innocuous comment or he'd ask me a question and I'd reply normally and he'd jump down my throat over my \"tone.\" It got to the point where I was training myself to speak in an overly peppy, upbeat cheerleader voice just to appease him and avoid a fight. I couldn't be myself. I'd ask an honest question and would get, \"What is that supposed to mean?!\" (it means ... I wanted to know what I asked you?) He would also do the thing where he'd try to pick a fight or ruin every night out I had. Even if he was invited. Sometimes he'd be invited, decide he didn't want to go, then send me sulky texts the entire time I was gone saying he wished he'd gone/wished I had cared enough to stay home with him. He'd do the same thing your ex did where we'd go on a trip, he'd seem to have fun/not speak up about what he wanted to do, then get home and complain he hadn't gotten to do x, y and z. ANYTHING so it was always my fault. He'd be upset and I'd comfort him and he'd get mad because I didn't do it right ... or something. A lot of refusing to tell me what he wanted but then getting mad when he didn't get it. Always my fault.\n\nI feel like that's emotionally abusive enough, but he would also criticize the fuck out of me. I am 5'3.\" When we dated I was hovering around 100 pounds, sometimes a bit less (I'm a small person with a small frame but I've always had actual curves -- really big boobs, no matter how skinny I've gotten). I'd be criticized for \"letting myself go\" if I didn't get to the gym on a given day. How he preferred girls with smaller chests (then ... go date one). How he preferred blondes (I have almost black hair ... maybe go date a blonde?). How maybe I shouldn't eat that sandwich because I didn't work out hard enough that day. How he didn't like \"how I hold my mouth\" (what?), how he didn't like my friends, how he didn't like how I pronounced a certain word, how he thought I was smarter than that. A lot of tearing me down and making me feel like shit. And if I got offended or hurt (or god forbid, cried, because crying was manipulative and he was just trying to be honest), I was the problem. So again, I was always the one who was wrong.\n\nI finally packed my shit and left and it was the best, most freeing thing I've ever done. Thank god. It freed me up to find my awesome husband who, after more than a decade together, still tells me how amazing he thinks I am. He's never criticized me or put me through any of that shit. (P.S. My ex got some of his friends to harass me and ask me why I was being so mean and why I broke his heart ... hope yours doesn't pull the same shit).\n\nI'm glad you got away from him. It's emotionally exhausting to have to walk on eggshells all the damn time.",
            "Did he ever react negatively to garlic, sunlight or crucifixes? Because I think you were dating an emotional vampire. Jokes aside good on you for getting out.",
            "google \"Borderline Personality Disorder in Men\"\n\nit manifests somewhat different in men and women, and this sounds EXACTLY like bpd to me. Could be wrong, but if you google that and look down the checklist I would bet you willl be saying \"yup, that checks, that one too..etc\"",
            "Good for you! I'm so happy for you OP!\n\n> It was like he always expected the worst in me, and would only ever see what he wanted to see.\n\nMy ex was like this. In fact there are a lot of similarities here, I never felt like I was enough either. It took me way too long to see this but much of it was the same. It has now been 2.5 years since I left and I have never felt more free. You are strong, you always were strong, and you did the right thing! Internet hugs to you! <3",
            "Something that might help you is to remind yourself that you are never responsible for how someone else feels or for how they act. Every individual is the only person who can be responsible for themselves. That he was continuously trying to make his feelings and actions your responsibility is his failure. You might want to explore this pattern with a therapist - its possible that someone else in your life also behaves like this (maybe a parent?) and it \"trained\" you to be receptive to this type of behavior?\n\nI grew up with a parent who displayed these types of behaviors. I find the best way to deal with it when I encounter it in the wild is to take everything the person is saying at face-value and refuse to engage when they demand you put on an emotional display for them (the begging/apologizing/yelling/whatever). In other words, refuse to take responsibility and expect them to act like an adult. They will get frustrated with you for not playing along, and likely it will cause them to leave as a romantic partner, but considering their unsuitability as a romantic partner for you that's probably no great loss.",
            "This reminds me so much of my ex and how relieved I felt when I finally ended it between us. I broke up with him over a year and a half ago and I still wake up grateful everyday that I get to live my life without constantly feeling the anxiety of tiptoeing around him. \n\nYou won’t regret leaving that relationship OP, for me leaving was what finally gave me the space to grow into the person I really was and I hope it will do the same for you :)",
            "Hate to be an armchair psychologist here - but this sounds incredibly like borderline personality disorder to me... No links allowed, but google the signs and symptoms, particularly \"in men\".",
            "I've had a Male do everything you have said to me... \n\nGood riddance! That's the thing with a LDR they fantasize that things are going to be a certain way and expect way too much...\n\nWe're only human not some magical being with lots of money to be galavanting around the countryside not working.",
            "You could have written this about my ex. I've never seen such an accurate depiction of what my own history was like. I actually forwarded your post to my new, lovely, partner in the hope this will help him understand what my relationship with my ex was like, and why I apologise for everything and am super anxious sometimes.\n\nI cannot recommend therapy/counselling enough. It might seem dramatic, but I really don't think it is. Relationships like this erode self confidence and make us feel like we're bad people, make us walk on eggshells.\n\nI've been gone four years now and it was the hardest but best thing I ever did.\n\nYour future self is going to be so proud of you. And this internet stranger is proud of you.",
            "What a gaslighting piece of shit",
            "Good for you OP. You are worthy of a happy, healthy relationship with a person who supports you and loves you.",
            "OP - I [M] lived this.  I use the analogy of ‘having her fists up’ - almost looking for something to be unhappy about.  My every word was analyzed for the most negative possible meaning...I couldn’t seem to choose a phrase, a tone, a sentence that satisfied her.  It was maddening.\n\nHere’s my thought, and you might not love it:  I don’t think he is happy with himself, so it was impossible for him to be happy with you.  And his expectations of you might be cultural...his view of  a woman’s role could be incongruent with your style.\n\nIt’s best that he’s gone.  You’ll emerge so much better off.  He’s broken...or at least brittle, and you couldn’t have fixed him.  \n\nSo try to move on quickly - and don’t spend too much time explaining yourself to others.  They don’t really care about the details and if they liked you before, they’ll like you now.\n\nI’m sorry this happened to you.",
            "God, I wish there was a way to put an ear tag witha transmitter on these dudes when we release them back into the wild. Like just scan the tag and it'll say \"emotionally manipulative. Blame-shifting. Utterly exhausting. Controlling.\" And we just throooow him back.",
            "Damn, I get cold with my girlfriend sometimes and your story just hit me in the heart, as I can see a little part of me on your ex. I need to change a little bit. Thanks for sharing!",
            "Yeah, good thing you left. My father is exactly like that to my mother, and I hate watching it. She can say the most innocuous things and he flies off the handle. Sometimes he's like that with other people, but mostly it's just with her. You definitely did the right thing!",
            "Hey, I’m sorry you went through this shit! It unfortunately sounds very familiar to me, every single reason you describe for the fight, I had a very similar fight. Now, I’m not sure about your ex, but mine was diagnosed with borderline personality disorder, have you looked into that? Jeez the similarities in both your posts are amazing...let me know if you need resources! Much love, and stay strong! 💜",
            "I was in a relationship like that.  I had to anticipate his emotional and mental response to comments and actions and \"should have thought about them before I did or said what I did and said\". \n\nNo. I am not a mind reader.  So glad I left that relationship.",
            "He sounds like the most exhausting person on Earth. Throw the whole man away. 8 months of your life is nothing. Well done for ending it.",
            "I’m actually glad to see your post. I had a guy who was like this. Almost everything I said was taken negatively. Even a question like “what time you gonna get home tonight” could trigger a fight. I always thought that maybe something was really wrong with me to have someone hated me that much. Now I know there is this kind of person exists.",
            "You've got amazing character and patience. You ran into an emotional leech who you thought was normal, so of course you tried 'normal' methods. And then you got out. You did fine, you gave it a shot and now you know what signs to look for and what to avoid.\n\nI swear, this type of person will never give anyone the benefit of the doubt because the mean spirited stuff they accuse their partners off is stuff they do or think about doing all the time. And if they can do it, then surely their partner is a piece of crap too, right? So they build this wall of distrust and doubt around themselves, and manage to harm themselves and their partner in the process. They got harmed, so they must have been right all along! Ego saved.\n\nThey have deep hatred and distrust inside of them, (which they often call 'passion') and are looking for 'an exception to the rule', which will never exist, because they want some kind of fairy tale being who knows them so deeply and profoundly that he can communicate in farts and grunts and you'd completely understand everything he wants and needs. You start out on a pedestal but as soon as there is any sign of normal humanity in you, you fall off hard and it's your fault that you didn't turn out to be this perfect being, as if you had lied to him or robbed him or something. It never ends well. These people are pretty broken.",
            "This guy sounds like a very manipulative person that was trying to trample you down until you were his servant. I'm glad you got out. I was exhausted just reading your posts.",
            "I feel like the part that stands out the most to me is that not once did it seem like he was genuinely interested in getting some clarification over your tone, or over how you felt towards his actions. It must have been pretty isolating for you during all that. Really glad you made the decision to break it off. Hopefully, he'll take the time to understand that not everything in the world is about him.",
            "i read your original post and i'm glad that you made the right decision. there are certain characteristics that are a must have for a partner, and he really lacked in that regard. you shouldn't be walking on glass because you're afraid he'll have an outburst. that is not a healthy relationship. it's abusive and controlling.",
            "For the best. Had an ex like this. Comes from a place of insecurity that has nothing to do with you. Last I checked the ex is with someone new now who doesn't really speak the same language - problem solved. **taps forehead** can't talk, can't fight",
            "I remember reading your original post and I am SO GLAD you are rid of him. Be kind to yourself now. Take some time for pampering, whatever that means to you.",
            "When you said, \"It was like he always expected the worst in me, and would only ever see what he wanted to see,\" I knew EXACTLY how that felt. Nothing I did was ever good enough, even when my 'good' was on par with others' 'best.' He never appreciated anything I did for him, but when other people did things for him, he'd sing their praises. He came to just expect me to bend over backwards for him and would get pissy when I didn't. Hang in there, the clarity comes more and more after each passing day.",
            "It really is shocking, right? The moment you realize you were emotionally abused, that you weren't the problem and you've been manipulated and robbed of your own mental sanity over months (or in my case years) is so... overwhelming. Freeing, yes. But oh so overwhelming.\n\nI'm happy you got out of this and you will probably be angry for a while when remembering all these things he had said. Memories will haunt you for a while but it will get better eventually, I can promise you that. \n\nYou are strong! And this horrible experience will leave you even stronger! <3  \nBest of luck for your future!",
            "God it's suffocating to be with someone so demanding of your time and it never being up to their exact expectation.\n\nNot your monkies not your circus \n\nWould honestly block him to preserve the good times",
            "Sounds like a combination of depression and toxic masculinity. Instead of trying to get help he just projected everything onto you. You aren’t responsible for his well-being, and you gave him plenty of space to try to figure it out, props for getting yourself out of a toxic situation.",
            "You made the right decision. He sounds insufferable. He may have some personal/mental issues that have not been addressed but that's not a good excuse or your responsibility. It could be he is just a spoiled brat too who just doesn't know how to maintain a normal relationship. Again, either way, you went way above and beyond because you have a caring heart. I mean, you even put hours into your fights and that must have taken a huge toll on your overall health. Im proud of you for letting go. I know it's hard. But you can do it. Take all the time you need to heal from this.",
            "Remember to block him on your phone as well as all forms of social media. A needy person like that will try to get you back for his ego boost later on. Do not give in if/when this happens. Stay strong friend, you will find somebody who will treat you much better.",
            "I’m so happy you got out. My ex started pulling shit like this and ended up physically violent. Know that emotional abuse leaves marks too and if you need help to overcome it it’s totally valid and I encourage you to reach out if you have a therapist or trusted friends. Best wishes",
            "Let me preface this by saying I DO NOT CONDONE ANY ABUSIVE BEHAVIOR WHATSOEVER. \n\nNow, what I was gonna say is it sounds like that guy has some serious insecurity problems.  I used to have some bad insecurity issues as a teenager but found healthy ways to fix it.\n\nI read all this and can see some behaviors where both people are confused about their partners feelings. This is why communication is so damn important. I stress that with relationships now. \n\nIt shouldnt be \"I'll take care of you and you take care of me\"  It should be \"ill take care of me for you, and you take care of you for me\" (not my quote)",
            "This made me lol. I dated a guy like this once. it was exhausting to say the least and really tested my patience. Honestly, just take this as a learning experience. It really helped me figure out what I REALLY wanted out of a relationship, as most relationships that fail do. You're just that much closer to finding the guy that is for you! Good for you for moving on and sticking to your guns. Chin up!",
            "Congratulations to you OP!  You have become a Hero by dumping that Zero.",
            "I am currently reading \"Why Does He Do That\" and nothing has resonated with me more. \n\nMy current and past relationships are fraught with these tendencies. I'll figure it out.",
            "I remember your previous post and I’m so happy to read this update. You deserve so much better and I’m proud of you for getting out I know how hard it is!",
            "Sounds like my brother. Every little thing he doesn't like in his life is somebody else's fault, in his eyes, and he punishes people for imaginary infractions. I wish I could divorce my brother. The worst part of it is, he pulls this kind of BS on our elderly mother, who takes it very much to heart, it hurts her deeply.",
            "*\"It was like he always expected the worst in me, and would only ever see what he wanted to see. \"*\n\nMy husband is like this, and it's awful. No matter what I do, how I do it, what I say he always paints me in the worst light. :(",
            "You seem to have your heart in the right place, things will get better. Not today maybe, but overtime. Wish you the best.",
            "It's probably been said in some fashion alread, and I'm sure it's not news to you, but it sounds like it comes down to his maturity. Not that he's a bad person, just that he's not emotionally stable at this point to appreciate a give-and-take relationship. You definitely did enough giving with not enough being \"given\" back to you. It's hard to remember the good times and not be sucked back into a guilt trip unless you make yourself see the bigger picture. Without knowing the entire situation, I'm glad you two have separated. It'll be good for both of you. Hopefully, he'll realize his mistakes and learn from them. And you'll either love having your freedom or find someone who loves that you have your freedom. Good luck!",
            "\nWow...yea that kind of behavior, I'd be getting out also.\n\nThey withdraw and then make it seem like it's your fault that they withdrew.\n\nOh well, now you have let go of some huge baggage, literally. Take some time to recover and then be happy without him.",
            "> But then later that day he told me how annoying my indecision was. That I could never relax. \n\nGiven everything you've said about him, that's fucking *rich.* I'm so glad you're out, so glad you have an international border between you, and sending <3",
            "I am so glad you took care of yourself, saw what this was, and got out. He can’t say you didn’t give it a try or just let go - you put in a LOT of effort.\nI also wanted to apologize. Reading this grossly sounded a little familiar, and I realized it sounded a bit like me in my very first relationship. Not as often or as much, but the ‘getting hurt’, getting a little sensitive and defensive, feeling not cared for - I felt that was at times with my ex girlfriend and I only brought it up after it had happened because I disliked confrontation and ‘expected’ her to know me well enough to know what upset me, and offer a solution herself.\n\nI was also 18-20. Not exactly a teen, but still a bit young a stupid. We had a horrible breakup and I didn’t date for 6 years.\nTo be fair, the relationship though amazing, sweet, and strong (we’re both girls and our parents found out near the beginning. We were limited in when we could see each other and it was long distance) in the first year and a half or so, in the last.. 6 months or so it was just.. a lot of fighting. I’m not saying she was innocent, because she wasn’t (very defensive, didn’t like to see different points of views, stubborn, etc.) but I know I clouded things. Our breakup led to me finally seeking help for my depression, which had gotten so bad that year I was just in a constant state of sensitivity, unhappiness, and hurt. My girlfriend was an amazing light, but in the end even that was filled. \n\nI’ve fixed a lot since then. I recognized our love languages were different. If I had asked for my needs differently and if I had recognized her efforts from her own language, it would have saved a lot of grief. I’ve learned how I need to recover from a fight or how to act after one. I learned not to be so sensitive. I’m much healthier. I’m in a new relationship now, 6 months, and it’s gone well so far but I’m still nervous of becoming what I was before like your ex boyfriend.\nBut I think self-reflection, time, and actual effort was/is needed to make a difference.\n\nIf he ever asks for you back, in a week or 5 years, don’t take him back unless he owns up for his shit. And not just apologize, but explain what he did wrong and how he would do it differently. \nEven then, you deserve a healthier and happier relationship.\nI’m sorry you went through this, again from me who was similar 6 years ago (I’m almost 27 now), and I wish you the best of luck. You were very patient and he’ll remember that when he thinks of you guys and realizes he was a bit of a baby. \n\nGood luck!",
            "Dude sounds absolutely bananas, I wonder if he's got undiagnosed BPD?",
            "I just got out of this exact relationship.  I was constantly Googling and trying to pin point what exactly he was doing to me by taking everything little thing I said as an insult.  It resulted in my feeling like I’m walking on eggshells and unable to speak.  Then naturally I found myself pulling away physically and denying him sex then that became the big issue.  Anyways,  I’m so glad I’m not alone and I hope you know you helped me to find clarity today. ❤️",
            "Girl, you are so strong!!! You did what you needed to do despite the knowledge that it would hurt really really badly. You did it anyway! That is courage. That is bravery. That is strength. You will be sad because of this and you will miss him horribly--in no way does that negate the strength and power that you displayed. If you weren't sad that would not be good. The pain and sadness that you are feeling is the natural and correct response to losing someone. It takes a whole lot of guts to leave someone because you know you're worth better. And you did that. Strength is not in not having the feelings--it's doing what you know is right DESPITE knowing that it sucks.",
            "I read your story, and I am happy for you that you got out and feel better now. There is no way for that relationship to get on a positive track in my opinion. I have previously gone through something similar, and consulting mental health experts for mine and other people’s mental health a lot of consensus came around the idea that maybe that person had what’s called borderline personality disorder or BPD. I’m not making any kind of judgment I’m just saying research some of it and understand. He may not of been trying to be abusive￼￼, But that kind of mental health problem does manifest abuse unfortunately. In any event I’m glad that you’re in a better place now.￼",
            "This reminds me of how I was when I was 19-20. Horrrrriiible times.\n\nThe fact that a grown man is acting like this is sad, tbh.\n\nGood on you for moving on.",
            "[deleted]",
            "You made the right decision. You cannot be with someone who will mandate your speech via their responses, it's suffocating and dreadful and you will continue to feel totally free  and will not even believe you were in this situation before.",
            "Glad you are out.  You were the victim of someone who likely has covert narcissistic personality disorder.  Be happy you got out when you did.",
            "I wonder if your ex grew up in a house where words don’t have real meanings - it’s all about timing, tone, delivery, and who the messenger is. It’s not uncommon for such a person to end up trying to be a mind reader - usually a pessimistic mind reader, in my experience.\n\nEven if true you made the right call; if he won’t work on (or recognize) the issue then there is nothing else you could have done.",
            "I know a lot about what he's been putting you through, I'm going through it right now. I read your update and was incredulous at all the similarities. \n\nI've also been reading through the comments and I have to say to that you are getting excellent advice; I'm learning as I read. \n\nThank you for being brave enough to post what you've been going through. And a shout out to all those who have commented on your post because indirectly, they have been helping me. \n\nI sincerely believe that things are going to get better for you. Never lose hope. Sometimes that's all that we have, but I try hard to hold on - mainly because that's the only thing keeping me going at the moment!",
            "Well done OP.\n\nI would really reccomend reading the Verbally abusive relationship by Patricia Evans. She details your exes behaviour to a tee. She also explains WHY he does that. You're not alone.",
            "Sounds like the dude had an issue with owning up to his own insecurities, responsibilities, etc, etc.\n\n\nYou're better off.",
            "Reading this gives me comfort, only because I recently broke up with someone who had these same tendencies. But they're so fucking good at what they do, that they still manage to make you question yourself.\n\nThanks for giving me the confidence that I did the right thing!!",
            "He is a classic emotional abuser, and it most likely would have developed further if your relationship got more serious - physical abuse usually presents when the abuser feels their victim can’t escape (sometimes it can take as long as until children are in the picture, going along the classic timeline of engagement and marriage, then children). \n\nReading that made me so angry for you, and so relieved that you’re no longer in that situation. Who he was at the beginning was a facade, a fantasy.",
            "I read that same book and it helped me get out of an incredibly toxic relationship. Keep going. You got this.",
            "I couldn't get through the whole post because after the first few sentences it's evident that he just wanted an excuse to break up. Sounds like a nightmare anyways so congrats on your loss.",
            "Omg. Are you me? Because this sounded like my relationship with my husband...",
            "Girl fuck him your better off without that kinda negativity",
            "Jesus, reading this was exhausting and so so familiar. The love bombing, the blame game, the constant shame and guilt without understanding how it ever got to that point. I am four years out from a relationship just like this and I am still in recovery. I completely lost myself. I thought I was a monster. It's disturbing how long it has taken me to shake that feeling. I wish you luck in your own recovery.",
            "Holy wall of text!!! :)\n\nOk, I think overall this is better for you so, congrats!   \n\nI think mentally shifting this to \"we didn't work out well\" would be the best thing to communicate out (as well as settle on).  The details you post above don't really matter at the end of the day other than you don't like the hot/cold treatment.   I can't stand the passive aggressive crap either.\n\n\nA reason I'm posting is \"the tone\" statements.  My last 3 relationships have had that commented about.  The first time I'm like \"WTF is this BS you don't like my tone?\".   But in hindsight, I think there is something to it.   I think there are ways to say things... and there is body language, facial expressions, etc that are communicating things I don't intend.   I have a poor \"poker face\" if you will.\n\n\nAll of that doesn't matter when it comes to your ex, but I'm pointing this out so that for the next person you are mindful about it.  If something is getting under your skin about the person you are with you need to find ways to communicate that and address it.  Otherwise the \"oh you are up\" statements are potentially going to come across in a way you don't believe you are fronting.\n\nbest of luck!",
            "u/traveler22, u/ladyughsalot1 updates for you and thank you!",
            "Being with an abuser can be like a drug. This is due to the traumatic bonding (mentioned in the book you're reading \"Why Does He Do That?\")\n\nIt may take some \"rehab\" for the drug to leave your system. The farther you go, the less you'll want to get back with him.",
            "Good riddance, you ex is an immature brat and you deserve better",
            "You did great and you sound like a very compassionate person. All the best to you, you'll find someone that suits you better for sure!",
            "I feel sorry for you that you had to go through this. I always tell myself, the moment you feel you are not happy with someone you better off living solo ;).",
            "Pretty sure I could have written this a few years ago, down to the country. \n\nI'm better off now, and so will you be.",
            "This is so great! Good for you for recognizing the emotional abuse and getting out. I didn't recognize it and stayed when I was younger and paid for it dearly.",
            "Yass! I'm so glad you got out of there! You are now on a path where you will thrive and shine! I hope he find his path to peace, but that is no longer your priority. Your peace is now your priority.",
            "Thank God you saw him for what he was! I'm glad you out.",
            "When one door closes, another door opens!! I know it sounds like a cliché but its the universe preparing you for something better coming your way x",
            "Actually I get his side too. For Instance, I did the same out of jealousy. At the beginning I was also all Sweet and Romantik and all, but Jealousy took overhand. Gladly not as bad as in your Situation. \nBut eventually I realised that I was completely overreacting, and that all my actions based upon nonsense jealous feelings I had. \n\nIm really glad I got to better, might even say I’m all Sweet and charming again.\n\nStill I’m also proud you ended things with him. He was extremely abusive. He can’t see it himself and that is something sad for his following Relationships. \n\nAnd I’m proud that I got out of there!",
            "Cut this guy completely out of your life, stop apologizing for doing nothing wrong. He’s going to play the victim card to his friends and anyone else that will listen, all you have to say is the truth if your confronted about it. The best revenge in this situation is living happily, this guy will continue to be miserable in his relationships because he’s insecure and likes to pick fights.",
            "Good for you dude. You deserve someone who appreciates your efforts and understands you. Not soemone this toxic.",
            "Good job. Dude is a crazy maker that likes to play head games with you. Always kept you on your toes and worried.",
            "[deleted]",
            "Stay strong OP. You deserve better than this.",
            "God he sounds like a damn fucking narcissist... look it up. Or hes just very insecure and loves to blame you for everything. I wouldn't want to be with a person like that anyway, nothing will ever be enough...",
            "Good for you for not putting up with it, then making the decision to definitely not. \n\nMy boyfriend was similar but less intense as yours. He would frequently claim I would be offended if he said something and he felt everything he said was wrong. I was endlessly encouraging and essentially became his therapist to get him out of anxiety. He can't. Our last fight yesterday, post break up (still live together) was laden with him assuming I was thinking something or assuming I would get upset. Never did. I called him out on it. He got mad and frustrated. \n\nI also left for my mental health. I was constantly taking care of his emotional needs and if I had anything going on, quick pat on the back. \n\nI feel for him/your bf. Must be tough. But holy shit we can't deal with that for so long.",
            "Good fucking riddance, holy shit. Good for you for escaping him one way or another.",
            "God, he sounds exhausting. Good on you for breaking it off.",
            "> \nI won't lie. I miss who he was in the beginning. The sweet guy. The promises. The love. The care. The above-and-beyond romantic gestures. But they had vanished only months into the relationship--after we exchanged I love you's--and then the jealousy came out. The insecurity. Nitpicking what I said and how I said it. Even how I apologized wasn't good enough. His controlling tendencies. He demanded I not talk to my friends about it—even after the break up he asked that I not talk to our mutual friends about our break up.\n\nI could never make him happy.\n\n\nWord for fucking word",
            "Oh sis, I broke up with this exact type of dude five years ago and lemme tell you, you are in for an exhilarating burst of joy and freedom that will last for years. I'm happy for you.\n\nSmall note of advice: I find myself having a hard time not replicating many of my interactions with this dude in my current (excellent) relationship. Expecting someone to be constantly offended can also lead you to feeling constantly offended, like you've mirrored the past relationship. Just be sure to evaluate the ways in which this bad relationship might have affected how you expect others to act towards you--it takes some unlearning, for sure. But when you find someone who doesn't constantly baffle you, doesn't constantly gaslight you to keep you on edge, you'll be so grateful you stood up for yourself and got out of there.",
            "I am very proud of you. I've also been in an emotionally (and physically) abusive relationship and it IS hard to leave.\n\nBut you definitely deserve better. Life is not about walking on eggshells waiting for your partner to explode.\n\nBest of luck, you'll make it and be stronger for it!",
            "Good for you! Recognize the abuse and leave the situation, it hurts but it sounds like being in the relationship hurt more.",
            "Wow. What a giant man-infant. What the hell did his mother do to him to make him think that women are just here to be psychic nannies? Gross. So glad you’re out.",
            "Two years ago when I went off to college and my best friend was still in high school, her and her abusive boyfriend finally broke up.\n\nThis sounds a LOT like that... She hadnt spent a lot of time with friends and was just unhappy. Constantly fighting.\n\n2 years later she's in an AMAZING spot after having so much self growth. She literally *needed* out of that relationship to grow.\n\nIt's like a greenhouse. The walls are clear and sun comes in but you only have so much room it will let you grow. He's like a greenhouse and you're like the plant that can only blossom in the wild.",
            "Resisting the urge to contact him means you are still strong! \n\nPlus remember that his behaviour probably messed with your head, being in an emotionally abusive relationship will weaken you. Doesn't mean you cant get your strenght back!",
            "Wishing you both healing, for different reasons. \n\n*Grey Rock Method* may be a useful tool to have.",
            "I feel like you dated my ex. He was 99,9% exactly like that. I onky think it's not the same person because you said he was a vegetarian.\n\nThe months after breaking up with him were both a relief and shameful cause I let myself dragged through that. Yuck!",
            "[deleted]",
            "Proud of you for leaving him when you did, I was in a relationship for 4 years with someone exactly like him!!\n\nTrust me, you're not going to regret your decision in any way. You're going to be onto better things now and you'll have a new appreciation for 'warning signs' in the next people you date",
            "One day at a time. But so proud of you!",
            "I'm so glad you left.\n\nReading both your posts I had to double check the ages because it sounded so much like my ex. The constantly walking on eggshells and having your every sentence torn apart because you'd said something \"wrong\" (\"well why did you say X if you didn't mean it? you're not stupid.\")\n\nI lost three years and my self-esteem.\n\nCongratulations on your new found freedom! And seconding above advice: TELL YOUR FRIENDS. Don't let him isolate you any further.",
            "Dude I haven't read the original post and only half of this, but he already exhausts me. Good for you for getting out",
            "OP, I broke up with my gf yesterday for THESE reasons and a couple of others. All in all she was hot and cold as well. I would even go as far as to say she's bipolar. I should've seen the signs, the way she acted with her family...hah... how could it have gone better with me I suppose. Although it's been paining me since yesterday but I read this out of nowhere...somehow it popped in my feed and it reminded me of everything she ever made me go through. I feel so trapped still but like you said about being strong...perhaps I just have to gain it all back. \n\n&#x200B;\n\nFunny story I have always paid for our dates n stuff and we recently went to a Halloween event. I cannot stress enough how much crap I've done and paid for her, she has done the same on occasion but this time she charged me afterwards? LOL Who the heck does that to their SO.",
            "This is great. I always recommend Why Does He Do That whenevr I see potential, or completely obvious, sings of abusive behaviour. I always like to think that they read it, and have changed their lives for the better, because it has done that for me.",
            "Move on don't let him live in your head as for the mutral friends most will chose a side and if they go to that side let them go to you don't need any more of that negativity in your life.",
            "I had to deal with a similar problem with one of my previous girlfriends. I felt like I was constantly walking on thin ice, thinking about every single word that came out of my mouth before I said it. It was exhausting and I put up with it for a lot longer than I should have. We actually ended up breaking up because of something completely different, but it was for the best.",
            "This sounds *exactly* like my ex and I’m so glad you got out of this relationship, I can so relate to that feeling of relief once you broke up with him. \n\nI was also in a LDR with my ex, which I count as a blessing as I can’t imagine how much worse he would’ve been if I was with him physically for most of it but god did I feel like I was dealing with a child having constant tantrums most of the time. I was *always* the bad guy when we argued, I was *always* the one apologising a thousand times and he always took anything I said way too personally. But the thing that got to me the most, is that whenever he said something that hurt me and he knew it, he’d just change the topic and come up with a load of jokes and pretend to be completely oblivious. If I ever spoke about how I felt, again he’d take it personally and act like the victim, saying stuff like “I’m sorry I’m not good enough for you” and all that nonsense. \n\nThe final straw for me and when I realised it was a toxic relationship is when I was going through a really low point with my depression, I opened up to him and just wanted his support, I told him I wasn’t happy with the way my life was going (not having a job, not having any friends other than him etc) and instead of being understanding like he used to be, he *FLIPPED* and took it so personally, he was so mean and said horrible things, he even had the audacity to say that I hurt him. Normally that reaction would’ve upset me, made me cry and I’d just go quiet and say sorry but not that time. I was so unbelievably angry so I finally stood up to him, I told him he was taking it too personally and making it all about him, playing the victim and all that. He seemed surprised and shocked, I guess he was expecting me to just cower like usual so for once in the relationship he apologised but it didn’t feel honest to me at all, it was meaningless and too late. The next day I received some gifts in the post from him but that just made me even more angry, did he really think he could buy me? Buy my forgiveness? That’s when I ended it. \n\nIt’s been 6 months since and I’ve never felt so free and happy. I just wish I realised how abusive he was and left sooner, much much sooner so right now I’m so happy for you and I wish you all the best. :)\n\n(PS; sorry my comment is so long, I haven’t spoken about my experience to anyone before so I just let it all out and vented a little)",
            "This is very similar to how my last ex boyfriend treated me. OP, you have made a very wise decision.",
            "You are not a therapist. You do not need to burden yourself in this unrxessary emotional labor. I see lots of women doing this. I'm glad you removed yourself from the relationship.\n\nYou deserve a relationship with a person who has a short route between their heart and their mouth and their mind and their mouth. All this emotional nonsense? That ain't it, chief. He needs therapy.\n\nGood luck.",
            "Super proud of you! I’ve been through some really bad relationships and honestly being single is so freeing. It’s so much better to be single than to be in a bad relationship. You have so many better days ahead.",
            "are his parents divorced? was he medicated at a young age? was he addicted to drugs for an extended period of time? something is seriously wrong with him.",
            "Read your original post where you talk about him getting upset for hours, entire days over you saying things like \"oh! You're up!\". I've been there with an ex girlfriend I wasted way too many years on. That's a lot of stress to deal with, when someone can literally take just about anything you say and turn it into an argument.\n\nSo glad I'm out of that, glad you are too.",
            "I'm really really proud of you for getting out of that, honestly.\n\n I've been battling closing my chapter with my ex who reminds me a lot of yours. Except he was just always cold, I was more the sensitive one but I'd try to come up with ways to be close and spend time together and ask where he was at, and if I said the tiniest little thing, bam, he was angry. And he would yell at me for being too sensitive because I'd break down in tears when of that happened. \n\nI couldn't even go see my grandmother for an hour (which with my depression is all I can manage, little bursts of time) because \"it only takes an hour to fuck someone and sometimes you come back with food or money.\" My gram and me would sometimes go get Panera bread together and whenever i was in between jobs, gram would give me a 20 for gas for the week.\n\nI figured maybe just going on a drive on my backroads would be a safe decision to make because there are no people and I'm not in any social situation. Can just zone out, stare at the road and crank my music up. Nope. Still cheating I guess, so my drives did not continue and to this day give me anxiety. \n\nI woke up early to make him pancakes since he had gotten up early to make me coffee for work, I thought I'd repay him and make him something nice. We then argued for 8 hours over the \"cum looking \" substance on my hoodie. And he was furious with me that when I looked at it I said \"no that doesn't look like cum. That's chalky, like paint or something. I don't know. But I have never cheated on you, I don't understand\" come to the end of the fight, he crouches down next to my crying mess on the couch (I have horrendous anxiety and fights really hurt) and he calmly says with even a slight smile, \"I realized half way through the argument that its pancake batter on your hoodie. Not cum. I was just too far in to pull back.\" 8 hours of screaming and fighting and accusations and horribly mean words at me, just for him to have known what it was all along. \n\nHell, any joke I made that was light poking and the usual relationships joke, he'd snap and say \"there's truth behind every joke.\"\n\nWe even experienced a miscarriage together for an unknown pregnancy. I was at a crappy job and we were in the midst of the fights. After after miscarriage passes, I still have yet to accept what it was and (yes this happened) i convinced myself i drank too much ginger ale and that's why the bleeding wouldn't stop, and the pain and symptoms I saw were completely stress and exhaustion related. I'd go from being screamed at at the hen house I worked at (only worked with young 20 something year old women who constantly bickerwd) to back to his apartment to be screamed at. He told me he knew around the 4 day of bleeding what it was, but couldn't accept it, so he yelled at me out of anger to that (actually told me this) \n\nLately, as the chapter is coming to a close, he'll say something that I've reminded him several times upsets me, which mostly consists of him insulting himself, his dick, and our sex life. Last night he made a comment that made me kinda sad, and he said \"you don't have to start an argument so we won't have sex. I'm not going to try anything.\" And it was so far out of left field I just had to take a minute and try to connect how we got from point A all the way to point Z there. \n\nThe mental and emotional mind games has taken a horrible toll on me and I've isolated myself incredibly. I really hope you're finding the strength to go back out and see the ones you love and never question your worth because he decided to play with it.  Please consider maybe therapy because the constant emotional and mental jabs he did could effect your view on things. I hope you're healing well and doing okay. You now have the ability to be the best you that you can be. Stay safe out there (: \n\n\nP.s. sorry about how long, and format. On phone and a little exhausted.",
            "I'm so happy for you op. That guy sounds like a real piece of work",
            "Fuck this sounds like me with my partner but im the one whos getting upset over small things. This was an eye opener. Thank you",
            "Holly shit.\nGood riddance I say.",
            "This guy is either the biggest piece of shit or this is a strange viral marketing campaign for Why Does He Do That",
            "Jesus he sounds exhausting and emotionally abusive. Glad you're out of that OP. Change your locks just in case.",
            "Daaaamn does this sound like my marriage- which ended last year. I didn't see it when it was happening either, but once I was out it was really obvious how ridiculous it all was and I was shocked at how long I put up with it. I understand being sad, that's the worst. But man, that feeling of being single? In the words of my best friend/new roommate, \"Getting divorced is like having a second 21st birthday.\" Girl, life is about to be so much fuckin fun! Give yourself a few months, you're gonna be the happiest you've ever been.",
            "So good for you! It must be so stressfull walking on eggshells all the time because you fear that you will set off an explosion. Hope the best for you!",
            "Good riddance, OP! I used to date someone who was somewhat like this and also an ex-friend who did the same but was more passive aggressive. Now you don't have to sit around wondering what you did wrong or not trying to trigger anyone. I wish you well!",
            "Sounds exactly like my ex. Everything I said had a \"tone\" and it turned into a fight. I'm so glad you got out. It gets easier, I promise.",
            "You're doing the right thing. You are very strong. So much of this rings true for my previous relationship that ended 6 months ago, and it still is difficult to identify that it WAS controlling and toxic abuse. The holding over heads after the fact, after there was no way to anticipate if something I said was \"enough\" or \"wrong\". Girl. I feel that. \n\nMy suggestion would be to make sure you remember these warning signs as it's so easy to forget when you begin dating again. The longer you've grown accustomed to patterns, the easier it is to fall back into patterns that feel \"normal\".",
            "This was my ex husband. He always accused me of having a tone and would guilt me when I spent time with my family away from him.",
            "Sorry...but boyfriend sounds like an over sensitive asshole to me.",
            "I was in the same position at a time, but I didn’t realize how toxic it was. I had a boyfriend who would constantly pick fights because he felt like i didn’t care enough, even thought i was always trying to get him to talk to me so I could help or even just listen. He eventually used that as a reason to emotionally cheat because he felt like he could talk to another girl more than me.",
            "Wow did this ever remind me of my ex. We were together almost 10 years, I wasted my 20s on them. I'm in a significantly better place now but it's both disturbing and comforting to see someone share an identical situation.",
            "It sounds like your ex has the mentality of a finicky cat. He wants to be alone, but gets upset when you leave. He wants to be near you, but runs away when you acknowledge him. He tells you to go out, but asks you to come back. Its like the classic in & out game I play with my cats every day. \n\nIt sounds like you are a catch. You cooked, cleaned, loved, respected, planned trips and drove everywhere. You did all the heavy lifting. He probably hates himself cuz he knows he could never amount to half the man you deserve.\n\nKeep your head up, OP. Dont look back. You deserve so much more.",
            "Hey, there's a really great YT channel called Inner Integration that I think could give you some clarity (and maybe help others in similar situations).",
            "Lol my ex was like this. He would get mad/annoyed at me over the dumbest things and then ice me out for days. But he could say rude things and would expect me to get over it immediately.\n\nOne time he sent me a snap of him the day after he had a party wearing sunglasses that were very obviously female sunglasses (big, cheetah print, diamond edging) so I said “haha nice glasses! Did some girl leave them after your party last night?” And he iced me for 2 days. No explanation. I was so confused and he wouldn’t answer me when I reached out. Finally days later he says something along the lines of I’m rude for saying they are girls sunglasses because they’re actually his (honest mistake lol). \n\nYou’re better off without him, it gets so tiring/annoying apologizing for stupid shit all the time.",
            "I feel triggered. He sounds just like my ex.",
            "I need to reread this over and over. I think I can totally identify, but it’s “why dose SHE do this”? I’m (57M) and she (58F) and it really sounds just like us with different settings. We’ve been together almost 5 years and engaged 7 months ago. It was on again and off again for nearly the same small BS arguments and fights. Behavior and actions I could never place my finger on. It just always comes back to me not being sensitive or not knowing how to be in a relationship. The one word answers, the silent treatment, me asking what’s wrong, did I say or do something. It’s always no until a day or two later. Mostly later. Then when it comes out it’s BS! Things I never said or did. If I challenge or bring anything up she immediately becomes defensive and out talks me 10-1. I end of getting mad or walk away then feel like I did something wrong and apologize. Only for something to happen again within 14 days. I should have know, normal couple do, or what have you sacrificed....  I’ve often thought she may be narcissistic but the other side of her has the heart of a little girl. So sweet one moment and maybe 10 min later I’d swear I don’t know her. One time her face looked so troubled she looked like someone else. I know I’m not the perfect, not even close perfect guy. But I can listen, I can explore myself, I can take advice from my men friends like when they tell me I owe and apology.... but she absolutely can not look at herself in this way. The first year we were together she could do this and did do this, then it completely stopped. I know relationships need work and the best ones have had problems. I don’t want to be a quitter like my dad but I too am at the end of my rope.",
            "I was wondering how long clothes has been in the wash and had to call my husband and ask him in a cheery voice so he didnt get mad at me. If I texted it would have been a fight.\n\nI asked for a divorce and hes begging me to stay.....\n\n\nThis post is helping me so much right now.  Thank  you. I deserve better.",
            "Precious girl! Glad you escaped. Over the next few weeks you’ll be assimilating and figuring out what you did wrong and he did wrong. Let it happen and work it through and sing in the car to every sad song that comes on and let your self heal. In my relationships, I am clear: “I don’t yell at anyone ever and I don’t get yelled at ever. One freebie and after that I walk. Im happy most of the time and think whatever it is we can work it out without screaming and yelling. If this is a problem let me know up front.” Had one girl tell me point blank: “This means we’re probably not compatible.”  Bingo.",
            "He seriously needs therapy.",
            "Way to go! I know the relief is mixed with greif, been there. But yes, it gets better. This is the big bad part, and you handled it so well.",
            "Just so you know, the reason you feel like going back even though you know it's wrong? That's him. Chipping away at your confidence and making you think that no one else could possibly be as \"patient and understanding\" with you as he is. Thats what emotional abuse is. It isolates you from friends and family and makes you reliant on him. It's a tactic so women wont leave. And when they do anyway? Last ditch manipulation. You have to show him it wont work. Tell your friends what kind of a boyfriend hes been and you need their support because then you can talk to them when you feel the urge to text him",
            "[deleted]",
            "[deleted]",
            "I know mexican tv shows that start it less than this",
            "Sending prayers to you, OP.  I’m so glad you got out and I’m sorry that happened.",
            "I don't know if I missed this somewhere, but it seems like you are still talking to him? If so, I wonder what you are hoping to achieve by keeping in contact with him. You turned yourself inside out and upside down trying to please him, which failed because he is crazy and controlling. Do yourself a massive favour and totally cut him out of your life. All he does is drain the happiness from you.",
            "I'm sorry you went through all this. My last boyfriend told me, shortly before we broke up for good, that I wasn't worth him getting a \"real job\". He was a guy who got mad that I had a curfew (we were teens), got mad when I didnt want to go out for the 15th day in a row during summer break, got mad that I had friends that weren't him, got mad when I suggested we spend time with my family instead of his. But I was unwilling to look at it as emotional abuse too. I know now that it was and I know what to look for in future and friends relationships.\n\nI'm glad you let him go",
            "Ugh this sounds JUST like the last few months with my last ex. The last time I'd been caught in a relationship like that, it took years to get out. I'm proud of putting my foot down faster this time. Thank you for sharing this, I hope it inspires others to make positive changes, too!",
            "As someone who lived almost the exact experience you described in your previous post and this update I must say I'm extremely happy you took this decision and you ended that relationship. It'll take a while, but it'll get better.",
            "About six years ago I was with a woman that followed a very similar pattern in terms of lashing out. Anything I'd say would be misconstrued as negative or hurtful. Hell, we got into an argument about cat food. CAT FOOD. And following that argument she stated she \"couldn't trust me anymore\" and proceeded to use that situation to be pissed at me for an entire weekend. I suffered through that shit for three years. She then decided to break up with me about a month and a half after I was diagnosed with PTSD (which she triggered).   \n\n\nI'm glad you're out of the situation. It can only get better from here.",
            "Gurl, you are strong! I'm proud of you! You're an independent woman who don't need no man - especially one like him! My anxiety would've shot through the roof if I was in that situation.",
            "[deleted]",
            "Please dont consider going back.my bf is the same way.constantly arguing with me over the smallest things.if I forget to do something I said I would he will go on and on for hours telling me how wrong I am and how it's important I dont forget.doesnt want me around my friends.like at all.ever.we broke up last week and sadly I let him come back.worst decision I could've made..yes its difficult without them but that is just your body responding to pattern.were used to being with them.you know that once you see him again you will go right back to feeling how he made you feel before you broke up.im currently trying to get mine out again.so do it for the girls like us  sis DONT GO BACK lol.srsly,no one deserves to be treated or made to feel that way frfr",
            "Hey good for you. Reading the previous one just now, and then this, if someone shows these early warning signs, don't hesitate to leave. There are plenty of other people out there who want to get to know you. Every month extra you spend on someone who has that many red flags, is a month of missed opportunities finding someone better.",
            "Ive been in an emotionally abusive, manipulative relationship. I'm not gonna get into details because this is your story, but it fucks you up. It makes you question your own sanity. It makes you doubt yourself when you know you are right. You idealize the person as who you thought they were and don't see them as who you've learned they are. After a few days of not talking your phone is like a thumb magnet. You just want to text them. After a week of not hearing from them, you hope it's them every time it dings. It took a lot of strength to get out and stay out, and it's all you can do. After a while I was just me again and I can't imagine going back and I'm so grateful I didn't because it was always just a few thumb clicks away. Stay strong, you know what you deserve and it's not to be constantly fucked with  for the purpose of curing someone else's insecurities. I also like to think that they, anyone who is the him in this type of thing, not just your him, will find the person that they can finally be happy with, that I was as much not the one for them as they weren't for me  and that they one day can breath easy, as can I. But who knows. Anyways good for you",
            "So proud of you!! I’m glad you left! You deserve way better!",
            "Your bf sounds like me. I’m overly sensitive.",
            "Good for you. Sounds like you took the right path. I got married and believed their lies until we had a kid together. Now I stay to take care of the kid but we don't have a relationship anymore. Once my kid is older and able to understand I can hopefully be on my own again and start recovering from years of what was basically mental torture. If everything goes well, that is.",
            "What a shit sandwich",
            "so a different perspective here. i’ve kinda seen some of this abusive mindset bubble up in me with my girlfriend, and yikesssssss. thank you so much, op cause i knew that the constant missing her and especially the overly sensitive part really hit home. so i’ve been trying to fight this mindset recently (thankfully it hasn’t manifested to destructively for the relationship) but your post has helped me to better characterize it and hopefully shift my thought to become a better person for her. thank you, seriously.",
            "Oof, my head feels mashed just reading about this man's behaviour. It sounds like you tried to meet his needs and he expected that but he didn't tell you what they were, you did all the work and he constantly moved the goalposts to put you in the wrong. I hope you can now get some rest and relaxation with nice and normal people as your ex sounds absolutely exhausting.\n\nYou shouldn't sacrifice anything in a relationship. Compromise, definitely. But sacrifices? That's a really weird term to use. \n\nYou sound like you're going to be fine. Plus you're using the painful experience as a learning experience and you'll grow from it. And you know how to ask for what you want and need and hopefully you'll meet someone who meets your needs, lets you meet his, doesn't expect sacrifices and puts his half of the effort in!\n\n(While your ex is still playing \"Guess what's wrong with me as I won't tell you and it's your fault anyway\" and being unable to allow himself to enjoy anything at all (like tropical islands with a loving girlfriend!!! WTF?) just so he can feel... who knows or cares what. I almost feel a bit sorry for the weirdo, what a miserable life that must be.)",
            "Ugh. I had an online friend like this. Glad I ditched her.",
            "I've seen a similar experience with two of my friends being in your situation and I was in the middle of every single one of their arguments because they were unable to deal with it alone like responsible adults. They loved each other, like you loved you boyfriend. It simply didn't work out because it was never enough. They had too much communication issues, they couldn't work on it because of how the other talks or whatever and they get defensive and argue for nothing. Kind of like what you just said. When they broke up they said things hurtful to each other because they were bitter but it's better now. I'm invited to my female friend's wedding as her Best Man (I still helped her a lot in her current relationship) and my male friend is now happy with a wonderful woman.\n\nSo it does get better. I loved both of them but they simply couldn't make it work because of who they were at the time and now that they both evolved seperately, they feel better. I'm glad for you that you left that unhealhty relationship. It is obvious that you cared for him and that's a good thing. I think he needs to grow outside of your relationship and so do you so don't feel guilty about it. I think you will grow from it and it will get better. Later you'll look back at it and feel proud of yourself for being strong and that is something priceless. I wish you all the hapiness in the world, sincerely.",
            "Man, I'd love to know what a psychologist would make of that guy. Has to be some serious disorders going on there. As someone with some serious mental health issues I can't help but feel some sympathy for him and what might go on in his mind, but I can also say that a relationship with that guy is untenable. Some people just have to work on themselves before they can ever be ready to work on a life with someone else. We aren't owed relationships.\n\nEdit: Psychiatrist to psychologist, constantly mix those up.",
            "I had a relationship just like this. Congratulations on getting out. I'm in a healthy relationship now where I don't have to constantly walk on eggshells.",
            "Honestly, I didn’t even finish reading your post because just reading it was so exhausting. He sounds like a nightmare, and I’m glad you are not with him anymore!",
            "Check out the book \"No More Mister Nice Guy\", and send your ex a copy of it. Seriously. Everything you're describing is classic \"nice guy\" behavior as described in the book. (There's an audible version, too.)  He's using you to define his emotional well-being, setting up \"covert contracts\", making you feel like you own him for the things he does for you, etc etc. It was eye-opening for me (48M).",
            "Good on you dude, I'm glad you got out before it got worse. It's good you are warning other people to get out of relationships like these. I hope you're happy and your next relationship is better than this one was.",
            "Holy hell...I just downloaded a copy of \"Why Does He Do That,\" and it's incredible. \n\nIt's been 10.5 months since I dumped my abusive ex-boyfriend, but he is still hurting me. Those memories still haunt me. Maybe this book can help.",
            "This guy is going to have one hell of a time finding a long term partner who will put up with this bullshit. My guess is that every future relationship is going to fail because of him and his extreme sensitivity/gaslighting. He really needs to see a therapist to talk about these issues or he's never going to find long term stable love.",
            "If I missed the part where you said he is your boyfriend, I would TOTALY think he was a 14 year old boy. How immature.",
            "[removed]",
            "Long story but wow crazy how no matter what u do know matter how much u give they (bf/gf) will never appreciate it. I'm on that same boat.   But my Gf is 15 y/o older then me and treats me like one of her kids",
            "Awe thank u sometimes that's all a guy needs someone to  vent too",
            "[deleted]",
            "You are amazing and I'm so proud of you for getting out. Nothing you did was ever going to be enough and that you was never a reflection of you. You did everything you could and now it's time to find your happiness. \nHim moving back to his own country is a blessing. I'm glad 💖 look after yourself and know that you are amazing xx",
            "My ex boyfriend emotionally abused me to the point where I almost took my life. I was so emotionally , mentally and  physically drained that I felt sick most days. He would get mad at me for not saying good morning the way he wanted or for spending time with my family. We would fight every single day. He was relentless. He emotionally manipulated me into having sex with him. He said his friends were making fun of him because we had been dating for 9 months and had yet to have sex and that I was using it as a way to string him along. I wasn’t. I was 16 and didn’t know better. After we had sex I cried for hours and he got mad at him for “not telling him I didn’t want to have sex”. To this day he is one of the worst people I’ve ever met and I wasted a year and a half of my life with him . When I finally decided to leave him he did everything from calling me a cunt, whore , bitch, even wished pregnancy upon me. I’m so glad you’re out of this. And trust me, it gets so much better. You never realize how truly mentally exhausted you were until you finally stop thinking about them and start being happy again.",
            "Oh. It’s so overwhelming 😰😰, don’t know how you maintained the relationship for that long. If I were you, i think I’d boot him out of my house... glad you’re relieved now. Congrats",
            "I am SO fucking proud of you!\nAre you worth all that work?!??\nDamn RIGHT you are. Basic respect isn't even work. What a self involved, self pitying, self centered selfish little person he is. What's broken in him isn't yours to fix. He's wildly controlling and much of this is simply abuse. It would have gone from emotional to physical eventually. \n\nMen and women of the world:\n\nIf ANY of this feels like it's ringing true for you, it's time to end the realtionship.\n( Or, get to a relationship therapist, STAT if this behavior is coming up in a relationship that is very long term and this is a recent change of behavior after a very long time of not having this type of behavior. Your partner may be struggling with a mental health crisis. It doesn't make their behavior okay or excusable. It just means that life is long and the things people go through so do their families and loved ones. You're never obligated to be abused no matter the circumstances.)",
            "[deleted]",
            "I wasn't there and I don't know anything, but your story reminded me of someone, so I wanted to say that it wouldn't hurt to walk away from this with a little self reflection to maybe help you in the future.\n\nIt wouldn't hurt to pay attention to your tone. Is it possible that what you're saying is being misinterpreted by others because of how you say it? Maybe the inflection of your voice, or the look on your face when you say some things.\n\nI've witnessed interactions where both people end up upset and one of them says to me afterwards \"I don't know what their problem was, I was nothing but nice!\" But the whole time I was thinking they were being pretty rude.\n\nNobody knows your intentions when you say something, so make sure that you are relating the message you want to give.\n\nCan't hurt to look into it. Maybe it was just him, but if you can avoid future misunderstandings, wouldn't that be worth it?",
            "I would love to see his side of the story.",
            "Just gonna throw out two possible scenarios.\n\n1) he really is the insecure baby\n\n2) you're judgemental and passive aggressive\n\nLikely the truth is somewhere in between.\n\nWish you well.",
            "u/jilltro, u/slinky999, u/tinybluesatan, updates for you and thanks for your help!",
            "“...had just seen him in the bedroom.”",
            "When someone shows you who they are, believe them the first time.",
            "... Squeeze it. Just make it rupture.",
            "He has inner child issues, he needs therapy. I wish you well, I'm sure it's a difficult time for you.",
            "I was in a very similar relationship for 10 years (married 2 of it). When I finally stood up for myself and everything imploded, I started to tell my friends. Nobody was shocked what-so-ever that I ended it. They had seen it from a distance the entire time. They all thought I was happy and that it was what I wanted so they never wanted to make any comments.\n\nIt's been two years since the divorce and people still come out of the woodwork (including some of his family and his family's close friends) who say they are happy I got out and that I am living life again.\n\nI lived with so much guilt after (the cost spent on the wedding, ruined friendships because he didn't want me to hang out with my friends, etc.) but we all make mistakes. We have all thought we were doing the right thing only to wake up one day and realize that we were so far off base from what we truly want and need in a healthy, happy life. \n\nI'm proud of you. It's hard, it sucks, but it does get better. Talk to those around you. Your true friends will continue to support you and be happy for you. Don't be ashamed of the relationship, remember the positives and think towards the future, you're doing just fine.",
            "Proud of you, so freakin' proud girl! Take back your life.",
            "How many of the 64 signs did he meet?",
            "Yeah, this relationship was super toxic. Good on you for having the strength to pull the plug. It's so for the best.",
            "Ugh, this dude sounds like a real stick in the mud. And exhausting. \n\nI'm glad you're out. And I hope you use this experience as a way to gauge future relationships. \n\nBest of luck to you.",
            "I'm sure others have already said this but you could summarize the section on what you sacrificed by just saying you sacrificed yourself, girl. You have up a whole ass life for this man; from what you shared and what I read, I can't find one single aspect of life that you didn't change or give up or suppress for the sake of him, his joy, his pleasure, his feelings. From someone who has been there, done a *lot* of therapy, and is now in an incredible, healthy, happy relationship with a wedding on the horizon: Keep going. Keep doing the work. Keep investing in your own self, your own joy, your own pleasure, your own identity, and trust that a partner will come with time but you are \"the one\" for yourself. Sending love!!",
            "He displays some narcissistic traits tbh",
            "I went through this with my ex, but he left me because he found a new plaything to start the cycle over with. So it extra stung but damn wasn’t it the best little surprise in the world. My life is so much better without him and so will yours.\n\nIf you ever need to vent or talk about it with someone who has been there, I’m here (: proud of you OP",
            "One thing. When a guy says it's nothing it means he doesn't want to talk about it with you",
            "I know exactly what you are talking about, not so long ago I was in a similar situation. For 5 years I had put up with a man (acted like a child), who lived off of me and my family in my home, was disrespectful to my parents, emotionally hurtful to me, and took absolutely 0 responsibility for anything in his life. It was all video games and sitting on good computer all day, no matter how much I begged him to get a job, go to school, do something with his life, he refused or lied about it.  I kept thinking I could change him, help him grow into who I wanted him to be. The problem is he never grew up and never wanted to, but I did and our relationship became a chain and ball that weighed me down and held me back. It took almost dying to make me realize he would never be there when I needed him, and no matter how much I loved him, he would never love me enough to change. So I left, I kicked him out after he decided to make fun of me for being scared of driving after the nearly fatal car crash, and you described it perfectly, I felt a huge relief as I let him go, I could focus on myself. And I did, I excelled at my job, got my own place, and met my now boyfriend who is do wonderful and 100x more mature and thoughtful than he could ever be. It does get better, you just have to make the leap",
            "I’m so sorry you had to deal with this. My (25M) former friend (23F) strung me along for 2 years. Granted, I let it happen, because I really loved her. By the time she filtered through every crappy relationship she had and realized I stuck with her through it all, the damage was too great. We haven’t spoken in seven months. Your story reminded me of it. \n\nI’m thankful you got away from him though",
            "Oh man. That thing about you not \"comforting\" him the way he wanted you to- the exact thing happened to me during the end of my last relationship. He was upset about something and I was offering suggestions to help him get through it and trying to be supportive, even though I was already mentally drained from dealing with his attitude in the days beforehand and I was tiptoeing around him at that point to make sure nothing I said upset him. Of course he did get upset, and was pissed I didn't just comfort him, which I thought I had but I guess he just wanted me to say something like \"everything's gonna be okay sweetie\" which is not normal coming from me at all, especially when he was just complaining about band practice or school or something and I was trying to be realistic since he constantly went on about that stuff and as much as I would talk it through with him he would never do a thing to make it easier on himself. \n\nHe didn't do the whole taking things I said as offensive thing but that bit about the \"comfort\" really struck a chord with me. It really boiled down to him not respecting me as an individual with my own reactions to things and my own way of handling problems- I'm not gonna be clingy or super cuddly or say a bunch of mushy things in hopes of making you feel better. It's just not who I am and all of those were things he tried to force me to be. Obviously there was more to it than that but that was pretty much the final straw. We're staying friends and that's been fine so far because I think he just had this idea of a \"girlfriend\" that I didn't fit because I'm actually a person with my own personality.\n\nGood on you for getting out of that situation. I know it sucks but it's crazy how much can change after you're single, like you don't even realize how much of your life had been affected by being in a bad relationship.",
            "It sounds like he has personal problems within himself. People who don't have confidence in their own emotions will send to grasp onto someone else who will allow them to take advantage of them emotionally like an emotional vampire. A big mistake in relationships is arguing with \"you\" statements instead of \"I\" statements. He's had some sort of trauma in the past for this behavior to continue on. Also another warning sign in any relationship is moving too fast. Always have a guard on you and get to know them before jumping in so quickly. That's how relationships fail. If he doesn't fix his own problems, he will do the exact same thing to somebody else.",
            "Does someone have daddy issues (just a joke)",
            "Dude has borderline personality",
            "sounds like my wife.picking fights out of nowhere when she's bored",
            "My only question is why is it \"why does HE do that PDF\" ?\nLike women can't be emotionally abusive too? GTFO\n\nAlso was your ex bf a toddler bc you described a toddler?"
        ]
    },
    {
        "post_id": "coolef",
        "author": "Confetticandi",
        "title": "UPDATE: Boyfriend [25M] wants to break up because I [26F] can't drink",
        "url": "https://www.reddit.com/r/relationships/comments/coolef/update_boyfriend_25m_wants_to_break_up_because_i/",
        "score": 6564,
        "num_comments": 377,
        "created_utc": 1565475868.0,
        "selftext": "Original post: https://ud.reddit.com/r/relationships/comments/b83384/i_26f_and_my_boyfriend_25m_about_to_move_together/\n\nLong story short, we had a discussion and broke up that week.\n\nNot gonna lie, those first couple months were hard. It felt like the rug had been pulled out from under me and I was totally unsure what to do next. I was torn between sheepishly asking my company to withdraw the transfer, or going ahead and moving alone to what felt like my ex's city. Either way, the clock was ticking on my apartment lease. The anxiety was keeping me up at night and the lack of sleep only made things worse. \n\nOn top of that, it was tough knowing that I was probably the only one sad about the breakup while my ex was living his best life, partying with best friends and banging hot chicks, relieved to be rid of me. So...yeah. That felt like shit.\n\nIn the meantime I threw myself into work to keep my mind off things. That's when things took a crazy turn because one of my projects garnered a lot of attention. It led to me writing a report that made its way to a member of upper management. Lo and behold, a few weeks later a management position opened up that I was uniquely qualified for...and the interviewer was that same person who liked my report.\n\nSo I got the job! And when they told me that I would need to relocate to our home office in the Bay Area (I work in biotech), I was able to tell them that all my stuff was already packed and ready to go. Thanks, ex!\n\nSo now, instead of Dallas, I'll be moving to the Bay Area in a few weeks. One of my best friends is coming along for the ride. We're going to make an epic road trip out of it and hit a few national parks along the way.\n\nSince we had fully expected to move in together, my SO had taken some of my belongings down with him. I've paid about $500 so far to get my shit shipped back. My kitchen stuff and some pieces of furniture are forfeit. He has yet to return my gaming consoles. We really should have split it, but I knew he'd turn that into a back-and-forth that I didn't want to deal with. Tbh, there's also enough of a difference in our budgets that $500 to me is not as big a deal as $250 would be to him. (It's yet another blessing that we never merged our finances.)\n\nI've reminded him a few times about the rest of my stuff and he keeps telling me he'll get it to me. I *really* don't want to have to come down there with a police escort to take back my property, but it's looking like I might have to. I don't know why he has to make this so difficult, but I'm getting pissed. \n\nSo if anyone has any advice to share on that...\n\nI know I'll never know his true thinking, but honestly who cares at this point?\n\nI've also decided I'm not going to try to date for another year at least. I've been told that my management role is likely to be upgraded to a director role, depending on my performance review. So work will probably take up a lot of my time. Any remaining time I have, I want to fully devote to forming friendships. \n\nBut most importantly, if you couldn't already tell, it's clear that I have some serious work to do on self-worth and boundaries.\n\nFTR, I think it's important to note that it's not like this guy was a deadbeat loser. I know it's easy to think, \"Why is this woman dating an asshole?\" when you read these posts, but it's rarely that simple. Everyone who met him loved him. We shared a lot of common interests. He was fun to be around, always happy, great to talk to, supportive of my career, a fantastic cook, very organized, came from a great family, had a good job, all of that.\n\nHowever, there's no denying that I was in a long-term relationship with someone who consistently took *way* more than they gave. Like, on every level. And he himself would admit that.\n\nI want to take this time to work on myself so that I never accept that kind of situation again.\n\nBuuuuut, when I do decide to put myself out there again, it's the Bay Area. God knows there will be plenty of guys around who also get Asian glow and will understand why I'm not drinking lol\n\nCheers, everyone! 🥂\n\n**Tl;dr** We broke up. Went through a terrible couple months. Drowned myself in work to cope. Hard work paid off and I landed a major promotion that will take me to the Bay Area instead. Learned an expensive lesson about letting an SO move your things. Hoping he doesn't make me come down there, but I know it's all going to be good in the end. Gonna take the next year to be single and work on myself, but life is looking up.",
        "permalink": "/r/relationships/comments/coolef/update_boyfriend_25m_wants_to_break_up_because_i/",
        "comments": [
            "Perfect example of \"when one door closes, another opens\".",
            "Just keep in mind that this was NOT YOU. Totally him. I’m a drinker myself, more than I probably should, and I can’t imagine my husband not drinking bothering me for a single second. If he didn’t like to go out or refused to engage in get-togethers, that’d be one thing, but that wasn’t you at all. You still liked to go out and get together and have fun, you just weren’t drunk. Sounds like zero compatibility issues for someone who isn’t a jackass, to be honest. I don’t care how much my husband drinks; I’m only interested in how compatible we are with reading at pubs or hosting small parties or getting together with friends. I couldn’t care less what his alcohol intake is during those times.\n\nYou’ll find someone much better, and until then, you just keep living your best life with no hangovers, friend!",
            "Hi,\n\nI know there are a lot of comments so you might not see this but I want to let you know that I live in the Bay Area and I also don't drink alcohol.  I run a meetup group for coffee/tea drinking and if you're interested please direct message me and I can give you more information.  Hope to hear from you!",
            "\\>>I know I'll never know his true thinking, but honestly who cares at this point?\n\nThis is so important.  None of us ever really know why we were broken up with.  It doesn't matter.  If they don't want to be with us, it's best to forget them and move on. Obviously easier said than done, but congratulations for doing it!",
            "Good for you! And good luck. If I were you I would find a lawyer friend to write him a demand letter for your stuff back, or a money order for it’s value. He needs to know you are serious",
            "I am so excited for your amazing new life!",
            "Good for you and congrats on the job!",
            "I remember this post! Congrats on the promotion - stop messing around with your stuff in Dallas, go get it or send someone to get it so you can move on.\n\nYou’re letting him do what he always did, make unilateral decisions and kind of just yank you about. Stop it. You’re super successful and good peoples, go get your shit this week and stop communicating with him after that",
            "Congrats on the promotion and on moving on from your ex! I actually have the exact same condition as you and my fiancé likes to drink, but he couldn’t care less about what I do. We go out sometimes and he has a few drinks and I either have one or don’t drink at all and everyone’s happy regardless (and we save money!). Any person worth pursuing a relationship with in the first place won’t see your inability to drink as a downside.\n\nAgreed with some of the commenters on your original post that he was unfortunately probably just looking for a reason to break it off anyway or wasn’t ready to commit and was using that as an excuse. I promise you there are plenty of people whose lives don’t revolve around alcohol-related activities who would be glad to have you as a partner!",
            "Could you imagine breaking up with someone because of alcohol",
            "Good luck with your new promotion!",
            "For getting your stuff you can ask the police to come and keep the peace. Who owns what property is civil and the cops are not going to force it if he hems and haws.\n\nAs for not drinking you will be fine. I don't drink. I chose not to as a child due to my family being a bunch of alcoholics. I've never had a drink of any type. I'm 40 so I think I can keep this up. My husband is fine. He has learned the fun nonalcoholic drinks that I like. He still drinks and goes out with friends. He even gets tipsy sometimes at dinner and enjoys that he always has a dd.",
            "Good for you!!  I think your plan to work on just developing a friend circle while figuring out your relationship patterns is a good one.   \n\nRe getting back your stuff,  I don't want to be insensitive, but is anything there worth flying back for?  Or are there things of sentimental /personal value?  If it is stuff with monetary value, You might want to ask r/legaladvice if there is a legal way to recover it.  If it's the latter, is he just being lazy because he knows you are far away?  Then give him a  deadline with a consequence?  Or is he someone who chronically can't get his shit together?    You might be able to hire one of those organizer types to take a list  and pack it up.",
            "Looks like the breakup was a \"good\" thing for you.   \nAny guy who breaks up over such a dumb reason is immature. Even tho it most likely the main reason was him being out drinking, being a ladiesman and having fun. In a few years this wont be so fun anymore.  \nGood riddance. And good thing will come for you. Keep your head high and work on your selfworth and all that.   \nAlso make sure you get your stuff back.   \nYou do deserve better, girl!",
            "OMG I'm moving to the Bay Area too! I'm Chinese, and I'll be in tech. HMU if you're down to make friends! I'm really interested in building friendships",
            "Coming from a long line of alcoholics, the chaos, sadness, and the feeling of helplessness when your loved one is calling you from a place where not even he knows where he's at, is a NIGHTMARE.\n\nMy father says that alcoholism is basically similar to having a \"mistress.\"  It will tear up your family, you will lose close friendships and bonds with other loved ones and your life will basically be ruined because of it.  Well, there's that and the fact that you will die a slow and agonizing death when your liver and other organs begin to shut down.  You will eventually end up in one of two places.....prison or a coffin.\n\nPlease, honey....you're bf doesn't sound like a keeper.  The mere fact that he doesn't respect your actual physical reaction to alcohol speaks volumes about his character.  It sounds like this guy is trying to relive his glory days with his frat boy mentality is ridiculous.  Let him find someone that shares his yen for \"partying\" and \"whooping it up.\"  Before long, that's going to get OLD and he's going to realize that he let go of a good woman for the wrong reasons.  He needs to grow up or he's in for a world of hurt if goes down the \"night train.\"  \n\nI'll admit, I do have an occasional drink every now and then but witnessing the downward spiral that one particular loved one flew into, was HELL.  The not knowing where he was when he would call me on his benders and the fact that I live 4 hours away from him tore away at my soul.  Sadly, I prepared myself for the \"phone call.\"  The phone call that was either going to tell me that my brilliant, successful attorney brother had killed someone while driving, had died while driving drunk or that he went to jail.  I finally did receive the call that he went to jail.  Felony arrest for evading the police while the idiot tried to get away by driving like a lunatic.  He still didn't learn his lesson and kept drinking.  Apparently, rock bottom for him is actually an abyss with nowhere to finally land.  My heart aches everyday for him but all I can do is hope that he's ready to help himself.\n\nBest of luck to you, OP.",
            "Girl, yes 👏\n\nI’m (27F) in SF too and always looking for work out/running/hiking/board game buds if you wanna do some non-drinking activities!",
            "[deleted]",
            "Keep the positivity going, it sounds like you've got a lot of new and exciting things going for you!",
            "If you want to be petty (I condone this), call customer support for the console and report it stolen. They can get it blocked from working properly if you have some proof you owned it.",
            "Yes girl!!!! You go live your best life!  A man who doesn’t value you isn’t worth your time or tears. I don’t know you, but I’m still proud af of you.",
            "Congratulations....I had the same thing happen to me but it was about marijuana.  Come to find out he was cheating...I took two years off from dating best choice..worked on me got it together started the whole self love thing....Good luck take your time to heal",
            "I'm so happy for you and also super happy you're deciding to stay single for a year. A lot of people can't stand that and just jump into relationship after relationship. You sound amazing!",
            "Damnnnnnnn GIT IT GIRL!!!!!!!!!!! We all got yer back!",
            "I remember reading your original post, great update! Good luck in your new job and your new city, and I’m so thrilled for you that it all worked out so well! Onwards and upwards",
            "I was born and raised in the Bay Area, I hope you’ll be able to have enough time to explore and find all the wondrous things it has to offer! There are so many small places you’ll discover just by making new friends. and even exploring on your own. Congrats on your career adventures and best of luck to you! :)",
            "The world works in mysterious ways! Congratulations and I hope only the best for you ♥️",
            "Welcome to the Bay Area! It can be horrendously expensive to live here even if you make good money but hopefully you find a good living situation. But you will never run out of things to see and do here. Congratulations! And I hope you get your stuff back.",
            "Last year I had major surgery (fine now) but dropped like 45lbs that I did not need to loose. Because I was extremely underweight my body did not process alcohol the same when. Before I could slam down shots all night and be decent, now one glass of wine made me violently ill. I just started being able to drink again but during that time my SO and the new group of friends we just met (we moved east to west 6 months before I needed surgery knew no one) where nothing but supportive , since we lived in a weed legal state they would buy me drinkables when we had parties. My SO bought me fancy cane sodas so I could drink something when he had a beer at the end of the day. It isn't normal for loved ones to make you feel that way, stay strong love!! Also since your not looking love might just hit you when you least expect it.",
            "welcome to the bay area! i’m a south bay local, so if you need any recommendations, please reach out! i am a transplant also, and it was the best thing for my career, dating life, and overall happiness, cost of living be damned. keep thriving!",
            "Good riddance to bad rubbish. And if you’re looking for pals in the Bay Area, I’m 27F, can make a mean mocktail, and have a cute as hell dog!",
            "major congrats on the new job!",
            "Hell yeah! Way to make lemonade out of your situation. As someone who lives in San Francisco and dated a non-drinker, don't you worry your little Asian glow ass. ;) There is so much to do here and everyone is so open to different lifestyles that you might get the question if/why about drinking but beyond that, nobody cares. Drink your soda or 1 drink to your heart desires.",
            "The universe was looking out for you! You'll be great!",
            "You go girl! I'm so happy for you!",
            "Congratulations on your promotion! If you plan to visit multiple national parks get the Annual National Park pass. It's totally worth it.",
            "Oh wow. I wish I had seen this a few months earlier. I'm (M29) in the Dallas area and also don't drink - nor for religious or moral reasons, though. I can assure you that I've never run into a problem with it no matter where I go, once I met the right people. If you go out with friends, alcohol isn't the point, if it's there at all. It's the same every other place I've been. If your ex and his buddies were the type to rely on booze to have a good time, they probably weren't the kind of people you should have been hanging around with anyway.\n\nI'm happy you got your happy ending, though. If you do have to come down here and want to meet up with a fellow non-drinker, feel free to reach out. There's a hotel bar downtown that's started carrying Seedlip alcohol-free cocktails, and I've been looking for someone to try them with.",
            "The  not drinking shouldn't matter in a relationship. I'm on some seizure medication and I've never been able to drink because of it. My wife doesn't love me any less. It just means that she'll always have a dd.",
            "Wow girl you glowed up yourself. I want to be like you. So inspiring:)  life has so many awesome things for you when you keep loving yourself",
            ">my ex was living his best life, partying with best friends and banging hot chicks\n\nMy first thought when I read that was \"uh ... that's not his best life. It's a path toward self-destruction and financial ruin if he's not careful because it sounds like he's not focused on long term goals, moderation, or what's really important in life.\"  I mean I got no problem with the occasional drinking with friends (if you can metabolize it, of course!). But if drinking and screwing lots of women is what defines your \"best life\" - at some point that's just kind of sad.\n\nThen I read on, and found myself nodding along thinking \"yeah, YOU! You are living your best life!\" So internet high fives from someone who focused enough on my career when it mattered to be able to retire early. Hoping for you to be able to do the same. Not that you have to retire early, but hoping you have the ability to make the choice, you know?",
            "This is fantastic! I'm so happy for you! Also you know what? Drinking is overrated. So many calories in alcohol, I'd rather spend those on foooooood. \n\nGood luck with your brilliant new life in the Bay Area :)",
            "Hi I’m 25F in the Bay Area. I have the same condition as you (extremely allergic to alcohol) so hit me up if you need someone to show you all the cool boba places in the bay since boba > beer anyway 😉",
            "Sounds like an awesome update!",
            "Other than the crappy way he's dealing with your stuff - wanna bet he thought you'd reconsider eventually and beg him to take you back? 🙄 - this is so awesome for you!  Congratulations!  And if you're in biotech, the Bay Area is probably a better place to be for your career anyway.",
            "Seems like a happy-ish resolution! I have no relationship advice to offer but tons of National Park tips depending on which ones you’re going to!",
            "Congratulations! I’m so glad that things worked out for you.",
            "I know I'm late to the party but I've been dating a girl for almost 2 years who doesn't drink nor likes going out, but she respects that I do. We both respect each other and our preferences and it works. Your breakup was the best thing for you OP, good luck in the Bay area, it's beautiful there! You got this!",
            "Fabulous outcome! I lived in the Bay Area for over ten years and absolutely loved it.  You have a great attitude and I predict you will be looking back wondering why you wasted so much time with your ex.",
            "Just read your original post, Your ex was either using the drinking thing as an excuse or is just as asshole. my boyfriend doesn't drink, I do, never been an issue, i go party with my friends a few times a month and come back to my loving sober boyfriend.",
            "You sound like a great person and I'm glad you got rid of the dead weight. I don't drink anymore because I have a non-alcoholic fatty liver. It's maddening being a non-drinker because everyone keeps trying to push drinks. It's really inconsiderate and I know it's tough being social in a society that seemingly worships alcohol. \n\nCongrats on the job advancement. Sounds like this all has you ultimately coming out on top.",
            "After reading ur title i said to myself \"where the fuck is the world going to\". Imagine a break up due ure still virgin, didnt do drugs, never smoked, cant drink. So stupid. People who break up due these reasons dont deserve a partner",
            "It's always a great feeling when something bad turns into an amazing opportunity down the line.  Congratulations! \n\nI don't drink either and it is weird that he even cares as long as you aren't trying to tell him he can't.  For me,  it can also be annoying to always be the sober one with a bunch of drunk rowdy people though. My ex was such a PITA that I paid two months of my rent, took my clothes and cats, and left him everything else.\n\n*And books.  I took my books lol.",
            "Hey, don't worry about it. There are plenty of people who don't drink out there. I personally don't, although in my case it's because I can't stand the taste. Good luck!",
            "Congratulations! - your positivity and how willing you are to do right by yourself is radiating off this post. I'm so excited for you!",
            "Welcome to the bay! \n\nIt's not perfect out here but the food scene and hiking out here is great. Hope you grow to like it.",
            "Police often won't help get your shit back like this.\n\nIf that's the case tell them hey I need help moving some stuff this weekend.  Anyone who wants to help gets free pizza and beer after.\n\nHere's my number call me if your off duty and want to help.",
            "I'm sorry you have trouble finding people that don't feel comfortable having a sober friend around, as the sober friend I have found most of my friends appreciate it.\n\nGood luck on your new job and life.",
            "Congrats about your job and ending a relationship that wasn’t worth your time! If you have any questions about moving to the Bay, I moved here a couple years ago so feel free to reach out :)",
            "Honestly, I’m so happy for you that, even though it was hard, you got out of the relationship.\n\nI met my fiancé at a time in our lives when we were heavy drinkers/partiers. We were young, had a rough job, and we liked to go out at night. He even had a part-time job as a bartender and then after that, a part-time job as a bouncer (after our full-time jobs!). You can imagine then that that means I do enjoy alcohol.\n\nFast forward to now. My fiancé is ***severely*** allergic to alcohol. Like, he gets a whiff of it and he goes into shock. This happened the minute he turned thirty years old. You can imagine that it changed our lifestyle a tiny bit. But was it even a thought, really? Did I anguish over the fact that he can’t drink anymore? No, now I ask waiters if there is alcohol in anything they are cooking back there. I buy alcohol-free vanilla extract for when I bake. I literally only care about it to the extent that I would like him not to die. (He’s also allergic to garlic and onions, so the alcohol thing is the least hard thing to monitor!)\n\nIf I want to drink, I can drink with friends or family. He doesn’t judge that I can still drink. We are both happy, healthy, and we love each other. In the scheme of things, our relationship hardly changed. I’m just a little more careful when I go kiss him after a night out.\n\nThat’s what a person who loved you would do. Not break up with you for something that, in reality, isn’t a huge factor in a relationship.\n\nYou’ve got this!",
            "Congrats and welcome to the Bay :)",
            "Congrats on everything! The Bay is fantastic and a heck of a lot of fun. I drive in whenever I can and there's always something different going on.",
            "\"Possession is nine-tenths of the law.\" If you don't have text messages where he admits the stuff is yours you may not get it back. If he contends it isn't at any point the police probably won't help as it will be a civil matter at that point.",
            "Honestly. This guy needs to grow up and get his priorities right.while you were chasing your career he was chasing the party. Dust yourself off and get back up. I'm happy to hear about your new beginning  he will regret this.",
            "You’re going to look back on this in a few years, hell, maybe even a few months after you moved and be SO HAPPY this all happened. Good luck on the move!",
            "As a Bay Area resident and a fellow person with alcohol intolerance, let me say that some people will still find it weird, but I never found it to be a deal breaker with anyone (now happily married to a man who is passionate about craft and home brewed beer). If I get the hint that people feel awkward that I'm not drinking, I'll order a soft drink in a tumbler. More than once, I've ordered a Shirley Temple at a work event and caused a flood of non-alcoholic orders because my coworkers \"haven't had one in ages and it looks so cute!\" \n\nDepending on where you end up, you'll probably find that coffee/cafe culture is bigger here than drinking culture. But that's just my experience.",
            "Plenty of fish in the bay area\n\nThere are meds u can take for asian glow",
            "Welcome to the Bay Area, where you will make more money than you can imagine, and pay more for a cup of coffee than anyone should ever have to!  It'll be great.",
            "Congratulations on all the good things in your life now. \n\nAs to your stuff. Honestly, I wouldn't bother fighting for it. But of course that is me. To me it keeps that wound and chapter open longer. \n\nI had to move in a rush with no money and no way to bring most of my things. Years and years of collecting kitchen equipment and things, game systems, even keepsakes. Promises he would get them to me. 90% of my things left behind and never recovered. I just added it to my fresh start idea. Some things I miss more than others. Mostly the kitchen stuff I cannot replace still. But mostly I was happier to be done with the person that kept it all.",
            "Unless it's something sentimental, let him keep it. Be done with him.",
            "My own brother once told me to my face \"I don't trust you because you don't drink.\"",
            "Congrats on your promotion, both in your personal and professional life! Your new job, including the area it’s in, sounds great with a ton of potential.\n\nI’m the type that when I go thru a breakup, I just abandon everything and consider it the cost of the relationship. I couldn’t tell from your post if it’s $500 worth of stuff or just the one item was. You could consider just leaving it behind and buy new stuff as you can to represent your new life with your new high paying job and the money you saved not being tied to someone who takes and takes, and makes less so you would have spent that on him, anyway. Plus, save yourself the trip, drama and heartache. Just an idea. I’m super not materialistic, though. And think money can always be made back and new things can be bought.\n\nNow if you’re talking about $5,000 worth of stuff, or something that can’t be made back in a relatively short time and puts you in a huge bind, then ignore me!\n\nCongrats again!",
            "Congrats on the job. I quit drinking and my partner has been nothing but loving and supportive. Find someone like that!",
            "Congrats, and welcome to the Bay Area!",
            "It's never easy, but I think you won.",
            "I'm happy for you and jealous of you. Congrats! Hope you get your stuff back but if it's not sentimental maybe cut your losses and move on.",
            "It's great you broke up,you guys sounded like complete opposites...you still knew how to have a fun night out without getting shit faced and still had your eye out on your career..while he is in his mid 20s and still stuck in the party boy phase. You'll be better off to be honest.",
            "Welcome to the Bay Area. My daughter (not Asian) has the same liver condition, can drink a little but not a lot and has felt the pressure to drink with regrets afterwards. Stay strong. You still can enjoy all the nightlife you want and stay true to water or one nursed drink (water, ice in a short glass with a twist of lemon or olive looks like vodka on the rocks). There will be lots to do in the Bay Area. And I bet your income is nothing to sneeze at either! Good move on your part (leaving Mr. Everybody-Loves-Me-Especially-Me)",
            "As a non-drinker myself (by choice, not because I can’t), I’ve been told many times that people don’t like to drink around me because they “feel weird”. I just tell them that my choice to be sober shouldn’t affect how they feel and I don’t need alcohol to have fun. That said, you can always ask for non-alcoholic versions of drinks - my favorite is a Caesar and no one aside from the bar tender and myself knows it’s virgin. \n\nEither way, good on you for landing the new job and learning valuable lessons about dead beats.",
            "You're going to be loving life too much to care about this POS. Anyone who repeatedly pressures you to do stuff you don't want to and knows its bad for you is no friend of yours, let alone an acceptable life partner. Your ex was doing you a favor cutting his dead weight loose from you. Such behavior shows a pretty blatant lack of respect for you as a person and just general human empathy. If he or anybody can't wrap their brain around the idea that drinking alcohol is just a completely miserable experience for people like us, they can get lost.\n\nA lot of my friend-circle liked binge drinking at your guy's age still. But the ones who were true friends knew not to pressure me too much into drinking because I have the same problems with it as you. I have some friends who drink through the Asian Glow, but it's just not worth it for me. Pretty much all of them managed to grow up over the course of the next 5 or so years though. Growing older, furthering your carrier, getting married, and having kids means you don't get to black out every night without consequence. As you get older, the same will happen with your peer group too and social functions will get even better because nobody gets drunk anymore and you can play games or have intelligent conversations instead of cleaning up after people and keeping them from getting puke in their hair.\n\nYou're going to love the Bay Area! I'm actually pretty jealous of you, I loved my time there. The climate is amazing, there's a bajillion things to do, the region is full of amazing people who will all be way more worth your time than your loser-ex, and there's going to be a lot more opportunities for advancing your career there. You're going to have a blast! Best of luck!!!",
            "Nothing like a shitty relationship to drag you down. But look at you,.this is a blessing in disguise, if you had followed through on moving to his town. Now you got a promotion based on your unique skillset, that is huge,.it should be a huge ego boost, challenge etc \n\nTaking a year off is a great idea, focus on the new job, focus on some personal development because you sound like an amazing person who needs to work on your self esteem, you need to see the amazing person you are.\n\nI am sure others said this but you maybe unusual with your sensitivity to alcohol but it's clear that alcohol is central to his lifestyle. Sure drinking is fun but it shouldn't define you or exclude you. I enjoy drinking but I was in a relationship for 5 years with someone who pretty much didnt drink, we would have 1- 2 drinks a week.  There are many, many guys who would appreciate you for who you are and whose life doesnt revolve around drinking and partying.",
            "Hey OP. \n\nI didn’t drink for 6 years when I was 19-25 - throughout university I was sober. When my friends and I went out to the bar, they ordered me shots of water to participate, ordered me teas and coffees if we were in bars where they were available and ordered me delicious mocktails without asking for them. \n\nTrue friends and boyfriends will not let something as simple as being sober get in the way of a good night out - in fact, really good friends won’t even let it stop you being part of the tequila slammers - you will be included and involved. \n\nYou had a lucky escape. Good luck in San Francisco - I’m super jealous!!",
            "That's life ladies and gents. A few months ago you had \"a rug pulled out from under you\" and now you're moving up and onwards.",
            "Honestly...don't even worry about relationships. Worry about your top priorities, meet friends, and if you begin to really connect with someone, let it happen naturally. Really get to know them. Sometimes the best relationships form if you just let things take their course rather than go and seek one out.\n\nCongratulations on your huge promotion and big move! Good luck with everything",
            "Sorry to hear about your shitty ex; cheers to your future! I’ve been a non-drinker by choice my whole life, and it’s very strange how pushy some people can be about drinking. Welcome to the bay!",
            "I'm the same way, I'm not sure if it's a mild allergy or the inability to digest thing but I can't drink without instantly feeling headachey and exhausted. /:\n\nBut there are SO many cool things to do in the bay area that don't involve drinking, or even if they serve alcohol it's just an addition to an already fun activity (look up the Exploratorium and the California Academy of Science, they're very fun on both regular all-ages days and their special 21+ cash bar nights.) I also haven't noticed anyone being weird about one person not drinking, maybe my friends are abnormally chill but hopefully you have the same experience!",
            "You're living your best life, and it's all for the better without him.  Amazing news and you'll succeed in becoming director based on some qualities you have as a person based on your thought out posts.\n\nIn terms of your stuff, it's just... Stuff.  I would personally say my peace with anything you haven't gotten back... Almost like you lost it all in a fire.  Cut all contact and don't let him use your stuff as an excuse to keep you in his life.  He doesn't deserve anymore of your energy.",
            "I posted on your original post about Dallas and surrounding communities but you took this off the charts! Do you realize how awesome you are to make this opportunity for yourself? AND to leave the party boy behind? You’re going places and didn’t need someone like that holding you back. You’re fantastic and are going to keep going up! So proud of you!",
            "Heyoooooo, welcome to the Bay Area. I'd invite you over to my place, but mostly my friends and I just drink. \n\nI kid, I kid. You'll love it here. People from every type of background to meet and enjoy all the great things the Bay has to offer.\n\nAnything else from your story is irrelevant, you're in the best place to live on earth, and have a good job, and that's all that matters.",
            "Welcome to the Bay Area, and yes other people understand Asian glow!",
            "> I really don't want to have to come down there with a police escort to take back my property, but it's looking like I might have to.\n\nI suspect telling him this might help",
            "I'm so happy to see this update. You sound very ambitious, intelligent, mature, and self aware, and I have no doubt you're going to have a fulfilling and exciting life. Congratulations!",
            "Get it girl!! Kick ass in that new job, and I hope you enjoy your time in the Bay Area. Sometimes, that fresh start is exactly what you need.",
            "Congrats on your new promotion and your new life!\n\nAs far as getting your stuff back...  Figure out the total value of it or the cost of replacing it all.  Then decide on what price you'd pay for serenity.  It might be worth it to just let it go and get all new stuff unless there is sentimental value attached to any of it.  If that's the case, have a lawyer send a letter.\n\nAnd finally, I don't drink if I have to drive.  Which is pretty much all the time.  The people I hang with are all drinkers.  My not drinking doesn't bother any of them one bit.  I go along for the ride, drink a soda or juice and have just as much fun as anyone else.  In your new position, the people you'll be meeting and/or socializing with will be more mature and will not even raise an eyebrow if you decline alcohol.",
            "Congrats on the new job",
            "Congrats OP!! I know I’m a random stranger but I’m so happy for you! If there’s anything that warms my heart is hearing stories of people who drop their toxic significant other and go on to do great things.\n\nYou sound very intelligent and sweet, I’m sorry your boyfriend was too immature to realize what a great catch you are. I wish you all the best, and hopefully you get your stuff back soon :)",
            "I read your original post, and I think things went exactly the way they should have gone.  I drink, my husband doesn’t—he never has and doesn’t even get an obligatory drink to make it seem like he does.  It’s never been a problem with our friends, and honestly, people being weird about it has helped us weed out folks who party a little too hard anyway.  You will absolutely find people who are cool having a beer while you have a lemonade.",
            "Congrats on the new job! I was born and raised in the east bay, and one of the best things about the bay is that there are all different kinds of people, you will have no trouble making friends! I'm actually kind of jealous because i miss the bay but I'd never move back because of the cost; everything else it has to offer is amazing! I wish you the best!",
            "Having a GF that can't drink is kinda lit no fighting for designated driver.",
            "Take cops down for your stuff. All of your stuff.",
            "Just read your original post and this one. Sorry to hear. There are plenty of good guys out there that don’t drink. Never be ashamed of that, I personally find it awesome when a girl doesn’t need alcohol to be social.",
            "I wish you the best of luck OP. Onward and upward to better things.  Despite feeling shitty about the break up,  it sounds like things are falling into place how they should.  You are going on to bigger and better things. \n\nFocus on yourself in the meantime, and your new surroundings. Eventually all of this will all be a memory. \n\nYou have so much you look forward to going forward :)",
            "Am I a bad person because I would look forward to a police escort to get my stuff...if it humiliated or cowed him? Breaking up with you then holding onto your stuff is low; he needs to be taken down a peg. \n \nThat said, if you look at it dispassionately, the two of you broke up because of a difference in lifestyle.  Your lifestyle is good for you, and is only improving. Good things are ahead for you.",
            "It sounds like your life has taken a turn for the better, which is awesome. But I truly hope that you don’t believe you’re somehow defective because you can’t drink. His reason for breaking up with you was ridiculous and childish. \n\nI am also unable to drink (anymore) due to a medication that I am absolutely dependent on. I can have, at most, one very low alcohol drink and then have to stop. My partner and his friends are very into craft beer and love going out and trying new varieties, and on top of that my partner is a brewer by trade, so beer something he’s very passionate about. Rather than being a sticking point in our relationship, he’s actually found something of a challenge in making low alcohol beers that I can actually enjoy.\n\nYou deserve a partner that’s able to adapt to challenges in your relationship, and someone who, more importantly, wants too. If something as trivial as not being able to drink was an insurmountable issue for him, then you’re truly better off without him.",
            "You're in the SF Bay Area and he's in Dallas. You win in every way!",
            "I didn't know the glow was uncomfortable, sorry about that.  I can assure you from Houston that we don't need to drink to have fun and make friends...but I'm glad you're going somewhere better and away from that asshole.  Congrats.",
            "Bollocls to him, congrats on your amazing new beginning!",
            "I just want to add that I'm married to someone who doesn't enjoy drinking and it hasn't been a problem in our relationship at all. It also doesn't effect our social life, we still go to bars and parties, he just doesn't partake. No one has been weird about it, and he doesn't even have the Asian glow excuse, so there you go.",
            "Fellow suffer here, you go girl!!!  I am Lucky I don’t care for the taste of alcohol that much. Except the drink called Lava Flow that  you can get in most bars on the Island of Hawaii.",
            "No invalidation of your experience. Breakups suck, and I think it's important to feel that. \n\nAlso, however, I think you'll find that the Bay Area (my home) is, at present time, a very good place to be a single woman, just on female-to-male ratio alone. \n\nHopefully we're doing a semi-decent job of making it the sanctuary (for women/men/LGBT/anarchists/undefined/whoever-as-long-as-you-don't-fuck-with-everyone-else's-rights) it once was, too.",
            "This is the most amazing update!!! I love your plan. Super proud of you for pursuing a good lead and making cool things happen for yourself!",
            "I have the exact condition you're talking about so I feel like I have some experience here. I describe it as never hitting the fun part of drinking and instead going straight to the pain part of being hungover. Not a perfect explanation but it usually gets the point across to drinkers.\n\nI don't know if it helps or not (your attitude is already fantastic!) but you can boil your situation with him down to his priorities. The party lifestyle was more important to him than your relationship, and neither of you deserve that. Additionally, you're just not into partying and he is, so you have a disconnect in lifestyles. That's a big hurdle for a relationship. \n\nThat's not even to mention how crappy he's acted. I'd say he's got a lot of growing up to do. It sounds like he was (and is) unconcerned with your feelings, which you also don't deserve. Now he's prioritizing his partying over sending you your property too and that's just shitty. You made the right choice in not trying to save that relationship. \n\nDepending on the importance of the things he won't send, you can always consult a lawyer and/or sue him in small claims if it gets to that. \n\nIt's so good to hear that you're doing so well! You should definitely feel good about nailing that job. Not enough people give themselves credit when they're awesome.\n\nEdit: Oh, and I'm engaged to a drinker so it can be done. You just have to be a good enough match that you enjoy your freetime together regardless of intoxication level.",
            "You say that he is not a bad person, he just in a way took advantage of you. I think you're very very right about needing to learn to put up and stick to boundaries. I found out that if you let them, people will use your good nature and generosity without giving much back, and it's easy to feel manipulated and resentful. But a lot of those people will back off immediately and start being respectful as soon as you start demanding it. I always found that sad, but am getting over it. It doesn't mean everyone is bad or entitled, it just means people are sometimes weak.",
            "The Bay Area is an AMAZING place to be for activities of all kinds. In a single weekend you can go to a soundscape, a Russian bathhouse, an epic natural trail, a political roleplay interactive, a beach town bike tour... You are going to have a blast.\n\nI also have a medical condition where drinking sucks. But regardless, I don’t even like it. I can’t stand the culture around drinking — the way people change their behavior towards others and the way many events expect that you’re going to drink... but I love to dance and party. I love making friends who don’t drink AND like to go out. I’m sure you’ll find great people to hang with. Congratulations on this awesome new chapter!",
            "I HAVE THE SAME DISORDER! It honestly has been a blessing, I still love going to bars and hanging out and I agree some people get weird when you dont drink around them. It's for the best that you broke up, if he isn't supportive of the fact that you have a medical condition, you dont want him in your life. Good luck with your new journey!",
            "I hope you get/got your things back, like your consoles. I definitely feel like a Uhaul trailer on a weekend and your furniture would be icing. I split from my ex that I half lived with, (had my own place but a bunch at his) and turned out he tried to GIVE IT TO HIS HEW GF!! I made him give it back to me and in front of her at that, because it was stuff like My raincoat and makeup/toiletries! Get your stuff back. He doesn’t get to live more luxuriously because you broke it off, it’s not alimony!",
            "Congrats on the life changes! Alcohol use is one of those things where one really shouldn't be pressured from anyone, let alone a partner.\n\n> I really don't want to have to come down there with a police escort to take back my property, but it's looking like I might have to. I don't know why he has to make this so difficult, but I'm getting pissed.\n\n> So if anyone has any advice to share on that...\n\nI'm in this situation myself with my ex and about $3k of stuff. I know it'll come back eventually, but it's been 6 months. Not sure pressing it will help, but also the time taken and the value eat away at the back of my mind. Also we're in different countries, so just going to get it isn't an option even though me turning up at her door wouldn't be an issue...",
            "You dodged a bullet and not just in the relationship department. While Dallas has a lot of jobs and low cost of living, it sucks major donkey balls. You want a beach? That'll be a 5 hour drive down a highway under perpetual construction only to arrive at the shittiest beaches on the planet. You want nature? Oh I'm sorry, it's August. Triple digit heat for you. You want clubs? Nah, sorry. You want to get shot, yeah okay. \n\nGlad you picked the Bay area. Much nicer.",
            "Fuck yeah! Build your career & get paid!\n\nI knew a woman who broke up with a guy because he valued booze more than he valued her. I have a word for this woman... wife. By all accounts, he regrets losing her, and neither of us gives a single solitary fuck. Nor should you. \n\nBuild a good life, keep kicking ass, and I promise you that you can find an interesting, intelligent dude in the Bay Area. As you note, the numbers are very much on your side!\n\nHave fun, grow, and date when it feels right. I wish you a life of growth and interesting challenges and happiness.",
            "I've always found that humor is a great way to displace anxiety over things I cant help about my body. It's like when you have to poop in public, but dont want anyone to know even though your insides feel like they are passing sea urchins; so you go to the bathroom, take your time, then come back and are straight up about passing the devil himself. Nobody will judge you cause you've taken control of how they are going to view this fact about you. Trust me, humor is the way to go.",
            "Still come by and visit Texas. It’s just another reason not to go to Dallas is all.",
            "Maintaining relationships based on materialistic factors is artificial and potentially toxic. I'm glad you're over him and his juvenile materialistic needs.\n\nKeeping company of those who sympathize with you and your standing in some respect is often the healthiest of habits.",
            "I dont get it? A guy broke up with you for whatever reason, just move on...You don't need to devote any time working on yourself it sounds like you're already doing great!  But most of all do not allow him to slowly dole out your personal belongings, he's just trying to keep you under his thumb to see whether he may or may not want you back.  Considerate it  the price of this relationship and forget about that stuff. Perhaps Ask for it all one last time in a clear and concise manner make it easy for him to get it to you or for you to pick it up all of it at once, if he does not return it and makes a convoluted situation out of it forget about it! Then please merrily skip along your way, you're doing great!  Date if you want or not, whatever YOU want to do is best.",
            "You avoided living in Dallas, TX, so you really dodged a bullet.\n\nNo one likes Dallas, but Dallas.",
            "Hey hey welcome to the Bay! You sound like a great addition! And yeah, there’s lots of other people who get the Asian glow around here, so you’ll have company, haha!\n\nBe sure to check out the local subreddits, especially the ones for whichever city you relocate too. It’s good you’re coming with a friend because the bay can be hard for someone by themselves.\n\nPro-tip, you don’t need a car if you’re in San Francisco, but you may need one if you’re in the peninsula, and you’ll definitely need one if you’re in the East Bay. Also, rent is expensive every where, but the east bay is the cheapest.\n\nBudget twice as much time as you think you’ll need to drive somewhere because traffic gets really bad, sometimes out of nowhere.\n\nAnd summer season starts in late July and goes all the way through September, sometimes October. June is foggy and wet.\n\nOn the upside, it rarely drops below 60, or goes above 90, unless you go further inland. The Bay itself keeps the temperature pretty consistent.\n\nHope you love it here! Congrats on the job!",
            "find your local straight edge community",
            "Let me know if you need someone in Dallas to pick up your stuff, I am close, maybe 10-15;?\nMinutes outside by Frisco.",
            "Hey, OP! I’m glad things worked out for the better. I also live in the Bay Area, and I rarely drink as it seems to make me super sick. I have some great friends I’ve made here. If you ever want to hang out and NOT get a drink, let me know!",
            "I’m biased since I’ve lived in the Bay my whole life, but Bay Area >>> Texas. So many things to do here while not drinking. Tons of hiking options, beach, museums, there’s so much to do. Welcome to the best place on earth!!",
            "Welcome to the Bay Area OP! I love it here. You're going to do well without him. And with the new scene to explore, you'll be able to enrich your life in massive ways!",
            "Congrats on the new job! And what a wonderful update. I also really appreciated the way that you didn’t trash your ex, it shows your maturity. \n\nAll the best to you!",
            "I think your Now-Ex is really childish for ending a relationship because you don't drink. My Ex and I also had different drinking habits, but our relationship didn't end over this simple difference.\n\nI mean, it's **him** destroying **his** liver. Choosing not to drink is a good and healthy lifestyle, and I'm proud of you for not giving in!",
            "Shame we couldn't swap livers, as I don't drink by choice - I just don't like the taste. Add to that it's expensive, bad for you, etc. I don't consider myself to be missing out, and I don't think you are either. I'm upfront about it, and if someone has a problem with it, I consider it to be their problem. This was absolutely his issue, a very immature one at that. Sounds like you're much better off!",
            "Been following this, and can deifnitely it's not you. Some people just won't compromise. You'll find someone someday who is perfectly mature enough to not care! \n\nAlso, I know this might get lost in the sea of comments, but I'm a biotech person (F) in the Bay Area! Msg me if you want go connect sometime!",
            "I'm sure it's very painful but know that it's for the best.. if anyone breaks up with you over something as trivial as this, they were never good enough to date in the first place, despite whatever other qualities they may possess.",
            "Congratulations on the move to the Bay area. If you have an interest DM and I'll shoot you some of the best restaurants in the South Bay to visit.",
            "This was the weirdest thing I've ever read, not gonna lie. I've had plenty of friends who don't drink go to the pub or club with me and my friends. Ive half dated a girl who didn't drink but I was going through a cocktail making phase so she didn't really appriciate it. But still, otherwise I've never bumped into a problem. Anyways, I hope you get your stuff back and I hope your time in the Bay Area is more fun!",
            "Let of the possessions I say. Just let it go.\n\nI feel he mighy be nusing them as a way of still having some sort of contact with you, if you get what I mean.\n\nUnless there is some important rare sentimental value attached, I'd just let it go.\n\nGood luck with everything and congratulations!",
            "Congrats! Success is the best revenge. In Taoism there is a saying that a painful ending is a beautiful beginning in disguise. All the best. Your story is inspiring. I'm somehow in that territory as well, and about to free fall. Wish me luck! And yes, get the police escort. You need to get your stuff back.",
            "I grew up in the Bay Area and then my family moved to Dallas/Fort Worth. Cost of living is better in Texas, but that's it. Bay Area is pretty much superior in every way, this worked out better than you probably know haha",
            "Most stupid reason to break up I've ever heard of. i'd guess you are better off without him.\nYou will certainly find someone who will appreciate you as you are and who doesn't care about little things like not being able to drink. (in my eyes it's a big plus to have a great reason to not take part in this quite stupid kind of socialicing).\nHave fun in your new position, enjoy this new chapter of your life and do whatever you think is best for you.",
            "So happy things are working out for you! And good luck with the new job",
            "If you just show up in Dallas, with a moving van and a friend, chances are good he will just let you have your stuff back. But have the proof that it's yours in your back pocket in case it does come down to the cop escort.\n\nTake everything that's yours. Don't be that doormat. He left you in a really shitty position, and while it worked out for the best(which is 100% what you deserve) it's not through his efforts. Take your things, girl. And if he's broken them, make him replace them. It's not a question of you make more so you should replace them- it's he didn't return them, and he wasn't careful with them.\n\nPeople who aren't cool with others not drinking around them have problems with alcohol. I remember this being said before and I'm telling you again: it's a sign of alcohol dependency & a red flag to steer clear. \n\nAll the things you listed about your ex don't make him any less scum. He is not a good person, and I'm guessing his Dallas friends are excitingly assholes. He's acting like pretending he's 20 and not being responsible is the best! Life! Choice! Ever!\n\nEnjoy the Bay Area! Do your work in therapy! Date yourself first! 💕",
            "Congratulations on your promotion! I'm also in the biotech field as a researcher. Are you in the science sector or a different one?I'm interested in moving to the Bay and was wondering if you'd feel comfortable connecting with me!",
            "I like happy endings :)",
            "Well done! I know it doesn’t feel like it, but it sounds like your doing really well, lots of people sink and you appear to be a strong floater! \n\nI had a problem getting my bank card back from an ex, I was too coward to cancel it, but if I could go back I’d just take a drive down and take it. It just drags everything out and you’ve to keep thinking about what you’re going to do/how you’re gonna get it.",
            "Glad it worked out so well for you, congrats on the promotion!\n\nOn the drinking topic, I also do not drink alcohol (just don’t like the taste) and I managed to find many lovely friends in Ireland! \n\nEven in a drinking culture, you can find people who will like you for who you are and not how many drinks you down! Best of luck!",
            "Woman who moved to the Bay Area at around 32 years old here: can confirm, the Bay Area is great for dating men :-)",
            "I went through a really devestating break up at 25 just as I quit my job, moved to a new city, and went back to university. I absolutely threw myself into school work and self care. I promised myself absolutely no dating until i got my emotional shit together and started seeing a therapist bi-weekly and doing a lot of reading. It took a lot of work to really feel my self-worth and value as both a person and a partner but it came around. A year later I was much healthier (emotionally anyway, I still ate garbage), happier, and my sister introduced me to a lovely woman who has since become my wife and our daughter turns one tomorrow. \n\nYou've done the self-loathing bit now use it as a fresh start to dust yourself off and evaluate your emotional health. Use this opportunity to dive into your work and have a kick-ass career, and even more stellar personal life. You're worth it.",
            "I know I don't know you, but just reading this awesome story has honestly made my day!",
            "Yay! It's a blessing. I've never seen drinking  lead to a good place. It dulls the senses. I am glad you didnt choose to follow someone who thought that was a good idea. That probably wouldnt have lead to a good place. Also, well done recognising that he takes more than he gives. Your future sounds really bright. \n  \nHave you got your important stuff back? Can you let go of your other stuff that he has? If so i'd do that. Let things go and move on with your life, in better and better directions. :)",
            "I’m not a heavy drinker now but used to indulge a fair bit. I dated girls who didn’t drink at all during that phase of my life, and it was never an issue. Not sure why your ex would be so hung up on something like this, but it sounds like it worked out for you in the end anyway.",
            "So ?! \nLet him beeeee\n\nHis probably not the one for your health.",
            "Fantastic happy ending! And were you able to find an affordable home? Heard SF has housing issues 😕",
            "Sorry it didn't work out OP. Good on you for getting the promotion and doing well in spite of the break up.\n\nOn a side note, have you tried sunset alcohol flush support? I used to use antihistamines for my Asian glow but I've found these pills work really well, as they supplement your body with the things you need to create alcohol dehydrogenaze.",
            "damn, i feel bad for people that get the asian glow.. I'm chinese and i don't get it, but that's probably coz im an alcoholic",
            "You are 26 and going to be a director. Girl, get it! Find someone that knows your worth. I don't drink much out of choice, I've never had an issue with partners etc. Good luck.",
            "I'm 29 almost 30, and when I was 21-24 I dated who I thought was the love of my life. He knew I'm an epileptic and therefore cannot drive and I technically can drink but on my medicine I REALLY need to watch it. We broke up and got back together where my medicine changed, and the side affects were awful. The told me \"drunk sex is more fun\" and then got mad at me when we went out somewhere that I got blackout drunk from their house wine and I got so sick we obviously weren't having sex. \nAt first, it feels awful to lose someone you love, but after you take those rose colored glasses off,you realize how wrong that person was in general, and for you. \n\nCongrats on that job, OP. I wish you well!",
            "I'm so happy for you, I am sure you will love this new opportunity, you deserve it! Also, my SO is Asian and can't drink, same as you. We never had a problem with it, probably because I'm not that interested in drinking without him. So, really, it's not about the culture of the place that you are living in, but the other person willingness. Best of luck with your move!",
            "That's amazing, congrats on the news! Best of luck on your new path.",
            "So glad to hear it worked out for you. And I understand that he might be a redeemable guy in some lights. \n\nBut alcohol is literal poison to everyone eventually, not just people like you. And even if people seemingly have non-problematic relationships with it, choosing it over an ENTIRE romantic relationship is a BAD SIGN. Especially since he  knew from day one and NEVER talked to you about this concern. \n\nAlso, while I think it's great for you to take some time off and wprk on yourself...it's important top remember that you didn't do anything wrong and that self development doesn't happen with the calendar - for example, you probably matured more in the week surrounding your break up than in the entirely of the relationship. So I guess...don't be surprised if at some point before a year is up you feel ready or different. And that might be the perfect time to move on even if it doesn't fit your schedule that you make right now. More than an anount of time, I encorage you to set actual goals for what this self-development looks and feels like to you. And maybe a big part of that IS time spent alone - but just setting a calendar date can lead to some issues. \n\nJust to give an example, I once moved to a city that I didn't like. I wanted to give it a good try, so I said I needed to be there at least 6 months. As soon as it struck midnight and I realized 6 months was up, I decided I wanted to go home. Great! But the reality is that I knew long before that that I wanted to leave and there was nothing magical about that date other than it set up a subconscious reality of \"just wait it out/you just have to make it til X\" and that's no way to live what should otherwise be a fun part of life. \n\nI think it's really smart to take your time and space and find out what you really want. And if the calendar works as a motivator for you that's great! Just make sure you are actually trying to grow, not just putting yourself in time out.",
            "He's shallow, move on.  Problem solved.  There's no philosophy behind picking up your bag and walking away from someone who has no more respect for you than that.  Swallow the nail and move on.  The biggest problem i see in people regarding relationships is the need to \"define\" or find \"closure\" to a situation that probably never should have happened in the first place.  Wear your integrity with pride and move on like he never even should have been there.",
            "Good for you girl. I hope you get your stuff back soon. I'd be pissed if my game consoles were being held by my ex! lol",
            "Holy shit, you’ve utterly eviscerated him haha. You’re not supposed to “win a breakup” but this is like poetic justice harlem globetrotters level domination",
            "It sounds like you have a really exciting opportunity! Congratulations! There is a lot of cultural pressure around drinking in the US, and it can feel weird and isolating to not drink - especially if \"friends\" or a SO is pressuring you.  Good friends care about spending time with you - not dictating what you consume. I drink but I have a lot of friends who do not. We've identified a lot of breweries that also make Kombucha, so we all have something tasty to look forward to when we go out together.",
            "you sound like a really mature Woman with her head on straight, a great job, kind and giving personality, and with a really good life. HE is the one thats missing out in this breakup and dont forget that fact!!!! Fine, if he wants to waste his life partying and getting with complete strangers. Meanwhile you got a damn promotion, your killin it girl. Btw lol, your the kinda Woman i would die to be in a relationship with! So remember, you have your life TOGETHER, and thats one of the most attractive characterisitcs for grownups, not babys. And that on him not being cool with you NOT drinking, which seems pretty basic",
            "Sending love! You're better off without him\n Now take the time to let your heart heal and do the things that make YOU happy. Xx",
            "\"it's the Bay Area. God knows there will be plenty of guys around who also get Asian glow\"\n\nI laughed.",
            "Welcome to the Bay! It’s a good fuckin place and we like to have fun. We won’t force you to drink anything you don’t want to. Everyone’s got 500 dietary restrictions anyway, so we’re never shocked if people don’t want to eat/drink things. \n\nMessage me if you’d like any tips getting a sense of what to go check out once you move here! Am also a 26F in biotech here in the Bay, incidentally.",
            "Wanted to comment and say, you DO NOT have to drink to have fun nor will you NOT find any friends because you don't. That's such bullshit. If that were true kids wouldn't have any friends, and some of them have tons of friends. I do drink, but sometimes I don't drink at all at parties or maybe have one drink to sip on throughout the entire night. If people don't like it, guess what, that says way more about their insecurities and lack of social skills than it does about me. I don't need alcohol to have fun, and you shouldn't feel bad about your condition. It sounds like you're in a much better place, and I get that breakups are hard, but it's much better to have found out y'all's wants did not align now than to have moved there and found out. Live your best life and I hope you get your belongings back!",
            "Glad things worked out for ya! But Dallas is better though just sayin haha",
            "I had a very very difficult ex. He was cheating on me. When I found out (for the second time) by snooping through his phone, something I'm not proud of, but had I not, I would have continued sitting on HIS kitchen floor crying my eyes out day after day after day - this is of course after getting up at 430, having a shower chucking some clothes on and heading to work - for all my work cared, I could turn up in my pj's and no one would have blinked an eye, but then because I started early (to avoid traffic) I would end early - he wouldn't get up until after I had made his coffee in a take home cup, said my goodbyes to him in the dark, and let him know what warm clothing (he had an outdoor job, even in winter, and winter where we were was utterly horrible) I had put out for him, and what I had set the heat pump too.\n\nI got home around 230 - 3pm.had a shower, did my hair, makeup, put nice clothes on - because this was expected of me. I once after if I could, would sit in the kitchen anywhere from half an hour to an hour crying about what my life had become, then cook his dinner, then wait.\n\nWait for what? I never knew. 5pm? 6? 8? 10? Never ever knew.\n\nAnyway, when I found a girl hidden in his phone under a guys name, for a second time... I sat and I waited.\n\nI approached him calmly, and he kicked me out of \"his\" house and would not allow me to get my things back and if I turned up the neighbours would be watching and would call the. Police if. I stepped. Foot in. The. House. I jsr a. Kej stl.\n\nSo at least, I escaped. In the long run, my now hubby, convincede to walk away without my things because trying to get them back because a game of cat and mouse had begun.\n\nI lost over twenty thousand dollars worth of my stuff\n\n\nIn the long run, was it worth it? Oh  hell yes it was.",
            "I also went through similar break up a few years back, and decidedly moved from FL to Bay Area. In my case, things there were important in & to my new life (framed pictures, some tools, etc.) were shipped via FedEx to in CA to start the new journey. Things that hold no sentimental value or that I could easily/cheaper to re-buy here (furniture, tv, etc.), asked if my ex wanted it or I donated - simply wrote off things that were not important to me. \n\nIf he has your stuff that’s of sentimental value to you or too expensive to re-buy, you could ask him to drop things off at UPS or FedEx store, and just have the store box up and charge you directly. It’s a little more expensive this way, but he can’t have excuse of no box or no tape, etc. \n\nGood luck with your new beginning! Bay Area is awesome; plenty of things to do and so easy to make new friends! All the best! \nOh, and Asian glow... ya, it happens and people totally gets it.",
            "Aaaaayyyy congratulations!!!! See man, everything works out I the end. And if you apply the lessons learned during this time, the next guy will be even better!",
            "What is the total value on the items? Is there anything irreplaceable? Is it such that you can just chalk it up to \"asshole tax\" and totally cut ties with him?  IKEA has some pretty cheap furniture and will get you through.  Sometimes it's better just to let the stuff go for the peace of mind that you can just cut him completely out of your life, block and delete.",
            "Good on you! Congratulations on the new job and I wish you nothing but the best for the future! You sound like an awesome person and I’m sure you’ll do just fine",
            "My heart Smiles For You internet stranger",
            "You sound like an extremely intelligent and sensible young lady. I too have been working on self-worth and boundaries (at 29) and its changed me for the better. I think you're going to be just fine. I'm happy for you. Be thankful that your ex did you that favour of letting you have the chance to upgrade. Because even if he was an alright dude it sounds like you can still do better. :)",
            "then he clearly doesn't care about you that much",
            "Wow it sounds like you REALLY made a good choice. And the Bay area is amazeballs, you'll love it. Congrats!!",
            "I wanted to add, I live in the Bay Area (almost a year now!) and it's a very cool place to live! My husband and I are in tech, and while it is expensive, there are so many cool things to do and places to explore. This will be an amazing new start to your new and interesting life. I think in a year from now, you'll look back, and see that this breakup was a good thing for you and catapulted you into some truly awesome things. \n\nAlso, I really wouldn't worry about the drinking thing. It seems like, socially and culturally out here, if you don't drink, it's fine. No one will pressure you to have a drink if you don't want one. At least that's been my experience so far. \n\nGood luck!",
            "Awesome OP Know your worth.",
            "I remember seeing this original post and the update warmed my heart! YGG!",
            "YAY! I am so happy that things turned out well for you. Sometimes the universe shoves you in the right direction and even though it's uncomfortable the end result is terrific!",
            ">My kitchen stuff and some pieces of furniture are forfeit. He has yet to return my gaming consoles. We really should have split it, but I knew he'd turn that into a back-and-forth that I didn't want to deal with. \n\nYou should hire someone to deal with this stuff for you. Maybe a lawyer, maybe just an assistant type or logistics expert.",
            "Your win.  If he's willing to ditch you because you don't drink, what's going to happen if shit hits the fan? And it always, always does in life.  More than once.  He's not the one to ride the life with. Good riddance.",
            "Oh girl he will come crawling back. They always do. Sounds like you're going to be in prime position to revel when he does and you'll be moved the fuck on!",
            "Make sure to see Zion National Park.",
            "Gurl, you dodged a bullet. Congrats on the new job. Cali has lots of hot guys too so have some fun😇",
            "From someone that's worked in addiction rehab: that particular \"best life\" is an elusive one with a fair bit of unexpected turns. He'll find out what he's got if he ever has reason to stop.\n\nIn either event, he wasnt the guy for you. And that's okay.",
            "My favorite update I’ve ever read on here! So happy for you! Keep on kicking ass, girl!",
            "So happy for you OP! You go girl, getting a huge promotion and on the way to becoming a director. I'm also Asian and don't like alcohol (don't know if it's because of genetics, cuz my dad likes his Jack Daniels) and have never been drunk as an adult - I'm now 40. My experience has been that people don't care that I don't drink and I hope you can find people like that too.",
            "Welcome to the bay area! Lots of cool people who don't drink and do amazing other stuff out here (especially compared to Texas)",
            "That's awesome! I'm a guy who doesn't drink that lives in Oakland. I've been in the bay area for 8 years and I love it! I quit drinking a few years ago and felt isolated at first but I've found there's plenty of fun you can have in your 20's without going on drinking benders and it's definitely nice to not be hungover every weekend! Best of luck!",
            "Man, that dude did you a favor. \nCongrats and look forward to a whole lot better and brighter things, your Asian glow should be the least of your worries.  \nWhen you're ready, you'll come to find someone mature enough to handle that part of you.  \nUntil then, enjoy your life work hard and play hard (in your own way), meet people , make friends, work on yourself and be the best person you can be!",
            "As a Bay Area gal I just wanna say welcome!!",
            "Take it from a professional: You had a man-boy on your hands. He didn't break up with you because you didn't drink, he broke up with you because he wanted to break up with you, and said it was because you didn't drink. It was probably what he felt you were holding him back from.",
            "I'm glad this was a happy update!\n\nFTR, I live in Dallas and can't drink for the same reason as you. I have plenty of friends who do and it's NEVER awkward hanging out with them AND I've never been DD by default because of it either. Your ex is an ass and if you want me to bang on his door and remind him to give you back your stuff, holla at yo girl!",
            "Congrats on the promotion(s)! I get the asian glow too and also live in an area that has a heavy social drinking culture so always felt compelled to just tough it out and drink through the discomfort. Then as i got into my late twenties i wasnt able to deal with the side effects (ie. itching, flushing, headaches) as well any more and decided to cut back and eventually just stop altogether. What do you know, the friends that just wanted to go out and grab drinks and party kind of fell away, and the ones that actually wanted to hang, stuck around. Im much happier now and i like that i dont have to buy a beer just to avoid having someone constantly question why im not drinking.",
            "Cheers and congrats! If you're ever at a bar for work or otherwise in a situation where you feel like you need to drink or feign drinking, try soda and bitters. It's refreshing, extremely light in actual alcohol and delicious. (Literally just soda water with a few dashes of bitters on top, my new go to after I started drinking less too)",
            "So happy for you OP! Honestly, at your age the drinking starts to slow down anyway... I just turned 27 and I still love to go to bars and drink, but I don't go out for the SAKE of getting drunk. I don't do shots because it's not pleasant and like... in your late 20s it feels a little childish to be taking rounds of shots only to feel hungover on your days off when you work a long week. Going out is great, but you should go out for friends or experiences instead of to just get totally blasted. It's a shame your ex things getting drunk is the only way to have fun or bond/make friends? Just wait a few months and this lifestyle will get old and I'm sure he'll be reaching out to you sooner or later.\n\nCongratulations on your new job as well! You will find plenty of like-minded and focused people in our career that you will have a lot in common with. Normal people don't need to be drunk to make friends lol.",
            "> He has yet to return my gaming consoles.\n\nThis to me is the truly fucked up part",
            "Congrats on your new position! You obviously deserved it! I don't know who you are, but I'm so excited for you.\n\nIt's ok that things didn't work out. It's great to realize what you both needed for yourselves and to not settle. \n\nHonestly though, that was a bit lame of him to have that be the reason to end the relationship. My friends and I drink a lot, but we still have a ton of fun with friends who don't drink. But whatever, it definitely ended up working out for you!\n\nOne last thing: WELCOME TO THE BAY AREA! We are happy to have you here :) I hope you end up loving it here like I do.",
            "Congratulations! I’m so so happy for you 🌟",
            "Enjoy your time in the Bay Area!!",
            "Raise your dating standards you're worth it. The guy who dumped you isn't your equal; he's an idiot. Let him go be an idiot without you. Good luck in your new job. P.S. Bill him for your stuff and take him to small claims court if he doesn't pay.",
            "I knew a guy that had the same condition that you do. Even kombucha was a straight ticket to the ICU. \n\nEveryone respected the hell out of that. Don't take anything less.",
            "Good on you, OP. Also, TIL there's a genetic condition that prevents asian women from drinking. I definitely have to date more asian women then! Thanks for that bit of info and hold your head high that you're of the few people who can take a shitty situation and benefit from it.",
            "Honestly, reading your original post, I wondered if the ex was 21 instead of 25. Benders every weekend and nothing else to do to have fun but drink? That's for college kids. Late 20's are to get your life in order and start to think about families or careers or what have you. You are well rid of someone trying to relive his glory days. (He's probably going to end up being that older loser who hangs around with the college kids drinking and they all think to themselves about how they wouldn't ever want to be that guy.)\n\nAnyway, congratulations on the job and the relocation! I'm glad you're going to be somewhere you can make your own. And you don't have to worry about running into the ex, either. As for dating - it's often the time you stop looking that something falls in your lap. But either way, I hope the best for you. Good luck!",
            "[deleted]"
        ]
    },
    {
        "post_id": "arj54z",
        "author": "ornotreally",
        "title": "UPDATE : my [24f] partner [24m] doesn’t do things unless I specifically ask him to. It’s driving me insane",
        "url": "https://www.reddit.com/r/relationships/comments/arj54z/update_my_24f_partner_24m_doesnt_do_things_unless/",
        "score": 6534,
        "num_comments": 109,
        "created_utc": 1550396477.0,
        "selftext": "[original post](https://www.reddit.com/r/relationships/comments/a2c42f/my_24f_partner_24m_doesnt_do_things_unless_i/?st=JS8PE29K&sh=f62389f8)\n\n\nHey everyone, I wrote this post just over 2 month ago, and i got a lot of advice and help and thought I should do an update.\n\nI took a lot of your advice. I spoke to him about it again, and said we need to come up for a solution because I couldn’t go on with such little help anymore. \n\nWe wrote a list as someone had suggested . (Sorry I don’t know how to link usernames) and I wrote what I do and he wrote what he did. My list was much bigger than his and he said he didn’t realise How ‘unequal’ the lists were and he thought we were doing pretty much the same. He thanked me for everything I did, and said he’d change.\n\nWe take it in turns with the nappy changes and the story times etc and it’s working very well.\n\nNow we have certain things we both need to get done. He will bath the kids on the nights he’s home so he gets to spend more one on one time. He’ll read stories and is being much more involved.\n\nI still do a lot which I’m fine with, (the things SAHP do) but I want to stay home with the kids and do the majority as I feel that’s what I’m happiest with doing. I’m just appreciative of the help he’s now giving me. I don’t feel alone anymore. \n\nI think with a new baby and a toddler and working full time, it was getting a bit on top of him but we communicate better and when he’s feeling overwhelmed, I’ll do more and vice versa.\n\nI do think I have to ask him some things still, but I feel like that only happens when we have had a bit of a busy/hard day. but we have more of an understanding of one another now. \n\nWe also read the articles commenters recommended and that is definitely in the back of our mind. \n\nI do feel I got into the habit of doing things myself and would bathe and read, etc without really giving him that time and now I’m encouraging him even more to do things one on one with the kids. As I was always there when he was spending time with them, I’m trying to make it where he actually gets alone time with them as well. As I think that was making him feel like a “secondary “ parent if that makes sense. He has a much better bond with the kids now, and we are all so much happier. As a family and us as a couple. \n\nI might have missed things so if you wanna know anything else ill answer.\nI know this isn’t the most amazing update and it’s just a case of communicating better but you’ve all helped so much and I’m very appreciative. I love reddit!\n\nThanks for all your comments/advice. \n\n\nTLDR : a case of communicating better and following your advice has helped us thanks so much \n",
        "permalink": "/r/relationships/comments/arj54z/update_my_24f_partner_24m_doesnt_do_things_unless/",
        "comments": [
            "I thought it was a pretty amazing update. Good for you.",
            "It makes me so happy to read this kind of update. Good for you for communicating things and great that your partner listened and makes the effort so you both will be happier. This is the way to build lasting relationships <3",
            "A very wholesome update. Also good job for clearing it up with your partner!! ",
            "I missed your first post but this sounds like a wonderful update! I'm so happy you've been able to make some positive changes and particularly that you both used this process to self-reflect as well. ",
            "This is wonderful. I see you’re still talking about “the help he’s now giving me.” Remember, this is not about him helping you. This is about both of you developing and maintaining an equitable partnership as parents and as a couple. Being the SAHP does not mean all things parenting are your domain for him to help with, which I think you recognize, but it will be useful to the both of you if you watch for little ways where you may still have remnants of this mindset. \n\nYou’re moving in the right direction and kudos to both of you for working on this. It’s especially great that you’re both working to improve his bond with the kids. ",
            "This is absolutely an amazing update!  It shows how communication has to be consciously and conscientiously worked at by both partners.  And when it is, everyone's happiness increases, and the hard work of raising a family becomes easier when an overall balance is achieved.  You two are flexible as needed.  And you are not falling into the trap of excusing the breadwinner from all care of the children.  And over time, the SAHP can take on some income producing work as well, if it is mutually agreed upon.  And if you are applying the same teamwork on creating and maintaining a budget that you both agree upon, then you are exceptional.\n\nUnfortunately, my partner and I were not great communicators, avoided resolving issues, and ended in divorce.  Looking back, I can understand why we failed, since we both came from dysfunctional families.  So I think you two are way ahead of the game of life, thanks to Reddit!  ",
            "I’m glad things are working out for you guys.  \n\nThis part stood out to me though:\n\n>\tI’m just appreciative of the help he is now giving me.\n\nIt might be useful to get out of this mindset. Yes, it is good he is stepping up, but it isn’t a favor to you, he is just finally doing his fair share.",
            "Another good thing to remember is that being in charge is also an item on the list. Partners often forget that because they don’t realise how much energy it takes to have pay attention to what needs to be done. ",
            "Great update! I hate to say I’m working on not being the husband from the original post. Not saying your husband is a bad person he’s not at all! I was just ignorant to all the work my wife did.\n\nMy wife has noticed improvement and I hope to keep doing better.",
            "How lovely that everything worked out so well. Cheers to you and your family, great job on communication.",
            "This is a great update! My husband and I also had growing pains with the kids, I’m also a SAHP but we’re somewhere around 14 years in, 10 married, our oldest is 8. I haven’t had resentment in years.\n\nThere’s an amount of work that a household requires and each partner should be doing a roughly equal amount of it. Bringing in money is a huge chunk of the work, but it’s not half — there’s still plenty of parenting and household maintenance (cleaning, cooking, etc) to do when he’s not at work. Looking at it this way has really helped to even out the workload.\n\nAnother thing that really helps both of us is that we each get time on the weekends (my husband works during the week) to ourselves. It’s not enough, but our youngest is still a toddler; it’ll get better later on.",
            "Communication can really make or break relationships. I'm so glad things took a turn for the better in your case. ",
            "This post just helped me curb my cynical views about people’s ability to change so thank you for that ",
            ">I’m just appreciative of the help he’s now giving me. I don’t feel alone anymore.\n\nThis is so sad to me. You're talking about the other parent of these children.",
            "I’m glad everything worked out so well for you two! Good communication solved every problem. ",
            "So happy he listened and was willing to improve. ",
            "A r/relationships update that doesn't end bad? Is this possible?",
            "Good to hear. Maybe set a weekly meet time to check in with house, family and relationship stuff. Funding the right time to talk in hard, but having a weekly meet totally brings it to thr kitchen table with ease.",
            "What a delightful update!  \n\nI can’t remember whether I commented on your original thread, but my husband and I did this exact thing. The best thing that came out of it wasn’t even the division of labor, it was the appreciation for everything the other does. ",
            "This is really great to read. Bravo to you two. ",
            "It's so good of you to update. I wish you well.",
            "This is so wonderful! Thanks for the hopium :)",
            "that’s great progress ! \n\nremember to keep checking in with each other, and never slip into ‘he’s helping me with the\nkids’. they’re his kids, too ; yours together.\n\n a working parent in partnership with a stay at home parent watches their kids, doesn’t babysit them for the ‘primary’ parent. ",
            "I'm happy for you guys, this was a great update, and I'm glad to hear about positive changes resulting from this sub. ",
            "I've been dealing with this exact same thing at home (but we don't have kids) we both work, he works longer hours and uses that as an excuse to do NOTHING at home. I mean I ask him to take out the trash and he practically throws a tantrum. Weeds in the yard and he refuses to pick up his dog shit. I'm home more so I don't mind cleaning more. I felt to petty, like I was just being some crazy women for thinking about breaking up with him over this. I've talked to him so many times and he just brushes it off like I need to get over it. Thanks for posting this update!",
            "Good for you glad he's stepping up and being an adult and parent, not a helper",
            "Thank you for the update, I'm so happy that you were able to resolve it!",
            "Love updates like these. Keep it going OP!",
            "Happy news! So great to hear this!",
            "Turning out to be a happy ending after all. ",
            "Another good book to read (apologies if it's already been recommended or you have read it already): How Not To Hate Your Husband After Kids by Janice Dunn",
            "Always SO lovely to hear a success story!",
            "Good job!\n\nIn my case, my (ex) wife handed me our youngest one day and said; \"Here. Bond.\"",
            "I love happy updates. Good work, OP! ",
            "I'm so happy this worked for you and I may use the same thing with a lazy person in my life. My day is just brightened because I read this and now have renewed hope that people can change. ",
            "This is a fantastic update!",
            "Very happy that you’re getting closer to a balance I was honestly so pleased ",
            "Amazing update!  It's nice to read good news on here!  We need more of that!!!  ",
            "I missed your first post, but this is fantastic! Great to see a couple working together to make positive changes to support the relationship. Very inspiring! ",
            "Hi, just out of curiosity, has your boyfriend been diagnosed, or shown any symptoms of ADD/ADHD? People with ADD can sometimes have a difficult time realizing what needs to be done in their environment. My wife often gets frustrated with me when she has to prompt me to do things. I can be sitting in my home with dozens of things that need to be done but have no ability to know where to start, what to start, or if I need to start now or do it later. Its not that I'm lazy, I just don't ever know what I should be doing ",
            "I'm really happy for the happy update! You are doing great!\n\n\nI am a big fan of weekly check ups, to check in with feelings, validations, thank yous, preparation for the future (there's going to be over time /three kids birthday party next week) and you are really a team, as you say!\n\n\nI also recommend buying a cake and celebrating with your husband. You are working through your problems as adults and that is fucking awesome. \n\n\nI think anyone who is/has been a parent of a baby/and/or toddler will testify to the how the struggle is real.\n\n\nIn fact I think every damn parent in here deserves a cake. ",
            "Maybe he is very tired when he comes home. Maybe his lift of things to do at work is 3 times as long.\nAnd that he just physically is not able to move, and his brain is fried. ",
            "This is a wonderful update!!\n\nMany times our spouses don’t realize what we do when they are gone simply because they aren’t there to see all we do! Plus, guys are oblivious to a LOT of things. (Sorry gentlemen, but you really are). I’m so glad things went in a positive direction and I hope it continues to move that way!\n\nBest of luck!",
            "Works 12 hour shifts. Girlfriend complains he doesn't do enough.. ",
            "[removed]",
            "[removed]",
            "Maybe your partner should communicate that it’s time for you to start helping out with the money earning chores. Do you appreciate what he does to earn for the family? It doesn’t sound much like it. ",
            "He will NEVER change. Either love him the way he is or move on now. Otherwise, your resentment will continuously grow, you will be unhappy,  and you will feel as though feel you have wasted years of your life.",
            "You have a man that takes orders and your complaining because he can't read your mind?\n\nLol\n\nYou can't have everything. Pick and choose your battles ;)\n\nBest of luck",
            "[removed]",
            "Let's makes sure the advice goes both ways. No woman should write a man a list, that's humiliating (unless you're into that) and a man shouldn't write his woman a list. \n\nWomen please don't ever approach a man with your agenda unless he approaches you with his. If you want something for the house or kids that's great. But chances that's your agenda, and then rightfully he should pursue his agenda (bass boat, trail runner, green fees, motercross, rifle, sporting tickets, etc). Unless he's asking you for time with his agenda, you better not overstep your welcome and ask him for time with yours. Make sure it's a two way street."
        ]
    }
]