[
    {
        "post_id": "4jv6j1",
        "author": "NotASideChick",
        "title": "21/F UPDATE. I confronted his fiancé.",
        "url": "https://www.reddit.com/r/relationships/comments/4jv6j1/21f_update_i_confronted_his_fiancé/",
        "score": 2815,
        "num_comments": 143,
        "created_utc": 1463549587.0,
        "selftext": "\n\nLink to original post. \nhttps://www.reddit.com/r/relationships/comments/4joe9s/21f_should_i_confront_this_players_fianc%C3%A9/\n\nFirst, I just wanted to say thank you to all that replied and sent me personal messages regarding this issue of mine. You all gave me the courage I needed to message her.\n\nAfter I made the original post I gave him one more opportunity to come clean to his fiancée. I confronted him and told him that the games had to stop. Either he told her or I did. He responded that I was bluffing, a bitch, and she wouldn't believe me.\n\nSo I sent her the screenshots of our conversations, and my phone number. I told her to call me if she had any questions regarding what I sent her.\n\nThe evidence was on my side, 90% of our recent conversation were filled with \"Are you sure you don't have a fiancée?\" and him denying it and calling her *crazy*, *obsessed*, and that she needed to *let go*. \n\nI took a huge risk giving her my number. But the news I gave her needed to be discussed over the phone or in person. She called me an hour later. I expected her to be angry with me, possibly cuss me out. Call me a whore perhaps but she didn't. She cried for a long time and when she was able to speak she thanked me.\n\nWe talked for awhile about their relationship and about how she caught him talking to another girl in the past but let that one slide for the sake of her childern. This apparently was the icing on the cake. She added me on Facebook and when she broke up with him she went on Facebook and wrote about how she almost made the biggest mistake of her life. She personally tagged me and thanked me again that status. Felt a little weird about that but I rolled with it.\n\nIt wasn't two hours after that status was posted his messaged me and called me a stupid cunt. I was delusional and he never liked me. I ruined his relationship.. A load of bullshit. I sent her those messages and we laughed about it.\n\nWe may have met through weird circumstances but I may have made a new friend.\n\nI don't regret telling her one bit, she seems like a wonderful person and she didn't deserve what he was doing to her.\n\nTL;DR Guy tried cheating with me. Sent screenshots to his fiancée, she was thankful that I told her. We bonded over his misery.\n\nEDIT:\n\nI hadn't even noticed that I misspelled  fiancée (On mobile) Please excuse that error.. LOL\n\nEDIT 2:\nI've replied to **most** of the comments. I did not predict that I would get so many responses. I made this update to inform the ones that commented on the previous post or read it that everything had went well. \nThank you all for your kind praise. I don't regret the decision at all. If anyone is ever in this situation it may feel scary but it's the BEST decision you'll ever make. I hope and pray this guy isn't stupid enough to try cheating on his future girlfriends. With the technology these days one way or another you're going to get caught. ",
        "permalink": "/r/relationships/comments/4jv6j1/21f_update_i_confronted_his_fiancé/",
        "comments": [
            "Oh, that poor lady! I really think you did the right thing though. Now she knows where she stands, and that lousy cheater is dumped.",
            "[removed]",
            "Well done.\n\n> I ruined his relationship\n\nMade me laugh!!!",
            "Oh this reminds me of the one from months ago where the GF and \"side girl\" ended up meeting up and getting wasted together at her place surprising the BF when he walked in. \n\nWell done for being so brave.",
            "Congrats to both of you on ridding yourselves of such an utter jerk.",
            "I met my best friend when she was the \"other woman\". He's long gone but now we're friends for life!",
            "This is why I will always look down on anyone who says \"it's none of your business\" in these situations. You're a good person.",
            "No better feeling than the happenstance of becoming her friend. It's like the best revenge and you don't even have to do anything!",
            "Cheaters are pretty universally garbage people. You did the right thing.",
            "You helped that girl dodge a HUUUUGE bullet there OP, good job!",
            "You're a good person.",
            "Nice job, OP. You handled a difficult situation like a pro. ",
            "this made me so happy. I wish there were more people like you, op. ",
            "If I had been his fiancée I would have been extra offended that he'd think I was so stupid. Like really, here's concrete proof in writing that he's an *awful human being* what, did he think the OP wouldn't figure out screenshots or that he could convince his fiancée that OP was jealous and forging them?",
            "Cheater says, \"You ruined my relationship.\"  Even though OP simply deflected cheater's cheatery over to the fiancee! \n\nThis would be like someone deliberately firing a bullet into a wall, getting wounded by the ricochet, and then blaming the wall for the whole thing. What a douche that guy is. Good on OP for helping the fiancée avoid marrying him.  That would have been miserable for her.",
            "Reading this made me extremely happy.  You handled it brilliantly as well. \n\nI hope you two become life long friends and meet awesome partners who aren't douchebags. ",
            "This is so bittersweet. You did the right thing and you are a good person. This guy is a horrible person because it's one bad thing to play someone for a fool, it's another thing entirely to deceive two children. Why would you hurt kids like that?? They thought he really loved their mom and so put their innocent trust in him and became attached to him, but all the while he was just playing with their mom. F!cking villain. I wonder why he felt the need to do this.\n\nSweet jeebus. I kind of feel like you saved her from getting hit by a train...the initial push out of the way hurt but it saved her from doom and catastrophe. Not even joking here, this guy is capable of causing all sorts of hurt to her and her children if he's willing to cheat 2 months before their wedding. ",
            "Ovaries before brovaries. Here's to newfound friendship!\nMay I point you and your new friend over to /r/trollxchromosomes ?\nI think you'll like it there.",
            "Yeaaaah sisterhood 👊🏽 you 100% made the right decision. Even if it blew up in your face and she hated you, there's no real danger that would have come from it. ",
            "UGH THERE NEEDS TO BE MORE GIRLS LIKE YOU!!! \n\nSome women would rather keep it a secret and laugh at the girlfriend for being so clueless! That's just wrong. Personally if I would ever be in a situation where I'm dealing with a cheating scumbag I would love if the other woman would have the guts to come forward with evidence instead of thinking \"it's none of my business\" or hoping \"maybe he'll leave her for me\" or \"what she doesn't know won't hurt her.\"\nSome people are just so fucked up OP. Good to know that you're a wonderful person and that you even decided to befriend this girl so y'all could laugh at this cheating fucker together. (,: ",
            "You did the right thing. I get that the status she posted may have made you uncomfortable, but she's grieving the loss of her future. I wish you both the best ",
            "Thank you for being a stand up person. The world needs more people like you. ",
            "Hahaha, I think you just created a group of relationship vigilantes!",
            "Yes! Cheaters like him should never be allowed to get away with it. I am surprised he didn't think that your conversations could be easily screenshot. But nevertheless, you did the right thing, and I hope you and her become really good friends. ",
            "You are awesome ",
            "Very unfortunate circumstance, but great update! I'm glad she didn't blame you, and it would be a lovely twist of fate if you two end up good friends. ",
            "A few people i know found their best friend through identical circumstances.\n\nGood on you for doing the right thing.",
            "Woo ladies sticking up for other ladies! We need more of this in our world. We are not just competition we are all people with our own perspectives and feelings. Thanks for being the bigger person and telling her. I have a friend who is married to a man who consistently seeks out and has affairs and it has made her life hell and is not fair to her daughter. \n\nYears ago, I had a girl I knew through mutual friends tell me my fiance had previously cheated on me with her! She said that she really liked me when we became friends and she thought if she told me that I would hate her and that she saw how much I really loved my bf. I was very hurt but i didn't hate her, I respected her a lot for telling me the truth. We are still friends and keep in touch like 8 years later. You did the right thing good on you!",
            "You did a great thing. Not just for the fiancée, but for the kiddos. Totes wish more people could be like you. ",
            "> I ruined his relationship\n\nPlease tell me you responded with \"You mean the one you *insisted* you didn't have?\"",
            "[deleted]",
            "I AM FIST PUMPING SO HARD RIGHT NOW YOU GO GLENN COCO",
            "if he's threatening you (i saw a comment you may have deleted), be sure to keep a log of dates & times and things he says to you as well as file a police report.  if you need to get a restraining order later, submitting this info & the # of the police report will help. \n\nand please be careful, a PPO is a reactive protection, not proactive. it only has consequences if they are caught violating it. ",
            "I did the same thing recently... 99.9% of the time people are really thankful for letting them know. I don't regret it at all. I would want someone to let me know too",
            "Women need to have each other's backs, plain and simple.  When it comes to guys, to work, to friendship, to life.  When we fuck each other over, we make it that much easier for guys (and the world) to treat us like shit.  \n\nOP, you rock.  Fuck that guy.  You're the kind of person I'd want as a friend.",
            "[deleted]",
            "One of my best friends is my crazy exboyfriend's girlfriend prior to me. Best thing I got out of that relationship!  I'm so glad you did the right thing, and that she was able to see that too. Best of luck to both you and her. ",
            "This made my week. Thank you, OP. I hope your new friend finds peace soon <3",
            "Congrats on ridding yourself of this guy! Dude sounds like my (former, I guess?) Uncle, wouldn't take the blame for cheating. My aunt is currently going through the divorce process now.",
            "You absolutely did the right thing! You both are much better off without him, what a douche.",
            "You did a good thing, OP. Hope it's the start of a great new friendship!",
            "Hey, I bonded with the woman my ex-fiance cheated on me with! :D She didn't even know we were together, he told her we were just best friends with benefits, pfft.",
            "Kudos to you for taking a giant leap outside of your comfort zone for the sake of someone else.  That took guts.  Doing the right thing isn't always easy, and doesn't always seem logical.\n\nI am glad that she is a sensible person, accepted the information you gave her as fact, and took the necessary steps to get rid of this guy.  I am also glad you made a friend in the end.",
            "It definitely sounds like you did the right thing. I'm really glad she was receptive and didn't automatically resort to blaming you. Sounds like the beginning of a beautiful friendship. ",
            "Oh yeah, *you* ruined his relationship. Totally.",
            "Good on you for doing the right thing OP, especially considering there are children involved. You've probably saved her and her family from a lot of turmoil down the road.",
            "Yayyy I hope you guys become friends!!",
            "Good job OP! Respect :)",
            "Good for you. That took courage and I know I'm proud of you!",
            "Fuck him, you saved this chick time.  We should always stick together.",
            "one of my best friends is a girl that was sleeping with the same guy as me, met accidentally, we've been friends for 10 years, have no clue what happened to the guy, and we have a great story to tell.  I hope it's the same for you :)  you saved this girl a world of hurt, breakups are much easier (and less expensive) than divorces.   not to say it isn't hard right now, but hopefully you both meet someone (well 2 different someones) who treat you how you deserve to be treated.",
            "Similar thing happened to me, although they weren't engaged. I do regret not telling her though, so absolutely well done :)",
            ">I was delusional and he never liked me. I ruined his relationship.\n\nCalling someone delusional yet raging about how \"he never liked her\". Oh the irony.",
            "Ya I don't see why you would even need to think about that. You'd have to be a pretty shitty person to be the girl someone's cheating on their fiancé with and not tell the girl he's going to marry.",
            "take notes, main and side chicks.  This is how you do it.",
            "This is how it should always go when you out a cheater. I'm glad it worked out, you know, to the extent that something like this ends well. ",
            "Jesus.  \n  \nIt's weird how a person can be attracted to someone who is a complete and utter scumbag just under the surface.  \nHe must have been like, mega hot.  \n  \nGood job. What a bomb she just got but it's all for the best.",
            "Good work :) I'm glad things ended well.",
            "That poor woman, but good on you, you did the right thing. Sometimes we meet our friends in the most unlikely of places. I was in a situation similar to yours once except...the fiance was the one who told me. It's a rough situation, and I'm sorry to both of you for the pain this man has caused you.",
            "You're an amazing person! Congrats on the new friendship.",
            "I guess one way to avoid this is to make sure your SO has their relationship status as public! And accept zero excuses! ",
            "Im so happy she called an hour later. She probably, hated you for a minute but then gave herself some time to realize the situation and what has happened before.\n\nHey who knows maybe you two will be the best of pals and you can thank this giant douche nozzle for it",
            "you certainly made a new friend. you just appeared as one of the most trustworthy people in this woman's life. ",
            "there's a special place in my heart for women who help women. ",
            "I'm glad you did the right thing and told her, and I'm glad that she took it well too. I just wish people who clearly aren't into monogamy would stop trying to make it work with people who are. It's fine if you're into polyamory, but don't try and bring that into a relationship with someone who doesn't want that, it's one of those things that both people definitely need to be on the same page about. ",
            "guy was an idiot, guy got what he deserved.",
            "I mean, you did the right thing, and the fiancee owes you a huge debt of gratitude...but I wouldn't expect you guys to become actual friends.  She's obviously a classy woman, but she'd probably be more interested in starting over fresh.",
            "I made a friend this way. Dated a guy for two months before I found out he had a girlfriend. We went on dates, he slept over, I slept over. We were not 'official' but we were dating. I told his gf and at first she was angry then realized it was misplaced. We're still friends. He called me screaming that we never dated and he never liked me and I ruined his relationship. I was sitting next to her at the time and we laughed about it. ",
            "Ugh, this is so satisfying, good for you! When I told the wife of the guy who was cheating on her with me, he managed to intercept the messages and they're still together now :-(",
            "What an asshole. ",
            "I just want to say, good on you, OP! You did the right thing!",
            "Had this exact same thing happen to me. I was the fiancé. She saved my life and now I'm with a wonderful man. This will always be the best decision in these circumstances. Kudos.",
            "OP, you're awesome, and very brave. I hope you guys stay friends for life. ",
            "[deleted]",
            "I think you did the wrong thing.\n\nIt was none of your fucking business.\n\nNothing happened."
        ]
    },
    {
        "post_id": "7d4q1r",
        "author": "04211962",
        "title": "UPDATE: My (29F) ex boyfriend (32M) moved out with daughter (6F). I am devastated and don't know what to do.",
        "url": "https://www.reddit.com/r/relationships/comments/7d4q1r/update_my_29f_ex_boyfriend_32m_moved_out_with/",
        "score": 2803,
        "num_comments": 222,
        "created_utc": 1510758875.0,
        "selftext": "Original post here: https://www.reddit.com/r/relationships/comments/7bvybj/my_29f_ex_boyfriend_32m_moved_out_with_his/\n\nHey guys - so I just wanted to update some of the people who commented and gave me some insight. All of your comments were really appreciated and definitely helped me think. \n\nSo for the last week my ex has been staying with family when hes not at work and we have been sharing time with Sarah. We met up this weekend to talk about everything and our life plan. He basically said that he does still love me, but that his schedule is just not something that can change for him anytime soon. I am trying to be understanding and supportive, because I do want to be with him and Sarah. We are going to look into counseling for us as a couple, and also family counseling for the three of us.\n\nI did bring up legal adoption of Sarah. I was shocked when he said he was thinking of the same thing. He said that no matter what happens with us as a couple he always wants me to be a parental figure to Sarah. We had both hoped that someday I would adopt her, we just didn't see us breaking up or it becoming an issue. I am so glad we are on the same page about that. I am over the moon and were going to meet with a lawyer on Friday to get the ball rolling on that. \n\n\nI am hoping that this relationship can be saved because I really do feel like I have a family with them. My number one priority throughout this has been Sarah, and I am cant even explain how happy I am that I will get to legally be her parent. I know I wont ever be her mother but I'm glad that we will be together no matter what.\n\nThanks Reddit! Sorry this is kind of all over the place. We're still figuring everything out, but I wanted to update!\n\ntl;dr: We are going to start couples and family counseling, as well as beginning the process for legal adoption!\n\n\nEdit: Thank you so much for all your comments. This got bigger than I expected. Thanks for all the kind words. To people think that I am being taken advantage of for free child care please realize that I've happily cared for Sarah for the last 5 years and have no problem continuing to do so. To whoever gilded me for this thank you so much! ",
        "permalink": "/r/relationships/comments/7d4q1r/update_my_29f_ex_boyfriend_32m_moved_out_with/",
        "comments": [
            "This is a good update. I really hope everything works out for the both of you. I'm so happy you talked about adopting Sarah and he agreed! Good luck with everything OP!",
            "I'm glad you guys are on the same page about the daughter. I do worry about how this will go if you guys stay broken up and he later falls in love with someone who also becomes a mom/step-mom to the girl. Hopefully everyone is mature and has Sarah's best interests at heart. But be careful.",
            "If you legally adopt Sarah but he maintains custody would you be required to pay child support?",
            "[deleted]",
            "My brother adopted his ex-wife's son before they divorced. They have shared custody and it works out perfectly. Good luck!",
            "I want to give you a little bit of a reality check.\n\nThis work schedule thing being too busy and you nagging him thing is an excuse. While it might be valid (he might be tired of your nagging) it sounds like the three of you have a family together. You're all but married in everything but name and legality. \n\nI've recently started working 7 days a week 60-75 hours. Its necessary right now. My family wants to make a cross country move and I want to make sure we have a massive cushion of finances to move on. I'm busy as hell. But I'd never divorce my wife because of it.\n\nHe moved out. Either your nagging was off the charts annoying or there's something else going on here. You might want to consider that before you devote a bunch of time in relationship counseling trying to salvage this. ",
            "> My number one priority throughout this has been Sarah, and I am cant even explain how happy I am that I will get to legally be her parent.\n\nI am happy that this relationship will keep going and your boyfriend is discussing adoption with you! But this statement concerns me. Are you trying to keep the relationship alive just to stay with Sarah? A strong couple and family has the strongest base when the parents are the stable foundation. I think it would be healthy for you to devote positive energy for your boyfriend as well. But also, stop thinking of yourself as an outcast to the family, you are part of the family. I think if you feel like you do belong, you won't use such exit-plannish phrases. Food for thought. Take care.",
            "The legalities of what you are proposing are going to be a lot more complicated than you think. There is a chance you could wind up paying child support to your ex-boyfriend in the future and only having visitation rights to your child.",
            "You are her mother, sweetie. Completely and in every way that matters.\n\nI'm so happy for you and I wish the best for your family's future.",
            "Oh, I am SO GLAD to hear the news about Sarah. That's wonderful! And yes, you will be her mother if you adopt her, right? ",
            "Did he give a reason for why he said he was no longer in love with you?",
            "Where do you live? Most likely you and boyfriend need to be married before you can adopt Sarah. It would be a step parent adoption. ",
            "> I know I wont ever be her mother but I'm glad that we will be together no matter what.\n\nI don't really understand that sentence. Yes, you aren't and won't ever be her *biological* mother, but beyond that ...\n\n... you were her caregiver, from the sounds of it even primary caregiver, for as long as Sarah can remember. I fail to see how her relationship to you would be in any way different than that between mother and daughter. No matter what she calls you, I don't see how her feelings toward you could be any different than those towards a mother.\n\nThat's why a sentence from a reply to your previous thread really upset me:\n\n> But consider whether it means more to you than her. I remember being six years old but I don’t have tons of memories from that time. There are lots of people that I were in my life but I can’t necessarily remember those faces.\n\nIf your relationship to Sarah is even remotely as you described it, this would be vehemently untrue. Losing you would be like losing her mother at the age of six. It would not cripple her, but it would hurt and and it would leave a deep scar.\n\nI'm very happy you're working things out and I hope you can become and remain loving family unit again.",
            "wow, that is awesome.  I truly hope that you guys can save the relationship. Far too often these days, couples seem to give up,on committment when things get tough. Committment, to me, is figuring out how to make it work together when things are tough.\n\nIt sounds like you are on the same page regarding Sarah,so definitely move forward with that asap..that will help by providing a concrete, positive reason to keep working at the relationship through good times & bad. It also provides you and Sarah protection from a relationship standpoint if things go south permanently.  \n\nIt seems like you both want ghe same things - that is truly half the battle. Work with a therapist who can help you navigate some of the issues that may be causing strife. Best of luck to all of you.",
            "Sounds like a positive update, and I certainly wish you the best of luck, but I'm skeptical that you would be allowed to legally adopt Sarah if you and your ex are not actually still together.\n\nMaybe I'm wrong, but I'd encourage you to seek legal advice.\n\nEven short of that, though, it still might be possible for you to get some legal rights (visitation more likely than custody), especially if your ex is cooperative. Judges will consider the best interest of the child, and since you've raised her for 5 of her 6 years, they should certainly take that into account.\n\nGood luck.",
            "This is all great, but this is concerning:\n\n> My number one priority throughout this has been Sarah\n\nRemember, parents always put each other first before the kids. I know that sounds wrong, but it's not. You can't be an effective parent if your relationship with your partner is bad and you're burnt out and stressed about everything. You just can't, and it harms the kid more than anything. Please put your RELATIONSHIP first with the kid a close second.\n\nKind of like in an airplane, you put your own mask on before the kids. As a parent, i know we all would rather die than see our kids hurt, but you can more effectively help your kid by staying alive and being the best person overall that you can be.",
            "People are all like, \"oh, OP shouldn't put herself at legal risk by adopting Sarah\" \n\nBut it sounds like OP wants that legal risk because she loves her child. Would you tell a bio parent who could choose to tap out of legal responsibility for their child to do so? \n\nIt seems like both OP and her ex are agreed that Sarah needs her parent in her life. \n\nCongrats to you, OP, doing right by your kid. Screw the people who say she will forget you- I had a different primary caregiver from ages 1-7 vs. 7+, but I never forgot or stopped loving my first primary caregiver. I still miss her.",
            "Yay! It's great that he's on board with you continuing to be Sarah's parent regardless of what happens in the relationship.\n\nMaintaining a relationship is tough when you've got a kid and if he's working long hours and has a schedule that doesn't afford you two much time together. Hopefully through the counseling you'll find a healthy way to deal with your feelings about his work schedule and how to communicate them in healthy and non-destructive way, and he'll find a way to keep the romance alive in spite of the work schedule (or maybe even see the value in making a work schedule change). You didn't give many specifics about the situation, so it's hard to offer any ideas/compromises, but that's something you can work on in the couple's counseling.",
            "I'm really glad everyone has Sarah in their best interest! Good on you and him for for seeking therapy and willing to work together as team for her.",
            "Good to hear, congrats.  And... you may not be used to the idea yet, but as her adoptive mother, your mother-daughter relationship is just as real and valid as a biological one.  \n\nI also think it's reasonable for you to be hopeful that you will get back together.  For him to say that he wants you always to be in Sarah's life is *huge*, I really didn't expect that.  Let us know how that goes!",
            "You are her mother. The way you care about her makes it true. ",
            "Your first post hit home for me, my daughter is 5 years old and my husband, who is not her bio dad, has been with us from day one. She knows him as \"dad\" and they have a 100% father-daughter relationship. I can't imagine them being separated. I'm so happy things turned around for you guys!",
            "You adopting her while this relationship isn't stable, and actually in question, is a terrible idea. It's the equivalent of two people on the edge of divorce deciding to have a baby.\n\nHe's only agreeing to your parental involvement, so that no matter what happens to your relationship, he'll have a caregiver. I'm not saying that he's doing this intentionally, but at least subconsciously. It may be all good and well for her to have s mom, but ours better for her to not be dropped immediately into a divorced parent situation. You guys need to figure this relationship out asap, with absolutely no influence of there being a child involved.",
            "God damn it this is the most beautiful thing Ive read in months",
            "OP I really don't have much to add except that you are a good mum. Keep it up!",
            "Don't allow yourself to be a doormat or the only one trying to salvage things.\n\nFocus on your relationship with Sarah, not him. That is the most important thing here. I mean, I hope it works out for you, just tread carefully when it comes to your direct relationship with him.",
            "It sounds like you guys just need a little space for you to grow and then come back together. From my perspective (A man) if he wants you to be the mom of his child, he wants just as much to end up with you. \n\n100% respect your strength in this and your ability to care for Sarah. If it weren't for my step dad I never would have become a functioning or respectable man - I imagine that you will fill a similar role. You rock OP - and you've got a crazy good heart. ",
            "As someone who lost their mom early on in life (8yr old) I can tell you that she will see you as a mom. My dad was in a relationship with a woman for as long as I can remember (parents split when I was a baby) and I consider her my mom more so than my biological mom. Blood doesn't matter when it comes to who you see as a parent and I'm sure Sarah will be really glad to have a mom that cares about her as much as you clearly do. I hope things improve and I'm glad you can still be a mom to her!",
            "Take it from an uncle who became \"daddy\" because the father is never around and I live with her. You are the mother. You've done the work, you've provided her happiness, you've shown her something stable. \n\nTake this legal adoption and run with it. Then, if he ever gets pissy you will have rights. \n\nThis is something I wish the mods would waive their one update only rule on, I want to hear how this ends up happening. ",
            ">He said that no matter what happens with us as a couple he always wants me to be a parental figure to Sarah\n\nThat's what he says now, but will he say that 5 years down the line when he's married to someone else?  This is an easy choice when there is not another woman in his life.  I would strongly urge you to hold off on adoption; there's no reason you can't be in his daughter's life without a formal adoption and if you do adopt you're tying yourself to him forever which may not be good for anyone depending on what happens with your relationship and what other women get involved with him and therefore his daughter.",
            "Wow, what a tough situation. I have kids, so I know if I ever had to separate from them, I'd be devastated. I got a little misty reading that your BF is on board with you adopting Sarah and that you're spending good time with her still. Nothing but good wishes and prayers going to you!",
            "You don't break up with someone because they nag you. You discuss this problem like an adult and come to an agreement on how you can both move forward. I hope this comes to light for you/him when you go to counseling and you guys can learn how to communicate with each other. \n\nI'm glad you're going to get to stay in the girl's life because that will set her up for success. You guys need a strong coparenting, legal document to ensure things go well from this point forward, though. In the event that either of you end up marrying someone else, what happens with new relationships, how medical and other decisions will be made for her, etc. ",
            "I know you are coming from a place of love but I would caution you to step back for a moment and look at this ... for lack of a better world.... coldly.  What happens if you guys dont work out and someone else steps into her life turns her against you and suddenlybyou never see her as a teen yet you are legally and financially responsibke for her.  If you adopt her and split up you will most likely have to pay child support.   Its all great now when people are civil... until they aren't.  Im not saying its a bad idea.  Im just suggesting you consider all the possibilities.  I was in a similar situation.  Helped raise a child for 5 years...haven't seen them in 15...even though i tried.",
            "Oh my God I'm so happy for you!!! I just read your old post and my heart was breaking for you and for that little girl! You ARE her mother, you're the only thing she knows. How devastating if you just didn't get to be a part of her life anymore. I hope it works out for you soooooo much. <3",
            "OP, your post just made me tear up because I’m so happy for you. \n\nGlad things are going well. I hope you two do reconcile and end up as a happy family.",
            "Good update.\n\nCounseling is a very good idea. Many marriages could be saved by early professional help.\n\nIf you experience hysterical bonding, don't use that to paper over your problems.\n\nThe fact that your a good mother is a reason that your boyfriend may still love you. That is only part of your relationship.",
            "For the record, biological or not. You are her mother. Don’t sell yourself first. Parents put their children first which is exactly what you did you. You are as much her mother as any other mother and daughter. ",
            "Glad to see it work out for you :) ",
            "If you adopt Sarah and you guys split up you might be responsible for child support. \n\nYou should work on your relationship first, and only if it’s going well should you consider adoption. ",
            "Thats a horrible update. You need to put Sarah first.  Unless you two can be a committed couple you should not consider adoption.  What happens if he has to move in the future, or finds someone else if you two arent together?  You need couples counseling first, then a commitment to a life together, then adoption.",
            "You definitely need to speak to a lawyer about everything. I know you love this child as if she were your own, but you need to prepare for all the possible outcomes.\n\nI would also be cautious on adopting the child. Your ex may just be screwing with you just to try to get you to pay child support for the kid, without you ever seeing her again.\n\nWhen you speak to the lawyer, you should set up a meeting alone without your ex present. Ask if you adopted the child how likely it would be for you to get joint custody if your ex and you don't actually get back together. You will most likely have to pay child support unless your ex doesn't ask for it. If he isn't willing to go through mediation or come up with a visitation plan and take it to the courts, you may be looking at thousands of dollars of legal fees and still end up with no visitation and having to pay child support. Would you want to pay child support for the next 12 years if you never see this child again?\n\nI would not sign any adoption papers until you are back in a good relationship with the guy.",
            "You adopt her and he can sue you for child support. Even if she turn into a bratty teen who non stop shouts “your not my mom!” And refuses to see you. Just something to keep in mind. ",
            "\"I know I won't ever be her mother.\" Yes, you will. That's what happens when adoption takes place. You will be her mother.\n",
            "I wish you all the best ❤️😍😘 I hope you guys will have a better relationship ❤️",
            "A very good sign of progress and good things to come!!",
            "What a fantastic update. \n\nJust remember that, with his busy schedule, if you do get back with your ex, he needs some personal time. Dont push him away again, I know it can be hard when you feel like you barely see him, but just remind yourself that everyone needs that little bit of time to themselves to recover. ",
            "This is the kind of ending that warms even the coldest of cynic's hearts",
            "This made me want to cry\n\nThe love of my life has a daughter of his own, and she's similar age and whilst I would never, ever pretend to be a mother to her as she has her own, I fell in love with her the day I met her and we're awfully close. This situation that you're in is terrifying, but your ex seems to have a very good  heart, as do you, of course. Good luck to you all.",
            "Great update, I hope everything works out wonderfully!",
            "I recommend again the adoption unless you marry. He's using you for free childcare. If you weren't in the picture he'd have to give up this job he loves. The one he broke up with you over.  Don't you see that he can't break up with you because you enable his fancy-free lifestyle?  That's why he is trying to lock you down legally.  Once you adopt, he can dump you and keep his nanny.",
            "[deleted]",
            "FWIW, the economy is pushing people back into the direction of something like traditional gender roles. There are lots of good well-paying jobs with promising career paths being created, but they are too demanding to have anything that can be called work-life balance. I wouldn't be surprised if your next boyfriend winds up being someone else in that situation. \n\nIf the relationship is ever to be resurrected, I would say the only realistic possibility is for you two get married, and for you to accept his schedule. Marriage is, fundamentally, a contract, and if you are going to give first priority in your life to Sarah, rather than building a career, then you need that contract. Devoting your life to raising someone else's child, without getting any kind of commitment in return, to me just sounds like a bad deal. "
        ]
    },
    {
        "post_id": "ndbv44",
        "author": "throwawayforRA_",
        "title": "My (24M) fiancé (24F) insists that we take care of her autistic younger brother. (21M) (5yrs)",
        "url": "https://www.reddit.com/r/relationships/comments/ndbv44/my_24m_fiancé_24f_insists_that_we_take_care_of/",
        "score": 2800,
        "num_comments": 400,
        "created_utc": 1621123019.0,
        "selftext": "My fiancé and I have talked about this a few times, and it always ends with her angry and crying. I love her so much but I cannot get past this point. Here’s the issue:\n\nShe has a younger brother I’ve known about since we’ve dated in college. He’s a very low functioning autistic, to the extent that he will need full-time supervision and care for the rest of his adult life. He’s a sweetheart and a great kid, and he and my fiancé are about as close as siblings can get. \n\nWe want kids, but whenever we get on the topic she brings up her brother and talks about how “you won’t even notice he’s there” and that “he can really take care of himself, he just needs some supervision is all.” I’ve taken a lot of time to consider it, and as much as I like her brother, I’m not marrying her for her family. \n\nShe wants us to take care of him alongside our children, to live with us as soon as I’m done with Med school until presumably we die. \n\nI’ve told her I love her brother, but I don’t want him to live with us and our kids, if we choose to have them. Her parents are two wonderful people, and I feel they are much more equipped to take care of him like they have the last 21 years. \n\nMy position is that he will be happier and better taken care of with his parents, and that it is their responsibility to do so. As far as I’m aware they’re planning on doing this anyway, but every time my fiancé and I have this conversation it ends with tears. \n\nTL;DR - My fiancé wants us to take care of her autistic younger brother, I don’t think it would be best for him or us. We are not as well equipped as her parents to do so.",
        "permalink": "/r/relationships/comments/ndbv44/my_24m_fiancé_24f_insists_that_we_take_care_of/",
        "comments": [
            "My friend has 2 autistic siblings who require full-time care, and their parents are older. She got married a couple years ago. One thing she made clear to her husband from when they started dating was that she was going to take over caring for her siblings one day. He decided he was okay with that and married her knowing that was their plan. This really is something that needs to be worked out before marriage though, and it’s not really an area where you two can compromise. Taking care of a disabled person is hard work, and you’ll resent her if you get forced into it, but she’ll resent you if she has to put her brother in a care home. This might be a situation where your goals are just not compatible, and it is a deal breaker.",
            "This is a deal breaker.   The only way you can go forward with this relationship and your planned marriage is if you are 100% OK with you and your fiancé being lifetime guardians and care givers for the brother.  \n\nThis isn’t something that you can change her mind on without a lifetime of resentment.  \n\nEven if parents continue to care for the boy they will get too old to do so someday and this subject is certain to resurface in the future.  \n\nI feel sorry for you as you have a very serious decision to make.  Think of the life you want and choose wisely.",
            "\n## PREMIUM CONTENT. PLEASE UPGRADE. CODE gy9utqp",
            "I'm sorry to tell you, but this sounds like an incompatibility and may mean the end of your relationship...",
            "This is not going to change.  It will just divide your relationship further.  You could compromise and let him live with you but you will resent him and eventually her.  You might not ever say anything but your children and the brother will pick up on it.  You don't HAVE to do anything.",
            "You might not be able to live together if you can't live with your brother in law and she is determined that she should care for him.\nIt's unfortunate but you must resolve this before you get married.\nNobody's bad or wrong but you both have to decide it this is a deal breaker.",
            "Your fiancé needs to have this conversation with her parents. She needs to know what their plans are, and what arrangements/plans are in place for her brother should her parents not be able to care for him.\n\nDepending on your relationship dynamic, perhaps you could also be part of this conversation. It might be helpful for you to hear it directly from her parents, and not through her as a translator.\n\nBut this is a conversation that needs to happen. It’s actually way overdue. She shouldn’t be feeling this pressure or framing this fantasy without a very clear conversation with her parents.",
            "You're free to leave if you don't want to care for him. You might just be incompatible. Nobody is \"wrong\" here. She's not wrong to want to care for him. You're not wrong to say no. She's either being dishonest, though, or extremely naive to claim you \"won't even notice\" he's there. If this is what she truly wants, it just means that marriage should not be in the cards for you two. She needs to use that as a learning experience though and be clear about that from the get-go with anyone she dates in the future (not tell someone this as they plan a life together). This is something she should have told you LONG before you got engaged. I would just tell her: \"I am not equipped to care for him. This is not something I can do or want to do. If this is something you insist on doing, then I respect that but it means we won't be together.\" It's not an ultimatum. It's just the truth.",
            "We all have deal breakers. This is clearly one for her. Decide if this is one for you. If it is that's fine. If you think you can live with taking care of her brother with all the money, restrictions, etc. that it will require than do that. Don't marry each other with both of you thinking the other person will change their mind in the future.\n\n&#x200B;\n\nSometimes people love each other but they have deal breakers about money, children, religion, etc. That's fine, so long as everyone is on the same page.",
            "> I’ve taken a lot of time to consider it, and as much as I like her brother, I’m not marrying her for her family.\n\nYeah...so you may not be marrying her for her family, but her family is a part of the deal. At some point her parents will pass, and unless he dies before them, responsibility for caring for him will pass on to the two of you. That's basically inevitable.\n\nThat she wants him to move in well before that eventuality is something that you can try and convince her is unwise and unnecessary. You've received some solid advice on how to approach that topic. But at some level, they're a package deal. Her relationship with her brother will impact where you can move and a host of other decisions down the line. You need to be ok with that.",
            "You'd seriously bet better off ending this relationship if you don't want the brother.  She'll just resent you, and or force it upon you when her parents die.  I don't blame you either",
            "I have an autistic brother, and I made it very clear to my boyfriend early on in the relationship that if anything ever happens to my parents, and they're not there anymore. I am going to take care of my brother, as in, he will live with us. I'll work and look after him to the best of my abilities... My boyfriend was very supportive and loves my baby brother...But I can assure you if he had had any doubts, i would have ended the relationship right there in those early stages because I have always known I was going to look after my brother.\n\nI don't know what else to say other than, this isn't something that can be compromised on. You and your fiance need to talk  and reach a decision wisely.",
            "Speaking from my experience working in a care home for adults with disabilities - if he is actually what is known as \"low functioning\", she's absolutely wrong that her brother \"just needs some supervision is all\".\n\nIt's a full-time job. All of the residents still had family visits and/or outings, so it's not like they get sent off somewhere and never see their family again. But taking care of adults in that position is hard work and honestly - there are times where I had to clock out an hour early because I just couldn't handle it at the end of a particularly stressful shift.\n\nThere are plenty of people that take care of family members with different impairments. But it's a hell of a commitment and if you're both not 100% onboard, you will build resentment and it will kill your relationship.",
            "You both have the right to feel and want what you want.  To be fair, parents don’t live forever.  So at some point he’s going to need a caregiver.  This may be a non-negotiable for her.  I also don’t blame her.  And you may have had the expectation that you aren’t marrying her family... it doesn’t matter who you marry, you basically are.",
            "Don’t marry her with hopes of her changing her mind, she wants to take care of her brother, when her parents get too old or pass away you will be taking care of him a 100%. If you’re not willing to do that don’t continue this relationship because clearly this is a dealbreaker for her and you have to be honest with yourself if you really don’t want to take care of him not now not in a future.",
            "So my twin brother is autistic and from my experience, her saying that nobody would notice her brother being around is highly unrealistic. The time and energy that an autistic person that needs special care requires is a lot. With my brother as context, you have: doctors appointments (if a specialist, there could be a lot of travel involved), special medications that have to be taken on time, meetings with social workers and other carers (my brother had a gentleman whose role was to take my brother out so that we as a family got a break, but we also had many discussions with this gentleman about my brother and how he was doing etc), any special needs regarding bathing and grooming (for example, my brother needed assistance with shaving), etc. So this WOULD impact your time with your children and together as a couple. That's simply a fact.\n\nIf you live in a place with poor healthcare, there are also those funds to consider. Such as medication costs. \n\nAlso, what are your guys' expectations regarding care for both sets of aging parents? That could be an issue as well.\n\nPersonally, I would take the time to sit her down and present your thoughts to her again. Tell her whether or not it is a dealbreaker and go from there. It really sounds like not having her brother in the home with her is a dealbreaker, but if you feel she might change her mind or compromise, I urge you to speak to a therapist or other professional trained in autism care together.",
            "I have a son with special needs as well as two daughters. I have made it clear that his mother and are taking great steps to ensure that they will never have to support him. They might one day be the ones making decisions for him, to the point even of custodial responsibility. But they won't have to open their homes to him. He's my son, not theirs.\n\nYour future in-laws should have been on this. \n\nThis is one you absolutely must solve before getting married. And if she relents and accepts that he can't stay with you, be very clear about what that means - he can't stay with you for more than four nights in a month and two weeks in a year. And make it clear to her that this isn't something you're going accept 'over time' so that she doesn't harbor hopes of 'wearing you down.' Even go so far to write something down and get her to sign it. \n\nIf she says you're asking her to choose between him and you, well, she can't marry both of you. (She can't marry her brother anyways but you see my point). She has to choose between having a new family with you or raising her old family.",
            "So I have a younger autistic sister and this has always been my plan. To take over her care. \n\nAs such I did exactly what your fiance did. Spoke to my husband about the future. He decided he was ok with it. So we moved forward. If he hadn't been it would have been a deal breaker. \n\nThat being said my mum doesn't want my sister to affect my life negatively and so has worked to get her into assisted living. Which is where she is now. We see her multiple times a week. I take her out on day trips etc. And actually I think that's better. At the end of the day she is only 2 years younger than me. How would I take care of her when I'm 74 and she is 72? I might not be capable. I may have my own health concerns etc. \n\nMaybe talk about this possibility. What if she physically can't care for her brother in the future. See if she is willing to work on a different plan? If not unfortunately you aren't compatible. It's sad. But it doesn't make either of you bad people.",
            "It is heartbreaking, but her brother needs full time care, and your fiancee is unrealistic when she says \"you won't even notice that he's there.\"  Ignoring her brother and not noticing that he's even there is NOT the level of love and care that he deserves.\n\nYour fiancee is very attached to him, but ask her to make a decision that's *best for him*.  If she loves her brother, she should make a decision that's best for him.\n\nAnd to see what's best for him, look at what level of care you can provide, vs. what her parents or professionals in a nursing or special-needs facility can provide.  There's love all around, you love her brother, she loves her brother, her parents love her brother; there's love all around, the difference is in the level of care and attention that he can GET, that he deserves.\n\nYou're starting a new family with her.  You'll have kids, they'll wake you up at all hours of the night.  You have jobs, you'll be tired, you won't even have much time for each other once your married life gets going.\n\n*The two of you* do not have the capacity to provide full care for her brother.  The two of you.  Do not.\n\nArgue it from this point of view.  She will likely reject this argument, she will likely try to bargain with you.  Let her, let her think about it, argue about it, let her work out her feelings.  She needs to let go, and there's loss and grief in that, it'll take some time.  Give her time.\n\nBut don't move forward with the relationship until this is resolved.  If your wedding is imminent, postpone it.  You cannot proceed until she lets go, and if she doesn't, you cannot proceed.\n\nI'm sorry.",
            "What do her parents think about this? And if something happens to them or as they get older, will you be ok taking him in? If not, this may be a dealbreaker on both sides.",
            "Hello, you’re basically me.\n\nLet’s talk.\n\nMy advice to you being in this exact same situation, if you don’t want to do it make it VERY CLEAR RIGHT NOW.\n\nIf it’s a make or break for your fiancé then it’s over because you clearly don’t want to do this and keep in mind you don’t have to.\n\nBut it’s likely you won’t be able to have both her AND not have the responsibility because she has probably signed up for this a long time ago.\n\nWas it not discussed at all while you were dating? Because you’re engaged now. My partner certainly didn’t bring it up with me at all and I was completely blindsided and it fucked us up real bad.\n\nIt’s a hard pill to swallow that this might be a make or break, but do not feel guilty at all for not being able to take it on or not wanting to. YOU ARE NOT OBLIGATED. Repeat that one more time.\n\nNot everyone is cut out for being a caregiver and that’s 100% a-okay. Someone with special needs should be with someone who wants to actually help them anyways and who knows how.\n\nIt’s especially difficult when they’re low functioning. Around the clock care is no fucking joke and there are habits and behaviors that might need to be continually kept in check.\n\nCaregiver burnout and resentment/hatred are also very real. This might also always be an area of contention between the two of you too.\n\nDoing this til you die? It sounds pretty fucking miserable. I know that in my situation, we tried it for a while but I ended up being depressed and suicidal.\n\nPlease don’t be like me and let it get to that point. Save yourself a lot of pain and cut the chord fast if you absolutely don’t ever want to do this.\n\nMy question is how do her parents feel about it? What do they have prepared for him? It’s their main responsibility since he’s their child.\n\nIs it a make or break for your fiancé? And how is she handling you saying no besides crying?\n\nWhat’s a compromise you guys can consider?\n\nJust so you know, my partner told me I didn’t love them and basically told me they’d cheat on me or leave me for someone else.\n\nThey became outright abusive and her entire family is mad at me about it, but ironically even with all her other siblings and extended relatives, not a single person called to offer help or sent a SINGLE PENNY to contribute to their care.\n\nNot even my partner was dedicated to the siblings care. She just stuffed them in a room and made sure they had food. She’d verbally abuse him to the point he felt he couldn’t advocate for himself and they’d bicker all the time.\n\nShe also expected me to just foot the living costs as well while her sibling used their government funds on useless unnecessary things to hoard in the house.\n\nIt was a real fucking mess. No mature conversations could be had, no rules or boundaries put in place because my partner refused to.\n\nUltimately I put my foot down because I was suicidal and I refused to die over something that ultimately wasn’t my responsibility and I couldn’t handle financially or mentally.\n\nI don’t know what your fiancé’s family is like, but keep saying no if you can’t ever see yourself doing this. You have the luxury to not take this on. That is a gift that many people, including your fiancé will likely never have.\n\nTheir autistic sibling is the hill they choose to die on and they have a right to do that, but you also have the right to the future and the life of peace that you want.\n\nIt’s a painful and terrible position to be in for the both of you.\n\nI know it fucking sucks and a lot of people would probably be quick to defend the special needs person over you, but someone else’s tragedy doesn’t necessarily equal your responsibility.\n\nIf you want to PM me to chat about it I’m here dude.",
            "Her parents will get old enough that they can't help him anymore.\n\nSounds like this is a fundamental issue that you two need to resolve or separate over.",
            "Jumping onto some other posts‘ suggestion: she can’t just take her brother from her parents! Is this what her parents want?\n\nIs there a compromise with having a bedroom for the brother so he could come visit? If not immediately, is that something you think you could eventually afford?\n\nAre you willing to have him live with you after her parents are unable to do so? Might you even pay for a caretaker to live with you?\n\nAnd, just an observation, the statement “you wouldn’t even know he was there“ when referring to your own marital home seems odd.",
            "Whatever you all decide, you need to get on the same page before the wedding, or else call it off.",
            "Please read: I have an mentally disabled 27yr old daughter and a healthy 22yr old son. I get where your fiancee is coming from. I get that her parents are getting old and it will get more and more difficult and eventually they can't do the care any more. I have dreamed f my son being the caretaker of my daughter one day (as a far away dream, not anything pursued) when he was a teen. But then I realised that this would not be fair. not fair on my son AND not fair on my daughter. My son doesn't want to stay in one place when he finishes university. he wants to work everywhere in the world and I will not destroy his dreams. OTOH disabled people need routine, the same sheltered workshop, the same environment etc. Plus - a mentally disabled person needs just that: a sheltered workshop or a sheltered special daycare to give them a fulfilled life.\n\nMy son is her brother. It WILL BE his responsibility to make sure my daughter is safe and happy one day (as best he can). But that doesn't mean HE must DO the caring. We are on a waiting list for group-living (post-covid). Not because we don't want our daughter with us any longer. Her room will always be her room, she will be home on some weekends or holidays etc. But we want her to HAVE a place to call home that is HERS and most important BEFORE anything goes wrong. We want to go slowly. Have trial stays and see she is happy there. We want to have the chance to pull back and say \"let us try another one\" until it fits. If we wait until we are dead, she won't have that time and slow progression. That would not be fair not only on her, but on my son, too. \n\nMy son's job when we are gone one day will be to call her regularly and to check on her occasionally UNANOUNCED so that he knows she is safe and happy where she is. If he lives overseas, he has cousins that will help on the occasional check and to invite her over every few months. the cherry on the cake is if he and his cousins would take turns in taking her in for Christmas or showing up and inviting her to a movie for her birthday. I hope that that will happen.\n\nPlease show your fiancee this post. It is time for her to talk to her parents about a solution. as a compromise, you can offer to take her brother in every other weekends (many group homes make trips and other special things to help the group bonding on the weekends, so go by bi-weekly weekend-home-trips). Her brother could call your place \"home\" but you two can live your life, too.\n\nImportant: there are care levels of assisted living situation.s and they change as the person improves. I.e he can start in a \"family-like\" closely monitored group, where there is a caretaker present at all times. then there are groups where the caretaker only comes in once in the evening to talk about schedules or appointements, updates a chore-list etc. The people are like room-mates at college. they have their own personal space and a shared living situation- but they have somebody to overlook it all. The last \"stage\" before real independence are if they have their own individual apartments and a caretaker comes in once or twice a week to ask if there are any problems etc.\n\nIf your fiancee gets her brother in one of those group programs HE CAN GROW. And who knows what he is capable of. He might be fine on his own one day if he isn't coddled.",
            "I am going to tell you right now\n\nI'm a father of a special needs boy, I love my kid, he's amazing, if he wasn't my son, I would not be here to cope with this\n\nYou and your wife wanna go out? Who's gonna take care of him?\n\nIf there is someone, you need to be on time, you need to keep your phone on you and be ready to leave at a moments notice because we'll a multitude of reasons\n\nBe fully aware that your life will revolve around him, making arrangements and being there for whatever reason\n\nAlso, caretaker fatigue is real, very very real\n\nIf you wanna talk about it more, amd I mean the realistic version not the fairytale version feel free to dm me",
            "Your feelings are valid, but understand so are hers and she’s going to end things if you don’t budge. No ones fault, just wasn’t meant to be if that’s how you feel.",
            "\n>He’s a very low functioning autistic, to the extent that he will need full-time supervision and care for the rest of his adult life.\n\n\n>“you won’t even notice he’s there” and that “he can really take care of himself, he just needs some supervision is all.” \n\nNope, nope,nope! A low functioning autistic person being in your care is anything but a small thing that you'll barely notice. This is a huge commitment and will define the rest of your life. It sounds like she is in some denial about her brother. Unless you are both 100% on board you will end up resenting her and if she's not 100% on board with not taking care of her brother she will end up resenting you. You two are envisioning two very different futures for your lives...",
            "Did you ask her to marry you knowing she wanted to take in her brother? If so, this is on you. \n\nIf this is a situation where she recently started wanting to do this then you need to flat out say you’re not marrying her if it means taking in her brother. You didn’t ask for that, and you have a right to say no.\n\nEven if her parents can take care of him, at some point he will have to find housing and wether it’s now or 20 years down the line  she will want to care for him. \n\nShe has a right to do this, do not marry this woman thinking she will change her mind.",
            "[deleted]",
            "Her parents won’t be alive forever. She is a good person trying to do her best and plan for the future. She is minimizing herself in order to also keep you. If you can’t handle living with her brother, you need to break up.",
            "Please look into respite care and resources available in your area! There are many options, and often the government is able to support and make things less intimidating. Also, there are many other ways this can work. For example I worked for many years as an in home aide for adults with special needs. The two women I worked for (both with significant downs syndrome) lived in their own apartment (subsidized housing) with 24 hour support. \n\nAlso these options don't have to be so black and white! Maybe you could start having her brother stay with you guys every other weekend. It might be that she is feeling very worried about her parents getting older and not being able to take care of him as they age. Starting slow might be best, both to help reassure your wife that you still want her brother to be a part of your family & want to support her parents, but also to open the door to discussion of more options. \n\nPlease look into the other options though, and remember having a child with special needs means her parents have sacrificed their entire life for him. One of the women I worked for, it was her mom's first time not having her in the house & she said, \"The first night she was gone I went to sleep so worried. Then I woke up in the morning and for the first time in 27 years I was able to think, 'what do I want to do this morning? I could get a coffee, I could go on a walk, I could turn on the tv!'\"",
            "Stand your ground and don’t budge. I am a child that grew up with a low functioning adult with mental illness in my house that my mother insisted on taking care of. It was the worst period of my parents’ relationships and I was partially robbed of my childhood because then I had to start taking care of that mentally ill person even as a child and sometimes I would enter my house and would come across an entire room dismantled. You two have absolutely no idea what you are getting into. Also, I do not want to sound accusatory but you are finishing med school and are likely to get a decent paying job. I’m 100% sure she will make you take up his expenses at some point so the argument about you not noticing him there is bull. You have no idea what you are getting into. Don’t get trapped. It never ends well. I’m sure he is great but if he moves in your relationship will deteriorate I’m warning you. I have experienced this myself. And forget having children alongside this situation. No one deserves the childhood I had.",
            "If you marry her, you will end upnas lifetime caregiver or it will end in divorce.  Know this if you choose to marry her.",
            "This is a conversation that will make or break this relationship. Someone is going to have to give if this relationship is going to continue. Either you will cave and the two of you will take him in or she will cave and other arrangements will be made. Some questions I have\n\n1) Is the “no” to taking him in a temporary answer or is this a stance you will maintain long after her parents are gone and your children have grown up?\n\n2) Are outside caretakers, care centers or the like a viable option for the two of you?\n\n3) What happens when her parents pass away?\n\n4) If you cannot reach an agreement that the two of you are happy with, where does the relationship go from there (and why was this never discussed at any point before the two of you got engaged)?\n\nYou are well within your rights to put your foot down on this subject. Many people cannot handle that level of responsibility, especially indefinitely. But understand that this will almost certainly be the deal breaker. Don’t cave and say yes if you cannot genuinely commit to the role and be a good caretaker. There’s no shame in saying “I cannot do this.” But you have to be honest yet empathetic about the situation.",
            "We don't know how old the parents are, or the status of their health. It seems like maybe she wants to have the brother established firmly with her before her parents are either too old or dead to care for him. A series of gradual transitions, as opposed to total chaotic upheaval, with the possible added blast of grief, depending on which way it goes.\n\nI highly doubt that OP and sister were very far along in the dating stage when she shared her plans for the future. Since OP reports that they spend a lot of time together and are very close, it's likely she has been pretty up front all along.\n\nThe fact of the matter is that families of people with special needs are always trying to anticipate needs and they worry about their loved one's future. The brother will require care for the rest of his life, and sooner or later it will fall to the sister to be his advocate and govern his situation. \n\n\"A is for Autism\" does a good job of presenting the type of sibling relationship that it seems these two in the OP share. Truthfully, they do a spectacular job of highlighting a lot of things without being too sappy or overly dramatic. \n\nIf she has always been instinctively responsible and sensitive to his needs, she has more than a typical sibling bond and likely there are some almost parental overtones involved. For the fur parents, think of a dog that you had to bottle feed who is now 9 years old.\n\nAnd how many people in the world broke up with someone because of something dog-related ... let's just say in the last two hours? \n\nOP doesn't have to stay in the relationship, but I think that if he wants to, he's going to have to find a way to sincerely embrace the idea of the autistic brother as part of the package. Not *be okay with* or *do it because she say I have to.* Sincerely embrace. Otherwise everyone will suffer.",
            "Realistically between medical school, residency and potential children between you, you will not have the resources to take care of someone who needs constant supervision and has no potential to become independent. Is the plan that your fiancé has for her to give up work to take care of her brother full-time? If so that’s an unfair expectation on you to financially support 3 people and work 100 hour weeks to come home to someone who needs constant care that you didn’t ask for. \n\nYour fiancé has presumably always taken care of him in the context of having her parents as back-up? Does she appreciate just how exhausting and thankless being a full-time carer is? Does she want a career? \n\nYou need to try and have an open and honest conversation about this because it sounds like a deal breaker.",
            "Spoiler: you will notice he's there.",
            "“I’m not marrying her for her family”\n\n\nLook, I get it. You’re marrying the *individual* but this individuals family is an integral part of their identity. I don’t really know what to tell you. You’re marrying *her* not-Her-*sans family*",
            "I think you need to accept that her brother is part of her package, and if you can't handle that it's not fair to keep wasting her time. \n\n\nYour fiance and her brother sound very similar to my cousins. She's very protective of her autistic brother and I can 100% see her willingly wanting to take over that role for her parents when my aunt and uncle can no longer. \n\nFor you it's a choice. To her it's her family, and the idea of *not* supporting her brother, is unthinkable. It's not even an option which explains why she gets so upset. \n\nYour finance needs someone who respects and understands that her vulnerable, autistic brother is likely going to be a higher priority to her than her future husband at times. If living with and even helping at times in being guardian to her brother is something you simply cannot do, you owe it to her to be honest. \n\n\n> I’ve taken a lot of time to consider it, and as much as I like her brother, I’m not marrying her for her family. \n\nThen you are not the right life partner for her. The fact is getting married is becoming family with that person. \n\nI get it's a big ask, but she deserves a partner in life who's ready to love her and her brother. You say you love her brother, but you don't love her brother the way she needs a life partner to love her brother.",
            "[removed]",
            "I get that you don’t want to take on this responsibility preemptively, I will say, I’m going to chime in as the oldest child with two younger siblings who both have disabilities. I have been with my boyfriend for 5 years and he has always known that when my parents are not able, I will be 100% the main caretaker of them. Whether this happens tomorrow or in 20 years for us, he understands and knows this. I feel for your fiancé and I honestly feel as though you both may be incompatible if you cannot find common ground on this. If the time span became expedited and you both needed to step in tomorrow, would you still feel this way? If yes, I think you may need to rethink this relationship.",
            "It sounds like this might be a deal breaker for her.",
            "This is a fight that will have no winner or a happy ending.",
            "OP, I'm afraid this is a fundamental incompatibility you're not going to get around. Whomever your fiancee winds up with, the brother is going to be part of a package deal. \n\nAnd I'm also guessing that her parents have been gently nudging this in her direction. (Oh he's going to be a doc, and can take better care of him! you'll be lonely when he's working, so he can live with you!)\n\nDon't marry into trouble.",
            "Be honest, is it that you don’t want to take care of him or is it that you think his parents would be a better fit? Don’t lie to yourself and to your partner. I don’t blame you if you don’t want to, I wouldn’t want to either. I just think you can’t use that as an excuse forever. She keeps bringing it up, you might have to tell her the truth and figure it out from there.",
            "You are both 24 with no real experience of taking care of your own selves in a household setting with children. \n\nI don’t think you guys are even equipped mentally and physically to care for her brother. She is really underestimating the toll it is going to take and how much her life is going to be affected by him as a low functioning autistic person.\n\nLike others have said, you guys really need a proper talk with organized points prepared. Ending with tears and I imagine frustrated outbursts is already a telltale sign of your current compatibility. If this is how you guys are going to tackle every big life problems, future is going to be a terrible environment for her brother and your kids when you have them.",
            "“I’m not marrying her for her family”\n\nIf you enter any marriage (with your current fiancé or a different one down the road) and this is your attitude, you’re going to have a bad time. ESPECIALLY if your partner is family-oriented, which it sounds like your fiancé is. \n\nLife is really long. You will get to know each other’s families really well and will spend a lot of time with both sides. If you have kids, the time you spend with each other’s family will multiply several times over.\n\nMy family drives me (and my husband) crazy sometimes. His family drives me crazy. We are both family-oriented and this compatibility has been so good because we are almost always on the same page and supportive of the other wanting to spend time with their family, even if we don’t always want to. We have a 7-month old son and the amount of time we spend with family has greatly increased since he was born (just our sets of parents during covid and now more extended family as they get vaccinated). \n\nAnyway all this to say, it seems that you view the care of her brother as a logistical problem to work out, and to her, ensuring he is well taken care of is a moral obligation that she intends to fulfill. There is no way to compromise on an issue like that, and I think you are missing how deep this topic runs for her.",
            "I mean, as soon as the parents die, where is he going?",
            "Dont get married.  Your fiancé is making it clear she will have to take care of her brother. If not now, at least when her parents pass away. You do not want to take on that responsibility. Neither of you are wrong but you should not get married.",
            "My wife has an adult (30yo) autistic sister that her parents care for. She can be left home alone for short periods of time. It’s taken a tremendous toll on her parent’s marriage. Your fiancé is eithe naive or being disingenuous when she says “you won’t notice he’s here”\n\nCold hard reality is that this is a major issue that the two of you need to resolve before marriage. She has every right to want to take over care for her brother, and you are not a bad guy for not wanting to take that on. It’s a life changing decision that should not be taken lightly and one that could put your entire relationship into question.",
            "I mean... you’re being pretty unreasonable here. You dont get to say you’re marrying her and not her family. That’s not what marriage is or has ever been for the vast majority of people and the world. She comes with the brother. She’s expressed multiple times throughout your time together this is the future she envisions for herself. If this is something you don’t want you break up with her. You don’t convince her you’re right, put your foot down, lay down the law etc... you break up because you’re incompatible. Your fiancée may not have the strength to do it because she’s feeling coerced between choosing her handicapped sibling or the person she loves so you have to be the bigger person.",
            "[deleted]",
            "It would be in your best interest to find out if her parents are discussing this with her, and if she’s already made a promise to them about it. It’s a little underhanded if she’s under intense pressure because she already made a promise and she’s not telling you.\n\nYou are both talking about a decision that doesn’t need to be made for at least another 10 to 15 years, but it seems like she’s trying to make that decision for the both of you after you graduate med school, she doesn’t get to make that decision for you both. I don’t think your fiancé has any idea how hard life‘s going to be once you have a couple kids running around and a busy schedule for you both, she’s really not putting much thought into a life you guys are trying to build, while also having a place available for her brother. There’s only so much of her to go around in that scenario.\n\nI had to make the same choice with my brother, I have two kids now, a mortgage and me and my wife work demanding jobs. I simply don’t have the time or the resources to dedicate to my brother, plus whatever decision I would make in that regard would severely affect my marriage and my ability to raise my kids in a healthy environment, every person has to make this choice for themselves.\n\nIf she’s not willing to move on this, or at least try to meet you halfway on it then you might just be wasting your time waiting for that day to come before you guys go your separate ways, she’s not going to take no for an answer and you’re not going to let it ruin your marriage so it looks like you have a conversation ahead of you.",
            "Y’all should have a long discussion about this topic to ensure that this isn’t a make or break decision before getting married. Otherwise you can draw up a prenup regarding this situation in the event that something comes up in the future.",
            "You two need to have a real conversation about this. If she is serious about wanting to one day care for her brother in the home, and you do not want that, then you two are basically at an impasse. Either one of you has to make a significant compromise on how you live your lives, or you break up and find people with whom you're more compatible. Its the same as if one person wants kid and one doesn't. Either way, someone is giving up something fundamentally life-changing.",
            "If you do not want to do it then don't. He doesn't deserve to feel like a burden and to be treated with resent if you cave in to your wife.",
            "This brother is part of the package deal. He may stay with her parents until they can’t care for him, but eventually, he will be her responsibility, whether it’s in your home or some other housing situation for him. Hopefully her parents have everything set up financially, but once they are gone he will be her responsibility. It sounds like you need to have some heart to hearts about this, and maybe a sit down with her parents so everyone is on board for plans for the future/unforeseen events. There may be other living situations that can be arranged, but her brother is always going to be a big part of her life, and you might need to think about that and talk about it more before you tie the knot.",
            "I think it’s wrong of her to ask that you take care of him along side her. That’s a huge responsibility and he has parents that have been taking care of him and still have a duty to do so. It’s true, one day they’ll die and he will need someone to care for him, but even then it’s not exactly required of you to do so. I would never agree to it and I probably wouldn’t marry her knowing that the plan would be for one day to take care of him. \n\nI know someone who dated a girl with the same request and he ended the relationship over it because he knows that it’s not the life for him. You just have to decide if that’s the life you want because one day she will probably make you choose between staying married to her and bringing her brother in or getting a divorce.",
            "It seems this is super important for her. Even if the parents can look after their son now, what if they get older and eventually die? \n\nYou might think residential care would be a great option for him, but she’ll want to provide that herself. And by then you’ll be a doctor, she’ll have a career, you may have other responsibilities (pets, house, kids, ageing family members). And her brother is low-functioning so he’ll need round the clock supervision at the very least. Not to mention he might get ailments as he gets older. \n\nHow is that gonna work practically? Or emotionally? Simple; it won’t. \n\nYou both want different things, and that’s ok. Sometimes love isn’t enough. Go look after yourself, and let her do what feels right for her. You’ll both be much happier that way. \n\nAll the best, I know this isn’t an easy choice. Stay safe & all the best for Med School",
            "I don't think you should delay on making a decision about this. It's not wrong to not want to sign up for such a huge life changing thing.",
            "Does your fiance know what her parents wishes are if and when they become incapacitated?  Have their wills and estate plans been written out?   Your fiancé needs to sit down with her parents to know what they want, and the 2 of you should talk to an estate planner and a therapist- before the wedding- to iron out what happens at the passing of her parents. \n\nYou're not marrying her brother and don't need that responsibility right away.  \n\nIf she won't talk to a therapist and an attorney, and is insistent on her brother living with you at the start of your marriage, I'd separate.  You're not a caregiver too.",
            "conversations can't really end in tears - tears are an interlude before the conversation is finished. you need to complete a conversation with her and you need to realize that her desire to live her life with her brother might make you incompatible.",
            "You are not compatible to marry if you can't agree on this big a thing for your future plans, something that will affect all aspects of your life together. Consider couples/pre-marital counseling together. And perhaps talk with her parents together about what *their* plans are, because maybe they wouldn't want what she intends.",
            "Taking care of brother may not be necessary while his parents are still capable, but agreeing to take him in at some point is probably a deal breaker for your fiancé. Decide if it’s a deal breaker for you.",
            "This is a challenging situation all around. The bottom line is that, while you may not be marrying your fiancé for her family or her brother, marrying her means you are joining her family. It sounds like her idea of what that family looks like is not compatible with yours, whether that’s in the near term future (post your residency) or in the long term future (after her parents are no longer equipped to take care of her brother).That’s something to seriously consider - talk to your fiancé seriously about this and get her thoughts. Is this a deal breaker? Will she compromise on it? Can you? The answer to these questions needs to be there before you get married.\n\nEdit: grammar.",
            "I'm sorry, but I think this one is a deal breaker for both of you. It's really common for one neuro typical sibling to take on the care of a special needs sibling when their parents start to get older, your fiance is never going to change her mind on this, and changing it for her or forcing her to choose will end in heartbreak. I would do the exact same thing in her position. \n\nIt's completely ok for you to not want to be responsible for him, but unfortunately when you marry someone you do marry their family as well. If you aren't ok with taking on her brother, even if its just in a financial capacity (to pay someone to support him) than I don't think you two are long term compatible. \n\nThis is something you need to figure out before you tie the knot, the issue won't disappear.",
            "My best friend is a social worker and her clients are developmentally disabled adults. Her biggest responsibility is finding housing for them. There are great group homes, and her clients get the dignity of being able to move out of their parental home, just like their siblings do. She finds them jobs that are appropriate for their developmental skills. So, putting him in a group home isn’t at all like putting them in a state home. Your local regional center can assist you in finding out your options.",
            "I don’t get it. Your fiancée has been very clear and up front from the beginning about her plans for her brother. You got engaged knowing those plans. Why do you feel like this is something you now get to try to talk her out of?  \n\nIf that’s not the life you want, it’s perfectly valid to end the engagement and the relationship.  What’s not valid is to act like your partner’s clearly communicated plans for the future are somehow negotiable for your convenience.",
            "Taking care of her brother sounds like a difficult, exhausting job and frankly if your partner wants to care for him that’s perfectly okay because she loves him.\n\nShe needs to be realistic and think about how that will make her life look. If she’s ready to make sacrifices once her parents can no longer care for him... great!\n\nI understand the potential impact on your life too is huge though it makes sense that you don’t want that commitment and that if you have kids of your own you want to focus on them and your fiancé. \n\nThis could be a deal breaker!",
            "You need to reconsider your feelings and be prepared to end the relationship.\n\nPeople don't really change on the big things, and I have seen many relationships fail under the false hope someone doesn't really mean it, or can change.\"\n\nHere are the three questions I think every couple considering marriage or kids without marriage should discuss and agree on before committing.\n\n1. Kids - do you want them and how many? If both people don't have the same answer this will often destroy a relationship.\n\n2. Money - Is it all pooled (Our money), or My Money and Their Money (maybe a pool for bills).\n\n3. Exiting family - If a family member, say a parent, or the case here of a brother needs extensive and likely lifetime care where does it happen. For simplification the two responses are in my/our home or at a professional facility.\n\nIMPORTANT:\nThere are no wrong answers! I am not advocating either answer in any of the 3 questions as right or better than the other.\n\n\nThe critical thing  about discussing these question is that the two partners have the same answer. If you aren't in agreement - DO NOT GET MARRIED or HAVE KIDS. The other person will not change their mind, and you will both be miserable.\n\n\nAn answer of on the fence is sometimes acceptable but both parties have to be candid and honest in the discussions.\n\nI now pronounce you happy/compatible or miserable! Good luck  and always work on communication and respect.\n\nSigned - An old dude coming up on his 30th anniversary in 2 months.\n\nP.S. Good luck!",
            "Fine if your fiancée wants to make this decision for herself. But her decision will affecting you in a major way.\n\nIt isn’t her responsibility to care full time for her brother. If she chooses to, fine. But it is far from the only option.\n\nMy middle child has learning disabilities and autism. I would not dream of expecting or asking either one of my other children to care for him. It would limit all their lives in a way that I wouldn’t want to see happen.\n\nMy son also deserves a life which isn’t living at home with me until I (hopefully!) grow old and die. He deserves opportunities, to live with peers, to do the things he can do for himself, to interact with others and to have his horizons appropriately broadened. We’ve always felt a group living situation, where he has his own room/space will be the most appropriate option for him. \n\nIf options have been explored for your fiancée’s brother and she still chooses to have him live with her, and that’s not the life you want, then no one is in the wrong. But the relationship has no future.",
            "I don’t know the degree of function he has, but, many, many disabled teens have state-arranged “jobs” and “day-care” away from home during the day, returning to their families each afternoon/evening. This often progresses into the next “grown-up” step as they become older of living in a small group home with  4 or 5 similarly-abled folks with a resident-advisor type person. These small groups become pretty bonded and familial with each other and the residents consider the arrangement as part of their next adult step, just as their siblings have moved on and away from their birth family. The biological family (possibly) lives close enough to include that person in family activities or on weekends or vacations, etc., or not, as individual as their situation may be. \nIt takes some initial getting used to, as any new change does in anyone’s life. \nIt’s possible that perhaps it doesn’t have to be an either-or situation in this case?",
            "Got a high functioning special needs kid, been exposed to low functioning ones. Unless your heart is 100% into it, don't continue with that relationship. Even a high functioning kid is HARD.",
            "I honestly don't understand why people with low-functioning family members are not more fond of group living situations for them. Especially someone this old, he's probably craving peer interactions with people similar to him, who won't judge him, and could benefit a lot from specialized care and attention. \n\n\n\n\nI would bet that your fiance is more interested in giving her parents a break than in actually having her brother one room over. Maybe suggest this? But definitely put your foot down on this. Getting married is one lifelong commitment; adopting her brother is another.",
            "I totally get you not wanting to shoulder that burden.\n\nBUT on her side, I absolutely get her loving her sibling and knowing that Mom and Dad won't be able to take care of brother forever, and that she is eventually going to take that burden on herself - and any man she is going to marry is going to need to accept that.\n\nIt's ultimately like a couple discussing marriage who are out of alignment on children.  Neither is wrong.  Both are taking legitimate stances. However, being out of alignment on that means they aren't the life-partners for each other.",
            "I have discovered that many (not all) people with younger or older siblings who have disabilities that limit their ability to take care of themselves are very protective. I understand why your fiance wants to take care of her brother. However, right now, her parents ARE more equipped to take care of her brother. However, when the time comes, you should expect your fiance to take responsibility for his care, because that is what she wants to do. If that is a problem for you, then you should consider going your separate ways.",
            "You can't compromise on something like this, one day like it or not your future wife will be caring full-time and you will get a stay or leave.. im decent but couldn't do that..",
            "You are not being unreasonable. I have a family member who has autistic twins and caring for someone with this disability is a full time job. You are both young and have your whole lives ahead of you, presumably want children of your own one day. She is not thinking rationally of the full ramifications of what she is expecting of the two of you as a couple. When you want a romantic weekend getaway or just a dinner out alone, who looks after the brother? It is not always easy for find a “babysitter” for someone with cognitive disabilities. If he gets sick, who is paying for it? If her parents are able to care for her brother, then it is their responsibility, not hers. This really could be a deal breaker.  I can’t imagine starting a marriage out with such a huge added strain and another person living in the house.",
            "In all honesty OP I understand and sympathize with both sides of this problem. I have a younger brother who is autistic, so I will have to become his primary caregiver when my parents die, something I have come to accept. I have also accepted that many potential partners will not be comfortable with this, as you are. You're not wrong for feeling as you do, however what will you do if you two do have kids and her parents had to both die before your kids are grown up or are still young? These are things you need to think about seriously BEFORE committing to marriage and having kids, because your fiance will most likely have to become his primary caregiver once her parents die, which could happen at any point of time.",
            "My sister has Down Syndrome, and I made it very clear to my now wife that she'd be living with us. It's a bond beyond understanding when you have a position of care like that. This is a conversation you should have early and often - I'm sorry this happened the way it did but I don't think she's at fault here. She has clear goals of care - my advice is to decide if you're able to assist in that care and decide if you can handle this relationship rather than her having to choose over her brother.",
            "Tough call. Of course she wants to look after her brother. But upon taking that, there goes any freedom in your life. There can be no 'Let's pick up and go somewhere romantic on a whim' because you'll always have to factor the brother in for almost every decision. Even going so far as where or what you're eating.\n\nPlus, when you're fresh out of medical school working 16 hour days, all that stress is going to be put on your future wife. And how will she deal with that.",
            "I couldn't do something like this myself, personally (just speaking for myself). Even if was really been in love with a person who had this situation who made it a condition for the relationship and life together going forward. \n\nI don't think I'm selfish. But I value freedom and my personal time too much. So I have some sense of how you feel. This just might be an irreconcilable difference.",
            "I have a severely disabled brother, who is very low functioning autistic and highly aggressive. He and my fiance are both the same age (21, only separated by a few days)\n\nI would never ask him to help.",
            "You're not going to win this one. You either marry her and her family or break it off now.",
            "I have a brother with Cerebral Palsy. He's the light of my life, and I love him so much. I've made it clear to anyone that I date that at some point in my life, when my parents can no longer care for him, I'll be taking him in and he will live with me.\n\nWe're a package deal. And something like this can easily be a deal breaker. From her perspective, that is her brother. She is very well equipped to take care of him because she's been doing it his whole life. It's second nature, and we can't imagine us NOT being there for them. \n\nOP, you are under no obligation to stay with her if you don't think you can do it. It's not easy, and you wouldn't be a bad person in my opinion. It's better to let her know now and break it off before things get more complicated. But you have to understand that people with special needs family members have different priorities and obligations in life, and some are unfortunately non-negotiable.",
            "I ended up not dating someone I really liked for this exact reason. It’s ok for that to be the breaking point. It’s not easy caring for someone with special needs especially if it’s a life long commitment.",
            "Damn, this is the toughest and saddest situation I've seen on here. Having a higher functioning autistic cousin, I see the difficulties that will arise in the future, especially if he's on the lower functioning end of the spectrum.\n\n\nLike most have said here, this is one huge unfortunate dealbreaker. My only thought would be to bring this topic up to a couples counselor - maybe even a family counselor with you, your fiance, and her parents? Then again, there still may be some hidden resentments from either party regardless of the outcome.\n\n\n Ultimately, you have to think about what YOU want. I get that you love the brother, but you have the right to not want to be an eventual full-time caretaker, especially if you want children of your own while also pursuing a career in the medical field.\n\n\nI wonder if this topic was even mentioned before becoming engaged. I wish you the best of luck and hope you two can come to a solution.",
            "I have a younger autistic brother who requires a bit of supervision as well. He’s 21 too and we’re also very close. I know exactly what your girlfriend is going through. \n\nI’ve basically always put the situation on the table at the start of most of my relationships and half of them said they were ok with him possibly being a bit more involved in the future. She shouldn’t force you, if this is an ultimatum for her you guys just aren’t the right match. Simple as that. I wouldn’t expect my partner to live with a man he isn’t really related to. \n\nAnd I think my brother should live with my parents as long as he’s able to, but I’m also not excluding the possibility he’s still gonna grow and may be able to live alone one day. I’ve noticed a lot of growth even after he turned 18. Does she even know what her brother wants or is she trying to decide what’s best for him? Cause I have that tendency too and it’s important she doesn’t forget to listen to him.",
            "I have a severely Autistic brother and I will eventually be his guardian. It's part of the package. My husband knows this and is comfortable with it. If you want to marry her, you need to understand the depth of her commitment to her brother. Prepare yourself that there is a good chance that he will eventually live with you, alongside your children. Yes, it might be \"presumably until you die.\" If you marry her, he will be a huge part of your life. That doesn't mean that the burden should fall completely on your wife- she needs to make sure she is aware of the social services that are available to her to help care for him. She does not have to take this completely on her shoulders. \n\nBut the thing that bothers me about this is that it's incredibly naive of her to assume that that removing her brother from his home and care-takers is what is right for him. Honestly, that could be extremely detrimental to him. What do her parents think about her plan? Having young children and being a caretaker to an adult with those needs is an incredible stressor. I know that I could probably not have cared for my brother when I was having my kids. She sounds really really naive. If her brother needs constant support, how will you barely notice he is there? And there are some complicated legal matters that need to be sorted out if she wants to take guardianship from her parents. Why does she want to it so soon? Is she unhappy with his care? \n\nI'm conflicted because I do get the vibe that you are uncomfortable with him living with you, but I also get the feeling that her expectations of him living with her so soon are unreasonable. I think you need to ask more specific questions about her plan for his long-term care, and find out what her parents think about all of this. Don't be dismissive, this is incredibly important to her. But you also need to figure out, are you truly OK with this? He won't be an accessory in her life, in your children's life. If her parents' circumstances change suddenly, are you willing to take him in? What if it was next week? Don't get married until you have decided on a specific plan for caring for her brother and your roles in that. But you will be part of that care-taking team if you marry her. Are you really ok with that?\n\nMy brother is a full-time commitment, but he has also enriched my life and my family's lives. He brings me and my family a lot of joy. His role in my life has brought more empathy, more compassion and tolerance to my husband and children. Care-taking is an incredible burden, but there is love and happiness too. He is an incredible commitment, but he is a vital part of who I am, who my husband fell in love with. I suspect this is true for your fiance too.",
            "I (F31) am the oldest of 4 kids, the youngest of which is a brother with Down Syndrome (24).  My husband knew from day one that there will come a point in our lives when I do become my brother’s guardian.  My husband accepted this fully - my brother is my brother, he is my blood and family and there is nothing that will ever change that.  That does not mean we will be caring for my brother immediately (he is higher functioning and is enjoying life with my parents now - he holds down two part time jobs and they travel).  But obviously that will not last forever and we are not naive to think my parents will always be fully capable of caring for him.\n\nI’m surprised that OP and his fiancé have only had this conversation a few times - her brother and the life she has had growing up with him is part of her identity, and OP cannot change that.  I’m also a little surprised at the seeming lack of empathy to the situation and the language used (not to be the language police, but her brother is a man with autism, not an autistic) - it might be a seemingly small thing but it’s important to remember that the fiancé’s brother is a human being first, and autism does not define him.  I agree with some other comments that if the OP cannot accept that there will come a time when all options will need to be on the table in terms of deciding the best care and path forward for the fiancé’s brother, this really might not be a resolvable issue.\n\nOP - your fiancé’s brother will be in your life until you or he passes - he needs to and will become your family once you get married - please try and start to view him through the eyes of your fiancé - we all make sacrifices, and as a sibling to a brother with Down Syndrome, I can tell you that she has grown up with the knowledge that her brother’s care will become her responsibility at one point or another.  That is a fact and the reality of the situation, and honestly she is going to need you to be on her team and in her court, loving and supporting both her and her brother.",
            ">I’m not marrying her for her family.\n\nLOL don't get married, dude. Certainly don't pretend you want to add to her family if you can't accept her birth family and the way *she* wants to live her life with them. When you *do* find a partner you actually want to marry? Also consider what life will be like with her/them *after the parents pass away.* I mean . . . come on, you're going to be an MD and you think this woman's parents are gonna live forever?",
            "/u/starship17 summed this up best, even IF you cut some deal where her parents care for him eventually you will just outlive the parents and you'll end up having to care for him in your later years.\n\n>I’m not marrying her for her family.\n\nNo one generally plans on that but that's just how marriages work, especially when your wife-to-be is a family oriented individual.\n\nHonestly, if her parents are still alive and healthy I feel like it's an unfair conversation to have however she isn't exactly wrong to remind you that you might eventually have to help care for her brother.\n\nTalk it out and generally just be prepared to walk away; this is another life you are talking about and compromises just end up with pain and suffering for all involved.\n\nBest case scenario, you agree in the event something happens to her parents the two of you will take on care of her brother (but be sure to fully grasp what that means).",
            "Oh hell no. That just sounds horrible!  You got to put your foot down on that one. If she can't come to terms with that then you need to move on. Even if he is the angel that she says he is having him around or going to be a huge distraction. \n\nWant to go somewhere?  Nope got to make arrangements for the brother. \n\nWant to have a little bedroom fun?  Nope the brother needs a sandwich.",
            "It's not fair that she's pushing this on you. Her brother is not your responsibility. Her brother is not even her responsibility! He is his parents' responsibility. Period. \n\nShe is failing to see your side of this, unable to think rationally about this, or to try to see from your perspective. She obviously cares a great deal about her brother that she is willing to take care of him all her life, that is awesome and admirable. But her trying to force you to agree to live with him and provide for him, who is not your family nor should you feel guilted into taking responsibility for him- that is crossing a boundary, a line.\n\nI'm sorry to say, but if she can't understand how you feel, and agree that your reasons are valid, this relationship might not work.",
            "As someone that was born on the autistic spectrum and has several disabilities...\n\nIdeally, this is a family-wide responsibility. I realize that you aren’t marrying her for her family, but you’re marrying into her family. It doesn’t make everything your responsibility, but a good partner helps distribute the burdens in each other’s lives. If you all end up living close together, I think a compromise and more communication is in order. And more than anything, prioritize health and sustainability. No one needs to be stuck and unhappy, nor handle this alone. \n\nI know how much of a burden I was before speech, behavioral, and psychological therapy. And even now I need a lot of support. But everyone deserves that for the cards they’ve been dealt in a way that’s unique to them and their loved ones.",
            "It shouldn’t be her responsibility to take care of her brother. It sounds like her parents problem.",
            "So his parents don't want to look after him until they die but want the pair of you to? Fuck no.   There is a world of difference between being involved in someone's life and being their carer, which is what she's demanding.\n\nShe has clearly been groomed to think that it's her responsibility by her parents. It's not but you will need counseling to break that programming or she will resent you.   Find a counselor, vet them first to make sure they are not \"family at all costs\", and try to work through it.  \n\nThere's assisted living and loads of options if they explore it and none of them mean you are responsible for him.  That would be a deal breaker for me. Her parents are so selfish.\n\nDo not have children until this is resolved.  You need to think about what you'll do if she insists on this. If you can't and don't want do it then you'll need to end it.",
            "I feel like it shouldn't be your responsibility. I might be an awful person but if I had a sibling with a condition like that I wouldn't want to be their carer 24/7 and raise my kids around them it'd probably scare em",
            "I think it’s important to remember that you very well could have a kid similar to your brother in law. You don’t get to choose your kids, so if your mindset is that you don’t want to have your brother in law around because of his disability, I feel like you shouldn’t have bio kids",
            "Like it or not, when you marry someone, their family becomes a part of your life",
            "[deleted]",
            "If you are not willing to accept the future she plans, then you should not have proposed.",
            "“You won’t notice he’s here” is a croc.  Why not an institution and bring him home for overnights and such?",
            "OP, please have some compassion for your fellow human. Rest is all your prerogative.",
            "When it comes time that you’re the infirmed one, I hope that your loved one’s don’t place their selfish considerations over family need. The fiancé sees her family obligation and you’re just considering how it affects you. You don’t deserve her.",
            "You’re not the right person for her, family is forever",
            "Don’t get married if you aren’t ‘marrying her for her family. ‘ which, by the way, you shouldn’t say. Also she’s crying because she terrified her parents will die and you won’t let her brother live with you. You know they are gonna die before him probably, right? If you have NO desire to EVER take care of him then leave so she can find someone else who will.",
            "> He’s a very low functioning autistic\n\nThis right her is where I stopped reading to comment. He’s a person. Not “an autistic”. We are not objects. He is a person with autism. \n\nWe don’t use functioning labels, it’s ableist. He’s a person with autism, who requires more help in his day to day life.",
            "That is a whole new level of selfishness. You are lucky to be healthy and your fiancé has a brother who needs help and assistance. You should be on the same team and care. You shouldn't try to deny her the right to take care of her family for your day to day comfort. I think you have no idea how painful it would be for her to let her brother just to please her selfish husband.\n\nYou should really reconsider. Life is hard sometime but here, you are being the bad guy.",
            "\nNobody ever signs up for any of this but from the fiance's point of view who else is going to do this.  I think you're lucky to have such a compassionate, responsible and loving fiance who care so much about her brother.\nIt may be the parents responsibility to do so but your fiance cares about the parents to give them a break and she just simply loves the brother a lot.  \n\nRegardless what you may think , you are actually marrying her for her family.   Even if you can afford it she absolutely will not just leave her brother in some sort of private group home when the parents are gone.  Who else would care for the brother and how could she just leave him with strangers.  Think about this from her point of view.    She cares and loves her brother and if you aren't on board with that then this is not going to end well.  You may not think it's fair but it's not a matter of fair.  I would imagine if you asked her the same thing then she would absolutely do it for you.  This is not about whether you're right or wrong.  This is about whether you are willing to accept this situation for the rest of your life and not think of it as a burden.",
            "Honestly her parents will not be able to take care of him probably for as long as he'll live so he'll have to be with her. There's so many horror stories of what happens in places that take care of special needs people. I honestly think you're being selfish. I'm not a family person and in most cases I'd agree with you but this is a very sensitive situation that needs compassion.",
            "If you're not willing to look after someone with that condition are you ready to have kids? They could need similar amounts of care for a similar amount of time",
            "\nOh my dude.\n\nWe have to change frames.\n\nYes, there is nothing wrong with not married into  family stuffs...it can be complicated\n\nWhat if he's the family, and your the responsibility.\n- check yourself dude. Money does provide...on paper. Community!, you're really missing out\n\n\nYou don't want those words engraved into the epitaph... \" thank God throwawayforRA didn't care a out our brother, what a smart husband\"\n\nYou might be surprised to find out that a bit of compassion and giving might improve your quality of life, I know counter intuitive.\n\n But it's true",
            "As the brother of a child with special needs, there's a lot more to it than just \"needing some supervision\". Can he cook for himself? Will he be able to properly take care of his own hygiene? What routines must be changed to accommodate his?\n\nI sympathize with her for having the heart to want to bring him in, but there's a lot more to caring for him. The problem is she's grown up with him, and has adjusted her entire life in accordance with his needs and necessities. She's had all 21 years to do so, whereas you have had far less.\n\nShe needs to understand the dynamic she has with her brother, and the dynamic her parents have with him. On the surface level, her idea sounds great: bring him in, he can just take care of himself, you won't ever know he's there. But how do you make sure he isn't lighting the stove and leaving it? Leaving the house and getting lost? Getting into things he shouldn't? If you just pretend he's not there, are you really \"taking care of him\"?\n\nHer heart is in the right place, your mind is too. I'd talk with her parents, get a feel for their experience, and how they feel about all this. She also needs to talk with them and get an understanding of just how big of a change this will be.",
            "This isn't a negotiable issue, unfortunately. No matter what the end decision would be, someone would end up resentful.\n\nI know a family with a very similar situation. I was friends with one of the parents. They were blunt about having raised the older NT kid to take care of the younger ND kid. I called them out on it, and explained that was unfair, but we lost contact years ago, so I don't know how that ended up.\n\nPoint being, this might be something that your fiancee has been raised to believe is absolutely her responsibility. She may well not be able to consider any other options.\n\nAs with the decision to have children or not, this is one of those issues that can't be compromised on. It's a deal breaker.",
            "you're young. just break up. sorry.",
            "I get where you’re coming from and no your NTA for not wanting to care for him it is a big responsibility after all and not to be rude but you didn’t sign up for that",
            "No one is in the wrong here but I think you guys are incompatible",
            "How’s the relationship between the brother and the parents? I’ve heard of parents resenting their children who have disabilities, as it is stressful long situation to deal with",
            "It’s totally ok for her to be willing to take care of her brother. \n\nIt’s totally ok for you to not want to. \n\nWhat this means, is that you are incompatible on a fundamental level. No one is to blame.",
            "I'm sorry this will sting, but You both are very naive to have gotten engaged without discussing all this in depth already. This is not a minor issue that can be sweeped under the rug. \n\n1. She is lying to herself when she says that you won't even \"notice\" that he's there. She is undermining the level of effort it will take for both of you to manage kids as is, + having more dependants on the way. It could be that being overly optimistic is her way of dealing with situations one can't avoid. \n\n2. You need to read up about the struggles of a person with dependant siblings. Please understand that even though her parents are capable of taking care of her brother, the dependant sibling will outlive the parents. So you will have to take the responsibility later than sooner. Are you even ready for it?\n\n3. Marriage means sharing responsibilities, those responsibilities include family. How much did you guys understand about the meaning of marriage before thinking of this commitment? You seem to lack communication, which usually makes the pillar of relationships. \n\nBest of luck OP.",
            "Go easy on her. It’s great that she feels such a strong sense of responsibility over him. She’s showing signs of being an incredibly dedicated mother. She’s a great person to have by your side for life. My older sister couldn’t give a shit about what happens to me and has denied helping me many times when I’ve been really desperate. Having a family that takes care of you is priceless. No doubt she will take care of you too when you need it. \nThink about it pragmatically and logically: \n\n1.) someone needs to care for this lovely boy for his whole life. Currently the parents do and they seem perfectly fine and capable \n\n2.) at some point they will not be able to anymore \n\n3.) two options exist and that is A.) a care company taking over in which he can be well taken care of and happy OR B.) a younger family member (your partner) will take over \n\nShe is battling with herself because she feels such a strong responsibility over him. That is a good thing, but a hard thing... and a place where her partner needs to be and support her through it. She may need to release herself of some of the responsibility and accept that he may need to go into care and that’s okay. \n\nAn open, supportive and honest conversation needs to be had with the whole family.",
            "This should’ve been discussed & planned out before an engagement in my opinion. My partners brother has CP and by our 3rd date he had explained the severity of his brothers CP & that he, meaning we if we ended up together, would be taking care of him at some point. And I loved that he was so up front about it because it was a deal breaker for him. \n\nSo it’s strange to me that this wasn’t something she brought up before an engagement because that’s a huge ask of someone especially someone who didn’t grow up with that. I wonder if she assumed since you’re in med school, you wouldn’t mind it? \n\nIf having him live with you for a long period of time or at all is an issue, this needs to be addressed & planned out, and agreed upon now before any “I dos” are said. Neither of you should sign up for a life where you’re not stoked about & if you’re not stoked about having her brother in the house & if she won’t be stoked not having him in the house, then I don’t see how that relationship will survive for very long.",
            "[removed]",
            "As someone with a special needs brother, I could never in a thousand years imagine taking care of him and expecting my fiancé to do the same.",
            "You guys probably shouldn't get married. At some point her parents will die and she will feel like she should assume the role of caregiver. Then what? Divorce?",
            "Why not reach a compromise where he comes over a few times a week but goes home each night?  She may feel like, growing up, she was his emotional support and he was hers and is having trouble without him.  Therapy might her understand.",
            "NTA\nTaking care of him will be a tall order. This isn't your responsibility, or hers. You both have your own lives to live. If you do this, you'll be doing it for the rest of your lives. Her heart's in the right place, but it may not be what's right, for either you two, or him. Maybe when their parents die, but right now, it's best he remains with his parents. \n\nI don't know the full details on everything, like if you've explained fully your discomfort at this idea, but if you haven't, you really need to tell her. If it's hard to talk to her about this, write a letter, fully detailing your reasons why. \n\nI myself have a brother with down syndrome, who will need a guardian once my parents die. I kind of understand the situation she's in, but in the end, it takes two yess and on no to make a decision on this.",
            "\"My fiancé and I have talked about this a few times, and it always ends with her angry and crying\" is this not a problem itself? have you consider seeing a therapist to work on it before talking of getting married or getting married?",
            "Once you let autistic kid live in the house you can never go back. Knowing what you said now, I'd say no now or leave. If it was me I'd say no or leave. Probably leave, because she'll stay with you and resent you. She could probably find someone else okay with autistic kid in the home and you could find someone with no autistic kid. Remember, seven billion people.",
            "Tell her you can take care of him when her parents can't take care of him in the future .you are  still young and many responsibilities are on your way such as taking care of your future children and many other things.  I am sure by the time her parents aren't able to take care of her brother you guys are mature and settled enough to take care of him .",
            "Why does she want to take care of him if he has two healthy parents, did you ask her? What’s her thinking behind it? Eventually she probably will be his caregiver. If tables were turned and it was your autistic brother/sister, what would you be asking from your fiancé on that subject?  it might sound harsh but there is a possibility that you might need to change a fiancé as your some core values are different. Just imho\n\nOne thing I’ll add is that let you and your fiancé to experiment this experience be taking care of the brother so that you know from firsthand experience what you discussing (maybe moving in taking care of him while parents on vacation)",
            "You have to talk about this and arrive at an agreement. Otherwise, you and her will feel trapped",
            "I think you guys are screwed.\n\nYou’ll be working weeks up to 100 hours, and you 100% will have to come home and provide care to children/brother.\n\nPlenty of STAHMs find just one single child overwhelming. It’s almost certain your fiancé will need significant help around the home with a child and dependent brother.\n\nYou could be facing a 40 hour workload at home on top of work weeks 80+ hours. That type workload will drive you and your relationship into the ground.\n\nI’d look into a live in caregiver, and the pros and cons of that. I believe that’s the only viable compromise you can make in this situation.\n\nOtherwise, the burden of a residents workload, infant and an adult dependent could see you logging hours that could legitimately destroy your health.",
            "The parents aren't going to be capable of doing it forever. Then what?",
            "So what's her plan? You get married, she quits her job, her brother moves in, she will be the primary care provider for the next 40 years (or how long he will leave), you will be the bread winner for 3 adults and maybe some children?\n\nAs most of the people said, this is a deal-breaker if this is not what you want for your family.",
            "Ok, so you’ve had a lot of advice but I’m going to say this seems like a deal breaker but one you need to really talk through with your partner first.\n\nYou say that the BIL is “low functioning”  (not the terms we use any more but, I get you) but maybe worth working out exactly what him living with you would mean. Autistic needs aren’t really as clear cut as high/low functioning, and even is he is non verbal, doesn’t necessarily mean he’d need a lot of day to day care. I work with autistic kids and I’m not sure I could say any of them are the same in their needs. \n\nIt sounds like your partner is really set on him living with you, and parents won’t be around forever to do it. So I think it’s worth you knowing exactly what taking care of him means first and talking to her parents about what their plans are. It might be completely workable situation, or it might be beyond what you want in your life. But now is the time to find out and make a decision whether this relationship can continue.",
            "There is a reason she wants him to move in with her, and there is a reason you don't. You haven't given us any clue as to what those reasons are.\n\nWhy are you refusing? Is it because you feel that you wouldn't have a nuclear family? Or that he is too weird to be socializing your own kids? You say you are not equipped, but this sounds like an excuse. She grew up with him and surely is equipped. \n\nWhy does she want to take over his care? Is it because she comes from a culture with a strong sense of family responsibility? Is it that she wants to alleviate her parents' stress? Is it because she knows her parents will not be able to look after him forever and that that day may be soon? How is their health?\n\nI wouldn't dig your heels in over this unless you want to lose her. Especially if she comes from a minority community with a strong sense of filial responsibility. It sounds like family is important to her and you may not win if she feels forced into a loyalty conflict between the people who gave her life and care, and a guy who refuses to understand that. She is young enough to find another man. :) And if she were writing the post, zi would probably encourage her to do so as you clearly don't share her values or want to compromise.",
            "This should be a deal-breaker. If you take care of a low-functioning adult then your future kids will suffer for it. Because that takes up a full time job. Meaning that your sister will be taking care of him 24/7, she can't work a regular job next to that. So besides the loss of income who is going to go full for the kids?\n\nHonestly it seems entirely unrealistic to me that you two can take proper care of brother..",
            "You already know that no matter What, Even if her parents die one Day, You will most likely \"Inherit\" the bro.  She won't let up on it.  As he grows Older, His situation will probably change where he will need more help.  Might I\\* suggest then he go into Assisted Living or somewhere where they know best how to help him. If this is not for You, I'd think twice about being with her until \"Death Do You Part.\"  The Tears and Fears don't end.",
            "This would be a massive commitment to take on and it is the kind of thing where both people involved would need to be fully onboard.\n\nI would hope she might be able to understand why you might want to start your married life with just the two of you at the very least.",
            "This isn't something she's going to budge on dude.",
            "You're too young to deal with something like this for the rest of your life. This is a total deal breaker.",
            "Walk away. \nThis is a deal breaker issue without any solution",
            "I'm struggling to find compromise here. Taking care of a disabled person is not the walk in the park she's claiming it to be. If you wouldn't notice he's there, he would be able to live on his own but the truth is, he can't. You might just be incompatible.",
            "You can find a happy medium within this, you can have her brother on certain days within the week or maybe just weekends every 2 or so weeks, this allows her to have him around and have her time with him and gives you a chance to spend time with him and change her mind on the way you are with him.",
            "I really do feel terrible for you. I would never be able to take this on, and it seems you feel the same way. If you do have kids, they’ll grow up and leave, and you two will have your life together. \n\nThat all changes if the brother is there. \n\nYou married her, as you said. Stick to your guns or you will be miserable",
            "Your fiancé has made her position very clear, and whilst it likely doesn’t feel this way now, this is the greatest gift she could possibly give you. She’s giving you the chance to walk away before you are married, or have children, or are any more entangled than you are already.\n\nIt is absolutely fine for her to want to take on the care of her brother. It is absolutely fine for you NOT to want this. It is absolutely fine - and, I believe necessary - for this to be a relationship-ending matter.",
            "Why does she want to take him on if he’s completely fine living with the parents ?",
            "Talk with her parents",
            "So I have an autistic brother. With my husband I was always adamant he realize that there is going to be a day when my parents might be too old and or die and my brother will be my responsibility.  Shes preparing you for the inevitable.  Their parents can take care of him now, but not forever.  My parents have informed me they will attempt to have him set up financially but he's always going to need help,  he's going to always need someone to care for him and that might mean living with me and even if we found him housing, I'd still need to check on him to make sure he's OK.\n\nThat's the reality for your fiance.  Parents rarely outlive their kids. \n\nShe's being proactive and being her brother she feels it's her responsibility to take care of him. That's normal for this situation.",
            "Autistic folks require set schedules, and things need to be done a certain way. It’s not much farther beyond special needs as much as your life will revolve around them. It’s not simple to move him, and uproot his home foot path and set of ways he has come to rely on. That might prove too much change.",
            "If you’re sure you don’t want to live with your fiancé’s brother it sounds like you should reconsider marrying her.",
            "He should continue to live with your parents for now, but depending on the state, you may receive a stipend for being a paid caregiver. It's likely that her parents will outlive him, and having worked in group homes for adults with developmental disabilities, they can definitely vary in quality, but he'd likely be happier with your family. If he's not aggressive, seriously reconsider your fiance's request in the future.",
            "A group home isn’t a bad thing especially when family is involved. It is something to discuss.",
            "There are many great answers here already. My take is that your Fiancé might not have thought this situation out detailed enough. If you want children - how will her brother cope with screaming babys and toddlers not respecting his personal space and the noise they will make. I know such things can be very problematic for autistic people. Maybe you could talk about taking him later (with older kids) into the picture as there seems to be no emergency right now anyways.",
            "OP I am so sorry top tell you this, but YOU MARRY THE FAMILY. If you don't want this to happen you may want to move on because sooner or later it will. No amount of speaking up or putting your foot down will stop this from happening.",
            "I'll echo everything above. It's cool for her to want to look after him..but does that mean you should have to? Not really..it's definitely something you need resolving before going any further. If it's a package deal and you don't agree walk away dude. Noone would think less of you whatsoever",
            "She has made it pretty clear, to the point of showing extreme emotional distress, that she and her brother are a package deal. I’m not sure why you’re not hearing her, but I think it’s highly likely she would choose him over you in any case. So you either need to find a way to accept it, or separate.",
            "OP I have an autistic brother too, if my parents got too old to take of him I know I would step in straightaway. I'd make sure my future husband/partner would know my stance on this, it would be part of the package if your marrying me. I can't budge on it. \n\nYou either need to compromise or leave the relationship.",
            "It seems you are your fiancé are doing well together.  Enjoy your current situation.  Future life will take care of itself and we often find ssome of the things we are thinking about in the future don’t even take place or no longer are an issue.",
            "Her parents are (hopefully) going to outlive you, your fiancé, and her brother. He may not need to live with her tomorrow, but he will someday. If you can’t support that, you two are incompatible and you should allow her to marry someone who understands that this is not negotiable for her.\n\nYour point about not marrying her for her family is naive. When you marry a woman who already has children, you’re not just marrying her. You’re taking on the additional responsibility, expense, and duties that come along with her existing family. This is the same concept. You are marrying someone who comes with a disabled brother who she will be providing care and supervision for. If you can’t accept this responsibility, expense, and accompanying duties, you shouldn’t be getting married. She has been explicitly clear that this is a package deal, you just aren’t listening.",
            "I'm not sure how you two have gotten so far into this relationship without coming to an agreement over this topic. You say you are not marrying her for her family, but you are marrying into her family. With that comes new responsibilities, including caring for her brother should he need it one day.\n\nHer parents won't be around forever and the brother will need care. Where is he suppose to go? You're asking your fiance to walk away from her brother. Would you have such a cavalier attitude if the roles were reversed? I'm not saying you're wrong; it is an extraordinary commitment to care for someone with special needs. If that isn't something you think you can do, are prepared to do, or want to do, the two of you need to sit and seriously and honestly discuss your future. If either of you are unwilling to change positions (again, not that either of you are wrong), then it may be best to part ways.\n\nBest of luck.",
            "I honestly think this is a conversation you not only need to have with each other, but a conversation with him and with their parents. If he wants to stay with his parents, and his parents want to have him and continue to care for him as long as he possibly can, then she shouldn't be making the decision for him to have him move in with you guys. But then you do need to keep in mind someday, maybe not now, maybe in 5 years, maybe in 20, their parents will die and he will need a place to stay, and that likely may be with his sister. It's understandable about not wanting it now, especially if you plan to have children they are a handful as is, but sometime in the future it may be inevitable. You either need to accept this or it will not work.",
            "Well, the compromise here would be letting her parents mind him for as long as they feasibly can. But one day he will go into her care. Are you ok with that. You're not marrying her for her family but she comes with family. That's not optional. If you can't see yourself ever being ok with it then maybe she's not for you. This doesn't have to happen immediately but it will happen.",
            "Go to therapy before this goes any farther. Let an unbiased 3rd party explain to your SO that while she may have grown up with him you haven’t. She also had her parents there to do the really hard stuff for him. I think she needs a reality check.",
            "you guys should not get married. I think people on here are so quick t say that, but this is life altering, she will resent you for not letting her have her brother around, and you will resent her if she does bring him around, this is not a problem that is going to go away. WHat if something happens to her parents, are you going to insist she puts him in a home? No marriage can survive that.",
            "Her parents aren’t going to live forever...",
            "Unless she is a trained professional with a written care plan, able to assess his needs, his wants, and able to reassess and replan regularly, her brother would be best in a professional care setting. People are so determined to keep their children at home, they never think about what’s actually best for the grown adult who has potential they won’t reach without appropriate support.",
            "Maybe you could look for a home with an in-law suite and hire a caregiver. That way you all win. You can have your own life while respecting her wishes. She can visit any time she likes without it stressing you both out.",
            "Her heart is on the right place but she might not understand that to bring him into your living situation she would be diminishing everyone's quality of life to stick to her plan.  How do her parents feel about her plan?\n\nHe is already all set with her parents and changing that routine will very likely negatively impact his happiness.  \n\nYour future children will not get the mom and dad's full attention not to mention what incidents could come up dealing with someone on the more severe side of the spectrum and small children.  This can negatively impact their lives.\n\nEven if you already live with your fiance there is a time after getting married that you need to adjust and get use to your new status.  You want to focus on that relationship completely until you feel its at point when you even want to think about kids let alone a full grown adult that needs supervision.\n\nHow about this?  You talk to her and explain that you will be up to taking her brother when the time comes and it's the best option for everyone involved.  Make sure that you have a place for him and that he can come over whenever she wants and even stay for sleepovers.  Tell her that even well established marriages can struggle when having an autistic child themselves and you want to make sure you guys are as close to 100% as you can be as a family before testing it against something as huge as this.\n\nI think for both of you having him over and having sleepovers will help you guys make a decision one way or another when the time comes.",
            "I’ve had relationships fall apart because I had to take care of my disabled (bipolar/borderline/schizo) parent. My partners didn’t want to deal with it.\n\nYou’re only 24. Do you want that burden?\n\nYour fiancée has some major thinking to do about her future, as much as she loves him. It’s a very tough situation.",
            "Can you try a few trial runs? Take him for a couple long weekends? I'm sure she sees the toll it takes on her parents and wants to help. Maybe then you can decide if this something you're willing to do long term.\n\nI had a brother I was willing to put the rest of my life on hold for to take care of and I did for 5 years. He passed away but I wasn't willing to bring anyone else into the picture because I didn't want them to end up resenting me. Now I'm starting over at 34 but I'm never going to let anyone into my life if they can't handle the fact I will have to take care of my parents one day because they drained their savings and retirement to help my brother.",
            "taking care of regular children is already hard, why make it harder by adding another person who requires help and supervision when he already has people taking care of him?\n\nAlso, wouldn't it be nice for the autistic brother to live independently eventually? There are housing project with supervisors for people like him. Who function well, but not well enough to take care of everything themselves.",
            "I have to say personally i agree with you. You're in med school and becoming a doctor. As a healthcare worker myself (Registered Nurse) i know how hard it is to care for people who need full time care. It can be physically and mentally draining to come home and have to do that after you've done it at work all day. She should listen to your perspective as well, instead of it being her way or nothing. Especially since her parents have been taking care of them his whole life. They should continue to do so unless they become physically unable. But even then, you have made it clear you don't wanna do it. Even if y'all love each other, this will cause so much resentment for whoever compromises. Might be a deal breaker for marriage unfortunately.",
            "Neither of you are wrong but don’t agree to anything you’re not 100% ok with otherwise the resentment will destroy you. It may be a fundamental incompatibility",
            "If you can't handle it then set her free.  As you note, she and her brother are close.  Blood comes first for many people from loving families, which you know.",
            "How have you two not dealt with this before? You do realize her parents are going to die before her brother, then what? You two simply want different lives and both are refusing to see this for what it is. This is not a \"compromise\" issue, there is no convincing the other side.",
            "Tell her, Maybe in the event that her parents become unable to care for him way into the future you could possibly consider it,, but until that day comes you can compromise and maybe take him for one weekend a month, but the topic of future children together should not and must not involve her brother, he is not your child and has no relevance to discussion, talks of creating your own family are about you and her alone. Having a worst case scenario plan in place so it's possible to take him in if absolutely necessary is a big compromise on your behalf and she either needs to accept those terms or make a decision.",
            "I’m sorry but she acts like he wouldn’t be any work or be noticed. Even a person that doesn’t have special needs makes a big impact on your relationship and household. She hasn’t taken care of him on her own yet. You will be working crazy hours once you get your first job. If you have children it will be even harder. Can you live close to her parents so you can see him multiple times a week and he could visit in certain days. Why does she think she has to take over for her parents and why now? Are they struggling to do so because of their age?  Also, an autistic individual finds comfort in a set schedule will she be able to continually provide that for him especially if you are working many hours? Does she plan on being home as not  working to care for him?",
            "It's not on to expect such a sacrifice from you. \n\nIt IS very difficult looking after someone who is disabled and more so if low functioning.\n\nThat cannot be overstated.\n\nIt's a very big deal. \n\nI am disabled and need a lot of support, my ex partner of 14 years did so but it didn't make our relationship either as partners or his being my carer any easier. \n\nWe ended up as little more than angry resentful house mates. \n\nEven if you got carers,encouraged the brother to learn how to be a bit more independent and made sure that you had all of his appointments and medical information and meds down to the T, it is a lot, and of all three of you will grow older. \n\nAnd would your potential children come first, last or nowhere at all? \n\nThey remember their childhood..",
            "Get on board or leave. You **are** marrying her family, that's part of what marriage is.",
            "If one person isn't fully on board it's a no go. It will destroy the marriage.  Your honesty is commendable and I hope she can appreciate that.",
            "You need to have a serious conversation with your SO, because this isn't something you can compromise on and you shouldn't get married yet. \n\nIt is a tough situation because I see both sides. But ultimately, you know what you can live with and if you can't handle her brother, you shouldn't have to. Likewise if she feels like she needs to care for him, then she needs to do that. Ultimately this is going to end with either you agreeing to pay for care for him in a home, or you splitting up\n\nIt is a tough conversation. My SO has siblings and due to an issue it was a possibility they may have been put in foster care temporarily, or family could take them. I had to sit down with him and explain that I love him but under no circumstances would be willing to take in his siblings. It was tough because essentially it was either he agrees or we split. And you can't force your SO into agreeing with you, she has to come to that conclusion on her own",
            "I think it's important to look at what you fiance wants for future self.  Does she want to have a career outside of the home, or does she want to be a SAHW/M?  Because I'm assuming that you want to be a doctor or surgeon, which would mean many long hours, with her taking care of the kids and the house and the brother by herself, or with some hired help if that's an option.  You can try the argument that just because her brother is housed in a group home where he can be taken care of doesn't mean she/you love him any less, but if she's dead set on this being the rest of her life, then the two of you are unfortunately very incompatible and it's time to move on.",
            "You're going to be a doctor... what's your evaluation of how much care he will need?\n\nAlso, you're going to make a lot of money. I don't have experience with low functioning autism, but I'm guessing you will be able to afford an in-home nurse or caregiver. \n\nYou will also have enough money to get a house that will help facilitate this kind of care. \n\nMy BIL is a doctor and his parents live with them. Of course, they are part of the family, but he and my sister built a little wing in their house with its own washer dryer, kitchen area, bedroom, bathroom and a living room, so his parents can choose to hang out with the larger family or relax in their own area. \n\nYou could build him a similar little wing and with a bedroom for the in-home caregiver with her own kitchen, bathroom, living room and laundry--and with a bedroom, bathroom and living room for your future BIL, as well. My advice isn't to ostracize him to a corner of the house and act like he's not there, btw. I'm saying you can make him part of the family while creating accommodations and space for everyone involved. \n\nYour future salary gives you a lot of options that are not available to the average person.  If you want to stay with your fiance, I think you should consider solutions and start planning for them financially.",
            "Hey, your “if we decide to have them” comment about kids is something you’re gonna want to figure out now. Before you get married. Like that and this thing with her brother both need to be dead and buried before you get married. \n\nIt’s ok if you, or she doesn’t want to have kids. I’m r/childfree but there are other subs like r/fencesitter Thing is, this isn’t gonna go away and it might not just be ok. People get divorced all the time because one wanted kids and the other didn’t. Best case is that you’re both on the same page but if you’re not it’s best to find out before you do the ceremony and paperwork.",
            "I don't want to sound rude but this seems like a pretty cut and dry situation to me? You want different things, there's no reasonable compromise. You don't need our permission to break up with your fiancée. Seems you just need to actually make the decision and deal with the consequences, whichever you decide to do.",
            "Think carefully about if you want that to be your life",
            "So, I’m going to answer as someone who is destined to take care of their adult sibling with autism. He stays with me a week out of every month so far. \n\nI’m sorry that this wasn’t something that was brought up earlier. I’m not in anyway implying your spouse is a bad person but this is extremely important and a huge thing to leave until you are about to get married. \n\nHowever, she is not wrong. This is the reality of being with someone who has siblings with autism. Yes, they can be taken care of by the state to some degree. Will it be a comfortable life? To an extent. Depends where you live. A lot of places provide the bare minimum and I’ve seen people who should have full time supervision walking around town on their own, getting robbed and/or abused. They could go to a care home and that could be fine, to an extent. Again, depends on the care home. There is lots of abuse that goes on in care homes or home shares. People like to pretend it doesn’t exist, but it does and it’s actually a huge issue. It’s easy to be abusive to lower functioning individuals. It happens all the time. These are the things your fiancé is probably worried about. These are the things I think about a lot. She wants to *know* that he is safe. \n\nThe thing is, when you have been a “care giver”/older sibling to someone like this it takes a huge chunk of you. You will worry almost as if you are the parents. You take on this weight like a mountain in your heart and you come to the understanding that you are simply the person who will need to step up, without question. This may seem weird to a lot of people and yeah, it may NOT be our responsibility but we deeply feel it is. You couldn’t convince us otherwise. \n\n(Note: I understand not literally everybody feels this way about their siblings but it’s common.)\n\nYou are going to have to make a tough choice because acting in any way like you can tell her no or like this isn’t going to happen regardless of you isn’t going to work. You will wreck your relationship in a way you’ll never fix and from the sounds of it, you’ve already started going down that path. \n\nNeither of you are wrong but neither of you are the final decision either in this when it comes to this relationship. This is simply and only a break up for good or decide to go for it situation. I wish the best for you, your fiancé and her brother.",
            "One thing you will have to come to terms with is she will have to be his care giver after they are gone/can’t because I am sure she is not going to want to put him in a home. \n\nI could see your frustration from her wanting to push it so early on At least that’s what I am getting out of it but maybe you should just talk to her. Tell her you’re not ready to take on that next obstacle yet but you are willing to talk about taking care of him if no one else can.",
            "It's sad but you know what will happen when her parents are older and unable to care for him. Or God forbid something happens to them.\n\nI understand that you love her and want to be with her but man, med school, a family and a romantic relationship with your wife will already take more than all of your time. A special needs adult is A LOT to add.",
            "\"I'm not marrying her for her family\" is a huge red flag for me. It's not about what her family wants it's about what she wants",
            "All I can say is relationships have ended over a lot less, and most relationships do end. I wouldn’t compromise on something like this because if you do, it will make you miserable and you’ll start to resent your fiancé/wife. It will cause fights and she’ll just see you as the problem because “you agreed to it in the first place”. Cut the cord and move on, you’re only 24 man. Still got so many years to find someone who doesn’t come with this huge baggage.",
            "My siblings were normal kids but I still took over a large portion of their care once I turned 18, (they were all much younger) and I made it perfectly clear that if there was ever a point where I had to choose between my siblings or a lover it'd be the lover who would be kicked to the door. Even though it hurt I had to make that choice a few times over the years but as far as I was concerned it *wasn't there fault they were born.* I on the other hand *could* choose what I wanted to do.\n\nI don't think either of you are at fault, but honestly it sounds like your incompatible. Maybe you guys could work out a compromise that once parents start to get older he can come permantly and until then a guest room can be created to visit whenever and have mini vacations with you guys or maybe not. Either way it sounds like this is something that can't be ignored and needs to be seriously addressed, since one of you will be massively unhappy with the results.",
            "You aren’t compatible.  Full stop.\n\nShe’s planning ahead.  Eventually the parents will die and he will need care, falling on her.  And she accepts that.  If you can’t accept that this is not the woman to spend your life with.\n\nJust gonna say it’s a pretty shit attitude to say you “aren’t marrying her family”.  She loves these people!  They are part of her life and you knew this the *entire time* you dated! \nI suggest only dating people estranged from their families moving forward.",
            " I have a mentally challenged brother so I somewhat understand the situation. You two need to talk and see if either or both of you can or cannot compromise and on what in DETAIL. Seriously, both of you need to lay out clear expectations as to what kind of life you're getting into if you do decide do move forward.\n\nThis isn't meant as suggestion, it's just an example to illustrate my point. If she where to compromise on not living with her brother but living near him and caring for him (maybe having him over a lot) and you compromise with that limitation on how and where you can live then you two would have to plan that out and have clear boundaries and expectations for each other's role as far as time commitments and living arrangements. \n\nIf neither of you are willing to compromise then you shouldn't force it, it's understandable from both sides that this issue can be non-negotiable. Whatever you do it's important to not leave anything vague, and since her parents are part of the equation it would be wise to involve them as far as well.",
            "There has to be some compromise here. That compromise will no doubt involve him living with you at some point but what you might be able to control is when he does, not if he does.",
            "NAH\n\nThis is the kind of fundamental incompatibility that means you shouldn't get married.  Period.\n\nYou should gently tell your fiancee, \"I've given it a lot of thought and, unfortunately, I don't believe I'll ever be okay with having us be responsible for your brother's care insomuch as having him live in our house full-time.  I know that's something that's important to you.  I think we need to have a discussion so we can come to a compromise before we get married.\"\n\n(IMO, a reasonable compromise might be to help support BIL while he lives in a group home nearby and visit/have him visit often.)",
            "Has she even talked to her parents about taking in her brother soon? It feels like she has just made this decision without talking to anyone or really even thinking it through. You don't just take kids from their parents because you might have to take care of them one day. Maybe you should talk to her parents so they can shut this down.",
            "Have you two had a conversation with her parents? This reads more like this is something she wants to do but as parents they probably have already planned for this. I would sit down with them and explain your fiancées desire to take care of him but before you discuss it further wanted to know if they had a plan and what their expectations are.",
            "This would be a deal breaker for me if this was something she insisted on. If he's low-functioning, then he likely cannot, in fact, \"take care of himself\" and you will, in fact notice him there--that's why he needs supervision. \n\nI think she is downplaying how much work and effort it is going to require and, although this may sound mean, it's not your responsibility. I don't blame her for wanting to be sure her brother is well taken care of, but unless you are enthusiastic about doing so, then the answer has to be no and she can decide whether/how to proceed. \n\nPersonally, I don't see any legitimate reason why he should live with you. He's a human being, not a house cat your fiancee can just schlep around whenever her life circumstances change. If his parents treat him well, provide for him, and give him a stable, healthy, clean, environment, then why mess that up? If you want to have kids, how would loud, noisy, dirty, screaming kids impact a low-functioning person with autism? I don't imagine the (normal) chaos that children invite would be particularly good for a person with autism. If he, for example, doesn't like to be touched, how would it be for him to live in an environment with small children who don't understand personal boundaries? It just seems like it would be so disruptive for him, having lived his life with the way his parents do things, to suddenly having to conform to a new house, new sets of rules, new expectations, new environment, new people, etc. It makes me wonder whether your fiancee even thought about what it would be like for her brother or whether she's a little too self absorbed. \n\nMaybe your fiancee is just worried about not being able to see him as often as she does now, in which case the answer is not to move him in with you, but for her to make a greater effort to see him. I don't know how old her parents are, but if yall are in your 20's they can't be that old, so maybe in 30-40 years him living with you can be revisited if her parents are no longer able to care for him.",
            "bro my brother is autistic, this is 100% a conversation you have with your SO before you get engaged. She has been extremely up front about her brothers needs so you have known what you're signing up for. This isn't something that's gonna get better or go away if you ignore it. Eventually her parents are gonna pass on.",
            "this is up to you\n\nif its a dealbreaker leave\n\nif its not a dealbreaker and youre prepared to take care of her brother for the rest of your life then stay",
            "Your in laws are going to die someday, then what?\n\nSounds like you should reconsider this marriage.",
            "Has she actually asked her brother if he would want to? I mean, he's autistic and presumably doesn't really want to completely change everything about his life - that's a huge expectation for him to be comfortable with, never mind the attributes of autism and how change is handled. \n\nIt seems to me like she's made this decision herself without even considering how her brother feels about her plan. He might want to carry on living with his parents and not move out. \n\nIt seems a little inconsiderate to her brother",
            "Unfortunately I think this is the hill to die on. How is there a compromise here, what's the middle ground some one said it earlier resentment ether way.",
            "Are the parents aware of this plan?",
            ">I’ve told her I love her brother, but I don’t want him to live with us and our kids, if we choose to have them. Her parents are two wonderful people, and I feel they are much more equipped to take care of him like they have the last 21 years.  \n>  \n>My position is that he will be happier and better taken care of with his parents, and that it is their responsibility to do so. As far as I’m aware they’re planning on doing this anyway,  \n\n\nI can see your point of view, especially for those early years when the kids are young and you're establishing your careers and household routines. I suspect it will be more difficult to have your wife's brother in the home than she realizes and if her parents are able and willing to provide a stable and supportive living environment for him, that may be best.\n\nThat said, her parents are older and they will most likely die or be rendered incapable as caregivers by age-related conditions before her **younger** brother faces any such issues. Given this, I have to admit that I am honestly kind of bemused by your assertion that you love her brother and I can see why your fiance keeps breaking down in tears at this conversation. It must feel extremely frustrating and heartbreaking to be trying to discuss a life-long issue, and you dismissing it with a short-term (essentially) solution that doesn't appear to account for the long-term care complexities. You don't sound open to the brother living with you in the near-term or long-term, since your only solution is to send him to the parents. Well, what if something happens to her parents? What if they get Alzheimer's or are otherwise incapacitated by age-related conditions to the point they can no longer support him? What is your solution then?\n\nIt sounds like you two have different, and perhaps incompatible, value systems in relationships.  She seems to feel a stronger sense of familial affection and desire to cultivate and maintain close multi-generational and extended family care bonds even as an adult, where she and her family can continue to rely on each other as a familial care support system as she moves into the next phase of her life as a wife and mother. I'm guessing she draws on the communal support systems of a close-knit family.\n\nYou sound a bit as though feel the nuclear family should be prioritized as **the** family unit, and the multi-generational and extended family care bonds of the family(s) of origin should be attenuated, de-prioritized, and preferably compartmentalized into occasional set holiday visits. I'm guessing your family of origin interacts differently than hers does, and you prefer/ envision different family boundaries for your marital family home.\n\nIf she's happy with her current family boundaries, she may not be sharing your vision of family boundaries for your marital family home, and that's what this discussion is actually about.",
            "The thing is, your fiance's parents can't always take care of him. Also, it sounds like she wants to. You are not going to change her mind. Nor should you.  You need to decide whether or not this is something you're willing to work with.",
            "Here's the flat truth: she and her brother are a package deal.  He IS going to live with her.  You may not have much of a say about that.\n\nI saw your response to someone else where you say you'd be up for that later on in life.  But if this is very important to her you will probably not have much choice as to when it happens.  Then if you say no you're the bad guy.  The relationship ends either way, gradually or quickly.\n\nSome people downplay what is deeply important to them because they don't want to lose their partner.  But IMO it always resurfaces later and when you may not be prepared to deal with it because the other person has been quiet about it for a while.\n\nSo if I were you and I was strongly against living with her brother I would not marry her or tie my life to hers with children.  It will be much harder to opt out at that point.",
            "If you don’t want to be a caretaker for her brother you need to break up with her. She’s not going to let him end up in the states custody so if this is a dealbreaker for you it’s time to walk away.",
            "Unfortunately, and fortunately, there's no right answer here. There's only the decision that you can live with. I don't envy the choice you have to make.",
            "“You’ll barely know he’s there” \n\nWtf he’s not a goldfish. He’s a child. If anyone is raising him by barely knowing he’s there, it’s a problem.",
            "i know I'm late but maybe discuss alternatives? \n\nhe can attend a center for people with special needs so you won't have to constantly supervise him, or you can have a person to help you with him (professional assistant) .\n\nThe problem is and will be forever that he cannot take care of his own needs, shop for his own needs,plan ahead or even survive a day without someone telling him what to do ( eat,drink more water, wash yourself,stop eating) etc.\n\nYou will have to constantly think about him, manage finances for him too and there will constantly be the need of someone being home with him as much as possible and that means a lot of missed opportunities.\n\nAs you said,I'm sure he is a sweet person,maybe in time he will gain more independence but as of right now,you and your SO need to seriously analyse the problem.if left unsolved and he does come and live with you, he may pick up the tension between you two or even resentment and it will have a terrible impact on him, as they usually can't manage emotional pressure. Also, if you happen to stick around and then decide to leave/ send him back to his parents- it will again have a negative impact.\n\nso,it's is also in his best interest that you figure this out ahead of time.You should also be sure that you are capable of taking care of him! It's more complicated and complex than taking care of a young child, for example.\n\n If you want feel free to leave a message/comment and I can look for more resources for people with disabilities in your area, maybe some professional who can give you their opinion and some advices ? \n\n\n\nP.S.:you're doing great op, you'll figure this out!"
        ]
    },
    {
        "post_id": "9wrioh",
        "author": "megotheeggo",
        "title": "[Update] My (21F) mom's (44F) boyfriend (50sM) kicked her out tonight. I don't know what to do to help.",
        "url": "https://www.reddit.com/r/relationships/comments/9wrioh/update_my_21f_moms_44f_boyfriend_50sm_kicked_her/",
        "score": 2798,
        "num_comments": 49,
        "created_utc": 1542132876.0,
        "selftext": "Link to previous post: [https://www.reddit.com/r/relationships/comments/7wr7x0/my\\_21f\\_moms\\_44f\\_boyfriend\\_50sm\\_kicked\\_her\\_out/](https://www.reddit.com/r/relationships/comments/7wr7x0/my_21f_moms_44f_boyfriend_50sm_kicked_her_out/)\n\n&#x200B;\n\nSo it's been about 9 months and though my original post didn't get a lot of comments, but I always appreciate updates and want to do the same.\n\n&#x200B;\n\nAfter being kicked out my mom moved her stuff to storage and moved her, my brother and pets into her sister's camping trailer for the time being. They were there for about 4 or 5 months, while my brother finished high school and during the summer I got to help them move into a place rented out by an old friend of my mom's for a lot cheaper than what the rent usually is for the area. But he started to get weird and moved friend into the backyard (he lived on the property as well) and then decided to rent the place out to someone else after my mom was living there for about 3 months. Finally my mom found out a family member had a duplex for rent and she's moved in there.\n\nAll while this was happening my grandfather decided that being a jerk to my mom would somehow help her? He was unsupportive of my mom from the start and blamed her for getting kicked out. He tried to get us to move into his and my grandmother's place for a few months but as soon as we started moving stuff in he would make snide comments about how he didn't expect us to move stuff in (which is a lie, him and my grandma talked about it multiple times), and was just a jerk the entire time. So that's when my mom asked her old friend for help instead of moving in with her parents. Ever since, my mom has tried to contact him by wishing him happy birthdays, etc and he won't respond. It has gotten so bad that I finally snapped last month and laid into him, now he won't respond to me and says my mom has brainwashed us. So Thanksgiving should be interesting this year haha.\n\nI haven't heard from my mom's ex boyfriend and don't care to. We heard he is seeing someone else and has been for a few months but will try to still text or call my mom. My mom is cordial with him since she still cares about him but she is enjoying focusing on herself and getting to explore what she likes to do again.\n\nMy mom is doing well. She has had some crazy stuff besides getting kicked out happen to her. She had a sort of skin cancer (not dangerous but still scared us until we knew what it was), her friend died, our cat that we have had for 17 years died, and now she has to have back surgery. But with finally being in a place where she can stay for as long as she wants, she's excited. She has been talking about starting online school after her back surgery and my brother is staying with her for awhile so they can both save up.\n\nAs for myself, it's been rough but I realized I needed to seek some help feeling so overwhelmed. So I'm seeing a therapist and making sure to take care of myself while still being there for my family. My original post was a lot of me freaking out but everyone is doing well despite all the bad circumstances.\n\n&#x200B;\n\nThank you to all the people who commented or offered advice. I appreciate it!\n\n&#x200B;\n\nTL;DR: Mom and brother bounced around a little but have finally found a place they can afford and stay for as long as they want. Mom has had some health issues but now that she's found a place she's getting those taken care of and is working on doing things she's wanted to do for awhile (schooling, new job, and dating again). Grandfather is jerk to his own family and has tried to be even more of a jerk while his family is struggling. But we are all doing well and trying to destress after all of this lol",
        "permalink": "/r/relationships/comments/9wrioh/update_my_21f_moms_44f_boyfriend_50sm_kicked_her/",
        "comments": [
            "I'm glad you realized that self-care goes a long way when you're caring for everyone else. It's easier to give from the well when it's overflowing so make sure you continue to invest in yourself so you have enough left over to care for others. ",
            "I'm glad your mom got a good living situation.  She really dodged a bullet by nope-ing out of your grandfather's place.  It would have been hell for her and would have really gotten her down mentally.  I'm glad you're getting help too, it's always good to get outside perspectives on how to balance being good to others and still being good to yourself.  It can be easy to overextend yourself which is okay during a short-lived emergency but not so okay long-term.  ",
            "Just remember, y'all do not need to see your toxic granddad for Thanksgiving! If he's being a jerk and refusing to acknowledge or apologise, just have a nice quiet Thanksgiving at home. Maybe take in a stray friend or two. Be in a place where you can actually feel thankful.",
            "I’m glad it’s all worked out. Good luck!",
            "You sound like a wonderful daughter. Keep up with self-care. ",
            "About your grandfather...\n\nMy dad used to do the same thing.  Offer help, then fall through with it or be an ass if he was held to his word.  I guess he wanted to feel good about himself and impress me and the ex-wife without actually being out anything.  His behavior was probably the biggest instigator of fights between me and the ex.  I would have been happy to not count on anything from him and the ex was adamant about him following through with promises.",
            "So sorry it’s been a rough few months for you guys. \n\nYour mom is lucky to have such a caring daughter like you. Make sure to call her once a day (or whenever you’re able to), even if it’s just to see what she’s been up to or how she’s feeling. Just being there and listening/having conversations can be mean a lot to someone, especially if they’re lonely. Your mom is young and capable of many things, she just needs support.\n\nself care is super important for everyone. Nothing wrong with seeking therapy for some venting and help unravel your feelings of being overwhelmed. \n\nWish you and your family nothing but the best",
            "Are you still in school, OP? Remember to take care of yourself too!",
            "Her ex-boyfriend’s behavior hurt her *emotionally*. Because it seemed so cruel. \n\nThe greatest gift you can give her is just to love her unconditionally. And remind her that she IS VERY lovable and she IS loved VERY much. \n\nAnd I mean HUG her, CALL her, make her a pie. Everyone is completely different and you know her 100,000 times better than I do so whatever you know will make her smile the most and make her feel loved, simple things that are practically free, DO them, regularly. Posting here on Reddit in itself shows how much you care about her. \n\nHug her. \n\nOnce she has that solid foundation, she’ll have the strength to solve 99% of all the other financial problems herself. ",
            "You're a good daughter <3",
            "[deleted]",
            "Wow! Good for u. You’d sound like a truly amazing daughter and I know that u will do well going forward. So glad things are looking up for u!",
            "Wow, OP - your mom sounds absolutely incredible. Sounds like she is hardworking, self-sufficient, and has passed these traits down to her kids as well. So glad you are taking the time to help yourself and that things are looking up for your mom finally! I wish her all the best with her surgery! And sorry to hear about your grandfather - luckily the best “revenge” is just being happy and continuing to succeed in life without him. Best wishes to all of you!!!",
            "I'm glad you made it a point for self care and having the courage to talk to someone because at the end of the day it your thoughts that you have to deal with.\n\nI wish you and your family the best of luck and I'm happy to hear y'all are doing well and moving forward bad times are temporary❤️️",
            "What a rough year! Happy to hear that you’re taking care of yourself.",
            "Do something to help her out I kicked my wife out out of rage. Worst feeling I ever had. I got the point of changing my ways but now have to take the leap... What u should do I offer her in bed or couch but things u can do for a person doesn't always come back but u feel good .... I think ."
        ]
    },
    {
        "post_id": "esit2d",
        "author": "Foreign-Garden",
        "title": "[UPDATE] My [22F] boyfriend [32M] has trouble controlling his anger and has untreated mental health issues",
        "url": "https://www.reddit.com/r/relationships/comments/esit2d/update_my_22f_boyfriend_32m_has_trouble/",
        "score": 2793,
        "num_comments": 165,
        "created_utc": 1579729653.0,
        "selftext": "Hi all! I wanted to thank you for all of your responses on my [previous post](https://www.reddit.com/r/relationships/comments/ep3scw/my_22f_boyfriend_32m_has_trouble_controlling_his/). I got so much support and I feel that it's appropriate to do an update.\n\nPosting anonymously on this subreddit was a huge step for me. So many people were blunt and honest about the reality of the situation based on what I posted. I have felt hurt for so long, and it felt great to get some feedback and support.\n\nAfter I posted here, I soon told my therapist and even read most of your responses out loud to her. It was eye opening to me, and she agreed that I'm in an abusive situation and it's not my job to wait around for this person to change. She also recognized the gaslighting and manipulation that was involved which was hard for me to accept at first. When I talked to my boyfriend about my concerns things got pretty ugly. He didn't respond to it well, and we talked back and forth for about a week over text and phone. At times he was apologetic, at other times he minimized my feelings even more and tried to justify his behavior. (At one point he said it was \"ignorant and selfish\" of me to criticize his \"mental health issues\"...okay?) Guilting, manipulation, even gaslighting. I couldn't take it anymore. Oh yeah, and when I stood my ground and repeated the statement \"I felt intimidated and afraid when you blared on the horn, threw the change, and yelled at me,\" he had the nerve to say (this is all over text mind you, and my friends/therapist agreed I was communicating very reasonably) \"I feel scared and intimidated by you right now, this whole convo is triggering\" lmfao??? Are you for real?\n\nThroughout all of the back and forth since the initial incident happened (the rage fit) I finally opened up to my close friends and all of them were hugely supportive of me and attentive to listen. They didn't know the extent of his rage and agreed that this was unhealthy. It felt really good to open up to them, for so long I wanted to defend this person's behavior.\n\nI broke up with him last night. My friends and even my dad agreed that I don't owe it to this person to break up in person, so I did it through text, exchanged goodbyes, and blocked him on every platform. I'm excited to move on in my life and focus on my schooling, friends, and just myself in general.\n\nThank you all again for the support and feedback, I needed it. I feel like my life has been changed for the better and the responses I got were huge for me to take that step. \n\n\\*\\*TL;DR;\\*\\* Listened to y'alls advice, dumped his ass, and I'm moving on. Thank you again!! <3",
        "permalink": "/r/relationships/comments/esit2d/update_my_22f_boyfriend_32m_has_trouble/",
        "comments": [
            "Good for you OP, there's a line between supporting and understanding someone's mental health issues and letting them use those issues to excuse their abusive behaviors. And he was definitely doing that. \n\nPeople need support to change but without the will and work by that person, no amount of outside support will help that person improve. You did the right thing by demanding more",
            "Enjoy your this brand new chapter of your life :)",
            "Omg of course he flipped the script.  I hate the whole “well this conversation is “x” so you’re behavior is bad too!” Bullshit.  With abusive people they expect you to take their shit indefinitely.  They can’t handle feeling bad at all so they can’t and won’t take any responsibility.  Congrats on being brave enough to leave.",
            "I’m happy for you. I know that was a big step. Be very, very careful about your physical safety. He is an abuser and abusers don’t handle breakups well.",
            "Congrats! Just be careful. If this guy has anger issues, I would be a bit worried he might stalk you.",
            "[deleted]",
            "Reading this made me feel strong, nice work",
            "Just keep your phone on you he may not take to loosing control all that well just be aware of your surroundings and ignore him do not acknowledge him and note down any further contact after u have told him to stop",
            "I feel soooo proud and I don’t even know you! I celebrate this victory with you, cheers!",
            " Unfortunately he was well on his way to that first act of physical abuse, I am just so relieved u got out before he had a chance to make it physical. Just remember OP, for future reference, once he or any guy, gets past that first slap/kick/punch, then the subsequent ones come easier and easier for him. I am so happy u have a fantastic support system.",
            "I was in a similar situation, and the feeling of relief and weight of the shoulders is amazing. Im glad you got out of that situation and wish you happiness going forward!!",
            "I am so proud of you",
            "Yes girl. Every time a young woman breaks up with an abusive boyfriend, an angel gets its wings.",
            "Bravo! Stay strong, love yourself, and don’t get with someone who doesn’t see your worth. Good luck!",
            "Wooooo!!! Well done! The whole tone of your post just sounds so much happier and more relaxed. It must have been a difficult and scary week for you.",
            "every single time someone posts on this reddit it's always a relatively young woman and a middle aged man.",
            "Don’t remember the original post, but sounds like you did the right thing so congratulations! \nI hope you’re able to move on and find someone who treats you how you should be treated :)",
            "Happy you took your life back like this! Don't let him get in your head too much. Of course he tried to victimize himself. Abusers aren't all self-aware, I'm sure his brain tried to justify his abuse to better cope with what he was doing. Take this time to heal and get to know yourself as an individual rather than a half of a relationship, with time I'm sure you'll find someone who loves and respects you with no conditions or toxicity.",
            ">I finally opened up to my close friends and all of them were hugely supportive of me and attentive to listen \n\nThose friends are keepers.",
            "I'm proud of you for RUNNING! Finally recognizing that you are important. There is only one of you, and ultimately you are in charge of your life and expectations. Be strong. Don't let his more experience age gap suck you back in. Be a ghost and never contact again!",
            "Good for you. It is SO common for men to act this way in relationships and it needs to be stamped out. Nobody should ever have to tolerate this. Well done!",
            "[deleted]",
            "Oh look, another guy who violates the half your age plus seven rule ends up being a scumbag. What a surprise.",
            "Can I ask- how did he handle the breakup? \n\nJust curious really, and a small part of me wonders if he’s gonna be like Joe..",
            "Was also in an abusive relationship. There has been more than a year since I broke up with her but every time I imagine having a relationship with another person I get anxious of the possibility of them treating me the same. It will take some work to learn to trust again.\n\nAlso I love the fact that you ran these comments through you therapist as well. Getting a pro opinion on the advice and thoughts given here was a great idea. hope more people will emulate this.",
            "Was there a moment or something someone said to you that you could now identify as the \"turning point?\"",
            "Good job! I’m sure it must’ve been relieving to let go of him. As other comments have posted out, you need to find the line between mental health and abuse, and he definitely was on the abusive side. Just know that despite being relieved, it’s okay to feel sad about breaking up sometimes, I’m sure you had a few good times with him and it’s okay to feel sad. Congratulations with taking this step though- it’s a big one!!",
            "I’m so proud of you!!! I can take a lot to step away from something like that. And it sounds good that you did this over text and avoided a possible altercation.",
            "I am so glad to hear that you stood up for yourself. Mental health issues are not an excuse for abusive behavior and I'm glad you didn't allow him to play that against you.",
            "Proud of you!! Now go on with your bad self! Enjoy being single in your 20s.",
            "Wishing you all the best, OP!",
            "Proud of you for being brave, allowing yourself to be vulnerable and acting as your own advocate. It's inspiring to your readers. I have my first appointment with a therapist in years on Saturday and reading this makes me look forward to it.",
            "I read your original post when it first appeared on this sub, and I'm so happy you were able to leave this relationship, and that you have what sounds like a great support network. Congratulations!",
            "GOOD FOR YOU!! You right now - are the strongest person in this room!!!! Hell perhaps on your whole block.  GO YOU GO YOU GO YOU..\n\nIt sounds like the ex knew every play in the book of how to manipulate and control someone.",
            "This is a wonderful update, OP. \n\nLike many pointed out in the original thread, when you two first started dating, you were 19.5 years old...a teenager, technically, and for all intents and purposes. You have experienced so much growth, maturation, life, etc...and will absolutely continue to do so for the next decade or so. \n\nI’m typically not a huge fan of the “bloody hell, dump his arse” reaction that’s quite common ‘round these parts, but this guy will only get worse; especially if he continues to refuse help. \n\nI do have to wonder though, if this guy is using his alleged mental illnesses as a scapegoat for him just being a royal douchebag.",
            "You'll find someone and \"when you know, you know\", just be patient, don't force a relationship of convenience. \n\nBe open, vulnerable, and communicate clearly with your future partner. Make sure you two love and trust, respect and admire each other. If either of you are afraid of being vulnerable and honest then you will not have an ideal relationship. It takes nurturing and exposing yourselves to each other in ways that allow you to love your true selves and accept yourselves for who you are instead of pretending or trying to impress and burning out.\n\nWhen you find that person who makes you feel giddy from the first moment, that's when you'll know you found the right one. Don't waste your time with anyone less.",
            "[deleted]",
            "I just turned 25 this week and wow have I learned a lot in my twenties!\n\nI used to say that age didn't matter so long as we were both adults(ie no minors). Cue lots of men 30+ later,I came to realize that it does. \n\nI'm pretty average looking and a bit chubby so I thought I was safe from men who only wanted a younger woman. Boy,was I wrong! Every single person I dated or was FWB with(above 30)was an abuser. I've slept with at least 100 people since I was 18 and only two were near my age(one is my current fiance). \n\nYou need to be wary of someone 10 years older than you who is interested. If they're not in the same decade as you then give them a hard pass for now. \n\nPeople still view us as young,naive \"supple\" sex toys and want a taste. It's pretty sickening, honestly. I had so much bad luck with people but I didn't realize it was my own errors until stepping back. Sure,they shouldn't have been awful people but I also trusted way more than I should have(and thought I was being careful at the same time).\n\nTl;dr **DON'T DATE OUT OF YOUR DECADE**",
            "I love a good ending",
            "I am so proud of you!",
            "In my experience you may get through a year, or you might meet the right person sooner.  Be open to what life presents to you.  With a healthy amount of caution of course.\n\nI’m no therapist but this is a good time to really evaluate what “drives” your choices with an SO.  It took me years to understand myself...what I thought was important back in the day turned out to be wrong so I went through a lot of mistakes and pain to get where I am today.",
            "One of my favorite sayings is \"Don't set yourself on fire to keep someone else warm.\"\n\nIf someone else 'needs' to do things that scare or hurt you, and refuses to have a conversation about it, they don't value you. Value your own safety and peace of mind and keep away from people like that.",
            "Well done you. Good on you. I have been there,  when their anger is a secret that only you and they know - like a parent who sexually abuses their child and swears them to secrecy. \n\nAbusers of all shapes and sizes all sing from the same sheet.\n\nWarning: It is not as easy to leave as you think . He will likely convince you he has changed. \n\nHe may even go see a therapist. \n\nBut change is not easy, even if we want to - as dieters all know. \n\nNow you have gotten out, stay out. \n\nYours, a fellow survivor of an angry abuser.",
            "Good for you! And now that you’ve had this experience, you have the tools to recognize other toxic people. Wishing you good relationships with friends and family and your future significant other!",
            "[removed]",
            "Glad to hear this. Proud of you OP! Next time steer clear of older men.",
            "Good job OP. Especially since you got out at 22, others are not so lucky",
            "How does the weight (of his baggage) off your shoulders feel? Sounds like undiagnosed bipolar or narcissism at the least he has some sociopathy going on. There’s also a reason why there’s such a difference in age. It demonstrates his maturity and likelihood that this isn’t his first rodeo and the women close to his age won’t tolerate what you have thus far bc he can’t manipulate them like he was able with you and that’s not your fault. Believe it or not it’s good you went through this at 22 years old bc there are many out there. Now you will know the warning signs to get out sooner. It also taught you a lot. At some point in your life (older) you’re unwilling to put up with the same shit when you’re younger. Happy to hear you’re free. Remember you don’t owe anyone anything in life,  You only owe yourself respect, dignity and happiness bc you deserve it.",
            "Just a suggestion but at 22, a guy 10 years older than you is in the creepy category.",
            "Next time **more lovey dovey** and **less abuse / excuse**.\n\nCongrats on your new life.",
            "[removed]",
            "Throughout the relationship, was this the first time you two broken up?",
            "[deleted]"
        ]
    }
]