[
    {
        "post_id": "9pzqs2",
        "author": "croutons_are_good",
        "title": "UPDATE: My older sister [29F] got drunk and flirted with my crush [24M], then confessed my [27F] feelings without me asking. Why do I feel like shit?",
        "url": "https://www.reddit.com/r/relationships/comments/9pzqs2/update_my_older_sister_29f_got_drunk_and_flirted/",
        "score": 2798,
        "num_comments": 167,
        "created_utc": 1540085918.0,
        "selftext": "[My previous post got like three replies](https://www.reddit.com/r/relationships/comments/9id00n/my_older_sister_29f_got_drunk_and_flirted_with_my/), but I like a happy update so here goes.\n\n&#x200B;\n\nI talked a bit with Derek on Discord and apologized for things coming out this way, especially since he was recovering from a breakup. He was really chill and empathetic about it. He invited me out to drinks later that week and since, well, everything was already known it was actually pretty easy to talk to him about it, and we laughed it off. I let him know I was still into him but wanted to give him space and also didn't want to complicate our friendship. He was very kind and affirming about it.\n\n&#x200B;\n\nLater that night, he asked if I wanted to kiss and I say said hell yes, so we made out a bit - it was amazing. We made plans to hang out later that week and one thing led to another and we did the monster mash. It was a graveyard smash. :) Our friendship seems to have deepened a bit as a result and I'm super happy with the FWB arrangement. I'm doubtful that the future will hold any further romance between us other than physical, but honestly I'm pretty happy with it?\n\n&#x200B;\n\nMy sister and I also talked it out and everything is good between us now - she apologized, agreed to start therapy (recognizing the pattern of her going after people I like) and has been checking in with me to make sure I'm okay.\n\n&#x200B;\n\nTL;DR: Everything is cool, I'm banging my hot crush, we're still friends, my sister and I are cool, communication wins.",
        "permalink": "/r/relationships/comments/9pzqs2/update_my_older_sister_29f_got_drunk_and_flirted/",
        "comments": [
            "Glad things worked out for you. You mentioned he's your crush but now you're in a FWB arrangement while he's on rebound, just be sure you stay clear-headed about the FWB fact and keep your crushy feelings in check if he ultimately doesn't plan pursuing an emotionally invested relationship with you.",
            "Could be off base on this, but it sounds like you set your sights on someone and then settle for less than what you want. You said in your last post your sister ended up entangled with guys you expressed interest in - and I know that feeling and it does suck - but from what little I know here it also seems like you don’t go just go after what you want. If this FWB situation is what you really want and I kinda doubt it, then way to go, could be very fun. But maybe just maybe take your overstepping siblings moves as a kick in the ass and go for what you really want. ",
            "Am I the only one who doesn’t see this as a happy ending??",
            "Well looks like your update post got 10x the upvotes\nBut it’s also worrying considering your FWB arrangement is built on a rebound",
            "Not to be a Debbie downer, but when I started having sex with my bff, it sent everything to absolute shit.\n\nWe stopped taking for a few months and then started hanging again. Almost instantly, we started fooling around again, and I told him it would just complicate everything like before, but he swore up and down it wouldn't. \n\nLong story short, it totally did. We are no longer on speaking terms, and I lost someone who was very important to me. The damage becomes irreparable, and you know you're not going to be happy about your future place in his life when he leaves you to be in an actual relationship later on.\n\nSave yourself the heartache. You know deep down that this arrangement isn't what you want. And you deserve to be with someone who wants all of you.",
            "I still think what your sister did is super shitty, and I don’t think it should be so easily forgotten, especially because it’s a pattern of behaviour. She needs to grow up honestly. I feel like you’re settling for less with this guy because you thought things were ruined by your sister and then when he wanted FWB you were like: “thank god, yep that’ll do”. You deserve someone who reciprocates your feelings properly ",
            "Damn, OP. You’re setting yourself up for disappointment here. FWB with somebody you want to be with is never a good idea. One person has, or catches feelings and winds up getting hurt. I hope things work out for you. I just feel like you’re playing with fire. ",
            "Just be careful of getting used. I know you said he was kind about the whole thing but it sounds like he found out that you’re into him and even though he doesn’t want to date you, he still just wants to hook up tho. I can see how this is a win win for him, and I’m sure it’s hard to see clearly with your feelings maybe clouding your judgment, but just be careful he doesn’t get an upper hand in this new relationship. Have a clear talk about any ground rules or boundaries. ",
            "Careful with that arrangement. I've rarely heard of feelings not being hurt once it gets to the point of stopping that kind of relationship",
            "I missed your OP or I would have commented. When I read \"this isn't the first time she's done this, her last 2 relationships were people I crushed on, but says she doesn't remember.\" I actually said \"for fucks sake\" out loud.  \n\nI'm really glad your feelings have been vindicated, but I'd look for actions not words from your sister in the future.",
            ">I'm super happy with the FWB arrangement. \n\nWill sound rude, but another person trying to settle for second best option. Deep down you want it to work.  ",
            ">My sister and I also talked it out and everything is good between us now - she apologized, agreed to start therapy (recognizing the pattern of her going after people I like) and has been checking in with me to make sure I'm okay.\n\nHi OP, please make sure you don't confide in your sister though. Saying she will do therapy is not the same as actually being someone you can trust, and she's shown herself to be someone you can't trust. ",
            "Can’t lie. This worries me a bit. Please, please protect your heart. I’m just really wary of this kind of arrangement. \n\nSomeone always gets hurt. I worry that you’re settling for whatever you can get, (while secretly hoping for more) rather than face the possibility of “pushing him away” with what you *really* want. Just be careful, ok?\n\nFor what it’s worth, I hope this works out. Take care!",
            "Happy for you at the moment for having the courage to go through with all this. To be honest I'm frankly just scared of how this will all turn out. You're now walking in an FWB tightrope while balancing being his rebound on one hand and having emotions for him on the other.\n\nBe constantly aware of your arrangement and guard your emotions, otherwise you are setting yourself up for pain.",
            "OP glad you're happy now, but reading just this post, sounds like you're doing intimate things with a guy who approached you knowing you liked him, but also knowing he (at best) wasn't ready for a relationship yet or (at worst) knows he doesn't want a relationship with you (yet, or ever). Without knowing much else it kinda sounds like he could be taking advantage of the situation, especially when you sound more than willing to give him space and to let him have his cake and eat it in the hopes that things may work out further down the line.\n\nJust be careful. Be sure to have that awkward conversation in a few weeks where you make sure you all are on the same page about where this is going. Because I wouldn't be surprised if you both have different ideas above what's likely to happen next. ",
            ">I'm doubtful that the future will hold any further romance between us other than physical, but honestly I'm pretty happy with it\n\n\n\nSo.. It wasn't a crush then, you just wanted to get laid? ",
            "Love how OP is only responding to simple comments that just say they’re happy for her. She must not like all the comments telling her to be careful about a FWB situation. Let the downvotes commence. But people like to ask for advice and then ignore the overwhelming majority that caution them or tell them anything other then exactly what they want to hear",
            "As long as you’re not harbouring thoughts of this maybe turning into something else? It seems like you know this in your head (that’s it’s unlikely to go anywhere) but you still seem hopeful it might? If that’s what you’re doing, look after your feelings OP.\n\nSometimes these things can work out but starting out the way this all did (when he knew you’d at least be down for something) is a potential mine field. \n\nIf you know this is just good sex though, then get it and sex on! ",
            "I‘d nevertheless move out soon away from your sister. The power-imbalance she creates and enjoys surely are very unhealthy for you. Does she do this in other parts of your shared life as well? ",
            "Ah... So it's a friends with benefits thing... Could be good, could be bad.\n\nJust keep your feelings out of this current arrangement or it could get ugly.",
            "Just make sure FWB isn't you settling....FWB work for people that are not romantically interested in the other person. If you have a crush on him, I'm not entirely sure FWB will work out in the long run for you because it becomes hard when you also really like them and want to date them. It might work for a while but what happens when he meets someone he DOES want to date? Or goes on other dates? Or talks to you, as one does with FWB, about them? Because FWB means you are still friends, and you sometimes do the dirty, but you're more friends than anything - which means he will tell you about this stuff, maybe even ask your opinion on a girl he likes? If you even get a stirring of jealous feelings, or possessiveness, STOP doing FWB.\n\n&#x200B;\n\nCan you handle that? Seriously, think about it. If you still think you can, and you're not just saying that so you get SOMETHING you want even if it's not EVERYTHING(as in you tell yourself at least you get the sex even if you don't get the relationship). FWB is hard, and not all people are capable of doing this. You have to be able to let go of the sex immediately if needed or requested, with no hard feelings. If he walks up to you and says \"I met this amazing girl last night, and we have a date tomorrow - I really like this girl and don't want to mess it up, so we can't have sex anymore.\" are you going to be able to high-five him and say \"No problem, of course! I'm so happy for you!\"? If not, don't be a FWB. Just don't. It will end with hard, bitter feelings on your part. It won't be forever - FWB is never forever. You may be thinking FWB might lead to a relationship but that doesn't usually happen.",
            "Girrrrrl get that spooky dick!",
            "> It was a graveyard smash. :)\n\nGet iiiiiiiiit! \n\n So proud of you, glad things turned out well :) ",
            "Not to be a Debbie downer, but when I started having sex with my bff, it sent everything to absolute shit.\n\nWe stopped taking for a few months and then started hanging again. Almost instantly, we started fooling around again, and I told him it would just complicate everything like before, but he swore up and down it wouldn't. \n\nLong story short, it totally did. We are no longer on speaking terms, and I lost someone who was very important to me. The damage becomes irreparable, and you know you're not going to be happy about your future place in his life when he leaves you to be in an actual relationship later on.\n\nSave yourself the heartache. You know deep down that this arrangement isn't what you want. And you deserve to be with someone who wants all of you.",
            "please be careful with this arrangement. you have feelings for him and he might be emotionally confused and rebounding. having a physical relationship with him will make your feelings grow stronger and he might realise he doesn’t feel anything he was just trying to replace his ex. ",
            "Please be careful going into this FWB when you have a crush on the guy. From personal experience and experience from others, it complicates things and likely will ruin the friendship. Usually people have to stop a FWB arrangement because of developing feelings because of doing things that you would do in relationships except being committed. It hurts.\n\nJust please be cautious. ",
            "Am I the only one that things that the sister letting the cat out of the bag may be ruined a potential romantic relationship? He isn't ready for a girlfriend, but he is ready for FWB. Now any potential chance you had to take things slow is kind of ruined by your sister's big mouth.\n\nNevertheless, glad things worked out for you. I am also glad that your sister recognized the error in her behavior, which is most likely rooted in envy, jealousy or unnecessary competitiveness.",
            "Major LOL @ “graveyard smash”",
            "OP, on your last post you stated that you were \"falling hard\" for this guy. Being FWB with a person you have feelings for is more of a downside for you than it is something good. I'm telling you this because I went through this. Don't get your hopes up with whole this situation and stay clearheaded. Be careful.",
            "As long as you’re happy being a rebound I suppose.",
            "Yeah, glad it worked out, but stop being stupid and telling your sister who you're into...",
            "It’s not too bad having a attractive sister.\nShe can be the key to finding a man that will date you and not flee to the pretty girls they see. \n\nBut with this fwb situation he definitely played his cards right by using your crush feelings as ammo to get you in bed. With how flirty your sister is he’s probably hoping to get you and the sister in bed. I wouldn’t be surprised if they haven’t already smashed too. \n\nBut if you ok with just having sex with a hot guy then that’s really not a problem at all. Sometimes people just need some sex to ease the hormones and loneliness. ",
            "This sounds a bit unhealthy. The age difference is both insignificant and significant, because he is the younger one and you seem to be chasing him.  He’s not interested in more than FWB, and you are. I mean, if you’re happy for now, keep doing what you’re doing, but I hope you don’t stop looking for something better, expecting this to turn into more. ",
            "Life happens in the mistakes. FWB relationships develop into something more or you'll find out that you want something else instead. When the story is far from over, there's no need for labels like 'happy ending'. It sounds like an exciting time for you",
            "Hell yeah! Who doesn’t love a graveyard-smashin monster mash? Congrats.\n\nKeep your eye on potential rebound feelings and take the Feels part in general pretty slowly. Hope things work out for you!",
            ">and we did the monster mash. It was a graveyard smash.\n\nThis description was fantastic, and go you for good communication.",
            "Your sister is disgusting but at least she’s willing to change ",
            "How often do we get an everything is ok? That’s awesome :)",
            "from ur last post, even though ur sister is the more “attractive” one, she seems to be the more insecure one and requires all male attention or will throw a fit. idk if i didn’t know the age, i would have thought she was 15. i would distance myself from her. if she keeps doing this shit, obviously she cares more about herself than about u",
            "Everyone on /r/relationships is like allergic to the idea of FWBs, but I think it's fine.\n\nYou say you know this probably won't go anywhere serious, and I trust your judgement more than some rando here.\n\nAlso, you have a crush, not an undying, unrequited *love*.\n\nPeople here think if you have any feelings at all for a FWB you're doomed, which doesn't even make sense-- are you supposed to fuck people you detest? You'll be fine.",
            "Why did it hurt that your sister toyed with the subject of your desire like an object, and then betrayed your privacy, and then pea-cocked to you about it? I wonder, indeed, what's wrong about any of that. ",
            "27 is way too old to be talking about a \"crush.\"  This isn't high school.  Come on, just ask him out or move on.",
            "Glad things are going well for you! ",
            "Love a happy ending! Now give me tips to bang my hot crush!",
            "[removed]",
            "Are you older or younger? Makes a huge difference.",
            "If my sibling got me a piece of ass i’d give em a high five and a hell of a birthday present ",
            "Your sister sounds awesome tbh",
            "So you should really be thanking your sister, instead of her apologizing "
        ]
    },
    {
        "post_id": "966857",
        "author": "stopbeingawkward101",
        "title": "(Update) How can I(21F) stop being awkward around my brother(32M)?",
        "url": "https://www.reddit.com/r/relationships/comments/966857/update_how_can_i21f_stop_being_awkward_around_my/",
        "score": 2792,
        "num_comments": 130,
        "created_utc": 1533901644.0,
        "selftext": "[the original post](https://www.reddit.com/r/relationships/comments/8we9x1/how_can_i21f_stop_being_awkward_around_my/?st=JKNWVG0Q&sh=15aef4f8)\n\nHey guys, sorry for taking so long to update, I didn’t speak with him at that dinner bc there were a lot of people and I didn’t felt confortable.\n\nUnfortunaly things with my family escalated as this kind of things do. I’m fine as I already have some experience with them going crazy lol. My poor brother, on the other hand, was completely blindsided but we talked and I helped him set up some security devices/tips to avoid our parents.\n\nThis did made things take a weird twist and now the whole family is convinced I somehow turned my brother gay(which, ignoring the glaring HOW, is the why I’d do this) and I’m the bad influence. Nothing like waking up to your mom blowing your phone saying you’re going to hell eh?\n\nMy brother is pretty shocked and confused. This, at least, gave me the opportunity(after a couple of beers) to talk with him about our family, how I was treated and so. He was pretty heart broken and feeling guilty but I did my best to show him it wasn’t his fault.\n\nI think this conversation really made us closer and made me feel more at ease with the situation. A week or so later he asked if I was alright(I tend to freeze when I’m awkward) and I explained I was a bit intimidated by awesome-ness(not like this lol). He was actually very understanding and said he knew exactly how I felt. Then he started talking a bit about his fuck ups and how he screwed things up.\n\nThis helped a lot to take him off the pedestal I had put him in. Right now our relationship is great, I regularly have dinner with them, they met my friends and we’re both supportive of each other situation with our family. I don’t think he’s going to return contact with them, at least until they truly apologize, stop blaming me and accept his husband.\n\nOverall, I’m still not sure of what the future holds, I’m still awkward and kinda flopping around life trying to do things but I’m not so insecure and now I know I have my brother to help me out.\n\nThanks for all the advices guys!\n\nTL;DR: my family got even crazier but at least this made my brother and I closer. I talked about how I was a bit intimidated and he was great. Life is still hard but things are better now",
        "permalink": "/r/relationships/comments/966857/update_how_can_i21f_stop_being_awkward_around_my/",
        "comments": [
            "You and your brother might end up being the only two truly happy people in your family. \n\nThe rest of them sound miserable. ",
            "Your family sounds toxic and I would seriously consider cutting them out. Life is too short and you don't need that negativity in your life.\n\nYour brother and his husband are the only ones worth keeping around.",
            "I just wanna chime in and say that I’m really happy you and your brother have connected. As an older brother, I can tell you, this means the world to him. Especially given the situation with your family. ",
            "You two need each other. I'm happy for you ",
            "If your parents keep harassing you, warn them that if they don't stop, you'll direct your gay witchcraft at them, and then everyone can go to hell together.",
            "I love the idea that you have a gay fairy wand and you can just tap people with it and turn them gay.  \"leave my brother alone... or I'll turn you gay too!\"",
            "I'm sorry you've been treated poorly by your family, but you and your brother sound awesome. ",
            "You're amazing. He's amazing. I'm so happy for you guys that you have each other. I'm sorry that your family are idiots though",
            "If I were you, I'd block every family member from every form of contact. Just because you're biologically related to people doesn't mean you have to stay in contact with them or that you should be more forgiving of such vile, hateful behavior.\n\nEnjoy your new found closeness with your brother and having what sounds like a really nice chosen family. ",
            "You love your brother to your fullest and love his future husband too. If this is how your family chooses to be and say youre not family, then you make your own. Family is what you make it, just as long as youre loved and happy. ☺",
            "something about the way you wrote this and the last post really touched me. you and your brother both sound like wonderful people, and i hope this is the start of a great relationship between you two. ",
            "Sounds like you’re vlc (very low contact) already so I would keep it that way and just focus on yourself for now. The relationship with bro seems to be a healthy one so I’d nurture that one before allowing any family back into life. \n\n\nFor support and others in your situation check out r/justnofamily ",
            "I’m very happy you guys talked it out!  He’s your family, screw the rest of those jerks. ",
            "It's awesome when your adult family-of-choice can include members of your  family-of-origin!\n\nGood luck to you!",
            "I'm so glad you guys were able to connect. Your family sound like they have some serious problems that have nothing to do with you, and you guys are both awesome humans to have not turned out like them. That is a huge accomplishment all itself! And thank you so much for supporting your brother. I know it means the world to him AND his fiance. ",
            "Good on you, OP. You and your brother sound awesome together, and I’m glad you have each other to lean on in getting away from toxic family members.\n\nAs far as being awkward, I [25M] was definitely the same way at 21. Hell, at 25, I’m still awkward, but a lot less awkward. As you grow and gain more life experience, things get better. That’s how your brother is where he is; he’s had a lot of time to try things out and make mistakes and discover what works and what doesn’t. You’ll get there too; growing just takes time :)",
            "There's nothing quite as comforting as a big brother having your back (speaking from personal experience; I have four of them). I'm happy that things seem to be working out for the best between you two :-)",
            "Ru Paul said it best: “We choose our family.”\n\nSounds like you have the foundations of a wonderful and supportivw family with your bro and his friends.\n\nMeanwhile, you mom can go to hell.",
            "Hey I’ve just gone through the same thing and about the same exact age gap with my older brother who I’ve rarely gotten to know through out my life. And I’m female too so felt like we’d have nothing in common and the first few times we got together after our father’s recent passing was really kinda awkward as all hell. But we got passed it once we each started opening up about our issues. It still gets awkward but I’m getting there and ur story really gives me hope! It’s nice to know you have a big bro on your side :). And he’s very lucky to have you!",
            "I had an uncle that me and my brothers were really close with, but when I was around 10 (I'm the youngest) he just kind of disappeared!? I didn't see him again until around 30 at a funeral. Turns out he was just gay? Haha oh the Catholic Irish families ",
            "This is really cute, I wish all people who come out and get rejected by their parents had an awesome sibling at least. ",
            "So my ex’s brother came out 20 years ago to a very religious family, his father is a minister of the united church. So it didn’t go well. They didn’t speak for years. Till one day years later the father accepted his son as a gay man.  They have a good relationship now. His brother had never accepted him as a gay man since he was previously married and has two kids. The brother was worried about the kids. Especially the daughter. They have grown up with lots of love and caring from myself and grandma. So my point is that maybe one day your parents will see that they were wrong and will accept your brother as a gay man. If not it’s there lost. Be proud of yourself for standing up for your brother and getting close to him. Things will work out the way they are suppose to. Good luck and enjoy life to the fullest. ",
            "As someone who also has abusive family, and who took a whole lot longer to realize it, you're 100% doing the right thing. \n\nThere's the family you're born with, and there's family you choose. You and your brother and his fiancé are chosen family. Focus your energy on them. You're under no obligation to accommodate your other blood relations if they're shitty to you. I think it's perfectly reasonable to not have much to do with them until they apologize. It sounds callous, but it also sounds like they have a history of being emotionally abusive to get their way. You might even find that they'll do much worse without you than you do without them. \n\nGood luck and hang in there.\n",
            "Think about how awesome you are at your age to stand up to your whole family and back up your older brother. That's pretty cool and I bet he thinks so, too.",
            "You speak of your brother’s accomplishments and feeling intimidated by them. You sound like a loving and mature person and a great sister to your brother. Those are accomplishments to be proud of too!",
            "it's normal to be awkward around someone who's really great and older, but i'm very happy for you. building relationships take time. you're doing fine.\n\n\nit's so important to have someone in your close family to support you like you did to your brother. no matter how highly you think of him, i'm sure he thinks even higher of you because of how you (very correctly) acted.",
            "As time goes on, you will find your place a d become comfortable and confident ! You're on the right track ",
            "You and your brother both sound like great people",
            "I am so happy that you and your brother and his SO all have each other for support and I am sorry you all have to deal with those family issues/members.  I wish you guys the very best and please keep us updated if anything changes, I would love to hear about it. ",
            "First off, I'm so happy you and your brother are on good terms and had some bonding moments! \n\nI especially understand how hard it can be to bond with older siblings you really dont know super well. My brother is 6 years older than me and actually has a different dad, but my mom and my dad divorced when I was young and my mom left with my brother. I would see him and my mom once or twice a year but I never really got to know him as a person until I graduated high school and moved in with my mom to go to community college and he was also living with her at the time. \n\nI felt so similar to how you explain it in the first post, I admire him so much, he always seems to know what hes doing and have his life in order. Hes so crazy smart and it makes it hard for me to socialize with him because of how self conscious it makes me. I know I can keep up but it is intimidating. Over the last few years we've been really close, we talk pretty often even though he did move away\n\nOne thing I found was that with him a lot of times I dont have to force myself to conversation and hes one of the few people I can enjoy silence with, we never have to say a lot to know what the other is thinking. \n\nCongrats again and enjoy having a relationship you can grow and build on with your brother! ",
            "By saying you made him gay they are just looking for a scapegoat.  It isn’t intended to make sense.",
            "Reading this story made me tear up. You two have a beautiful relationship. Keep on watching each other's backs and being there for each other.",
            "Happy to hear this! I haven't seen anyone recommend it, but /r/justnoMIL may be a good support area for you and your brother (and his husband). They are a very welcoming community for MILs/moms, along with /r/justnofamily which is also great, but definitely smaller.\n\nHoping for the best for you and your brother!",
            "It sounds like you are the family your brother deserves :)",
            "Why would you feel awkward around your brother?  He sounds like a great guy and you're a great sister.  Stand proud of what you did.  I'm very proud of you, as other commenters here are.  You're also very young so if you feel like you're \"kinda flopping around life\", that's perfectly okay. It's normal, even for those twice your age sometimes. You'll feel less floppy and insecure as you get older and get more life experiences.  You're on the right track so far by being loving and welcoming and not letting the hateful bigotry of your family influence you.",
            "I'm so glad that with all the toxic sludge in your family that you found someone who gets you, that you can build a close, loving, respectful, mutual relationship with. ",
            "Hi, i came across your post concerning your brother and his relationship with your parents. It’s gonna take time and fortunately for that generation to fully except that being gay is not a good or bad thing it’s just how it is. I really find it annoying and very unintelligent to believe someone chooses to be gay.\n    I’m not sure how religious your parents are but thinking that you turned your brother gay is absolutely ridiculous but that is the litmus test of how ignorant they are of human sexuality. \n    I have a friend that is younger than me I’m 41 she’s 21 her parents especially her mom is very religious and she feels like she’s let her mom down and she’s been going to church . She does have a strong belief in Christian ideology.  She thinks that she can undo her being gay .I just think it’s such a shame to deny yourself a true  connection with the sex that your attracted to. \n   Anyways , The best thing you can do is be an example to your parents and love your brother the way you have been. Stay strong\n",
            "I am so glad you are standing up for your brother. You are a champion. Please don't change. We need people like you. Kudos.",
            "Uncomfortable \\* ^(sorry)  \n",
            "Hey, it's been a month or so since your post, I hope you and your brother are doing well! :D",
            "What do you mean you talked to him? What are you doing on Reddit? Being a healthy person who actually deals with their issues. Sounds super fishy is you ask me! \n\n(Good for you👍)",
            "[removed]"
        ]
    },
    {
        "post_id": "nmy29p",
        "author": "AggravatingSmile5544",
        "title": "I (30F) live in a fantasy world (married to 30M)",
        "url": "https://www.reddit.com/r/relationships/comments/nmy29p/i_30f_live_in_a_fantasy_world_married_to_30m/",
        "score": 2792,
        "num_comments": 394,
        "created_utc": 1622209184.0,
        "selftext": "I have always had an active imagination and a rich fantasy life. It helps that I like to write and I'm able to bring a lot of that to my stories. But I also have a rich fantasy life that I keep to myself as sort of an escape from reality. My therapist wants me to unpack this a little and distance myself from it. And I guess I'm looking for a little perspective. \n\nFor background, I've been married for 5 years and together 12. My husband is a good man, kind and loving. We have one child (4F). We both work full time, and we have dates and time together. In many ways I'm satisfied. But at the core, my husband and I are different people. He is not passionate and not interested in the same things I am for the most part. I also have little interest in his hobbies. So we both have inner lives that are separate from the other. \n\nI'll make up stories to get myself through the day. Like I'll see a stranger at the library and I imagine a meeting of the minds relationship with this complete stranger. Or I'll leave home at night and go for drives and listen to romantic songs and put myself in the lyrics. I thumb through travel websites and imagine entire lives in those places. My therapist has been gently telling me that this might be unhealthy behavior, and that I should give more thought to being present in the world. Anyone else dealing with a similar dilemma? Any advice? \n\n---\n**tl;dr**: Married woman with stable married life, no real issues except imagination.",
        "permalink": "/r/relationships/comments/nmy29p/i_30f_live_in_a_fantasy_world_married_to_30m/",
        "comments": [
            "Has your therapist mentioned, or have you yourself looked into Maladaptive Daydreaming?",
            "I think you should probably focus on what your therapist says. Seeking outside opinion on a topic that you're covering in therapy with a professional is rarely going to be helpful in the long run. We don't know you, we don't know the extent of this behavior, we aren't trained in dealing with this kind of thing.\n\nStick to what your therapist says. The fact that you came to strangers on the internet for a second opinion is a pretty good indication that this is in fact an issue.",
            "I would ask yourself how much time you spend fantasizing, in a given day. Is it every day? Is it several hours a day?\n\nI would also ask yourself if this fantasizing is stopping you from doing things that could make your actual lived experience better. If you took the time and energy you spend fantasizing and invested it in other ways, what could you get? Could you get a deeper relationship with your husband? Could you gain more satisfaction from pursuing another hobby with that time? \n\nEveryone fantasizes some. I have done it more in times of my life where I was mostly unhappy. I did a lot of fantasizing in high school, which was a time where I felt really disconnected from other people. I fantasized A LOT about having romance in my life. In college I fantasized about living a totally different lifestyle and having comforts that I didn't have, and not having the stressors of hard schoolwork. These days I don't spend much time fantasizing about a different life because I'm happier in the life I am in. (Also I am in treatment for my anxiety and depression now, so my mental health is better.) Maybe your experience is different and it's not something you do just because you're unhappy. But for me, I feel like it's something that doesn't really give satisfaction, and it can distract you from actually *doing something* to change the circumstances that make you unhappy. \n\nYour therapist probably has a good reason for giving this advice, but she also isn't inside your head. This comment is just all my perspective and stuff to think about. There is nothing inherently wrong with having a rich fantasy life, and it doesn't have to be taking away from your real life.",
            "In my opinion, it sounds like you're escaping into your fantasies so you can avoid confronting the uncomfortable reality in your life: you aren't satisfied in your marriage. Your fantasies seem to revolve around an idealized version of romance. Meanwhile you say you have little in common with your husband, that your sex life is lacking, that you can't have fun and adventure while having a stable life and child (not true btw), and that your therapist \"doesn't understand\" that you \"don't have control\" over these things. \n\nYour therapist understands exactly how much control you have: control over your own actions, and no one else's. And with this control over your own actions, instead of confronting these issues head-on, it seems like you're avoiding them completely because you get just enough satisfaction out of your fantasies to not completely lose your mind. Have you actually spoken to your husband about your relationship? How does he feel about your sex life? How has your relationship changed since your child was born--and how does that make you feel?\n\nInstead of daydreaming about these escapist fantasies, why don't you try putting some of that brainpower to work thinking about how you can move forward in your relationship with your husband? Imagine what you might say to him and how he might react. Use it to prepare you for actually talking to him for real. If you don't address these problems they aren't going to go away. This is your one and only life, you deserve to feel happy and loved. Don't waste your time escaping the real world when you could be spending that time making it better.",
            "This might be unhealthy because it is keeping you from actually feeling your dissatisfaction with your life and acting on it. \n\nInstead of daydreaming about a stranger, what about planning a romantic date with your husband? Instead of daydreaming about a life abroad, what about making a plan and s budget to visit somewhere? \n\nEveryone does the things you are doing. But if you do them too much, you're blocking your own way.",
            "Others have mentioned maladaptive daydreaming, and the part that many people don't get, is the 'maladaptive' part. A lot of people have coped with uncomfortable situations, or just plain boredom by creating a richer fantasy life. It's difficult to figure out when it becomes harmful but your therapist is likely correct that you might not be as emotionally available to others in your life because you're too focused on the fantasy life. It's also easy to start relying on it and ultimately finding your real life disappointing. BUt no real life can live up to our fantasies.",
            "I did that when I was younger, always making up scenarios where I was desired and loved. Turns out I just really wanted to be desired and loved. \nI agree with your therapist, because going too deep in those fantasies as your only coping mechanism doesn’t do you any good. Instead of working on real life solutions to make you happier you remain in the status quo and just check out. The fantasies are just s quick fix and won’t help you on the long run.",
            "I do the same thing with my wife, though mostly just in the hobbies and future plans. We've recently started couples therapy and her individual therapy because at the heart of things, she's just extremely unhappy and has no interests or direction anymore. \n\nI don't know if your husband has a similar problem, but me withholding the things I think about and hope and dream and want to do/achieve only made things worse. You maybe don't have to tell him everything, but it might be a good idea to share the things he could possibly be a part of, like the travel plans or romantic thoughts, etc.",
            "r/MaladaptiveDreaming",
            "You sound like me twelve years ago. I was miserable and depressed so I daydreamed constantly and imagined things in amazing detail to live this other life. All while working and paying bills and being a responsible adult. But when I left him and moved back home all that changed and now I do not need it.\n\nThink about changing your situation.",
            "It seems your therapist gave you the best advice, which they studied to understand and you paid for. Seeking answers on social media for a mental health issue that you've been told to address by a professional is very indicative of how unhealthy this habit has gotten, as you're now seeking guidance from the blind to ignore what's been brought to light. You even said your therapist was gentle about it. Listen to them.",
            "What, specifically, has your therapist identified that makes it unhealthy?\n\n\nIn other words, in what way does this rich inner life negatively affect your \"real life\"?\n\n\nIf your therapist is calling this unhealthy behavior, the onus is on your therapist to be clear and specific about WHY it's unhealthy. If they haven't done that, you should press them to do so.",
            "people are saying get a new therapist but a new therapist would tell you the same. This is maladaptive daydreaming. By you’re own admission you’re not happy. This is something you need to work on. It’s fine to have a healthy imagination but this is taking it a bit far. You also haven’t answered any question (that I’ve seen) about how often you’re actually doing this and for how long each time.",
            "I do this too, but I set a boundary for when it's time to daydream, when it's time to work, and when I'm spending time with family",
            "Yeah, I do this too. Not so much anymore but I used to do it quite a lot. I've always just had a very noisy brain. I'm not always part of the scenarios in my head but I find that the themes are often similar. Like the person or me is displaying some sort of power in the daydream. Maybe for you, it seems like love is the thing you focus on. \n\nI think the thing that strikes me is that you daydream to get through the day. I typically daydream for fun. It seems like this might be that you feel unloved/unhappy and are making up these scenarios to try and create that within yourself.",
            "I guess my only question would be: if you had the chance to act on one of those things, would you take it if it meant no longer having what / who you have right now?\n\nEx:\n\n- moving to the new place, imagine you’ve got the money to move no barriers BUT you don’t get to take your family with you. Would you still do it?\n\n- starting a friendship with the person at the library, but your partner was against it. Would you still want to follow through?\n\n\nYour therapist *might* be trying to say look, it seems like there’s things you wish you could do BUT are held back from them... are the reasons your held back valid? Or can you start doing some of the things you dream about (or planning them so you can do them). Cause if you really dream about wanting to do different things, you could ask yourself: what are the healthy things you can implement and then what are the unhealthy or unattainable things that you can keep fantasy?",
            "This seems like your way of coping with some unhappiness in your life. It seems like you can’t be your true, passionate self around your husband though you love him. \n\nThere might not be anything to change here but for you to come to a realization that regular life will NEVER be Ike what you fantasize even if you do try to live in a villa in italy and bake fresh bread and paint everyday. Well you have to still get groceries. And clean that villa. And where will you get money to pay for that villa. Where does your kid fit in here. Etc. I know you don’t have that dream necessarily but for example. \n\nYou can still fantasize of course but eventually you can hopefully reach a spot where it’s not consuming your normal life to the point where it makes you depressed.",
            "This sounds like maladaptive daydreaming, there is actually a subreddit for this! I used to do this a lot at home myself, I think part of it was a lack of stimulation in both my media consumption and general life.  I also find that when an area of my life isn't satisfying (romantic or otherwise) that \"tone\" or \"subject\" will be explored more. Boredom led to adventures, lack of emotional engagement meant elaborate evocative stories, frustration at my favorite subjects being missing from media meant replacinf nedia I've watched mentally with the additions I wanted to see.  This also kept me from taking action or exposing myself to the discomfort of change.\n\n\n\n\nSo, you mention your husband and you dont have a lot in common? Maybe instead of compartmentalizing and tolerating the status quo, being present and addressing this would be more helpful...? Just an idea.",
            "You have unrealistic dreams that are going to be a danger to your relationship if not addressed",
            "You are doing maladaptive daydreaming...\n\nI suffered with this for years. It’s usually triggered by music or a repetitive act like walking to your school or house.\n\nIt’s a coping mechanism, meaning something is bothering you about life. For me I was married to an extremely abusive sociopathic loser. I had no hope in life while married to him. I used to daydream while going to to work and coming home. Your not crazy because you know it’s not true. However, you don’t pay attention to your life. It’s a huge waste of time.  \n\nHow I got out of it was I got divorced. Now I kinda sat down and said if everything went right what would I have? Ok now is this still attainable? How can I do it and how long will it take. Then instead of day dreaming I would think about how what I needed to do, to get to my goals. \n\nEx, I wanted to be organized I started with making my bed every day. On the way home instead of day dreaming I would think about I have an hour maybe I can clean my microwave or fridge or buy some groceries. \n\nIn your daydreams, you maybe thinking about some prince saving you from an evil queen. Your looking for romance. Why not try to have a nice night with the husband? Make a nice dinner and watch a movie at home if you can’t afford a sitter? \n\nThe trick is to think about something that is attainable and work towards that",
            "Listen to the professional who knows you. You sound terribly passive and insistent on pretending you cannot do things about real life issues. Those are definite issues and internet strangers cannot help you with them other then to let you think they aren't issues. Get off the internet and think about what the professional you're paying is saying.",
            "I think you try to compensate what you lack in real life with fantasies. Others do the same but it is games, books, art, thwn there a travels, hobbies etc.\n\nAre there specifics of what you fantasize?  Answering it might help understand what is this lack in life. Also, if your life is quite boring like routine home work home. Try something new, like talk with a real peraon ib the library?\n\nI don't think it's bad. But if it's too much of it then it definetely means you are trying to fix something with such day dreaming. \n\nBe open with your therapist and help her to help you.",
            "Why are you seeking out advice? Why don’t you just listen to your therapist?",
            "Oh I do this! It's Maladaptive Daydreaming, it's a coping mechanism and can be quite unhealthy especially since it can cause false memories and it can blur the lines of reality or whatever",
            "I had to come out of the closet and fix my relationship with my family to stop dissociating like that. My therapist (also very gently) helped me find the reason for why I have such a happy imaginary life and have no drive to pay attention to my real one and in my case these were the key points. I still struggle with being present sometimes but making sure my own real life IS the life I want to live was step 1. I'm sorry you are going through this and I'm glad you are working to get better ❤️",
            "I used to experience maladaptive day dreaming as a coping mechanism to get through my first couple of highschool years, I was able to complete the work at home, but I have little to no memory of what I actually did at school/who I talked to because I would spend it just day dreaming",
            "What you are doing is a form of disassociation. I have bipolar disorder and this has happened to me a few times, unfortunately many things can cause it. I wouldn’t take advice from people on Reddit and keep going to therapy",
            "Yes I do this too and I’m glad I came across this because I’ve never heard of maladaptive daydreaming. I tend to do this more when things aren’t going well or I have a lot of emotions to process. I don’t know if it’s unhealthy but a lot of times when I do this, I do feel better afterward. I agree with others that it depends on how often you do this, how do you feel during and after, etc. My comment probably isn’t super helpful but I wanted you to know you’re not alone.",
            "I mean when I think through travel sites I am imagining myself on vacation, a vacation where everything goes perfectly. When I'm actually on vacation I'm trying to get jazzed about a Hampton Inn prewrapped muffin and squirreling away the last, bruised apple for later. I don't think it's wrong to be imaginative, but if you're only imagining good things... yes any actual life will suffer by comparison.",
            "Whoa, I’m you. Only that I’m not married, only been with my boyfriend for 5 years and we have one 4 year old autistic daughter. What you have is maladaptive daydreaming, and is a coping mechanism to deal with all the boredom, loneliness and isolation of marriage/relationships with a partner that is no longer a partner (at least, that’s my case, he makes me feel lonelier when I am with him than when I am by myself).\nEdit: cheating would be worse, In a situation where you can’t afford a divorce/separation, so escaping to a dream world seems like a somewhat healthy choice",
            "It’s maladaptive daydreaming.  \n\nI did it for years, as a trauma response.  I learned to just check out, change the channel, and think about something else.  \n\nWhat helped me was confronting what happened to me, finally, after 20 years.  Just saying it out loud helped. I definitely encourage you to seek out a therapist to help.",
            "I definitely relate. When I was younger, I would be incredibly detached from the real world, and would rather sit somewhere and write or sketch while imagining my adventures with non-existent people in a fantastical world, or even have conversations in my head with imaginary friends, than interact with my peers. I had major social issues. I only managed to get it fixed by pushing myself to take interest in people, form friendships, be open to different world views, etc. It sounds small, but there's a difference between apathetic acknowledgement and *interest*.\n\nNow, I feel like I lost a bit of myself. My fantastical and creative edge. But the real world isn't so bad, and I don't miss maladaptive daydreaming. I miss my creativity, but it also doesn't get in the way of my life as much as it used to.\n\nPut your hobbies aside for a moment during the day, and try to live like your husband. Like your peers. That's a story too, and maybe it's more interesting and worthwhile than you give it credit for. Best stories are always deeply rooted in the real world.",
            "r/MaladaptiveDreaming",
            "I (32F) definitely daydream all day, every day. I'm either focused on a task or in la la land. It's honestly kind of validating to know I'm not alone. \n\nI will say though... I get a lot of satisfaction in my real life, and for me, the fantasies are a creative outlet. I tell my partner about them, we laugh about it and, he suggests story ideas. I hope to write some of them down eventually. I play in these daydreams frequently, but I don't live in them. I think that's an important distinction.",
            "I do have some advice. I think you should ask your husband if he wants to take a trip somewhere. It doesn't have to be for very long, maybe a few days, maybe a week, if you can get someone to look after your child. I think you and your husband should go just the two of you. I think you need to spend some time with him and discover and explore something new, together. This might invigorate the both of you and satisfy your imagination a bit. This won't be a quick fix but I think this will help quite a bit. And if you still feel like you need to escape, might I suggest you talk to your therapist a little more and possibly consider couples therapy. But before the couples therapy, talk to your husband first. Ask him (if you haven't) what he thinks about it. You never know, maybe you'll learn something new about him and find an answer that way. Hope this helps!",
            "Honestly, I believe that same interests are bullshit( well kinda), hear me out, I think that same goals and values are what make a great relationship, cause when you’re together for many years change is inevitable- you grow and your interests change, however if you share the same values and goals (all your goals don’t have to be mutual, just to clarify) you are able and willing to listen to your partner and willing to take interest in their new/different interests, making your relationship stronger. After all hearing how someone’s day went, is much more interesting if their day was different from yours. \nI’m sure that in the beginning of your relationships you might’ve had more things in common, maybe similar interests, mutual friends, maybe you guys went to the same school, but you are here and right now and admiring your growth and the way you’ve come is marvelous.\nI hope all works out for you",
            "Wait i do this all the time and assumed anyone with a healthy imagination did? When you started this post I was expecting imaginary named people or places you regularly think about but what you described seems like completely normal imagination to me.\n\nI'm sure your therapist is great but I don't see why this needs to be something you stopped doing. Maybe she just doesn't have a very active imagination.\n\nIs it somehow detracting from your life?? Why does she want you to stop? What's unhealthy about it?\n\n\n\nETA after reading all the comments and seeing that there are lots of people who say the same thing I'm going to go ahead and say that I think someone without much imagination came up with this and unless it has a measurable negative impact on your life that it's ridiculous to call it a problem.",
            "[deleted]",
            "i mean wont you rather do those things instead of fantasize about them?",
            "I don't see a problem unless it's interfering with your day to day life. Is your daughter well taken care of? Do you attend to your responsibilities in a timely manner? Do you communicate and interact with your husband regularly? If so, I wouldn't worry about it unless you've, like, set the house on fire or something.\n\nThe truth is day to day life can be repetitive and frankly boring, and fantasizing is no different than playing a game, watching movies, or reading in order to stimulate your imagination. If you write all these things down instead of just thinking about them people would call you an author.",
            "I don't think what you are doing in essence is unhealthy but i'm not a professional, what do I know?\n\nI also have quite an active imagination and can wish up entire timelines that exist in parallel with my own life. I did this a lot more when I was a teenager and my actual life was a bit mundane. However now that I am an adult I do try and make my \"real\" life as colourful and enjoyable as I can.\n\nThis may be what your therapist may be getting at? Try and inject some colour and passion into your real life. It's like both you and your husband have settled but it could be worth try and revisit what drew you together in the first place and put some fantasy back into your marriage.",
            "You just sound like a writer to me, honestly! Have you tried writing stories? Even fanfiction is a great outlet.",
            "I feel like you are me exactly (minus the child). I have a mixture of immersive daydreaming and limerence that I’ve had my whole life. I have a romantic fantasy world in my head of a man I’ve never met and I’ve had other fantasy men before him. I recommend checking out either of those subs. When I discovered them it really blew my mind, finally able to connect with others about something I had previously not thought to ever look into.",
            "Sounds like my ex. I could never live up to her storybook standards, then she rewrote the story and turned me into a monster to get out of the marriage while still being good with God. She built this new fantasy world where she is this damsel in distress. I wasn’t perfect, but damn did I try and she broke me in the end. It was the most bizarre thing in the world. I’m still confused, my family is confused, and her family is confused. She said her family and I didn’t get along, but when I finally took all my things, her mom and I hugged and cried while telling me I’m family, always welcome, no one understands what happened, and the whole family is hurting - it helped me understand that I wasn’t the only one feeling confused, hurt, and lied to. This was confusing for everyone.\n\nShe was and still is going to therapy, but it sounds like she is in worse shape than before. I blamed myself for everything, but now I know she is off, needs serious help, and likely won’t get it at this point.",
            "I’m you. We’re lucky. Hold on to that beautiful way of thinking. As people get older they lose the ability to imagine a life more fulfilling then their own. As long as you aren’t harming anyone, including yourself... continue to dream big and live in little fantasies. I’m almost your age and I still talk to myself when I’m alone as if I’m in certain conversations or scenarios. I feel fortunate as fuck because if I ever end up trapped somewhere... me and my little soul will keep me entertained.",
            "Google ENFP and INTJ relationships. you'd be surprised how textbook this is.\n\nin short, he fell for you BECAUSE you are this way. try letting it out even more sometimes! (at least what's what I'd want!)",
            "Are you present for your daughter? That's who I'd be worried about.",
            "I 100% disagree with your therapist. There’s not a single thing wrong with you imagining anything. What happens in your head stays in your head. Even if you were to slip and let these thoughts come out of your mouth, what’s the worst that can happen? You’re not thinking bad thoughts. You’re just dreaming of a different reality. Nothing wrong with that at all",
            "Yes...I'm like that.  I also get caught up in movies and music more than I think most people do.\n\nI think the story by James Thurber \"The Secret Life of Walter Mitty\" was written for me.\n\n(edit:  to answer your advice call...nothing wrong with it.)",
            "Within moderation and if it doesn’t impact your day to day tasks, this doesn’t really sound that bad.",
            "Is your *fantasy world* negatively affecting your life and happiness? \n\nHas your husband or a close friend said something to that effect?\n\nIf the answers to either of these questions are no, and you are happy and satisfied with yourself, then there's no reason to change anything.\n\nWhy are you even going to therapy? Because the way you describe your imagination and fantasy world seems fine. And if you're happy and satisfied and don't have any problems that come up this and your friends aren't saying anything, it just seems like your therapist is trying to pick at you because there's nothing for them to do.",
            "I think as long as it's not distorting your reality, or harming you or your social relationships then its completely fine. A problem is defined by the person, if you aren't distressed by it and it's not affecting your day to day life, then I think you should go for it!",
            "Edit: damn after reading these responses I need to do some reevaluating \n\nI do this a lot ! It doesn’t disrupt my daily life but sometimes I’ll get into my feelings about it, but then I get over it. I thought about talking to a therapist about it. I wondered myself why do I do this. I’m 29 married with three boys. I’m prettt present in my real life but I do, do this a lot lol",
            "You could try yoga videos. A lot of the instructors really stress being present, and it's easier, because you're focusing on your breath and the sensations of the stretch. Youtube has a lot of great instructors like Yoga with Adriene and Yoga with Kassandra.",
            "get a new therapist? i'm really not seeing the problem here\n\nan active imagination is a good thing",
            "Dissociative fantasizing can be a remnant of a trauma coping mechanism but if it's not negatively impacting your life (job, relationships, family) I don't see a problem with it.\n\nDo you have any significant Pisces placement in your birth chart btw? A Pisces sun or moon, or Neptune in the 1st house would make you very dreamy like this as well !",
            "Yeah, Maladaptive Daydreaming, I have it but generally function anyway.  There’s a whole world and history and storylines going on constantly, integrated with real world things.  Music playlist and lists and things I try to write to go along with it.  \n\nIt’s troublesome in sometimes I can end up pacing the house and kitchen for a few hours if not pulled away.  I get a lot of cleaning done, but very slowly and get annoyed when distracted from my thinking.  \n\nSometimes I will become stuck in a new idea or plot line and need my husband to takeover with the kids so I can go lay down and work it out.  If not, I can get really frustrated, irate, stressed to the point of being snappy at people and bordering on panic attacks.  \n\nSometime choose to stay home or have an ‘off’ day because I’m stuck in a plot line in my head.   Sometimes idealize what sort of relationships I should try to find and foster based on the world in my head; that can be good and bad heh.  It is hard to explain to those that don’t have MD.  \n\nGenerally I’m happy with it.  I like my inside world and friends and lovers and places I visit, and I function well enough in real life to get by and take good care of my family.  I always feel I only half one foot in this world but I don’t know, I like my place (if not always how it makes me act), I suppose it’s some sort of coping skill and I do go hard on that, but there are worse ways to cope.",
            "You haven't said anything in your post that suggests there's anything wrong with your imagination or your life or you relationship. I hate how everyone immediately defers to your therapist. Therapists are just human beings subject to biases and opinions. People are different. Read about personality theories--some people are introverted and imaginative, and some people are the opposite. It takes all kinds to make the world run.\n\nLean into your strengths, and don't let anyone talk you out of them.\n\nP.S. Look at this way: Do you think Stephen King or J. K. Rowling are unhealthy because they've spent their entire lives in fantasy worlds?",
            "Sounds like your therapist is a bit crap at his (or her) job. If its not affecting anything in your daily life negatively, it is not an issue.\n\nIf these daydreams are not causing you to miss out of anything in reality and are for you a healthy way to cope with the normal stress of life, messing with it probably isn't a good idea. In fact it could lead to issues itself.\n\nYou say yourself - 'Married woman with stable married life, no real issues'\n\nIf this is true, why change anything? Alot of people would kill to be in this situation.",
            "A therapist only knows what you tell them. If your not being transparent it won't help. Are you sharing the fantasies for affirmation?",
            "I have something similar but not quite as deep as yours. I was also a fantasy writer and placed myself in the story and even placed my friends, family, and husband in as characters. I ended up having a falling out with a family member who I was writing a story with and it seemed to me he valued my writing skills more than our actual relationship. I watched him unravel in what appeared to be a mental health breakdown and noticed how out of touch with reality he seemed. It made me wonder about myself. I stopped writing fantasy cold turkey. It was really difficult because during my down time I couldn't just run story lines in my head. I still had the ideas but they became tainted and made me sad. I struggled for probably a year and felt aimless and uncreative. However, I decided to start focusing on real-life and writing what I remembered about my past and kind of created a little whimsical twist to it. So far I'm feeling a lot better about entering this creative space in my head again but this time I'm keeping focused on reality and trying to remember the truth of past events.",
            "Love is what you make of it. You say you dream about meeting someone with similar interests. Think about any old happily married couple and ask yourself if having similar interests was an important part of their relationship. Alignment of moods and the capacity for interest is more important than the interests themselves.",
            "Why thumb through travel website when you can go see the world. The pandemic is certainly a hinderance but you can see your country and travel through it. I bet you haven’t seen it all. Start planning travels and adventures to other countries and start meeting the people you draw into your fantasies. Maybe it’ll truly be a meeting of the minds. \n\nAlso maybe your husband and you can find common interests still.",
            "As strangers on the internet we really have no place to say whether your therapist knows better than us or you. Instead of coming to people who don't know you and your story, maybe you should listen closer to what your therapist is saying and the reasoning behind why she is nudging you toward being more present in real life. There is a reason you are meeting with her.",
            "Is it really not possible to find something to do together. Like finding a hobby that's new to both of you and something you both enjoy?",
            "Jesus does this shit have a name!? I do this. All.The.Time. Every day if I can, anything to get me through the day. I dont know what I'd do if someone told me I should stop. It's one of the only things I enjoy. Sad to hear you're struggling but very glad to know this is something other experience and not just my sheer unhappiness. Good luck to you.",
            "FWIW, hobbies and interests aren't a static thing. If my wife and I stayed siloed in our own projects we would have very little interest in each other's hobbies. But we've both put in an effort to find some shared passions that we can both enjoy. It might be worth trying out something new that you both can see yourselves enjoying to perhaps grow toward one another in that endeavor.\n\n-\n\nThis doesn't mean you need to abandon anything you spend time on and love, and you will always have some parts of yourself that are separate and that's a good thing. But maybe what you're looking for is a marriage that's more \"growing\" and \"dynamic\" rather than \"stable,\" and that can only happen when there's mutual intent toward a common goal.",
            "Hey, I do this too. A lot. I have ADHD and I'm a writer, so I do this both because my brain is unruly and because I require my imagination to write. Sometimes, it's fine. Other times, I've noticed that it makes me unhappy. I've imagined some lives that were \"better\" than mine in a way that actually started to harm me before. A lot of people are saying \"You seem fine to me!\" but they don't know what you tell your therapist. None of us do. \n\nThere is a reason that your therapist is encouraging you to be more present. Don't discount that. Please. A bunch of strangers on reddit - even the ones who mean well - most likely don't know better than your therapist, and they certainly don't know *you* better than your therapist. You're paying for therapy for a reason, so listen to that professional advice.",
            "I do this as well and often wonder if I am a weirdo. I fantasize about living in a completely different era and in situations that would literally never happen. I get embarrassed even thinking I do this.",
            "Honestly you could write these daydreams onto a story or something if you wish. I do this a lot too, I’m put in mind of LM Montgomery’s Anne of Green Gables. Now if you are having trouble distinguishing between your daydreams and reality or acting on them then that’s a problem.",
            "Dang sounds like you want to escape from your current life. Might be a good time to really evaluate if your husband is really someone you want to be with",
            "I liken this to drinking alcohol.  You are numbing yourself to your real situation, and not working to improve it, because you escape instead.  Like these travel ideas... That's not a fantasy.  It's something you could work on if you were more committed to your real life.  \n   \nIf everything in life is so fine... Why do you have a long term therapist?",
            "Find a hobby you can take up together? That's what it sounds like you really want. You have dates and time together but it seems you want something where you engage more deeply instead of being so invested in separate interests.",
            "I do the same and have for most of my life. Because I’ve always been quite lonely I’ve imagined entire relationships or idealized realities where I was talented and popular, I would go on walks with music so I could escape to that place. It was very addicting and I’d sometimes walk around for 3 hours and in the worst case scenarios couldn’t wait to go again.\n\nIt’s gotten less since I had a few relationships (I was a late bloomer) and some more friends. But I still go back to that place when I feel lonely again, it’s how I cope, through escapism. I can agree it may not be healthy but it has helped me with a lot of issues I couldn’t solve very easily. For instance my autism and inability to connect fully with others. \n\nYour husband is however, a real person that’s right in front of you, your marriage is something you can work on. By going to that safe place too often you can start to neglect the real world and things can escalate or decay. I think that whenever we have the ability, we should do all we can to make those dreams our reality. \n\nThere may be potential you’re not unlocking because your attention is divided between your reality and fantasy. It could mean rediscovering each other, but it could also mean seeing you may not be a match and opening the path to something better. One thing is for sure, you can’t wait for your life to pass by while you’re in dreamland. It’s far too valuable for that.\n\nEdit: saw some people talk about MDD and I decided to read into it. All the symptoms and full description are spot on and I’m 99% sure I have it. TIL",
            "I heard fantasy is an automatic way of thinking / coping to try and solve an issue from the past.\n\nCould there be something you need to look at?",
            "I've had my own second life since elementary school. Maladaptive daydreaming gas helped me cope with everything in my life.",
            "There is an episode of the podcast Invisibilia about \"Maladaptive Daydreaming\" called: \"Invisibilia: When Daydreaming Gets In The Way Of Real Life\" which you can google. It is the first thing I thought of when you posted your story. \n\nI don't necessarily think it's wrong to daydream if it doesn't interfere with your daily life and relationships. \n\nAs far as being in the present moment, I listen to a lot of Buddhist Dharma talks and have begun meditating. Good luck!",
            "Sounds like maladaptive daydreaming, it's actually really common, but can interfere with your day to day life if you're using it too much. It's a coping mechanism, which likely means you're unhappy in that area of your life (which tracks with what you've described). Have you expressed to your husband wanting to share a hobby or an activity to increase your bond? Thought about couples counseling or other ways to communicate and share more. Love languages could be a good thing to look into as well, perhaps you express love differently and could come to a compromise which will better meet your needs to feel loved and understood in your relationship.",
            "I used to do this a lot as a teen. I would dream up living in a different country, and having friends, having a dreamy boyfriend. \n\nThe thing for me was: I dreamt up friends when I was lonely. I dreamt up guys when I was a virgin who desperately wanted a boyfriend. \n\nI haven't dreamt actively and tried to since I became older because a lot of the things I used to dream about become reality, I felt happier in my life and reality is better than dreaming. \n\nI can't speak for you, but I do want to ask you a question: are you happy? With your life, marriage, how often you travel? Do you ever dream about stuff you are completely satisfied about? Like owning a different cat when you already own one? Or is it mostly romance and travel? \n\nYour marriage sounds okay in some ways. In others though.... sharing passions is important. You don't need to have everything in common, but I can show an interest in my fiancé's hobbies and listen when he talks about them. Remember what he tells me so I can comment on it. He does the same for me. The fact you don't have a space to be passionate about stuff you care about sounds... lonely.",
            "I do it too but mostly when I try to sleep, I try hard to not do it during the day",
            "I do this too! I would not want to give it up quite honestly. I’ve done it for as long as I can remember. Mine is heavily related to music. I like to drive and listen to music and that’s where these very drawn out daydreams occur. However for me I feel like it clears my head. \n\nI do sometimes lay in bed and daydream. When I was a kid I liked to swing on the swingset while listening to music. I think it is obviously escapism. They are fantasies that generally involve real people and scenarios that will never happen! I think books, music, movies, TV can inspire it. I do tend to get “lost” in a book or a show. Again. I’ve been this way forever. \n\nThat said, I think I am mostly functional :) I work, have friends, have a relationship, care for my children, etc.",
            "I relived heavily on maladaptive daydreaming to get me through my childhood and adolescence and I think the important thing to note is that having a rich imagination isn't the issue, it's how you can use it to divert mindfulness\n\nAs an adult I struggle a lot with my mental health and a lot of it comes from me never learning how to practice mindfulness; some of this comes from my neurodevelopment, like I have conditions that make it hard to sense what's happening in my body, conditions that make it hard to recognize what I'm feeling, conditions that make it hard to focus and have awareness. These things on their own aren't issues but in practice I tend to neglect my needs and become dysfunctional in my efforts to manage my life and regulate my emotions\n\nHaving an imagination like ours is a gift and being able to distract ourselves from the discomfort of our lives is a valuable skill, but like all coping mechanisms they can sometimes become unsustainable. It's like a tent you set up in your front yard because there was a fire in your house. You can live there for a bit and it might even be fun for a spell, but at some point you have to fix your house before a storm comes along and knocks your tent down around you",
            "I have day dreamt  my entire life, but honestly, who doesn’t on some level.  I don’t share my fantasies or day dreams with  my wife because they are not relevant to our life at all. I think our brains have a, passing time, kind of mode? I don’t know that for a fact but maybe?",
            "I used to do this all the time too, and only recently realized that it's basically a form of dissociation used as a coping mechanism to get through my then terrible relationship. I felt stuck and thought I'd be stuck like that forever and just figured I could fantasize my way through life. I also did this a lot as a kid when I was abused and neglected - I used to praise myself for having an amazing and active imagination too but like I said, I realized I've only used it during times in my life where I've had to. \n\nMy dreams on the other hand, were very vivid and telling me something was missing or wrong during those times. Since I couldn't control them like my daydreams it was giving me signals that something was wrong. \n\nI think your therapist may be right and you may have some reflecting to do. Do you feel stuck? Empty? Angry? Unheard? \n\nAsking here is a good start, and I wish you well on your journey.",
            "I don't daydream wuite that much, but I do have full dreams of just talking to strangers  about everything and anything including sex stuff, not doing stuff with them just talking",
            "The times in my life when I’ve done this are the times when I have been deeply unhappy with some aspect of my own life and unsure of how to deal with it/how to acknowledge it to myself. \n\nI agree with your therapist in that your energy is better spent focusing on your actual life, but not in the sense that you should just repress it. Reflect on what is being fulfilled in your fantasies that is not being fulfilled in your real life, and how can you change that?",
            "Reading this makes me realize I do this and I’ve done this since I was a kid.",
            "It kind of depends - does daydreaming like that make you less satisfied or happy with your real life? If yes, then it could be good to not daydream like that for a while and see if your satisfaction with real life increases, or if it changes your behavior and habits in real life (ie you feel more engaged so you do more things and therefore feel more fulfilled, etc).  \n\n\nYour therapist is probably encouraging you to be more present in your daily life because some of the current research about fulfillment and happiness (and actually brain health too) emphasizes being present in each moment as one of the best ways to feeling fulfilled and happy. There's also research on daydreams as being counterproductive to meeting real life goals (because you get the same satisfaction from a daydream as you do from meeting a goal, which can deplete your drive to complete goals). If you just use daydreaming as a way of entertaining yourself and passing time, then it's probably harmless though.   \n\n\nYou can try cutting back on the daydreams and being more present. Another thing you could do is just ask your therapist why they think your habits are unhealthy and in what ways they're harming you, and just ask for a really clear breakdown of your therapist's thought process. Remember you don't have to stick with a therapist if they're not doing you any good, but also your therapist has a differently informed perspective and may be seeing things about you and your situation that you don't fully see yourself.",
            "OP, I don't have much advice to give but I just wanted to say that I seriously thought I was alone in this kind of situation. I have very intense elaborate fantasies and have imaginary worlds to escape. After growing up as a disabled only child in a neighborhood with no other kids, imagination helped me feel less lonely and pass the time. As I got older the daydreaming would become disruptive and caused me to get into a fender bender that was was my fault. I set many relationship on this pedestal and they failed because they didn't match my fantasies. According to the other comments, this could be maladaptive daydreaming. The daydreams come and go at this point. \n\nI think daydreams are overall okay but I think it's important to asses the root of them. A recurring daydream I have is being in love in a same sex relationship yet I am very much in live with my opposite sex partner of 4 years. I reflected on this for a long time and realized I'm probably bisexual. I still daydream about that fantasy and told my partner about the fantasy. It helped our relationship grow which made me fall for him even more. \n\nAnother fantasy is having superpowers. I believe this stems from me feeling ashamed of my disability and wishing I had super abilities instead. I could go on.",
            "I like to do that while in the shower lol.  Or maybe I just think of things I did throughout the day and play them differently in my head.  Usually it’s me thinking of that awesome comeback I didn’t think of at the moment...or I think about winning an Oscar or something like that lol",
            "Another sort of input other than maladaptive daydreaming: I am a daydreamer, easily excitable, easily bored person and I last summer found out that I have ADHD. Daydreaming, from my understanding, can be an internalized sort of hyperactivity with adhd.\n\nAre you... \n- messy\n- forgetful\n- hopping between new hobbies\n- feel like there’s not enough time in the day to do things\n- a procrastinator\n- easily distracted\n- talkative or finish others sentences\n- someone who dominates conversation\n- someone struggles with deadlines\n- someone who struggles with starting or finishing projects that require a lot of mental effort\n\nThis is not for diagnosis, but all of these things were brought up when I was getting diagnosed.",
            "listen to your therapist",
            "A fellow dreamer, it's nice to know you're not the only one. I think it's nice to take a break from reality, and having a world in your mind to go to get away from your real life. I personally don't pay people to listen to me (to each their own), and your therapist is most likely concerned you're not going to be able to separate fantasy from reality. Maybe, you'll be unhappy returning to real life. I don't see it that way, I enjoy living in my head and taking a break from real life. Anything is possible and you can go anywhere your imagination takes you. Some people do not have such vivid imaginations and might think those that do are not alright. Who cares, whatever makes you happy is important. Don't feel like something is wrong with you, because it's not. People like your therapist can only see what's in front of them. Others can see to the edge of the universe and beyond. (:",
            "Wow, I didn’t think this was a bad thing? Just spices life up a bit.",
            "I used to be very like that. It was Yoda who told me about me talking to Luke \"never his mind on what he was doing\", me ! I have had \"to die for \" jobs that were like fantasy and some boring jobs. One that I liked, had me in parking garages for hours and that can be tedious. And that's when I got nearly in trouble. I didn't have to close my eyes and the walls faded, the cars went away and an ocean swelled around me. The self induced hallucinated area was in my mind, not drugs , no thing ingested, just powerful imagination. And I realized as much as I loved breaking free from the tedium, I endangered myself. I had to stop most of that or I could go crazy, maybe I am. I think it's awesome you are good with words and can write it down. I would use that and write it all down. Just try to stay grounded.",
            "I was the same way when I was a kid/teenager.  It stopped when I started having a romantic life and making friends.  Nowadays it’s in the form of me imagining myself as a famous musician when I’m listening to music.  Probably because my job kinda sucks and I’m broke.  The way I daydreamed when I was younger was like an all day every day thing and nowadays it’s rare.  I think for people like us, the better our situations are the less we fantasize about stuff",
            "[deleted]",
            "Honestly I do these same things and I’m just a healthy creative.",
            "Sounds like us...no adult fun at all, no dates since pre COVID, dead bedroom, kids up until we go to sleep, wake when we wake, or wake us up, no real breaks, no naps, nothing...just work and kids, repeat every single day.  Neither of us has hobbies or friends.  This sucks.  Its childrearing 24/7/365 with no end.",
            "There’s nothing wrong with you, your ENFP! X",
            "It's all well and good that you have a stable married life, but what do YOU do? Do you have a life outside your marriage? Friends, hobbies, goals etc... People are saying you have maladaptive daydreaming, but maybe you're just bored. People need more than mere stability, you need a life beyond your date nights. What are YOU doing to stimulate yourself in real life?",
            "And here I thought that was a poetic soul....",
            "You have maladaptive day dreaming. Plus some hormonal imbalance (probably).",
            "I don’t think as extreme as you but yes I’ve daydreamt a lot and often found myself thinking about what if’s so hard I didn’t even know what was happening in real life (like I was in auto-pilot mode).\n\nMy therapist suggested meditating for me since it forces you to stay present and do nothing that can distract you. I like using guided meditation apps. If you don’t like meditating or just can’t, you can try just slowly practising being in the present again. For small steps my therapist suggested I pay attention to the mundane activities like driving to work or brushing my teeth and just pay attention during those times. It might help to like narrate in your head what you are doing (eg. “I’m moving my tooth brush left and right”).",
            "I do similar things to this.. I didn’t know that wasn’t normal??",
            "Hey thank you for posting this and sharing this about yourself. This is a super informative post and I definitely relate to this a lot. I never knew there was a term for it, and it makes a lot of sense that it’s a coping mechanism. You’re not alone in this 💜",
            "I wish I did this more",
            "I do something similar. I’ve had a running story in my head since I was maybe ten? I go further in the story as I’m falling asleep, or I think about it when I’m not otherwise occupied, like when I’m walking my dog by myself. It has never been an issue for me, but if it’s causing problems I’d definitely think about why. For me personally, it’s just a way to relax. I’ve “written” a very lengthy tale in my head.",
            "I've been worrying about fantasizing, thinking, wondering too much lately in front of people. I have not felt present somedays. I really think it's a coping mechanism. I've had a lot of changes this year: covid teaching, moved faster than planned, wedding planning. I have people badgering me about wedding stuff/condo repairs/work stuff while I am trying to do other wedding stuff...or just trying to have a moment.",
            "r/MaladaptiveDreaming",
            "Daydreaming is the most important thing in my life. I couldn't live without it. That said, if it gets in the way of real life, you need to scale it back - or make the call that a dream is more important to you than reality.",
            "is your name walter mitty?",
            "One thing I've noticed in myself is that when I am satisfied with my real life, I daydream less. I use it as a kind of indicator almost, because sometimes I struggle to know my hearts' desires. It occurs to me suddenly..I haven't daydreamed in weeks. It's always when I'm content with my real life or proud of where I'm at with something..\n\nI would take this level of daydreaming as a sign it's time to change things up.",
            "I think what you are doing is fine as long as you don't let your real-life world slip from focus. Not every moment of the day has to be spent being super-productive and \"present.\"\n\nWith that said, if you find yourself spending more time fantasizing than living in reality, you might want to consider making a few changes in your life to escape the need to escape. The way in which you describe your relationship with your husband leads me to believe that the long-term solution is not for you two to be together.",
            "I have my own fantasy world too. I’m a singer and dating another popular singer. I have playlists relating to this fantasy world and stuff like that. Not sure if it’s healthy but you’re not alone.",
            "I do this to fall asleep at night, I’ve had the same story with the same characters since I was a child! Love hearing others doing the same",
            "Yes, I'm dealing with something extremely similar. What happened was that when some external factors made my life more stressful than ever before, I didn't have the coping techniques needed to get through it well. \n\nMindfulness works and it's lovely. The more I practice it, the more fulfilled I feel in my life. Plus, getting more in the moment and mindful of your life in the now doesn't take away anything from you.  Your ability to have delicious daydreams won't go away, but you've added a new skill to your life.  That alone makes it worth it.",
            "I used to suffer from maladaptive daydreaming. I actually kind of miss the satisfaction I used to get from a really good daydream...but what really brought me out of it was my divorce. I realized I was daydreaming so much because I was truly, deeply unhappy, so I changed the things I didn't love about my life and now I dont find myself daydreaming (or even actually dreaming) at all really. The downside is I'm a writer too and I've had horrible writers block since becoming happy lol I just can't get to those places as easily.\n\nEdit to say I'm certainly not suggesting you also divorce, just that you maybe look to improve aspects of you life that don't satisfy you. I started traveling more, like I would if I was in a fantasy, I focused on my health, appearance, hobbies, just put more effort into making my life as close to my \"daydreams\" as possible. Maybe it sounds silly but as someone who has fought depression and obsessive daydreaming for years, something clicked and I just started living those dreams out as much as possible",
            "I’d listen to your therapist. A little fantasy now and then can be a good thing, but it’s important to try and stay grounded and live in the hear and now.",
            "Hi. I do the same. \n\nMay I ask you what actually brought you to therapy? I’m of the personal opinion that if it isn’t in fact affecting your life, it may not be the thing to focus on. \n\nHere’s my experience- I once told my husband allll about one of my long thought out scenarios. One that I had for years and was very fleshed out.... and once I shared it, I felt violated. I don’t know what that means, entirely, I’m just relating facts. \n\nMy conclusion is that so long as I’m reasonably happy and functional in life, this isn’t a problem..... and I suffer from the loss of it.",
            "Daydreaming was how I finally broke it to myself that I wasn't happy in my marriage. I would be fantasizing about willing the lottery (a lifelong fantasy daydream) but I noticed one day the my husband was always mysteriously absent. Eventually I realized that it has turned from fantasizing about winning the lottery to fantasizing about a life without him.\n\nI'm not saying that's what you're doing. I'm just saying that's hit played out for me. I had at one point found the idea of ending my marriage incredibly intimidating, but eventually I realized that was what I wanted most. \n\nI got out. I'm now remarried. All my lottery winning plans/fantasies/daydreams include my husband.",
            "I think you do this because it doesn't feel right with your husband. You want to leave and find someone you connect with. There is something in your relationship which feels wrong to you and this is your way of escaping that issue.\n\nBe honest with yourself and follow what feels right for you.",
            "If its an unhealthy coping mechanism, i am screwed.",
            "I do a similar thing, living in a fantasy world. I have this whole fantasy world that I retreat into filled with dragons and steampunk elves and magical kingdoms. My therapist has also pointed out its kind of a coping mechanism for me when I get anxiety, but also I just use it to fall asleep and stuff. Like a pre-sleep dream. I’m studying game design so that I can channel this somewhere. I used to write stories but I don’t have much time for that anymore. But a chunk of my free time goes into my fantasy world every day so I don’t feel as much of a need to retreat there during the rest of my day. Now this has usually become the time before bed where I retreat there. And I like playing WoW and roleplaying to bring a bit of it to life",
            "I don’t see the problem here. You don’t have maladaptive daydreaming as some people with no medical knowledge have suggested. You’re simply imaginative and creative. You do what most imaginative normal people do, you make up stories in your free time, when you listen to music, walk on the street or do something random when other people would either have no interesting thoughts or think about how their day is going. Everyone “daydreams”. The difference is that when one walks to work they create interesting scenarios in their heads while the other thinks about what they’ll have for lunch. I’d suggest finding a new shrink. You also need a bigger creative outlet than what you currently have. Either a job that allows you to be fully individualistic and creative or a couple highly creative hobbies. Or you could spend more time writing.",
            "I used maladaptive daydreaming as a survival tool in my last relationship. \nIt's incredibly addictive too and imo not healthy. \nThere were big stretch of times where I would just live in the world's I created, where people loved me and I had control. \nIt certainly effected my real life and it and depression fed off each other.\n\nWhen I got into a new realationship, had been going to therapy for awhile and start anti depressants, I found I was doing it less and less without realising it. I still feel the pull to just do nothing but daydream. I was actually going to put some music on now im I'm bed and go for a dream dive, but after this post maybe I won't. \n\nFrom my end, it was an unhealthy coping mechanism so I only have a negative take on the practice, but as its additive, it doesn't surprise me your diving a lot. \n\nIm sure there are people who are happy and healthy that do it too, but everyone I've read about or spoken to that does it, use it as a escape mechanism from real life, and as you are in therapy, is there anything you are trying to escape from? Wish you could change in your life? \n\nWas there an age you can pinpoint when it started and if it relates to anything that happened during that age? \n\nYou do something I used to do, which is insert myself into love songs, maybe you feel you are missing something in your married life, eg romance / desire / feeling desired ect \n\nI didn't feel wanted, desired or loved and due to abuse, had no form of control in that past relationship so In mine I was powerful and it usually revolved about someone desiring me or loving me. \n\nIf you have recurring themes in your daydreams, write them down and talk about it with your therapist, you might find that your subconscious is trying to tell you something",
            "Uhhh, this is exactly what I do! I just thought I had a rich imagination.\n\nInterested to see replies.\n\nETA: I have now read. I would say I am more of an immersive daydreamer after checking that out thanks to another poster.",
            "Ahh Harry, it does not do to dwell on dreams and forget to live..",
            "You sound like except I'm not married. I can't imagine a life with fantasies and imagination. Never give it up .it's a gift and you won't get a second Life to experience it. You mentioned your family is doing fine. So why change anything? No marriage life is perfect. Even the marriage life of your counsellor. Pls continue to be yourself and explore worlds"
        ]
    },
    {
        "post_id": "d90hrh",
        "author": "None",
        "title": "[Update] My (20F) sister (13F) has been experiencing something Seriously scary and I don't know what to do",
        "url": "https://www.reddit.com/r/relationships/comments/d90hrh/update_my_20f_sister_13f_has_been_experiencing/",
        "score": 2790,
        "num_comments": 111,
        "created_utc": 1569400943.0,
        "selftext": "Let me begin by apologizing for not interacting individually with everyone that responded to my previous post, exam time's been keeping me upto my neck in books.\n\nThank you for your help. I'm so grateful. I talked to my sister again yesterday and explained to her that may be a stress generated problem or the possibility of her being ill for which she might need to see a psychiatrist. \n\nIt's because she requested in the first place that I do not inform our parents that I agreed to it. However, I explained to her that if she needs further treatment we will need to tell them, and she has agreed bc I spent a considerable amount of time explaining that I did not, infact, think that she was a lunatic, and that mental illnesses need to be addressed the same way physical illnesses are, and that I just want her to get better, the same way she does. I talked about the same with my brother, who concurs.\n\nShe has agreed but only after first seeing a psychologist employed by her school (she went to the counselor that day and was advised to do so), whom she will be seeing today. Hopefully things will get better and I'll try my best to help explain her condition to our parents to keep them from doubting her. Truthfully, I could not have had this talk or reasoned through this situation without all of you. I am extremely thankful. 🙇🏾‍♀️🙇🏾‍♀️\n\nTl;dr My sister agreed to seeing a psychiatrist conditional on recommendation of a psychologist, thank you for your help\n\nLink to original: https://www.reddit.com/r/relationships/comments/d7wngm/my_20f_sister_13f_is_experiencing_something/?utm_medium=android_app&utm_source=share",
        "permalink": "/r/relationships/comments/d90hrh/update_my_20f_sister_13f_has_been_experiencing/",
        "comments": [
            "[deleted]",
            "I'm really glad you talked to her about this- the teen years can be fairly traumatic when a mental illness manifests and there is the fear then you are one of those 'lunatics' so I'm glad you made sure to approach it in such an open way with this towards her, I'm sure she won't forget your support and wish her the best.",
            "I have hallucinations at night. Usually just as I wake up from being asleep. I see bugs crawling on my bed or hanging from my ceiling. I once thought my husband’s face was covered in fur. It’s bad enough experiencing them as a 34 year old woman, I can’t imagine being a teenager and seeing mutilated bodies. Medication helped me, I really hope your sister is ok!",
            "Can we get an update to this update? I’m curious to see what happened and if the psychiatrist has learned anything from her.",
            "I'm glad to see an update on this, and you're doing great to have her see this as tackling this like you would any physical illness. That will help if its something longer term than stress induced hallucinations from lack of sleep etc.\n\n&#x200B;\n\nDo tell your parents, they should know because even if this is \"just\" stress induced, it probably means the school environment/commitments are not the best set up for her just now, to experience so much.\n\n&#x200B;\n\nGood luck!",
            "I'm happy to see an update, great work letting your sister know it's alright to be ill and that there is help!",
            "I also get auditory and tactile hallucinations when I am falling asleep, after nightmares and when waking up. I had a sleep disorder for a while, so it may not even be a mental health problem. Not that it should matter, I'm just saying to bear that in mind as I needed to see a neurologist to get any answers, not a psychiatrist. While the sleep disorder has now gone, I still get the hallucinations and sleep paralysis most days and some of them are brutal. It's unpleasant but it's harmless (for me, anyway - when I wake up yelling I think my dog would disagree)!",
            "Hey, I went through this with my daughter (13) only six months ago. Hallucinations like she described can be caused by everything from untreated thyroid problems, certain illnesses such as anti-NMDA receptor encephalitis, Vitamin D or B12 deficiency, extreme fatigue and stress, or in my daughter's case, stimulant medication (adderral) that was a little too high combined with extreme stress, and of course more serious mental health problems like schizoaffective mood disorders. \n\nA neurologist told me stress-induced hallucinations tend to show up as the day progresses. You don't just wake up to them. Medical or mental illness-related hallucinations will occur at any time of day. Keep in mind that hallucinations aren't the same as psychosis, and if once she's rested & de-stressed and still sees them, but she is otherwise sane, can tell they're hallucinations, not experiencing other symptoms of mental illness, etc., its much more likely there is an underlying medical problem. \n\nI wish I had seen your post yesterday, but hopefully you see my comment here. Her particular description of hallucinations remind me a lot of what was described by someone who had untreated hyperthyroidism and eventually thyroid storms without anyone realizing it. Please make sure she sees a medical doctor, too, for a complete physical with bloodwork.",
            "I'm so glad that she's getting help. I'm so sorry that she is going through this. You are a great sibling to have the kind of relationship where she is able to trust you with important things like this.",
            "You are a really good sister and she is lucky to have.  I hope that she is able to get the help she needs and some treatment or support so she can recover.",
            "That must be terrifying for her. You're a good sister for trying to help her get through this. I hope she's well soon.",
            "I am so relieved by this update! I am especially relieved that her school has a counselor who was able to refer her to a psychologist--it sounds like now she can get the help she needs. Wishing you all the best.",
            "When she sees these things can she move? Or does she feel like she’s trapped in her body? I have sleep paralysis on regular occasions and it happens when I fall asleep or when I’m waking up. Basically I hallucinate about whatever horrible thing my mind makes up and at the same time, I can’t move. Figures and demons and blood and gore are incredibly normal. And it feels so, so real. It’s awful and it feels as real as the “real world”. Regular nightmares got nothing on this. \n\nI sleep in total darkness because then I know that whatever I see is not real. You can’t se a face or a shadow if there is no light. It helps a tiny bit. \n\nI have my sleep paralysis because I have narcolepsy, and it’s normal for it to develop during the early teens and it get missed or misdiagnosed, a lot. And I mean A LOT. Might be something to look into? \n\nI hope you can get to the bottom on this so the poor girl can get some sleep.",
            "I wish I had someone like you in my life when I was her age. Mental illness is so scary but I'm sure she already feels much better knowing her sibling separates her from the sickness and wants/encourages/guides her through the process of getting help.\n\nEspecially glad your brother is on board too (idk what direction I was prepared for him to go considering he went to supernatural things prior haha).\n\nAlso, don't worry about reply to all of our comments, we're just glad to hear a positive outcome.",
            "I’m glad you were able to talk to her!\n\nI would just say make sure you follow up with her about what the school psychologist says. Just based on some of the words used in your post, it sounds like you might not be in the US, and depending on what country you’re in, mental illness may not be taken seriously. I hope she gets better soon!",
            "About seven years ago, I experienced a series of auditory hallucinations. It was horrifying beyond description. I know that it was mental illness related because I had been experiencing several crippling meltdowns. The voice was very specific and I will never forget it. I haven't heart it since then, but it was more real than anything I had experienced and I ended up sleeping on my parents' floor at the age of 17. \n\nI believe your sister. And she will be okay. Even if this isn't temporary, she will be okay. Thank you for taking this seriously. She might be in for a future of difficult mental illness struggles. She's at about the age when most mental illnesses manifest. So stay by her side, and she will get through this. \n\nIn terms of hallucinations....I wouldn't share those explicitly with your parents. Maybe share that she is struggling. But not everybody can handle that. \n\nGodspeed. I'll watch for your next update.",
            "Looking at your original post, I wonder if she's having sleep paralysis episodes. I started having them almost nightly at age 13. They usually happen right when you're falling asleep (which explains why she's seeing them shortly after laying down to sleep). Mine also involved hallucinations where you can look around your room but it's suddenly inhabited with some sort of creature(s). Often times people have the same creature(s) visiting them, hers may just be bloody corpses. I also definitely had a feeling that I was being watched during these episodes. \n\nSleep paralysis is triggered by stress and it sounds like she's super stressed out.",
            "Idk what's been said before but the first question that popped in my mind was did she ever have any violent experience before? Or did the bodies that appear were \"invented\" by her? Could she have seen sth similar (in a movie or in real life) that traumatized her and she doesn't want to talk about it?\n\nYou're doing a great job helping her, good luck for your exams",
            "OP, your sister needs to be seen in an inpatient setting. With the amount of fear you describe, and with the ongoing hallucinations, she is a risk to herself. I think you need to tell your parents so that they can urgently address this.\n\nIn the inpatient setting they can monitor her for safety, appropriately diagnose her, start her on medication if indicated, and monitor her for side effects as medications can take several weeks to reach therapeutic levels. It would also relieve her of the stress she is experiencing in school which is compounding her mental illness.\n\nPlease speak to your parents and convince them to bring her into the ER. With her reluctance to tell an adult it is possible she is minimizing her symptoms and won't receive the help she needs.",
            "I’m happy she’s getting help. From the first post it definitely seemed like between the stress and now sleeping (interesting fact: a person who goes without enough sleep over a period of time can be just as crazy as a person clinically diagnosed as a psycho). \n\nOf course if she calms down from stress and gets rest and it’s still happening it’s for sure something else",
            "I wish her the best, I really do hope the councelling helps.\nIs there a reason she's afraid of telling your parents? A good parent would see this as a cause to worry and seek better care for the child. It's JUST high school, for it to be causing that much stress isn't healthy or normal.",
            "The amount of fear she is experiencing and seeing the same hallucinations on rotation reminds me of when I had my psychotic break. It sounds like a bad thing but basically my stress levels allowed my psychosis to reach a level that it was noticeable. Then I went to my psychiatrist and was put on antipsychotics and my life has improved immensely since then. Your sister is on the right path. Sending good vibes. I hope she finds the right meds for her quickly.",
            "It’s common for a lot of mental illnesses to show up around 20 years old so I wouldn’t rule out some kind of ongoing mental health issue (schizophrenia, etc.) however this does seem at least partially stress induced. And it could be a nasty cycle that this happened once which kept her from sleeping and scared the shit out of her which led to more stress and less sleep which led to more hallucinations. I will say when my cousin was in college he had similar hallucinations where he would be walking down the street and see demons sitting on people. I was very young and didn’t learn about it until years later but he found relief in going to church. I wouldn’t recommend that as treatment. But I do think finding a community (he’s always been a loner) helped him and as far as I know he never had the issues again. And he has 4 kids (including one who is autistic and one who has severe ADHD) so he’s definitely had stress since then. All this to say it could be a very acute issue that can be treated and may never be an issue again but she’s doing the right things by seeking help. And you’re a very good sister for leading her in that direction.",
            "Did anyone mention the possibility of Lyme disease or PANS/PANDAS? In mental health it is important to rule out possible physical causes before making a diagnosis so please make sure she is examined physically so she is not improperly treated with antipsychotics/mood stabilizers at a very young age.",
            "Hi there! I read your story and I'm sorry your sister is going through this. I'm no doctor but I'm a nurse, and one important thing they teach us it to BELIEVE the patient's pain. I'm glad you decided to take action instead of letting it wear off. Even if it was fake, it is important to have a professional's opinion. It could've gotten a lot worse if nothing were to be done.  You are a great sister!",
            "This could be so many things, including schizophrenia but nor matter what she needs to see a professional immediately as it most likely wont go away and nothing anyone on reddit can do to diagnose it so I am glad she is seeing someone. I just hope they arent going to brush this off at the school as nothing as it most definitely is something and something major to treat. The good news is no matter what it is they most likely can help treat it and limit, if not get rid of these hallucinations but the sooner she gets the treatment she needs the better off in the long run she will be.\n\nDont let this go untreated if the school does brush if off, I can tell you love your sister and wants the best for her so it may definitely involve breaking her trust to make her better and you have to be prepared to either let your parents take over care or make her get treatment if she is too scared and doesnt want to. Her health and well being is more important than your relationship no matter how shitty a situation that actually is.\n\nOne question before I go but what country or part of the world are you in?\n\nBest wishes to you and your sister, I hope one day you update us that she is doing great and thriving again!!",
            "You guys are good siblings for giving her the support and reassurance she needs to tackle this. As others have said, it may not be something as 'scary' as a mental illness. My roommate in college had similar experiences when she was falling asleep. \n\nSometimes when the mind is very stressed and sleep-deprived you can have hallucinations during the sleep-inducing phase. It's actually very common, it doesn't mean she is crazy or has a mental disorder, and can be treated either with medication or self-care.\n\nCan you have your sister read this post? The replies here are very reassuring that she is not alone, that what she is experiencing may be very common, and doesn't mean there is anything wrong with her.",
            "Well done\n\nTwo \"Atta Girsl\" and one pat on the back for you.\n\nShe is getting help, and has started a hard process. I am sure you will support her all you can",
            "I still can’t believe your brothers mentality. Does he not know of the story of Anneliese Michel? It’s definitely something he should research. Never blame a sickness on fucking ghosts.",
            "Honestly from the comments, it seems like there are a lot of things this could be. I read your first post and my first thought was a sleep disorder or sleep paralysis. I really wish the two of you well, I hope she gets help and stops seeing such scary things!",
            "Kinda late to that party, but I didnt see the original post so I guess I'll have to do with giving my thoughts here. I'd like to start by saying how sorry I am about your sisters current condition, I can tell you first hand what type of hell it is she's going through (although maybe not to that extent).\n\nSo for starters, your sister needs to seek medical care ASAP. These issues have a tendency to grow larger and larger the more you push back seeking professional attention. As for why I think I have a bit of experience in this field is because although not as severe, I did go through something very similar at around the same age myself (12-15). As for my diagnosis, paranoia and sleep depravity were the culprits. Not going to go into too much detail about what I saw, but I will say it involved me hallucinating very vivid silhouettes of human-like beings that would often taunt me much like your sister. Again, not going into detail for personal reasons.\n\nAs for my solution, aside from sleep medication and weekly therapy, I developed a rather unorthodox method to getting rid of the paranoia. Simply put, I'd watch episodes of my favorite cartoon (Amazing world of gumball) before sleeping and would essentially play them on loop in my head to drown out the paranoia until I fell asleep. I can't say it worked 100% of the time but it helped a great deal and had a pretty noticeable success rate.\n\nI don't know if any of this will help your sister's current situation, but if its anything like what I had it may be a good start. God bless. :)",
            "Your original post makes it sound like she has sleep paralysis.\n\nI used to get it when i was younger and had poor sleeping habits (mainly long naps during the day instead of sleeping only at night).  \n\nOftentimes i would get a loud piercing sound in my head.  Sometimes I’d feel like there was a foreign entity in the room.  Both would disappear as soon as I could regain motor function.",
            "I'm so glad she's seeing someone! \n\nThere are several things that can cause psychosis including schizophrenia, schizo-affective disorder, bi-polar disorder,  infections especially with high fever, drugs both recreational and medicinal, lack of sleep.  Sleep is interesting because a person with bi-polar disorder may not sleep (as caused by BPD) and may also experiencing psychosis (as caused by BPD)   That is the lack of sleep does not cause the psychosis, the BPD causes both.  \n\nPsychosis = hallucinations (any of the senses - you can have 'smell' hallucinations) and delusions (like religiosity, grandiosity - believing things that just can't be true).   This is very different from psychopathy = a psychopath aka sociopath = no conscience).\n\nIf the cause is a mental health disorder, your sister will need more than a psychologist.  She'll need medications such as anti-psychotics.   Talk therapy does not eliminate psychosis, but it could help her deal with both the psychosis and the trauma of not being able to trust your own mind and the self-stigma of a mental health diagnosis.   She will need to tell her parents!",
            "I still think you should tell your parents.",
            "I agree with the commenter about the hypnagogic hallucinations. I had them when I was very stressed. Always very brutal and scary. They were very distressing. I also had terrible insomnia and hypnic jerks that lasted through the night. In the end my problem had a very simple solution - magnesium. I was sleeping through the night within week after about 18 months of insomnia when I started taking magnesium.  \n\nI hope your sister finds help soon, you are a wonderful sister to take the time to listen to her.",
            "Wow, you handled that so well, and she also did SO well to tell you even though it must be terrifying. \n\nTell her that you're there for her, and she needs to keep telling you stuff, no matter how scary it is. Be an advocate for her and don't let a doctor or psychiatrist brush her off. Tell her you'll be there for her no matter what happens or how long it takes. \n\nPlease get your name on the list of people who can call her and check in frequently. Even when other people are taking over and things seem sorted out, keep checking in on her. \n\nAnd tell her that she was so brave and smart to tell you, and you're so proud of her for asking for help.",
            "I saw your original post and I am so glad you are helping get your sister help!",
            "I know it sounds weird, but maybe try doing it back to her. I worked with a severe autistic child that would do randomly do boundary related things, like one time he came up to me and blew in my face. He’s never done that before so I did it back to him and he immediately gave me a look like “why did you do that?” And he realized that that was a weird thing to do. I don’t know your sister or how she would react but maybe she just doesn’t understand how others feel physically.",
            "You are a wonderful sister, op. It is sad she thinks your parents won’t believe her.",
            "My sister has sleep paralysis and night terrors and what your sister is experiencing could be either it both of those things. Seeing a physiatrist is probably the best thing for her.\n\nI could think of another possibility for why she's seeing these things, but I don't want to state it here because I know it wouldn't be taken seriously.",
            "Thank you for caring so much and intervening in such a positive way for your sister.  Bless you both.",
            "I've just finished reading some of the comments here and in the original post, OP you description of the situation is so well written and full of love, I wish I could send strength to you for being such an epic sister and human being.\n\nThere is wonderful advice here, reddit is an amazing community. But I'm going to be that weirdo that asks.. \n\n'What if OP's brother is right?'\n\nHow do we know. How can anyone prove (as ludicrous as it seems) that this isn't an episode of supernatural origin?",
            "She may be a sensitive mamq",
            "[deleted]",
            "Is no one going to consider that she could in fact be seeing ghosts?",
            "I think she is bi polar",
            "Please consider CBD oil for her.",
            "TF does (20F) and (13F) mean I see it on every post shit stupid af"
        ]
    },
    {
        "post_id": "rb2duy",
        "author": "PantWearer123",
        "title": "UPDATE: My(30M) GF(32F) of 6 months has changed her behaviour recently and I want to leave",
        "url": "https://www.reddit.com/r/relationships/comments/rb2duy/update_my30m_gf32f_of_6_months_has_changed_her/",
        "score": 2786,
        "num_comments": 189,
        "created_utc": 1638893093.0,
        "selftext": "OP: [https://www.reddit.com/r/relationships/comments/r5oop6/my30m\\_gf32f\\_of\\_6\\_months\\_has\\_changed\\_her\\_behaviour/](https://www.reddit.com/r/relationships/comments/r5oop6/my30m_gf32f_of_6_months_has_changed_her_behaviour/)\n\nSome things I want to address first:\n\n* I work at the same place I have done for years because of my anxiety, I know how to do everything at my job and it helps me feel grounded and not worry. When I said I'm basically a manager, I mean that I do sometimes fill in shifts and responsibilities for them, and we have talked about me officially being manager before, but it's not what I want. I don't want to take my work home with me and never be able to switch off like I see some of them do. That said, I do want to have some more ambition in my life going forward, and I am going to be looking at other ventures.\n* My clothes: My band clothes are now back at my house, I still have the new clothes we bought as I paid for a lot of them and I plan to continue wearing them too. I can see what she meant by wanting me to wear new clothes, I just didn't like her end goal or the way she went about it. For the people thinking I dress like those goth people dancing under a bridge, I don't. It's usually just a band tee/jumper with some normal jeans, I'm not a teenager, just a 30yo who still loves the same band haha. (No hate to those dancing goths, I love that meme)\n\nOK so on to the main story. I took advice from some of the responses to the OP, we live separately so there wasn't any issues with leases, but I did change my lock as I had given her a key a few months ago. As for the breakup, it didn't go well, but it did go at least. I was at home thinking of how to do it, which cafe/restaurant I was gonna do it in etc. She finished work and came to mine without any prior discussion, not out of the ordinary to be fair. Anyway she could tell something was off, and because I'd been thinking about it all for hours I was 150% sure I wanted to do it so just did it here instead. I first told her that I had lied about donating my clothes and that I'd actually taken them to work instead. She was angry and calling me a liar and everything. I apologized for it, and tried to explain that I felt a lot of unfair pressure to get rid of them when I didn't really want to and my collection wasn't hurting anyone. I don't really feel that the argument was fair, and I feel that her actions made me lie to her, but I hate saying stuff like that so I just left it and moved on. \n\nI then told her I was really annoyed about her calling my boss, she said she was sorry but I should be a manager, I said that's OK and she looked confused but accepted it I guess. Then I just said I didn't wat to be with her anymore because she actually had given me a second to speak. She looked shocked and asked me what I meant. I just said I didn't want to be with her anymore, and that I wanted her to leave and would be changing my locks but was open to calling to messaging about picking up her stuff. She said stuff like we don't have to break up but I kept saying my mind is made up and technically we already had, she called me pathetic as she walked out the door and slammed it behind her. This was the other day, I haven't heard from her but I sent her a message about picking up her stuff, there isn't much of it here so maybe she doesn't want to?\n\nAnyway, since then, I called my boss to explain that situation and be wary of any contact from her, we've worked together for years and we're good friends so he was very understanding and said if I need help in anyway he'll try to provide it. We go for drinks often with other colleagues so I'll explain it all to them there probably. \n\nAs for me, like I said above, I do want to work on myself a bit, partly because of the things she said, but not for the same reasons, just for me to grow a bit in terms of work experience and fashion sense. I'll be buying more 'smart causal' clothes to wear as well. I don't think I'll ever fully stop wearing the band clothes though hahahaha. I don't quite know what I want to do in terms of work, but I have the experience of team work and leadership from the store which I think is usable and transferable to other jobs too. \n\nI'm feeling weird, but OK, it feels great to have acted decisively, I haven't felt sad yet, not happy either just relieved mostly. Some of her stuff is still here and it feels weird to see it knowing it'll never be that way again, I don't know how to describe that feeling. Anyway I've spoken to friends about it and will be seeing them soon. Idk what she's been up to or what she'll do, not sure if I want to, there's nothing left for me with her anyway. \n\nJust wanted to thank everyone for their kind words in the OP, it felt really good to know I wasn't being treated fairly and I wasn't just being stupid like she said. Some even messaged me with similar stuff or how much they liked their partners with similar habits to my band clothes which was really nice. One of the reasons I still wear the band tees is sometimes other fans spot them and we'll have a nice conversation about it and always end the conversation smiling haha, it's just nice. \n\n&#x200B;\n\nTL;DR GF came to my house and it took an hour or so but I broke up with her and she left. Locks have been changed and clothes returned, thins are weird but definitely better. I'll be working on myself but doing it purely for me not for her or anyone else. Thanks again for kind words and advice everyone, hope you enjoyed the story.",
        "permalink": "/r/relationships/comments/rb2duy/update_my30m_gf32f_of_6_months_has_changed_her/",
        "comments": [
            "Not everyone wants to move up in their career. That’s ok. If you can make what you need, then that’s fine. Not everyone is cut out to be a manager. Do what you want. \nI’m glad you’re rid of your girlfriend. She was toxic and so negative. She wanted to change you to her vision of what you should be, not what you actually want.\nETA: thanks for the awards!!!",
            "[deleted]",
            "I just read your original post and good riddance! I'm a manager (really wish I wasn't!) and you can pry my ridiculous metal tee's out of my cold, dead hands. Good on you for wanting to update where appropriate, but controlling your wardrobe is controlling/abusive behavior 101. You do that kind of thing--wardrobe or jobs--on YOUR terms, no one else's. Like strive for improvement for sure, but not because someone you're dating for less than a year strong-arms you into it.\n\nSeriously, good job standing your ground and making it happen. That was going to turn into something miserable, fast.",
            "I think the fact that you've been left feeling a bit feeling-less about the relationship actually being over in the days since it's done and mostly just relieved really shows how bad it was on some pretty deep levels and that you absolutely did the right thing in breaking it off.\n\nAlso sounds like you've taken some good out of it in the changes you want to make for yourself, growth is always good. You don't need to make huge dramatic changes for growth to happen, but you're at an age that the small steps you're thinking of will have a pay off for you down the road even just in giving your social life a little lift.\n\nAs for band clothes... you don't have to give them up to be a bit more versatile & flexible with your wardrobe. And mixing a cool worn band shirt with some good quality sleek jeans & a sport coat is a hot look. You can even have both at the same time :) \n\nGood luck man.",
            "Just read your original post and got all caught up and I'm happy you decided to break it off! She sounded very emotionally draining and like you said, it was good at first, but you only really get to know someone once you've been with them for a while and she was already starting to show you her red flags. Kudos to you for standing up for yourself :)",
            "Good for you. Keep wearing those band shirts and don't let anyone tell you otherwise. Consider going to counseling if you're after personal growth. You need it after a girlfriend stepping on your boundaries like that.\n\nAs someone with OCD, I encourage you to get tested. You mentioned in the op that you think you might have it. Being diagnosed changed my life for the better.",
            "Well done. You did the right thing.",
            "Hopefully you were wearing one of the band shirts when you broke it off.",
            "You shouldn't have to change for anyone. Unless the changes are genuinely for your own good (not what someone else THINKS is good for you) and actually accrpted. She bullied, belittled and tried to contol you. She tried to stop you being you.\n\n\n\nSome people take partners as more of a project. It's a bad trait. \n\n\n\nI'm very happy with how things worked out for you.",
            "I am proud of you, you handled that perfectly.",
            "Don't worry about the clothes.  I am nearing forty and still wear a lot of band shirts from my favorite bands.  As well shirts that depict Masters of the Universe, Anime, Star Wars and other geekdom type apparel.  The right partner will not judge you on what you wear, but try to help you compliment it.",
            "Good for you! This worked out so well: you are considering your career, you recognized some areas for self-growth, and you stood up for yourself! My nearly 30-year-old boyfriend wears almost exclusively graphic tees and flannels, I'd never ask him to change that. I'm glad you hung on to your shirts.",
            "I don’t know you, but I’m proud of you. 🥲",
            "Congrats! You are now a boss.",
            "Glad you see able to extricate yourself from that! Even the bad situations offer us lessons to use going forward. All the best.",
            "Glad you broke free, she crossed so many lines!",
            "Read you original post and so glad this turned out this way. Funny how everything is fine and six months later she wants to change everything about you. Calling your boss is unreal. Telling you to change your clothing in this case is trying to change you. Those shirts mean something to you, it's a memory, a conversation starter, a reminder of great music, not to be confused with, say, wearing all brown every day.  I am in management and you are not missing anything. Anyway just wanted to say I am happy for you; you dodged a bullet if she is this controlling after only six months!",
            "My boyfriends ENTIRE wardrobe is nothing but band tees and jeans and I love it,I think it's sexy AF.",
            "Good for you OP. You did the right thing and still got encouraged to expand your horizons.",
            "Good for you, OP. You did the right thing. I kinda wanna send you one of my band's shirts just to spite your ex for trying to make you feel bad about wearing clothes you like. Feel free to take me up on it anytime, ha.",
            "Now remember OP. PEOPLE DON’T CHANGE. So keep that in mind when she try’s to get back with you. Hold stead fast. And good job",
            "I’m glad you broke up. You deserve someone who likes you as you while still wanting you to grow and improve. \n\nYou can take her things and mail them to her home if you want to remove any excuses she might have to come over and try to get back together again. \n\nIt sounds like she viewed you as a project, not a person, and that is not a good basis for a relationship.",
            "She definitely went about it the wrong way but I see where she was coming from......when you described yourself you reminded me of my ex before he made life changes.....he looked like a hobo all the time and he was at a dead end job ready to give up on life.....when I suggested (not in a pushy way like your girl) that we try a different wardrobe, he gained alot of confidence from it and his personality changed and his outlook on life improved. He then had the confidence to take chances in himself and apply for higher positions and get better jobs. Literally a change of wardrobe and dumping lame t-shirts and things that didn't look good gave him the confidence to take his life to a new level. You might think it's not important but it actually is. I will say she did go about it the wrong way but she might have honestly just been trying to help you",
            "[deleted]",
            "I’m glad to see this update! She sounded emotionally abusive and controlling. She might not even realize it, but I’m happy you got out before things got worse. Kudos for protecting your t-shirts, and yourself!",
            "RE: work. I’ve attained the sweet spot at my job too and I don’t want to change anything. I get you. If the life work balance is just right and you’re happy, just chill with it. It isn’t always about climbing a ladder. Park yourself at where you are and enjoy it. That’s where I am at with my career. I’m satisfied. Don’t need any more.",
            "You dodged a bullet dude good for you",
            "Good for you, OP! Sometimes people might think they have good intentions when they try to change their partner's ways, but it usually boils down to issues revolving: anxiety, control, being self-absorbed, not viewing their partner as a 3D being. \n\nI'm glad you want to process and make gradual changes for yourself. Stepping out of your comfort zone is one of the hardest things you can do.",
            "I'm over 50 and still almost always wear some form of jeans and a black t-shirt or sweatshirt, with hikers.   I work the same position I have for 20 years, because I love what I do and i have great work / life balance. \n\nGood for you for staying true to yourself!",
            "I'm glad that you stood up for yourself, and good luck to you in the future. \n\nAs far as her picking up her stuff, if I were in your position I would either send her a text message (one, single, last text message) or certified letter telling her she has 30 calendar days to arrange a time to remove her belongings from your apartment or they will be going in the dumpster. And then stick to that deadline. If she doesn't pick them up by that date, throw them away. Sometimes people \"forget\" their things at their exes apartment as a way to keep contact with them, at least for awhile, so it might be helpful to just eliminate the possibility of that happening as quickly as possible.",
            "I totally get ya on the anxiety as far as doing something different for work. I've had it as well, it really does get better the more you put yourself out there and have new experiences. It can be scary but the more you do it the more capable and confident you'll feel. It'll get easier from there.\n\nI have a lot of band tees that I no longer wear but I'm too attached to throw away. I have a coworker who sews and makes quilts a lot and I've considered asking if I could pay her to make a quilt with them. Or maybe learn to do it myself, I'll get more use out of them and they won't sit around collecting dust.",
            "As a30-something with a ridiculous collection of band shirts from one specific band, you do you bro. Like what’s the big deal lol they make you happy, that’s reason enough",
            "Phew, you dodged a bullet there. That's some red flag controlling behavior. Imagine she became pregnant and you had to co parent with her for 18 years. \n\nPack up her stuff in a box. Giver her another week to come get it, and if she doesn't ask for it, shoot her a text saying she has a week to make arrangements to get it or you'll be tossing it.",
            "I admire your humility",
            "OP, don't get rid of your band shirts ever for a person. Yes, having \"grown Up\" clothes for occasions is right but if you love them, you love them. My husband has around 50 black shirts because he buys one every festival and concert he goes to. Would have never crossed my mind to talk him out of that. You can't make a person completely different in a relationship. You weren't made for each other and that's fine.",
            "Pack her shit up in a box and put it somewhere safe (if you can put it in a separate storage locker, do that and tell her she can get it from there). Just so she doesn’t pop back up in your life being annoying just because her stuff is there, she seems the type to play that kind of game. Also because it seems like you may be a bit anxious, so get rid of it.\n\nWell done on breaking up also, very strong. She seems the type to choose people like you because she thinks she can control you, good job for standing strong",
            "Take all her stuff you see and pack it in a box so when she does eventually come for it you can just hand her the box",
            "Thanks for the update.  Looks like you handled it well. In a way, she did leave you with some self reflection and change. Hopefully some people reading your story will do the same. The lesson is, work with someone to create change, not on them.",
            "Honestly, OP, some good quality staple pieces plus your band tees will totally make a well-rounded wardrobe. As someone mentioned above, a blazer and a nice pair of jeans plus your band tees is a great elevated casual outfit. I think tees and shoes are my favorite part of a guy's attire because they are a great way to express some fun personality while still looking a bit cleaned up. \n \nI'm really proud of you for making the decision to break up with her. Change is hard, especially when you have anxiety/OCD. You made a very positive change and that's wonderful!",
            "Good riddance. She sounds mentally unsound…calling your boss was way out of line and for her to think that was an ok thing to do really makes me wonder what other entitlements she has.\n\n\nAlso, as long as you dress appropriately for things such as weddings, funerals, meetings, etc. then i don’t see why you wearing band shirts is a thing whatsoever. As long as they’re not dirty or raggedy when you’re out and about who gives af? If she wants to date someone more fashionable then she should’ve Found someone like that instead of making you throw out your belongings while you cried. Jfc I can’t believe that…that’s not love, dude, or affection. \n\nAnyone with the “you’re over 30, put away the bad tshirt” attitude is just superficial. Same with ppl whining about women wearing leggings…if it’s just a casual situation, who cares?! Stay in your lane smh. It’s fine if you don’t want to date someone like that, but don’t force other people how to dress *period*. I’m glad you got out of that.",
            "Some women are taught that men are projects, not people, and you have to find one with good potential and fix him up. \n\nI know some men who dated women like this, and seem fine with it. I find it super insulting. Just find someone who you like as they are? They think ALL men need a woman to fix them up. It's really common to seem chill for a few months and then at about 6 months or a year, start on a campaign of \"improvements.\"\n\nImagine if you had told her you wanted her to dress differently, cut her hair differently, wear makeup differently. People would call you controlling and tell you that that's red flag behavior. \n\nEveryone has room to improve, and you should find someone who is happy to encourage you and support you, but doesn't NEED to you to make those changes. \n\nAlso, I have a pretty low paying job I love. People work super hard their whole lives to get to the point I'm at, where they can have low stress and responsibility. Like you, I have investments. I just make enough to live on every month, and in exchange have nearly zero stress, and can put my attention and energy on things besides my job. \n\nSo move up if you want to, but not everyone needs to find meaning in their work. It's okay just to work to cover bills, and spend your energy and passion on other things.",
            "Woah… I am in disbelief but I’m really glad you got rid of her. She is incredibly toxic and definitely wanted to change you to suit her own ideal. \n\nIMO you shouldn’t have to get rid of your old clothes. It’s definitely good to have something smarter or whatever for different/special occasions but wear whatever you want, as you said in your previous post — you aren’t hurting anyone. Same for the career, climbing the ladder isn’t for everyone. As long as you’re happy and not struggling financially, what should it matter? \n\nDo what makes you happy and when it comes to future partners, take this as a lesson. If someone wants to change you, they aren’t worth it. More importantly, if someone is to insult you and call you names? Drop them. You deserve a lot better and I’m sure you’ll find it too.",
            "Congratulations! You made the right choice in leaving that relationship.",
            "Wait, what band is it?",
            "The fact that you feel relieved after breaking up is a sign it was the right decision",
            "Good for you, standing your ground. She was very controlling.",
            "Better this way for both of you. She wanted something else in her partner and you wanted to be something else as well (stagnant). \n\nI wish you good luck moving forward .",
            "I was critical of you in the last post. I stand by what I said, but I'm glad to see you are at least willing to investigate growing your career.\n\nThat said, I'm really proud of how you handled the situation. You showed that your self esteem and your self worth are more important than what someone else wants.\n\nyou showed that you are willing to fight for your dignity.\n\nThe kind of confidence that comes from showing the world that your feelings matter is a trait that many other women will find very sexy.\n\nHang in there.",
            "Yay-good riddance. I would never tell a guy I’m dating what he should be wearing.",
            "I’m glad you left her buddy. Clearly she was controlling and verbally abusive.",
            "I hate to say it, but your gf dodged a bullet. You don't sound like a prize catch.",
            "I legitimately don’t see the issue with the band shirts, I’m autistic so my Star Wars and anime T-shirts and baggy jumpers are what I’ve been wearing since I was a teenager. It makes me happy and comfortable. No one who matters cares. My husband doesn’t mind at all. You’ll find someone who doesn’t mind either. \n\nThe job thing… like so long as you have enough money and you’re happy, who cares, exactly? \n\nI’m glad you got away from her and I wish you the best.",
            "I sent you a DM with some pointers. It's sad that instead of empowering you to make changes on yourself by noting the benefits, she tried to live your life for you. And that she called you pathetic when she left, is because she already felt you were, she just didn't say it because she had hopes that you could be her little project.\n\nLet her go, work on yourself man, I would suggest you go to some therapy for your anxiety, there's a lot to life, don't let it go to waste just because you fear a few stumbles. To win, you gotta learn how to lose... remember that the hero starts always as a fool.",
            "This girl really wanted to help you but you held steadfast to stagnation. You will regret this. Bring on the downvotes but you will not come out a better person from this.",
            "I don't understand men sometimes. It was a little too easy for you to snip her out. Like why yall even be dating women you don't like? \n\nYeah yeah yeah she was moving toxic but also there was no emotional conflict with OP.... He clearly ain't like the girl.   He instantly felt his life was righted after slamming the door.... you had a whole lot more fucked up than dating someone who didn't respect your boundaries.\n\nHappy you tossed out your old furniture. Hope you enjoy the next set...",
            "Nicely done dude, and props to you for wanting to always improve yourself and yet knowing your limits.\n\nThe fact that you feel relieved means you made the right choice.",
            "Good for you! Onwards and upwards. \nYou are YOU and every one needs to be with someone who loves you just as you are.\nIt's fine for partners to ask questions and push a bit....but that girl crossed boundaries.",
            "idk if you know the band Have Heart, but i have one of their shirts from a show about 13 years ago and i still wear it. i'm 37. do you dude.",
            "I’m sorry you went through this, OP. Sometimes seeing the true nature of the people we trust is very hard; it has happened to me a lot and is a big reason why I’m pretty cynical about many things, unfortunately. I’m proud of you though, and as a metal fan who loves wearing band shirts (and currently has a girlfriend who does too and would never judge me for wearing them!), I think you fucking rock. Keep on keeping on, and remember to always look out for yourself and be the best YOU that you can be.\n\nCheers",
            "I also find it really hard to stick to my guns and not be persuaded. Plus I tend to forget everything I wanted to say in the heat of the moment! Honestly I’ve found it much easier if I can make a bullet point list, not to directly read it off to them, but to help keep it black and white with my mind firmly made up, plus to remember everything I wanted to say. Honestly I lost it the moment you said she was forcing you to throw out all the shirts you liked and called you stupid when you started crying. Your feelings there were totally valid and I can’t believe she pushed you that hard! Ironic how it’s valid for her to obsess over your clothes but not valid for you to care about our own. But in the end you really did great!",
            "Good for you!! There is power in knowing what makes you happy. \n\nAnd I’m 33 and a nurse - when I’m not in scrubs I’m in jeans and band shirts too. It’s what makes me feel comfortable and confident because it represents who I am and who I want the world to see.",
            "I'm glad you're doing well! \n\nAlso something to consider; your experience and writing reminds me a lot of my friend who is on the autistic spectrum. It could explain your anxiety so it might be worth looking into. \n\nGood on you for cutting her off though, seems like you dodged a bullet",
            "I think you did the best thing. It’s ok for you to be satisfied with your life as it is, it’s ok for her to want to be with a more driven person. But it’s not ok for her to force you to become the person she wants. Power to you, all the best in life!",
            "Nice update! You can improve your life and style without abandoning things that are important to you! I love a good band t-shirt. I think they are appropriate at any age! If you want to look more polished, pair it with a cool jacket and fresh shoes or boots.",
            "Man, you sound like such a nice person! Don’t change your essence.",
            ">doing it purely for me \n\nI'm so happy for you! Even just reading the text, you seem happier, if that's possible. I'm glad you saw that your feelings were important, too. You seem like a really sweet guy.",
            "Well done. Keep valuing your comfort and, if you date someone new, being treated with respect. Feeling relaxed, comfortable, and safe is really important. And seriously, super well done.",
            "I am so proud of you!!",
            "OP, you've already grown by valuing yourself and ditching this toxic relationship. Good for you!",
            "Happy for you. :) Wear your tees proudly!",
            "About your choice of clothes and shirts.\n\nI work for a Fortune 500 company.\nMost of my team wears band tees, video game tees, etc to work everyday. My director collects band tee shirts and has never been seen in the office on a normal day not wearing one of the shirts in his collection.\n\nYour clothes aren't the issue, you already took care of the problem.",
            "I didn't see the original post before, but I say you are well rid of her. She was sending up red flags all over the place. Maybe, *perhaps*, her intentions were good, but her behavior was abhorrent. You didn't deserve that shit. She should have backed off **way** before you had to lie.\n\nMy SO has a pair of fleece lounge pajama bottoms that they have loved forever. These things were worn the hell out, so I got them another pair the next Christmas. They never wore them, saying they didn't feel as comfortable. Obviously I didn't *love* that answer, but it was their decision to make because it was a gift, not a demand for capitulation. Same with some of their shirts: more holes than shirt almost. Yes, I ask them to think of where we're going (like, \"plz no holes when we're going out to eat\"), but if they really want to wear it, I recognize they are their own person and I can't (and won't) order or wheedle them. Ordering and wheedling a loved one, (beyond normal back and forth that ends when that person says to stop), is wrong.\n\nEnjoy branching out on your own terms, dude.",
            "Good job, bravo! As someone who wears business casual for work, keep those band shirts, 100% I'm sitting here in my knee high socks, cat leggings (cats with glasses!) And it feels great, comfy, confident.  Tomorrow I'll put on a cardigan and classy boots, brush my hair to hide that I'm growing out a mohawk.  And I'll be happy with myself and how I'm dealing with life....at least as much as one can be! \n\nAlso, it feels great looking professional when I need to but I love my work clothes too...they're all comfortable and can be incorporated into my normal wardrobe. You've got this:)",
            "I've been with my now husband for 10 years, and he still wears a lot of his high school shirts. Lots of band, arty, graphic tshirts. They fit him still and he likes them, so its whatever to me. The only time I will ask him if its okay to toss a tshirt is if its tearing apart, and hes only kept a few of those for senteminal reseasons. I tend to buy him his newer clothes for part of a bday or holiday gift. But generally speaking its his stuff and he can do what he wants with it.",
            "I have OCD, formally diagnosed, big time therapy, medication, all that jazz. There is NOTHING wrong with staying at a company you like with a job you're good at. A lot of people overextend themselves trying to jobs they think they should, then end up really struggling. Keep at it for now and if you want to leave later, you can!\n\nI would recommend getting evaluated for OCD, having a diagnosis and a treatment/management plan can be really helpful. OCD usually doesn't look how it does in the movies, it presents in lots of ways. If you get evaluated, see an OCD SPECIALIST not some rando therapist whose website mentions OCD among a slew of other things.",
            "Congratulations on dropping your emotionally abusive ex! You should see your life and outlook greatly improve from here. \n\n&#x200B;\n\n\\>For the people thinking I dress like those goth people dancing under a bridge, I don't.\n\nIf you want to wear band tees till you're 90, you should fucking do it.  And you don't have to justify it to anyone. (If you DO want to dress like the goth people under a bridge, go ahead and do that too!)  Never let anyone put you down for your personal choice of how you want to look and express yourself.",
            "I'm so impressed with how well you know yourself, how you stood up for yourself, and how you are setting boundaries.  I'm glad you are considering ways to grow and not let your anxiety control your life too much, while also recognizing the things that work for you.  I think you made the right choice.\n\nI'm also dying to know what band it is.",
            "Wow I might read the original post because this was one hell of a response and formulated pretty much the maturity and intelligence of a relationship partner going through a breakup that most people who post on a relationship sub seem to forget or forgoe. Nicely handled and overall a real pleasure in some regard to read.\n\nI hope you have a good time with your friends and are able to move on and keep doing what you love. \nI'm glad I work with the people I do because even when we tease each other and stress one another out, I had my CEO buy me lots of Ritz crackers which I love and one of my senior colleagues send me a new song for a band I love so I could listen to it.\n\nIt's great to be in a job you love, especially one where you are comfortable and surrounded by supporting colleagues and managers.",
            "How you gonna tell a prospective employer you have leadership experience when you've avoided being a leader the entire time you've worked at that store? Knowing how to do everything and covering other shifts doesn't automatically make you a leader. \n\nGlad the breakup went smooth. Yes, I mean smooth. It could have gotten much uglier. Good luck finding someone who likes you as you are. She clearly didn't and spent much of the relationship trying to turn you into the guy she thinks she wants.",
            "band shirts are sexy idk why people don’t like them",
            "Never stop wearing those band tees! I’m\nAbout to turn 40 and I still have my hand tees. They go good with jeans and they’re comfy. Live your best life my dude. Good on you for getting rid of her. She sounds emotionally abusive, and would have gotten worse.",
            "I’m so impressed you did what was best for you, it’s really hard to do it when I means being “alone again”.",
            "I am so proud of you! Way to love yourself and do what's best for you!",
            "Happy for you, keep doing you",
            "Hey fuck her - I'm 49 sitting here in my favourite Deftones 'White Pony' tshirt.\n\nKid at the corner store asked if I was into equestrian????!!!",
            "just here to point out how awesome your boss is.",
            "Dude, you’re fcking awesome!  I love everything thing stated and how you handled it. \n\nThe tone between this post and the last is so drastically different that it’s astounding.  It seems like you’ve hade a yogic breakthrough, or something; and, gained a shy ton of self-worth and confidence in the process!  Keep it up my friend, cheers to a happy life",
            "May I ask what band? I'm dying to know.",
            "I’m a 33 year old woman who still wears band tees on occasion and I have no desire to be a manager at my current job either because I appreciate having a work/life balance which a lot of the managers do not have. I hate the pressure some people put on “growing up”, just continue to enjoy what you want, wear the band tees all you want. Things will just get better for you from now on, good luck with your future and whatever you decide to do!",
            "Reading your update made me so happy for you. It's great to see how mature you are and you are learning from this experience rather than being negative.\n\nYou seem to have a nice job and great boss, As many suggested don't get pressurized into going to other jobs/ranks. Do it only if you like it.\n\nDo everything over text as a proof.",
            "After reading all this I still don’t get what’s wrong with band tees?? Like as long as you’re not wearing them to a funeral who gives a shit.",
            "I’m happy for you! But please tell us, what band!!!?",
            "She’s awful. Telling you to change how you dress was terrible. Wanting you to get rid of those clothes was terrible. I dated a guy once who had awful taste. He wore only plain colored shirts. And a lot of them were brown which I hate. He wore those clothes when I fell in love with him. I just complimented him every time he wore a blue shirt cause I liked that the most. Noticed he started wearing them more, haha. Never told him I hated the way he dressed. Never asked him to change that. We’re not even dating anymore and he still doesn’t know I hated the way he dressed. I wasn’t dating his clothes. Haha. People shouldn’t ask you to change. Now certain behaviors I can see, if they changed. Like if you had a lot of affection at first and then no affection, please try and change things like that. But I could never understand trying to change someone that you fell for. They were good enough before, right?",
            "Good for your for standing your ground and not letting her talk her way back in. From what you described she sounds very toxic and controlling, but even if she wasn't, you don't really need a reason to end a relationship beyond you don't want to be in it anymore. \n\nI also want to say that there is absolutely nothing wrong with wanting a comfortable life with a familiar job where you're happy with your duties and compensation. You don't need to fabricate ambition you don't have to please other people.\n\nAlso, I'm dying to know which band lol",
            "I was worried a bit for you after I read your post last week; I'm glad you posted an update and have made a positive move in your life.\n\nHopefully your ex will also learn a lesson or two from your time together and realize that she was probably addressing her own insecurities through trying to manage your \"flaws\"--which weren't really flaws, just parts of your personality you're still working through. It seems you've made some progress by taking the experience as a learning moment; hopefully she'll do the same.\n\nGood luck to you!",
            "You’ve only been together for 6 months, so go ahead gettin gettin on. \n\nYou don’t need a rhyme or reason, if you’re not happy you’re not happy.",
            "Good for you, OP! Judging by your original post, and some other reasons you had listed as reasons for not being happy with her, I think this would be great for you. You get to see your friends as often as you would like, your boundaries are respected by those around you, and you eliminated a stressor from your life! Nicely done",
            "The way I see it, love and support go hand in hand. I hope you find what you're looking for!",
            "Good for you.  You wearing band tshirts doesn't hurt anyone.  If she was concerned about your professional image/wardrobe, she could've verbalized it kindly.  \n\nHer calling your boss was a red flag.  She was trying to control your life and was overstepping boundaries.\n\nAlso, her calling you pathetic?  Absolutely immature and it's a glimpse of the type of partner that she would have been (verbally abusive/deliberately hurtful).  \n\nIt sucks to have a relationship end but she really was not a good match for you",
            ">I don't think I'll ever fully stop wearing the band clothes though hahahaha.\n\nFunny how something genuinely good happening to someone else can make your day. Peace be with you 🙂",
            "Wear some smart jeans, a smart jacket and an ironed band t-shirt. That will make you look serious + show off your personality.  Good look, mate!",
            "50 shirts of the one band though? Cmon man",
            "Mixing graphic tees with classier, smarter clothes can be a really nice look. There's no reason not to do both. \n\nGood on you for standing up for yourself. \n\nAlso, the promotion thing isn't just about responsibility- it also looks really good on a resume and makes you more employable.",
            "I’m so happy for you breaking up with your gf. Next time if you get into a relationship I hope you find someone who deserves you, who would wear the shirts with you and understand you on reasons why you don’t wanna become a manager. All the best!",
            "I think the important question to ask here is what band tshirt is it? Lol",
            "About the \"I have stuff to work on myself\", do it for yourself and if you feel the need to.\n\nIf you think something you do or even that you are, may be from some mental issue (I have a degree in clinical psychology so I use this term in no derogatory mean, mental issues are part of every mind, mine included, and can be from insignificant to being crazy with all the in between), work on them.\n\nBut don't do it because, even if you have a work, a family, friends and a full life, someone just told you to.\n\nI started working on myself because an ex told me I had issues that was true. I went into therapy but I found out I didn't want to change those things. I love certain lifestyle but that means I am happy, I have true friends, a good family and a good job.\n\nJust because you feel like you \"don't fit\" in some predetermined life schemes doesn't mean you are sick",
            "Good job! It's one thing to help you expand your style a bit and let you know you're capable of more. It's another thing to call you stupid and try to dress you up like a doll and control your life lmao. So proud of you for breaking up and not letting this turn into a miserable decade-long toxic relationship which would probably just end in her cheating on you with a doctor or something anyway.",
            "You're a great writer. I was engaged all the way through. I think you made the right decision. My girlfriend has also bought me clothes that she thinks I'd look good in and I am happy with the results. She even bought me the band shirts (she doesn't even like the band) so I'm sure you will find someone who likes you for who you are and is supportive of your interests.",
            "Good for you. As for her stuff, don't even have her come pick it up. Box it up and mail it to her and be done with the whole business.\n\nAlso, band tees are great. They're comfy and mean something to you. My husband and I are in our late 30s/early 40s and still wear them. Don't stop being you for anyone.",
            "You seem like a very cool dude... I'm glad you're ok, and proud about the way you handled the situation :)",
            "I think you did the right thing, friend. I also am not sure why she cared so much about what you wear. My boyfriend is 40 years old and wears band shirts …100% of the time that he’s not going to like a wedding or funeral. I have no problem with it as I wear them as well. If you’re actively trying to change the person you’re with to fit into a mold you’ve predetermined, you don’t actually like them as a person.  I wish you the best of luck, and you’ll find someone who likes you just the way you are.",
            "My husband also doesn't want to be a manager because he wants to come home st 5pm snd leave work behind. I fully support this- I want him to be happy. Also his wardrobe is like 90% jeans and old Judas Priest tshirts. Who gives a fuck. Find someone who loves you the way you are.",
            "You did the right thing and I can tell you feel that.  Box up her stuff, close the box so you don't have to see it.  If and when she comes to get the stuff, it's all in one bundle and she can just leave.  \n\nAlso, schedule the pick up and make sure you have a friend there with you as a witness and as emotional support.  Well done, friend.",
            "I think the classist mentality makes it impossible for people to understand that not EVERY job is a stepping stone.",
            "My partner wears all black, every day. He wears t-shirts with prints, usually gaming/dnd related. It's not my style – but I love that he found something that works for him, and that he does what's comfortable for him without taking any shit about it. And I love how he looks in his clothes. (I love weird and vivid second hand clothing, which my partner just has to deal with.)\n  \nNeither of us are career people. We work because we have to and try to find options that gives us the least amount of suffering. We rent an apartment that we want to grow old in. We don't want a house, or kids, or moving to the next life stage in any significant way. We just want to do fun things together and grow closer.\n\nWe're about your age. While there's nothing wrong with wanting to pursue fashion or the next career step, it's not for everyone. Life's short, and you should do what gives you the most joy. Don't change just because other people say you should. Especially if it's your partner. When you meet the person who's gonna fall in love with your emo band t-shirt collection, it would be a shame if you had gotten rid of it.\n\nI'm learning to live according to my own standards, and to not look for everyone else's approval. My partner has taught me a lot about that, and I really admire his skill to not give a shit about what people think.",
            "Sounds like you did the right thing and well. Maybe talk to a therapist for a few sessions to help you with the growing up bit.",
            "Leave. Your woman hit the wall 3 years ago. Post pictures of the back of her hands and her neck, I’ll prove it to you.",
            "In life, there are two types of people: those with ambition and those without. Rarely are they compatible in a relationship. Neither are \"bad\", it just means that lifestyle priorities are different. I hope you find someone who is equally un-enamored with the 'hustle' and enjoy a lovely, relaxing life together. I also hope that she finds someone forever chasing that next milestone/promotion. Both of you deserve happiness.",
            "Good for you! It looks like you made the best choice you could. Given what you said about your career, it could be worthwhile to reflect internally about what future you want to see for yourself. If that future is something different than the job you’re at now and anxiety is really holding you back, I would suggest looking into therapy before making any big changes. If you work on yourself first, then other things should follow (job, relationship, etc) because you’ll have a better idea of what you want, what you don’t want, and in what direction you want to grow.",
            "Dude, don’t feel pressured to change a bit of who you are, what you like, or what ambitions you have because someone tells you that you’re too old or need to grow up. I’m 33 and work in a very old fashioned industry and I would kill to go to work in my punk rock bands t-shirts. I would feel happier, and I don’t want to feel the pressure to change it. Unfortunately I can’t (stupid dress code…), but, boy, believe me, when I work from home I look like a 16 year old fangirl talking about investment stuff and international guarantees. And I don’t feel less mature. I just think that maybe when I grow older I’m gonna change my style but who knows! Maybe I don’t. And I don’t give a shit. Just keep being yourself and don’t feel pushed to change anything because someone tells you. I really sympathized with you when I read this post because I’ve been told to change a lot and at first that made me feel useless, but after some time it just made me angrier because that’s nobody’s business but mine.",
            "There is nothing wrong with band shirts. \nThat's pretty much all I had to say, Good luck OP.",
            "happy for u bestie. but i desperately want to know what band u r wearing 😭 plz tell me",
            "Bro if you notice  diff behavior  somthing is deffintly up it's better to ask here and if she dosent tell break it off and save your self the time to heal",
            "She approached everything in all the wrong ways and showed herself to be unstable by calling your boss, so it was best to break up with her.\n\nHowever, there are some lessons to be learned from this. It wasn’t about the band shirts. It was about respect. She didn’t respect you. If she respected you, the band shirts wouldn’t matter.\n\nFind a woman who respects you as you are, or invest in your personal growth so that you can easily earn the next woman’s respect.",
            "Seems like you've decided that your wishes/preferences/choices are a priority in your life, rather than your ex-girlfriend's demandings. This is what *managing* your own life would be like, I guess :)",
            "It’s fine to want a stress free life. Our generation was fed the boomer dream and now had to deal with social\nMedia that tells you everyone wants to be a Boss.\n\nIt’s okay to just be yourself"
        ]
    }
]