[
    {
        "post_id": "7k4hpj",
        "author": "muffinbake",
        "title": "UPDATE: How do I [26F] stop feeling bitter about my immediate family's new lifestyle?",
        "url": "https://www.reddit.com/r/relationships/comments/7k4hpj/update_how_do_i_26f_stop_feeling_bitter_about_my/",
        "score": 2786,
        "num_comments": 90,
        "created_utc": 1513391418.0,
        "selftext": "I got a lot of really great feedback from the original post about 3 weeks ago (https://www.reddit.com/r/relationships/comments/7fka81/how_do_i_26f_stop_feeling_bitter_about_my/) and guess I just wanted to say thanks. \n\nIt took a few days to digest what a lot of people were saying.  At the end of the day I hoped to approach the situation as me wanting to be close to my family again and basically trying to ignore the money part.  For the next couple of weeks if I wanted to talk to my mother I made sure to call at a time I knew she wasn't swamped with work (either before she left for the day or before going to bed) and if anything to do with money came up, it was treated as a side note. \"Oh dad won 4k last night online? That's awesome for him. Where are you travelling for work tomorrow? Have you been there before? Are you looking forward to it?\" and she just sort of.. opened up. I told her how I was feeling slighted, fully addressed the issue and even told her how I felt the slight favoritism towards my brother, because he was present, was getting to me. \n\nMy mother is an extremely intelligent woman, reading back on my posts I think I stressed this a lot but she really, really is. We had our one super feelsy chat and moved on but she's been going out of her way to show me she's serious this time with actions not just words. I was over recently and before she dropped me off at home (we live about an hour away from one another) she stopped to at a store and remarked \"your dad and brother lost 600$ last night online, what kind of fucked up logic is it that I can't afford to buy you some groceries?\" . Our upcoming Christmas plans, which I was dreading, are now actual plans. She's picked out a theme for before and after dinner, neither which involve gambling, and is incredibly focused on us spending time away from a computer screen. Our gift exchange is a 20$ limit and she found some game online so that nothing is tailored towards anyone and we all feel included. She's been providing ideas for the wedding planning and even called me the other day saying \"Well you call me all the time and I was thinking about you so I thought I'd call you!\" just to chat. Overall... Im kind of stoked about where this is going. It's only been less then a month but I've never known my mother to commit to something and not stick with it so, I'm remaining hopeful.\n\nThanks for all the insight, personal experiences and words of advice for coping. I read every single one of those comments over and over for weeks so I figured some kind of update was warranted.\n\nTL;DR: Talked to mom again. Used a lot of points from my previous post and communication saves the day once again. ",
        "permalink": "/r/relationships/comments/7k4hpj/update_how_do_i_26f_stop_feeling_bitter_about_my/",
        "comments": [
            "[deleted]",
            "Seems like the gambling addiction-sized elephant in the room remains...",
            "Aww the feels. The only thing I would say is don't forget to acknowledge the difference and express appreciation and the hope that things will continue. Positive reinforcement. ",
            "Im glad you worked that out.\n\nAlso from your previous post I will note that it sounds like your family members are addicted to gambling, which should be easier to discuss should you choose that path now that you and your mom are on even footing again.",
            "I can't help but think your mother is enabling your father and brother, hard core.  Spending all that time online gambling her money is an addiction, it sounds like.  And it's up to her to put her foot down.\n",
            "This is such a nice update! I especially love that your mom is making a huge amount of effort to build your relationship. She heard you. Merry Christmas to you guys. ",
            "This is a really nice update, thanks OP",
            "In the last post you replied to people saying your family had a gambling addiction by saying that they were doing this \"before they had money\". Well, just FYI, people who are poor are the majority of gambling addicts. If they're not gambling addicts, they should be able to not gamble for two weeks straight, or not talk about gambling every time you see them, or not have it be THE activity in their house. But I can't imagine any of those are true. Regardless of how much money your mother got, gambling can ALWAYS take it away. Literally. She could have 100 million dollars right now and if her or her husband are suffering from a gambling addiction, that money is still in danger. Gambling addiction is a progressive disease- eventually, the wagers get higher and higher, and even if you're \"just\" losing 2k a day, it only takes a year and a half to lose a million dollars total. Raise that wager up to 10k and in the same period of time that's 5million down the drain. Please, it's not going to go away, and your family needs to deal with this.",
            "I feel you on this. I have a sister living at home in a very different situation than I was at her age. And she is very ignorant to her upbringing being vastly different than mine. It took me a long time to get over it, to be honest.",
            "I love a positive update. ",
            "The gambling thing can get out of hand quickly, trust me. I don't care how much money she has. ",
            "I'm inspired by your mom's humanity.",
            "So let me get this straight. \n\nEveryone is stoked because mom buys her daughter who struggles to save $100 after a paycheck *groceries* while she buys her son a new desktop and enables both son's and father's gambling addiction, losing *thousands*?\n\nFair enough! ",
            "Are we just going to gloss over their gambling addiction? You should get them some serious help before they end up literally being that original family you remember.",
            "Can you please talk to her about how dumb it is letting your dad and brother gamble her money away? ",
            "Like many others here, OP, I think you need to talk to your family about the gambling. This is how well-off people become destitute very quickly. ",
            ">\"your dad and brother lost 600$ last night online, what kind of fucked up logic is it that I can't afford to buy you some groceries?\"\n\nWhat? I thought they were rich. ",
            "Sounds like she might be aware of her own feelings on the activities and maybe didn’t know how to express them or feel they were valid too. Maybe she’s been having thoughts that their gambling is a little too much and wants to do something besides that and is relieved you are helping redirect her focus. She may have tried but didn’t get anywhere with the others or felt it was useless to try. It sounds like she loves you very much.",
            "Thank you for updating us! Glad to hear this!",
            "[deleted]",
            "Maybe I missed this, but where did this newfound wealth come from in the first place? Gambling wins? Because gambling is not a steady or reliable form of income. Eventually the house will win, and the gambling problem in the family remains.\n\nOP and mom might have had a nice chat but it seems to me that the underlying issues are still lurking under the rug.",
            "Your family should try out board games! It sounds like they need something competitive to occupy their time, and you need to spend your time with them without screens in the way.",
            "Lovely to read this update, thank you for sharing. I am happy for you OP! Great that you talked and opened up and tackled the issue. All the best!",
            "I remember reading you earlier post and damn if this update didn't give me the biggest grin. I am sincerely happy for you my friend!",
            "Gambling is one of those things that's designed to be so addicting (with the flashing lights and sounds and intermittent rewards) that everything else in life just seems dull. I've seen family sucked into casinos and it's scary as fuck. Please try to get them help!",
            "I remember reading your original post.  So happy to see this positive update!",
            "Everyone is different, but I would feel devastated if they forgot me the way your mom seemingly has forgotten you. Sure she's trying, but she shouldn't need to try. Youre the first born and yet get no rewards for your patience in growing up with nothing. ",
            "This is so nice! I'm really happy for you!",
            "This made me so happy :) Your mom sounds amazing :)",
            "How good is that???\n\nI mean yeah, things are not perfect, but mom listens and mom cares. Feels. ",
            "[deleted]"
        ]
    },
    {
        "post_id": "94lmrw",
        "author": "throwawayaye22",
        "title": "UPDATE: My boss (24M) is dating my ex (19F) and now I (19M) feel so uncomfortable and insecure at work.",
        "url": "https://www.reddit.com/r/relationships/comments/94lmrw/update_my_boss_24m_is_dating_my_ex_19f_and_now_i/",
        "score": 2779,
        "num_comments": 181,
        "created_utc": 1533410070.0,
        "selftext": "[Original Post](https://www.reddit.com/r/relationships/comments/92wuub/my_boss_24m_is_dating_my_ex_19f_and_now_i_19m/)\n\nThanks to everyone who gave me advice on my first post. For the past week, I've been trying to focus on myself and my work and not care about my ex and my boss who's dating her. It worked pretty well, I started a painting and I'm pretty close to finishing it and I impressed my boss boss (the professor who owns the lab, not the one dating my ex) by staying late for two days in a row to finish a really difficult experiment. During our lab meeting, my boss boss shouted me out in front of the entire lab and said he was really impressed by my hard-work and dedication. That felt good.\n\nAs for the situation with my boss and my ex, he found out. Like I mentioned in my previous post, when my ex told me who her new boyfriend was, I didn't mention that he was my boss so neither of them knew. Two days ago, my boss and us (two other undergrads) were in a conference room discussing a paper when my ex came in. She came to drop off my boss's wallet that I think he forgot or something. Anyway, she saw me, did a double-take and went, \"Jaaaake?!\". She was definitely super surprised and caught off-guard and her boss was already like \"wtf\" so I was just like, \"heeeyy 'Sarah'\". She shot me another shocked wide-eyed look and left. Suffice to say the rest of the meeting was pretty awkward. \n\nThe next day, it was obvious that my boss now knew our history. Things just turned so awkward. Like he didn't now how to act around me anymore and what to say. Now we're both awkward around each other. He's still nice and all but things are just uncomfortable between us two now. It's not his fault though. I think that things will get better between the two of us but as of right now, I actually feel kind of relieved that he now knows. Something about how both of us now don't know how to act and what to do kind of makes me feel reassured.\n\n\"Sarah\" also called me the night that she found out I worked there but I missed her call and forgot to call back. It's good though, I've been trying to think of her less and distance myself a bit.  \n\nBut if things continue to remain really awkward to the point where both of our work is affected, I'll consider talking to my boss boss about switching me to work under another grad student instead. \n\nBut yea, that's about all. Again, thanks for the help guys.\n\nTL;DR: Been focusing on myself and my work. Boss found out that I'm his girlfriend's ex and things are now awkward but bearable. \n",
        "permalink": "/r/relationships/comments/94lmrw/update_my_boss_24m_is_dating_my_ex_19f_and_now_i/",
        "comments": [
            "I am actually sort of glad you didn’t answer your Ex’s phone call or return it. I cannot imagine, for the life of me, any usefulness to that conversation. \n\nI mean, did she not know anything about the department you were in at school? Or the likelihood of seeing you if she kept her dating pool there?\n\nIMHO, you really demonstrated an ability to be above drama by not immediately telling your boss or Sara about your previous work/romantic relationship. \n\nAnd i’m super stoked that, instead, you just focused on work and got praised by your boss boss. Good for you! ",
            "Continue to work your ass off, be the better man, and you’ll get through this. Impressing your boss’s boss was a good move as it’s gonna help your future academic pursuits.",
            "Handled like a champ, OP. Satisfying read. 10/10",
            "This comment has been edited and original content overwritten.",
            "Proud of you OP, now go no-contact and you'll be at the finish line.\n\nHope you find someone new soon.",
            "I'm impressed,  good work at showing a high level of maturity! Keep working hard in all areas and someone amazing will come along !",
            "[removed]",
            "You should clear up the awkwardness at work. Go to your boss and tell him, \"I guess you know now that Sarah and I dated. I hope that won't affect our working relationship.\"",
            "Definitely don't bring your boss boss into your personal drama. It doesn't matter if it's awkward you'll have to suck it up. It will look bad on you if you go complaining about this. ",
            "I am glad you're doing better, but if he's working at the University, which you and your ex attend, then it is 100% his fault he's running into awkward social situations when he *dates undergrads*. Even if she isn't a student, she's 19, who does he think she socializes with at that age? Only professors and researchers??",
            "If anything your boss probably feels embarrassed that he’s dating the girl that his 19 year old subordinate dated. That probably feels slightly imasculating to him if he enjoyed feeling powerful over you. The ‘he has got your leftovers’ mentality if you will. Sounds like you are killing it and doing everything right! Keep up the positive attitude and hard work, thanks for the update.",
            "Hey buddy, you may want to do one thing to cover your ass. Go tell your boss's boss that your boss is dating your ex, and that it isn't a problem for you, you just wanted to let him know. You don't know your boss that well yet. He's feeling awkward. He might be an asshole. He might be very insecure (he's a grown man dating a 19 year old... That's a very big five year gap, much greater than 35 to 29* and when you look back on this when you're 24, you'll see just how true that is), and it's very possible that he'll come after your job. Romantic entanglements can really fuck shit up at work. Imagine being an insecure guy, seeing the guy that used to fuck your girl at work everyday, and having the power to do something about it. \n\nEdit: typo",
            "OP, I missed your original post, but I thought of something that might help give you perspective.\n\n> Maybe it's because he's a major step-up from me. I'm a poor, disorganized undergrad and and he's a successful, young talent who has his shit together.\n\nThat's one way of looking at it.  In your older thread a lot of people told not to think of it like that, which is also good advice, but here's a different approach... Maybe you're thinking of it like a competition, or maybe a game, like an RPG, and he's the \"more powerful\" character.  But if you're thinking about it like that and the game started at 18, he's 5 levels ahead of you.  You've got 1-2 years into adulthood, he's got 6, 3 times more.  If it were a game/competition, there's simply no point in comparing a level 2 character against a level 6 character.  You have to compare where he is today with where you are in 5 years.\n\nSimilarly, this same concept becomes a problem in relationships.  Brief tangent then I'll bring this back to your situation; it relates directly.  I'm a big fan of the age / 2 + 7 formula for dating.  At 24, 19 is the absolute bottom end of who he should be dating.  Why does this formula seem to work?  Because starting at 14 (7 * 2), for every year of life you experience, the range of experiences people can go through doubles, as well as the ability to acquire skills, knowledge, and resources in life.  For example a 30 year old likely has figured out what they like and don't like, been through some good and bad relationships, and have started or are starting a career; Them dating a 19 year old is inappropriate and fraught with problems because the 19 year old doesn't know what they want and hasn't had relationship experiences to help them be on the same level with the 30 year old.\n\nSimilarly, a 25 year old woman versus a 50 year old man is also inappropriate as the 50 year old is settled down, generally has substantial skills and resources/investments built up, and not a lot of time left to enjoy them before age takes its toll.  The younger woman doesn't have a lot of ability to refuse things the older man wants, as the increased resources make her less equal in any disputes.\n\nSo now getting back to your situation, you're comparing yourself against someone many years ahead of you in life.  His relationship with your ex isn't quite \"inappropriate\" using the formula, but only just barely.  He's further ahead in life than both of you, something that may cause them issues if they stay together.  But you have a lot of time left.  At some point the tables will be flipped with someone else - You'll be the older one who is years ahead.  Does that make you better than them?  In terms of comparing raw skills, accomplishments, and resources, maybe?  But not necessarily when comparing you against them **at the same age**.\n\nSo stop comparing yourself at 19 to your boss at 24.  Compare yourself at 19 to where he was at 19, if you're going to compare at all.  And be mindful that you will find someone that makes you very happy; You've literally just started your dating life, it is highly highly unlikely that you ALREADY found the best girl you'll ever date.  Look up the secretary problem (aka the marriage proposal problem) on wikipedia if you want some perspective on THAT, from a hard-numbers perspective.",
            "You’re doing great just keep it professional. Don’t make it awkward pretend like you don’t give a fuck.",
            "i agree with everything everyone’s saying but what’s so bad about their age gap lmao i’m friends with people who are 5 years older than me (f 20) and there really isn’t that much of a difference between them and friends of my age ",
            "Dude honesty maybe you should just address the huge elephant in the room in a joking, but appropriate way! It would be hilarious and be much easier to work with after it it! You have nothing to lose and it's going to be awkward, unless something changes. If you liked your  job and him before you both knew why quit? Continue to work on your own thing and won't bother you.",
            "In your first post \"he's got the girl and I've got no one\" google search 'zero-sum game relationships' \n\nStop seeing as if you've lost. There is no such thing as winning or losing in relationships",
            "You handled this pretty well. There isn't anything you could have done better. ",
            "You could always approach your boss in an attempt to clear the air. Tell him what you have told us, that you don’t have feelings but have felt a little awkward. That you still respect him and enjoy your work, and that the work is your focus. That you’d like to stay where you are but if it might affect your work that maybe you should be moved.\n\nYou say that he seems like he has his shit together but you seem like you have yours together for a 19 year old. No one ever really “figures it out” we all just keep showing up every day, work hard and do the things that make us happy, and you seem to have already learned that and are on the path to continuing on that path. Good luck OP, seems like this is a great opportunity to grow as a person, keep on doing that.",
            "Man, seems like letting Sarah know where you stand would serve to improve your working relationship with your boss. That unreturned call = ambiguity. It'll provoke a degree of anxiety/worry in her, which would affect the boss as well, and filter down to his interactions with you. One call to reassure her that while it's wildly awkward, there is no animosity. You can resume distancing yourself after, and it'll go to resolving the awkwardness at a quicker pace.",
            "Hey there! I just wanted to point out something to you. I am a very senior graduate student in a research lab and I would be horrified if any of the techs or undergrads referred to me as a their \"boss.\" The graduate student is your mentor and probably really cares about your success and progress. Don't be too afraid to talk it out with them. As a graduate student he has no real authority over you. He can't fire you. Your real boss is the PI. If you're very uncomfortable then you can ask your PI to work with a different graduate student; although, I would be surprised if the graduate student actually cared about your previous relationships. He's probably more worried about you feeling uncomfortable.",
            "[removed]",
            "This is a good update. Continue to focus on yourself, and move forward. Great things will continue to happen for you, as you seem like a wholesome guy!\n\nIt's actually good that you did not answer her phone call. Look to the future, not the past. She has her new relationship and that's fine, you are moving on. ",
            "You had her first. 24 year old boss has your sloppy seconds..Nice ",
            "This happened to me. It was a loooong time ago, but we broke up and within days she was with him.\n\nHe fired me about a week later. Only time in my life I've been fired. ",
            "I think at least you can say that you guys dated and that you want to keep things professional at work ",
            "Give it a few weeks and y’all we will regular ole Eskimo bros with not a care in the world ",
            "You handled this so maturely. Very cool update!",
            "Just stay focused! This will pass. \n\nIf you can make it through this and stay mature, avoid drama and persevere, this will serve you in future experiences in a big way. \n\nDon't bring it up with your boss, just be professional and focused on your work. \n\nI would suggest keeping a little distance from him just for your sake, and just expand your life and keep moving. \n\nYou are doing great with a really tough situation and just keep your life moving and don't look back. ",
            "I don't think you should have any problem with that at work. Your personal lives should be apart from your professional careers. \n\nI'm also glad you didn't answered that phone and agree with you about putting some distance between you and your ex, you don't really need that.",
            "I would avoid the ex at all costs. I wouldn't even return the call. \n\nHonestly, what really are you going to talk about? How much she likes him? \n\nAvoid the two of them as much as possible and keep trying to improve yourself.\n\nAnd it might be a good idea to switch to another boss if it doesn't get better in the next couple of weeks.\n\n",
            "I would avoid the ex at all costs. I wouldn't even return the call. \n\nHonestly, what really are you going to talk about? How much she likes him? \n\nAvoid the two of them as much as possible and keep trying to improve yourself.\n\nAnd it might be a good idea to switch to another boss if it doesn't get better in the next couple of weeks.\n\n",
            "You should tell Alexa to play Despacito",
            "> But if things continue to remain really awkward to the point where both of our work is affected, I'll consider talking to my boss boss about switching me to work under another grad student instead.\n\nI think at this point it might be worth clearing the air with your boss about this. From your original post it sounds like you two had a really good professional relationship before this situation arose. Now that he knows, you might as well have a conversation about it, just to let him know that you bear him no ill will about it and that you want to preserve your working relationship with him. It might help to diffuse some of the awkwardness so that you can both move past it. It’s definitely worth a shot before going to the step of asking your PI to switch your supervisor.",
            "I think you shouldn't care about her and focus on your work. When the time being everything will be ok but I think you should try to apply to other jobs as well. ",
            "I don't who is Jim and who is Michael Scott here! ",
            "He is a grad student, he is not your boss. The faculty is your boss. He is helping you learn the ropes. Just keep that in mind. I was a grad student once so I know how the power dynamics work. ",
            "A bit immature but one way to think about the situation is that you've already \"been there did that\" and perhaps now your boss is feeling a bit insecure that you know many very intimate details of his girlfriend.  Doesn't sound like your boss is trying to be an asshole about things, but maybe this thought will help give you some confidence in that regard - to help overcome any lingering feelings you have.",
            "You are only 19. I don’t say this to disparage your relationship but to re-assure you that just because you break up with someone doesn’t make you a failure or make the relationship a failure.\n\nYou learned things about what you want in a partner, what you want from yourself and what you want from a relationship. \n\nSarah is an imperfect person with agency and decision-making, with thoughts, feelings and desires. She isn’t a prize for “the best man” and you and your boss aren’t competing for her. The fact that she broke up with you and then started dating him doesn’t say anything about your relative value as people or as men.\n\nMaybe they’ll break up too. Maybe they’ll be more compatible than the two of you were. Maybe the lessons Sarah learned when she was dating you plus a little bit more age and experience will mean she’s ready to commit to him when she wasn’t ready to commit to you.\nThat still doesn’t ~mean~ anything. Except that it is, or isn’t. Que Sera Sera my friend - Whatever will be will be.\n\nYou’re doing good. Keep doing. ",
            "You'll be fine OP. You'll be fine.\n\nFocus on yourself dude! Always remember that your boss has 5 years of advantage, so you don't need to be letdown or even consider him an upgrade to you.",
            "Late to this party but..\n\nI am the person who would see how awkward it is for both of us and literally just bust out Laughing at the situation. \"I see you are shocked as well lol.\" Would probably makes things less awkward since both of yall are indeed shocked. ",
            "Can i just ask why ur still on ur ex’s sc?",
            "What fucking 25 year old dates a 19 year old? Ugh.\n\nJust keep trucking. You got dis. You aren't the weird one here, lol, they all are. ",
            "You had her first. 24 year old boss has your sloppy seconds..Nice. Also dude, you're now eskimo brothers with your boss. ",
            "[deleted]",
            "[removed]",
            "Don't date at work lol",
            "You banged your  bosses girl bro you got the oneup on him. Be thankful you dodged a bullet ",
            "Well, you two can chat about the Sarah. I'd open with something like \"so she got a cute ass, huh?\". It's not like it could get any more awkward. ",
            "[deleted]"
        ]
    },
    {
        "post_id": "3evkhf",
        "author": "throwawaybadsonornah",
        "title": "My (31M) father (67M) is now on his deathbed, he verbally mentally and abused me when I was younger and now wants to see me, I have no desire to see this man but my mother and sisters are giving me hell over it and my wife thinks I should at least go, once, what do I do? UPDATE",
        "url": "https://www.reddit.com/r/relationships/comments/3evkhf/my_31m_father_67m_is_now_on_his_deathbed_he/",
        "score": 2773,
        "num_comments": 719,
        "created_utc": 1438072335.0,
        "selftext": "Original: https://www.reddit.com/r/relationships/comments/3cf4yn/my_31m_father_67m_is_now_on_his_deathbed_he/\n\n\nSo I went to see my dad and it basically went like shit. I caved, I fucking caved and decided fuck it, I'll see what he wants. Maybe this is something worth hearing. I visited the hospital by myself. Now wife. No mom. No sisters. Just him and I.\n\n\n\n\n\nHe looked old and tired and just as I predicted I didn't find it in me to be angry, this wasn't the man I remembered, this was just some old broken man. It would have been a waste of my time to feel angry and yet I did. I was so pissed off because I couldn't stand across from him eye to eye and let him see that the son he treated like dogshit had built a wonderful life for himself.\n\n\n\n\n\n\nWe didn't say anything to each other for around an hour. Then eventually I found my voice and said ''you know this is the last time we'll ever see each other right?'' No response. Then he replied ''I know.''\n\n\n\nSo I asked him why now? Why did he want to see me so badly that he had to send a message through my mother for me?\n\n\n\n\n\nAnd here is where I learnt that my existence was fuck all to him. He admitted that he did it just to give my mom closure, she didn't ask him to do it but he knew she wanted it. \n\n\nSo I asked him why he treated me the way he did my whole life and he replied, **''I never wanted a son, never had any interest in one.''** It fucking hurt but I kept listening and he kept speaking. He said that in the first few years of my life he tried his best to care about me but eventually he realized he couldn't. Then came the final nail in the coffin of my relationship with that man.\n\n\n\n\n**I never loved you but I didn't hate you either, I just didn't care for you because I never wanted a son, I wanted to give you up for adoption when you were younger but your mother would never have forgiven me, so I did my best to push you aside and you would always try and get my approval for stuff, I felt bad at times but I just didn't care for you** \n\n\n\n\nBy that time I was crying, me a 31 year old man, left my dying father in his hospital room and went to my car crying. I could have gone my whole life not knowing that. Fuck my mom, my sisters, my wife and my dad. I'm just so pissed right now. \n\n\n\n\n\nThere was a part of me that hoped we would bury the hatchet, nope, I just learnt he never gave a fuck. \n\n\n\n\nI will never speak of my father again. I will not attend his funeral or visit his grave. When he dies I'll be at the bar drinking because the fucker is gone from this world and I will do everything I can to be the father he never was.\n\n\n\n\n**TL;DR visited dying dad, found out he never wanted a son, wanted to put me up for adoption, didn't love me, didn't hate me, just never cared about me**\n\n\n\n\n\nEDIT:-  **I just want to say thanks to everyone for your kind words, both in comments and pms, they really helped a lot, particularly while I was hung over this morning and laying in bed thinking about life. Also to the stranger who gave me gold, thank you, never had that before and it was quite unexpected.**\n\n\n**I've got a ways to go still, I feel like yesterday opened up wounds I didn't even realized had never really healed and I'll be talking to my wife about it and most likely a professional as well. I won't cut my mom or sisters out, I am not angry at them, their experiences with my father were different from my own and I do not fault them for that, however, right now, the best thing for me, is just to not be around them as much. So I don't think they'll be seeing/hearing from me for some time.**\n\n\n**Once again, I sincerely thank everybody, it was your comments and pms that made me realize, yeah it hurts like shit, but I can't let him have anymore power over me, I'm in the prime of my life and I've built a nice life for myself. I don't need a dying man's approval anymore because I've done the best I could for so long without it anyway, so here's hoping things will get better soon.** \n",
        "permalink": "/r/relationships/comments/3evkhf/my_31m_father_67m_is_now_on_his_deathbed_he/",
        "comments": [
            "Well, maybe it was some form of closure, although a really fucking shit one. Good riddance. \n\nI don't get along with my father either. This whole story gives me anxieity.",
            "Weirdly, you have got closure, just not the closure you wanted.  If you hadn't gone, you would have wondered what would have happened.  Now you know that the stupid old man was still a stupid old man and you've lost nothing by having him out of your life.  Focus on the family you have, and like you say - be the father you wished you had.  Know that you aren't like him.  Know that you gave him the chance he didn't deserve and that you are a million times better as a person than he could ever be.",
            "A poem by /u/Poem_for_your_sprog,\n\n\n\nMy father taught me how to live\n\nWithout a hope, and how to give \n\nA kid he didn't care about\n\n A life of shame and fear and doubt\n\n\n\n\nHe taught me how to miss a guy\n\nYou never knew, and wonder why \n\nHe couldn't find a way to say \n\nYou weren't enough for him to stay;\n\n\n\n\nHe taught me how to never call, \n\nAnd how to hurt, but most of all - \n\nMy father's lessons showed to me \n\nThe dad I didn't want to be\n",
            "This might be petty bordering on evil, but have you told your mother all this? It would probably hurt her badly, hence the \"petty bordering on evil\", but she shares some responsibility for everything you went through, so she arguably deserves to know what the consequences were.\n\nMoreover, if she's hurt and talks about it to your father there's the off chance he might go to the grave feeling a little bad about what he did. He seems to care about her after all.",
            "You know what man? Fuck this shit. Fuck all of it. Fuck anyone who tells you you'll regret it when your dad's gone. People who've had awesome rosy childhoods don't know what it's like for people like us who get the short end of the stick and grow up with bitch people like our dads. Fuck it all. You did well OP. Kudos to you.",
            "Well on the bright side now you can tell your sisters and mother what he said when they throw a fit about you not attending the funeral. Fuck them, and fuck that asshole. Your father is a piece of shit, I can't fathom what kind of monster it takes to treat a child, let alone his own son, like that. I'm sorry you grew up with such a vile person. ",
            "Your mother, sisters, and wife probably thought he wanted you to see him to bury the hatchet and I'm sorry you had to go there only to be disappointed by your father again. At least there was some closure as to why he was abusive to you, but I'm sorry that he hurt you one last time. Be proud of who you are despite that bastard, and have a mini party for yourself when he dies. ",
            "The truth will set you free, but first it's gonna piss you off.",
            "You're not an idiot. \n\nThe only idiots here are those Redditors shaming you for not wanting to see your father. And look, some of them are still here.\n\nYour mother knew. \n\nThere is no way a parent can casually stroll through decades of this bullshit without recognizing the abuse that is going on. This is why behind every broken household there can be one parent who is a jerk and another parent who is perfectly complacent in allowing mistreatment to continue. \n\nSomewhere along the line, your mother's need to be in a relationship trumped your welfare and upbringing. Somewhere alone the line, her desires trumped your wants and needs - to the point where she shamed you, turned family against you, and even ignored your father's own wishes just for her own selfish desire to see you two speak. \n\nSo yes, you'll review a bunch of idiots remark how you've earned so much closure, even if this is not the closure you wanted. The reality is that your mother is a willful participant in your suffering, both as a child and as an adult, all because her desires come before you. So this is not closure but instead another obstacle in your way of growing and moving on with your life to be happy.\n\nPLEASE consider speaking with an actual professional and not a teenager on the internet who trolls /r/relationships because school is out for the summer.",
            "The worst part is that if he'd just given you the approval you craved and treated you like a decent human would, you probably wouldn't have kept coming back for his approval. He might've treated others well, but this shows that at his core, he's not a good person, because a good person treats everyone well, regardless of their feelings towards them.\n\nWhat he did made you resent him and hate him, for never giving that approval you craved. He could've made both his own and your life infinitely better by not being shitty.\n\nI hope you can find all the happiness in your life that you deserve and use your dad as a prime example of how not to treat people.",
            "*hug*\n\n...that's all I have to say.  All of the hugs.  All of them.",
            "But you know what? You don't have to care anymore. You're free. ",
            "People don't seem understand is how deeply it cuts for OP than his dad literally didn't give a fuck. It wasnt that his dad hates him, but because he didn't even care OP is like a sad, pathetic puppy for going back for the chance of affection. It would have been world's better if the dad hated him and actively tried to make his life suck. Now OP has to live with this mindfuck for the rest of his life. Anyone who recommended going to see the dad needs to stop living in a Disney fairy tale.",
            "Every now and then I picture my mother being a wonderful grandmother to my LO's.  Then I wake up and know the the cold hearted reality.  She never wanted a daughter and made my life a living hell.  For years I fell into this mindset of daughters should always love their mothers.  Nope I owe that piece of shit nothing.  All she is is biology to me and that is that.  I know why you went that hope inside you of that person to atone for their behavior.  To feel what is it like to feel their love.  You have your revenge and that piece of shit knows it.  His life is over he will die a miserable fuck.  While you will continue this life that he never will have.  That is revenge.  \n\n\n\n\n\nJust because send an email to your mother and sisters.  Copy and paste what you wrote here.  Knowing myself I would cut them off.  They don't understand and never will.  \n\n\n",
            "This is why I believe it's so important to NOT GET INVOLVED when people are estranged.  My dad always had a strained relationship with his dad and my mom encouraged my dad to reach out to him.  It never ended well.\n\nMind your fucking business, if someone doesn't want to see/communicate with someone else, that's entirely on them.",
            "For whatever it's worth, this is a reflection on him, not on you.  He was a seriously messed up man, you were a child.  You weren't unlovable and there was nothing wrong with you.  There was everything wrong with him. ",
            "Find your family where you need it to be. I have one side I am close to and the other I am not at all. I consider my grandmothers's second husband on one side (2nd of 4) far more a grandfather than my grandfather on the other side (who was an abusive piece of crap). \n\nI am an only child but I found my brothers and sisters in close friends, in my wonderful partner. Friends of mine found their family in adopted or step parents, where their bioparents were absent or not up to the job. Family is not just biology, it is far more a choice to invest in a joint world. You got dealt a shitty hand biologically, but you can still have family. ",
            "slimy snatch dolls concerned cooing mountainous theory absorbed license slim -- mass edited with https://redact.dev/",
            "Your father sounds like a piece of crap, and I'm sorry for your experience.\n\nI read both your posts and you come across as a together guy: you've worked hard to create a relationship with the rest of your family; you've started and grown a successful business; you have a wife you love and who loves you. Hell, you even tried to find some peace with you father, which took a lot of guts.\n\nYou're winning life. And if a bitter, dying old man can't appreciate that and you then that's his loss.",
            "As corny as this may sound, maybe you need to hear it: Your worth is not tied to wether or not that person cared about you. You have plenty of people in your life who do care about you and they hopefully had the best intentions for you here even though it didn't go well. ",
            "Im sorry your family gave you shit man, ive beem there, wanting approval from your dad and never getting it, I grew up trying to like and learn everything my dad liked but never got his approval. Ill tell you a story I really dont like, I was 13 and doing the stupid school thing trying to sell candies and what not, my mom encouraged me to try and sell one to my dad he was outside working on his 56 bel air that deep down I know he cared more about then me. So I go outside and try my best and he berates me and tells me shit then this kid about a year older who my dad just loved talking to about cars and stuff came with the same candies to sell and my dad bought almost all of them. Im sorry but fuck your family for making you feel guilty for seeing your dad and know when the day comes I get that bel air when my dad dies and I have it in my garage with a hammer in hand one of those windows I brake will be for you",
            "I have left reddit for [a reddit alternative](https://www.reddit.com/r/RedditAlternatives/wiki/index) due to years of admin mismanagement and preferential treatment for certain subreddits and users holding certain political and ideological views.  \n\n   The situation has gotten especially worse since the appointment of Ellen Pao as CEO, culminating in the seemingly unjustified firings of several valuable employees and bans on hundreds of vibrant communities on completely trumped-up charges.  \n\n   The resignation of Ellen Pao and the appointment of Steve Huffman as CEO, despite initial hopes, has continued the same trend.  \n\n   As an act of protest, I have chosen to redact all the comments I've ever made on reddit, overwriting them with this message.  \n\n   If you would like to do the same, install [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo) for Chrome, [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) for Firefox, [NinjaKit](https://github.com/os0x/NinjaKit) for Safari, [Violent Monkey](https://addons.opera.com/en/extensions/details/violent-monkey/) for Opera, or [AdGuard](http://adguard.com/) for Internet Explorer (in Advanced Mode), then add [this GreaseMonkey script](https://greasyfork.org/en/scripts/16006-reddit-overwrite-extended-with-list-of-alternatives).   \n\n Finally, click on your username at the top right corner of reddit, click on the comments tab, and click on the new OVERWRITE button at the top of the page. You may need to scroll down to multiple comment pages if you have commented a lot.  \n\n   After doing all of the above, you are welcome to join me on [a reddit alternative](https://www.reddit.com/r/RedditAlternatives/wiki/index)!",
            "That's pretty brutal... you have every right to be angry and hurt. I can't even imagine. That man is not your father. He was a sperm donor. \nTry to take solace in the fact that you've gone the extra mile to make yourself so much more than what he saw. ",
            "I'm so sorry to hear this. He was a manipulative POS and you are a good son for trying to hear him out, one last time. I was one of the people that replied that I am estranged from my dad too and I don't think I would go. Your experience cemented it for me. If someone treats you like shit your whole life, they shouldn't get a last chance. Especially a bastard like your father, sacrificing your feelings just to appease your mother. Please do whatever you need to do to purge yourself of his last poisonous words.  Again, I'm sorry.",
            "I'm sorry that you lost the parent lottery.  Don't let it define you.  We won't let it define you.  That's how you win. ",
            "I created an account to post this comment because your pain is so raw, I wanted to reach out with an internet hug and a different perspective:\n\nYour need and desire for a relationship is not week, it is normal, it is biology, it shows that you have the capacity to connect with people, that you can and will love your future little girl AND boy and leave a legacy of love, resiliency and connection. That is what you will be known for, you will do this so your grandchildren will know what healthy love feels like.\n\nYour father was a deeply damaged man. I get the feeling he had a traumatic relationship with his family of origin, because it is ABNORMAL to behave that way with a child. he sadly was neither resilient nor strong enough to get the help he needed to be a healthy father. His legacy was one of maintaining the cycle of abuse. His lack of getting help and perpetuating the abuse is weakness and small. HE was the little boy acting out his trauma. This was all about being stuck in his trauma/past and nothing about the wonderful little boy who was his present.\n\nVulnerability is strength, you are the strong one. You cam an access your feelings, you yearn for a relationship - you will be a great father and are a great partner!\n\nHugs from a Aunty to you strong internet stranger!",
            "Coming at it from another angle, I suspect your father might of had some deep seeded issues himself, it makes me wonder if he was a victim of abuse and irrationally decided that having a boy would repeat said history. \n\nThe thing that strikes me is that he'd confess to always having felt a predetermined way about male offspring but had no desire to be honest about what contributed to that. I feel like it was one last opportunity for him to dump on you without consequence. \n\nThere's freedom in knowing that none of this was about you. He admitted it was about him. His shortcomings. As complicated as you're feelings can be about being maligned and mistreated It can be better if you accept it's never been about you, he's projected onto you. The equivalent is racists projecting their failings into nit picking other races. It's not from a rational place. \n\nMaybe not today, but tomorrow dump those feelings of inadequacy. You're not the first person to go in an interaction expecting closure and not get it. People do it everyday of the week. It's such an absurdly common human trait we've got thousands of posts on this very forum from people who don't know how to end relationships,or find themselves confused at the end of a relationship, or have crazy exes who can't get closure. Humans naturally seek out ways to mend our hearts even if they are irrational or not going to work out for us. \nThe only thing you can control is taking that information and tell yourself to let go of the idea you've fallen short. ",
            "Let this be a lesson to everyone: If someone doesn't treat you right when they're alive and well, you don't owe them anything when they are close to death.\n\nThere is no way to put a positive spin on this... this wasn't closure, this was your father getting one last blow in before he died, without any consequences.\n\nSeriously, cut out the rest of your family for bullying you into this situation.",
            "If my Father/Mother ever said that to me while they were on their deathbed (which they wouldn't by the way, their incredible people) I would *accidentally* trip on the power to their life support on the way out.",
            "Let me offer a hug as well.  Take comfort in that you are a better person than that guy.  Im sorry he wasn't there for you as a parent, you deserved better.",
            "I used to regret having not visited my grandmother before she died. She, too, requested to see me for the last time before she passed, but I hated her so much growing up that I didn't. Now, years after, I feel like I should've gone. I feel like I was cruel not to grant her dying wish despite how she treated my family. I should've just taken the high road and made a show of complete forgiveness just so she can die in peace. But the cold hate in my heart that wanted to get back at her somehow took over. I never went to see her despite what other people told me.\n\nAfter reading your story though, it opened my mind to a different kind of possibility. Maybe it would've turned out this way too. And knowing how unnecessarily cruel and bitter she was, it's a big possibility. And given how my fucked up family have more than messed me up, I don't think I can handle more anger in my life right now. It's a selfish reason, but I'm glad I read this. It'll help quiet a few of my own demons. ",
            "Fuck that man. I hope u become the best dad in the world to your kids. Who the hell says i never had interest in you? I was abused by my parents too. Both of them were marines. I love them and keep a distance but at least it made me capable of surviving any situation this world can throw at me. I just hope you can find some sort of good from this. ",
            "\"I will do everything to be the father he never was\"\n\nThis is the best thing you can do. You know how shitty it is to be treated the way he treated you. You know that pain, that hurt, the feeling of wondering why. You are going to be a great dad. ",
            "Have to talked to your mother and sisters about what he told you in the hospital?",
            "You need to tell your wife, sisters and mother. They need to know why you felt the way you do. Its possible they just don't know. \n\nAt 35 I finally figured out my dad never wanted me around after my grandmothers funeral. I tried giving him a hug and he just moved past me to my step mom and sisters. Oh and he was putting on a family get together afterwards and didn't tell myself or one of my uncles. Fuck you dad.\n\nMoms not much different but I've vented too much here already. You're better off op.",
            "What did your mom and sisters say when you told them what he said?? \n\n\nProbably something along the lines of, \"He's on medicine, you misunderstood, don't be heartless\"?",
            "This is why I wish so badly that family members would realize that not everyone's relationship with their loved ones is the same. Just because one child had a good or even just ok experience with a parent doesn't mean the other did. \n\nI'm sorry you had to go through this and that he was the same piece of shit he was from your past, but I'm also happy for you that it is finally over too. I certainly wouldn't rub it in your family's face how it went but when the funeral comes you need to stand firm. ",
            "Maybe he was \"afraid\" of you the whole time.\n\nAfraid you would become the man he never became.",
            "Sometimes, certainty is a gift. You will now never regret that he died when you didn't know him. You'll know that it was for your own good not to be in touch with someone who should have loved you, should have nurtured you, and couldn't get over himself enough to do so.  ",
            "Try to find solace in the fact that he never cared. It wasn't about you. He just didn't care.\n\nMy mother was the same way.\n\nShe just... couldn't. I forgive that because it's something she couldn't help, like when someone admits that they love you but you only see them as a friend. You can't force yourself to feel something you don't.\n\nYou don't have to forgive the way you were treated, but it may help you to forgive what he was unable to do and let that go.\n\nIt took a HUGE weight of off me. The day she died, it was like the world was finally clean. Can you understand?\n\nBecause the one person that was supposed to think the highest of me in this world, but thought I was garbage... was finally gone. I no longer had that hanging over me.\n\nBest day of my life. Neither one of us were in pain any longer.\n\nI wish you healing Sir. I wish you happiness.",
            "I don't know if you'll find this story comforting in the slightest, but it sort of reminds me of your situation. My father was abused and neglected as a child as well. When my grandfather was on his deathbed, my father said to him, \"Dad, I forgive you for everything.\" His response was, unironically, \"What the hell did I ever do?\"  \n\nMy dad did what you plan to do, in a long term sense: be the best father that his father never was. I love my dad and he's been a role model for me. It can be done. You can do it.",
            "\"I will do everything I can to be the father he never was\"\n\nYou win.  He lost.",
            "God fucking dammit, OP, that sucks. I feel awful that you went through that. If you want my advice, and I can't imagine why you would, I would tell you:\n\n- Go talk to a neutral 3rd party about all the anger you're feeling toward him. If you choose a therapist, I'd recommend a male therapist specifically. \n- If your wife wants you to \"open up\" to her about how you're feeling (and if you want to just explode at her for pressuring you to go to see him), let her know that you don't trust yourself to talk about it right now and for her to give you time to process your feelings. \n- If/when you become a father, remember that you will choose every day what kind of father you will be. Be an awesome one. My dad's father abandoned him and his mother. He grew up though a series of abusive stepfathers. And though he was far from a perfect father, himself, he told me he loved me everyday because, as he put it later, he wanted to be the father that his never was. \n\nBest of luck, bro.\n\n*Man-hug*",
            "Holy shit, what an asshole.  THIS is the reason I get frustrated when my SO doesn't understand why I don't try to have a relationship with either of narcissistic parents.  I'm sorry, man... I hope you can move on with your life now that you have an answer as to why he treated you like that.",
            "It is time you cut your relationship with your mom and sister as well the fact that they gave you hell to go hear that proves they are just as fucking toxic as he is. Wither you propane bomb the funeral or not is your choice I can't say me as a person who have never met you didn't consider doing it on your behalf.",
            "Fuck this. Fuck him. He was a reprehensible POS. I hope you told your mom, sister(s) and wife what he said.  What I would recommend is that you start therapy soon.\n\nDon't let someone live rent free in your head. FUCK HIM. The best revenge is living well and you are doing that.\n\nAs an aside, be the man he never was. Care more. Love more.  Be more.  I hug and kiss my daughter every day. This is something I never got from my dad. I tell her I am proud of her. I tell her she makes my life better.\n\nI am working on a relationship with my stepson now. He is where you were. He is hoping beyond hope that his dad will become the man he wants him to be, as a result, I am categorically rejected.  I refuse to give up and persistence and love is a constant in our house.  But I refuse to be the man you described. He isn't mine, but I will love him like he is.",
            "[deleted]",
            "\" I will do everything I can to be the father he never was.\"\n\nBoom.",
            "Stop being angry. Have a child, & love him. THAT, is your closure. ",
            "Have you told your sisters and mother what he said?",
            "You have every right to be pissed at your family and wife for this. I think exposing the whole thing in detail to them, and making them face the reality of it could be cathartic for you.\n\n\nIt is unfair that you have to deal with this alone, and you don't have to spare their feelings about this. You were the one who suffered the injustice of this and they are piling up on it.\n\n\nYou can't change who your father was and what he did to you but you CAN make yourself heard. Don't let your mother and sisters blind themselves to the truth. As rosy as their childhoods were they would have to be pretty fucking stupid to not see what happened to you and I'm retty sure there's a bit of wilful ignorance in their attitude.\n\n\nAlso make sure that your wife understands how hard this is for you, and how you are not exagerating things. You need her support and you need to deal with the resentment you feel because she pushed you to see him. Don't let this become another issue.",
            "He's died an sad, bitter, malicious old man who bullied and abused a child. \n\nYou're so much better than him, than that situation, than the shit he put you through. \n\nBest of luck to you man, your wife was doing the best she could (although she underestimated the depths of your father's pathetic-ness).  Fuck him man, he's nothing.\n\nAnd I just read below, you're not the stupid kid who hoped his dad would love him - you're someone who cares about people, and loved his family, and makes huge efforts for those who matter to him. You're 1000 times more of a man than most men for even taking the time to try and see if you could salvage something. You faced your anger and your fears. ",
            "At least now you won't have to deal with having unanswered questions nagging at you. I would try not to be too hard on your family. You feel angry and it's OK to let them know that but try not to make them feel bad about it. I'm sure that they were trying to make sure you would have closure or make his death easier for you. \n\nIt's difficult for people to understand how you feel in this kind of situation. Even the most empathetic person only has their own feelings to go on and his they would feel in such a state. \n\nDon't brush it off, or pretend everything is peaches and sunshine if they ask you about it. Be honest. Just be fair too. ",
            "What a load of crap. He didn't really try a single day in his life.\n\n\nOften, people will post here about how they have a crush on someone else while in a relationship, but they don't want to have feelings for this other person. Then they proceed to change nothing about how they interact and think about this other person and - surprise, surprise - something happens. Then they want to know how to fall out of love with the wrong person.\n\nIf a person continues to act and think the same way about someone, they can go through the motions all the want, their thoughts and feelings about that person will only become greater.\n\n\nYour father can spout all the BS he wants about trying to care about you, but the fact is that he didn't. He may have gone through the motions of trying, but as long as he kept thinking the same \"Oh, woe is me, I never wanted a baby boy\" thoughts and kept avoiding interaction with you, then his \"trying\" meant absolutely nothing.",
            ".....is he dead yet?",
            ":( I feel so heartbroken for you. Hopefully, one day you'll be able to see this as closure in a way. His rejection and abuse had absolutely nothing to do with you. You weren't a bad son, and you did everything right. There was something wrong with him. Honestly, what man doesn't want a son? Fuck him, for sure. I hope you can find it in your heart not to resent your mother, sisters, and wife. They truly wanted the best and probably had no idea that your father would be so blunt and heartless. ",
            "You gave him the opportunity to give you a giant fuck you before he left this plane of existence.  Unfortunately you still felt something for him, would've been better to tell him the feeling was mutual, but instead you regressed back into that child who was still seeking approval.\n\nI'm feeling the relationship with my father is the same way, and I've come to not care anymore.",
            "This is super sad man, but yeah, all you can do is use that as a reminder of what you NEVER want to become. He sounds like a terrible dad and just a dick of a person (holding a grudge against you, on his deathbed, because you were born!). You have an opportunity to become a great dad (if you want that) and a kind, loving husband to your wife. Sorry about having a shit dad man, he sounds like the worst.",
            "Man, I'm so sorry. As a dad with two boys, this breaks my heart. I'd step in front of a train for my boys, like most fathers. It's brutal, what you've learned. You deserved so much better. Being a dad is about more than biology, as I'm sure you know, so as a dad, let me just say that I'm proud of you - your accomplishments are astonishing, all the more so because of the adversity you faced. Any father would beam with pride at what you've done. And son, don't drink too much. Be kind to yourself. Treat yourself with the love and respect you deserve, because you really do deserve it.\n",
            "Don't shred yourself to bits over that one last time, all of us who have cut parents off still have that little niggle of hope that a miracle will happen and finally we will get the parent, if even for a brief moment, we wanted and deserve. I am sorry you went through that, people who don't understand just think all we have to do is go for closure or go visit and it will all be sunshine and roses. They are naive or motivated by who the hell knows what. \nYou are not defined by who you father was - break those cycles and make your own life. ",
            "It's closure, now you know.  I would advise to go to the funeral though.  Not for him.  Despite him.  Do it for your sisters and mom.  Be there for THEM.  Be better than him.  Help them share their grief.  If you don't, you'll never be rid of him.  They won't forgive you - it will never stop coming up.  Go, be gracious and kind to your family - not out of any respect for him - but out of concern for those left behind.  Don't let HIM control you one more minute, let go the anger, the hate, the despair - none was your fault.  None was deserved.  He was flawed, broken.  You are alive.  You can open a window, feel the wind and sun on your face and smile at the possibilities of a new day.  ",
            "*Nana internet hug*\n\n\nThe man's brain is somehow wired wrong and his emotions stunted. Something very wrong about a Father not wanting his child. \n\n\nSeriously - I think it's a good thing you did for yourself. You know some facts you didn't before. Doubt has been swept away and now you can get on with life without thinking \"Was it something I did? Was it something I should have done?\"\n\n\nI have no doubt the visit was painful but in the greater view of things - it is also healing and will continue to heal cleanly. \n\nYou can let it all go now.\n\n\nYou take care!",
            "I hope what comes from this is that you realize that your father's feelings toward you have nothing to do with you.  He decided before you were born that he didn't want a son, and it's not a big leap to think that because you were the only child whose gender matched his that it was because of feelings he had about himself or about masculinity in general, that he was never able to resolve.  I can't fathom having a child that I don't love, let alone just because of the child's sex, so I can't imagine what you have gone through, but I am so glad you have been able to separate your mom and sisters from your dad, who caused you pain.  ",
            "Don't try to handle this on your own.  Share this with your wife, friends and maybe a good therapist.  This is too heavy and too rotten for you to carry alone.  I'm so sorry.  What a piece of shit he is.",
            "Dude, that fact that you went and looked him in the eye after all he did to you makes you more of a man than he ever was. Don't forget that. ",
            ">My wife, mother and sisters all want me to pay a visit to him, well my wife thinks I should go just once, she isn't pressuring me, she knows my history with him and says if I decide not to go, that's it then, my mother and sisters however do think I should go and have all spoken to me several times in the past month about this.\n\n>Fuck my mom, my sisters, **my wife** and my dad. I'm just so pissed right now.\n\nYour wife has no reason to be fucked. She gave you the option of going and leaving it up to you. You mom is at fault and do not know how much of this did your sisters know. I am sure your wife did not know your mom's intentions and to vent at her would be displacing anger at the wrong direction.",
            "Please seek professional help.  Hugs 💙",
            "Fuck him. What a worthless piece of shit father he is. I just read your first and second post at the same time... I can't really believe anyone on here advised you to go see him, much less your mom and sisters. I'm so sorry it happened, but at least now you know you'll never see him again. I hope you can find some peace after this situation, it sounds like you are on your way. ",
            "It may not seem like much but you hit hit a grand slam. You got the truth. You also faced it down. That was was a show of strength.",
            "Your father is an asshole. He is horrible, but at least he gave you the truth, no matter how fucked up and horrible it was. I'm sorry you had to endure this, but at least you can go through life without thinking \"I wonder what he wanted.\" Now you know it's time to abandon that thought and go forward in life to make you whole. I'm not sure if you have children or not, I might have missed that part of your post, but you have a wife. Just be the best father you can be down the road when is your turn.",
            "I'm so sorry you went through this OP.  Some parents are really shitty; this subreddit is full of evidence of that.  \n\nI think the reason your mother, sisters and wife all encouraged you to see your father is because they love you.   They love you SO much that they can't fathom your father NOT loving you.  He had the shortcomings here,  NOT YOU.  Your father is an ass, but it seems that you're surrounded by people who care for you.  \n\nIt's okay to grieve for yourself - for not having a good dad, for having a shit hand dealt to you.  Grief does not have to be about death.  So take your time, mourn the things you need,  not what your family tells you to, because their grief will be very different than yours. \n\nFuck that guy,  you got this.",
            "Courage is going through with something despite knowing the outcome might be bad, therefore you're courageous and it might not mean much, but I admire you. ",
            "Buddy don't let this knock you and stop trying to forget it in the bottom of a bottle.\n\nEmbrace your family the way he never did to you and spite him by being a better person than he ever was.  Prove to yourself that he has no power over you and move on being renewed knowing no matter what has happened or what will happen in your life you will and have always been better than that man.",
            "Fuck that guy.\n\nYour mom and sisters meant well, but they were wrong - you knew better.\n\nAnd though it really hurts now, I'm trying to imagine you in 10 years. In 20 years. In 30 years. How you'll want to deal with the scars your father left you at each of those ages.\n\nThe positive - for your future self if not your current self - is that there is no ambiguity. There are no questions. You got the answers you always wanted - even if those answers were the ones you always feared. You *did* get some closure from him, and now there is absolutely nothing more you need from him ever. Good riddance.\n\nI'm your age, but I've spent a lot of time talking to older men about their fathers and the associated pain. And they have regrets, regardless of how awful their fathers were. The bright side is that you will never have regrets about, \"What if...\" or \"Could we have reconciled if...?\" or \"There are so many questions I still have.\"\n\nYou're free from those. Your burden is, \"How do I heal from the pain of that relationship? How do I not let it poison anything else in my life?\" That's a long term project, but it sounds like you've got a good start. \n\nAnd I hope you're able to express your feelings to your mother and sisters: \"Mom, it didn't go well, here's what he said, it really fucked me up, and I'm very angry with you for pressuring me into something I knew I shouldn't do.\" It's completely your choice whether you let your anger/hurt at your father destroy your relationships with your mom and sisters.\n\nAnd, seriously, fuck that guy.\n\n",
            "I hope you see this as I'm late to the party, but I have a similar story as you.\n\nWhen my mom got pregnant at 18 years old. Her and my father were exes rekindling an old flame. IMO he was going for a booth call, and leading my mother on. When she found out she was pregnant she told him. He already had one child from another woman. He went to all the doctor's appointments, and was there for my mom. She picked out my name Richard Torres. I was born in February. He never showed up to the hospital. When my mother called him and said I was born and he had a son. His reply was \" that kid is not mine.\" So I was named differently. He went on to have 5 more children with 3 different women. He claimed all of them but me.\n\nIt's difficult to find out you have 4 brothers and 2 sisters who you've never met that have never tried to reach out to you. Raised by the man who conceived you, who won't even acknowledge your existence. What's wrong with me that I'm the only one who is the outcast.\n\nI could go on about how my childhood was, but I'll just give you the advice I've come to learn from my experiences.  I don't need him in my life, I don't care if he's alive or dead, in fact I don't know if he is. My \"siblings\" have never tried to contact me, so I see it as their loss. IMO I've made it this far in life without them. I don't need them. I only keep people in my life who are going to better it, and me.\n\nSo I don't think of your experience as closure. I don't think you succeeded in spite of him. People like us succeed because of who we are, and the choices we made in life.\n\nI don't let my sperm donor dictate, or have any influence on my life. If I say I got this far in spite of him, I make my life about him in some way. It's not about him. I don't think of closure, I think of it as assurance. I know the path I chose to not let him have an effect on my life was the correct one. Justification on the choices on my life, to not try to get approval, love,  anything from them.",
            "Hey man,\n\nWhen I was reading this I kept thinking of the saying \"some of the prettiest flowers grow from the filthiest piles of shit\".\n\nI'm so sorry to hear about this - I can't imagine how painful it must be to go through this.\n\nOn the other hand - you're basically proving this expression true.  And seriously, there's something really profoundly wonderful about it - the idea of taking the garbage you've had to deal with, and somehow developing into a good human being, literally leaving the world a better place than you found it.\n\nBest of luck to you!",
            "I don't want to impose, but I do hope you leave an update detailing what your mom, sisters, and wife have to say. \n\nAlso, on the plus side, I think this is grounds for a life-long \"you can't tell me shit\" token that can be used in various situations towards them when they start spouting notions as to what you should or should not do.\n\nR.I.Piss btw.",
            "I'm really sorry.  \n\nI, personally, think could be a good thing for you in the long term.  I don't think you should feel anger at your mother, your sisters, or your wife.  They knew that you'd lose the opportunity to ever confront him if you didn't go see him.  I don't think that they all thought it would be wonderful for you, but it would give you the last ability to ask the questions you asked.  \n\nI think you are very angry, justifiably so, but I think you need to keep it directed at the person responsible: your father.\n\nIt's extremely understandable to have pain for how your father failed you.  He did.  You know it and he knows it.  His coldness and rejection probably meant you sought out his approval even harder, which made each rejection more and more crushing.  That is cruel to do to a child.  His total absence would have been less damaging rather than someone who tore you down.\n\nBut now you also know that *his failure had nothing to do with you and everything to do with him.*  He told you that it was his issue that prevented him from being a good father to you.  You were a boy, and no matter who the individual was that was his son, this would have happened.  It had nothing to do with you and not being good enough.  It was the luck of the draw that you were the boy that was born to a father that didn't want a son.  You were set up to fail, no matter how wonderful you were.  \n\nThat's an awful concept.  But I also think there is freedom to be found in that awful concept once you are over the initial pain.  Your father was a flawed individual and now you 100% know that.  It has nothing to do with who you are and it never did.\n\nThis concept of a parent treating a certain sex of child badly is not a new one.  My maternal grandmother experienced some sort of sexual abuse when she was young (I don't know details other than it possibly being her male siblings) and she went on to get married to a wonderful man and have my mother and my uncle.  My mother got the same treatment you did, while my uncle was viewed as the sun, the moon, and the earth.  My mom was set up to fail because there was some sort of twisted association with my grandmother between being a female child and being bad or being at risk of harm.  And so she just disliked my mother, because my mother reminded her of things she wanted to forget.  \n\nAnd that was always 100% about my grandmother, it was never about who my mother is.  And of course it hurt my mother; she is still sad at her mother failing her.  But she's able to balance her pain by seeing that it had nothing to do with her, and everything to do with being born female to an individual coping with secret pain in a very unhealthy way.  And she's been able to let go of some of her pain, and any wondering she used to do about whether she could have ever pleased her mother.",
            "Dude, fuck that man, he's no real father and honestly he'll have to answer to his maker for all of this shit when he passes. You need to concentrate all that hate into becoming the best man and father you can be to your own children, prove to him and yourself that you are more of a fucking man and a father than his piece of shit self. Despite his abuse and neglect you sound like you grew up to be a fine and respectable man, don't let such a toxic person continue to inflict pain into you fornthenrestnofnyour life.",
            "Be proud knowing you are the better man. ",
            "Go dressed as the grim reaper. ",
            "You are loved.",
            "Go piss on his grave :D",
            "Hey man, my dad abandoned me when I was 10 and I know that no matter what opportunity came to me I would never want to see him ever again.\n\nThe people saying that at least you got closure probably don't get it. It was only ever going to be hurtful and they shouldn't have pressured you into doing it, that was really manipulative and terrible of them imo. \n\nDads are shit man. Have a whisky when he goes and live the best life you can. Love, brother",
            "You did the right thing. It would always be playing on your mind whether he really wanted you at the end - now you know you never had a chance with the asshole; his loss.",
            "It sucks very badly but sometimes parents just don't love their kids. ",
            "Oh OP, your dad is a massive cunt. No one deserves to hear that from their parent. I'm sorry that you had to hear that but you did and it can't be changed. It fucking hurts, I know. The best revenge you can now how is that when you have children you love them unconditionally and with your whole heart. Stay strong dear stranger!",
            "[deleted]",
            "Hey, it's okay. Sometimes we have hope, even maybe foolishly, and we try shit. You tried, you hoped, and it didn't work out. I know it hurts, and I'm not saying that it shouldn't or dismiss that, but it's okay now, and it'll be okay in the future.\n\nI'm sorry this happened to you. I think you need to have a sit down with your wife and sisters and mom and explain the exchange to them. Then you need to get them to understand that they were not fucking looking out for your interests on this. You need people that are going to understand you when you say \"I don't want to see the guy, he treated me like shit,\" not push you and push you against your fucking wishes.\n\nI'm sorry it turned out this way, but you'll never need to deal with him again, there's no chance that you'll even pause to consider any maybes now. The thing to do from hereon is figure out why the fuck your family didn't back you and refused to be understanding about this when you're the one that suffered.",
            "At least he told you the truth.  At least you know now that all that approval you could never get, it was never about you.  You were good enough, it's just that *he* was unable to love or even care about his own son, for no good reason.\n\nWould have been nice for him to say \"I'm sorry\" or even just \"It wasn't your fault,\" though.  But I suppose that would have been a bit dishonest.  He never cared before, why should he care now?\n\n> I will never speak of my father again.\n\nI think you should, because if this happened to me, those words would be burned into my mind forever, and they would hurt me for a long time.  You're going to need help dealing with it.  It would be better to have therapy than to suppress this stuff.  ",
            "That sucked, but honestly I would rather hear that than spend the rest of my life wondering if he wanted to turn it around. It's an ugly truth :( Seriously, I'd need therapy if I heard that from a parent. I hope you are looking into grief counselling.",
            "I am sorry you went through this. \n\n\nI was raised in a similar situation. though not as extreme, and my father died a few months ago. I always told myself just because he was a lousy father to me didn't mean I could be a lousy son. I always treated my father with love and respect.  \n\n\nMy father was a flawed person, as was yours, as I am, as we all are. You're not foolish for hoping to get something good out of the last meeting. You did the right thing. He let you down. And now it's done. Get some counseling if you need it. \n\nIn the long run, I believe you will be better off for having seen him the last time. Remember to be a good parent and make the world a better place.",
            "Terrible story but I have experienced something similar and what I can tell you is that once the person is dead they can't feel a thing and this is quite a bummer because all that resentment and hatred that you have no longer has a target and you realise that the only person hurting because of this asshole, is you.\n\nStill, that realization does allow you to gradually forget about all the bad stuff and eventually you WILL arrive at a  place where all the bad stuff is forgotten and you only feel slightly sorry for the bastard who was unable to love his son because he wasn't emotionally equipped to do so.\n\nTake it easy, it's over a year since I had a similar experience and even in such a short time, I can barely recall all the resentment I had.\n\nThey died, we're alive, we win. \n\nAll the best.",
            "What an ass.",
            "this hurts.\nas an unwanted child myself i highly recommend therapy.\ni had, for the most part of my life, the feeling of being unloveable just because my parents haven't loved me the way they should have. \nyou are more than the unwanted child, you are loveable, you can do better!\n\nand you are free now: it's not your fault, that your father is a sorry excuse of a human being. \ni hope you can see that soon.",
            "Id have yanked out his iv as hard as i could a s walked away",
            "I was going to comment to tell you not to go when I read the subject. \n\nToo late I guess, parents can be assholes sometimes. ",
            "[deleted]",
            "At least you know that there was no reason for the way he treated you.  It wasn't you.  You did absolutely nothing wrong and never deserved the way he treated you.  \n\nHe's just a giant fucking piece of shit, and now he's basically in the waiting room for Hell....because, if there is a hell, that's where people who treat their own children like shit end up.\n\nOP...take solace in the fact that you are 1000 times the man your father was.  And that when you leave this planet, you will do so filled with love and peace because you will be surrounded by your family and friends and all the people who care for you.  You can measure a man by how many lives he's touched and by how many people will miss him when he's gone.  Not a single person will miss your father, not even his own family.  \n\n",
            "I'm very sorry that he was such a piece of shit father. Your mother should be ashamed for pressuring you to go see him. She knew how he felt and yet she all but forced you to go to make herself feel better. ",
            "I've gone through stuff with my family to the point I've cut my parents out. My mom was very psycholigically abusive and my dad enabled. To the outside world though, everyone thinks they are WONDERFUL people. They are pillars in the community. I'm the black sheep. There's something wrong with me. And I bought that lie for 35 years.\n\nI have found that **speaking** reality has been the best closure for me and for the situation as a whole. I'm mostly a lurker here, but, I relate to you in such a way that I can't stay silent. PLEASE tell them what their fantasy has **cost** you. Start with your wife. You can get the initial pain out on someone safe. If you tell your mom and sisters, probably nothing will change for them. They will likely cling to their paradise/fantasy. But for *you* it *will* change. It will give you a release and closure. It will let all that pain that you have buried, **out**. You don't have to do it in an angry way. You don't have to bash him... but by all means, please go ahead and do so if it will help to heal you! **Stop worrying about them and DO WHAT YOU NEED FOR YOU!** Heaven knows that they are more concerned with themselves than they are with you!\n\nI know I'm only speaking from my own experience, so you have to do what is right for you. But, I can tell you, that for me, my whole life is changing from just letting the truth out. It has given me such freedom to let it out. I am a much better parent this way. My kids know truth and reality. \n\nI am so sorry for what you are going through. *big internet hugs*\n",
            "I know it's shitty but find solace in the fact that you were the better person here. If you never went then maybe one day you may have regretted not going and been left with 'what ifs'.\n\nHopefully this will eventually serve as some kind of closure and as you said, you will never make the same mistakes he has. You can take the shitty things he has done and turn them around and learn from them for your children.\n\nYou sound like a great guy and you are better off without that negativity in your life. I wish you all the best for the future and don't beat yourself up too much OP. ",
            "If you wouldn't have gone, you would always have wondered if you should have, You would wonder if he would have apologized, or said he loved you but was fucked up or something. It is good that you went, now you know for sure he was an asshole through and through and you will have no guilt in cutting him out of your life.\n\nBTW, dont tell your mother what he said.",
            "Have you talked to your wife about this? You may want to speak with your mom/sisters as well but definitely talk with your wife about it",
            "Jesus, what a head trip. I'm sorry you have to go through that OP. No one deserves to have to live with a father like that.\n\nWhat a rotten, piece of shit human being.\n\nYou didn't cave. You just showed that you were a better person that he ever was.",
            "Wow, he's a dick. I'm so sorry. \n\nI think reforming with age is actually kind of rare. Once a dick, usually always a dick. \n\nIt has nothing to do with you as a person. You don't need to show him your life or prove yourself. ",
            "I like to think about it this way: there is a spectrum that exist in life; on one end is the world's best dad, and on the other is Joseph Stalin, and in the middle there is no one - as in,  dad left at a young age. You're place in the spectrum is not decided by you- it's just luck of the draw. You can get mad at luck, I suppose, but what you can't do is be mad at yourself. You just landed on the bad side of the spectrum, somewhere between \"no dad\" and Stalin.... That's not your fault. Don't be mad at yourself.",
            "This was hard to read. But you're here now, blazing your own trail. ",
            "Just know that you will never be like him.",
            "Well, on the off chance this doesn't go w/o saying, everyone who pushed you into going needs to know exactly what was said to include your wife. Your mom and the sisters that pushed this really don't deserve a whole lot of mercy on this and so deal with them as you see fit. \n\nI'd be careful with your wife though.",
            "You're a better man than me. I would have punched the fucker in the face, cancer patient or not. At least he's dead soon. Sorry you went through it all, mate.\n",
            "That man was never a father to you. Fuck everyone else involved for meddling and trying to make a Hollywood ending out of the situation. You did good OP, and congrats for being the better human being. ",
            "Sometimes closure is terrible. I am so sorry your piece of shit dad was even shittier in the end. Selfish of him to tell you that on his death bed when he could have kept it to himself and let you live on. However, some will argue that any truth is better than a lie. Not sure I am one of those people though. I had a similar situation meeting my grandfather on his death bed. He sexually abused me my entire life, didn't even know a time without it, until I was 14 or so and had the guts to stand up to him. I kept it a secret from his side of the family because he was actually a very powerful figure in the community and I didn't believe my family would take my word for it. Anyways, he got cancer very badly and to save face with the family I went to see him on his death bed. Privately he begged me to forgive him. I told him I would die before I forgave him and that on the other side I would still withhold my forgiveness from him. He was a monster and deserved the nasty prolonged suffering death he had been given. I think a lot of people would disagree with how I handled that but you know what, it felt great. I got the closure I needed from that moment and I believe that I am more healed than most victims of sexual assault. If your dad is still alive... and you're interested in getting the closure YOU want, what if you pop in one day and tell him exactly what you want to say then leave. Seriously... he got to say everything he wanted to say and it gutted you. Fuck him. You're the one that is going to be living for hopefully the next 60+/- years with this. Get what you need out of it even if it is just a big old \"Fuck you\". ",
            "Honestly man, fuck your Dad. If he wanted to see you one last time just to tell you that so that he could settle his emotions.... I consider that to be cruel. If he really didnt care about you he could have never seen you then died. Instead he brings you to  his death bed and then ruins all mental constructs you had. That my friend is cruelty and that man had his final laugh abusing you for one last time. What a cruel man.",
            "I'm really curious as to what your mother and family has to say. you planning on thelling them what he said?",
            "I'm late to this party but I grew up by myself well kinda after my dad just walked away, I moved from South America to the US and now he messages me asking for forgiveness. To be honest I don't hold anything against him but I never ever want to be like him, I know for a fact what you went through will make you a great father and your kids will be proud of their dad and that will be the biggest fuck you to a family that did not deserve you. I'm glad you went because now you don't have any doubts about anything. He never deserved a son, none the less someone great like you. Not showing up will be the best thing you can do to show the respect and love he deserves NONE",
            "If nothing else, take away from this that in spite of him you became a good enough person who was willing to go give him another chance. You became a better man than he will ever be.\n\n",
            "I have a mother that I hate. She was very abusive and treated her children like slaves. She also was into drugs and completely destroyed our family. My dad says i should not hate her because shes our mom, but i dont care.\n\nI try to never see her and if i do, i have nothing to say to her.\n\nShe has said nice things to me once, but why does that matter? Everything she has done has been destructive to my life. People  who hurt me consistently don't deserve my time. I dont care how nice or sweet she is for a few minutes of my life. Doesnt mean anything to me, she already influenced my life enough, i have no need for it. \n\nMy advice would have been \"dont go\" because people like that usually dont have anything good to say. And he doesnt deserve your time anyway. \n\nNow my advice would be... make him a small person, because he is small. Dont give him more time from your life by feeling negative about yourself. Youre not as screwed up despite his efforts, be proud of that! :)",
            "Has your family acknowledged your father's behaviour toward you? Have they now accepted that he was a vile human being? The one positive I hope you get out of this, beyond closure, is the understanding from relatives that you lived a trauma that they didn't. ",
            "If there is a bright side to this (and I know you don't feel like there is right now), it's that now you know that your dad was just a shitty excuse for a human being. The way he treated you--it's all on him. It wasn't anything you said or did or are. *It's not your fault.* \n\nIt's absolutely normal to need and want a parent's love and approval, and to be hurt when you don't get it. Don't beat yourself up for that. If you find that you can't stop, go get some counselling.",
            "What a piece of shit. I can't even imagine hearing that from someone, no less the person who you had to call \"dad\" (which he was in name only). If you're ever in Michigan feel free to PM me so I can buy you a beer, or 12. Good luck in the future. Be the best father in the world and be everything that he NEVER could have been.",
            "I now have PTSD- let's grab a beer and tarnish his memory... cells.",
            "I'm so sorry for your pain. My father was an alcoholic prick as well--needy and narcissistic. But I just want to add that he was dying, and in spiritual pain if not physical pain. Everything he said has to be taken with a grain of salt big enough to choke a horse.\n\nKnow that if there is any kind of spiritual afterlife, if he merits to be a part of it, he will have some kind of healing, and maybe then he will understand.\n\nIn the meantime, take the gifts you have, whether from him genetically, or your strength and sensitivity emotionally, or your empathy and kindness that I can feel in you, and cherish the ones you love with all of them.\n\nNamaste/Shalom/Salaam/Peace Be With You.",
            "It may be in the comments somewhere or maybe I skimmed over it, but if you have kids/plan to have kids, just give them the love that you looked for your whole life. That will be the ultimate vindication for that heartless SOB's actions.",
            "You will go through life knowing you made an effort. That is all you could reasonably expect of yourself.  \n\nNow, move forward with your life, choosing to be the father to your children that you know they need and want.  Shower them with affection and praise, knowing they thrive from it.\n\nDecide with integrity, and move forward.",
            "Your whole family sounds like garbage. Sorry man. Enablers tend to like to turn other into abuse victims to prove to themselves that the abuser they enable isnt doing anything wrong.\n\nI'd have a lot of harsh words for your mother and sister and cut contact.\n\nBut! You need to do what's best for you, give yourself the treatment he never did. ",
            "Hope you are OK man. People; they're a shower of bastards.",
            "I'm sorry you didn't get a father, OP <hugs> It's hard, but please know it's nothing to do with you - it's his flaw as a human being.  He missed out on SO much, SO many things that you will get to do with your kids, and your grandkids.  He wasn't capable of having a full life. I'm so sorry that it means that you didn't get those things as a kid, either. But you'll have them as an adult <all the hugs>",
            "I had a shit father too. \n\nHe died when I was 16 and I didn't care. \n\nA couple years later I had a dream that he called me and his voice was still in my head. \n\nI can't say I want him in Hell, but God knows he doesn't deserve heaven. \n\nHe's been a lesson in forgiveness ",
            "Talk to your mom about it, unfortunately she is complicit in the situation, not unlike the mother who knows her child's father abuses him but does nothing  to defend the child. ",
            "I thought my dad was a shithead but yours takes the cake",
            "Hey OP, first of all I'm sorry that this went down the way it did. As an outsider that has seen almost this exact situation before from someone that I cared about and their parent(s) there is something to take away from this. I know you just opened up some wounds that you were trying to let heal but they're raw and I know hurt real bad right now it will get better over time with the love and support of your wife if it doesn't feel like anything is changing then I'd suggest looking to speak with a therapist so it doesn't lash out in other aspects of your life, there is one thing that I think is a positive and it helped the person that I went through this with in the past. Your Father (which you loved) gave you a blueprint of what a bad parent looks like and although you paid a great personal price for it (you did absolutely nothing wrong & this next part is for your children or if you don't have any your nieces & nephews) you can be a wonderful parent to your child(ren), you have a solid foundation of advanced knowledge & real examples of how crushing the disinterest or neglect of a parent can have an impact in your emotional development as well as adulthood. You paid a high price but you do have a cheat-sheet that you can refer back to an hopefully use your best judgment to handle certain situations while it won't make you a perfect parent or person you have the insight on how to ensure that you express your love and feelings towards those who you choose to care for. You do have people on this planet that love you, you mention that your wife also put urged you to go surround yourself with those who love and appreciate you being in their lives and make sure that they know they mean something to you I know you're angry at her for pushing you to go but she did this with hope that something good & positive would happen for you because we do that for those we love ( we all want those we love to have \"happy ever afters\"). I don't know your relationships you have with your mother & siblings, but you do if they're part of that circle that you care for and vise versa then it may take time but heal that relationship with you how you best think it should go I'm sure they all had your best intentions this one I'll leave you to sort through. I did my best to explain how I went through a situation eerily similar to your and I just want to leave you with a last quote do with it what you want: The best feeling in the world is watching things fall into place after watching them fall apart for so long. Good luck and it will get better.",
            "This is what happens when you have no spine. Now you can carry that weight and they can promenade through the dandelions with their closure. Seems like your family don't give a fuck about you and your feelings about the matter, as long as they got theirs.",
            "When it comes to think like this, it's sometimes better to just follow your heart, you didn't want to see him, others pressured you despite them not having a clue what it's like to be you, it went bad. I wouldn't be surprised and I would be more smug about my premonition from that moment on and it would take me a while to let it go.",
            "You are free. Enjoy the rest of your long and happy life.",
            "When someone asks why you don't speak about your father.....\n\nNow you won't have to answer to anyone.",
            "Hey man-\n\nYou're a good person for doing what you did.  I have a dysfunctional relationship with my own father (though I don't suspect our issues are similar to your own issues), and I'm the sort of sap who will always give my dad a chance even though it always ends the same way (badly).\n\nI'm sorry that you had to learn this stuff; on the one hand you could have gone through life always wondering and on the other hand, now you know.  \n\nIn the end all I do is promise myself that I'll be the sort of father to my own son that my dad wasn't to me, and I think that's all people like us can do.\n\nTake care.",
            "Well, I hope he dies soon.  Fuck that.",
            "My father died due to a stroke while I was 11. He was one my few friends. He was very supportive on my desires and ambitions, teacher a lot of nice things to me, introduced me to some good literature. I could have been his only true friend. He told me that in his childhood he was pretty lonely, he hadn't had any friends. A lot of times he had to fight someone due to bullying. He was good at fighting and this combined with his mental abilities made him very well respected. But he didn't value this respect. When I learned about it I was surprised, I had very similar background. I guess I was the friend he always wanted, and he was the father which he never had. And now he is suddenly dead, while I am discussing Lermontov with my uncle. Fuck. And now I live with my stupid mother. She isn't that bad, but she is not engaged with me. She shows zero love, but also doesn't show any hate. She is more a woman, which would feed me, give some presents every once in a while and forget about me.",
            "I seriously hope that you find relief in this because it's finally over, if not now, someday. ",
            "Wouldn't you feel worse if he was super sorry and lamenting on  how he wished he had more time to spend with you to do all the father son things you missed out on, then promptly died? I mean, talk about the bad cases of the \"what ifs\"...",
            "I feel bad for the dad here. He was completely apathetic towards a person who wanted something he'd never be. It's hard to side with the dad though, because he belittled OP or whatever. Could just be the dad speaking sincerely and not being as supportive as he could have been.\n\nIt's a shitty situation to be in, and a good reason why people who don't want kids shouldn't be forced to have them. Look how miserable OP is, no one should feel like that.\n",
            "My mother hated me for most of my life. The last few years before she died she tried to fix things but I think that was just because she knew the end was coming and began to fear the possibility of afterlife. I am so sorry. I know there's nothing that can fix the whole that a hateful parent leaves in you. I used to go to my friends houses as a kid and look at their family pictures on their walls and my heart would just ache because I kept wondering why my family couldn't be like that, why they couldn't love me. If you need anyone to talk to feel free to PM me.",
            "Get your revenge, live a good life, have some kids and shower them with the love you never had.",
            "Did you tell your mother, sister, or wife he said that?",
            "I'm sorry for how everything turned out. I know it's not what you wanted to hear. It's not what anyone wants to hear. But it does explain your childhood. He really just never got attached and instead of being decent he chose to be an asshole to you.\n\nMy dad is the same way. He and I have never connected or bonded but it wasn't because of a lack of trying on my part. He just never cared. He's also an abusive alcoholic though so over time I've stopped caring and trying as well. He ruined my childhood and adolescence but now that I'm an adult I don't care to have a relationship with him. We never had one and he was never there for me. I can't wait to go no contact.\n\nAnd as bad as it sounds, I'm afraid that I'll be relieved when my dad dies. Because I can't deal with the abuse anymore and I don't want my family to either. I just want us to be free.",
            "dude, you are so not alone. I'm also 31, my father also treated me like shit and beat the shit out of me (my whole life until I was about 15 and punched him back, he never hit me again). we don't talk or see eachother but I heard from my brother in law that he said he \"was ashamed of his sons(brother and I) and never wanted one).\nfuck them dude. don't need him. just be a better dad to your future kids if you ever have them. \nI only feel bad cause I'm not going to care when he dies.",
            "I just do not understand how someone can father a child and not love it..... ",
            "I'm sorry that this man was not the father he should have been or the one that you deserved. My own father was just as disinterested.\n\nThere is maybe one small shred of comfort you can take from his horrible words. His inability to be a good dad was nothing to do with you. There was clearly nothing you could have done to make him the father he should have been to you. You didn't do anything wrong to make him the way he was. It was all his fault, his failure, his brokenness. Not yours. It wasn't your fault.",
            "Good riddance! Dude what an inconsiderate person. At least he's a cornerstone to know what you NOT to be like. I'm sorry you were not loved by your father, but hopefully you can be a father that is Opposite of your own and create positive memories for your possible future offspring",
            "I am very sorry for the pain you feel. I can empathize with you because I have walked in your shoes. I also went to see my abusive father on his death bed because my brother, husband, boss, friends, and various other people said it was the right thing to do. And that I should be the better person and forgive. Guess what?  My dad was unrepentant. Blamed others for his actions. And then pulled through and lived another ten years. \n\nSo yeah. I feel your pain. \n\nTell/inform your wife, family, friends, and everyone else that their concerns should be for the victim and not for the bully. \n\nIt's not the job of the victim to make peace with the bully. \n\nIt's the bully's responsibility to make amends with the victim in a manner that does not further victimize the victim. \n\nGood luck. Peace be with you. ",
            "It's really important to know that all this says about you is that this revelation says everything about him and absolutely nothing about you, except that you didn't do anything to deserve that kind of treatment. \n\nOP, my heart absolutely breaks for you. You deserved a better man than that for a father and I am SO sorry that is what life gave you. \n\nI really hope that you will seek some kind of support and/or counseling to get through this. No one should have to go through something like this alone. I'm so sorry.",
            "I've been in the same situation. My neighbor at the time gave me the best advice. Take a night and think about both sides. If you, deeply down are OK with having things end the way they are you made the right decision. ",
            "I sympathize, I have a similar relationship with my father.  I think the important thing is to get what you need out of this.  I mean if you were a real jerk you could have spit on him or something but it seems like you're a good chap.  All the bad stuff he did isn't really going to go away, but if you can remember to not do them, it should make you a better person.",
            "You will get over this. It's still too raw for you right not. But I'd recommend seeing a therapist to help you sort through these feelings at some time in the near future. That way you don't internalize any of these negative thoughts. No individual should be expected to navigate such a horrible situation alone. Parents are \"supposed to\" love their children; you just got confirmation that this is not true. It hurts. It sucks. But please reach out for some help. ",
            "You were courageous enough to give love, or something like it, one more chance. You are a good man.",
            "[deleted]",
            "Nothing about that relationship was ever your fault. There was not a single thing you could do. It sucked, but now you know it wasn't you.\n\nAnd you *will* be a better father. You can't choose your family, but you can choose how you act. You're already sacrificing for your family, walking into a situation you knew would be painful and awful for the sake of your sisters and mother. You've got everything you need to be a damn decent human being.\n\nJust remember. As awful as your father was, **he didn't break you**. You were stronger, you can be the person *you* want to be, and you can spread love and support and goodness in the world despite his bullshit.",
            "One of the things my uncle did to his father (my father had already confronted him previously over the past) was whisper in his ear something regarding taking 'good care' of his truck (fill in favorite possession).  Made those final moments a little less peaceful for the old bastard.",
            "I'm sorry. I had the same type of \"relationship\" with my father. He never wanted a daughter. He had no use for women except for sex sand since I couldn't give him that I was completely useless in his eyes. The drinking made his tolerance of my existence slip and I knew how he felt for years despite the fact that he never came out and said it to me. \n\nI thought that i would feel guilty for not seeing him before he died. I thought that i needed closure or something. I never did go see him in the hospital before he died and three years later I still don't regret not going. \n\nI'm sorry that your father was such an asshole and I'm sorry for what he has put you through. But at least you have made something of yourself and have been able to be a man despite him and his mental, physical and emotional abuse. It takes a lot to be better than what you're taught to be. Just keep doing what you feel is right and be the kind of man he never could be. ",
            "I was one of the ones(maybe the only one) heavily advocating for you to go see him.  I'm glad you did.  This hurts more now, but it will be better later, because now you will have understanding.\n\nOnce you get past the initial pain, and the booze, you can purge yourself of him forever.\n\nJust don't let it taint the rest of your life.  \n\nDon't become bitter, become better.",
            ">Be the father he never was.\n\nYou dam well can be. I learned a lot from my father. How to not be. Be the break in the family line to be the better man. You can do it!",
            "A strength of a man lies from within and can be drawn upon without shackles of dependence tying us to those around us. We dont need validation of our existence from our fathers. Perhaps developmentally we crave it, yearn for it as children, but becoming a man allows us to look at life and the world objectively without fear or frailty. \n\nIf you can set your own personal hurt aside - view your father's opinion of you from his circumstance. He just was never interested. its neither right nor wrong, that is just how it is. It shouldnt make you feel any better or worse, but that viewpoint might help you deal with that raw emotion without having to feel a slave to it.\n\n",
            "If your mother and sisters were giving you hell to go see this vile person, you might want to consider cutting back your relationship with them.  \n\nI'm sorry your visit sucked.  ",
            "I don't buy it. Your fathers last words to you are \"I never wanted a son?\" Nope. \n\nThis is fake.",
            "God, so horrible, I'm so sorry.  Just always remember that some people are just awful and should never be parents.  If there was even one shred of decency in him he would never have said those things to you, even if he always felt that way.  You are a better person and at the very least this horrible legacy can stop with you.  ",
            "*hugs*",
            "Man, this sucks. I'm so sorry it happened like this, OP. One thing occurs to me that I haven't seen anyone else mention so far ... Hearing how he really felt could free you in a lot of ways. He mentioned that you were always trying to get his approval as you were growing up. Having not gotten it, most kids will just keep at it, try harder, believe it's something within themselves that's somehow inadequate, causing the parent's indifference (many, sadly, begin acting out - pissed at the world for how shitty their parent(s) made them feel). I bet you beat yourself up about that a lot. \n\nAs hard as it had to hurt to have heard what you did from the bastard, in hearing it you now know for sure that IT WASN'T YOUR FAULT. There was nothing you could have done or not done to have won his favor. He didn't feel the way he did because you weren't good enough. He felt the way he did simply because you were born male,something over which you had zero control. You were plenty good enough (as the awesome life you've built now attests); he's the prick. 'Course someone could have suggested this sooner, so that you didn't have to spin your wheels for so long trying to get the man to love you ... I'd be wicked pissed about that too.\n\ntl;dr - His revelation absolves you of any perceived inadequacies you may have felt because of his indifference over the years.",
            "I'm so sorry. As the only daughter of a mother who only wanted boys, I understand some of what you went through. \nWhat you know for certain now is that it wasn't you.  It was never about you. You were never to blame and you didn't do anything wrong. You got a shit deal, and your anger is totally justified.",
            "this will probably get buried, but back in the day i had a friend who left his country to see his abusive dad on his deathbed, but apparently he didn't get much out of it. he said nothing had changed and that he kinda wished he hadn't wasted the trip. \n\ni'm sure it varies a lot from person to person and parent to parent though. ",
            "How did you not spit in his shitty dying face?",
            "I'd have put a pillow over his face and witness his last breath.",
            "I am so, so sorry OP. Sending thoughts and prayers your way.",
            "I'm so sorry for all of this. Don't give this person one more moment of power over your emotions. He doesn't get to define who you are or decide if you are lovable. All of his shittiness is about him and now you can move on and try to put it behind you. Try not to be pissed or hurt, just be relieved that he's finally done hurting you. A little man like that shouldn't be given the power of affecting your life in any way. (I'm sure your family was hoping it would be more positive closure for you both.)",
            "We don't get to opt into the the family we are born into. That's why spouses and friends are so important. They're the family we pick.\n\nI'm so sorry this happened. Screw your father, you deserve better and he should have taken that kind of shit to the grave with him. He could have lied and pretended or something if he was even a halfway decent person.\n\nAs someone who has cut ties with family members, I am so sorry. I will likely be faced with this situation someday. It's an impossible decision. Do you forgive and let the person die in peace? Do you stand by your beliefs? Do you go and let them dump on you?\n\nI know it's easier said than done, but don't let this bug you. It was always the case that he didn't shit, now it's just known to you as well. Go hug and appreciate the family you chose and don't give him another minute of your time.",
            "I know this is going to sound strange but reach out to your family. Your not going to be There for anything else and for that I fully understand he earned that but unless you let your family know that you tried and there is a reason for it. I wouldn't want your family to think that you acted callously for no reason and telling them now is a hard sell maybe inform them that you'll not be attending anything else concerning him. Let them know you understand that it seems like odd behavior and if one say they are ready to hear what was said in that room then you'll be willing to sit down and tell them in person but nows not the time.  You don't owe him anything but I get the feeling the rest of your family cared about you a lot and I'm more than sure your mom knows something was always off which may be why she pushed so hard for the meeting not understanding how deep it was. Good luck man if you want to talk I'll be around we can just be about random stuff if you need too. Pm me on redditif you need .",
            "Jesus. You should have recorded the whole damn thing and shattered your  mom/sisters/wife's whole fucking perspective on him.\n\nOP, I want to wish you the best possible luck in everything you do. I know that you said that it would be the last time you ever spoke to him, but if the thought ever strikes you as feasible, go back to that piece of shit and record him saying everything you said he said. If you have the cold hard audio, nobody in your family can ever have any illusion as to how entirely pathetic your Biological other is. \n\nPlay it on a goddamned loudspeaker at his funeral. If he's going to be remembered he deserves to be remembered the way he really was.\n\nGod fucking damn fuck that guy. ",
            "Man I can't even imagine how it feels to hear that.\n\nOne part of finding closure is to accept you might wanted him to love you. Your anger is understandable and let it vent for a while. But you are in no way a loser. You tried, you were there. Be proud of that fact and try to learn from the experience. It is in our wounds where we find gold. If you truly do not want to visit his funeral or grave so be it. It is about how you feel and you need to find closure. \n\nIf you are further, try to understand him (without necessarily agreeing with what he did). This might help as well.\n\nYou are a great person and do not think that crying as a 31 year old is bad or anything. Let it go and be yourself. Hope you can find the strength to move on. Not in a dysfunctional angry way, but in a mature way with an emphasis on acceptance and healing. ",
            "Don't be hastey, you can always visit his grave any time you need to evacuate your bowels or bladder.",
            "I'm sorry this happened to you. I hope your mother was \"happy\" - you knowingly took on the emotional burden for her. Don't let her forget that when she comes running to you about his funeral. Once is enough. \n\nI feel like this thread needs to be stickied as a cautionary tale for those thinking of death bed reconciliations. ",
            "Go to his funeral, get up near the end, tell this story. Everyone there should know what kind of man he really was. ",
            "I can relate to you, man. Stay strong.",
            "Sigh... I'm so sorry it played out this way. Someone said it: you had a feeling it would and that's why you were resistant. Makes all the sense. \n\nSpeaking as a wife, I am pretty sure I'd have encouraged you too if you were my husband. This is because, in spite of my general contempt for most of humanity, I am a bit of an optimist that wants to believe people can change. I believe in deathbed epiphanies. I sat by my own father's deathbed and hoped before he slipped into the coma, that he'd say something to me to make me feel like I was on the top of his radar. At the end, when he started not to recognize people (as the brain shuts down a day or so before death), he looked right through me but somehow snapped into reality when some friends came over. I hoped against hope, but I didn't get it. I don't hold this against him, to watch someone die is to surrender all control - but not hope.\n\nThe people who encouraged you to see him held out hope for you when you weren't willing to admit to having it yourself. They (would, if they know how it went) regret sending you, but they would wonder if you'd have always missed out on it if you didn't and he wanted to give you kindness before he went. They chose hope and love, and they chose poorly.\n\nBut this is your dad being a shit, not them. It's understandable to be angry at them for encouraging you, but they didn't know it would go that way and they hoped it would not. Forgive them first, then forgive yourself. If you can eventually forgive your father and let it all go, you'll be better for it. But you are standing on the precipice of anger and bitterness until the day you die or forgiveness and moving forward, being as you said, the better man than he ever was. ",
            "Please do not keep giving that man power.\n\nHe is just a man. Find a way to let go of the attachment that you have to him. Find a way to look at him so that his approval and his words have no value to you anymore.\n\nWhere you came from as a seed doesn't really matter. Plants have seeds that they just throw around and they either replicate or not... it is about keeping the species alive.. Animals, including humans, are not much different. Many of us just do it for fun and sometimes we replicate.. it happens.\n\nWhile it is magical when a strong family bond is created, it really doesn't happen the way, well I was going to say the way it is in fairy tales but even fairy tales show horrible families.. and some great kid emerging from a horrible family and making him/herself into something special.\n\nThis is what you did. You took yourself out of the situation and made yourself into who you wanted to be.\n\nI belief it is because of who you are inside, that great person, that you wanted to make your family feel better.. and you had hope... but a renewed hope for something you had long buried. Do not give credit to his words by trying to drink them, and actually yourself, away. There is nothing wrong with you.. the problem is him and once you see, once again, that he was unable to rise to the expectations and that he was broken, you realize that a broken man doesn't spit out words of wisdom... They are just gibberish, or should be, to your brain...\n\nTLDR: You already had what you needed. Throw that new information out because it is flawed and doesn't belong in your life equation.",
            "Sorry, OP. People stay who they are even when they're dying.",
            "Jesus Christ, what kind of person could be like that? How could you completely disregard your own child because you just didn't want a son? How could you just not feel anything? ",
            "Wow!  Sorry to hear that.  As someone that would have advised you to see him just to get closure I was wrong.\n\nThe only upside I can see - and I'm really reaching here - is that if you had chosen not to see him you may have always wondered if you missed an opportunity to bury the hatchet.",
            "Your mom and your sisters need to know exactly what he said.  They need to know why you will not speak of him or be at the funeral.  They did not understand what he had put you through, and will never until you tell him his exact words.  If you can't face them, then a letter would be more acceptable.",
            "I hope that you can get your mom and sisters to understand, at least someday. I'm so sorry that happened, man! did your mom/sisters hear any of this exchange? \n\nwhen you're ready, may I humbly suggest that you perhaps seek counseling from a professional therapist? I know from personal experience that talking to someone **with training** saved my own life, and the shit I went thru seems to pale in comparison to the nuclear bomb you just received. \n\ntake care of yourself man. ",
            "Last words of my father to me. \"I never wanted kids\". Suppose it could've been worse, but it wasn't good either.",
            "When I was told that my father was dead, I did not even blink. Just said OK, and kept doing whatever the heck I was doing at that moment. My aunt (his sister) gave me some shit because I refused to go to the funeral, and I just stopped talking with her. I was not abused, but my father was an alcoholic that made my life a hell... good luck!",
            "What a fucking dirt bag. What kind of a dad would not want a son?? That is your family name right there. Not to belittle daughters but still.",
            "Are you going to tell your mom and sisters what he said? Would they believe you?",
            "Here is a story I think you would appreciate OP. My father was horribly abused by his mother and step-father. He was almost murdered by his mother at 12 and ran away from home. I cannot imagine this 12 year-old crying and running 5 miles to get to his grandmother's house. My dad continued to work hard and go to college. Eventually he made his way to the USA. He never knew if he wanted children to love because he had no idea how to show affection towards a child. But he has been, by far, the most loving father I could have ever asked for. He has always been there for me and has told me since I was a child that he did not know how to be a good father because he had never seen that before in his life. My mother helped him along the way and he did the best he could and it was truly the best. When he messed up, he apologized, when he did good we told him so he would keep it up. \n\nMy father did eventually meet his biological father before he went to college and he thought that he would find a great man. What he found was some asshole drunk that had maybe 10 different children with 10 different women. He was not this pinnacle of masculinity nor this savior for his sad childhood. He was nothing. My father told me he accepted this and moved on with his life. The best revenge he got was that all his children are incredibly successful, never been addicted to anything. I just dropped off my sister to take the bar exam. I am getting my master's. My other sisters are going to excellent colleges. He has a successful business and this August, he will have been married to my mother for 30 years. He reminds me so much of your story you just presented here. There is a light at the end of the tunnel. It looks bleak, but you cannot let your life be dictated by your father.\n\nYou cannot change anything you have done, it is done. What you can do for your future is entirely up to you. You have the power now and that man cannot control you anymore. I wish you the best of luck and I hope that you can find some peace in your future. Good luck and I hope you start feeling better soon.",
            "Well fuck him. A father who doesn't love his son is no father at all. ",
            "I am sorry you went thru this. It hurts real bad now but at least you know now. \n\nNow you can heal. ",
            "I'm on my wife's user name readin this and seeing the same thing I got from my pops. Fuck him. Use that anger as fuel. Feed that hatred to forge your life even stronger. Tell everyone, anyone who would listen to how shitty that motherfucker was. Tell your son/daughter see look, look how fucked up my dad was and how much I care for you. I swear you will get past this hunk o shit in your road just remember one thing. He, him and only him made this choice. So fuck him your better off without him. Never keep these type of feelings bottled up. Only makes  it worse. I hope you get on with it and if you want to talk more about fucked up fathers I'm right here boss. ",
            "Most men  have 2 chances at a good father-son relationship. He fucked up the first one, if you have the chance don't you fuck up the second.",
            "Right now you already know that parents are people, just like us. They make mistakes, they can be dumb, and assholes. \n\nFuck him. You are not doing things for him, but for yourself. He didn't want you? Well, but because of him you are here, and can be better.\n\nJust one advice: go to his funeral. Not for him. Not for you. But for your mom. She loves you. She loved him. And it will be a time where she will be forever grateful you are there, for her. \n\nAnd well, be better than him. In every way you can.",
            "My dad was the same way,  never gave me anything except words of discouragement, he never cared about me and I never accepted anything he did ever tried to give me,  made my own way without him in my life and never looked back when I ex communicated him, You sound like a bitch who couldn't cope without Daddy's love and affection when in truth it probably made you a better man cause you learned the hard way that no one cares about you or your shit,  not even your own father and as long as you realize that in the back of your mind you will work harder for everything and give even more into everything cause you will learn to do it for yourself and to stop looking for approval in others.",
            "It's hard to believe someone could be this cold for a last conversation. Even if I disliked my son, *no*, even if I *hated* my son, if I were in his situation I wouldn't ruin my kids life because of my own selfishness. Mind you, I'm a hateful and cynical person with little to no empathy, but at the very least I'd be able to tell my kid I loved them, lie or not just before I died.",
            "Sad story, but you're a man now. Time to live like the man YOU want to be and do what YOU know is right. Time to move on, you got shit to do.",
            "The only thing that you are sure to leave behind is the perspective you leave with people.  He left a shitty one and will be remembered as such.  He does get the award in my book for being the worlds most genuine asshole.  I will not forget this post.  Thanks....uh...I guess.  I hope the perspective you leave on the people you love is the exact opposite of this.  ",
            "I'm sorry dude :(",
            "Yeah man, fuck all that.  Sorry I couldn't get here sooner to talk you out of it.  My parents didn't love me either.  I owe them nothing.  It's much stronger to move on from a bad place and tell those who try to drag you back to fuck off than it is to \"people please\" because of some guilt.",
            "I'm sorry if you felt pressured by your wife and other family members. I'm also sorry that another human being whom you cared for treated you like shit especially a parent. My father is an abuser too and I don't have any plans to see him ever. I have no interest in attending his funeral when that time comes. My condolences to you OP.",
            "I'm not trying to compare my life to yours.  Just trying to let you know that there are some of us out there that might understand your pain.\n\nMy Mom never wanted to have children. I used to ask her once in a while why we never had a normal home life. She would always just say, it was water under the bridge and forget about it. When I was about 40 or 45 she finally told me why she was the way she was. Bottom line after talking about how much she hated living with my Grandmother and how she got married to get out of the house and that she never wanted to get pregnant, she finished with this sentence. \"As far as I was concerned, you and your sister were a curse from God\".\n\nSo my Mom did not want me.  At least she gave me a great example of how not to treat my children.  I never went out of my way to have children but after we had them I told them every chance I got that I loved them.  When I got divorced and remarried, I tried to make sure my step kids felt loved and cared for, just as much as my biological children.\n\nDon't let this man have so much power over you.  The fact that he felt the need to at least pretend that he cared for your mother's sake, means that your Mother cares for you.  If your Wife, Sister and Mother love you, you are way a head of the game.  \n\nDon't let this man have any control at all of what you are or what you become.  Let every last bit of him die when his body dies, by showing a lot of love in your life for those around you.  \n\nDon't make it obvious to others what you are doing but if you go to the funeral, quietly and respectfully celebrate his death.  Use it as a full stop or period in your life's story.  Take a long look at his dead and lifeless body and say to yourself, at this moment in my life this man and his hate/indifference ceases to exist.  I am free.",
            "Fuck him, go on with your life and treat others better than he would have. Life will go on.",
            "Sad to read this but the takeaway from this would be the EXACT OPPOSITE of your dad to your children.",
            "I'm thinking you missed the chance to tell him he was a shitty father and that he taught you to never be like him.",
            "All you can do is give your children the love that you wished you had from your father. ",
            "You were fucking brave and im proud of you. ",
            "\"I will do everything I can to be the father he never was.\"\n\nThat's the spirit man. Don't let that shit negatively effect your relationships w other people. Break the cycle. ",
            "My parents got married because my dad accidentally knocked my mom up with me. He always resented me for that. He was mentally, emotionally, and at least once a week physically abusive. Anything i did would set him off, didn't matter that it could be the exact same thing a sibling would do, because it was me i got beat for it. If he wasn't upset with me, he would ignore me. If i needed something i would ask a brother to get dad's attention. I could sit there going ,\"dad, dad, dad...\" and get no response. The first time one of the other kids asked, \"dad\" he would respond immediately. One of the best things i ever did was pretend he was dead. I socially excelled after that, became a god damn social butterfly. It wasn't until my parents got a divorce a year or two after i moved out that i found out the real reason they got married. Good Christian folk need to get married if they get pregnant right? It kind of all made sense. He resented me for taking his life and freedom away. I think it was a shitty thing to do, but ive come to terms with it. I'll never accept taking his frustrations with his own bad decisions out on a helpless child, but understanding why the resentment existed has given me closure. I know i'm rambling but i don't really talk about it much. All you can do is be the man your father refused to be, be the husband and father your old man was too morally weak and emotionally unstable to be. Break the cycle before it begins.",
            "Hi OP. I'm really sorry it went down like that. If you haven't already, I would check out /r/raisedbynarcissists. I would also encourage you to cross post there. Just know that you are not alone. There is even a term for your mother and sisters- they are flying monkeys. Go check it out and get some support from people who understand. ",
            "Damn.  You should have recorded the conversation and played it at his funeral.  Show everyone what a total piece of shit that guy was.",
            "Thanks for going.\n\nMy father and I are estranged going on six... seven years? since we last spoke. This will help me tell people to fuck off in the future if a similar situation occurs.",
            "I can picture OP in the future with inattentive old men: You know, you remind me of my father. *pull out switch blade* I HATED my father. \n\nSeriously though, if you are ever a dad, you know what not to do. For what you have done and gone through, mad respect, because i couldnt have behaved as well as you have.",
            "I always say that you can use your parents as an example of what TO DO, or what NOT TO DO. Luckily for me it was the former. Many of my friends its the latter. Good luck and thanks for sharing. ",
            "My mother went through this same dilemma with her father recently and she asked me for advice. \n\nI thought about it for a while, and what I told her is that this is the last opportunity she will have to say what she wants to him. whether it is good or bad, you won't want to go your entire life without saying what you wanted when you could.\n\nShe ended up spending time with him for the last 3 weeks he was alive. And she thanked me for the advice. No regrets!",
            "I hope you at least tell your mother and sisters exactly what he said. ",
            "Hey man, I cannot imagine what you would have been through to get any positive reaction from your father, or how it made you feel. Somewhat similarly, my mother does not talk to me much. I have another perspective for you\n\n* Know that feeling of worthlessness? You finally know that whatever *any* son would have done, such a father would not appreciate him.\n* He never showed any pride in you, but now you know that it is not your inadequacy, your achievements meant as much to him as that to a stranger.\n* Any personal reason for not caring you would have made the matter emotional. Now you know had it been any other male, he would have been treated similarly.\n* Your success comes partly from a need to demonstrate your worth, which I suppose originates from your father's lack of acknowledgement. In a twisted way, had your father treated you right, you might not have been as successful as now.\n\nEdit: Formatting",
            "Good for you man! Been there all you can do is get over it! Good luck!",
            "Good Christ, who could say this to anyone, let alone their own child. Don't consider this man your father. He is simply your mother's sperm donor for you. ",
            "I have a son, and maybe you have one or will have one one day, there is no way you will not love him.  It's impossible.  \n\nI find a lot of babyboomers are broken like that.  That's how my mother is, she never gave a shit about us and doesn't about my kids or my sisters'.  That's just the way they are.  Broken people. \n\nI'm generalizing about babyboomers but that's a trait I see in a lot of my friends parents.  They simply don't care. ",
            "I just wanted to say that there's nothing wrong with you that make you unloveable by your father. His inability to love or even slightly care about you is 100% on him, and that you did nothing wrong do deserve his lack of love. Hugs. \n\nMy mom is similar to your dad in that I think she never wanted a daughter and resents me to some degree, but she's conflicted by it. ",
            "You did the right thing brother. I promise your mom and sisters are happier having you speak to your dad on his death bed. It's unfortunate that your dad is the way he is but you have to realize none of that is your fault. From the sounds of it, your dad is a very sad, broken man, with bad coping mechanisms, instead of manning up and admitting his faults he instead made you sad so you could take on all his emotions. You manned up and did what your family needed you to do. Hold your head up man. A lot of us have shit fathers. Just make it a point not to be one yourself and if you do have boys yourself you'll see all that your father missed out on and you'll feel sorry for him. ",
            "Fuck him dude. You know this has nothing to you. He never wanted a SON. This is his own personal shit with the male gender. Which is why he also treated your uncle like shit. You are a good person. You are an obviously caring person who seems intelligent ad successful. I am sorry that your father could not allow himself to see that. He missed out. He wasted his life by not knowing you. That's a damn shame for HIM. You have your whole life ahead of you. YOU can be a different father, a different man. I don't blame you for not wanting to go to his funeral. Don't go. Get drunk. That's what I'd do. And then wake up the next day and carry on. Don't give him another thought. Focus on the positives and enjoy life. ",
            "You are absolutely better for knowing. If you had the opposite happen you would beg for answers eventually, everyone does.",
            "You will be angry and bitter your whole life towards you father, and your family, if this isn't fixed. I know it may not be easy right now, but at some point you need to forgive them.\n\nForgiveness sets you free. \n\n",
            "\" I will do everything I can to be the father he never was.\"  This is the most important lesson to learn from him, and it's priceless.",
            "Your father sounds like the tearful ending of a movie gone horribly, horribly wrong. Where you would expect a heartfelt apology for not \"being there\" for you as a kid and a final penance, he just literally looked at you and was like \"nah, I never gave a shit about you\". That is beyond fucked up. Sorry your dad was a such a shit.",
            "hey man, now you have no regrets. you have all the information, and you made your family and wife happy by visiting him. you strengthened your relationships with others while you buried the hatchet with one you didn't care for either. you were the bigger man by coming to see him and it took more guts to do that than shy away, never really knowing. you're a badass and you did the right thing dude! now live a happy life without someone in the back of your mind bringing you down. you know he just didn't 'care'. that means the harsh things he said to you were just to push you away and you never have to take any of that personally anymore because obviously he was extremely biased towards you. good luck dude! B)",
            "You are truly a self-made man.\n\nAnd your father was a horrible, self-hating human being. And kind of bizarre.\n\nIf anybody can move on from this, you can. You need to work on standing up to your mom and sisters though. They're not children.\n",
            "drink 100oz of water and wait....and then find his grave and take a giant piss right on it",
            "What you did was very brave. I only have a few select words for your father, however. I cut my mom out of my life 5 years ago, and I dread the day when I may have to do something very similar. Wondering how she feels about our relationship is probably the hardest part. Does she feel any regret? Does she hate me? You got your answer, and now all you can do is digest it and move forward. Take your time, and get some space, but don't be afraid to ask for help. \n\nI don't know how similar our situations are or if this will help, but a coping mechanism that I've developed is to behave in a way that I know is opposite of her nature. **\"Generosity in the face of greed, kindness and compassion in the face of anger, virtue in the face of vice\"**. I always fear that I will inherit her abusive nature. Instead of being angry about how I was treated, I try learn from her mistakes. \n\nBest of luck to you. It sounds like you are well on your way to healing properly. ",
            "I had the same kind of upbringing. My father tolerated me. Almost beat me to death when I was 16 and I didn't talk to him for 5 years after that. He got sick and my family wanted me to talk to him so I did. Circumstances are different and outcome was different but there is some overlap between our stories.  That is not the point I want to make. The point I want to make is that this rejection by our fathers eats away at us. Rejection leads to anger, anger leads to coping (violence, addiction), this leads to shame, shame leads to guilt, and it happens over and over again. It affects us all differently, but that is my story. I would suggest seeing a professional about your feelings, as you mentioned. It is hard work, but I believe worth it. And things might get worse before getting better. But I think it's important to address this rejection to start healing. You got an unfair shake and I'm sorry for that. Good luck sir.",
            "this just sucks and I am giving you all the internet hugs you want. \n\nI read this this morning and was thinking about it on and off during the day, it occurs to me that the fact that you father's 'issue' was that he never wanted a son, could (in time ) give you some comfort. In a really fucked up way, it wasn't personal, it wasn't like he saw you and took an immediate dislike to you, it was simply that long before you were on this planet, for whatever reason, he decided that sons weren't for him. \n\nI hope you find some peace with it all and don't beat yourself up about going to see him, we all want approval and acceptance from our parents, it is as natural as breathing. Some of us just learn that there is none to be had-doesn't mean we don't want it though. ",
            "Should've taken [my advice](https://www.reddit.com/r/relationships/comments/3cf4yn/my_31m_father_67m_is_now_on_his_deathbed_he/csv14y6).\n\nIn all seriousness, though. Don't sever ties with the rest of your family. Open their eyes up to what a piece of shit he was. Tell them exactly what you've told all of us. Don't ever speak his name, other than to ensure that his sole legacy left on this Earth is that of a complete piece of shit - precisely what he was. That you've managed to carve out a nice life for yourself despite him is rather impressive. You win!\n\nGood riddance. Let me know where he's buried - Should I ever find myself in that part of the world, I'll shit on his grave for you.",
            "I'm so sorry. ",
            "I think the best you can do is let this define you as a person. Love your children like you weren't. Cry about it, a lot, and heal. Sadly, some of us must learn what not to be from our parents.",
            "You deserved better. You still do. (((hugs)))",
            "Go, and tell him how you're happy that he's dying and you wish him a horrible death.",
            "I'm so sorry you went through that.  /hugs",
            "If I were in your shoes, I would go to the hospital every fucking day. Then the bastard could spend the last days of his miserable life with me, someone he doesn't love. ",
            "Holy fuck.\n\nJust...wow. Best of luck to you.",
            "he didnt even apologize wow\n\nim kind of in the same boat as u. have/had an abusive father. my family still wants to keep in contact with him because he somehow manages to make them believe he changed several times ? im having none of it, idc if he even wants to talk to me to apologize. so many years of lying i wouldnt even be able to tell if he was being honest.\n\ntheres a difference between forgiving and forgetting. u can forgive him for ur own sake but under no circumstances do u have to forget wat he has done. that would just be putting urself back in a vulnerable state where u can be taken advantage of",
            "Sorry man.  I had to give up on my parents.  I'm still not sure I'll even be made aware of their deaths, when it happens.\n\nYou made it.  You've learned to never treat anyone like that, because you lived it.   Keep it up. That asshole is 6 feet under and can't hurt you anymore. Hug the people you DO love, and tell them. ",
            "read \"The Stone Angel\" by Margaret Lawrence",
            "He only wanted a daughter?",
            "Fuck your dad. Fuck your mom. Fuck your younger sisters. I know you care for them. But, they will never understand what you went through. And they wouldn't ever care if you explained it to them. I doubt they would believe you. They knew the good side of your father and you knew the ambivalent side. They will never believe that side existed. \n\nAre you close with your inlaws? Maybe you could find comfort with them if they aren't a pack of ass holes. I only really know my mom's side of the family because of how fucking shitty my dad's side is. His parents weren't the best, they were okay. Everyone else pretty much sucks. \n\nFeel better OP. I'm sorry you got forced into this bull shit. Hopefully you'll be a stronger individual in the future once you begin to see a professional and are able reconcile whatever feelings and issues you have. ",
            "I feel your pain man. I'm 35 and have an an extremely abusive (mentally, verbally and physically) father that I haven't spoken to in over 12 years. And though he has never actually said those things (I never wanted you) to me his actions have pretty much said it. Though I can imagine actually hearing it is an emotional dagger like no other. \n\nI hope you are able to move on from any thought of this asshole as soon as possible. He doesn't deserve another second of thought on your part. Again, I am so sorry you had to go through this. Hope things look up soon and your in a better head space.",
            "Dude, what an absolute and fucking piece of shit. I am sorry he died but that is SO UNNECESSARILY fucked up to say in that phrasing... especially as you die. It's like a massive middle finger. Too bad that happened to you pal!",
            "\"Thanks for the sperm, now fuck off and die\".\n\nJesus OP.  I'm sorry you had to learn this about your sperm donor because that's all he is.  A sperm donor.  He's not your father.  You were raised without one and became an awesome human being.",
            "If you haven't been told already, I just wanted to let you know you can vent and whatever else at /r/raisedbynarcissists\n\nI don't know if it will help but I hope it does. I'm sorry. You definitely deserve better.",
            "Hopefully you remember this experience again when they try to bully you again.  I am interested to see how they respond after they find out what your dad say.  Please do keep us updated.",
            "I know from experience there's no cure for apathy but spite, the situation was against you from the beginning. I'm sorry.",
            "Here's something to try:  Forgive him.  Give him permission to have been an asshole to his son.\n\nThen accept there was nothing you did that caused that and like you said move on.  You said, prime of your life, nice life, good job.  Enjoy what you have, pass on only kindness to those that you encounter.\n\nFuck that shit, more guys than I can count only want for a son and also accept the daughters they get.  That man didn't deserve you and you thrived despite his lack of approval, take pride in that!  It made you the man you are today.",
            "this is so fucked up. I'm am pissed off for you! wow. i have no words. i hope you are doing okay. fuck him seriously. he's a waste of space and time. sending positive vibes.",
            "I am so sorry for this happening to you.   \nDo you regret knowing the truth?  I know it hurts, but is it any worse than shit you have said to yourself over all these years?  \n\nYou took the high road and did the decent thing.  I think this was a huge gift to your mother and sisters from you.\n\nBig internet hug for you.",
            "I'm sorry.",
            "This is late, and I'm sorry about your dad.  I've also had a struggling relationship with a parent, and it's not always easy.\n\nBut there's no reason this should affect you negatively.  The truth can suck, but it's what's real and you don't want anything other than that.\n\nI saw this meme on the internet recently, and this is what it said:\n\n\"Forgive, not because they deserve forgiveness, but because you deserve peace.\"\n\nThis might help you out in dealing with what happened.  I hope things get better for you.",
            "Why did he want to see you in the first place? Just to tell you he never wanted to see you?",
            "I'm in a similar but way less abusive relationship with my father.  He's just void, emotionally.  he never wanted kids at all. you know the rest - what you said about continuing to go back, each time with the silly hope that THIS TIME he'll be a father.  I know.  (you can borrow my father for a few years, we tend to lose contact.  he tries sometimes, he just doesn't have it in him)\n\nBut.  This is why I'm glad you went.  Because you have forever proof that that man is a waste of skin.  You won't ever wonder  \"maybe if I'd gone to see him, it would have been like the movies and he would have confessed to something that explained it all\"    That is the sort of closure you have now.  Never will you wonder.\n\n\nand judging by the responses - there are a whole fuckload of us out here with an absent while present parent.  So you've got that now too.  So not alone.\n"
        ]
    },
    {
        "post_id": "15k71c2",
        "author": "No_Story_8255",
        "title": "I [36F] declined to send my boyfriend [48M] nudes, so he accessed my personal email to see if he could find any in my sent messages to others",
        "url": "https://www.reddit.com/r/relationships/comments/15k71c2/i_36f_declined_to_send_my_boyfriend_48m_nudes_so/",
        "score": 2768,
        "num_comments": 792,
        "created_utc": 1691372780.0,
        "selftext": "Update: Thank you to all who replied, especially with tough love. I definitely did not expect the overwhelming response that I received. I have broken off the relationship and am working on getting him out of my house safely.\n\n----\n\nThrowaway. He will absolutely recognize this post if he sees it, but I would rather nobody we know does.\n\nI have been with my partner for coming up on three years now and it seems like he has always shown a certain disregard for my personal space/boundaries. Early in the relationship he asked me to send him nudes and I said no, I have never sent one and won't start now. Saying it once was not enough; he kept asking but eventually he did leave it alone.\n\nFast forward from that and he moved in with me a while back because his lease was up and he hadn't found a new one. Shortly after arriving in my home he went through my closet and underwear drawer and grilled me about unused sex toys that had been a gag gift from a female friend after my last breakup. I explained at that time that I didn't feel being in a relationship with him meant I relinquished all right to privacy or my own space. \n\nMore recently he began to grill me about the last time I had talked to my ex before him and I said \"not since we've been together.\" I couldn't figure out why he was so stuck on it. Eventually he admitted that he had accessed my phone, which I didn't lock at the time, read through like seven years of my email looking for any nudes I had sent to others (none; I have never sent a nude) and found an email I had sent to my ex saying I wasn't comfortable being friends on social media after said ex sent me a friend request. (This one e-mail had been sent while current BF was broken up with me and dating another woman, and I had literally forgotten about it given that even that exchange happened years ago).\n\nAnyway, I have been unable to get past the feeling that this is not only a tremendous violation of my privacy and anyone's who emailed me, but also just the latest in a pattern of him feeling entitled to my personal space. I'm seriously considering ending the relationship over it. \n\nAssuming I can get him to go, do you think there is any chance of counseling improving this side of him or is failure to respect my privacy just a trait he's always going to have?\n\nTL;DR I wouldn't send my partner nudes so he accessed my email without permission to see if he could get any I might have sent in previous relationships.",
        "permalink": "/r/relationships/comments/15k71c2/i_36f_declined_to_send_my_boyfriend_48m_nudes_so/",
        "comments": [
            ">Assuming I can get him to go, do you think there is any chance of counseling improving this side of him?\n\nDoubtful. If he's not the one coming to you, acknowledging he royally messed up and clearly needs urgent support to make better choices... Than no. The chances of real improvement are slim to nil. \n\n>is failure to respect my privacy just a trait he's always going to have?\n\nMost likely. And you know that. You know these are the dice you are rolling each day you stay with someone who felt entitled to you, even past versions of you, in that extreme, violating way.",
            "Holy shit, this is so far beyond a red flag... I would dump this dude immediately.\n\n1. invasion of privacy\n2. paranoia \n3. not respecting your boundaries",
            "I'll echo this, but also...this behavior is dangerous. He has no regard for your privacy, no respect for your boundaries, and no trust in you. He will ***always*** be looking for something to prove him right.  \n\n\n Your relationship is over, unless you want to spend the rest of your life working to prove your fidelity to a man that inherently doesn't trust you, or anyone probably. He's got insecurity issues out the backside, and has already gotten to the point where it's dangerous.   \n\n\n It's time and past time to get him out of your place. You are not safe.",
            "> Saying it once was not enough; he kept asking but eventually he did leave it alone.\n\nYou should have left at this point. He's a grown adult, he knows that no means no and pressuring others isn't okay. His personal enjoyment was more important to him than your comfort.\n\nHe then deep dove into paranoiaville.\n\nThere's no fixing this. Run far, FAR away.",
            "I wonder if you have any idea how dangerous this guy is?",
            "Stop thinking it's your job to fix or save this dumpster fire of a person. He's repeatedly violated boundaries, your privacy, he doesn't respect you ... What more do you need?.",
            "He doesn’t respect you, not just your privacy.  No amount of therapy is going to change that.  Sure, you can get some sheen on a turd if you polish it enough, but it’s still a pile of poop.\n\nI also don’t think you’re safe from sexual assault - he’s already proven when you don’t give him what he wants he’ll ignore your no and try to take it anyway.",
            "Breach of privacy, abort boyfriend mission.",
            "This guy thinks he is so entitled to images of your naked body that he invaded your privacy to find some. If he had found them he would have looked at them without your consent. Who knows what else he would have done with them since words like privacy and consent don’t seem to be part of his vocabulary. \n\nIs counselling going to teach him basic respect for other people? I doubt it. He has serious main character syndrome.",
            "Is he living with you?  And you want him to move out?  \n\nSeven years of email searching!?! He dug deep and went into archived emails looking for nudes. Wow… check your home for hidden cameras.\n\nHe is a dumpster fire and you don’t have a fire extinguisher big enough to put it out.  \n\nYou “feel” he’s violated your privacy? … no dear… he has definitely violated your privacy! \n\nImagine any attempts to have a social life with friends, family and coworkers will be met with suspicion and doubt. His jealousy,  suspicions and paranoia are not healthy. \n\nLose this paranoid insecure boundary breaking loser. \n\nI hope you understand his behavior is probably the reason he was single when you met him. You’re not the first woman he’s done this to.",
            "This dude sounds horrible... Drop him... He's never going to respect you because he doesn't see you as an equal.",
            "I'm confused, why are you still with him?",
            "[deleted]",
            "How have you not moved from the \"considering\" stage to actually breaking up with this creep???",
            "This guy is constantly searching for the \"something\" that he can use to tear you down and you'll accept as valid enough to accept.\n\nHe's almost fifty its not that he doesn't know this is dodge, its that he doesn't care",
            "This person is awful and he will only use counseling to weaponize therapeutic language against you. Time to bail.",
            "It’s not a “trait,” it’s a *choice*.",
            "Two words. Restraining order.",
            "Why does it matter the toys were unused? As in, if you had been using them, that would also have been a problem? I bet it would've been, with this guy.\n\nYour boyfriend is almost 50; yeah, he's not going to change. This is who he is and it sounds toxic and awful. Frankly, you should've broken up with him long before this, but now is way better than later.\n\nInstead of wasting your money trying to fix this guy, dump him and get therapy to learn why you put up with him for this long. That's a way better use! Then you won't date some version of this guy in the future.",
            "Can I just take a moment to be highly amused that this old(er) man thinks people send nudes through email... lol.",
            "Failure to respect your privacy is putting it extremely mildly. He’s trying to control you and it is a red flag for emotional abuse. Counseling will absolutely not work.",
            "This is way beyond counseling. He has repeatedly invaded your privacy and pushed beyond your clearly set boundaries. I would end this now.",
            "This is psycho. Don’t bother with counseling, run from this disrespectful and very disturbed person and don’t look back.",
            "Please read \"why does he do that\" and \"nice girl syndrome\". This man is not a safe partner. These books may shed some light in his mentality and why you have tolerated his awful behavior. He sounds controlling and unlikely to improve. He might pretend to for a while to keep you, but it's likely he will return to his old ways when you relax and feel safe.",
            "He’s FIFTY. \n\nFIF. TY.",
            "Why on earth would you be trying to fix things? Do you think this is normal behaviour?\n\nHe sounds like an absolute creep. He’s almost 50 for goodness sake and he’s pulling crap like this?",
            "He's almost 50 and is not likely to change. This is very scary. Ask him to move out ASAP and SERIOUSLY re-evaluate staying with this guy. Nudes are a surface issue. His violations of your privacy foreshadow much worse. BE SAFE !\n\nETA: Guys like this should never go to couples therapy, they just learn move ways to tweak you!",
            "Um...you should have broken up with this walking red flag 3 years ago...",
            "This is all yikes on bikes, holy shit girl the call is coming from inside the house, type stuff to me.",
            "He doesn't respect you, and he's willing to commit crimes (yes, accessing your email without your consent is a crime) to get what he wants.",
            "No amount of positive traits could make up for this behaviour. \n\nLeave before he can violate your boundaries in worse, more actively harmful and violent ways.",
            "This is psychotic, and please listen up:\n\nThis is dangerous level behavior. This is abuse. This is toxic. You will NEVER have a healthy relationship with this man. \n\nI’m not sure why none of this is an instant breakup for you. Either you’ve been desperate/lonely/codependent or your NormalMeter™️ is broken. Sis, these are reasons that you NEED to break up with this person. These things should never be tolerated under any circumstances. This is absolutely NOT what love looks like.\n\nPlease, implement higher standards. This relationship should’ve been over before all of this. You don’t deserve this, and you have an obligation to yourself to make strong choices when it comes to big life stuff, including your romantic life. The fact that you’re still with him means that, regarding your relationship life, you’ve been making poor choices. It’s time to change that and begin making healthy choices about who you allow to stay in your life.",
            "You could get counseling yourself to figure out why you have so little self worth that you're going to stay with a guy who's nuttier than a cheese log. B",
            "Nearing 50 and he has yet to learn how to be appropriate in a relationship.",
            "Nope. Get out of there. He’s 48!!! With the insecurities of a 17 year old and the possessiveness and controlling behavior that follows when young men can’t get past their insecurities. Say goodbye.",
            "I bet $20 this guy won’t leave willingly and you’ll have to legally evict him to get him out of your house. But don’t worry, it’s a bigger club than most women realize until they’re in it.",
            "These are huge violations of your privacy and boundaries. He's trying to position himself as head decision maker and boss of your life. He needs to take a step the fuck back",
            "Whyyyyyyyyyy do you expect so little, this is such scum behavior.",
            "I hope this fucker likes being single JFC.\n\nalso - change all your passwords!!",
            "Get that psycho out your house before you become a statistic.",
            "DUMP HIS CREEPY 🍑🍑🍑🍑🍑🍑🍑\n\n\nPlease go to therapy. You need\n\n\n\n1. boundaries \n\n2. More boundaries \n\n3. How to say \"NO AND FEEL COMFORTABLE SAYING NO WITHOUT FEELING GUILTY\".\n\n4. Possibly, unresolved family trauma led you to that POS bf.",
            "That’s not your boyfriend; that’s your stalker. Time to go.",
            "Ugh where does he get the audacity!!!!\n\nThis man, his brain is all shrunken and shriveled because he only thinks with his ! And he has no respect for your privacy or the rules of email!\n\nHe is too old for childish behavior! No one who is wrinkled and going gray should act like a jealous teen. With age is supposed to come wisdom, not nonsense.\n\nToo. Much. Bullshit!\n\nTake out that friend who bought you a sex toy. I guarantee you she has been waiting for the day when you dump his ass. She knows how to be fine without a man, and about self love and self contentment. Take back your email password and take the trash!",
            "> Anyway, I have been unable to get past the feeling that this is not only a tremendous violation of my privacy and anyone's who emailed me, but also just the latest in a pattern of him feeling entitled to my personal space. \n\nYes!\n\n> I'm seriously considering ending the relationship over it. \n\nYes!.\n\n> Assuming I can get him to go, do you think there is any chance of counseling improving this side of him \n\nNo!\n\n> or is failure to respect my privacy just a trait he's always going to have?\n\nYes!",
            "im sorry.  your partner is almost 50 years old. \n\n\ni didnt look at the ages at first, and assumed he was like 20... because thats how an insecure 20 year old acts. \n\nGirl, you and i are the same age.  I dont have the energy to put up with his bullshit.  IDK why you do as well. \n\nit seems like this man has never trusted you or respected you. \n\nIve dumped people for way less.",
            "**and it seems like he has always shown a certain disregard for my personal space/boundaries.**\n\nWhy would you stay with him knowing this from the start?\n\n**Fast forward from that and he moved in with me a while back because his lease was up and he hadn't found a new one.**\n\nI would bet he “didn’t find a new one” on purpose hun.\n\n**Assuming I can get him to go, do you think there is any chance of counseling improving this side of him or is failure to respect my privacy just a trait he's always going to have?**\n\nThe guy is 48 yrs old! Yes he will always have it.\n\nGet this guy out of your place & out of your life. Literally get police involved if you have to. It appears he’s been manipulating you all along. It also appears to be escalating which means it’s likely to turn physical at some point.",
            "Is there a reason he isn't your ex yet?",
            "Why are you wasting your time with this controlling paranoid guy?\n\nThis is bad news what he's doing.",
            "I’m tired of this guy’s shit just by reading this. Aren’t you tired of his shit?  life is too short to be dealing with this crap.",
            "Why on earth would you want to try to salvage this relationship? Please just help yourself and run far away.",
            "Girl, you're dating an insecure entitled creep. If you see a red flag at the beginning, that's what's you're gonna get in the end too. I feel like he might stalk you when you break it off, so be careful.\n\n Side story; I remember I warned a guy from the beginning to not send me shirtless pictures because I know exactly what he would want in exchange and I don't to that. The day before we were supposed to meet up for the first time, he sent me a shirtless picture; I ghosted his behind, blocked and deleted his number. When you set a boundary and they cross it, it's a wrap, they don't respect you.",
            "Total red flag.\n\nWhy is he so obsessed with the fact you may have sent someone else a nude? So what if you did? You’re still allowed to say no to him. What was he gonna do if he found one? Forward it to himself and then berate you?\n\nNo, this is not good. I don’t see this getting better. I think these are indicators of some serious problems to come and issues he already has.",
            "This guy needs to go. He is a massive red flag 🚩",
            "What do you even like about him? Why are you putting up with so many obvious red flags?\n\nThis is not a good person. Not only does he not respect you, he actively disrespects you-- like he treats you worse than the average stranger would. And he is 48 years old. This is the real him. You cannot change him. I think you need to work on your self-esteem and raise your standards. Literally everyone deserves a better partner than this.\n\nHe doesn't respect your boundaries, he's creepy, he has accessed your devices, he has a key to your place, others have suggested he may have put up spy cameras, I think he could've installed some spy software onto your devices, too. PLEASE be so careful about how you go about ending this relationship. Don't let your guard down.",
            "Kick him out and block him from any way he has of contacting you. I guarantee you, he didn't even try to find somewhere else to live before his lease was up. His plan was to move in with you; and am I correct in guessing that you even made the offer to him (to stay with you at least until he could find his own place) The actions you have described are that of a covert/malignant narcissist.\n(Edited 3 times to add the following )\n\nHe is looking for things you may have done (indiscretions, etc, literally ANYTHING) that he can use in the future to either hold over your head to control you, to tarnish your name to others or to justify any shitty thing he has or will do to you. I'm betting that you have lately found yourself feeling like you have to explain yourself or justify (to him) things you do or say.\nDo not attempt counseling with him. It will be a shit show. He will twist everything and provoke you to anger while he comes off as the victim and you as a crazy toxic person.  Unless the counselor has actual experience with this type person, you will be lucky if even the counselor recognizes him for what he is.",
            "Unmasking the Abuser podcast or Why Does He Do That? This is abuse.",
            "Do people even read their posts before submitting it and think “ oh yes, this sounds like a healthy relationship”? \nGirl dump him and move on",
            "You moved your **stalker** into your home, your safe place.  Now, you need to evict him.   He probably has access to your banking, savings and such accounts too.   He might have stolen your SS# while doing all this. \n\nYou need to freeze your credit so no new cards can be opened in your name. Run your credit report to be sure.   \n\nBetting you probably pay all the bills too.  What he has done is crazy & invasive, which means he is dangerous.  Get out now, take all important papers, computer and such.   All your jewelry and anything of major value.  Then have him legally evicted.  \n\nHim breaking into your accounts also might be illegal.  Report him to the police.",
            "Kick that fucking hobosexual out",
            "This man is almost 50 years old and scammed his way into your home (sure, he was unable to find a new place in time, riiiiiiight). Then he repeatedly crosses boundaries, and instead of being ashamed, he basically tells you what he did because he's annoyed that he can't find any photos. \n\nIt doesn't matter why he wants them, or why he acts this way, the fact is that he is more than a full-grown man and there's nothing you've said so far that has made him realize that he should respect you, so why would paying someone else to tell him the same thing be worth your time or money?\n\nIf he doesn't know by now, why waste your energy trying to \"fix\" him?",
            ">Early in the relationship he asked me to send him nudes and I said no, I have never sent one and won't start now. Saying it once was not enough; he kept asking but eventually he did leave it alone.\n\n No, he didn't leave it alone. This is what happens when you disregard the red flags early in the relationship. Everybody needs to stop trying to normalize this toxic behavior in the name of finding a partner.  Some partners really just are not worth having.",
            "He sounds like an insufferable asshole, and I can't possibly imagine why you would want to keep this going?",
            "Forget the headshrinker and consider an exorcist instead. Good Luck!",
            "He’s always going to be this way. He may get even worse now that he’s moved in. I hope he’s not on the lease with you. If he’s not, I’d look up the laws in your area on ending someone’s tenancy. Since you’re living together you might not have to give him much of a notice to move out. And if he does anything remotely violent call the police and have it documented. This could help you get him out faster.",
            "I genuinely thought this was one of the legal advice subs I check out by the title. What he's doing may not be illegal everywhere, but it's definitely gross and immoral. Dump him. Who knows what kind of exploitative plans he had for any potential pics he discovered.",
            "ol boy too old for these shenanigans",
            ">I \\[36F\\] declined to send my boyfriend \\[48M\\] nudes, so he accessed my personal email\n\nThat's not okay.  Ditch him.\n\n>Shortly after arriving in my home he went through my closet and underwear drawer and\n\nDitto.\n\nEtc., etc. - yeah, ditch him.  Kick him out of your place and be done with it.  Oh, and change your password, etc., he's not trustworthy.",
            "Please, run, start running fast and run far. This man is not going to get better and should have been left in the dust early on in your relationship. Save yourself and stop his abuse now before it gets much much worse.",
            "This man committed a real crime. He would have kept it without your permission and had no problems thinking nothing of it. I don't think therapy can help. I don't understand how you feel comfortable even having him in your house.",
            "48-36=12. There’s a reason he’s creep in on you and your email and not dating in his own age group.",
            "Don't walk away, RUN!",
            "1. Why are you, a mid-30's woman dating a man nearly 50? Nearly all the men that date that much younger have some serious issues. \n\n2. He sounds gross. Constantly pestering you for nudes? Gross. He is also pressing your boundaries and trying to outright cross them. \n\n3. Hold fast to no nudes. They manage to get around and also people keep them even after breaking up. \n\n4. Be careful he doesn't take a nude without your permission. Like if you are asleep or in the shower or anything. It's clear he doesn't care about your wants/boundaries at all since he went through your email. \n\n5. His going through my email would be enough for me to be done with him if I were in your shoes. Have some self respect.",
            "So once you get into a relationship you all of a sudden have no privacy? I find this kinda weird.",
            "Why are you with this person? He is truly awful, and no, you can't \"change him.\"",
            "I didn’t even need to read the rest, but leave.",
            "He doesn’t respect you. He doesn’t trust you. He thinks you’re a liar and is determined to prove himself right.\n\nWhy would you respect or trust him? Without either of those things the relationship isn’t worth salvaging. \n\nI’d be concerned he’ll set up a hidden camera to get the nudes he’s after. Maybe he’ll get the idea to record your phone conversations when he isn’t in the room to try and catch you in a lie. He certainly thinks he has the right to do something outrageously invasive like that. Who knows what he’s capable of doing behind your back.",
            "there's no saving this. therapy would likely just give him the language to manipulate you into thinking he's right and you're wrong.\n\nhis disregard of your privacy and personal things shows he doesn't see you as an equal person and i doubt that attitude would ever change.",
            "No way, you need to get away from him. He is either cheating himself or is just messed up. Entitled, immature, disrespectful, untrustworthy... there are 100 million reasons why you cannot make it work.",
            "Hey do you hate yourself so much as to put up with him?",
            "I think you need to part ways. Dude thinks you’re his property, not his gf.",
            "You should have dumped him a long time ago. You’re not property. He’s not entitled to all of these things.",
            "A therapist can't fix this kind of crazy.  Get out before he really harms you in some made up jealous fit.",
            "This doesn’t sound like a fluke to me.  This sounds like a pattern of him feeling justified to invade your privacy for his satisfaction.  He doesn’t seem ashamed or contrite. \n\nHe doesn’t respect you.  He doesn’t respect your right to privacy.  He doesn’t respect your right to say no to him. And you can’t make him.  You can only choose how much of your life you want to spend with someone you can’t fully trust.",
            "That's a deal breaker, leave his ass",
            "Do you want the rest of your life to be like this? \n\nLeave please!",
            ">he has always shown a certain disregard for my personal space/boundaries\n\nI just... He was trash from the beginning and he's trash now. When are we all going to just agree to start dumping people who are trash as soon as they show themselves?",
            "He’s been invading your privacy consistently and has no doubt found this post since it sounds so on brand for him. What’s next? Audio recorders around the house?\n\nI’ll be real… he sounds entitled and abusive. I doubt he looked hard enough for a new lease - he knew he was moving in with you eventually. Don’t waste your time.",
            "> Anyway, I have been unable to get past the feeling that this is not only a tremendous violation of my privacy and anyone's who emailed me, but also just the latest in a pattern of him feeling entitled to my personal space. I'm seriously considering ending the relationship over it.\n\nDon't try to get past it. It IS a tremendous violation. Dump him before he feels entitled to choose what you get to wear or who you get to talk to.",
            "I don't think he will become respectful. I think he will get worse. Dump him.",
            "God no\n\nAbort the relationship immediately and I know I'm a stranger but I want you to know that I hate him",
            "I guarantee you he’s tracking your phone, your car, your computer, and got secret cameras in your house. You NEED him to leave. Please tell me he’s at least not on the title. Do NOT have a joint bank account. Basically from this point on know that absolutely nothing you own is kept private anymore from him. And that needs to change immediately. Please get away from him. Do NOT let him get you pregnant. That will be a whole new level of control and manipulation and lack of privacy. Not to mention that’ll make him a part of your life in some way or another forever. Do NOT leave your birth control out. Gather your social security card, birth certificate, passport, etc any important legal documents of yours and either put them in a safety deposit box or if you have a very trusted family member or friend to keep it with. \n\nBottom line: he is 100% dangerous. Do you genuinely understand? Please get away from him.\n\nETA he absolutely may even be listening to every phone call on your cell phone. Do not put that past him. He’s shown how dedicated he is to knowing every little thing about you. Please please get help.",
            "He's almost 50. he isn't changing and doesn't see anything wrong with his actions",
            "He read through seven years of emails?\n\nThis man does not respect you, he doesn't believe that you have a right to privacy. Please end it.",
            ">Assuming I can get him to go, do you think there is any chance of counseling improving this side of him?\n\nOP, he's shown you who he is. I recommend you believe him. Reddit is very quick to jump on the \"Dump him\" train, but this behavior is an ocean of red flags. Dump him and tell him precisely why. Maybe he'll take that into consideration the next time he pries into a woman's personal space, but I doubt it.",
            "He is asking for nudes so that he can use them as collateral when things go south in the relationship. I am glad that you didn't give him any. However, you ignored major red flags and let this creepy loser move in with you. Not only should you stop living with him, but you have to stop dating him. BREAK UP WITH HIM!  You are old enough to realize that he could have gotten a lease literally anywhere else, (does he have bad credit?) but he let his lease run out and made it your issue to take him in.  You have problems enforcing boundaries and recognizing manipulative predators. GET INTO THERAPY to sort out your issues, and please, don't date until you work on yourself.  If not, you'll keep repeating the cycle of dating horrible men.",
            "Honestly, what are you doing with this douche bag ? Gain some self respect and drop his sorry ass …",
            "For someone to change, two things must exist at a minimum: they must be both willing and capable. Your guy doesn’t seem willing and until he sees how flawed his choices are with respect to your boundaries, I don’t think he’s capable.",
            "I agree that it sounds dangerous. He’s controlling, and I worry that it will escalate.",
            "50 year old male here:\n\nHow many more red flags to you need?",
            "> three years now\n\nWHYYYY didn't you dump him the first time he disregarded your boundaries?",
            "Interesting wording - he moved in because his lease was up and he couldn't find another place. He didn't move in because you can't not being with each other all the time or you're making long term plans. \n\nHuge red flag that you have clearly set boundaries and he's consistently violated them. If you suggest counseling, his reaction will probably be all you need to know about the future state of your relationship. If it's \"yeah, I need to change\", then there's a chance. If it's something along the lines of anger or denial, then I don't think there's a lot of hope there. \n\nI think the lack of respect for your privacy will eventually manifest itself in jealousy, a desire for control and manipulation. From there it's not too far a jump to your safety being jeopardized.",
            "Delete this man. He is a danger to you and very likely other females",
            "Throw the whole man away. \nMy god.",
            "This dude absolutely needs to go. He has no respect for you or your privacy. Also, if he'd found any pictures, he would have taken/looked at them without your consent. You can't fix someone like this.",
            "As someone who stayed in a relationship with a person who read all my dairies and then said it was because they \"just wanted to get to know me better,\" don't stay with this guy.\n\nIt's only going to get worse and he will destroy your life",
            "I feel like this is illegal…somehow.",
            "He's your ex now, hopefully.",
            "Holy.  Shit. You need to break up with him now.",
            "This should be in /r/InsaneExBoyfriends",
            "Yea, this is the type of guy who will make you (your kids, new partner) the silent stars of a crime podcast.",
            "Homie is insecure AF…",
            "well if that's not enough red flags for you then i guess just go ahead and marry him, cas if that isnt enough for you to dump him, I can't imagine what would be enough",
            "I didn't even read your description, only read the title. Absolutely not okay in any way shape or form for him to do that. Break up with this fool",
            "He's 48 not 17, hes not gonna change. This is who he is. Leave.",
            "This man is almost 50. You can not change him. This is how he is. Proceed accordingly.",
            "Literally leave him. Do not bother with counseling. He sounds like a complete ass and has no respect for you or your privacy",
            "LEAVE HIM. It's exhausting now, and it'll be more exhausting in the future to be with him.",
            "The two pillars of a relationship are trust and mutual respect. If any of these break, you should break the relationship.\n\nYour trust has been violated and betrayed. This is not to be taken lightly. This will be the first of many.",
            "His violation of your privacy and space is no misdemeanor, it's a gross misconduct and disrespects you. He also mistrust you.  \n\nOn whether it's a trait he has in doing something like that, it's difficult to say, but surely he has done it before.\n\nSo he will do it again if you are not protesting or show him the door .",
            "Dude is 48, he's not gonna change his ways.",
            "I understand this too well. Please know that this will only get worse and you will have to leave him. The sooner you do, the more of your life you get to live free of paranoia.",
            "He's a psycho hose beast\n\nGTFO",
            "Um, dude just keeps looking for something to be upset about...... someone like that WILL find \"something\" to feel offended about....... ALWAYS!!! \n\n\nMy best advice: \n\n\n        #RUN",
            "All that red doesn't need to be on a flag to notice it as warning signs. Dude has NO right to do all that, especially after you permitted him to stay with you at your house. What do you think are his redeeming qualifies that make him worth it in spite of all this douchery? If they are replaceable qualities (like sex is bomb etc) in my book, i would replace him or just move him out.",
            "Who sends nudes via email ?",
            "He's pushing 50. If he's still like this and doesn't see that it's a problem, he's going to go to his grave with the attitude that every woman owes him an explanation and justification for her existence. The only thing you have control over is whether or not you want to continue to be one of those women.",
            "My girl.  \n\nWhy are you just now just *considering* ending the relationship?\n\n>I have been with my partner for coming up on three years now and it seems like he has always shown a certain disregard for my personal space/boundaries. Early in the relationship he asked me to send him nudes and I said no, I have never sent one and won't start now. Saying it once was not enough;\n\nWhy did you stay with him past this point?  Why would you continue to date someone who disregards your boundaries?\n\n>Shortly after arriving in my home he went through my closet and underwear drawer and grilled me about unused sex toys that had been a gag gift from a female friend after my last breakup. I explained at that time that I didn't feel being in a relationship with him meant I relinquished all right to privacy or my own space.\n\nWhy did you stay with him after this massive violation of your privacy?\n\n>Eventually he admitted that he had accessed my phone, which I didn't lock at the time, read through like seven years of my email looking for any nudes I had sent to others (none; I have never sent a nude) and found an email I had sent to my ex saying I wasn't comfortable being friends on social media after said ex sent me a friend request.   \n>  \n>Anyway, I have been unable to get past the feeling that this is not only a tremendous violation of my privacy and anyone's who emailed me, but also just the latest in a pattern of him feeling entitled to my personal space. I'm seriously considering ending the relationship over it.\n\n*You have been teaching him it's okay to violate your boundaries your entire relationship*.  Oh sure you may have said \"don't do that\" or \"no I will not send nudes\", but he has never seen any actual **consequences** to his actions.  \n\nPlease don't just \"consider\" ending it.  **End it**.  With a vengeance.  End things with this entitled, jealous, insecure goofball.\n\nAnd then - please - get thee into therapy so you can find some strategies for clearly setting boundaries, and some understanding as to why you would spend almost 3 years with someone who treats you like this.\n\nGood luck, my girl.",
            "He’s 48. He’s not going to change. Likely, he’ll only get worse. End it.",
            "He's nearly 50 y.o. acting like a teenager...\nNo, you cannot make people change. They have to be willing to do so, and he doesn't seem so...",
            "Girl what are you doing?? Go back and reeead what you wrote. At what point after all this shitty behaviour do you think it’s going to change? There’s no baseline respect here. He’s insecure af and doesn’t matter why. He wants to own you and your thoughts. Leave him immediately. None of what he thinks is important. He doesn’t care about you. His feelings and emotions are running your relationship. There’s no room for you there.",
            "As a 42 yr-old man.\n\nRUN.\n\nI'd never even CONSIDER doing that. If I had so little trust in you that I thought you were sending nudes to other guys, we'd already be broken up.  The fact that he hasn't done that means he's manipulating you for some other reason.\n\nYou're a frog stuck in a pot that is slowly getting to boiling but the heat goes up so gradually that you dont really notice.\n\nI know it sucks dating at our age, but being alone is better than dealing with this shit.",
            "He doesn’t respect you, or your boundaries/privacy. He will not change this behaviour. Please dump him.",
            "All I read was reasons to break up with dude",
            "This guy is 12 years older than you are. Dump him & find someone your own age who will actually respect you.",
            "You're in your mid-30s and he's nearly 50. He has the emotional intelligence of a squirrel, and his actions are enormous red flags. End the relationship.",
            "DO NOT STAY. He invaded your privacy in order to break your boundary and get your nudes without your permission. Everything about what he did is the reddest flag.",
            "This either sounds like he's cheating and projecting, wants complete control over you , or both. PLEASE leave for your own safety.",
            "He has violated your personal space your boundaries and your privacy. Let him go, girl.",
            "Super invasive, boundary crossing, and controlling. MASSIVE RED FLAGS here (big ones started when he wouldn’t take no for an answer when he first started asking for nudes). He literally went through years of your personal emails to find pictures you didn’t consent to giving to him. He had no problem doing this, knowing you explicitly did not consent to giving nude pictures to him.\n\nI’d personally work on getting him moved out of my place and making him an ex-boyfriend. Way too many red flags for me and lack of respect and what looks like the beginnings of controlling behavior.",
            "My impression is that he is dead set on finding nudes of you so he has an upper hand in the relationship and you won't leave. This is the kind of guy who would secretly film you having sex and threaten you with making it public if you ever tried to break up with him. I really think you will regret it if you don't break up with him before he has a chance to think of doing this.",
            "I don’t like this disregard for privacy, personal space, and trust. \nThis is essential to a relationship so if he’s willing to try counseling, you could see where it goes. I’d be tempted to end things if it were me. \n\nSounds like he has some trust issues. You’re right about still having boundaries when he moved in.",
            "Wow and i thought I was a crazy girlfriend. Nope. Definitely not. This man is crazy",
            "a guy who is this obsessively determined to have naked pictures of you will probably try to take some himself without your knowledge, with a hidden camera or something like that. \n\nsome porn forums have sections devoted to “i sneaked this clip of my wife in the shower” type shit. while i like a naked lady as much as the next guy, in this instance it always creeps me out that these guys can’t even be honest with their own wives, that they value their own turn-on (and the parasocial approval of other anonymous guys on the internet) over their wife’s consenting to being a part of it. but also for some guys the violation is part of the appeal. anyway, some people are in really sad situations.\n\nthis guy if he’s that into nudes etc, should have found somebody who’s game for it.",
            "You need to dumb him. So many red flags...He has no respect for you at all.",
            "I had an ex like this, it will only get worse not better. If you make a fuss he'll just try to hide it better but he needs to work on himself away from a relationship before he can get over his jealousy. Please leave now",
            "Eww. Leave this pathetic man.",
            "He's a douche bag who thinks he's entitled and has no boundaries. There's better men out there, honey.",
            "Holy shit how are you still with this guy? He's not a red flag, he's a red alarm! He does not respect your boundaries. Searching for your nudes could become something much more serious down the road. Get him out of your life as quickly as possibly",
            "Please let this go, this isn’t normal. I would never dream of trying to have this level of control over my wife’s life..and we’re married. This is how abuse begins. Please get out of this situation as soon as possible.",
            "Dude is a psycho. You can't do anything about that.",
            "Im just saying… my boyfriend is 17 and is more mature than this. If that doesn’t tell you something, idk what will. You need to move on from him and find someone more mature, someone who will respect your boundaries and such. You should not be with someone who doesn’t.",
            "Not on the lease. You can get him out. Any sane person would figure a way to leave if their partner didn’t want them there anymore. Evict him if you have to.",
            "Please we need an update! You brother is so sick gosh he doesn’t deserve to have a girlfriend, or even friends.",
            "Whoa, so you've never given this person a reason to not trust you, yet here they are NOT TRUSTING YOU?  Insecurity at best, deflecting/projecting at worst. Either he's cheating, will cheat, or is looking to heavily control you. Maybe all of it.  I don't see this getting better, but I don't know everything. If he won't communicate and discuss this with you like a mature adult, then maybe separation is needed.  This has so many red flags 🚩 it's scary.\n\nGood luck. 🍀",
            "Forget therapy for him. Sounds like a waste of time, energy and money. Get therapy FOR YOURSELF! This will only get worse and I think you know that.",
            "I’d throw him away just like this post, major red flag 🚩🚩🚩 and trust issues, but if you really think it’s worth saving you can try counseling. I just think someone like this who isn’t respectful from the get is not going to change. He has issues of his own he needs to deal with. He doesn’t need to be in any relationship if he can’t trust his partner 😪",
            "34M and I've only ever received a partial nude once in my life. Ironically with the one woman I dated who I trusted the least. \n\nI've never pushed for them, and I've never sent any myself.\n\nCurrent partner doesn't do them. Occasionally if I'm on a trip I get a Pic of her legs in the bathtub, but I think that's more a quick way to say \"I'm thinking of you\" without having to say anything while she's relaxing and reading in the bath.",
            "OP the fact that he a) went through your phone is enough to scream red flag, but b) the fact he went through your phone KNOWINGLY that you aren't comfortable sending nudes, looking for nudes is disgusting?? \nAs if your NO is not enough. \nTotal violation of everything there.",
            "This behavior is 🚩🚩🚩🚩🚩🚩🚩. \n\nThis is just the beginning. He will (and already has) spend hours and hours and hours snooping and checking up on you. This is a HIM problem. This is stalker behavior. Be smart and don’t let it be your problem. Break up now, before it gets even more out of control.",
            " In no way shape or form is it ok to invade your personal space or your personal devices, and as for your email I would suggest changing your passwords to everything, check your bank accounts/credit and change passwords to your online banking apps and payment apps. Then after doing that, kick his ass out.",
            "You haven’t dumped him already?",
            "Oh leave him, there is no fixing for that kind of controlling behavior.  He does not respect you or your boundaries. He also may be looking into you as he has cheated during your relationship.  Drop this as this behavior can turn into a controlling abusive behavior as time progresses.",
            "Counseling works for people who can see their wrongdoing. He’s Ray Charles. Kick him out.",
            "Girl, this isn’t a red flag, it’s a flashing, screaming alarm. Get him out of your house. There is no “if you can”. You must. For your own safety and before it escalates any further. This man feels entitled to your entire space, privacy, and life. You need to get out.",
            "Get this man out of your house. Change the locks. Change your passwords for EVERYTHING. \n\nThis behavior is scary and can escalate very quickly. I wish you luck and a safe departure from this person.",
            "I almost never say this- break up. This kind of lack of privacy and entitlement over you could absolutely lead to a dangerous situation. Possessiveness and making demands clearly beyond your boundaries is psycho.",
            "This is absolutely, hands down, a relationship ender. This is a disgusting invasion of privacy and a HUGE breach of trust. What an insecure scumbag.",
            "I might excuse some of this of a 24 year old. (I'm not saying it is right even then or that I'd make excuses for someone at that age. I'm saying I might not write off a young guy who needs to learn a few things.) But, it is a completely different story when a 48-year-old does it. Especially when he is dating someone 12 years younger. Especially when it seems like he is trying to do various things to exert control over you instead of talking to you like an adult and both of you discussing rules for your relationship. And especially when he is going against boundaries that you've set. \n\nPlease be very careful to have some trusted family or friends around in the vicinity and on alert when you have the break-up discussion with him or any time you're exchanging belongings or having to talk after that. It may seem over the top, but change locks. Do things to protect yourself. It seems this man cannot control his impulses and acts irrationally when emotions come up and when he feels a bit out of control. I would hate to think what he would do if you wanted to break up but he didn't want to do so.",
            "Run. This will only escalate. Right now, with the way you feel violated? That is the best your relationship will ever be again.",
            "If I were OP I wouldn't want to be anywhere near this man. The lengths he was willing to go thru, after OP had repeatly set boundaries and said no, just sends up so many red flags. The man went through ***seven years*** of emails! How unhinged is that!? \n\nI wouldn't even feel safe to fall asleep anywhere near this guy either; if he can't get nudes directly from OP, who's to say he wouldn't take matters into his own hands and take pics of OP while they're asleep.",
            "Please dump this walking red flag before he starts physically abusing you for these perceived transgressions. Someone who feels this entitled to you will not stop at violations of privacy.",
            "This type of behavior makes me concerned for your well being OP, I hope you can find the courage to leave and not look back as that might be best for your well being.",
            "He's giving you plenty of opportunities to make a clean break and get away from him.",
            "Hoolyyyy…break up with him, he’s obviously extremely insecure and has controlling tendencies. Violating boundaries repeatedly is enough to end things. He’s going to need a lot of therapy to get over this, but it won’t be quick. Don’t waste your time with this and don’t negotiate if he says he can change. I’ve seen this type of thing play out hundreds of times in my friend groups and their families and even my own, and it never ends well. \n\nGet out now!",
            "If you're having to be in counseling while dating, why would you want to continue?",
            "Therapy won't fix the fact that he doesn't respect you as a person",
            "All of this and you want counseling? No this is who he is. He completely disrespects your boundaries, is jealous, controlling and at 48 is not changing. None of this behavior is normal at 20, at 48 it’s much worse. Please don’t try to make it work.",
            "And he just breached the computer misuse act...",
            "This isn’t going to get better.",
            "It’s so completely not okay, no one who is well does this. It’s a complete moral failing and an irreconcilable difference, this person does not seem safe.",
            "Run. It will only get worse.",
            "All of this behavior is scary. He literally saw an email that you sent to an ex saying that you didn't want to be friends with them, and yet this dude STILL doesn't trust you?? he has issues, RUN.",
            "Girl, this sounds like the beginning of a dateline episode. Those never work out well for anyone. You could bring this dumpster fire to a therapist, but best they can do is put the fire out…",
            "😳😳😳😳😳🚩🚩🚩🚩🚩🚩🚩🚩🚩\nNothing about that indicates a person who is capable of respecting someone’s privacy. The entitlement and the audacity on this man",
            "there’s really nothing more to say here besides dump him. his behavior will escalate.",
            "Guys who do things like this do it because they're feeling guilty about something shady that they did/ are doing",
            "Your inkling to end your relationship over this is spot on, go with it.",
            "Unauthorized access to an email account is illegal in most places.  Add on what his intent was and it gets worse, if not from a legal standpoint, than definitely ethically.\n\nThis is a pretty huge red flag, especially given his age.  He should not only know better but this sort of thing shouldn't even be crossing his mind.",
            "Dump him and leave all his stuff on the curb so he can’t try and stay.",
            "His lease was up and he hadn’t found a new one. Because he hasn’t bothered looking for one. It was his way of manipulating you into letting him move in with you so he could control and monitor every aspect of your life. He will never respect your personal space or privacy or boundaries or respect you for that matter. If or when you try to break up with him/kick him out he will become extremely violent and accusatory and abusive. Be prepared.",
            "i’m telling you now, you need to break up with him now before things start getting really bad. you’ll thank yourself later",
            "Alot of red flags here OP, I'm sorry your going through this. Going through your closets and questioning you about sex toys is very odd and could be crossing the line depending on boundaries etc. Going through your phone looking for nudes is definitely crossing the line. Him being caught up with having nudes of you is also strange, I know it's tough breaking it off with someone you live with but I think it's time you take an honest look at your situation",
            "I agree with all of the statements that you should absolutely throw out the entire man and start looking into a restraining order because he will almost certainly NOT take it well. I have seen many say check for camera, which I absolutely agree with as a friend of mine's husband installed hidden cameras in her home without her knowledge. (The house was in her name alone and he worked out of town a majority of the time.) Also look for tracking apps or keystroke recorders on your phone. Really, start looking into all of your electronics to see if he has installed software or Spyware to get nude photos of you or whatever insidious things he feels are his right. Get rid of him as soon as possible. This will not stop and will only get worse.",
            "He seems pretty unapologetic and willing to cross those boundaries even when you've said no. Therapy only works for the willing. You could baby proof your life,  locks, etc but why would you want to live that way? Time to move on.",
            "He absolutely does not care about your privacy, your boundaries, or your self-respect. He has a pattern, as you've said, of just blatantly disregarding your privacy. At this point, I wonder if he even tried to either renew his lease, or find another, or if he knew you'd let him move in.\n\nEvery relationship is different, some people don't care about phone access, some don't care so long as access is communicated, and some care very much; but in a healthy relationship, any/all of those boundaries are respected and communicated.\n\nHe needs to go, and you need to change ALL of your passwords and block him. Hell, after he leaves, I'd change the locks, too.",
            "Oh lord. I don’t really have anything to say. Leave him sis. \n\nThe age gap isn’t massive by any means, but it could be enough to make him feel like he has power/experience over you. He does not respect your boundaries, or your consent, nor does he trust you. \n\nLeave him, you’ll be better for it.",
            "He couldn't find another home to lease or he just figured it would be easier to move in with you. Girlfriend thumbs down all the way. He's almost 50. Come on.",
            "He's foul. Cut. him.out.",
            "Honestly, and this is coming from someone who is far too nosey, he’s going to have to learn the hard way. Hopefully losing out a good relationship will lead to some reflection. Unfortunately for you  breaking up with him might be improving him for the next girl",
            "Please get out of there. This behavior will only escalate. You are in real danger of domestic violence.\n\nLeaving an abusive partner is an especially dangerous time. Gather your support people around you, and lock down your online accounts and check for spyware etc (Crash Override has a good basic guide to online security to start).\n\nCounseling does not reform abusers. He will not change, don’t believe any attempt to get you to think that he has.",
            "How do you know he’s looking for nudes? He seems to have some trust issues with you. Is there something you have done to send him on this search through your emails? If you have been with him for a few years and you see a “pattern” maybe there is some toxicity in your relationship. \n\nEven if you could change someone at either of your ages, why would you want to. You should stay with someone because you love them, you trust them, you have their back and they have yours. There doesn’t seem to be any mention of that. Just fix and change and indecision. It would be best for both of you to go separate ways, don’t give into or create any drama and just move on. Wasting time with the wrong one means time and opportunities missed for the right one. Good luck.",
            "I have been cheated on numerous times and have a hard time with trust and even I can say fucking Christ this dude has some serious problems.",
            "They are way too old for this shit.",
            "Oh nu uh. This sounds so much like my ex. He was absolutely psycho and was constantly going through my phone and would apparently spend hours looking through my fb and IG pics and would flip out if I still had an old photo of an ex. He was always looking for something to get mad at me about and constantly accused me of cheating or trying to. He even took the two sex toys I had and brought them with him to work and then would come home asking if I had fun with my toys. I never understood why he kept asking me that cuz I didn’t even use them, then 2 weeks later he was all, “ah hah! I’ve had them with me this whole time!” Like… I never wanted to use them so I never realized they were missing. I had NO personal space or time. \n\nThis guy is showing you his red flags and they’re pretty big. Why was he even going through your underwear drawer?! So what if you have sex toys! He is not your owner. And he’s living in YOUR place and you make the rules. You don’t need someone like that in your life because you’ll find yourself walking on eggshells and afraid to breathe to hard or else you’re in trouble for something they project onto you.",
            "As someone who was with a man like this for two years, leave him now. It’s not fixable and his behavior will only keep escalating. You don’t need to be with someone who you constantly have to explain yourself to and be walking on eggshells all the time. There are so many better men out there. 🫶🏽",
            "It wasn’t insecurit. It was entitlement. You’re very lucky. If he found any theyd be posted all over the internet. Most men prefer live to memorex",
            "You invested 3 years already so it is hard to give up just like that, but this dude lived almost half a decade and is acting like this. Why waste more time to find out if he is able to change after such massive breach of your trust and privacy? Don’t let this be your normal. Find someone who actually respects you.",
            "This guy is out of line and you don't need to be around to find out if he ever changes.    He has to want to improve himself regardless of the relationship with you.  He's 48, so that seems unlikely.  What he's doing is emotional abuse.  \n\nAlso, good for you for not getting into sending nudes.  It's just my opinion, but I think people have lost their minds.",
            "Narcissists don't get better from therapy.",
            "Another shocker from the men that date women 10 +years younger",
            "You're the one choosing to tolerate this. It's on you when it continues.",
            "He is too jealous. Believe me, it can be fixed, but it will take time, and the only person who will know if he is indeed putting in the effort to change (and not wasting your time) is he himself. Now, can you stand this process? Do you trust him as someone giving and selfless enough to face the change and not simply lie to you about it? It's up to you.\nEdit: Just remembered his age. Damn.",
            "He needs to want to change. Research paranoid personality disorder. I had an ex who was like this - obsessively jealous, possessive, yet blamed me for it all. \nPersonally, I’m your situation I’d be leaving the relationship but now that he is living in your space, that’s going to be very hard to do. I truly wish you the best with this.",
            "As a guy I would say dump him already but give him a chance to make him understand what ur feeling and how it's affecting u and all, have a conversation with him about it before pulling the trigger.",
            "I would end it or at the very least demand therapy as a condition of continuing.",
            "Wow, that's a seriously lustful man right there. I'm not saying lust is always bad, but when it gets too much it can be suffocating!",
            "But was there nudes sent to you during your relationship?",
            "Not justifying his actions or saying they are justified. However there are always 2 sides to every story. Do either of you have a history of being dishonest to each other have you said or done anything that would make him suspicious of you? Have you acted differently towards him vs how you may have acted with other partners or how you've talked about other partners. Some people have extreme trust issues. Again I am not defending him invading you personal boundaries it is wrong of him to do so but if he doesn't trust what you have said or are telling him your actions might not be matching your actions.",
            "I’ll play devils advocate here. Why are you pursuing a romantic relationship and won’t do things to entice your man?",
            "Sounds like you’re just a bad girlfriend that doesn’t like to please his man. He’ll prob end up cheating on ya.",
            "You are correct that you deserve your space but what are you doing to cause his insecurity. This sub is full of women going through mens phones and finding evidence of cheating and then all of the women cheerlead for them for their detective skills based in a hunch. \n\nIt doesn’t sound to me like you have any problem being completely honest with your BF and I think that is admirable. Don’t see it as an intrusion but a chance to prove your dedication to him. \n\nI would suggest a BJ and apology for being so shady.",
            "[removed]",
            "First of, I really don't understand the purpose of saying this is a throw away, isn't that just giving out the fact this isn't your real account?\n\nI think this guy is bad news",
            "He seems to think more about himself than you. I don't expect a bright future in this relationship.",
            "Please, please dump him. You don't deserve this. He should seek counselling or whatever it is to help him, but you shouldn't be there with him.",
            "I’ve been with my husband for twelve years and have NEVER asked to go through his phone. I honestly don’t even know his password and he doesn’t know mine. If we don’t trust each other, then what’s the point?",
            "Although he should engage in therapy to address this behavior, he’s not going to change while still dating you. Why would he? If you stay with him, then he has no reason to change. But more importantly, you should leave him for your own health.\n\nPlease find a safe way to break up with him and evict him from your home. Ask for advice, have friends or family to be physically present as needed, etc.",
            "Tbh the first red flag was that he let his lease end without having a new one lined up.  Either he somehow can't adult at almost 50, or deliberately didn't find a new place so he could leech off OP",
            "You might have to formally evict him. You will have to check the rules where you live. \n\nBut prior to him moving out, you need to lock down and change all of your your passwords, emails if you feel the need, and lock down all of your electronics, personal accounts and belongings, anything you hold dear, or anything that you think he might take or destroy to hurt you. He may not be one of those types of people, but the fact that he has refused repeatedly to respect your boundaries and your privacy, I don't think he can be trusted in anything. And once you've got him out of that house you block him on everything. Counseling will not help a relationship or a person who willingly repeatedly violates your privacy and your boundaries so don't even try",
            "Is he on the lease?  This behavior, for a 48 year old man, is unacceptable.  Dude hasn’t grown up, he is completely immature, and needs to leave.  \n\nI normally don’t say that when reading these stories but you are in a tough position.  If he finds any evidence that you sent nudes to someone else, he will throw it in your face.    You don’t need that type of immaturity in your life.",
            "Where to start....ugh....You seriously (!) need to set hard-core boundaries, and I wouldn't be nice about it. It's too easy to say \"leave his ass\" since I'm not in it. Others have pointed out that if he's willing to go that far, he's capable of tracking you, setting up cameras, etc. You should honestly check for that stuff. He's incredibly old to be moving in with you. Is he not financially secure to find his own place? This entire situation really does stink and full of red flags. I'd be very concerned. And seriously consider giving him a time-frame to move out.",
            "Dude is 48 acting like this. There’s a reason he was single",
            "Please be safe. If you choose to leave him, be concerned of stalking behavior. \n\nIf he is going to read through 7 years of emails, do you think he is going to respect your boundaries about breaking up?",
            "You better get him out before he has squatters rights.",
            "Drop this guy like a sack of bricks!",
            "Do not go to counseling with this man. He’ll weaponize it against you. \n\nJust run far and fast and safely. Don’t be alone with him ever again. He’s got a real chance of being violent.",
            "It sounds like he has some issues with impulse control and paranoia. These are bigger problems than your relationship and he should seek help and supportive care for them. I wouldn’t even consider it part of the relationship but it’s fair if you didn’t want to be in a relationship with someone who had those limitations.",
            "Your partner is at a stage in life where I have to assume he is abusive. This isn't simply ignorance, at his age he has been in other relationships, has life experience, and he chooses to behave like this. OP, if he doesn't respect your boundaries, then he doesn't respect you. He doesn't care about your comfort or discomfort. Imagine if this man wasn't your partner, he would be considered a dangerous stalker who is violating your privacy.\n\nI don't know what else this man has done, and I wonder if him not \"finding anything else\" when his lease ended, was a way to gain access to you. \n\n\nI would run OP. You don't know what he wants to use the images he is feverishly looking for, why does he need nudes x years into a relationship?\n\nIf you are in therapy, please consider discussing this with your own therapist first. \n\nSecondly, only believe improved behaviour, not words. \n\nThirdly, I'm very sorry, but I would check this man's digital footprint. My gut feeling tells me he wants those nudes so he can potentially use them in an online setting.",
            "OP I’m worried for you! \n\n“Assuming I can get him to go” - can you call for a police escort and have him leave with an officer present?\n\nI would advise also changing the locks and maybe staying with a friend for a while after- right after you break up is when abusers are their most dangerous.",
            ">Assuming I can get him to go, do you think there is any chance of counseling improving this side of him or is failure to respect my privacy just a trait he’s always going to have?\n\nSo a few things here. First off, therapy is not a total cure to bad behavior. It should be treated the way rehab is in the sense that it can be tremendous help to people who want help. How successful do you think rehab is if you have to convince the person to want to get better? How successful do you think your boyfriends therapy will be if you have to convince him to go?\n\nSecond, you’re asking the wrong question. You’re asking if failure to respect your privacy will be a permanent trait, but you should be asking if failure to respect YOU will be a trait he’s always going to have. The way people react to the word “no” tells a tremendous amount about their character and how much they respect the person that gave them the “no.” If they respect the person, they respect the no. Simple as that. Respect does not mean trying to acquire the information they want by lying, violating privacy, etc, it means backing off when they’re told not to go somewhere. Based on his lack of remorse, this man does not care about respecting you, nor will he unless he suddenly wakes up and realizes what he did was wrong.",
            "Counselling will only work if he takes accountability for what he has done and wants to change. He has violated your privacy in the most controlling possessive way, is entitled and insecure. I would tell him this and then run for the hills.",
            "Yes seriously this is very alarming. \n\nHe thinks he’s entitled to know everything about you, every thought, even before he met you. Like more than double the time he’s known you he went back. \n\nIf he’s clinging onto this email to your ex saying you don’t want to be friends on social media as some kind of evidence of your dishonesty, then that is about as low as you can go. \n\nNo self-awareness and looking for problems with you. Sounds like he’s got it good with you, can’t believe his luck, and is self sabotaging. \n\nGood luck.",
            "\"he has always shown a certain disregard for my personal space/boundaries\"\n\nShould have been enough for a reason to leave. Why didn't you?",
            "Girrrrlllll, Kick him tf out of your apartment and run for the hills.",
            "End it now, this is wrong on every level. Get him out of your apartment and out of your life. Do it quietly whilst he's out. Change the locks change your phone, change your passwords, check all your security and recovery settings haven't been changed but above all get him out of your life and home.",
            "Wait, you mean someone saying someone 12 years younger is just into then for the looks? Weird.",
            "If I hadn't just read a post from a young woman who discovered her brother has been stealing her bras for \"special alone time\", this would be the creepiest thing I've read today.\n\nHis behavior is inexcusable and it's already escalating. Stop considering ending the relationship and do it. Preferably in public with a friend nearby.",
            "You should not be in a relationship with someone in hopes that they will turn into a person you like. You should find someone you like and THEN start a relationship. A partner shouldn’t be a DIY project!",
            "Get rid of this fucking loser.",
            "This is not only a red flag, its illegal. He has violated your trust and private space and right to have your emails confidential. \nI would be very scared, to the core, to continue to have a relationship with him. He shows no respect for boundaries and who knows what he's capable of?\nI heard my friends tell me that when I was going to leave a violent and destructive relationship, I defended him and said NOOO WAAAY he's gonna do anything. He crashes the interior, throwing things and breaking things around me, spitting in my face and scarying me to death and I fles to a womens shelter. So yes, it doesn't stop when they show such bad behaviour towards you and your right to privacy. And a respectful partner doesn't demand nudes. They respect boundaries. Be careful!",
            "Your (hopefully ex) partner's jealousy is a \"him\" problem and totally disproportionate to a healthy relationship. He can go and get counselling himself because these are controlling traits and those who have been in similar scenrios will most likely tell you it will get worse. I have no patience for this kind of entitlement. \n\nHe was literally looking for nude pics that he will no doubt use to try and control you leaving him. \"I'll send them to all your friends\"",
            "Edited to add: I agree with others than you should RUN not walk. \n\nMy warning: breaking up and getting him to move out of your place will be hell. Keep doing it. Lose money, write it off as a lesson (sucks and shouldn’t be the case but here we are). Honestly I know this sounds extreme but if I were you I’d consult a tenants rights lawyer. After someone has lived with you for a certain amount of time, depending on your state (in the US), they may have rights whether they pay rent or are on the lease. Sad to say this all but I have been screwed, and have friends who were screwed, by walking red flags like this who moved in with us when they had “no other options.” Godspeed and good luck - it is so much brighter on the other side.",
            "Ex boyfriend, right? Right?!",
            "He's disgusting, nearly 50 and this is who he is, run ,don't look back.",
            "oh my god hes 50???? and acting like this!??? actually baffled you’re too young for this bullshit girl leave",
            "I had an ex who was very similar. I did send him to counselling, which not only did he put off until the relationship was really on his knees but he did about 6 sessions before calling it quits, despite the fact he said they were helping. Entitled people don’t see that they are doing anything wrong , they think, they are entitled to do what they wish. In his case, look through what he wants, when he wants. I would just ask him to leave , move out, break it off. If he wants to go to therapy he can go for himself. But I wouldn’t hold my breath that he wants to change. He knows a woman of 48 wouldn’t put up with this shit. My ex went for younger women once we were over. At a guess for similar reasons.",
            "A carnival of red flags. \n\nThis man does not respect you or your personal space and privacy. He’s violated your boundaries several times now. And even on the assumption you could get him to change, is he worth all that effort? \n\nIt won’t erase the past foul behaviour. You could be with someone who isn’t entitled and insecure instead. Being alone would be better than this. He’s overstepped the line majorly, more than once and shows no sign of changing.\nPlease show yourself some love.",
            "OP I am not playing, you need to run like yesterday, this man is one incident or delusion away from hurting and or killing you.",
            "I read this post to my boyfriend (age 38) and he says: “what a jealous sicko, she needs to breakup with him because he will never get better. He won’t want therapy and even if he did she deserves better.” I agree. Kick him out!!",
            "Is he bloody 15? No girla, kick him out, he is gross",
            "Sounds like he has major trust issues and if he is this age and still has them, i don’t think they’re going anywhere. I would be trying to end this relationship too.",
            "Gross. He won’t get better. He isn’t even apologizing!",
            "I would be extremely uncomfortable if someone went through 7 years of my emails.\n\nViolation at it's best.\n\nAlso the boundary thing is concerning. I'd get out that relationship.",
            "That you’re posting here, suggests to me that you already know what you need to do.\n\nYour partner sounds very incredibly immature, insecure and frankly manipulative. Not attractive traits. \n\nI’d suggest ending this relationship. Because of the severe breach of trust. A relationship without trust isn’t really a relationship.",
            "“He has always shown a certain disregard for my personal space/boundaries” \n\nSooo you stayed with him why exactly?\n\nYou should’ve left a while ago. This guy sucks.",
            "Honestly I'd breakup with him with a friend there. He sounds potentially dangerous. Soooo possessive. Get rid. This is a life of misery",
            "This is a huge red flag. Any partner that goes against your boundaries is a bad one. Full stop.",
            "Run. Run away fast. \n\nDo not go to counselling with this man, he is an abuser. \n\nHow are you not terrified??",
            "The only email he could find during his massive violation of your privacy was one where you reinforced healthy boundaries with an ex when he wasn’t even with you and he was trying his best to get mad about that. Red flag city!",
            "Is he ok? I guess he is reacting from a place of trauma; wounds he probably doesn't even know he has, so therapy is always good .. but he has to be willing to do it, otherwise he won't put in the work. Depending on what kind of person he is, there's a chance he vibes with it and likes it when he gets there and puts in the effort, even if the request of going is initially from you.. so even if you decide to stay or to go, I'd encourage him to go. \n\nAs for you.. you have to think about the right here and now. It's a thing that is very uncomfortable and certainly disrespectful, even if he is conscious about it or no. I always say think about how it is right now, because even change is granted, the quirks and behavior of a person are not granted to change (or they can change in the worst). All we have is right now, and right now is not ok. \n\nI'd at least put in some boundaries, I don't think I'd be comfy with him in my house. You have to weigh what's more crucial to you in a relationship and be honest in regards to what boxes are checked in this relationship. I don't consider him a bad human, but he has some problems that need to be fixed in regards to a romantic relationship and you have yourself to put first in all situations. I wish you the best!",
            "F@&!$ me red flag marching band going right there! Please get him out of your house and change the locks, make sure you change your wifi password and phone too.\n\nHe cannot be trusted, clearly has no boundaries and no respect for yours. Very controlling and emotionally abusive on his side. At his age this isn't something that can be easily fixed and you two haven't been together that long I'm sorry but if you were my friend I'd be begging you to get him out of your life as I'm worried for your safety.",
            "I’m so sorry but he’s a massive walking red flag. So far he’s had to be told repeatedly that you have never & will never send nudes of any kind. He’s invaded your personal space as soon as he has manipulated you into letting him into your personal space with the couldn’t find another lease excuse, has interrogated you over unopened & unused gag toys given to you by a female friend & CHOSE to go through your emails & read all 7yrs worth even with an ex that you haven’t spoken to in years to pry & find nudes that you already clearly told him you don’t & will never send. He isn’t going to change, he clearly cares very little for your privacy, boundaries & feelings & will continue to trample these as he has done so far without even the slightest inkling or guilt or remorse for his actions. It also seems like you may not feel safe if you end the relationship by your comment of if you can get him to leave in the first place. \n\nDo you have any male family members near by that can be of assistance in getting him out of your home should you choose to end the relationship? Or possibly have police present if no male family members are available or live in the area? \n\nStay safe & I hope you make the best decision for you, your safety & your sanity",
            "He sounds unhinged in a dangerous way.",
            "If he doesn’t see anything wrong with what he did, doesn’t respect your personal space and boundaries, doesn’t grasp the meaning of no, then get out of this relationship ASAP. \n\nWhether he can change with therapy should not be your concern. You need to prioritize yourself, your safety, and your mental health.",
            "Not that you were going to anyway, but NEVER let this man have a nude of you. He's already breached your privacy and boundaries in a huge untrustworthy way, but if he gets a nude he will no doubt breach your boundaries and privacy that way too. Revenge porn, showing his friends, god knows what else. Please dumb him and run far away",
            "I think if this is how he behaves three whole years into your relationship, he’s the problem and you should end things. That is a disgusting and concerning breach of your trust. Not only do you not want to send him nudes and he can’t respect that, but he went to your email to SEARCH FOR THEM?? That’s illegal! I am disgusted. You’re better off ending the relationship.",
            "This is concerning and invasive in so many ways that I'm starting to wonder if he is deflecting because he is doing it (sending or receiving nudes from another) or he has major insecurities that hes making you suffer for, which isn't right.\n\nHe needs therapy",
            "This is controlling behaviour and it will only get worst.",
            "1: check your place for hidden cameras and your phone for tracking apps 2: dump him\n\nYou are actually in danger. This is not some minor couples fight. He is escalating and you are enabling it. None of it is normal. Why are you with him?!",
            ">Assuming I can get him to go, do you think there is any chance of counseling improving this side of him or is failure to respect my privacy just a trait he's always going to have?\n\nHe's old enough to know better. I doubt you'll be able to get him to go. He won't change. The first offence you mention should have been the end of shit.",
            "These weirdos are always 10+ years older lmao",
            "By the time many people post here for advice their relationship has already come to its end.",
            "12 year age gap all anyone needs to see",
            "My ex wife violated my privacy repeatedly to obsessively look for things as well. Did I mention she’s my ex-wife?",
            "It is heartbreaking that how many people in their 40 are not mature enough. He is not up for a stable and long relationship, he ignored your boundary, and he didn't respect you, and I can keep going, but I believe these are enough not to continue any relationship.",
            "Dudebro's a grown ass man, you're a grown ass woman and it feels like there's an omitted detail here somewhere because If this was as open and shut as it sounds, the dude should've been booted out of your house *that day*.",
            "As a dude, I'm just adding a vote to the \"chuck the whole stalker away\" pile. This is abusive controlling behavior, starting from him having the gall to inspect your closets etc when he moved in with you and then having the audacity to grill you.",
            "RUN!! This will not change and it will only get worse. You need to get him out of your place. Which I have a feeling is going to be hard. Do not cave. Your second paragraph says it all. He doesn’t respect you at all.",
            "Very controlling, disrespectful, and pejorative behaviour! Of course you are entitled to your privacy but he doesn't think so. Take this as a sign of things to come - he will become more inquisitive and possibly more controlling. I don't think that you will be comfortable with that. I don't know if therapy would be successful in his case, I doubt it. Best to move on! Good luck!",
            "This is wild! Leave this relationship, it sounds exhausting. Also, do you think he could be suspecting you because it’s what he himself has been doing?",
            "I don't think I've ever seen flags so red or so prevalent in my life. I think you know what needs to be done. Best of luck to you.",
            "You said no. He decided his want was more important than your no. That's really concerning. \n\nHe went into your private account to try and take for himself something he had been told a) was not for him and b) wasn't there to be found. \n\nRed flag, especially with your comment about him being entitled to your personal space. This is so worrying, be safe OP.",
            "Dump that old creeper",
            "Oh god, I had an ex go through my emails once. This is absolutely dump-worthy, OP.\n\nThis guy feels entitled to know anything he can find out about you, by whatever means. It’s really gross controlling behavior.",
            "I think he wants nudes so he can blackmail you later",
            "U don't really need answers from reddit do u?\n\nThat's obviously immediately psycho level shit u should run from",
            "ewww, this guy nasty",
            "You’ve gotten good advice on the relationship part of this, and you were absolutely a victim here but one thing I’ll throw out there is that you should absolutely change your passwords and unlock code, and probably enable multi factor authentication with your email provider (so anyone who tries to set up your email on a new phone or computer has to enter a code that is sent to your phone via text first). \n\nYou should not need to do stuff like this but here we are.",
            "My therapist has told me that it is a bad idea to do couples therapy with an abuser. It sounds like your boyfriend is an abuser, he doesn't respect you or your boundaries and he sounds controlling as well.\n\nI think you should just cut your losses and run.",
            "Imagine if OP tries to get out of the relationship if he is acting this crazy now.",
            "He actually sounds a little bit scary. Get rid of this creepy, insecure man. No matter what the other good traits you think he has, this is a huge dealbreaker for most people.",
            "Sweetie he's almost 50. There's no fixing him, he's incredibly disturbed.",
            "If you want to end up with a controlling domestic abuser, this is how it starts.",
            "He's been behaving in this unhealthy way for a while. You've openly asked him to respect your boundaries several times (and I'm sure there were many more instances that you didn't mention in your post). He is ignoring your requests and keeps doing what he's doing: being invasive, disrespectful, controlling, dismissive, self-centered. It works well for him, has worked before too, I imagine. Counselling cannot help a person change their behavior unless THEY themselves want to change. I don't see anything about him acknowledging his wrongfullness here. So, unfortunately, it's a lost cause.",
            "🚩 🚩 yeah if he wants to engage in counseling and come back a year from now and plead his case you could think about it but there are just too many red flags in this scenario. Be safe!",
            "Why are you putting up with this? Why do you want to change this man who has violated you so many times? Why don't you think you deserve more and are worthy of more?",
            "Privacy left when y'all got together and moved in y'all are partners and do things together now you can tell him how you don't like certain things but then that looks like your hiding something so just figure out what you gotta do best of luck 😊",
            "I read things like this and wonder what his positive traits could possibly be to outweigh these gigantic red flags.\n\nThat’s so weird and unnecessary to read through 7 years of personal emails to see if you sent nudes, and then try to catch you in a lie about an innocuous email exchange with an ex… in which you were SETTING BOUNDARIES…. during a time period he was SEEING SOMEONE ELSE. Absolutely wild. 48 year old man…… no thanks.",
            "Dump him and run. \n\nHis behavior is so unhinged from the beginning and just keeps getting worse. \n\nI get it, I've had a ton of really abusive relationships but they were after leaving my abusive family. It seems that their abuse was different or I deemed \"not as bad\" as my parents abuse. \n\nYou don't need to take *ANY* abuse from people. \n\nHe is a 48 year old man for crying out loud. He knows what's acceptable and what's not. He is *CHOOSING* his actions.",
            "He sounds like a stalker. He is insecure, possessive and controlling. He doesn't respect you. He doesn't trust you. I'm willing to bet he didn't really look for another apartment. He moved in with you so he could violate your boundaries more easily. Counseling won't fix this guy. You need to get him out of your life ASAP. And you need to change all your passwords and have friends there with you when you tell him to leave.",
            "If a man is jealous of my sex toys, it's not going to work out. He does not own your body or tell you what you can and can't do with it.",
            "You can’t change a man only he can. Remember that!",
            ">**SEVEN YEARS WORTH OF EMAILS LOOKING FOR NUDES YOU MIGHT HAVE SENT TO OTHER PEOPLE**",
            "Please leave this dude!",
            "“Don’t expect to change a man unless he’s in diapers”\n\nGirl this dude is a parade of red flags\n\nYou need to give him his walking papers YESTERDAY!\n\nAlso have your phones checked for tracking apps and take your car to the mechanic to be checked over for tracking devices (take a look yourself of course, but he might have been extra sneaky and it could be really well hidden)\n\nGood luck",
            "Projection.\nHe’s cheating and hiding things from you, so he’s accusing you of it.\nHe’s getting nudes from other women, so he can’t understand why -you- won’t send yours.\nAll projection.\nLeave his ass.",
            "This guy is absolutely a lost cause altogether. The fact that he grills you about your past and that he went through your phone AND email looking for nudes you sent to others is a massive red flag. Counseling will not make this better, because in his mind, there is no problem nor will there ever be. This is the kind of controlling partner that I've seen so many of my friends fall victim to. And not only that, but this isn't some 20 or 30 something year old boy, this is a grown ass 48 year old man. He's seeing all of this as he's older than you, so he has all rights over you and possession of you. Again, saw a super hot, independent, awesome girl I know go down this path with a controlling, jealous, older man. It did NOT end well and she still has tons of mental and emotional scars with him after their ugly divorce. Get out ASAP and keep your guard up.",
            "Drop him.  He is 12 years older, why would you want that?",
            "Thats an invasion of privacy I am sure he wouldn’t like it if you did the same",
            "Insecure, jealous, possessive X10!! This won't get better. Leave while you still have the chance!!",
            "Insecure, jealous, possessive X10!! This won't get better. Leave while you still have the chance!!",
            "I read this and thought he was in his early 20s or teens before relooking at the age again. He’s too old to be this insecure. Let that Man-go. I’m 28, and this is childish to me. You seem very mature, it seems like you’re holding on to potential. But at this age you should be looking for them as they are not as they “could be”",
            "This is sexual harassment",
            "This man is almost 50 years old and has no understanding of boundaries. I do not think counseling is going to help him.",
            "Going through 7 years' worth of your personal emails to find something you've said you've never done ... For why? Why did he do this? It's unhinged. I've been with my partner for 14 years. We've never felt the need sneak behind each others backs and violate each others' privacy and boundaries like that. We're not entitled to each other; he's not entitled to your things, relationships or history either. \n\nThis level of intrusion speaks of a massive lack of trust and disregard for personal boundaries that cannot be fixed without significant work from him. As it stands, if he can get what he wants through circumventing your consent, he will do it. He has before. Several times. \n\nGet out. Now.",
            "i had an ex who apparently had accessed all my google chrome passwords and gotten in my email and read my exe’s emails and “checked” to make sure i wasn’t camming while i was with him. god that relationship was a disaster lol. \n\nno therapy. just dump him. this level of disrespect means he’s gonna violate you in other ways you aren’t prepared for.",
            "Why are you dating this old boundary crossing controlling dude? You don’t need this in your life! He is not going to change or get better. He keeps pressing you and not listening. Why do you want to stay in that situation? Run please.",
            "No offense but why would you want to do counseling with someone that you are not married to? Especially considering he has shown you this behavior since you met him. I think it’s time you let him go and move on.",
            "I had a friend with a husband like this…. I had to finally distance myself from her because I was a terrified of this dude.  He ended up confining her in their house for days and beating her because she had talked to a guy she worked with outside of work hours…. \n\nShe left him, but it was severely messy, and took literal years to uncouple herself from him because he inserted himself in all aspects of her life. He was able to date and move on, but she couldn’t because in his mind he ultimately believed she “belonged to him”. \n\nThis behavior is so scary! Be safe!!",
            "You can't fix him. He won't change. Nothing you do will ever be enough to \"fix\" him. I had an abusive ex who did things like that, so \"see what kind of person [I am].\" He'd grill me over things I said as a teenager. He stopped paying his phone bill and made me share my phone with him, and he almost always had MY phone. He isolated me. He turned everything I cared about on me. I still have a hard time putting makeup on because anytime I put any on, no matter how little, he'd say I looked like a clown and kept making fun of me until I'd be ugly crying and washing my face and then turn around and say \"I was just playing. You looked nice! Why'd you take it off? \" \n\nI ended up leaving that relationship in an ambulance and a lot of trauma. It's been 10 years. I'm in a good and healthy relationship now. I had to do a lot of therapy and stuff. I didn't date for a long time after my ex because of fear, and I wanted to heal first before moving on. Life is too short to be with someone who doesn't love, appreciate, and respect you. Though, I have developed a \"you deserve what you put up with\" type of attitude towards things. Like even with myself. With work. With relationships.. whatever. This isn't love. You need to break up and do some self-healing and reflection to figure out what got you here.. and what you want in life and love, and where you want to improve, develop and grow. \n\nI can offer some advice in private if you like. I'd also like to warn, leaving crazy is really hard and can be like trying to quit heroin. So you might relapse, you'll feel sick. You'll feel bad. You'll feel guilt. You'll feel anger and disgust. But you can get through it.",
            "He's showing you who he is. Believe him.",
            "The answer is to tell him to get out. Call the police if you have to. There is NOTHING even normal or even forgiveable about it.",
            "Honestly you should have ended the relationship the first time he showed you that he doesn’t respect your right to say no to him, but it’s better late than never! Counseling would just be a waste of time here bc he isn’t going to change.",
            "It will only get worse. Look ahead 10, 20, 30 years of boundary violations and grilling you any time you’re 5 minutes late getting home (or worse he might put a tracking app on your phone). Guys like him don’t change, they only seek more control and will push harder.",
            "Run, don’t walk. He’s. Creep.",
            "That's not okay. Since he's likely logged into your accounts and is reading this, he needs to read that as much as possible.",
            "I married a man just like this, and the constant paranoia or intrusions only got worse over the years. It took years of therapy after the divorce to feel safe again. He would find something like your bf did, and concoct some awful story in his head and accuse me and keep me up until the wee hours of the morning grilling me. I got to where I couldn’t fall asleep next to him until I could hear his breathing change and know for sure he was asleep, and not just laying in wait. \nCouples counseling only made it worse because my ex was super charming and intelligent and was able to convince the THERAPIST that he was the abused one, and I was always too afraid to speak up in sessions when he was present.",
            "What redeeming qualities does this man have that are making you consider staying in an abusive relationship?",
            "That is psycho shit. A red flag across a football field",
            "That's insane, a dude that's basically 50 years old shouldn't be acting like that unless he has serious problems and even then, you could do a lot better"
        ]
    },
    {
        "post_id": "a3iaw9",
        "author": "Claefer",
        "title": "UPDATE: (Previously) Struggling to date with invisible illness",
        "url": "https://www.reddit.com/r/relationships/comments/a3iaw9/update_previously_struggling_to_date_with/",
        "score": 2764,
        "num_comments": 107,
        "created_utc": 1544054704.0,
        "selftext": "Link to previous post: [https://ud.reddit.com/r/relationships/comments/585pwu/me\\_25f\\_struggling\\_with\\_dating\\_with\\_an\\_invisible/](https://ud.reddit.com/r/relationships/comments/585pwu/me_25f_struggling_with_dating_with_an_invisible/)\n\n&#x200B;\n\nMy last post 2 years ago about dating with health issues got quite a bit of attention (thank you reddit so much for the moral support and great advice, it really helped me feel less alone!)\n\n&#x200B;\n\nI was in two minds about whether to post an update here or not, but I know that when I was all cut up about my invisible illness affecting my dating life it was really hard to find success stories where people met their partners AFTER diagnosis. So I’m posting it just in case even one person in a similar situation gets the moral boost they need.\n\n&#x200B;\n\n2 years ago I was really struggling with both my mental and physical health. They both spiralled off each other (as invisible illnesses tend to do, unfortunately) and it was really hard for me to improve the home life situation that was definitely not helping matters. I love my grandparents to bits, and I’m very grateful for all the care they provided, but living in an isolated town in the middle of nowhere with only them for company made it very difficult to meet new people or do the few activities I’m still able to do.\n\n&#x200B;\n\nMoving to somewhere bigger and with a population closer to my age has definitely been a big factor in improved dating success. It sounds obvious, I know, but it’s not an easy thing to uproot when you’re disabled. But if you’re isolated and find it hard to meet people because there’s nothing to get out the house for, it’s such a boost in quality of life. Now there are places to go and do things/meet new people. There are actually people my own age there to meet!\n\n&#x200B;\n\nMeeting people in person also made it easier to have that conversation about my health more organically and casually; preferably after they’ve got to chat with me and know me a bit first too. Online dating works for some people, sure, but I think it’s way less stressful getting to know someone as a friend first and hang out in person without pressure instead of meeting up with a stranger and wondering whether you’ll even want to sit through the whole date (and stress is of course a health trigger). I know I certainly didn’t have the energy needed to sift through the numbers game that is online dating – I know some single friends who would have one good date for every ten or so dates through apps.\n\n&#x200B;\n\nI met my current boyfriend at a board games café. Somewhere I could get out, but that wasn’t too taxing (sitting down is a lot less taxing on my pain and fatigue than active sports for example). We got chatting, became friends pretty quickly. He was super oblivious to all my definitely-not-subtle flirting attempts, so at first I figured he just wasn’t interested (especially as he knew about my fibro). Turns out he was just very shy and not wanting to misread anything.\n\n&#x200B;\n\nWe’ve talked about my health and he knows he can ask my any questions he wants about it. But honestly, he’s been really amazing and understanding about it in a way I never thought anyone would be. He pre-empts issues before they even have a chance to come up (noticing if the heating turns off too early and grabbing a blanket because he knows the cold makes me worse) and mentally plans out our time together around “Well if we do this on that day, we’ll have a chill day in the next day because you’ll be exhausted”.\n\n&#x200B;\n\nIt’s still relatively early days, but I wanted to let fellow spoonies know that there are people out there who don’t freak out at health conditions. There are so many support groups and articles online from the perspective of dating/married life when you’re already together and get the diagnosis, so someone’s already invested and supportive. The amount of times I’ve heard “I don’t know how I’d cope without my partner” has been so demoralising as a single person who struggled to find anyone.\n\n&#x200B;\n\nSo, for anyone who’s going through a hard time right now with their health, or struggling with being single – don’t give up! Do everything you can to create opportunities for you to meet new people, or even just leave the house with friends and ask them to invite some of their friends you haven’t met yet. It’s scary, yes, and it might be a narrower scope on what you’re physically able to leave the house and do, but even something low key like going to the library, a café, a book club, etc is a good place to start.\n\n&#x200B;\n\nTl;dr: After struggling with dating since my diagnosis of fibromyalgia, I’ve successfully been in a relationship for a couple of months now and am super happy about it!\n\n&#x200B;\n\nEdit: Wow, this blew up so much more than I expected! I'm happy it's made an impact on so many people though, I'm getting so many lovely comments and messages :) I also got my first ever Reddit Gold, so thank you to whoever gifted that! ",
        "permalink": "/r/relationships/comments/a3iaw9/update_previously_struggling_to_date_with/",
        "comments": [
            "I really like this post. You seem to be in a much better place now and with so much life to live and do. Good for you :)",
            "I was super worried to tell my SO at first but quickly realized honesty is the best policy. I have lupus/ra/fibromyalgia and am so lucky to have him by my side. I never wanted to be treated as a sick person, which previously happened but needed extra support during bad times. My now fiancé has a good mixture of treating me like a normal person but is so caring and helpful when needed. \n\nWe’re getting married in 39 days! Best of luck to you and your SO. ",
            "This is such a positive update. Thank you so much for sharing! Your bf sounds sweet and I hope things continue to go well for you two. I'm so happy for you! ",
            "Thanks for the update! I have fibro too so I love hearing success stories. ",
            "My husband has fibro. I’ll tell you from the other side, it sounds like you’ve got a good one! I do similar things for my hubby. \n\nGentle hugs for you! Hope you’re doing okay with the changing seasons. ",
            "I have Fibromyalgia and almost every spinal problem you can think of and arthritis Everywhere! I live in an area of the country where the weather changes constantly. The barometric pressure changes kill me, as I'm sure many of you can understand and relate to. I also have clinical depression and generalized anxiety. Don't I sound like somebody you'd want to be with?\nBut I'm blessed and lucky beyond belief. I've been with my fiance for over 7 years now and he checks the weather to let me know when fronts are going to be moving through, he does just about anything I ask of him, and he constantly asks me what can he do for me. Especially when I'm having a really bad day. \nWe met online, took things really slow getting to know each other and honestly, I didn't think he liked me as anything more than maybe a friend. (Apparently I'm really dense when it comes to realizing that someone actually likes me ... But hey, he put a ring on it over a year ago!) ;)\nThere ARE good people out there. That special person for you will love you for you - faults, flaws, and all. I had all of these issues before I met him. Some ex's think I'm \"too high maintenance\". My fiance doesn't. He gets that I'm not \"normal\". He's amazing and I know I could live on my own but it really is wonderful to be with someone who gets it. He never doubts my pain even though he can't see it. He never makes me feel less than for all of my \"problems\". It's amazing to be with him. Period.\nI lost all of my \"friends\" over the years from backing out of plans at the last minute so many times. But it's hard to plan in advance because you never know what your day is going to look like when you wake up in the morning. As much as I miss having my group of friends to hang out with, I'd rather not be around people who simply cannot grasp what my life is like and be understanding about it. I miss them but I don't miss the negativity from them. And in that way, I'm much better off.\n\nTldr: don't give up hope. There are people out there who understand and care.",
            "I alos have Fibro(and Lupus, Sjogren's, and RA) girl I feel you. I'm so happy you found someone who takes everything into consideration. I dated a guy whose mom had Lupus and we broke up because he thought that taking care of me when I had flares meant I needed to do his laundry and cleaning his apartment for him. I've been with a guy for 3 years now who didn't know what Lupus was when we met and he really looks out for me when I get sick. The good ones are out there :)",
            "As someone with a whole host of issues that will ultimately lead to my death before a partner, I was in a very similar spot. I did find the most incredible, kind, gentle, caring and loving human I could possible hope for. We got married this September in Iceland. ",
            "Hey! I wasn't around for your last post but congratulations!!! I have a couple of friends who have fibro and they've definitely told me how nice it is to find people, not just significant others, who understand how it is for you. Best wishes and I hope your relationship continues.",
            ">he was just shy and not wanting to misread anything\n\nI feel personally attacked.\n\nOn a more serious note, OP, I remember your original post quite vividly. My invisibilities (heh) aren't nearly so frustrating to deal with, but I was inspired by your persistence and got over some of my own hold-ups that were sourced from health problems. I'm super happy to see an update and see that you're doing well :)",
            "This is really inspiring!!! Thank you for sharing this - and congrats!",
            "Awesome update and I'm so happy for you! I have nerve damage. My fiance is amazing at helping me when I have days I hurt too much to be useful. Sometimes I worry he will find it too exhausting and I warn him that I'll never get \"better\" fully and he just replies, \"The only frustrating part is when I feel like I can't do anything to help.\" So, we focus on finding ways he can assist me and help me manage stuff (even as simple as taking a walk for strength building or standing outside the shower if I'm weak and wobbly), and we both are happier because we feel empowered and proactive! I think finding ways to exert some control over your condition helps so much with the helpless feeling and with mental health. It's a bit scary to admit where you're weak and to rely on someone else, but our relationship is all about teamwork, so we find ways for me to help him as well, which also helps me feel empowered and useful. :)",
            "I'm really happy for you as a fellow spoonie. Your boyfriend reminds me o my dad with the oblivious thing. \n\nMy dad actually  had UC before he met my mom. When he realized they were getting serious, he told my mom, \"Sometimes I shit my pants and it gets worse. If it helps, I can do my own laundry.\" \n\nThey've been married for 30 years and still act like PDA-loving college kids. ",
            "As a visibly disabled person with CP (cerebral palsy), this post makes my heart so happy! All I ever hear are nightmare stories about dating while disabled, so it’s nice to know good people do exist. Best wishes for continued success in your relationship!",
            "There's this adorable couple on YouTube. One girl has POTS, hearing loss, and iirc she's blind in one eye. The second two are due to a hereditary condition, and I cannot remember when her POTS showed up, but I think it was before she started dating her wife.\n\nThey're so adorable and they've done a few videos on what it's like for her living with an invisible illness, and what it's like for both of them as a couple.\n\nThere are definitely good people out there who will love us spoonies :)",
            "Thank you for sharing this! I was diagbosed (dismissively) with fibro around the time I met my husband and it took many years before my doctor found the underlying muscle disorder and I could get actual treatment, but he's always been wonderful. His mom has chronic pain so a lot of things were just obvious for him, like checking in on me and automatically carrying my bags and stuff like that. I feel a lot of guilt for not being able to do my share of the chores a lot of the time, especially when I'm working, but he never guilts me for it. I'm glad you've found someone great too ❤",
            "His mother says she doesn't believe fibromyalgia is \"a real thing\", that it's all in people's heads. For years that made me so angry. Now, I just don't care what she says or thinks. She doesn't pay my bills and I'm a grown woman. I'm not intimidated by her and I hold my own with her. I don't know if it's because her son and I have been together for so long now or if she's mellowing out as she gets older or if maybe by not cowering to her, I've earned some respect - but she's not as mean towards me as she used to be.",
            "What a wonderful story to read. Thank you so much for sharing. It's so great to see hard times work themselves out!",
            "So glad to hear that you are doing well. I also have fibromyalgia so I am familiar with the pain and exhaustion that come with it, and I'm super proud of you for working hard to get out there and get social when it's just not that easy. Much love ❤",
            "Thank you so so so much for this update. fibro and lupus destroyed my relationship and I’ve been single for 3 years. This really gave me hope x",
            "I’m in a super similar position to you and this gives me hope so thank you fellow spoonie. I’ve dated a few guys and one I thought was great but who dumped me because among other things, he just thought I was lazy. \n\nI dated one guy who was great with my illness because his mother was severely disabled so\nHe really understood and it didn’t get in the way of our relationship at all. But we broke up a year ago and I have gone on a few dates and nothing has really gone anywhere. Then my condition got more severe and I wasn’t in a place where I could date anyone. Now I’m kind of ready to get back out there but god I’m dreading getting to know someone only to find out they think I’m just lazy or weak or faking it.  So this post gives me some hope. I’m really happy for you friend! Xx",
            "Great update! Everybody needs somebody most of the time. What is a spoonie? If it’s ok to ask that?",
            "I have Ehlers Danlos Syndrome and this means a lot to me just haven gotten out of an abusive relationship with a man who told me to my face my illness wasn't real and I was making it up. I've struggled a bit knowing that I'm not always going to be able to take care of myself and that a partner would have at least to be empathetic to that. I'm so glad you've found someone supportive to your pain. :)",
            "What a heartwarming update. I have Cystic Fibrosis (invisible illness represent!) and definitely struggle with letting myself be vulnerable because I feel I'll be disappointed (and haven't been proven wrong). Thanks for reminding me it may be worth it!",
            "What a nice post. I don’t even know you and I feel so happy for you. Thank you for sharing your story so that others in a similar situation may be able to find some hope and make positive change in their life. I wish you all the best :)",
            "Found my now husband 7 years after my fibromyalgia diagnosis. I also have bipolar. Didn't phase him when I told him. He's wonderful. ",
            "I didn’t see your previous post but just wanted to say that I’m so happy for you. Your partner sounds amazing ☺️",
            "I’m so happy for you. I have fibromyalgia as well although I didn’t start showing severe symptoms till I had been dating my now husband for three years. It is great you found someone so understanding and considerate! This is a great update! ",
            "I’m happy everything is going well for you. It’s kind of cool that there’s documentation of your change in mood and life outlook. \n\nIf you don’t mind me asking, how are you able to live on your own money wise without your grandparents ",
            "You sound amazing and so does your boyfriend.  Many people struggle to empathize with invisible illnesses.  It's great that he understands your personal context and makes adjustments accordingly.  I'm happy for your success.",
            "I’m so happy for you! As a teen with chronic illness this was really nice to read",
            "I have bad anxiety/ibs plus chronic pain and I feel ya. I've had boyfriends before my now-husbsnd who, at times, thought I might be faking how much pain I was in due to my condition(s) plus wrong medications. I never cared to try and change their minds but knew decent people usually try to understand. It just takes a bit longer to find someone mature enough. The struggle is real!\n\nQuick question though....why are you called spoonies? ",
            "There's this couple on YouTube that I love. Simon and Martina. They're happily married and traveling the world despite Martina having a serious, often invisible illness as well. She has Ehlers-Danlos Syndrome (EDS). I'm glad you're doing well, OP and I hope you continue to thrive personally and within your relationship. ",
            "Thank you for this, it was encouraging for me. I'm a spoonie too and I've been carrying around a very bleak outlook on my dating future. I'm so happy for you and your new boyfriend! ",
            "Thank you so much for this. \n\nI was just getting over a very painful divorce when I was diagnosed with a succession of three invisible chronic illnesses (including fibro). I’ve often felt that I’ll always be alone because no one will want to take me on with all my baggage (thank the ex for planting that seed while we were splitting).\n\nYou’ve given me hope and the courage to message a local gaming group about joining when the energy-sap that is Christmas is over. Thank you from one spoonie to another. ",
            "Brava. Kudos to OP! So heartening to hear a happy ending.",
            "Aww, this is a really nice update. I'm not looking for a relationship right now, but as someone with a chronic illness that causes fatigue as well (though not so severe), this is really heartwarming.",
            "This is an amazing and uplifting update! Thank you for sharing! Wish you both all the best!!!",
            "Thanks for sharing this. I'm sure it is incredibly encouraging for everyone who deals with similar issues. ",
            "I’m so glad you’re in a happier place!",
            "Im waiting for a fibro diagnosis, so this was a great post! Thanks!",
            "Congrats! It sounds like you have found a wonderful partner, and you seem so happy with life now.",
            "this is so comforting",
            "I love this so much! Your bf sounds amazing, I'm so happy you found each other <3",
            "Hey OP, I just want to say that you made this happen. If you hadn't been brave and put yourself out there, you never would have met this guy. So kudos to you. A lot of us, myself included, could stand to learn from your actions. :)",
            "Thank you for sharing an update! I am so so happy to read you’re doing well and your bf sounds amazing. \n\nI remember your post well. When I read it, I was just coming out of several years of suffering and isolation because of invisible illness. Your post and the comments inspired me to start thinking about dating. A few months later, I met the love of my life and now we’re engaged. ",
            "this is really lovely! as someone with fibro who's now dating someone dealing with their own chronic pain, it's great to see success stories <3",
            "Aww he sounds incredibly sweet!! I wish you two the best :) My best friend has fibro and hearing your update is very touching.",
            "Oh yay! I remember you and commented on your original post. I’m so happy for you and glad that you did an update❤️. \nI hope things continue to go well on every front. Best always!",
            "Congrats to you! If I had a chronic illness I'd probably just try and find someone who also had it, that way we could relate. May be easier said than done and things may have to be long distance for a while but that's what I'd probably do.",
            "Interesting, I read a woman's profile in a dating app who had the same condition and I didn't think of it as a red flag or turn-off. Maybe it was you, lol."
        ]
    }
]