[
    {
        "post_id": "4k29ag",
        "author": "jaspermydog",
        "title": "My [38f] SIL [32F] is upset that she named her son the same name as my dog.",
        "url": "https://www.reddit.com/r/relationships/comments/4k29ag/my_38f_sil_32f_is_upset_that_she_named_her_son/",
        "score": 2741,
        "num_comments": 796,
        "created_utc": 1463661652.0,
        "selftext": "My previous dog passed away last year. When I got him, I named him “Jasper” because he looked like a “Jasper”. When he passed away I was devastated. After several months, I got a new puppy and named him “Jasper”. I’ve grown attached to the name at this point. \n\n\nMy SIL just had a baby and named him “Jasper” as well. When she found out my dog’s name is also Jasper, she got really angry and upset. I’m not sure if it’s the hormones, but she completely overreacted and called me names. I got my puppy first and named him first. She never told anyone of possible names she was planning on for her son, so how was I supposed to know she was going to name her son the same name as my dog? I’m not sure what to do right now. She went on Facebook and ranted about it so most of my family knows about this mess. One of my cousins called me and laughed about it. It’s ridiculous right? I’m not a mind reader. How was I supposed to know she was going to name her son that? My parents love to see my puppy and they know that I named my puppy “Jasper” so she must not have told my parents or they could have warned her in advance. \n\nI’m not sure what to do now. I won’t be changing my dog’s name as that name is significant to me so don’t suggest that. My brother hasn't visited me in the past year as we live 4 hours away from each other. So I don't think he knew that I named my new puppy \"Jasper\" again. Personally I also don't really see what's the big deal either. So what if they share the same name? It's not a big deal. \n  \n**tl;dr**: SIL is upset that she named her son the same name I gave my dog. ",
        "permalink": "/r/relationships/comments/4k29ag/my_38f_sil_32f_is_upset_that_she_named_her_son/",
        "comments": [
            ">I’m not sure what to do now.\n\nWhat you should do now is nothing. ",
            "Tell her the puppy is extremely honored.\n\nEdit: feeling honored myself; tyks!",
            "[removed]",
            "Did your brother know that your first dog was named Jasper? I feel like when his son was born and his wife suggested Jasper he must have said something like \"Sister had a dog named Jasper.\" Is she only mad because her son currently shares a name with the new dog? I don't think it's a big deal either. ",
            "Why can't you understand how embarrassing this will be for the human Jasper? What if Puppy Jasper gets into the good preschool, and Baby Jasper doesn't? What if there's a mix-up at the factory, and Dog Jasper gets the foreman's job that Human Jasper has been busting his gut to get?",
            "My friend had a baby and named it Bentley. My dogs name is also Bentley. Well, little human Bentley *loves* sharing a name with my little puppy Bentley. My friend had forgotten the name of my dog, obviously, and at first she was like \"oh my god I named my child after a dog!\" But she relaxed when I pointed out that dogs also have human names. She also embraced it after human Bentley got older and loved that both of them were named Bentley. \n\nIt will pass. ",
            "Give your dog the same middle name as your nephew.",
            "She will deal eventually. Do nothing. \n\nAnecdotally related: When my sister met her now-husband, then-boyfriend, our family dog had the same name as him. It was never a problem because he isn't an egomaniac. It can work fine.",
            "I think a simple \"I have had a dog named Jasper for X years and will not be changing his name\" should suffice. ",
            "What you SIL doesn't realize is that kid is going to love that dog BECAUSE they have the same name. ",
            "Its not a big deal. shes either just a crazy lady to start with or its hormones. \nIt will hopefully blow over.",
            "FWIW, my sister's name is Molly (which was a common dog name in our area growing up).  My name was not a common dog name.  I spent a lot of time jealous that everyone named their dog after her, and no one named their dog after me.  Your SIL and the kid will be fine.  ",
            "Jasper is a better name for a dog than a person anyway.",
            "Maybe I'm just a bit of a bad person. But I'd just respond to everything related to this with a big laughing smiley and no elaboration.    \n\"So have you thought about what I said about the Dogs name\"  \n\":D\"",
            "\"I named the *dog* Indiana!\"",
            "[deleted]",
            "Tough shit for her. How did she and your brother not know your dog's name? I know my brother's dogs names and we rarely see eachother.\n",
            "Suggest alternate names for her kid, like \"Harpo.\"\n\n\nedit: Alternately, wait until the kid is old enough to talk, introduce him to the dog, and tell him that everyone on Earth has an animal twin that shares their name (preferably when mom is not around).",
            "You've had the dog named for longer, so if she doesn't like\nit she can choose a new name for her baby",
            ">One of my cousins called me and laughed about it. It’s ridiculous right?\n\nYes, you should rather rant that she named her child after your dog.\n\nBut seriously, just say that obviously it's a great name and there isn't anything anyone can be done about it now but if your nephew comes to visit he'll probably love that the dog has his name because little kids generally like animals and think that sort of thing is neat, and since you don't live close by other or visit a lot it isn't going to be confusing or anything.\n\nMaybe you should say Jasper-the-kid and Jasper-the-dog while talking to her to keep it distinct?  Or not, if it annoys her.",
            "I laughed out loud as I read the opening. Edit: that sounds pretty heartless because your first line is about your dog passing...oops, I meant the next paragraph just to be clear.\n\nIt'll blow over. Maybe she's freaking about something else but is using this as an excuse?",
            "I wouldn't say anything about it. The fact is, she knew that you had a previous dog named Jasper and chose to name her child that. You naming your puppy Jasper now shouldn't change anything. I'm kinda surprised that she opted to name her child a \"dog's name\" as far as it was known in immediate family, but maybe she just really liked the name. Now that you have a puppy named Jasper, it could be reinforcing (in her mind) that this name is a \"dog's name\" and not a baby name. \n\nThat isn't your issue to worry about, OP! Enjoy your puppy, enjoy your nephew!",
            "Just give her time. This will later be a funny story you all tell Jasper.",
            "I named my dog Paul because he looked like a Paul. I also already had an adult cousin named Paul. No one cared. Paul my cousin sent the dog a tshirt that said \"Junior.\"  All was well!",
            "Why didn't your brother, when his wife suggested the name Jasper, say \"hey, my sister used to have a dog named Jasper.\"",
            "So we can all agree OP's sister-in-law is totally batshit and that OP's brother dropped the ball, right?\n\nBUT OP, YOU NAMED YOUR DOG AFTER YOUR DOG? Isn't it weird to have THEM have the same name??!? Is that just me? I think it's weird. You tell a story about Dog that's set literally ten years ago, and isn't that confusing when your Dog is only two years old? It's weird, right?",
            "I also have a dog named Jasper. Expect to hear from my lawyer.",
            "\"You named your son after my dead dog, and my current puppy. You're mad at *me*?\"",
            "She just had a baby. She's crazy from hormones, lack of sleep, and having her body ripped apart. She'll get over it eventually.\n\nSource: just had baby. Am crazy from hormones, lack of sleep, and having my body ripped apart.",
            "She owes you an apology for first calling you names and her attitude when you spoke to her, then secondly for trying to shame you on social media!\n\nIf I was you I would take a cute picture of your dog, post it on fb and say something like \"can't belive I've had this bundle of fluff for x amount of time!\" -obvioulsly longer then the little boy.\n\nLong term I think she will realise she has overreacted, I don't know if you'll get an apology out of her. I would leave it as its not a big issue them both having the same name. But that's for you to decide how you feel about how she has spoke to you etc.\n\nMaybe try dropping her a fb message saying you have never had any intention to hurt her feelings by naming your pup the same as her child and you did not know she was intending to call her son the same as your pup who was here first. You hope that you can be friends and move past this.",
            "You do nothing.  You've done nothing wrong and there's nothing you can do to change the situation.  Let her be pissed about it, let people talk about how weird it is, and just don't get involved and wait for it to pass.",
            "She's making herself looks nuts.",
            "Claim that the dog has a different last name, so it's fine. Unless she named her child Jasper McBarkington too.",
            ">  I got my puppy first and named him first\n\nYou should be mad at *her*.",
            "<<She went on Facebook and ranted>>\n\nOf course she did.",
            "[deleted]",
            "Two words: Indiana Jones.\n\nI mean, come on, the kid is probably gonna think it's great him and the dog have the same name.  Little kids are cool like that.",
            "Friends of ours named their cat the same thing I was planning on naming our baby.  I asked them if they minded if I still used the name, since the cat and the baby probably weren't going to be I school together.  She said the cat would be honoured.\n\nShe'll realize it doesn't matter at some point. I think people get all caught up in thinking they are being original with baby names and then after awhile it doesn't matter anymore.\n\n",
            "Just play the \"I named it first\" card. For the rest of her life",
            "This is a huge mess and could tear your extended family apart. My advice is for you to rename your dog and suggest your SIL to rename her son.\n\nYour dog shall be called \"Jasper Number One\" because he came first. Her son should be called \"Jasper Number Two.\" \n\nIf you want to honor your dead dog, then that dog should be retroactively named \"Jasper Number One,\" your current dog \"Jasper Number Two,\" and her son \"Jasper Number Three.\"\n\nI think this way, everybody, including the dog, will be happy.",
            "Make a facebook account for your dog, get your family to add him and then put up a rant in your dogs persona about how your owners sister in law gave your name to some filthy little human. ",
            "Ask her to name her son \"Jasper Junior\"",
            "Do nothing.\n\nExcept laugh about it whenever your SIL brings it up. But do the laughing in private.\n\n=)",
            "It is ridiculous, she does not have the trademark on the name Jasper. She will just have to get over it, there are probably countless pets and humans who share the name Jasper. Just don't pay any attention to her whining, don't feed into the drama of it all, and eventually she will realize what's done is done and hopefully get over it. ",
            "I mean, my mom named my little brother after the dog she had growing up.\n\nShe denies this. But there's no other place that name really came from",
            "It was the right thing to do to not use the real name in the post, but I am dying to know what it is.\n\nI named my child a name which I found out later is used for a lot of dogs. I discovered there was a toy poodle on my same block with that name. It wasn't a weird name or anything; there were four girls in her kindergarten class with that same name.... and a lot of dogs. I ran across a baby names book when she was a toddler that said this particular name was having a popularity boom among overeducated, urban mothers.  The book should have also clarified that popularity boom extended to dogs as well as babies.\n",
            "Create a facebook page dedicated to your dog and invite your SIL to 'Like' it.",
            "Ignore her and share in the laughs. She's being new mom hormonal, but still ridiculous, and it sounds like everyone knows it. Also sounds like you aren't that close, so sharing the same name as his uncle's dog won't really impact the kid's day to day life. \n",
            "Aww - but think of all of the Jasper and Jasper themed holiday cards! \n\nHonestly, I'm sure she'll get over it. It's not like the name's lost its importance because there's one more Jasper out there. ",
            "This is the greatest thing I've ever read in this sub.\n\nTell her to shut up. \n\nGive Jasper a treat too.",
            "My friend named her daughter Bella and that is my dogs name. Was on a walk and bumped into her one day and my dog walked off so I was calling her and the little girl Bella (1 1/2) was just staring at me because I was shouting her name! My friend was just like \"oh, I named my daughter after your dog didn't I?!\" and started laughing. When Bella learned her name was the same as the dog she was thrilled and wanted to play, so I thought it was cute :) \n\nI bet Jasper would feel the same when he gets older.",
            "What a boring name for a child. You should suggest something much more interesting and manly, like Beef Squatthrust, Slab Strongmeat, or Sledge Hammersquats.",
            "Bitches be crazy",
            ">One of my cousins called me and laughed about it. It’s ridiculous right?\n\nI laughed too. It's totally ridiculous. So my Jack Russel is called Jack. So all People names Jack should be offended?\n\n>So what if they share the same name? It's not a big deal. \n\n100% agreed. It's nothing.\n\nI would be more worried about you SIL. She sounds like a tyrant with her demands. Now everyone must obey her? F that.",
            "Do nothing. If this is out of her character it is probably just the crazy hormones. Hopefully she will level out in a few months and laugh with you about how crazy her reaction was. ",
            "I hope she realizes that no matter what she had named her kid, there is a 100% chance that there is a pet somewhere in the world that also has that name. I'd be honored to be named after a dog.",
            "She sounds crazy as hell. I don't understand why it's your fault she gave her kid a dog name... I'd be a smart ass about it. I'd walk into the hospital after the kid was born and say, \"I am deeply touched that you're honoring my pet by carrying on his name. Thank you.\" ",
            "I was named after the family dog!who gives a shit,really. She can get over it, end of story.",
            "Why would this be something worth getting upset over? Just dumb! It's a dog and a baby. She needs to get over herself!",
            "lol.  Just lol.  Hopefully its hormones and she will get over it.\n\nDid they keep the name and big secret and thats why your parents didn't warn them?\n\nI think I would be mildly annoyed and then think it was funny if I was her.",
            "She's reacting in shame. She picked the name out and was proud of herself most likely, and then felt she should have been smart enough to have known the dog's name was identical, should have checked with you, should have talked about the name more publicly so this wouldn't have happened, etc. Whenever I do this 'scenario shopping' my friends say \"don't should all over yourself\". I'm not sure there's much you can do short of be empathetic to how she probably feels retarded about it and can't really let it out. A pocket of shame. Like a stuck fart. ",
            " > I’m not sure what to do right now.\n\nNothing. She'll either grow up and get over it or she won't. Either way not your circus or your monkey.\n\n> It’s ridiculous right?\n\nAbsurd. She shouldn't be mad at you for something you have no control over or for using something (a name) that didn't belong to her or anyone else for that matter.\n\n\n\n",
            "This reminds me of my aunt and her friend, who were pregnant around the same time, had due dates within a few weeks of each other. Neither of them talked about what they would name their children; they made decisions with their spouses and kept it private until birth.\n\nThey both named their sons the same name, and it's not an incredibly common name.\n\nThey both have a giggle about it on the regular and each boy got a nickname for playdates but it's one of my favorite stories.\n\nYour SIL is a drama queen, no one is going to mistake her son for your dog.",
            "Jasper is a good name for a dog... but seems kinda weird for a kid.",
            "Tell her the truth: 'Jasper' is a name for dogs. Dogs and cowboys.  And also cowboy dogs.  ",
            "Not your circus; not your monkey. Your dog, so go have fun with him. Love your nephew, who is probably going to end up with a nick name with a first name like Jasper anyway, and let her cool her tits.",
            "I once had a dog with the same name as a girl I later started dating.  I thought it was hilarious.\n\n*\"Who's ready for dinner?\"*\n\n*\"Oh yes! Where are we-\"* ...and then she'd notice the dog food can in my hand.\n\n-----\nOn a more relevant note, I would just start referring to your nephew as \"the other Jasper\" to avoid confusion.",
            "All the Sams and Maxs of the world seem to be alright.  I'm guessing  Jasper the human will be too (unless he inherits his mom's crazy), so she needs to chillax.",
            "\"My SIL named her firstborn after my dog.  I am honored, but she's upset.  Go figure!\"",
            "Does your family ever communicate?  I can't imagine a sibling getting a puppy and me not knowing its name and telling my SO about it.  Even if you don't talk to the SIL directly, I would think your parents would tell your brother and her. My brother also lives 4 hours away and I still knew he got a new puppy and what it's name was via parents.  Did you not share the new puppy with it's name on FB?  ",
            "Offer to change your Jasper's middle name? \"Jasper Dog Last Name.\"\n\nOr re-name your dog \"Puppy Jasper Last Name\" and he uses his middle name? \n\nYou call all your dogs Jasper...so this will be a problem your whole life.\n\nOr you could say your dog is named \"James Asper Last Name\" and he goes by his middle name and first initial \"J. Asper Last Name.\" You can even call out loud for him: \"J. Asper! J. Asper!\"\n\nP.S. WHAT HAPPENED TO YOUR BROTHER?? He didn't remember your always-dog-name?? Even if just your great old dog was named Jasper, it seems as if SIL might care.",
            "I thought it was more odd that you named the new puppy the same name as your old dog. You should at least give him a middle name and tack II after it. Jasper Fuzzyface II. \n\nYour SIL is being a nut and thankfully your family realizes that. I would just ignore it until it blows over.",
            "Gotta give the new mom some latitude here... I'm not saying change your dog's name, but definitely don't respond on social media.  Send them some food or some cute baby stuff, might help this whole thing blow over faster.  This sub has little patience for people acting unreasonably, but she's a new mom... if there is ever a time to give someone a break its right after they've pushed a watermelon named Fido out their vjay.",
            "Buy the kid a stuffed animal dog.  To jasper from jasper, with love. ",
            "There's nothing more you can say than 'I named my dog before your son was born and before I knew the name. I'm not changing it. '\nIf she calls you names, walk away or hang up ",
            "I feel sorry for the kid with the name Jasper. \n\nEdit: Realize you changed the name, and it's not really Jasper. Don't do anything, there is no way you could have known. ",
            "I think your sil might be suffering from ppd",
            "She's gonna have to deal with it. HAHAHAHAHA.",
            "Hey, that's my name! Your dog and her son can't have that name, it belongs to me! \n\nIn all seriousness though, it's a great name to have. It's pretty unique, even now, and people stop sometimes when they hear it and tell me what a nice name it is. \n\nShe shouldn't be worried.",
            "I'm betting on hormones. My sister went insane for a while after having a baby. I avoided her for 6 months after she gave birth, wrote her a letter and let her know I love her but I couldnt mentally handle it. \n\nI feel like we have never been close since and she hasn't forgiven me, but that level of crazy is hard to handle. Just ignore it and continue to do so for her next weird freak out. I do not suggest a letter and distance. It made it worse for me. ",
            "I think it's super adorable. Jasper & Jasper. They could be best buddies. When he's old enough to comprehend, it's going to take him like five seconds to decide that it's awesome to have the same name as the dog, especially if he knows the dog. Perhaps use cute nicknames to avoid confusion if/when he visits. Source: My mom first heard my name because that's what her friend named her dog. She thought it was pretty and decided to name me that. I'm not so much named AFTER a dog as much as a dog greatly influenced what my future name was going to be. I rolled my eyes about it in high school but never really gave it more thought than that.   \nTL;DR - My name was directly inspired by a hound dog. It has had little effect on me as a person.",
            "Start calling your nephew \"Junior\" vis a vis Indiana Jones.",
            "SIL \"What do you think about the name Jasper?\" \nBro \"That's Sis' dogs name.\"\n\nSeems as you've had, now 2 dogs with the same name, you'd think it would of been brought up in conversation when choosing a name? ",
            "Tough nuggets for your SIL. ",
            "Firstly, I don't know why SIL would be getting upset about the baby having the same name as your dog in the first place. If you google the name \"jasper\" it's highly likely a lot of other animals and criminals and unsavoury people have the name, too. I've got to hope it's just hormones; pregnancy hormones/breastfeeding hormones they do crazy things. I would cry at things that normally didn't upset me and laugh at things that I normally didn't find too funny at the drop of a hat, and you get super over protective and irrational about baby's future (like, oh my god, my kid has the same name as a dog and everyone is going to find out and all the kids in preschool will know and laugh at him and we will have to move and change our names ect). \n\nSo, in no way is this your problem. Baby has the same name as your dog, and the dog that passed. Even if new dog had a different name baby is still named after a dog :p",
            "I had a dog that had an awesome name. She was the best dog ever and I loved her name a lot.\n\nWhen I had a daughter, years after my dogs passing, I named my daughter the same name! I know own it's kind of fucked up, but this just happens to be the best girl name ever. What could I do? \n\nMy family laughed and thought I was a lil crazy but I think they understand now 😊\n\nAnd yeah, your SIL is a nuts. Just give her some time and I bet she'll feel silly once she's off the hormone super highway.",
            "yes! Hormones. You nailed it, give her a bit of time. She's upset with herself and being unreasonable. Did you not introduce Jasper on Facebook when you got him? There's you mistake. Always put every little detail of your life on Facebook or you'll totally upset people  ;-D",
            "I have always wanted to name a dog after my SIL so maybe for the next one you can go that route.  \r\n\r\nI don't think there is a solution here other than giving her time and hopefully she'll be able to see the humor in it. At the end of the day this really is a non issue.  Think about all the people who name their dogs and daughters Bailey.  The Bailey's of the world seem to be doing just fine.\r\n\r\nAlso would like to add, just because I think it's funny, that when my mother left for college her parents promptly got a dog and gave it the name Betty which just so happened to be my mother's nickname growing up.  They even let the dog eat at the table in my mom's spot. Its a great family story and everyone my mother included still laughs about it.",
            "LOL it's the hormones. No one could be this ridiculous unless they are mentally ill. If she doesn't have a mental illness, chalk it up to the fact she just had a baby so is a bit out of whack. She'll likely get over herself in a few months and laugh about how crazy she was.\n\nThis is just so silly...at any rate didn't she know your previous dog was named Jasper?? So if anybody looks like a weirdo for this it's her, because who names their kid after their in-law's dead dog?? Nobody, that's who, but if anybody in this situation has the 'right' to get pissy and feel ownership over this name it would be you.\n\nETA: and WTF is up with your brother? You would think he would tell her Nope we're not naming our son Jasper, my sister's dog that just died last year was named Jasper. IDK it seems so strange that they would even consider the name in the first place...",
            "You do nothing. Whenever she brings it up ask her why she's making an issue out of it. Then refuse to discuss it because it's fucking ridiculous.",
            "I laughed at this one.  Your SIL is being ridiculous.  If you want to fan her flames, post a timeline on your facebook that goes all the way back to when you got your first dog and named it Jasper.  Then put the date when you got your new dog and named it Jasper.  Then post the date your SIL had her baby.\n\nThen just drop the whole thing.",
            "Not only is this puppy named Jasper, but your dog before this one was named Jasper. How could they not have known?",
            "Bring your jasper to family holidays and have him take pictures with your parents (his grandparents). Then send these pictures out as Christmas greeting cards. ",
            "tell her to not give her kid a dog name (see: molly, bella) ",
            "Suggest your SIL to use a shorter name for her son like Jay & let Jasper remain on documents only.",
            "Tell her that you can't wait to start a wacky YouTube channel devoted to Jasper and Jasper's hijinks.",
            "I never use my dog's proper name \"Frank\".  When I refer to him, I use the sound \"ffoufouck\"  which is what the neghbors kid says when she see him.. She is a baby.  He likes \"FFoufouck.\"    \n\nI have had over 10 dogs and they all have nickname.  \n\nSo...... give her baby a nickname.",
            "There's nothing to do. The kids will think it's cute!",
            "Nothing to do.  Move on.  ",
            "It's not a big deal. When I was a kid (around 5 or 6) and we were adopting our dog, I found out that the mother dog's name was the same as my own. I thought it was super cool that my dog's mommy had the same name as me, his new mommy. \n\nKids don't GAF. :)",
            "Does your sister-in-law understand the timeline of when your dog was named and when her child was named?\n\nDid your brother have prior knowledge of Jasper 1? Because I would never name my child after a dog or cat that my family members or I had previously owned.\n\nI will not be naming any of my potential, future children Daisy, Frank, Libby, Yellow Cat, Gray Cat, Pete, Bernie, He Man, Teela, Art, Maggie, Lucy, Annie, and whatever my sister's current dog is named. ",
            "You can just look at the multitude of other /r/relationships posts about people that named so-and-so this and started a bunch of drama for ideas",
            "My dog (2 years old) is named Kevin, much to the chagrin of an old family friend of the same name.  He handles it semi-well, mostly ignores it, and life goes on.  His wife laughs about it, actually.",
            "If she's still postpartum (8 or less weeks since birth), she's definitely hormonal.  Don't *tell* her that, but just giggle about it and let it go.  She'll either come to her senses later and giggle about it too, or not.  Either way, no skin off Jasper's back.",
            "You should get matching sweater for your dog and her kid. 10/10 would love to see that",
            "This is ridiculous I would comment on her fb post and tell her she's being ridiculous and that was your dogs name first. I would too, embarrass her ass.",
            "I heard of stories on /r/childfree about moms wanting strangers to rename their dog because they share the same name are their snowflakes (the name in question is Sage. Who the fuck names their kid Sage?)\n\nIf she's that upset, tell her about all the dogs named Jasper in the world and how if she can make every owner rename their dog in the world than maybe you should too ;)",
            "I totally wanted to name my son Jasper. I love it. My husband exercised veto power - insisted it was a dog name and that I could name the next dog Jasper. As an amusing coincidence.",
            "Tell her you are sorry that she is upset but that you both have two Jaspers to love now. ",
            "If she has such a problem with it, she can change her son's name.\nThere's no space in this world for people who try and get other people to fix a situation they themselves cause.",
            "My cousin actually asked for my permission to name her baby the same name as my dog. I was honored. Your SIL needs to lighten up. ",
            "She went on Facebook and ranted about it, eh? Can you copy-paste what she wrote?\n\nSend her and your nephew a nice card and/or gift and call it a day!",
            "When my daughter was born and we announced her name \"Rose\", Husband's cousins excitedly declared that they were about to get a pug dog (unborn at this stage) which they intended to call \"Rosie\". We were a little offended and said they should change the dog's name to something else. They refused.\n\n\nIt gets a little confusing at family gatherings when they suddenly scream \"ROSIE!!!\" at their misbehaving dog and my daughter jumps out of her skin, but we hardly ever see them so whatever. \n\n\nThey are arseholes and their dog will die in 10 years or less.",
            "Get another dog and give it your nephews middle name.",
            "Tell her sweetly that you're sorry she's upset, but it doesn't seem much of an issue to you.  You're 4 hours apart, how often with the two Jaspers even be together?",
            "She'll get over it once Jasper becomes a famous archaeologist.",
            "Don't do anything. Except tell her that it was 100% her fault for not telling people the possible name of the kid. If she wanted it to be secret or wanted to avoid people telling her \"dont do that\" then she should've been aware of the fact that there's going to be a chance that something is wrong with the name.\n\nShe should've checked. Also, your brother should've said something too.\n\n\"SIL, you have no right to call me names when you named your child after my dog. Fuck off.\"\n\nOr in nicer words maybe.",
            "This is not actually your problem at all. At. All.\n\nLet her have fits, don't let her near your dog, and be ready to laugh with her when she comes to her senses.",
            "\"We named the DOG Indiana!\"",
            "Tell her she's the one that picked a dog name for a person.",
            ">I won’t be changing my dog’s name as that name is significant to me so don’t suggest that.\n\nDamn right youre not changing the dog's name. Tell her to get fucked, and whenever you're in her presence refer to your dog as Jasper Sr. and her son as Jasper Jr.",
            "My cat's name is Jasper, it's a great name, fuck it. Let's all be Jasper. ",
            "Pretty sure your puppy is also going to be raised better than her son. ",
            "It sounds like she just had a baby. If she is postpartum I would just ignore it. \"I understand your upset. I am sorry.\" She is hormonal and sleep deprived and just learned she named her boy after a dog. She is devastated. My parents tried to give my child a nick name postpartum and I cried and shook from anger. 2 years later they always call her that nick name and it is no big deal. Postpartum my mom had to yell at my dad to stop because I was about to have a mental breakdown. It is not uncommon for a new mom to become unreasonable with her childs' name. The worst thing you could do is tell her she is being unreasonable or try to be right.",
            "Hahahaha, your SIL is being dumb.  She doesn't own the name and you've been using it for well over a decade anyway already.  It's not your fault she just happened to choose that name.  Honestly Jasper seems like an odd name for a kid anyway.\n\nShe has no reason to be mad at you and yes it's ridiculous.  Tell her tough shit in the nicest way possible and move on.",
            "It's okay. Kids only live to be about 14 years of age",
            ">My brother hasn't visited me in the past year as we live 4 hours away from each other.\n\n\nMaybe it's just me but that seems a little strange, unless you guys just aren't that close (I used to live about 4.5 hours away from my sister and we saw each other almost once a month). In which case it's *really* not a big deal and your SIL is probably just hormonal and sensitive right now.",
            "Similar situation.\n\nMy mom has a tiny tea cup chihuahua that she got when I was a sophomore in high school. She named it Mia. \n\nSeven years later, our cousin has a baby girl and names her Mia. It  decide not to say anything because we're not that close to our cousin and there's no point in the drama. \n\nWhen She brings the baby over to grannys, where me and mom are living as her caregivers, we put Mia the dog in the bedroom and shut the door. She has a treat, she's quiet, no biggie. \n\nWell one of the other kids went snooping in the back of the house and the dog escaped. Being so tiny, everyone fawned over her and wanted to know her name. I was about to say Peanut, cause she's tiny and it would work, but my mind mother the raging drama queen narcissist, looks my cousin in the face and says the dogs name is Mia and walked away. \n\nMy cousin starts bawling and screaming that my mom named the dog that on purpose - because they hate each other - and everything is ruined and we had to change the dogs name, etc.\"\n\nI told her \"Jane, the dog is seven fucking years old. That was her name when we got her as a puppy. We're not changing her name after seven years because you chose the same name. Get over it.\"\n\nSomething similar said to you SIL seems in order. ",
            "She's being completely crazy. If she confronts you or anyone else does, make it clear that your dog has always been named Jasper and it was no secret. If she doesn't want her child to have the same name as his aunt's dog, that's on her.",
            "BAHAHAHAHAHAHAHAHAHA!!  She's an idiot, let her get over it.",
            "Your SIL is clearly insane. Who the fuck names their son Jasper? ",
            "This is not a big deal.\n\nThe kid isn't even born yet, so if it really bothers her that much, she can still change the name. Don't worry about changing your dog's name, I don't think anyone would expect that ... especially since you don't even live in the same area.",
            "This...isn't a problem.  ",
            "I had an aunt who had a dog with a similar name to mine (change 1 letter but pronounced the same). I gave approximately zero shits except when she decided to bring it up EVERY SINGLE TIME I saw her. Like stop, I get it, how nice for you. But I agree with the sentiment of do precisely nothing.",
            "There is literally nothing for you to do here. This is her mistake which you had no part in, you have nothing to apologize for. She just needs to deal. ",
            "Tell her \"Indiana\" Jones was named after the family dog.  This revelation comes out in The Last Crusade. \n\nBut seriously, shes got no leg to stand on.  She should be mad at her husband if anything because he had to know your original dogs name was Jasper.  So even if that dog wasn't alive anymore and you didn't have the new puppy, she'd still be pissed he knew and used a name that he knew was a family dog name.",
            "My dog that I've had for eight years is named Cooper and there's a Cooper in my daughter's first grade class. They're great pals, Cooper's mom thinks it's awesome that her son has a friend with a beloved dog with the same name. \n\nI guess what I'm saying is that your SIL is being super irrational. Maybe give it time, she might be really hormonal and will maybe eventually see that she was being unreasonable. Hopefully.",
            "I like the name for a puppy, not so much for a child. ",
            "Have you discussed her reaction with your brother?",
            "I'd just get on FB and explain it as you did here. The dog was named long before her child and she has no right to be upset or call you names. Then ask her if she had even heard of your previous dog that passed away and why she chose to name her child after a dog. Seems to be her problem, not yours.",
            "I think a kid would think it cool to share a name with a dog in the family.  Let the dust settle and then explain that you were honoring your old dog. ",
            "I don't know why she is upset, to be honest. This is facebook gold. You can visit your brother and nephew more often, and photos of \"Two Jaspers Playing\" will get more likes than she could shake a stick at. (Plus you can double dip on r/aww for frontpage glory).",
            "I feel like I'm obligated to comment here. :)",
            "I would actually go as far as to send her the link to this reddit post and let her check out the responses for herself.",
            "Woops, her bad. \n\nGive her a chance to come down from the pregnancy hormones and see if she sees reason then. Maybe then you can all laugh about the situation.",
            "They live 4 hours away from you?  It isn't like you'll see each other.  ",
            "This is probably buried but I have the same name as a second cousin of mine. I was born first but her mom is good friends with my mom while also my dad's cousin. Everyone eventually got over it. I've never experienced any bad blood from anyone about it. My mom's friend supposedly always wanted to name her daughter this name but who knows. Jasper is an odd name and you already had a dog with that name in the past, if your dog and her baby were named Michael or Kyle or Pete, or any more common dude name would she still throw a fit?",
            "So she doesn't know you well enough to know your dog's name, but well enough to get mad she named her son the same name as your dog?\n\nWhat??",
            "This is hilarious, because it just happened to me with my friend. We got a dog and named her Sally*, and a few days after we announced it, my friend told me that was her super secret lifelong #1 baby girl name, and we should change the dogs name. Mind you, this woman is 5 years out from having children at all.\n\nI refused, because it was already too late, and she whined about it to anyone who would listen for like 6 months. Fortunately anyone who would listen pretty much thought she was nuts. It fizzled out but it was tense for a while. \n\n2 years later, I am close to having kids, and she has a new favorite baby name that she has not-so-subtley brought up to me several times. Like, girl I didn't steal your name maliciously!\n\nPeople get crazy about this stuff. I think it will die down, but I wouldn't be surprised if it takes until the baby is born and named and like, in 3rd grade.\n\n*name changed to protect the innocent ",
            "What about naming your puppy Snorlax? Maybe your SIL will name her son Snorlax too.. \nI like Snorlax haha.",
            "In the Bronx, we'd already be shortening the dog's name to Jass or Jazz, because we're on a first-syllable basis with those we love. If you want to make her feel better, tell her that that's what you're doing. This would be you rising way above her over-the-top stupidity. She's really mad at herself for making a dumb mistake.",
            "Jasper is a dog name",
            "My name also happens to be that of a \"famous\" dog but you don't see me bein' a bitch about it. Sure, the jokes get old but I'm not offended. \n\n\nTons of dogs have people names. Your SIL is being nonsensical and you should just do nothing. ",
            "Indiana Jones was named after the family dog-- look how awesome he is!",
            "Lmfao she sounds ridiculous,I feel bad for your brother. Maybe you should break the news to her there's millions of people and dogs all over the planet and I'm sure some of them share the same name",
            "Everyone will laugh about this eventually.  Just take the heat on FB for a while and it'll blow over when the new parents get some sleep.\n\nEventually that kid is going to LOVE that the dog has the same name though.  My daughter wants to name her impending baby brother after herself, kids don't have hangups about this kind of stuff!",
            "It seems like your brother should have told the SIL that your previous dog had that name.  Seems like it is his fault if he knew the old dog's name.",
            "So what are you supposed to do, change the dog's name?\n\nJust do nothing. Also sorry this is happening to you. It all sounds super, super annoying.",
            "Your sister-in-law is a moron. She is the one who named her son after the dog. Just ignore her.",
            "Tell her, if it's any condolence, the kid *should* outlive the dog.",
            "I named my first guinea pig Charlie because when I kept saying names, he started freaking out when I said it. \n\nCharlie was also the nickname for my maternal grandfather who died when I was 6. My mom was so pissed. I told her to look at it this way; I named something that I loved with all my heart and soul with the same name as her father. People get pissed like pets aren't people. \n\nPlus, wasn't your previous dog Jasper, so isn't she the insensitive one for naming her son after your dog who passed away?",
            "I'm giggling out loud\n",
            "My aunt and uncle named their son in honor of my aunt's late father. They really liked the name, and they had already named their dog that, but they went with it anyway. So they just called them \"[name]-dog\" and \"[name]-baby\" or \"[name]-boy\" and now they mostly just call the dog \"dog\" or other nicknames. \n\nIf they can handle naming their son the same thing as their own dog, your SIL should be able to handle naming her son the same thing as someone else's dog. I'd just wait for this to blow over. ",
            "WHO names their child Jasper anyway? seriously. that's on her.",
            "It's not a big deal. Has she always been irrational or is she suffering from post-pregnancy issues?",
            "I hope your brother visits sometime so the two Jaspers can be very best friends.",
            "Everyone's given the empathy and giggles..\n\nWhat you do is not much. If you have to look at the FB post, post \"Thanks!\" or something. \n\nPity her embarrassment and all, but it's not your responsibility to fix a damn thing for her (or feel guilty/ashamed/etc.). Hopefully she lays off the crack when her hormones recover.\n\nTake none of this personally.",
            "Whatever. If that kid grows up to be half as loyal and well behaved as a dog, then she's going to be happy.",
            "name the dog Jasper jr? ",
            "I got my cat Hallie after I met my wife's niece Haleigh. I didn't think it fair to change the cat's name because she was 4 when I adopted her and everyone agreed. Haleigh the human knows about the cat and loves that they share the same sounding name. ",
            "dude, my little brother is named after a dog mum had. her back then SIL (who had some kind of disability, the stay-a-kid-forever kind) named the dog a very human name, let's say luke. mum kinda went \"yeah, okay, we'll go with that\" because it's really not what she would've picked herself for a dog. 20 years go by, she has me, then my brother whose name gets chosen by my stepdad, and runs into the ex-SIL one day. she remembered me as a little baby, so when mum said she had two kids the ex-SIL got reeeally excited and asked what my brother's name was. she was SO HAPPY to hear he was named luke, and assumed it was because she'd picked such a good name for the dog. mum went with it, and she still believes it to this day. basically what i'm trying to say is that it's sometimes a funny coincidence, not a sign from the gods. even if some people might believe that.",
            "Yeah...this seems like a whole bunch of \"her problems.\" You should just live your life and don't pay her any mind.",
            "Believe it or not, I have been in a similar situation. When I was a kid, my aunt had a dog named \"Annie.\" My sister's name is also \"Annie,\" and my aunt's dog predated my sister as well. My mom thought it was funny, and Annie and Annie were very close until dog-Annie died. I can't imagine what is going through your SIL's head. I'd honestly just wait for it to blow over. It could be a hormone thing. It could be the exhaustion of having a new baby in the house. It could be anything. I would just try not to worry about it. ",
            "Honestly Jasper is better for a dog anyway.  Guy named Jasper conjures up images of the gold rush for me.",
            "I admit I didn't read the comments yet so sorry if this was already said, but...being your family, they must have known that your previous dog was named Jasper before. So technically, they already copied the name off a dog, right? \n\nMy friend had a dog named Jake. I like the name Jake (Jacob), so let's say I name my kid that.  Then I find out she has another dog named Jake now, in honor of the first one. So technically I already named my kid after her dog, it's not her fault!\n\nNote: I don't actually have kids, this was just to relate it. :) "
        ]
    },
    {
        "post_id": "etl7ge",
        "author": "dent_1sxt",
        "title": "My (28M) bf just drunk called me to tell me (25f) his ex moved on too quick.",
        "url": "https://www.reddit.com/r/relationships/comments/etl7ge/my_28m_bf_just_drunk_called_me_to_tell_me_25f_his/",
        "score": 2739,
        "num_comments": 409,
        "created_utc": 1579921468.0,
        "selftext": "I've been dating my current bf for a year now. We have been long distance since the start of 2018. He recently went back to his home country and on the second day of his trip, went out for drinks with his friends. His ex showed up at the club with her current  bf and since they haven't seen each other for more than a year, it made sense for the two of them to say hi to each other. One thing led to another and an argument started. My BF left the club feeling disappointed and too drunk of course. He gets to the house and calls me telling me how heart broken he is. As a good gf of course I ask what the issue is. Only to find out that his ex moved on too quick and her presence still hurts him. One year has gone to waste. Feeling really hurt. At this point I feel like breaking up with him is the only solution. You really can't be with someone who hasn't moved on. I really do love him very much but it's really hurts knowing that he still loves his ex. What do I do?\n\nTldr; My bf just called me to tell me his ex gf moved on too fast. Should I break up with him?",
        "permalink": "/r/relationships/comments/etl7ge/my_28m_bf_just_drunk_called_me_to_tell_me_25f_his/",
        "comments": [
            "I can understand having a sad drunk moment when you see your ex for the first time after a break up. It does seem like a lot though - you guys have been together for a year and he’s concerned his ex moved on too quickly?? Idk have a sober chat but be suspicious",
            "Have a talk with him when he is sober.",
            "Thank you all for your thoughts and insights.I will have a sober conversation with him. But right now, I need some time off for myself as it deeply hurts. Once again, thank you reddit",
            "I think you need to have a conversation with him about how he feels about his ex when he is sober and not hungover. \n\nLook, I’ve cried about some seriously dumb shit while drunk. I cried because my cat ran away when I was teenager and my new cat did something that reminded me of her. That doesn’t mean I want my new cat to be my old cat or that I’m still broke hearted about my cat from 8 years ago. It means I was sad about something that was a big part of my life changing and even now, years later, it was something that sucked. And breakups suck. Even if you’re over them. Seeing someone you used to love be over you can feeling like rejection, even if you don’t want them anymore. Especially if you’re already feeling drunk and vulnerable. \n\nIf this is something you can’t get over, than that’s that. But if you love him, talk to him. Find out if this is actually him pining over the ex, or if he just needed to be sad and she became the target for those feelings.",
            "Wait... dating for a year. Long distance since 2018? \n\nEither you had a break or the math is off.",
            "When I was around 18 years old, I had my first real relationship. We were together for quite awhile and went through a lot. In the end I realised that I wasn’t in love with them (although I did love them) and wanted something else. We broke up. \n\nA year later I met someone else who I fell crazy in love with, feelings I had never felt before (and when they broke up with me 2 years later it shattered my heart). However, a couple months after we started dating I found out that my 1st ex started dating someone new (someone I actually knew quite well), and although I knew it was bound to happen, it hit me like a ton of bricks. I started to cry. My partner at the time was there and asked me what was wrong and I cried and cried in their arms and told them how I was feeling (really hurt). \n\nI realise now that I probably gave into those feelings a little too much and just spilled them all over the person I was with, which wasn’t fair on them. I see now how much that may have hurt that person. However, I didn’t see it like that at the time, I saw it as expressing my feelings to the person I loved. It didn’t take away from how much I loved them... it was just a shock to the system. That’s it. I was feeling something and wanted to share it.\n\nLooking back years later, it’s kinda odd to think that I reacted so violently to the news of my first ex moving on, because I was BY FAR way more in love with my 2nd ex. Feelings are funny like that. Some might even say that you can have powerful feelings for more than one (or two or three) people in your lifetime (spoiler alert - of course you can). Please don’t listen to these people telling you to break up without even having a sober conversation with your partner. Communicate with them. And decide from there.",
            "He’s hurt and drunk him wanted to let you know.  If you really like the guy, I think you should talk to him when he’s sober and ask a few questions.\n\nPeople saying “dump him” without more info are being premature,",
            "This happened to me in the first three months of dating my ex, god I wish I'd ended it then instead of going on to waste three years of my life.",
            "A year is long enough to be able to cope with a break up. You may be right about wasting a year. Think long and hard about if you want to move on.",
            "I would be concerned that he claims his ex moved on \"too soon\" because she is dating another guy when he is *also* in a relationship. Maybe he is upset that yours is a long distance relationship and feels insecure about it. Have a talk with him to give him the chance to explain himself but, if you feel he is still stuck in the past, you should consider giving yourselves a time. This is not fair for you.",
            "I would probably wait till he returns and ask him about it in person and sober. However, I would not blame you for leaving him, in fact, I don't see any reason to stay with a man still hung up on his ex unless you *reeaally* loved him. only you can decide what is right for you. Good luck OP.",
            "I would talk to him while he’s sober about me breaking up with him because of his broken heart over another girl.",
            "I mean... he “moved on” with you just as quickly as she did with her new boyfriend, so he sounds like a hypocrite not over his ex. \n\nI could understand it a little better if this was his ex of 5 years, they had a kid together, she cheated on him with his best friend, or some other emotional triggering memory, but still. \n\nHe’s got baggage and it’s not worth sticking around for if he’s crying over an ex after being with you for a year. He’s had plenty of opportunities to make happy, new memories and fall in love with a different person, and yet some part of him still can’t let go.",
            "Lol he said that she moved on too fast and you guys have been in a relationship for a year? Try to work out that logic. Dump him.",
            "I personally would break up with him because I couldn’t be with someone still hung up on their ex like that. Anyone still in love with their ex does not have the heart or capacity to be in love with and give their attention to someone else. I’d also feel like I had been lied to (in terms of his overall feelings, and whether or not whatever he’d been saying to me was true), but if you’ve been together a year he obviously does like you. It’s completely up to you. Either decision is justified.",
            "Lol what??\n\nYou guys have been together for a year or so\n\n\nHe hasn't seen his ex in like a year or so and is mad that she \"moved on fast\"..... while you guys have been together almost since they broke up?\n\nAnd hes \"heartbroken\" over it? \n\nGirl this guy considers you a rebound. He was heartbroken that his ex moved on \"fast\" after a year while he has been dating you for a year.\n\nYou need to drop this guy.",
            "I once dated a guy like this. For five years. He left me to go back to that girl and he married her. \n\nI’m not saying that will always happen. I’m just saying that I really wish I would have listened to that warning sign earlier in our relationship. You’re 25 years old. You have plenty of time to find a spouse (if that’s what you want), but you don’t have plenty of time to waste with people that do not prioritize you.",
            "I'm so sorry this happened to you. But wait.. He moved in with you but isnt okay with ex moving on?? \n\nOne set of rules for him, and another for his girlfriends, especially on emotional matters, are a huge red flag.\n\n Is he like this on other things as well?",
            "Drunken words are sober thoughts.\n\nI'm not sure how things are between you two, so honestly you must decide for yourself.",
            "This is probably a stretch, but is it possible he wanted you to know? I’ve been drunk several times before, and unless you’re blackout drunk, it’s not difficult to reason to an extent. As in, some things are clearly still bad decisions even if you’re intoxicated. Maybe that’s just me. So how much did he have to drink? I almost think he chose to call you instead of a “bro” or something because he wanted to confess to you he still had feelings for his ex. It’s possible he’s felt guilty and wanted to finally tell you. It struck me as odd that he thought it would be wise to confide in his girlfriend over how torn up he is over his ex unless he wanted you to know. Does that make sense? Again, I could just be overthinking it, but based on my experience with alcohol, I can’t wrap my head around why he would call you over someone else for something involving an ex.",
            "Home country- I wonder if they were still officially together while he was dating you. He wanted you both? But she dumped him so he is surprised. Just my guess. Lots of guys in my town have gfs here and wives/kids back home.",
            "Wait- you’ve been together for a year? Does he think HE moved  on too fast? Sounds like he’s still carrying a torch for her. I’d move on from this relationship.",
            "So u been long distance since 2018, but dating for a year. Its 2020, can you explain?",
            "Oh, OP... Long distance is only worth it, if you 100% love and trust your partner. For me it sounds you'd deserve better.",
            "Why is it fine that he has moved on with you, but hurtful and heartbreaking that she has done the same thing with another man? Double standards, red flag. Bye bye.",
            ">should I break up with him?\n\nI don't know if I'd quite recommend ending things immediately, but I'd be extremely wary and definitely be on guard. My main concerns would be:\n\n* that he's still obviously feeling raw and wounded and emotionally invested in his ex;\n* that he's so lacking in good sense and judgment that he thought you were the best person to talk to about his feelings in this department;\n* that he's the kind of person to get into drunken arguments with his ex at bars;\n* that he thinks she \"moved on too quickly\", but he also found a new partner in that time, which strikes me as pretty hypocritical.\n\nAlso, I'm a bit confused about the timeline here - you say you've been seeing each other for a year, and two of those years were long-distance? How long ago did he end things with his ex?\n\nEdit: this just happened, so I'd wait until he calls you in the cold light of the morning with a genuine apology and some reflection about how he acted. If that's not forthcoming then I'd probably reconsider your relationship with him.",
            "I cannot believe he called up his current girlfriend to sob at her about his ex breaking his heart by being with another bloke. Talk about picking your audience!  What was he expecting? Tea and sympathy?\n\nBreaking up with him is entirely your choice, nobody can tell you whether it's the right or wrong decision but honestly? I wouldn't be anyone's consolation prize so be absolutely sure where you stand. Is he with you because you are the one for him, or because you're the next best thing to the ex?\n\nHe is with you, yet she has moved on too fast? sounds like an ego thing in part at least. He wants her pining forever for him while he got back out there a YEAR ago?\n\n&#x200B;\n\nYou need to have a cards on the table chat. If he doesn't understand how massively inappropriate his actions were then he has a problem.",
            "There’s something fuckedupedly poetic that you were the source of comfort he sought out to share this with. Talk to him when he’s sober.",
            "In vino veritas unfortunately.",
            "That would make me very uncomfortable. I think that if he hasn't moved on after a year, and has to call you telling you that, (his current girlfriend who should make him so very happy), it might be better to forget this guy. How long is it going to take him to realize he has you? Are you not enough? Really?!?!? Heck no I would do what you feel you should do in your heart. Also he is long distance. You might as well find someone near you that makes your heart happy and doesnt' have baggage like that.",
            "I’m 50/50 on this. If my boyfriend still gave a crap about his ex after a year of being with me I would drop him lol \n\nBUT it is worth having a serious sober conversation with him. If he really hasn’t moved on from her it’s best you guys take a break and reevaluate what you both want out of this relationship.",
            "I'd be outta there so f@#$ing fast his head would spin",
            "hurt people, hurt people. do what's best for you sis",
            "It sounds like he's not ready. Maybe break up with him and see how things are in the future.",
            "move on. he's still carrying a torch for her.",
            "I firmly believe, that the truth comes out when alcohol is involved. Whatever anyone tells you in that state, is as close to the truth as you can get.\n\nWhile it's possible he genuinely likes you, he obviously is also still in love with his ex. I personally would be offended and reassing the relationship. A year with you is a long time for him to still have these feelings about his ex.",
            "Yes, you should break up.  Never stay with anyone and KNOW  you are their 2nd pick(unless 1st pick is deceased).",
            "Break it off, it'll hurt less once you move on and he does too. Maybe then u can try again",
            "Yup definitely.    He is disrespecting you and playing with your emotions.   You deserve better",
            "Your only option is to move on even quicker than his ex",
            "I'm always iffy about ex talk, especially if they've been broken up for a while and you've been dating them for a while. How long had they been broken up before you two started dating? Because it seems like he never really got over her before moving onto someone else. I mean, maybe others could deal with it, but I'd be very worried if my partner is *heartbroken* over his ex moving on; like, have you not moved on, as well? Didn't they obviously move on a long time ago? And why would there have been an argument? Was your boyfriend actually upset that she'd moved on? It's all just too weird to ignore.\n\nAnd everyone is talking about \"they were drunk and it's a dumb mistake\"... drinking just releases you from your inhibitions, so this is obviously something that's been on his mind, not just something that popped up out of the blue; drinking doesn't excuse you or render you stupid or erase your memory or anything else. I wish people would stop acting like it's some huge get-out-of-jail-free card because it is not.",
            "If he truly moved on he wouldn't even feel hurt but relieved that she moved on fast. I personally would take a step back and reevaluate this whole situation and think to myself is it really worth it going through a heartbreak because my boyfriend wants to be selfish and not consider how I would feel. Usually when someone is drunk , the true selves of them come out since there is no wall stopping them .",
            "You're the rebound. You're the flirty butterfly in the midst of their story.\n\nGet out...",
            "You mean from the start of 2019 ? \nStart of 18 it's 2 years now. \n\nPlus, if you and him have been long distance from the start, in review of this particular event, he never really considered you two to be serious, more like a very good convenient friendship... \nI also get the impression that if she ever asked him back, he would in a heart beat. \n\nSucks, but yeah..",
            "Have a sober conversation and be honest about your feelings. Breaking up may be best, but only after the sober talk first. He at least needs to understand the problem so he has a chance to fix it, if not for you for his own future.",
            "I think maybe he moved on too quickly too.",
            "Would break up with him",
            "Getting over a breakup is like grieving a death. Moving on from it isn’t a linear progression. Seeing someone who hurt you can bring back a lot of feelings all at once. Absolutely none of this means that he’s not over her or that he’s not ready to be with you. \n\nTalk to him when he’s sober and see what he says.",
            "Yeah, I would break up with someone that did this.",
            "I will have to say, I may give a little slack given being drunk, seeing an ex you had really been into can be painful. But this is a year into a different relationship, Not sure how long it had been between the ex and OP. That he said she had moved on too soon when he has been with OP for a year. That is a massive red flag.  I do not blame OP at all.",
            "Yes, he has unresolved feelings. Set him loose.",
            "Just dump him, honestly I promise you it’s not worth it. Have some self respect.",
            "You’ve been “long-distance” for most of your relationship. Do you have any plans to be closer? If there’s no future plan for your relationship I can see why his mind would stray.\n\nYou also say you’ve been dating for a year, but “long-distance” since early 2018 (2 years)?",
            "A drunk man's words are the sober man's thoughts. He may not say it when he's sober but that doesn't mean it's not true. Time to move on for you.",
            "Whatever you decide its how you deal with it after your decision. Only you truely know if this is  a blip or the evidence you felt was required to prove he doesnt see you as his significant other. \nWho trueky ended the previous relationship would go some way to answering all your questions.",
            "He sounds like he’s still in love with her and sad about the situation.",
            "No matter what anyone says I can tell you right away you’re always gonna feel invalidated because of this and it’s always gonna be in the back of your mind so unless you can push past that then stay but trust me I know how that feels. I was the one that stayed even after he went back to his ex and they broke up and he called me for advice it was truly heartbreaking",
            "Dear young people,, I just turned 57. If you don’t still love someone from many years ago, you have never actually experienced true love. Moving on does not mean not loving anymore. It means moving on regardless.",
            "The drunk mouth speaks sober thoughts.",
            "How is it that he feels like his ex gf moved on too quick because she has a new bf, yet he has a new girlfriend (you)????",
            "I’m sorry but if I broke up and felt that much about the situation The last thing I would want to do is start saying another person! No offense but it’s just silly to rebound imo if you still have feeling for an ex that means your not giving 100% of yourself to the new relationship you know?",
            "Reading this, I really want to say how appreciative I feel towards someone I love dearly but is adamant against starting a relationship with me until he’s gotten over his ex. \n\nI’m persistent and I keep promising him I wouldn’t pry into that healing, thinking that he could heal while loving me at the same time. But, he’s firm on refusing to disrespect me by being in a relationship with me while he gets over his ex. \n\nOP, you deserve to find a man who’s just as noble as the one I love. Your bf shouldn’t use you to get over his ex. You deserve to be in a relationship in which both hearts are fully devoted to each other.\n\nEdit: on second thought, I also think you might want to consider if him feeling bad about his ex moving on too quickly might just be causing him to doubt his self-worth. I’ve been cheated on before (as we probably all have), and the deepest pain I felt was over questioning my own value: “I bent over backwards and made so much sacrifice for him, but he immediately bought her a car during the initial stages of attraction...how much value do I have as a person and how much was my love worth?”",
            "\"Yeah, sounds like you did too\"",
            "In my experience, drunk words speak a sober heart/mind. These are clearly suppressed feelings he's been holding onto. By being with OP, he's trying to move on from his ex, but he might have tried to move on too soon before he could process his feelings. \n\nDefinitely speak with him when he's sober. Ask him if he still has strong feelings for his ex. Ask him if you're just a distraction from the ex or if he genuinely wants to be in a relationship with you. \n\nBut hey, whatever OP decides to do, I'll be here for you if you ever need to talk. I've been in this situation too many times before. I've also been on both ends of this situation so I could give you a bit of insight if you'd want to DM me. \n\nI hope that with whatever the outcome is, it's in your best interest.",
            "sounds like he still loves her",
            "I would say it is important to realize that you are not and will never be the only person your BF has feelings for. You can be his best girl, but you can't stop him from having to struggle with the sadness the events from his past made him feel. The fact that he reached out to you means he feels secure with you, and holding this over his head will only go to show your BF and other men who read this that men really can't open up emotionally to their partners. Your BF probably had a longer history with his ex than with you, so you need to understand that his emotions will be hurting for some length of time relative to how much dating history he had with his ex. If this is the first big breakup for him, it will take a lot of time to recover. It took me about 1.5 years to recover from my most significant breakup.",
            "OP, it fucking sucks when an ex moves on too quick. It makes you feel inadequate and replacable and like everything you shared was \"less than\". He confided in you that he was hurt at this fact and your response is to break up. Hes not saying he loves her, hes saying it hurts seeing how replacable he is.",
            "It's a long distance relationship to begin with. \n\nYou deserve to be with someone who knows what they want and that should be you. All of you and none of anyone else if you're monogamous. \n\nYou'll know when you meet the right person and that cute lovely feeling never goes away. Be patient and completely honest and true to yourself, and it can happen.",
            "Like everyone else is saying, definitely have a sober-talk, but a year is for sure not \"too fast,\" especially if he's dating you?? Makes no sense",
            "You should remind him that it doesn’t matter if she got with someone in a day or in a year, it’s his ex and her actions are not his problems anymore. That’s why they’re exes. \n\nWould not break up with him for confiding in you but would break up if getting emotionally drunk constantly is a problem of his. Nobody wants a sloppy drunk as a boyfriend, that’s something he needs to handle on his own.",
            "I don't understand why you would break up with him. \n\nI have dated and loved others while still getting over exes. It's a slow process. It's not like he's been unfaithful.",
            ">I've been dating my current bf for a year now. We have been long distance since the start of 2018. \n\nAm I the only one tripping on this inaccurate timeline? Is it one year or ~ two?",
            "Forget your past life, it's time to start looking for a new life!!!\nDon't live with memories!!!\nLive like this one was the last day of your life!!!\nDo it!!",
            "I think from then forward that revealed your relationship is doomed if he’s still pinning for her.",
            "It depends on the type of person he is and the relationship you're in.   \nDo talk with him but keep your emotions in check.  \nDon't ask him to choose and don't ask him if he wants to stay with you.   \nHe's going to say yes because that's an easy answer and solution.",
            "This is anecdotal at best, but I found out after dating my SO for 6 months that my\nex SO had gotten his ex girlfriend pregnant while we were still talking. I was pretty upset and had an insecurity meltdown. I love my\nSO, but past baggage triggered me and I had a lot of new information to process.",
            "This needs a further conversation first because there could be nothing there but it still feels like shit when you find out someone moved on super quickly. My ex moved on after less than 24hrs and it crushed me because it feels like shit to find out that you basically meant nothing to them. Especially when alcohol was involved his phrasing probably wasn't perfect and it came off worse than it actually is.",
            "I think his feelings are fair but sharing them with YOU wasn’t fair. However, between the feelings of sadness and the lack of control when choosing you as his phone call, that does fall into the nature of alcohol-based behavior. I’ve been hurt when almost any ex, even if the feeling of love has long-since subsided, has moved on. Endings hurt. On one hand, it’s nice that on a deep level he may feel comfortable sharing very sensitive information but I wish that regardless of the drinking and how he was feeling, there was some sort of impulse to preserve your emotional needs. Because as his partner, how are you supposed to be the one to help him with this sort of thing? That’s not quite your responsibility- that’s his and his friends’ role. \n\nI do think the fact that you’re long-distance makes this much more difficult because trust and dedication is the foundation of this relationship’s functionality. Part of that trust is knowing that your love is reciprocated and valued. If you feel that you will genuinely never feel comfortable again after at least a week or so has passed, as well as a few honest and sober conversations, I would end it. If you come to feel that it was perhaps just a human moment of emotion, I wouldn’t hold onto it so deeply. Everyone fucks up eventually. \n\nAt the end of the day, it’s your heart and if you feel that your security is going to be forever jeopardized, you’re well within your right to move on. Don’t let others invalidate that. I would give it some time; issues like this are destined to pop up in some capacity after a year. No judgment to whatever you decide because I know I’d be hurting, too; I would just give yourself time to “sit” on it and see if your trust and security can recover if you feel that this relationship is worth it. \n\nMuch love to you!",
            "His decision to call you when drunk is obviously a poor one because you're going to feel insecure, worrying if he's still harboring strong feelings for his ex-partner and he was in no fit state to help reassure you.\n\nAlcohol has probably played a big factor, affecting both his judgement and emotions. I would hope ordinarily he wouldn't get into an argument with an ex-girlfriend in a public place - especially when he's in another relationship. This is possibly a good way to gauge just how drunk he was.\n\nI think the fact he's not seen his ex-girlfriend for such a long time means that seeing her with another man for the first time is going to be difficult or at least a shock. That is the one issue that perhaps he hadn't needed to address before getting into a relationship with you.\n\nI'm not sure breaking up is the right answer, at least not yet. You both need an honest conversation when he's sober and well rested from his drinking session. Make sure you're not distracted by other things and go through how this has made you feel.\n\nIf he's in a current relationship with you, i'm not sure how he can be upset that his ex-girlfriend has found another partner. Does he feel that he also moved on too quickly? A year is a very long time. Did you both get together quickly after the breakup?\n\nAsk the obvious questions. Is he able to commit and focus on this relationship, without looking back? Why did he feel upset seeing his girlfriend with someone else when he's in a relationship himself?",
            "It isnt a year \"gone to waste\" unless you insist it is or else want to stop it now. It can hurt to see someone you once had so many feelings for again. There is guilt there too, not just regret, not just feeling sorry for oneself. It can hurt, would hurt me to this day if I saw my ex with anyone else despite my being married happily for years now to another wonderful woman. I've moved on years ago but there is still a lot of complex emotion there.\n\nThis situation is what you make of it. Of course hearing that someone you love ever had feelings for someone else will hurt a bit but this doesnt have to be a dealbreaker for this very real relationship unless you want it to be.",
            "Okay sorry to be that person, but did you start dating at the start of 2018 or 2019? You said a year and the start of 2018 would be 2 years, which isn’t a majorly important detail but one year is very different from two.",
            "Feelings dont just disappear, sometimes they take a long time to dissolve. That doesnt mean he doesnt love you, too. I'd cut him some slack. He felt vulnerable, and he knows he can call you, so he did. Obviously he was drunk and didn't realize how that might be a bad idea, but if you care about him I'd say stick it out. It will mean a lot to him if you do stay.",
            "I don’t really know what to think about the situation itself, but I think it’s good that he called you to confide in. He could have called his friends to play it safe, but he called you, because he sees you as someone who loves him no matter what.",
            "Be sure to check out r/longdistance if you do continue with the relationship!",
            "No you cant hold that against him when people drink they get emotional I'm sure if he was sober he would have said bvb hey what's up and just stayed for a bit and then left with his friends. Alcohol makes emotions blow up bigger than they are like anger. I dated a girl for five years and it took some time to get over but that's just how we are as humans time heals the heart and you cant hold that against him. It's been a year and I'm guessing his ex probably put him through hell, maybe he should talk to someone about it, I understand you being hurt that makes sense but if you are willing to leave him over something small like him being upset after drinking too much and getting mad at his ex then maybe you shouldn't be together. Emotional healing takes time and understanding and if you cant have his back or just dont want to deal with it then leave him and move on so you can be happy and he can find someone whom he can depend on and reveal his honest emotions to without backlash.",
            "Did he say he LOVES her or just that he's hurt she got over him so quickly? \n\nI'm not a huge fan of the 'no ex talk' rule in relationships... Yes it can potentially trigger some jealousy but I think as long as you're honest, being able to talk about anything with your partner is valuable. Unless he said he still has romantic feelings for her, I think it's a good thing that you, as his girlfriend, were the first person he wanted to go to when something emotional and hurtful happened.",
            "Allow me tell you a story before telling you what I would do. \n\nThere was this guy I was madly in love with and best friends with, I had waited a couple of years to be with him (that’s a different & irrelevant story) and when we finally got together and had been dating for maybe a month or two.... he cried in front of me because this girl he had a little thing with unfriended him on Facebook. \n\nI sucked it up and didn’t complain much. \n\nThen I found out eventually they were still in contact. Found out he showed her his dick on skype. Told her he loved her and always will. There were many more instances. At one point, he even asked me if I mind if he meets her (they hadn’t met, they “met” online). \n\nLong story short, his feelings for her are what ended our relationship after many years of us being together. And if I had paid attention to that sign in the beginning, I wouldn’t have been as heartbroken in the end. \n\nI would break up with him, personally.",
            "I would end it. Him still being upset about seeing his ex with someone new a year later is a huge red flag. He moved on with you, and the fact that he said he is heart broken means he’s still not over her. It’s best to end the relationship to save yourself from further heartache. Sorry to hear, that really sucks, but trust me it will be better for you in the long run.",
            "I would move on to someone who actually lives near you. The fact that he’s mooning over his ex after being with you so long, plus long distance just sounds like a waste of time.",
            "This isnt quite the same scenario but the girl i was seeing for a few months just stopped things because she missed her ex, even tho that ex isn't interested in her at all anymore. So it's a real thing that can be an issue. I hope it's not for you. It kinda sucked for me but I'm sure one day I'll find someone who's actually excited about me.",
            "Shit my Ex broke up with me almost 2 years ago and I still have lingering feelings for her. But I also haven't been in a long-term relationship since then so I do wonder if it has more to do with missing being in a committed relationship. We also work together so we see eachother a lot which probably hasn't helped.",
            "I wasn’t over my ex when I started dating a really nice guy. I never told him when I was hurting for my ex. That he sought you when he was vulnerable and hurt says a lot. Talk to him.",
            "First of all, this was very disrespectful to you. He did not even consider how you would feel after telling you these things. \n\nSecondly, I think it's very unlikely that he actually still has feelings for his ex. I think it was just him being drunk. I mean realistically, if he hasn't shown any signs of obsessing over his ex, the chances are he moved on long time ago. \n\nThirdly, while one could appreciate his transparency and honesty and the fact that he communicated this to you, it also shows a complete lack of self-awareness. He should have been more aware of how this might make you feel as well as realise that he was just being drunk. \n\nI don't think that he necessarily crossed the line then, but it was borderline. \n\nverdict: talk to him about it and how it made you feel, have him make sure whether he has or has not got any past feelings for his ex.",
            "I have been with my boyfriend for almost three years now and sometimes I still bring up my ex. I know that sounds bad, but my bf has told me that if there is something that is hurting me, then I should talk to him about it. Being able to talk about my ex and how hurt I still feel about it has definitely helped me and even makes him feel happy that I can trust him to talk about it.\n\nI have definitely moved on from my ex, but it's what went down that I am still upset about. Maybe your bf isn't necessarily hung up on his ex, but just the situation and what went down when they broke up?\n\nIf you really love him and want to continue the relationship, I would give him a chance to talk to you about it when he's sober and see how it goes. It would really suck if you break up only to realize that it might have just been drunken talk (which is totally normal.)",
            "RIP,kind of ashamed to admit this but I was once in your BFs shoes. I used to talk about my BD all the time with people I was dating, usually me venting about how I was angry at him for not assuming responsibility for my kiddo. I had one too many shitty drunken nights where I said shit about how I hated that he started seeing other people and etc. \nPoint is, it's not easy. Healing from a bad breakup sucks ass, and sometimes we meet someone we like and think \"okay, I can get over this person and be happy with someone else\" and it almost becomes a thing you do out of spite. And ofc the argument is always \"but you moved on too\" and that's true, but m a n, it doesnt hurt any less, and that sucks. \nYour bf is still in his bag and it's up to you whether you want to work through it or whether it's too much for you.  \nIf you work it out, patience goes a long way and boundaries go even farther. \nBut please keep in mind to be kind and rational if you decide to cut ties: he cant help the feeling, and trust me. Even if we overreact in the moment, we realize the importance of communication when we (if we) snap out of it. He may have made the mistake of moving on while he was still hurting, but it's never because he wanted to hurt you.",
            "He is in another country for more than a year?",
            "He sounds hypocritical. I mean, did he not move on with you? This is confusing.",
            "Oh hell no...that's just unacceptable tbh.",
            "In vino veritas. \n\nUnprocessed emotions finally bubbled up and came out.  He probably also feels guilty for using you as a rebound and didn't get into this relationship for the right reasons, so he is using being drunk as an \"excuse\" to tell you the truth.  I know it hurts, but at least you know before you invested too much.",
            "Although I totally understand where you're coming from and how upsetting that conversation must've been but I do hope you can take some of the advice others have given you. I also would recommend frying to see things from another perspective, just because he felt those things in a moment of drunk weakness doesn't mean that he does feel that way at all. I would try chalking it up to it being one of the first times he has made contact with her which caused a flood of suppressed emotions to come out and they were amplified by being blacked out drunk.  I would give it a little time and let him think kn the fact that either he really does still care for her or it was a major lapse in judgment and he had just put off those feelings for so long that he couldn't help but have them come spilling out after seeing her and at that point arguing with her. I hope you tmrethink your stance in feeling like the last year of your life was a waste because clearly he has to love you back or else why would he (although very stupidly) called YOU and told YOU about what he was feeling, that shows where his heart really is. Even if he wasnt over his ex and this is something he has felt the entire time I you two have been together I would also implore you to bot take it in that way and look at the last year fir what it has been in your mind previously not what you are making it out to be now",
            "Definitely break up! He’s stupid - did he not move on too quickly too? Honestly he’s too immature to be in a relationship",
            "They call them spirits for a reason.",
            "Not worth breaking up over. Seeing an ex for the first time unexpectedly and while drunk can definitely be a shock to the system and result in a huge emotional roller coaster. How long were they together for? I agree with another post that said he was just hurt because he felt replaceable. He was drunk and emotional, id just speak to him when he is sober and see what happens there.",
            "OP, I think you should check to make sure how he feels about you before you conflate his sadness over his ex with actual love for her -- sometimes people get hung up over their exes and it's not that they'd like to get back together. It might just be that the feelings of abandonment, betrayal, etc are still lingering and he's in a place where he hasn't been able to get over the pain their relationship or the breakup caused him.\n\nI understand it may hurt for you to see him feel anything about his ex at all, but try to understand that he may not be able to help that without time and perhaps therapy. He may love and trust you very much. Don't force yourself to stay with him, but please talk to him before you make a major decision like this, for your own sake as well.",
            "Id talk to him about it ,both spber of course...if he still feels the same, then id seriously consider breaking up. Its not fair to you if hes still has feelings for someone else, sucks you waisted a year of your life but better now then later",
            "I don't even need to read the story, just the title, and I'm pretty sure he should be an exbf at this point. I mean, you're only 25...there are so many better opportunities for good relationships out there.",
            "I say break up, humans can't love more than one person at a time. we need unconditional love from the other side and even though we may love the other we shouldn't accept weaknesses like these. If you really love him, you shouldn't let him reminisce his past heartbreaks freely... you deserve better",
            "I would always be wondering if he’s thinking of his ex every time you were both intimate.",
            "Did he say he was still in love with her? Or that what he saw hurt him/her presence hurts him? I think that is two very different things. Either way, a sober talk about this would be best.",
            "Honestly - sometimes I miss my ex who was actually incredible emotionally manipulative and sometimes abusive because of his past trauma.\n\nI don’t want to be with him but there were facets to him\nThat I still would want in a partner. How long did they date? If it was a while then I feel like it’s a bit more understandable, and if not, not as much. \n\nTalk to him sober and make it clear that this discussion with you is inappropriate. He is allowed to have his opinion but stating it to you is not cool and comes across like he still really cares for her.",
            "I think it was just a moment of weakness, he had a emotionally charged moment and everything spilled out unfiltered.\n\nId hang on to a guy that can talk that candidly with you, he trusted you with a bucket full of his feelings.",
            "I was with my ex for 5 years. He wasn’t the best boyfriend and I eventually fell out of love with him and broke up with him. Even though I ended things he still said how wanted to try and make things work. 2 months later I met someone new and I fell HARD. This guy was the one I wanted to marry. Fast forward another 6 months, in total less than a year since my ex and I had broken up, BOOM my ex is engaged. I cried. I cried A LOT. Even cried to my mom about. I hadn’t thought about my ex in a year. Hadn’t seen on social media so I had no idea he was dating someone let alone it be serious enough for engagement. \n\nI never wanted my ex back, heck still don’t but I was still incredibly hurt even though I was desperately in love with someone else. Emotions are unpredictable so I emphasize with your ex. However, I would’ve never told my my current bf about what was going on and use the words heartbroken. So I’m going to ease up on your bf and say he was just being a drunk idiot. It’s easy for my to say breakup with him because I’m not in it and I just don’t like messy when ex’s get involved. Since you’re clearly unsure if you want to breakup with him (you wouldn’t be on here if you were sure) talk to him sober and then both of you take some time to get your feelings together.",
            "He saw an ex, was super drunk, and got upset.\n\nListen, it's dumb that he called you to say this, but you can't fault him for having emotion. He felt what he felt and you should never be punished for how you feel.\n\nTalk to him when he's sober and ask what's up.\n\nAlso, keep this in mind: he called **you**. He was drunk, upset, and you were the first person he wanted to talk to about it. Him venting, especially about this, is him breaking that wall that divides \"partner\" and \"friend\", which is only a good thing.",
            "I don't think this is necessarily a disaster. He saw his ex... and the first thing he did was to call you. He's been honest to his own detriment. So definitely have another talk when he's sober but to me this doesn't seem like something to break up over on the surface.",
            "I can totally understand how you feel, I also had a experience very similar to yours. \nBut I would say everyone has a past and with every meaningful relationship come some unforgettable memories. \nI think it is also good that in this situation, (which probably seemed more dramatic because of the alcohol) he thought of calling you and sharing his doubts with you. \nI have the feeling that telling you right away is a very honest thing to do and is a good sign regarding how much you trust each other. \n\nI would talk with him under normal/sober conditions to see how much this will affect your relationship. \nI believe that trust and truth is so important and it seems you guys really have that <3 \n\nI grew a lot in my past relationship, it for sure impacted my life for ever and I am grateful for the experience but it wasn’t right and my ex and I accepted that. \nBut I can imagine that it is possible to have moved on and still feel nostalgic at some point. \n\nHope you two can figure it out together \nAll the best <3",
            "Gonna play devils advocate here, but it is true that some people don't have that disconnect from 'moving on' like others do. They might say they've moved on and obviously your boyfriend is with you and it would seem he's over his ex, however people are not that simple. There's a certain type of person that can love two, three, four people at once. It's not wrong per say, but it certianly isn't cohesive to a meaningful relationship with ONE person.\n\nHe may be crazy for her too, filled with jealously and lashed out emotionally in the moment. I don't think it's the end of the world, but I do think that this level of behaviour would suggest there's a mild obbsession with the way things were in his head, which is a much larger problem and you should get out if that's the case.  \n\n\nI'd have a real sober chat with him, if you love him then I would see where it goes, but be skeptical.",
            "You're on r/relationship\n\nAlmost every advice you will see is \"break up with him\"\n\nAsk somewhere else that will give you the knowledge and wisdom to face minor issues like these without using self-destructive and lazy solutions r/relationship dwellers will give you. Seriously, mature a bit and think about your ex's you still have a soft spot for. Everyone still thinks about their ex's from time to time.",
            "Not worth a breakup up IMO but he's got some splainin to do. He should commit to avoiding one of the 3 mistakes he made. Getting that drunk, talking to his ex, or going to that particular club.",
            "His memories of experiences and emotions will not suddenly disappear. He called you to talk to you. He's with you. There will always be moments for all of us who truly loved another then lost them regardless of the reason they are gone. This isn't a slight against you. He's human. I imagine he probably felt like it was the day after the break-up and she was probably the last person on Earth he wanted to see to begin with.\n\nHave a talk with him sober and give him a chance to share his side. I don't know how things ended with her, but when there isn't proper closure the wounds can come tearing apart at any time. It's not like you'll never be as good as her, in fact, it's more than likely he thinks more highly of you than her and he's still having a hard time processing what happened between the two of them. Adding alcohol to the mix didn't help his resolve, but it did show that he would still call and communicate with you. If he really did have a thing for her, would he go out of his way to make you aware of it? He's in a different country, completely away from any way for you to ever find out about it, and he still told you.\n\nI agree you two need to talk, and this is a major thing you need to talk about. But give both him and yourself the chance to talk. Afterwards, you can better make your decision. But if at the end of the day you really can't stomach it then it really is time to end it. Just make sure you're not letting a temporary emotion make a permanent decision first.",
            "I called them break up relapses. You might be pretty over someone but something triggers you and the emotions of the break up just hit you like a blast from the past. I remember my current partner told me when he had one early on in our relationship. I was glad he trusted me and our relationship enough to be open about his feelings at the time. I experienced a lot of break up relapses from my previous relationship when we were first together as well so I was able to understand where he was coming from. But if you've never experienced it I could totally understand how it could seem very hurtful and threatening to your relationship. \nI don't know what it implies regarding your bf, but we both got over our exes eventually and we're happily engaged now. Just saying that is one possibility. But keep your guard up and the communication open for awhile.",
            "You can be still heartbroken over a person whilst also being in love with another. It's not even that unusual.   \n\nHonestly I think that if your first reaction is to consider breaking up with him then I'm gonna guess this relationship has other issues going on, whether you know it consciously or not.   \n\nSo here's my advice; don't overthink and don't bother looking for excuses or justifications one way or the other, just find what outcome you really want and go for it.",
            ">Only to find out that his ex moved on too quick and her presence still hurts him.    \n\nMy ex-girlfriend and I broke up two years ago when I was overseas and because of the circumstances I never fully got closure. It doesn't matter to me most of the year because I live a couple of hours away. But when I'm visiting my parents there is a high chance I run into her at an event and I get mixed feelings.    \n\n>One year has gone to waste. Feeling really hurt. At this point I feel like breaking up with him is the only solution. You really can't be with someone who hasn't moved on. I really do love him very much but it's really hurts knowing that he still loves his ex. What do I do?    \n\nTalk to your boyfriend, tell him you're hurt and ask if sober him hasn't moved on.",
            "He called a friend, he trusted you with his feelings. Are you really going to break up with him for being able to care about people and have the balls to trust you with the feelings. The world hurts feeling, together we heal.",
            "Most likely, it's just hurt pride. At least that's what I'm thinking (as a guy).\n\nIf I called my SO about it, even when drunk, it means I want to confide in her and not hide anything from her, especially this. Definitely hurts your pride to know that you've been replaced so quickly, perhaps even way before that if the ex was already mulling about who to move on with.\n\nBut then again, this is something that can be easily misconstrued as still having feelings for the ex (it can even be misunderstood as still loving the ex, if you are not careful with it and given his drunken state, he most likely has not been careful about his words).\n\nBottom line, OP needs to chill first and talk with BF once he's sober.",
            "this is probably his ego being hurt, pretty normal. but, even thou, talk to him to really understand what's going on",
            "Drunk people have been known to cry about cookies. I'm not sure if him being heartbroken over his ex moving on while drunk is an accurate representation of how he feels sober. \n\nI had a boyfriend who came home all dunk and upset because he had helped his ex move a bunch of stuff out of the place they used to share, including her wedding dress that she  never got to use. He was upset because they spent so long together, and now she was gone. She was horrible to him, but that was years of his life and I'm sure they had good times too. He was completely devoted to me, and just needed to be upset about something while drunk and that was it. \n\nI think you should ask him if he's okay. He might not even remember the conversation. If it really bothers you, then this is something that might break your relationship. But I don't think it's a problem.",
            "I feel like the fact he called you about it to confide in you about how he was feeling, even though those feelings are about an ex, shows that he really trusts you and wants to communicate openly with you. It may not have been the ideal thing to do while drunk, but speak with him while sober about it and you might gain new perspective.",
            "You should definitely talk to him when he's sober. It's normal for emotions to be heightened when you're drunk. And it would be a lot to see an ex unexpectedly. Also, I cry when I'm really drunk. I will find any reason to cry. I once cried because my friend was so tall, and it was unfair.",
            "I think you should focus on how safe he must have felt with you to talk honestly about his feelings.\n\nThey are normal feelings, especially while drunk.\n\nAnd he didn't try to hide them. He trusted that you were a safe person for him to talk to about them while drunk.\n\nThat's everything.\n\nLet him know it bothered you, but bear in mind that your story around him revealing his feelings is just YOUR story, not his. For him it might be a way of showing how much he trusts you to care about him, and how safe he can feel sharing how he feels with you without judgment or reprisal.\n\nThere is good here. Reasons to trust. Reasons to give him the benefit of the doubt. And reasons that if talked about in the right way, to believe that likewise he will help you with YOUR feelings of jealousy if you don't BLAME him for those feelings.\n\nNo one is responsible for how we feel. Our feelings come from our brain and mind. Unless you think he believed he would hurt you by talking about his feelings, the fact that he didn't make his feelings about his ex about his feelings about you is just an example of you believing your feelings about each other are more important than any past relationship.\n\nBut it's our past relationships that form the framework for what makes our current relationships work. I can feel bad about seeing an ex that I cared deeply about. It's not like those feelings disappear. It's just that other feelings are a part of that relationship which make how I feel more complicated than the fact that I care about them. I can love, and not trust someone, and that is a good reason to end the relationship. And it would make sense why I might be sad upon seeing them while still being happy that I am with someone whom I both love AND trust.\n\nOur feelings don't go away. They may get complicated, but they don't vanish. I'm sure it's the same for you. If you think of your exes, you feel the same way regarding what you have always liked about them... But there are so just a whole bunch of other feelings regarding stuff you discovered while dating them that makes you happy it's over.",
            "Don’t break up with home, just have a talk and express how it made you feel. More than likely he didn’t process the break up emotionally (if this is the case he isn’t in love with his ex) as us guys tend to push feelings down.",
            "I would call him back when he is sober and not hung over and have a chat with him. Then go from there.",
            "I agree that this is a red flag, but I would talk with him sober before deciding that it is a deal-breaker for you. Someone ending a relationship abruptly or moving on extremely fast can be so painful, even traumatizing, and you can fall in love with someone new without having ever worked through those feelings. It doesn't necessarily mean he still wants her. It might just mean he's still working through how she hurt him.\n\nI kind of relate to how your bf could be feeling. My ex, who was really toxic for me, moved on within DAYS of our breakup. After her, I dated another girl for almost two years, and I 100% loved her, no doubt about it, but I still had a lot of trust issues and unresolved anger towards my ex. I DEFINITELY didn't want my ex back though. I just had no closure. \n\nWhen someone moves on so easily or harshly, it is a huge blow to your self-worth and your ability to trust others. You become more closed down. You're constantly scared that you don't mean as much to people as they mean to you. \n\nConsidering he hasn't seen this ex in over a year, I can see how those feelings might have been triggered. He definitely has shit to work through, but it's not necessarily shit he can't work through with you, if you love each other. Definitely talk before you break up.",
            "I am still concerned my ex moved on too quickly and I'll never get over it. Doesn't mean I want him back, no. Sometimes when people do us wrong, the injustice hurts for a long time.\n\nThat doesn't mean he is not honest with you and his feelings for you.\n\nYou can still go for a fight though. Maybe it'll be his wake up call. ;)",
            "I personally feel like OPs partner made the right choice to call them. It shows me that their partner cares about them and that they don’t want to keep things like this under wraps and hidden away in their mind. Definitely not a situation I would like to be in in my relationship, but it’s clear that this person feels they can communicate with OP and that’s something that should be done on both ends, sobered up though. Talk it out, try to figure out what about their interaction triggered the emotions and what you can do to validate that persons concerns. then voice your concerns about what those emotions mean to you, and how they affected you as well. It may not fix the issue at hand but at least you’ll have an open communication to see whether or not this is something you should continue with your partner.",
            "Idk, the fact he called you and told you all about it shows how deeply you two are emotionally connected and how much he trusts you. He also didn’t hide it by telling his friends and not you. Sounds like he’s being open and honest. I think y’all could work it out",
            "Can I rant?  I need to rant.\n\nI hate these questions.  You've built a relationship with this guy over a year.  That's 8760 hours of verbal and non-verbal communication.  Then you pose a question to strangers; we don't know you, we don't know him, we don't know you as a couple.  And we hear a very abbreviated version of one side of the story, and are asked to help you to make a massive life decision.  \n\nBased on the very limited information I have, I'll say this.  It's possible to be \"over someone\" while still being hurt by their presence.  That's called baggage.",
            "So as I sit here with my husband I'm gonna make this comment. Same thing...kinda. A whole lot of the begining of our relationship was holly this and Holly that. And what do I see in his phone a week before hes supposed to marry me?\n\n\"Remember Holly? My high school sweetheart? Love of my life? I wanna see her before I get married.\" \n\nStill crushes me to this day. But it is what it is. We're good now. But at that time...i could have died. And rehashing it....hurts. Be single. Guys are assholes. They dont know what they got til its gone...paved paradise to put up a parking lootttt.",
            "Seeing an ex after a long time even if you have moved on can stir up feelings more so when alcohol is involved. His drunken brain probably called you because he wanted a safe person to share his feelings with. I think breaking up is taking it way way way too far. Have a convo about it when he's sober, tell him how it made you feel ask him why he felt the way he did. It's probably as simple as that. No need to go down the road of heartbreak when you don't need to",
            "Listen. \nNot saying this is the case but maybe he called you because he trusts you are a person he can be vulnerable with. That’s valuable. He was drunk, which we all know does not produce the clearest thinking. It looks like he’s got some shit to unpack on his own, for sure. I don’t know him so I can’t say whether this mans is capable of making emotional labour happen or not. Can he follow those bad feelings and really reach the crux of them? Can he make peace with them, with himself? I don’t know, that’s something for the two of you. \n\nOur relationships are where we intersect as two people but the lines of our existence stretch further than that, in time, in interests and also in experiences. But regardless this guy had a bad moment and the first thing he wanted to do was talk to someone he trusted and that was you. You are close to him. That’s communication. Not to say it was good communication from that point, he’s drunk. But communication is so much in a relationship. It not enough on its own but paired with reflection, action it creates foundation. \n\nShould you throw the whole man out? Maybe. But not necessarily.",
            "About seven months after my (current) boyfriend and I started dating, he called me drunk and in tears.  Why?  Because this day was the day he had been planning on proposing to his ex.  He was really upset about it, and more to the point, he was scared that the FACT that he was upset about it meant he was still in love with is ex and that I would 100% break up with him for that. \n\nWe ended up talking a little bit that night, and I straight up asked him if his feelings for his ex made his feelings for me any less strong.  He said no, and that that's the part that was so confusing for him...he really really liked me and was happy with me, and barely ever thought about his ex anymore.  That's why he was so upset with himself. All I did that night was promise not to break up with him until we talked in person.   We are still together and happy, and he is as over his ex as you ever are from a five-year relationship where you were planning on getting married. \n\n  *One year has gone to waste.*  Is this HIS assessment of the situation, or yours?  If he thinks the last year was a waste because he still has lingering feelings for his ex, that is the actual problem - not the feelings.  Feelings are complicated and they don't just disappear as soon as the relationship ends.  He may not still LOVE his ex, but he may have regrets, jealousy, etc.  But if HE is the one moping around feeling like his life isn't any better with you in it, then that is the real issue here.  There's a difference between having leftover emotions about an old relationship, and feeling like your current one doesn't measure up and was a \"waste of time\".  \n\nHowever, if this is YOUR assessment of the situation, you might be jumping the gun a little bit.  Emotions are tricky things, mixed with alcohol.  I would wait until he's sober and talk about it again.  How does he feel about it now that he's not drunk?  Does he still love her, or is he just upset about how it ended?  Did she do or say something to rile him up and he's mixing in feelings about their old fights?  Can he tell you that he's happy with you now and can see that they two of you are better suited for each other?   Before you jump to breaking up, give him a chance to assess his own feelings and explain them better.  If you're still not satisfied with his answers, then breaking up is the right choice.",
            " Years ago my ex-fiancee left me.  I've dated and had serious committed relationships over the last seven years but I still got emotional over hearing how he's engaged again.  I would never be with him again but sometimes people leave you wondering 'what if?' and it can be hard to get over.  That doesn't mean he's not committed or that he doesn't love you.  But take that with a grain of salt and as other comments said I'd still be wary of continuing a relationship",
            "it can be very emotional seeing your ex for the first time, I'd talk to him sober and see if it's still an issue.",
            "Gonna throw out just a tidbit of perspective. \n\nIt’s obviously completely up to you but you threw out the word love. \n\nHe had a drunk emotional moment and confided in you. Which is weird but clearly he trusts and cares about you a lot. If you actually love him I think he more than deserves at least a sober conversation about this. \n\nUnless you just like him a whole bunch and can move on easily enough, then sure, leave him without some uncomfortable conversations and chances and carry on.",
            "Echoing others here saying breaking up is probably premature. It's not at all unreasonable for him to feel this way. Your year with him hasn't gone to waste. \nIt sucks that you feel hurt here. Nobody's really done anything wrong (that I can tell at least). Nobody can control what they feel, so it's unfair to take action based solely on what others have told you they are feeling.\nI think it's actually a good sign that he wanted to talk to you about this. It means you were on his mind, even though he was having an emotional experience involving his ex.  He felt comfortable enough with you to share it, even though there was a risk that you'd react poorly. Now I know he was drunk at the time, so he definitely wasn't carefully choosing his actions, but I think the simplest interpretation is that he trusts you to trust him, and that screams strong relationship to me.\nYou should talk to him about it. Ask him point blank: does he still have feelings for the ex, and are they strong enough to impact your relationship. If he still feels something, you need to decide if you're ok with that. Just keep in mind that it can take a long time for feelings to fade, and caring about someone isn't a zero sum game, so even if he still feels something for his ex, that doesn't mean he doesn't love you, and it doesn't mean he'll do anything wrong as a result.  Be open and honest, and trust that he'll do the same.",
            "Love is a funny thing. \n\nI'm curious how your relationship is otherwise. Has he shown to be emotionally connected to you, thoughtful, kind?\n\nOld relationships, especially if they were long, leave a mark, stir emotions.\n\nHis drunk comments that she moved on too quick are concerning; however, they were drunk comments.\n\nMy ex, mother of my three adult children, stirs emotions, certainly not romantic ones. Because of alimony, I would be ecstatic if she moved on. We shared a life together and so there are emotions. I refuse to replace those with hate, like so many do.\n\nAmong the many memories, even with soft feelings of compassion I have for her, her actions often remind me why I moved on, and why I am happy in my second marriage. I am friends with my ex; but deeply in love with my wife.\n\nMy point is: you should explore these feelings he expressed. Is it because still loves his ex and wants her back? Were his feelings from an unexpected meeting, he was unprepared to process while drunk? Does he love you? Does his feelings for his ex impeded on an intimate connection with you? \n\nYou may find that he is not ready to move on, still grasping at the past. Or perhaps, he can't accurately explain what it was he felt, spewed forth words in drunkenness that don't paint the whole story.\n\nEmotions communicate with complicated messages. Guys are notoriously bad at understanding them and worse at putting them to words. \n\n&#x200B;\n\nBest wishes in navigating the complicated world of exes. \n\n\\~Troy (Flourishing Life Society)",
            "It's totally plausible for someone to love more than one person at a time. It would be different if he constantly compared you two or ignores the reality of you for the memory of her. If she'd died instead, would you expect him to stop loving her?\n\nI think your best bet here is to have a sober conversation with him. Ask him how he feels, what you are to him, and if he sees you two as being together long term. Set relationship expectations together. Set boundaries. This relationship isn't a waste just because there's a scar from an old wound.",
            "Something is bothering him, so he calls on you, the one person who is 100% will hurt when learning of this, to comfort him. He's just an entitled asshole, do you really wanna stay?",
            "So many Doctor Phils in this subreddit. Suddenly everyone is a scholar about the inner workings of the human mind.\n\nThere have been cases of people laughing hysterically at their own parents funeral. Sometimes feelings are feelings and they don't make any logical sense. \n\nOne thing is for certain though. Unresolved feelings and even full blown mental illness can begin by not having an outlet to discuss them, and letting them manifest. Telling yourself you don't have them doesn't make them go away. They will be back sooner or later.",
            "It might just be the drink talking.  Talk to him when he’s actually sober and see what’s up.",
            "Hey OP, I want to bring another perspective to you to consider.  Fair warning my response is rather long because I want to provide context.  I am in a loving relationship with my current boyfriend for a little shy of 2 years and this is by far the most loving and accepting relationship I’ve ever been in.  I was with my ex for 6 years and he moved on quickly afterwards as well and I’m still recovering from it and it’s been 2.5 years.  My boyfriend was also with his ex for 6 years.  Even 2.5 years later, both of us still have days where we break down and feel overwhelmed with feelings of sadness, loss, hurt, and inadequacy because of our own backstories (which are very different than the other’s).  Emotion is a complex thing and as you get older you’ll realize that humans are capable of hold dichotomies  and emotion is rarely back and white.  You can certainly feel love (not romantic) and hurt towards someone who have wronged you in someway and not wanting to be with them, you can certainly be perfectly happy in your current relationship and still mourn for the loss of your past relationships.  These are normal emotions and often people try to make everything so black and white that it suffocates the complexities we are capable of experiencing as humans.  Just a couple weeks ago both my boyfriend and I had dreams about our exes and we were down the whole day in our own silos and it wasn’t until we engaged in a dialogue where we placed no judgment but embraced each other’s pain in understanding and loving support that we bonded deeper.  A healthy relationship allows for sharing of pain with openness and honesty, not jumping into conclusions straight away.  Sometimes people are hurting, especially men, who are often shaped by society to hide their feelings, that causes years of loneliness and depression.  He trusted in you to share his pain, and I would encourage you to at least listen and have a conversation to understand his pain before deciding whether you want to continue this relationship or not.  Yes, these conversations are extremely scary and can rock the very foundation of the relationship, but to play devil’s advocate, if you were seriously hurt by an ex and you shared your feelings with your boyfriend, what reaction would you want from him if the goal is to have a loving relationship where you are building towards something together?  Now if this isn’t your goal then that’s a different story, but please have some compassion for him if you truly love him.  We all go through tough times, we all have waves of loss and pain that hits us over and over about the same things.  I’m over my ex and my precious relationship but the pain can take years to fully heal.  Best of luck OP.",
            "Getting drunk and having an existential crisis about what your life could have been, while upsetting on your end, doesn't necessarily mean that he's not over her or that he's unhappy with you. I'm perfectly happy with my life but after one too many I can get glum about the way things could have gone, not because I'm unhappy but just because it's in our nature to always want what we can't have.\n\nI'd say the fact that he called you up is actually a pretty reassuring sign. He was drunk, and sad, and you were the person he turned to. Heartbroken and horny aren't the same thing and it's easy to see an ex and be hurt that they don't want you and found someone better than You in their eyes without wanting to get back with that ex yourself.\n\nObviously it's all in the details, have a sober chat, i wouldn't run too soon.",
            "Just wanna point out that still being hurt over a past relationship does not mean you're still in love with your ex. For instance, I know a guy who is currently in a 3 year relationship with an amazing girl with whom they have an incredible, mutually respectful relationship, but he can't even bring himself to look at pictures of his ex, let alone be in the same room as her. Doesn't mean he still loves her, means that certain wounds take more time to heal.\n\nAlso, being hurt at the idea of your ex moving on too quickly is a very natural feeling. It makes you feel insignificant. It doesn't necessarily go to the idea of love, it goes to your ego and sense of self-worth.\n\nI think your boyfriend's feelings are valid, but there's also room for suspicion considering it has been over a year. The whole \"one year has gone to waste\" line is particularly alarming too, not sure what it exactly means but it warrants an explanation. Have a talk with him the next day when his hangover clears up.",
            "He called you and was HONEST..I COMMEND THAT.. He could've chosen other options but he turned to you..hope you push past your feelings and just encourage that he trusted you to get him...",
            "How harsh. \"I love him so much\" but then you want to break over one drunk moment?\nHere in Italy we say that you have 3 types of drunkenness: Happy/Stupid, Sad and Sleepy. The Happy/Stupid is when you feel overconfident, hug friends and total strangers but you might end into trouble, sad is the most annoying for friends (I had a friend that started crying because his doggie \"Cookie\" died when he was 8 and all he could remember were his sad moments...) and sleepy drunkenness where you're just sleepy and ooze off to collapse somewhere to sleep.\n\nWhat can I say? Loving one another is not being always happy, being 100% ok and having no issues at all. It's growing up with someone different than you. That might argue, fight over different point of views, moments of tensed silents and then being there for the moments of weakness of each other. If at the first issues you break up what does that mean of your feelings? Just because your ego got hurt over him being upset that his ex moved on? That was his ego talking not his heart! \n\nBut yes. Ask here on Reddit to see how you should behave. Just to appease your consciousness. \n\nOr maybe, start growing up emotionally and mature a little bit. There will be other issues along the way. Far worse than one stupid drunk moment. Maybe talking to your bf why is it necessary to get drunk when he's out with his friends and advising him that he's the Sad/Annoying type of drunk. \nAsk him if he drove home or if he was taken home. More life threatening issues than ex girlfriend. and btw he didn't say he wanted to be with her. He just said he was sad she moved on too quickly. Translation: \"I thought I have made a bigger impact in her life and she would be crushed for a longer period of time\"  that's all.\n\nCheers and sorry for the harsh tone.",
            "I wouldn’t break up with him yet but I would voice with him how it makes you feel as he may not realise the inpact it has on you. Points to him for being honest and upfront but you need to tell him to move on and cut all ties/memories of his ex. Everyone processes seperations in different ways but accepting the situation and moving on is critical to find peace in life.He’s lost something good in order to gain something great which is you ;) Cut him some slack and attempt to navigate through it. If it doesn’t work tell him that you’ve been left with no choice but to end the relationship. This might shock him into realising what he’s done is not ok. You can’t change what’s happened, but you can control what happens next as that comes down to you- Good luck 😉",
            "In vino veritas\nBut talk to him first once he sobers up I wouldn’t be too harsh on the guy since he was drunk. If he’s squirrely or off about the questions you ask then maybe yeah but also don’t come off as combative or he won’t respond well anyways. It’s like walking through a minefield",
            "I feel in my opinion he's an honest open hearted person and sober /drunk whatever it is he wanted to be honest. It is an uncomfortable situation, it should've stayed at hi how are you and left it at that to be honest.\nTalk it out in a sober mind because he seems honest enough to tell you about it in the first place\nWith the 'breaking up' if you feel in your heart and mind its the best thing do it.\n\nI've had a similar situation and I was glad for the break up, sad but relieved because he saw his ex and they remembered how much they still loved each other and he spoke to me in person and I was glad he didn't cheat on me and he was an honest person about it",
            "A lot of people have posted but! I agree with many people.\n\nSeeing your ex for the first time can be hurtful no matter how much time has passed. I see it as that your boyfriend trusts you enough, to go to you. You don't have to be happy about it - talk about it, but I don't think he's being crazy.",
            "I'd say alcohol is definitely a factor here. Wait til he's sober to really get to the bottom of this. Seeing an ex can sting, seeing an ex with someone else can sting worse, especially if they broke up with you. Add being drunk to that, and things can easily get stupid and embarrassing.",
            "Drunk feelings aren’t always real feelings no matter how much people and movies want to make it seem so.\n\nSometimes when someone is drunk they just get something in their head and it affects them differently.\n\nHe could be completely moved on until he was drunk and for whatever reason he saw some post/snap/whatever and it hit him like a brick.",
            "When we're drunk we do stupid things. Now if he had gone out and slept with someone else, that would be breakup worthy. But instead he called you. I think the thing to take away from that is that he trusts you and values your support.",
            "You can still be hurt by someone and not be in love with them. He was drunk and seeing your ex can be a shock to the system. Maybe she did move on too fast and your boyfriend only just found out?\n\nYou've left out far too many details for the people saying \"just dump him\" \"he's still in love with his ex\" to be justified.\n\nWe have no idea whether he is or not on the info you've given. It could be that your conversation was a giant red flag, or it could simply be that he's feeling lonely as you're long distance and he wanted a shoulder to cry on. In my opinion, he came to you because you're a place of trust and comfort and he felt safe sharing that info with you.\n\nYou need to have a sober chat with him. If you still see this as a red flag afterward, you are entirely justified to break up with him. Or you may find 9ut that it was a big drama over nothing. Just please don't take the advice of all these people jumping to conclusions without having the proper information. Good luck.",
            "Exes are tough.  Just because they broke up and moved on doesn’t mean all feelings go away instantly.  How long did they date? How soon after their breakup did you two start dating?\n\nI’m not saying he still loves her and should have permission to have deep feelings for her still, but having feelings is part of being human.  Seeing your ex out may make anyone feel a little weird, especially when alcohol is involved.\n\nTrust that he loves you and talk to him when you’re both sober to get a better understanding of where his head is at.  Try to avoid making assumptions about things until you talk.\n\nI’m dating someone that was married for years.  We dated soon after they divorced.  We have run into his ex a few times and I can tell it makes him a little uneasy, however I have no doubt he loves me and wants to be with me.  I think that love and trust component is the glue that holds us together, so maybe also evaluate if you feel secure and loved in your relationship too, as that will help you weather difficult experiences.",
            "I think after a year you can give him the benefit of the doubt. He might not have dealt with the feels from his last relationship and it's possible he wants your help.\n\nSeeing an ex move on feels terrible for any number of reasons. You might be able to figure out what those reasons are as a couple and put them out there for you both to understand.\n\nLikewise you should be able to articulate together why it triggered such a response in you. What is this idea of wasted time? What are your expectations? Why is a break up the only solution?\n\nIf you come to a point of mutual understanding with compassion, you will be in a much better place even if you end up splitting. And if you stay together, well, it can be very nice to have the kind of relationship where you deal with issues together rather than separately. Good luck!",
            "Seeing the ex while drunk brought up sag thoughts of the past and her moving on soon after their break up means she was cheating or he was easy  to get over which possibly hurt his pride... I wouldn't read into it TO MUCH into it without a sober chat",
            "I can see how you’d be hurt, but the flip side is he felt comfortable enough to say that to you. I think that means he trusts you enough to just be able to be supportive in that moment of weakness. Obviously we all move on differently, and just because he still has feelings come up doesn’t necessarily invalidate his feelings for you.",
            "I feel for the SO. We aren't given a lot of context as to how the Ex and him broke up. If the SO didnt get closure or the argument brought up old wounds, I can see why he'd be drunk upset. Then he needed support and someone to vent to, which he turned to you. I would be a little hurt obviously but glad my BF trusted me with those feelings rather than bottle them away or me find out through someone else. Maybe it's because I had my own baggage that I can connect with him that my own SO helped me through. I made it clear though that I no longer had feelings FOR my Ex, but that I had these feelings and issues BECAUSE of the Ex. \n\nI would definitely recommend a sober convo but this isn't something you should automatically break up with them for. Don't punish them for coming to you with something that's bothering them. Now if it turns out he does still have feelings that's a whole 'nother issue and I don't have any advice for that. Just pump the breaks and talk things out.",
            "He was drunk and sad, and the person he chose to call was you even though the call could have brought problems. He felt hurt, and needed a shoulder to cry on, he picked you. It's hard to go over some people, but it's harder if you're alone.",
            "I don't have much specific advice here..other than to say people can have love emotions for two different people, at the same time. No matter what some others say about that (I am reading the opposite in some comments), it happens to some of us at some time in life. It does not have to mean the current relationship is hopeless. I guess I'd say to OP take some time and see if things go well as you move forward with the guy, or not, and not say \"hey you HAVE to break up because he's not truly over the ex\"",
            "If hes like \"she moved on too fast cuz I know I still miss her\", not great. If its \"she moved on too fast because I'm great, actually, you know what, and it was dumb to break up with me because her next guy is awful and she clearly just wanted to not be alone\" actually that's not a bad place to work with at all",
            "All I want to know is: are you really *that insecure*? \n\nMaybe it's time for a sober talk, and see where it leads. \n\nBut for now, I'd do no breaking up on a first impression.\n\nHope you get there!",
            "Ok, it sounds really bad to you, but I think you should have a serious talk with him when he is sober and tell him how that made you feel. Also, get to the bottom of his emotions for his ex. I have to admit, seeing any of my exes would still trigger me in a way, no matter if I'm in a fulfilling relationship or not. This doesn't have to be a breakup, but in the end, if his answers don't make you feel more secure about the two of you, it's understandable to call it quits.",
            "Echoing what people have said here... don't break up with him over something he idiotically brought up when he was overly emotional and drunk. Talk sober and see whats really up.\n\nSecond and perhaps a more unpopular opinion, but I whole heartedly believe people are capable of loving more than one person simultaneously. He might very well still have a few residual feels for the ex that have gone unexamined, but that does NOT mean he has been fooling you into believing he loves you when he does not. People can most certainly love fully and wholly one person while also still having feelings for another... it is not always a zero sum game. However YOU have to decide whether or not something like that would ever sit well with you (assuming that turns out to be the case here... it may very well not be). If jealousy is something you have a hard time sitting with, then that might drive a real wedge here.\n\nAt the end of the day, only YOU know what type of partner he has been to you prior to this event. Is he kind? Considerate? Does he show affection in a way that feels right to you? Do you have otherwise good communication? Does he listen? What are his moods like? Stable or more volatile? Consider the bigger picture first and let that inform your next move...  AFTER your sober talk.",
            "Maybe try to help him out and see what comes of it.",
            "Break up for this? Isn't it too light? Honestly if you are ready to break up with him because he has sad drunk moment you should more ask yourself if you really love him.\n\nI don't anyone couple who loved each other which could break up that fast for a small reason",
            "Seeing an ex brings back up old memories opens new bridges of opportunities to take, try talking about it to him when he's not under the influence of alcohol possibly",
            "I would feel uncomfortable too BUT\nKeep in mind that his ex was once a part of his life, and just because they are no longer together, doesnt mean that it never happened.\n\nHaving felt my ex moved on too quickly in the past, in my experience, it was about me, not the ex. \n\nI felt like i wasnt important or cared about enough that i was so easy to move on from.\n\nHim telling you something like this os probably a good thing for your relationship. \n\nWhat he is telling you is about his insecurity \n\nJust my 2 cents",
            "I would just say that the fact he called you and thought of you in that moment is pretty amazing. That he had the honesty to call and admit his fears and feelings is pretty great. Not making a call on what you should do because there are a million other relevant factors I don’t know about but that little piece of it is pretty great. He could have hidden all of this from you but he chose to be honest. It sucks he still has feeling for his ex but if you can find your partner without having someone in your past that doesn’t have a little toe hold on your heart then you’re one lucky mofo so I wouldn’t let that fact alone stop you...",
            "Easy to see why you're annoyed. \n\nBut\n\nHe told you\n\nHe trust you enough to talk about this and tell you the truth. Most douche bags wouldn't tell you about this, especially if there were any feelings he had besides a bruised ego.\n\nTalk to him when he's sober and pick up on the vibes he sends out.",
            "I don't know if this warrants a breakup. Seeing an ex is really emotional regardless of the relationship you're in now. Healing takes a long time and, depending on what their relationship was like, his hurt could be from more than just the loss of the significant other, he could still be healing from other aspects of the relationship. I think you should definitely tell him why this upset you and have a discussion when he's sober.",
            "It's different for men. If it's the first time he's seeing her in person since they broke up, and having alcohol involved it can seem like only a month and be hurtful even subconsciously. It doesn't mean he loves you any less it's just a pain he felt when he saw her. Honestly, as a man I don't think you're relationship is in trouble just yet. See how it goes from here. If he never brings it up again it was just a drunk thing he experienced that angered him. If he does then you have worries.",
            "It's not like hes getting back with her."
        ]
    },
    {
        "post_id": "5e43ld",
        "author": "AmIReallyDoingThis34",
        "title": "[UPDATE] to post from 2+ months ago: \"Me [34f] with my husband [40m] married 11 years w/ 2 kids: I told him I want to leave, but then he surprised me.\"",
        "url": "https://www.reddit.com/r/relationships/comments/5e43ld/update_to_post_from_2_months_ago_me_34f_with_my/",
        "score": 2744,
        "num_comments": 180,
        "created_utc": 1479736124.0,
        "selftext": "[Link to original post](https://www.reddit.com/r/relationships/comments/50tf15/me_34f_with_my_husband_40m_married_11_years_w_2/)\n\nIt's been about 10 weeks since my post. Here's what happened. \n\nThe evening after I made that post, I told my husband there is no way we will be able to work everything out on our own, and we need to go to counseling. He reluctantly agreed. \n\nWe started couples counseling the very next week. It's realy quite strange how counseling has progressed. \n\n1. My husband made one change - stopping with the yelling - immediately and totally. He hasn't yelled at me over little things for weeks now. \n\n2. BUT I have progressively gotten more and more angry with, disappointed in, and disconnected from him because of everything he's said and done during these weeks in counseling.... which also caused me to sort of wake up to all that he has done in the past. I have an appointment with a lawyer next week. We are done. \n\n\\#2 takes a bit of explanation, so here goes. \n\nI am quite stunned by how little effort this guy is willing to put into the relationship in spite of so desperately wanting to hold on to it. So he made one change - the end of all yelling. I was really, really relieved and grateful and impressed.... until he started complaining (about 4 days in!) that he was putting in all the effort and seeing \"negative returns\". This has remained his stance for all these 10-11 weeks. \n\nI am flabbergasted. Our couples counselor has straight up said to him: \"I am supposed to be neutral here but on this I am comfortable saying you are WRONG, she is making a huge effort at this relationship and you need to know that.\" But in private my husband dismisses everything I'm doing as \"intangible\" or \"selfish\" and therefore not real. And he complains nonstop that I'm not my \"usual self\" i.e. the doormat who danced around managing his feelings and walking on eggshells all the time. \"This is not the person I fell in love with,\" he keeps saying. \"Why should I bother making all this effort?\" \n\n\nFor my part, yes, I am not the person he fell in love with. The couples counselor told me to stop trying to manage his feelings for him and try to be myself - and I took that very seriously. I no longer try to read his mood all the time and tiptoe around him. I no longer try to intuit when he is angry or hurt and ask him what's wrong and try to cajole him into working things out. I leave it to him to bring it up with me if something is bothering him. If he's in a bad mood and sulking, I just leave him alone and go on with my own thing until he wants to talk. If he is stonewalling me, which he has started doing for a few days after every single counseling session, I no longer let it affect my mood. This seems to be making him feel completely unloved and abandoned - which I only know because he has broken down and cried and yelled at me after the stonewall. \"You don't care about me anymore.\" And I've been saying, \"If something is bothering you, you need to tell me. I won't read your mind. And I won't cave to your freezeouts.\" Cue his standard line, \"What effort are you making in this relationship? Why am I the only one who's doing anything here? Why should I continue to do this work when you are being so selfish?\" \n\nThe stoppage of yelling was homework from the very first session. He did that. But subsequent sessions' homework has been things like, \"Go on a date this week\" and \"Make one show of affection as soon as you're home from work\" and \"Make time for conversation before bedtime\" etc. -- all of which have been spectacular failures. On our \"date\" he refused to so much as hold my hand and spent all his time wandering off on his own (we were at a museum) - and when I brought it up later he got massively pissed saying \"WE WENT ON A DATE WHAT MORE DO YOU WANT\".  The  show of affection - well, he used to do it if he came home later than me, but if I come home from work later than him, he is always distracted and does not reciprocate my hug *even after I point it out*, and now since he started stonewalling me for days after each counseling session, I haven't even tried to do this homework because fuck it, who wants to hug a stonewaller (same goes for conversation before bedtime). \n\nThis shit has really woken me up, y'all. I don't know what sort of fantasy I had constructed out of whole cloth that made me love this guy. He really doesn't want to lift a finger. He seems to lose it completely at the thought of my leaving - cries, seems desperate - but it translates into ZERO action. He really doesn't care about me at all. \n\nAnyway - I said as much to him early this week and told him I am leaving. Next week I have an appointment with an attorney to see what my options are. This shit is really happening. I am leaving. I am scared as shit and my emotions are fucking fried but I have never been more sure of anything. \n\n \n  ---   \n\n\n  **tl;dr**: 10 weeks of actually talking about our relationship for the first time in 11 years - that's all it took to wake me up to the reality that I married a ridiculously selfish man. Fuck. :(\n",
        "permalink": "/r/relationships/comments/5e43ld/update_to_post_from_2_months_ago_me_34f_with_my/",
        "comments": [
            "> I am quite stunned by how little effort this guy is willing to put into the relationship in spite of so desperately wanting to hold on to it.\n\nWell, he wasn't willing to put in the work before it became a life-or-death situation for the relationship.  Why would he be up for it now?  Especially when little to no effort has worked out fine for him so far?\n\nAnyway, good for you for realizing it's not going to get better and doing what you have to do.  It might be rough for the next little while, but I think you'll be happier for it in the long run.",
            "You are being very strong and brave, and for what it's worth, an internet stranger is impressed and proud.\n\nStay the course. ",
            "I am SO proud of you for coming to terms with who he is and realizing you deserve better. It's a really hard thing to do and judging from your past post as well as this one i think you will get on marvelously without him!",
            "Your husband is a spoiled child.  He wants to get his participation trophy, rather than actually putting in work to fix your marriage.  I'm guessing no amount of counselling is going to save this.  \n\nHe wants an easy fix - i.e. he's treating your marriage like a broken microwave.  He wants to hire someone to do the work for him, to fix or replace it, and then have it magically start working perfectly.  But that's now how people are.\n\nI'm glad you have an appointment with your attorney, because you can't save a relationship with someone like him.",
            "Too little, too late. \n\nGood luck moving forward. You'll be much happier without his dead weight weighing you down. ",
            "He might've stopped yelling as in raising his voice, but all I can see is the intent is still there. \n\nYou made the right choice. I know that doesn't help now, but I think you'll realize it in the future. Good luck.",
            "[deleted]",
            "Bravo. Now you can leave with no doubts or regrets. ",
            "Good for you for being able to look at things with an open mind and clear eyes. It sucks, especially with kids in the mix, but you are doing the best thing for you and them. I know that feeling - that absolute surety that this shit must end - and it really helps you get through the hard times. I can't even fathom what my life would be like now if I'd stayed with my ex and leaving is still one of the best things I've ever done. Good luck to you, and feel free to PM me if you want to talk.",
            "Goodness, that last paragraph was such a relief to read. I'm so glad that you finally realized your husband is abusive. He's not just selfish. He. Is. Abusive. The reason why he \"desperately wants to hold on\" to the relationship is because **he needs someone to beat down.** That's how abusers are. \n\nYou should feel really good about the choice you've made! Congratulations. I think once you've truly and finally left him, you will be shocked by how elated and relieved you feel.",
            "He's a big, blubbering, selfish child who manipulated you into being his mommy. Run.",
            "Phew. I'm so glad you're leaving him. He sounds truly more difficult than anyone needs to put up with. ",
            "Girl you can do this!! And you're awesome for breaking this cycle! ",
            "> This seems to be making him feel completely unloved and abandoned - which I only know because he has broken down and cried and yelled at me after the stonewall.\n\nI guess he didn't actually stop yelling, eh?\n\nOP, you're doing the completely right thing.  This man is abusive, does not love you, and is so incredibly horrible.  You've done everything you possible could from your end to save the marriage, so you can walk away from this knowing that the failure is entirely on him.",
            "Good for you, OP. It will be hard, but very good for you AND your children. May I suggest sticking with counseling for a while? Sounds like it really helped you, and you should lean on all available support while you discover your new life. ",
            "> He seems to lose it completely at the thought of my leaving - cries, seems desperate - but it translates into ZERO action.\n\nActions speak much louder than words, because words and crying is pretty low effort. He's still trying to manipulate you, while basically silently screaming \"I'm no longer yelling, JFC what more do you want!!!!\" at you. So that \"no longer yells\" isn't really true. His actions are pretty damning. \n\n> I am scared as shit and my emotions are fucking fried\n\nFrankly, I would recommend you reaching out to a domestic violence shelter and seek advice on how you should go about separating from him. Because even if he has never hit you before doesn't mean that he won't, not with that temper.\n\n",
            "I'm in a similar situation, the wife who was just over the husband's inactivity and semi-abusiveness (I'm also hesitant to call it abuse although that's probably what it was).  \n\nAfter I had The Talk with him, it took him over a month to finally get a big-boy job and even then it was still \"I'm doing everything you told me to\" while still being an insufferable prig.\n\nI finally moved out 7 months later.  I still feel guilty because I'm so used to having to take care of him, but the more I hear of him blaming everyone and everything and not taking any responsibility, the more I get over it.  \n\nI sincerely wish you the best. It's going to be a struggle, but it's also going to be an amazing journey in finding yourself and realizing that you're better than having to deal with all of that.  \n\nIf you need an anonymous internet ear, please feel free to PM me.  It's my alt account so I might not check it right away.",
            "On mobile and can't find the link, but read a thing a while back relating to you being angry once he gets his (somewhat) under control - basically it's entirely normal, even expected, in large part for the reasons you've stated - your pent up emotions now have an outlet, plus understandable frustration that this issue (the yelling) has been revealed to be something that he *could* have got under control whenever he wanted...he just didn't want to. In short, good for you, and you're far from alone in your realisations. ",
            "> Our couples counselor has straight up said to him: \"I am supposed to be neutral here but on this I am comfortable saying you are WRONG, she is making a huge effort at this relationship and you need to know that.\" But in private my husband dismisses everything I'm doing as \"intangible\" or \"selfish\" and therefore not real. \n\nThere was a series of posts from a while ago about a woman who's husband *refused* to let her be a SAHM, even though it was in the best interests of the entire family (including his daughter from a previous marriage). His behavior got really scary. \n\nHis wife told him he was in the wrong. His family told him he was in the wrong. His best friend told him he was in the wrong.  Their counselor told him he was in the wrong. And all he could do was cry that \"no one was on his side.\"\n\nYour husband doesn't want to repair your marriage or have a good relationship. He just wants his meek little wifey who will do backflips around his moods to come back. You are doing the right thing.",
            "I'm glad you're waking up. Go on and live a great life, OP. ",
            "Hey, it might've only taken 10 weeks (and 11 years) but you'll have what you've learnt about yourself for a lot longer. No more doormat! Think of all the things you can do with your time and energy instead of catering to an emotional blackhole. ",
            "It speaks volumes about him that he could stop the yelling on a dime when he really had to, but had just never bothered before. \n\nI think you're making absolutely the right choice and I'm happy for you. Good luck for the future; it'll be hard, but not as hard as staying married to this man would have been. ",
            "This man child needs to be loved, coddled, pandered to, or else he gets no validation and his continued existence within your relationship is moot.\n\n\nYeah, I don't blame you one bit for walking away from that one.   A ridiculous notion that you should go after him, even when he treats you like garbage.   No can do.  Hope you take what you deserve in the divorce.",
            "See, you say he stopped telling but then you say\n\n>This seems to be making him feel completely unloved and abandoned - which I only know because he has broken down and cried and yelled at me after the stonewall. \"You don't care about me anymore.\" \n\nAnd then you use caps when you tell us what he said\n\n>when I brought it up later he got massively pissed saying \"WE WENT ON A DATE WHAT MORE DO YOU WANT\".  \n\nSo if you find yourself feeling down and thinking that he at least stopped yelling and that was something and all that remember that he didn't even actually really stop yelling.",
            "I don't want to sound insensitive because I know you're hurting, but... congratulations. Seriously. You know how much better you feel now that you're not trying to tiptoe around your husband and are just leaving him to deal with his own emotional bullshit instead of doing it for him? You're going to feel even better once the emotional bullshit is out of your life entirely. You won't have to think, \"Should I try to do something or just let him stonewall me?\" because he won't be there to stonewall you in the first place. Divorce isn't a fun process, but sometimes it really is for the best. ",
            "I came late to this party, so please forgive me if someone's said this ( on my phone), but please get your *own* lawyer if you hadn't planned to.  You need someone solely to be your advocate and be sure to ask for everything you want.",
            "Re: the top comment on your previous post: my God, Meat Loaf was wrong. He *did* do that. He just didn't do all the other things to improve the relationship.\n\nOf course he's unhappy with the situation, he was used to walking all over you and now he complains because it's no longer working. Good for you. Good luck and stay strong! ",
            "FYI, It's been almost 10 years since I found out my marriage was over, to a guy like that. Everything I did was wrong. He was not willing to talk or change in any way.\n\nI am comparatively *deliriously happy* now and have been for most of the time since (the first 2-3 years were an adjustment, but the \"not being around someone every day who discounts me and everything I am\" was a HUGE plus at that time).\n\nIt can happen.  I'm glad you're talking to a lawyer.",
            "You are showing your children that life is HARD but when you can you will stand up for yourself, you will take the plunge into hard things to better yourself, your life, their lives. \n\nYou are strong. Wishing you happiness and hugs and safety and LOVE in the future. ",
            "Wow, talk about lack of love. I'm so sorry you had to go through all of this to learn to truly love yourself and move on. You're a strong person... man, he fucked up big time. ",
            "Really proud of you OP. There is a definite sense of empowerment and strength in the way you wrote this post in contrast with your last, and I think it's clear you've come a long way emotionally since. You're doing the right thing, and I wish you and your kiddos the very best.",
            ">This seems to be making him feel completely unloved and abandoned \n\nBecause he's a manipulator who thrives off of your emotional energy. He WANTS you to baby him and coddle him, even if he's having a big tantrum. You're not the person he fell in love with, because you're fed up and not so easily manipulated anymore. I hope you can recognize that his \"emotions\" are an attempt to control you. You can leave if you want to.",
            "This man wants a mother to care for him... Not a wife.  He's terrified of being alone without a mother to coddle and sort him emotionally.  It's a good thing you are getting out.",
            "There is a fantastic book by Patricia Evans called 'Verbal abuse: Survivors Speak Out'.  It is a really beautiful and empowering book and I really recommend that you read it.  You can get a free trial on audible and listen to it for free if you'd like.",
            "Despite this having ended in the breakup of your marriage, I think you both will be able to emerge with the knowledge that you gave it your best shot. At least neither of you will ever feel like, \"If I had only done X, maybe we could have worked through it?\".\n\nI'm sorry to hear that you are going to have to go through a divorce now, and I wish you the best of luck.",
            "I was really hoping this story would turn out better. You seemed so willing to fix it that I was hoping that would translate into a mutual understanding of the work that needed to be done. I'm glad he decided to go to counseling but it seems too little to late. Maybe he'll get some individual therapy and work through some of his issues that, yes, are his issues for the sake of your children. Good luck, OP. ",
            "Sorry you're going through this and that it took 11 years and two kids to reach the point where his true attitudes and capabilities have surfaced. You're doing the right thing by leaving. For the sake of your own mental health and so that your kids don't learn dysfunctional relationship coping mechanisms from your husband, it's your best course of action. Please continue with counseling so that you learn to recognize what aspects of your upbringing and personality made you marry a guy like your husband. We are all motivated by aspects of our personalities that we might not be conscious of. My wife and I have been married 33 years and feel lucky that we've had good communication and we both feel that we married our \"best friends\". My point in bringing that up is to say you can find that too. Things will get better, stick to your principles and hang in there.",
            "Hey. Don't feel bad. I should also say that counseling did help. You'll have no regrets after leaving now.  You tried and  now you know.\n\nJust don't fall for husbands bullshit when he tries to beg you back. Women aren't fleshlights. Relationships take work.",
            "I am glad you got out. You deserve so much more. Please love yourself much much more now. He doesn't deserve you. \nThere will be times that you will feel lonely or scared. But don't worry. It will get better. You will do so much better. \nI will be honest, it's not going to be easy but you will be much more healthier,physically and mentally, and much more happier.\nGood luck!",
            "Standing strong and doing the best for yourself is a great thing for your children to see as well -- whether they are still children or now adults. They are almost certainly not blind to the way your husband has treated you. They deserve to see their mother as more than a doormat, because you are more than that. You are a valuable, capable person, who should be treated as such. If they are still young, this is an important lesson to learn. ",
            "Good for you.\n\nYou deserve happiness. And I wish for much of it to come your way.",
            "This sounds so much like my ex it's creepy except she never agreed to go to therapy (but also we were not married and had no kids). When I left at 5yrs I became so angry with myself. When the fog of his guilt tripping clears, your astonishment that he's claiming he is doing all the emotional work is only the very tiny beginning. I am a very self blaming person so my anger turned inwards - how could I be so stupid? Etc - but of course I'm not you. Nonetheless I wanted to share because you might find yourself overwhelmed with relief at the same time as anger or disappointment in yourself or others. I had and still have trouble trusting my own instincts now because i was so shaken to learn I'd let myself be abused for half a decade and that she had convinced me of all these negative things about myself, some of which are literally the opposite of the truth.\n\nCongratulations on standing up for yourself and for leaving. You are doing the right thing. You will be just fine. You will recover from any complexes you've fostered through managing his abusive behaviour, but counseling and self care and wide open eyes can really help.",
            "For what it's worth, I'm proud of you, OP:) if you don't mind me asking, how did he react when you said you were finally leaving ?",
            "> \"WE WENT ON A DATE WHAT MORE DO YOU WANT\".\n\nHe sounds like my own selfish ex, who behaved as if he wanted a gold star for doing the bare minimum of \"effort\" in our relationship. I'm glad you're leaving him.",
            "AND he yelled at you after the stonewall incident--that sounds like he even broke that promise at least once.\n\nYeah, I think you're right to be done, he sounds done himself. So sorry, OP. Here's a little bit of a silver lining though: it will be easier to deal with everyday life without him?",
            "It sounds like staying in the failed/ing marriage is much more comfortable and safe for him. He's interested in the immediate gratification that comes with that state of being, but is unwilling to put in the long term work that is required to keep any truly functioning relationship afloat or live in the reality of the situation, especially in this 21st century. I am sorry for you that it has come to this, but take care of yourself and your children and everything will sort itself out in the end. Best wishes.",
            "Hey, you'll be OK. You sound like a fantastic person. Your life begins again now.",
            "Sometimes counseling gives you reason to stay. Other times, it makes clear the reason to leave. The good news is you don't have to second-guess yourself. You have done all you could do to find a marriage underneath all this pain and selfishness. But there isn't one there, so you can stop looking and go on with your life.",
            "I am struck by the fact that you mention him yelling after he supposedly stopped. Then you type his words in all caps (yelling).  He must have REALLY been yelling before. \n\nYour realizations after counseling are so well written and such a good example of how counseling turns out to be divorce counseling.  The counselor created a safe zone and once you felt more safe, you sanely decided to leave.  I wish you all the best, but do be careful because when he realizes it is truly over, he's going to go back to yelling and maybe worse.",
            "Sounds familiar to me.  He's one of those tangled web of emotional abusers.  Get ready - it may get worse.\n\nWhile I was 100% sure and completely relieved to get my ducks in a row to leave...the abuse escalated.\n\nHere it is 9 years later and I've not had a huge problem from him in almost 2 years.\n\nWhy?  Because it took 3 TRO and and all-out No Contact order when he threatened to kill me in my own home.  All in the years after I left and even though he replaced me instantly and remarried my ex-friend.\n\nThey're divorced already. \n\nBut anyway, my point is, the biggest risk to leaving an abuser is that the abuse escalates.  So be prepared.  Be strong.  He didn't follow the \"rules\" during your marriage.  In divorce, even more bets are off.\n\nBest wishes.",
            "This won't be popular and i understand where you are coming from and why you need to get out of this relationship.   Your husband sees you not tiptoeing around his feelings as not caring.   He probably thought that for years you cared about him because you cared about his feelings.  This change looks like to him that you don't care.  This is why he feels like he is making a good change with no yelling and he feels you are doing less for him by not reading his moods etc.  \n\nHis perspective is important to understand but it seems that the he wants something that is no longer acceptable to you.  ",
            "I am almost two years out of a relationship eerily similar to this and it was the BEST decision I ever made!  I know it's fucking terrifying, especially after being with someone for so long, but if you're experience is anything like mine, and I think it will be, you are about to outgrow this man and this situation like you wouldn't believe!  The year I left my ex-husband was the hardest year of my life but it paved the way for the best one yet, and I actually feel like it's going to continue to get even better!  It's so worth all the scary, difficult work to get to a place where you can be fully you, no apologies. Walking on eggshells and managing someone else's happiness usually means completely sacrificing your own.  It is so exciting to hear my own voice again and see it actually have power in my life.  Don't doubt your worth for a second - you deserve to be heard, you deserve to be YOU, whatever that means. You can be happy all on your own and when you are, if you want it, that's when you can find someone to share that happiness with who truly deserves it and has their own to share with you. ",
            "Parents living unhappily together is way worse on children then parting ways and sharing custody. I was much less stressed and affected by my parents horrible relationship after they finally split when i was 14. You only have one life, that's no way to live it. ",
            "I am so proud of you, I remember your original post and I was worried about the direction that you where going in but this... This is amazing. I'm so happy that you were able to see for yourself the wrong things that you were putting up with. Good on you, and your post really is inspiring honestly for remembering that you have self worth. \n\nI think you're going to be just fine. I really do. ",
            "I'm so sorry. It sounds like you will feel quite of a lot of freedom when you are finally on your own again, though.  You have been doing all of his emotional labor for him, and that is why he is begging you not to leave.  He will have to learn how to deal with his own feelings, and there will be nobody to blame for his unhappiness.   ",
            "[deleted]",
            "This sounds like a really, really hard wake-up call but it's a positive one also. I'm convinced it will reap rewards for your well-being in the long run. \n\nwell done for taking the initiative and standing your ground about counselling. That was a brave move. \n\nHow are the kids doing, do you think they will accept it? (Depending on their age and level of understanding obvs)",
            "This was so painful to read. I'm so sorry for you, ma'am. \n\nI haven't been in any relationships myself, so I can only imagine how lonely you feel. \n\nI have an analogy, though. Kinda.\n\nI think your husband is like a baby and you are his mother. He demands you to do everything for him, but once you want to leave, or even do something that makes YOU happy, he cries a fit. \n\nHe needs to grow up and see the big picture, but, keeping his age in mind... I don't mean to be the pessimist, but I don't think he'll be putting on his big-boy undies anytime soon. \n\nI really hope things get better for you. :) ",
            "So he had homework to stop yelling? and your homework was to ignore your husband when he is obviously upset?\n\nExcellent marriage counselling right there.\n\nHow about, get to the root of why he's yelling and work on that. For example if you were lazy and messy in my house constantly then I would yell at you too (fix the cause not the effect). And ignoring your SO when they're obviously upset is just selfish and ridiculous.",
            "[removed]",
            "Ok, as someone with an aspie boyfriend it sounds like your STBX also has a similar disorder... obviously I'm no doctor, but from my experience this is exactly how he would respond to things. In any way this does not justify his behaviour I just thought it might be an interesting insight to share with your counsellor maybe? ",
            "[deleted]",
            "I don't think you have a great therapist if you're not talking in each session about how the last exercises are working out. What does he say in the session when you talk about how he failed to hold up to his end of the bargain?",
            "This isn't meant to be a criticism, but I hope you have learned that in the future, the precedent for what you expect from your next husband and how you will yourself behave in order to demand what you deserve, should be set during dating. I think it's common for people to sweep things under the rug and assume that over time things will \"work themselves out\" but as you learned this isn't true. They need to know how to treat you BEFORE you get married, after you get married it's too late. Though he is clearly not a good husband, it's important to take responsibility for what you did wrong (not setting the precedent early on) so that you don't repeat this pattern in the future. Good luck!",
            "The lie men and women tell ourselves\n\nMen \"she won't change on me\"\nWomen \"I can change him\"",
            "Sounds like leaving is the best option. Be strong and good luck!\n\n\n> He really doesn't want to lift a finger. He seems to lose it completely at the thought of my leaving - cries, seems desperate - but it translates into ZERO action.\n\nIs he \"on the spectrum\" [autism]? If so, could it be that change is super difficult for him?",
            "He clearly has some kind of major internal block that is actively preventing progress in your couples counseling. You have concluded that he doesn't want to lift a finger, but have you truly considered his perspective? Something major has come along and questioned some basic premise(s) of his understanding of his world. He sees you as a threat right now and is acting in self-protective ways, i.e. avoidance (wandering at the museum, not reciprocating affection) and defensiveness (responding to you with inappropriate emotional outbursts).\n\nYour counselor should be nudging him towards one-on-one counseling and giving you both tools to reduce any perceived threats during this extremely sensitive period in your relationship. You need to be actively reinforcing the bedrock of your relationship right now so there is *somewhere* for his executive brain to go when his amygdala screams \"fight or flight!\".\n\nIf you really are done with this relationship, then you are done. But ideally, you both should make a clear-headed and unemotional decision to end it together. The second you bring an attorney in, the relationship will be completely dead.",
            "[removed]",
            "\"I no longer try to read his mood.\"  Would you want to be in a relationship with someone who (proudly, apparently) makes zero effort to intuit your mood? If yes, why not live with a different stranger every week then?  What's the point of being in a relationship if not to do some reading of your partner.  I'd be careful about throwing the baby out with the bath water here.  Don't take your counselors words as gospel or some higher truth.  Counselors have bad relationships, too. Yes, guy are not responsible for managing his emotional life, but I'd be careful about taking things too far with your next partner.  He may take your attitude as coldness when you really aren't a cold person.  Just my 2 cents."
        ]
    },
    {
        "post_id": "epslgg",
        "author": "throwawaydaughter001",
        "title": "Update: My stepdad(M40) and I(F20) play video games together and my mom(F46) is feeling left out.",
        "url": "https://www.reddit.com/r/relationships/comments/epslgg/update_my_stepdadm40_and_if20_play_video_games/",
        "score": 2740,
        "num_comments": 89,
        "created_utc": 1579221644.0,
        "selftext": "Update to this [post](https://www.reddit.com/r/relationships/comments/enqf1y/my_stepdadm40_and_if20_play_video_games_together/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nEdited for better clarity. \n\nUpdate: Things have been really good since I made my last post!! My mom and I sat down and made plans to get some board games, that are 2 player+, so we can all play together, even if someone is out of the house. She is also considering picking out some video games that interest her so she can learn the system, and is open to trying my games out as well. My stepdad and I have been individually hanging out with her on her time off. \n\nI wanted to also follow up on a question I received on my previous post about if she was truly feeling left out: I could tell just by her demeanor that she was a bit distant during the time that my stepdad and I played games together. But also, I think I may have been projecting my own feelings and maybe making the situation worse than it was, since I will never know how she truly felt. This question really made me think about the deeper aspect to the situation, and as I said before, my mom is my best friend. I came to realize that I was also feeling a bit disconnected from her and missing her presence. It’s perfectly fine to have our own hobbies individually but in this case I think there was just prolonged isolation that led to insecurity, from my own side at least.\n\nI can’t say that the situation is perfect and resolved yet but there is definitely progress being made! And that is relieving. I’m excited to have these future bonding times as a whole. \nThank you to everyone who weighed in and took time out of their day to help me out. It truly means a lot. \n\nTLDR; We made plans to hang out together more. Thank you.",
        "permalink": "/r/relationships/comments/epslgg/update_my_stepdadm40_and_if20_play_video_games/",
        "comments": [
            "This is incredibly sweet and I’m glad it’s working out",
            "Not sure about what system you use or games your mom might like, but Stardew Valley is great for solo and multiplayer!",
            "Great update!\n\nIf you find that your mother isn't really tapping into the game thing, consider trying games with cute/whimsical imagery, like the Lego ones or Carnival Games. I'm around her age, and hyper realistic games weren't a thing when I was a teen (the technology to support it didn't exist). A lot of our games had a \"cute\" aesthetic. I still much prefer those games to modern mainstream stuff. \n\nThe other thing is, it may take her a while to wrap her head around a not-completely-linear playing style (exploring rather than a set progression). Old-style gaming from our youth was very linear - apart from anything else there wasn't necessarily the processor power to support multiple elaborate pathways. You may need to actually explain that's how it works, because if you're expecting a linear play style, it isn't immediately obvious.",
            "Cool! /r/boardgames is a great place for good game recommendations. It is a huge hobby right now and there are tons of great games out there.\n\n(If you are looking for only 2p I highly recommend Patchwork - it's pretty cheap, easy to play and has a lot of depth)",
            "Definitely check out /r/boardgames for some ideas. I'd take a look at some cooperative games like Forbidden Island or Pandemic; it is easier getting people into the hobby if you're all winning together rather than one person just demolishing the rest. Also, look for games with minimal setup and playtime so you don't have to commit to a multi-hour session every time.",
            "Yooo get Stratego!! Winner plays the person that sat out the first round.",
            "As a family, do you guys do things that fit your mom's interests? Rather than expect her to conform to what you and your stepdad like, do you guys spend an equal amount of time doing things that she likes together?",
            "Not sure what game system you have, but you might want to try super mario party if you have a switch. It's kind of like a boardgame video game hybrid with mini games. It's really easy for beginners.",
            "This is so wholesome. Thanks for the update!",
            "Sushi go is a fun fam game that can also be played with just two. Very fun!",
            "I highly recommend trying out some cooperative or conversation generating board games!  Hogwarts Battle is one of my favorites and is a good gateway game as it builds in complexity as you play the year campaigns and teaches some good basic gaming skills, and if the goal is quality time together, the cooperative nature lets that be the main focus. \n\nDixit is another favorite. It’s technically competitive, but ends up being more about getting to know how the other players think and it can lead to some really interesting conversations about why someone chose a particular word when describing a card.",
            "I commented elsewhere about game recommendations, but also wanted to recommend maybe you and stepdad also participating in one of her hobbies?  \n\nIt might be a nice gesture, plus you might enjoy it as well.    :)",
            "You should get Untitled Goose Game!! It's really approachable for people who know nothing about games and fun to watch in case she's too nervous to hold the controller.\n\nI also recommend Gizmos for a board game - it's 2+ players and involves enough strategy that it's fun for board game experts, but enough luck that it's possible to win for novices. \n\nI'm so glad you've reached out! Your family sounds really sweet :)",
            "I'm sure everyone's made suggestions, but Settlers of Catan and Ticket to Ride is great. They're board/card games.\n\nWhat video games do you and your stepdad play, out of curiosity?",
            "Can 1000% reccomend getting her Skyrim as its really beautiful and its how I learned to get really into gaming because you can set it to easy and you learn as you go... plus PRETTY!!!",
            "I’ve been playing video games with my mom! We started out playing Mario games, and then yoshi’s woolly world. Now she loves playing them and I love spending time with her",
            "Wow. Good on you for trying to include your mom. I'm having the exact same experience with my mom and stepdad. It's been pretty rough the last year so ive grown very distant from my mom and my step dad. It makes me sad, but ive been trying to hangout with them more. I feel very bad for my little sister as well, because she is only 10 years old but I believe she gets lonely when i am gone. Thank you for this post. It may not seem like much to you but i appreciate it dearly. Hsve fun playing board games and video games.",
            "The Witness is a really awesome, slow-paced puzzle game on PS4. Not sure what system you have, but I would highly recommend that game.",
            "My fav board games that play 2+ are. Love letter is a quick, sweet game . Carcassone is a classic that plays 2-5, splendor too. Grimm forest is great as well as mystic vale! :)",
            "Try out Minecraft. Diablo 3. Mario Kart. Let's Go Eevee/Pikachu has a co-op to it.  \n\n&#x200B;\n\nHeck, dive in and roll up some characters and do some D&D!",
            "Stardew and lovers in an dangerous space time! I love Lovers it is so much fun. People who are more gamer experienced and do the more difficult parts and those who are not can do easier things. My SO and I have played with his mom and grandma and he would control and I would do most of the shooting. \n\nAlso, Mario party, I think it's Kriby Adventure. Those are all up to 4 players. \n\nBoard games, we love Gloomhaven, DnD board games. Although those can be difficult if you don't have basic game understanding I think. Exploding Kittens is hilarious and super easy for those who don't have game understanding, it is a card game though. Also, just playing cards can be fun too. My SO and I do this every Christmas with his Gandpa, Mom and Grandma.\n\nSo exciting she is willing to try!",
            "This makes me so happy! Love this",
            "They're both very lucky to have you.",
            "You sound like a really nice girl",
            "A video game that is easy to learn and play is Overcooked. It's co-op so you can have a nice bonding moment over trying to work together to beat the levels.",
            "A board game that is awesome for two but also for a family is Carcassonne. Its a little complex but super fun- its rather short, about 30 min but you can get expansions for it to make it longer. Its been our families favorite ever since I was like 4 so you can check it out if youd like-\n\nIm glad everything worked out with your mom, i hope this time spent together will really bring you closer!",
            "god damn i promised reddit i wouldnt happy cry today",
            "This post makes me happy! \n\nMe and my mum played Fable 2 co-op back in the day. It was one of the only games she could get to grips with but she felt so accomplished whenever we won a fight or completed a puzzle (she has MS so I was worried her motor skills would have been affected with the controller). It was fun and it's a nice way to bond and make memories. \n\nI keep seeing Statdew Valley recommendations, I'll have to think about introducing it to her sometime.",
            "You seem like a very insightful, empathic, and intelligent young woman. I'm proud of you!",
            "You’re a great daughter! My son got me hooked with Don’t Starve years ago. It’s fun, cheap, and you can all play together. For one that’s visually stunning try Breath Of The Wild. It’s gorgeous and peaceful. Sometimes I’ll just watch my son play on the ones that have a great story and scenery like BotW and Red Dead Redemption. I’m proud of you for caring so much about her involvement, I know she appreciates you caring so much",
            "You're a good man, a good son. God bless you!",
            "Yall should get into Dungeons and Dragons, find a dm and be a 3 person party!",
            "I always liked the lego games for bridging generations. They're easy to play and have some like Star Wars and Indiana Jones that she might have enjoyed as movies.",
            "As a stepparent I just want to say how wonderful it is that you are bonding with your stepfather. It's even better that you're including your mom. You sound like a great \"kid\". Being a stepparent is super challenging and the only thing that makes it worthwhile is being able to spend time with the kids in a way that you both find fulfilling.",
            "My partner and his sons are all gamers. I being a 45f was not but I wanted to join in the fun so I played Red Dead Redemption and GTAV. A lot of fun. Now I am playing Skyrim. But we also play a lot of board games, dice or cards - Smash Up, Exploding Kittens, Nefarious, euchre etc. I am not into watching sports on tv but his one son is so I try to ask questions about his teams, playoffs etc. Sometimes it is hard to connect when you don't have common interests but each side has to make an effort. It is so sweet that you are making an effort.",
            "I love that you're reconnecting with your mom and including her! I'm a big board game person and I really like Patchwork as a simple, two player game. My boyfriend and I also really love playing Watergate (2 player game where one person is Nixon, the other the Washington Post during the scandal), it's really fun but can get a bit competitive. But, Last Christmas we brought a bunch of board games down to visit my parents and my mom really loved playing Happy Pigs, it's a cute game where you're trying to raise animals and grow your farm. She acted like she didn't know what she was doing, but she was able to apply her real world skills (owning and growing her own business) to the game and had an absolute blast destroying us! It is requested for every visit now :) Hope you find an activity that you can enjoy together!",
            "I have a similar family set up with video games and my mum isn't as into them so to ease her into playing then I got her playing beyond 2 souls. I know it's a one player but the controls are basic, in game combat it tells you exactly what to press on the screen and with dialogue choices everyone can be a part of it and it's kind of like watching a movie. Since then she's been getting into tell-tale games, again just dialogue choices and simple buttons. Some triva games got her used to where the buttons are on the controller. Recently I went to visit, her and my step-dad are going to play Spiderman she loves puzzles and he likes combat, they both want to web shoot around.\n\nMy little brother got them playing Lego games, Minecraft etc and most recently they both joined me and my brother playing screencheat which was a chore to teach but fun once they got the hang of it.",
            "wits and wagers is a fun game for multiple people!!",
            "Scythe, Dominion, Carcassonne, pandemic, dead of winter, small world and terraforming Mars are good games to start with. Not too complicated and fun.",
            "Super Mario Bro’s deluxe. I bought it specifically to play with those that aren’t into video games. Easy to learn and really fun multiplayer :)",
            "Isn't Marvel Ultimate alliance 1 & 2 on sale on the ps4? They're 4 players.",
            "\"Lovers in a Dangerous Spacetime\" is a great game for people who are not gamers and hardcore gamers.  Up to 4 people play at the same time on one console, so you can all sit together.  You control your own little dudes but cooperate to manage a space ship.  There are different stations around the ship like engine room, shield room, gun room, etc.  You can only control one station at a time yourself, so you have to talk and work together.  It is very cute, too, and not scary or violent.",
            "If you like video games, try Magic The Gathering.   \nAll 3 of you can play together, or just two, or more!",
            "I find Portal to be a good intro game for most people. :)",
            "This post had a happy ending I'm so relieved",
            "Nice! One great 2+ player card game is Fluxx (and all its variations)! It can support I think up to 6 players, and it’s lots of fun, everyone from my mom to my boyfriend loves to play:)",
            "This is so awesome. I love seeing families that game together. It can be such a bonding experience, especially when you can find a game that resonates with all of you.",
            "These are the kinds of posts that really make my day--thanks for sharing your awesome update!",
            "If you're looking for games that are 2+ co-ops, overcooked and overcooked 2 are great and simple games.",
            "You're such a thoughtful daughter. Your mum would be so touched to know how much you love her. I hope when my son is older, we have such a loving bond.",
            "I think Portal 1 and 2 are FANTASTIC beginner games.",
            "Video games, just like our phones are seriously screwing with our dopamine levels.  It changes the level at what makes you happy, instead of seeing a pretty flower or butterfly and feeling happy, it no longer does.  Use with caution and limit how much you are playing. Are you paying for hours with your stepdad? If so than you are definitely isolating everyone and I doubt it's real quality time with your stepdad.  I would put a timer on.  Play one hour then shut the damn thing off!  I get real annoyed with my brother in law who loves gaming but when he's here, he goes in the back room and plays, I don't know why he bothers,  it's like he's not even here.",
            "Ask her if she prefered that you hated your stepfather..."
        ]
    },
    {
        "post_id": "c9t6ne",
        "author": "yikes_throwaway123",
        "title": "UPDATE: I [17] haven’t seen my sister [19] in ten years, then found out my mum [40s] was the “other woman” in my dad’s [50s] first marriage.",
        "url": "https://www.reddit.com/r/relationships/comments/c9t6ne/update_i_17_havent_seen_my_sister_19_in_ten_years/",
        "score": 2740,
        "num_comments": 166,
        "created_utc": 1562416947.0,
        "selftext": "Original here: https://www.reddit.com/r/relationships/comments/at2xk2/after_ten_years_of_no_contact_with_my_halfsister/?utm_source=share&amp;amp;amp;utm_medium=ios_app\n\nSo you guys gave me some advice and I took it. I found her on Instagram through some miracle, and I requested to follow her, which she accepted. It’s not much of an update, but she is interesting! She dyes her hair pink and blue. I don’t know what she’s actually like, to be honest. Is she nice? Is she nasty? I couldn’t ever tell.\n\nI can’t find my brother. I don’t know how to spell his name.\n\nI feel guilty. I’ll admit, a big reason why I found her is because I feel guilty. I get to have my dad. All the Father’s Days go to me, she gets nothing. He left her when she was 1. \n\nIs it bad to say I resent him for it? I’ll bet she does. I love him, but honestly? He doesn’t deserve a Father’s Day. He abandoned his role as a dad to two people.\n\nYou don’t get to dish out your love accordingly. You don’t get to pick and choose which children you’ll love and which ones you’ll forget. Yes, you’re with my mum NOW, but that doesn’t make me more of a daughter than her. But you were more of a dad to me than you were to those two combined. Do you think seeing them once a year is gonna compensate? A lonely card on their birthday with some money in?\n\nWhatever, I might try to strike up a conversation with her soon but we’ll see. \n\n**TL;DR - I found my sister on Instagram and I’m starting to resent my dad for leaving her.**",
        "permalink": "/r/relationships/comments/c9t6ne/update_i_17_havent_seen_my_sister_19_in_ten_years/",
        "comments": [
            "My story is very similar to yours, only I would be the forgotten sister in this situation. I think it's sweet that you are empathizing with your siblings situation. My dad straight up deleted me out of his life once he found a new family when I was about 7 years old. He never talked to me again after that. I have a lot of emotional damage from the situation, but my life turned out good regardless. I think it would be nice of you to reach out to your sister. It's ok to love your dad, because he was good to you, while also losing some respect for him not contacting his other kids. Adults aren't perfect and sometimes they make wrong choices. But we can still love them regardless. Good luck.",
            "Good luck, and I hope you two connect! The slow approach sounds like a good one, ease into it by letting her know you're around and interested in her, and start a convo over a post you relate to at the right time later and hopefully build on that. Keep us updated!",
            "My Dad wasn’t quite as bad, but he did cheat on my mother and eventually left her and was a pretty poor parent after. He married my step mother (as far as I know he didn’t cheat on my mother with her) and helped raise her two children instead. I completely understand the feeling. He complained about child support and refused to do anything he wasn’t legally obligated to do. I remember it was in the divorce decree that he’d cover medical and he refused to buy my brother braces he desperately needed. I do not resent either of my step siblings. I also do not know them because it was obvious when we were around that my Dad and step mother didn’t care about us. \n\nI wish you the best of luck.",
            "You should definitely strike up a conversation. I come from the other side of the story, albeit a bit different. My dad left me and my sister (early 30s now) when we were 9 and 11. He had a new woman he was cheating with. They eventually had a kid when I was 13, and she brought her son (then 5) from a past relationship. I tried to be \"mature\" and come over sometimes but my stepmom hated me and my sister and made it very clear. My dad didn't really care, he had no interest in being a parent and was fine just taking my sister and I for dinner now and then. Eventually when I was in my early 20s I just cut them off. I was sick of my stepmom talking shit about me to my face and my dad just watching. My siblings were in their teens and we basically had no relationship because they were so much younger. \n\nNow, I'm in my early 30s and they're 20 and 25. I started messaging them in a group chat on insta with my other sister and it's actually been fun to get to know them. We have done games nights and gone for lunch etc. I don't blame them for what happened, they were little kids and their mom loves them and it isn't their fault our dad is a cheater and their mom was mean to my sister and I. I just woke up one day and realized that one day our parents will be gone. This is my sister, and step-brother. I wanted to know them as people regardless of the past. I'm the oldest, so I took it upon myself to get the ball rolling. You and your sister are closer in age so I think it would be very kind and mature of you to reach out because she's the one who was hurt most here. Good luck!!! 🥰",
            "I hope you guys can work towards a healthy or at least cordial relationship!\n\nAs far as finding your half-brother, this kind of sounds like the creepy thing to do, but you can look at her followers or friends on her social media and see if she follows him.",
            "I think you’re doing the right things and thinking in the right ways. To have a relationship with her will probably mean not feeling defensive when she is angry with your parents. You aren’t responsible to protect or explain your parents, and your role isn’t to be an intermediary between them. It’s just to be her sister.",
            "Ok so after reading some comments something someone said reminded me of a thing that happened when I was younger.\n\nI can’t have been older than 11, but I was on my mum’s phone and some guy texted her, calling her ‘sexy.’ I know I shouldn’t have read it, but obviously I did because I was a little idiot, and it was definitely a two-way conversation.",
            "I think you REALLY need to have a sit down with your dad and have a talk. This is clearly weighing on your mind quite a bit and isnt healthy to keep inside.",
            "This might not be the most popular answer. I was in your situation. I honestly didn't know what to do when I actually found out, because I had an amazing childhood with two loving parents that were (and still are) madly in love. It was hard to believe that they had this whole other life and that one marriage was ruined so they could be together.\n\nI actually requested to my mom that I needed to find a therapist to talk to about it. Which was very helpful. And I did reach out via social media to the sibling in question. It wasn't really awkward at all. Although I did hear some things about them resenting the family unit that they wished they had. It was super sad and I realized how lucky I was. However, it was a stepping stone to a relationship. After we hashed it out we started to make an effort to communicate more often. Eventually we both became adults and the relationship was just easy. My parents didn't have other children so I'm happy that I have a sibling. We don't really talk much about the past and enjoy our relationship as it is. \n\nAs for my parents. I came to terms with it. You will as the time goes on. I can't speak for my sibling obviously, but my shock and resentment faded. Possibly because I did have two awesome and loving parents. I would definitely recommend talking your feelings out with a therapist. It was very helpful to me.",
            "Try to create a relationship with her . be more to her  than what your parents decided to do.\n\nShow her that blood may make kids and siblings but family comes from love.\n\nBoth of you are pawns in your parents' unfortunate situation.  But now that you both know this and have reconnected, you can be the sisters that you are meant to be.",
            "Part of growing up is learning your parents are flawed human beings, just like everyone else.",
            "Hey I have a sorta similar story to yours about a half sister. Just wanted to let you know I’m sorry and I know it sucks. I was super bitter (still am bitter haha) at my dad about it but a lot was my mom’s fault too. I don’t have any real advice but maybe talk to your dad about it too and see if there’s more to the story because it all is a little weird, granted it’s a weird situation to begin with. \n\nIf you want to reach out I’d encourage you to. Worst case scenario she doesn’t really try to have a relationship. Mine reached out to me but we don’t really talk a ton bc of distance and age difference but it’s nice seeing good stuff she posts on social media and semi seeing some of her life. \n\nAnyways I hope all is okay for you! I know it’s a sucky situation to deal with.",
            "[deleted]",
            "I don’t know if my story will help you, but I think there is a (very slight) possibility that this might not be 100% on your dad. My father cheated on my mother. It was wrong, and it destroyed their marriage. They had joint custody of us for the first year after or so, and then I didn’t see my dad regularly until I was 17 (they split when I was 8). My older sister and I tracked him down and confronted him for abandoning us. It’s worth noting that my mother and my stepfather were and are extremely abusive, and my sister and I blamed him for leaving us in that situation. As it turns out, the reason he stopped seeing us regularly is because my mother told him we cried every time we came home from his house, that we hated it there and hated spending time with him and didn’t want to go anymore. He believed her, and didn’t want to put us through more pain after watching our parents split up, so he stepped back. He sent cards and came to birthday parties, but we didn’t stay at his house or go places with him. Obviously, it wasn’t right for him to stop seeing us, even if we had been complaining about it. We were 9 and 11 years old, and we shouldn’t have been trusted with that decision. But my mother also shares a lot of the blame. She lied about and manipulated her own children in order to hurt her ex husband, and we were the ones who lost out.\n\nI am not blaming your dad’s ex wife. But you said yourself that she hated your mom and your family, and I’ve met a lot of people with parents like mine who had one parent poison them against the other. Your parents made a bad decision, but unless you know for a fact that your dad willfully abandoned your sister, I don’t think it’s necessarily fair to dump all of the blame on him. There are three adults involved in this situation, and it kind of looks like none of them are blameless.",
            "I read your original post. Prepare yourself to find out this is all your mom's fault. Your sister stopped visiting at after she told you the truth. Also, you don't see your older brother but dad plays video games with him often? That's odd. \n\nDoes your dad have any friends outside of work? Does he ever hang out without your mom? Some things in your story reek of him being isolated. \n\nAlso, be prepared to find out your dad is still married.\n\nEdit: some typos",
            "Same but I’m 18 and my brother and sister are 32😂",
            "It sounds like from your old post it was the mom who poisoned the relationship. That your dad had tried to keep her in his life. \n\nA bad marriage takes both people, it’s not his fault or hers or even your moms, it’s a collective fault. Situations like this occur because their is already a problem. Nobody really knows what all went on except for your dad and his first wife. Not even your mom will ever know the full Story.",
            "Have you talked to your dad about any of this. There may be a lot more to the story than you know. Yes it was shitty your dad cheated but he was still a good dad to you right. It's not your fault the adults in your life acted shitty.",
            "[removed]",
            "You are very thoughtful and mature",
            "I am in your sisters position, and it’s great you want to reach out and see your dad’s flaws in the situation. I’m 19 my sister 14. My dad’s new daughter is 1. He left us 7 years ago. It’s hard because part of me wants to hate my younger sister and I have to stop and remind myself that she is innocent in all this and it isn’t her fault. I hope your sister can see that to and you guys can build a relationship.",
            "I have 6 siblings and only the two youngest have the same parents. \n\nMy mom even gave away her first child and we didn't even know about her until she was 18 and I 12. My older sister still resents my mom for taking away a part of her life that she'd never know. I personally am jealous my sister didn't have to deal with abuse or our stupid cult of a religion. \n\nThe two youngest are from the teen that used to babysit us, who my dad cheated on my mom for and even beat over. They had a house, a dog, newest TV's and consoles they went on vacations and traveled.\n\nWe can't change our parents or our pasts, and everyone will always be looking at how greener it must have been elsewhere. I would recommend starting a conversation with \"Hey, I don't know what went on with our parents, but I don't care about them, you're my sister and I'd really would love to have a relationship with you\".\n\nAlso just Google your brothers gamertag, it'll probably pop up stuff about him. People usually share usernames across social media and consoles.",
            "Sadly I was essentially in your sisters situation. My dad left me at 4 years old and had another family.\n\nI have no idea why anyone would think it’s acceptable to abandon their kids but I can tell you from experience that it can very easily set you back without you even realizing.\n\nThe best way to describe it would be that I grew up with 50% of what others did and only realized this when I was grown up.",
            "I didn’t know about my older half sister until I was 12 and she was 19. Her mom told my dad that she was going to raise her and she didn’t want his help, and then he signed his rights away. It took me a little while but now I definitely see how he wronged her.",
            "Your dad cheated which was bad, but you don't know that he gave up being a father to his other kids. He could have tried for a long time to see them as much as possible just to have been blocked by his ex-wife. You should talk to him about this, he's the only one who knows the full story.",
            "Maybe he wanted to be there but their mother didn't let him. You should give him the benefit of doubt until you can seat down and ask him what happened",
            "You shouldn't feel guilty at all, you have no responsibility whatsoever for your parents' decisions. Your resentment towards your father is 100% justified.  Looks like all adults suck here.  \nHappy or sad marriage, your parents were shitty for cheating. If your dad's marriage was so bad he should've ended it before messing with someone else. Your mom shouldn't have been \"dating\" a married man. Your father should have never stopped being a father to his kids from his first marriage. Your dad's first wife shouldn't have poisoned her kids relationship with their half-siblings, regardless of what happened.  \nIf you want to talk it out with your parents it's your right.  \nBest of luck in reuniting with your half siblings!",
            "Sorry to hear that, but also... great to find new family!\nI’ve recently found that I have 2 siblings, oldest being 20. Of course you’ll never have that strong bond but it’s never too late to try and become good friends!",
            "It's your father's fault not your fault \nGo find a way to met your sis and talk to she",
            "You are lucky and hopefully a relationship will develop between you two.   I have a similar story but I found out WAY too late.  My sister died young (26 yrs) so I never had the privilege of communicating with her.   I do have a photo - she was a lovely woman.",
            "My dad was the Johnny Appleseed of kids in Ohio. I later found out I had 3 sisters and my sister I grew up with wasn't his. I have only one full sibling, my brother. But our father pretty much bailed on all but my brother and none of us had contact until about 6 years ago I made contact with them all. It's been amazing, I hope you guys connect well. We all kinda have bad feelings for our father but we don't let us be a storm cloud over us, we all do better and work together to make up lost time. Best of luck!",
            "Make sure to tell them this. I think you have a great perspective about this. My dad left when I was a teenager and raised someone else's kids. I feel resentful for this, of course. I imagine she does too. It isn't your fault though, remmeber that.  I wish you luck in rekindling a relationship with your siblings!",
            "I read this and made me ask my mom about my dad too. \nIt started out that my last name was a borrowed one then i asked about my Dad\"s name and last name. P.s never seen my dad or know his name. Found out my mom was also the other woman while my dad had kids. My mom said my half siblings are like 30yrs + and dad is like 60. \nIm not sure if she knew if he was married tho cuz my sht of a dad hit on her while she was working at a grocery store 😤.  Mom cut him off after my dad met me when i was 3 apparently. I'm 19 now so I can take take all this sht and not be bothered much. Im just really curious who's my dad.",
            "Remember, there are two sides to every story and you don't even have a full one side yet. Custody situations can get tricky, especially when one party is holding a grudge. You don't know that your father chose to not see his other kids, give him the chance to explain before you rush to judgement on him. It's possible their mother holds a good deal of blame for her kids growing up without their father.",
            "I have a question for OP. You have opened up a conversation between my husband and I about our situation. Our stories are not quite along the same lines other than his wife cheated on him. My question is how do you feel about your mother in all this? Has your view of her changed since finding out the truth? I know one day his kids will want to know, or may already know but are too young to comprehend the situation and we are curious about how that might change their relationship with their mother.",
            "I think it's great you're taking a step towards getting to know your half-sister again.  You both have very strong feelings about your mutual father, but that doesn't have to lord over your future relationship with her -- don't let that cloud everything between the two of you.  What he did wasn't your fault and it wasn't your sister's fault.  How the two of you decide to move forward with your sisterhood at this point is up to the two of you, not up to him, or your mother, or her mother.  Good luck and I think this is a wonderful development for the both of you, and hopefully very healing as well.",
            "Oh lovely person. Those adults (your parents  and your siblings mum) made decisions for themselves, and here you are today. Please do not feel guilty. \nAlso, your dad cant go back and change the past so please, love him, treat him as he should be treated by his current behavior. \nI like how considerate you are being in your approach to your sister. Be ready for any kind of reaction from her though, she likely wont feel exactly the way you do. \nLove.",
            "I do not understand what kind of man could just abandon their kid. I have a stepdaughter and if my husband wasn't in her life I wouldn't be in his. Good for you to be mature enough to consider your half siblings feelings.",
            "Do either of your parents have a workplace EAP (Employee Assistance Program)?  If so, they have great counselors that you can access for free.  Normally you can get 15-20 hours of free counselling to talk to someone.  It may help just to speak with someone who is not involved in the situation.",
            "Do you know if it was your dad's choice not to see his other daughter? Maybe it was his ex's",
            "Honey is not your fault I’m sad to say is your parents. Slowly get to know your siblings go to therapy to help you with this issue. Talk to your father and talk to him about this situation. Did the wife confront you mother and father when she found out the truth. Plus don’t believe what they told you about the wife she might have been a nice person but was very upset when she found out the truth.",
            "You should talk to your dad. That anger and resentment is valid but he was a good dad to you (I think?) which means that maybe he changed/was genuinely unhappy with his first wife.\n\nDon’t carry this pain and resentment, talk it out with him or with a therapist.\n\nAnd take your time with your sister, you can always just say you want to get to know her and your brother but will take it slow. Don’t put any expectations on it because there’s a lot of hurt feeling all around which will manifest in odd ways. Good luck!",
            "You're only 17...you have that idealistic view of the world...that will change with years and experience. Dont judge...be open and understanding.",
            "I don’t think you should feel bad, or be angry at your father...  sounds like he was in a loveless marriage and was unhappy.  It sucks he cheated, but he has been with your mother for a long time.  He deserves happiness too. \n\nAs far as with his daughter, it can be very difficult for a someone to have a relationship with their child while the other parent is poisoning the kids against them.  \n\nThese are all adult problems, and you should just try to have a good relationship with you half siblings, and not worry about your fathers relationship with them.  \n\nGood luck",
            "I dye my hair blue, purple or green however I watch wayyyyy too much animeand nothing to do with \"daddy issues\" that comment was irresponsible, ridiculous and possible sarcasm yet inconsiderate nonetheless.",
            "Both of your parents are responsible for their crappy behavior and morals. However, I wouldn’t be too harsh on him being a father. There may be details that you’re not aware of. It seems he was quite involved with your half sister/brother, as you say you spent a lot of time together until you were 6. Having them over as often as he had them doesn’t sound like he was abandoning them to me. Perhaps something came to light, or there was some conflict that caused your father’s ex to keep their children away from him. \n\nI understand your resentment towards your father, but talk to him to understand what happened and why he was no longer part of their lives after regular visits.",
            "I think you may need to talk to your dad, and let him tell his side. There's a possibility he didn't abandon your half siblings. My dad doesn't have a great relationship with my older half brother, but he's an excellent father. His first wife ran off before my brother was a year old, and hid until my brother had to register for school. My brother was led to believe his step dad was his real father all those years, and once he was reintroduced to our dad when he was 5 his mom started shit talking dad every chance she got. My brother was pretty distant from us until his teens, when he started to see for himself my dad wasn't a monster. But it severely damaged his relationship with my dad, step mom and all of the siblings. It's up to your sister to decide what kind of relationship she wants, but it seems like your dad was a good father to you. You can still love and care about him, but still be disappointed by choices he made/makes.",
            "He ain’t shit. I be smashing on my dad for not fucking with my sisters because it’s like you not the loving man I think you were you’re willing to leave your seed, my siblings like that? So if you got mad at mom you’d do me the same? Like nah he ain’t cool and coming from you will def make an impact.",
            "Yes we should!\n\n\nExcept - I don't know how to do it lol",
            "I think I’m gonna call this story some creative writing. Your dad abandoned your half siblings so he doesn’t get to be your dad? That sounds pretty ungrateful for what you had and if I was your half sibling I’d resent you even more for not appreciating that you at least got to have a dad in your life. Also you apparently know some of the story but I’ll just say this you can’t really judge any of it properly. You don’t know the full details of anything nor have you been in any of those situations. Never been a parent, a spouse, or even an adult. Nor did you grow up without your dad who apparently treated you very well. I’d advise focusing on trying to make a bond with your half siblings if they seem open to it and if that’s what you want. However, I’d calm down with your judgemental criticism and righteousness on anyone else in the situation. You’ll only lose family members acting like that.",
            "[removed]"
        ]
    }
]