[
    {
        "post_id": "4z2bmp",
        "author": "chuckedaway6969",
        "title": "[Update] Too soon to tell my [27m] girlfriend [28f] I love her after 3 months?",
        "url": "https://www.reddit.com/r/relationships/comments/4z2bmp/update_too_soon_to_tell_my_27m_girlfriend_28f_i/",
        "score": 2736,
        "num_comments": 133,
        "created_utc": 1471894397.0,
        "selftext": "da op: https://ud.reddit.com/r/relationships/comments/4xnc5y/too_soon_to_tell_my_27m_girlfriend_28f_i_love_her/\n\n\n\nI ended up getting sick during my flight back so my big plans kind of collapsed and we just stayed in Friday night. She was taking care of me so sweetly, and when we were lying in bed together I felt so happy I just had to tell her. She said for her this is really serious thing and she needs some time, but wasn't weirded out or feeling pressured or anything, and instead was happy. I was perfectly fine with that and mentally accepted that 'OK, if things keep going well I can wait however many more weeks or months it takes her to feel comfortable saying it.' \n\n\nWe spent a romantic weekend mostly just cuddlin' and fuckin' and taking nice walks. Monday morning when she was getting on the bus to work and we were parting ways she said 'Goodbye, I love you' so matter of factly and out of nowhere my heart almost exploded. I was going around with the goofiest smile plastered across my face all day and wanted to sing and dance in the rain. Happiest I've ever been in my life. \n\n\n\nTL;DR: She loves me back and the whole world is roses and sunshine! :D Thanks for reassuring me it wasn't freakily-too-soon",
        "permalink": "/r/relationships/comments/4z2bmp/update_too_soon_to_tell_my_27m_girlfriend_28f_i/",
        "comments": [
            "Stop it. This is too sweet.",
            "As someone who fell stupidly in love with her partner.. Two WEEKS into talking... Two years later? I still am stupidly in love with the same person.. And I literally LITERALLY told him. 'You're going to think im some crazy freaking lady... ' Because I felt that I wanted to say it, stopped myself from doing though, even though it wanted to come out. I thankfully escaped the dreaded blurting it out. BUT, He coaxed it out of me only to say the same thing right BACK. We honestly couldn't be happier :)! Congratulations! I'm happy for the both of you! Keep smiling and make sure you keep letting her know just how much she means to you!",
            ">TL;DR: She loves me back and the whole world is roses and sunshine! :D\n\nThis is the most adorable thing I've heard in ages! Have at it, you crazy kids :)",
            "Well that was quite a change of pace from the usual relationships post.\n\nEnjoy the ride my man ;) cheers",
            "How wonderful :)\n\nMy guilty secret is that I fell in love with my SO after 2 DAYS, but I waited a whole 4 days to tell her. She said it right back.\n\nThat was 25 years, 2 children and several grandchildren ago.",
            "Woohoo dude! Happy for ya :)",
            "I told my girlfriend after three months as well.\n\n  She told me later that she was about to say it too but was going to wait until she was in the car about to leave so she could just say \"ok I love you, byeeeee!\" because she's German and squichy about emotions...",
            "I'm so happy for you yay!!! :)  ",
            "Yay! Hehe, your story even made my day. Good for you :)",
            "Not often you see such a happy post here in this sub.",
            "I have the same goofy smile on my face just from reading this! I love happy endings!!",
            "I love this. Thank you. \n\nI wish you both roses and sunshine, happiness and smiles, giggles and goosebumps - for many, many years.\n\n*Nana internet hug*",
            "Frikkin onions. There's only been one guy I really wanted to hear those three words from and instead he chose four words: \"I want to break up.\"",
            "When my wife and I started dating (after 4 years of being friends), she kept saying \"we should date\".  I thought it was a little weird cause... well, we were dating.  I'd always say, \"yeah we should totally date\" and smile at her.  And at the time I always wanted to say \"yeah, but really we should totally get married\".\n\nAnyways, months later I proposed which is when she told me every time she had said we should date, really she was saying we should get married in her head, but she didn't wanna freak me out.\n\n<3 good luck you two <3",
            "Holy SHIT look at this blowing up, that was unexpected. Thanks for all the wellwishing and cute stories everyone",
            "this is the cutest thing i've read all day",
            "I knew after a couple of months that I loved my boyfriend,  but I also knew that it was probably too early to say it. So I held out...for about two weeks, and then one night I just blurted out: \"you don't have to say it back, but I need to tell you that I love you\". He didn't say it back then, and I was okay with that. I never wanted to pressure him into saying something that he didn't really mean. A couple of months later he answered: \"I love you too\". :) And he's still my boyfriend almost two years later, so I can't have messed up too bad.",
            "WHO CUT THE DAMN ONIONS",
            "This is one of the happiest posts I've seen on here -- good on you for following your heart, OP. I'm happy for you :) \nHopeless romantic, here, alright.",
            "My wife, who I've been with for eight years, has knocked me out every time I see her.\n\nI knew I loved her very soon after becoming involved with her. I'm talking a couple of weeks. I was deathly afraid of revealing my secret, though, in case she were scared off. I could barely contain it, and would look at her, and my lips would say that I like her very much, but my eyes said that I loved her, and she KNEW what my eyes were saying.\n\nEventually it just came out and wasn't even a huge deal after that, just a burden gone, a loose end tied up. One less thing to be uncertain about.\n\nI still love her :)",
            "This is too fucking cute! I wish you two the best!!!",
            "My boyfriend told me around three months as well. We had gone camping the night before. Got back. Went out for bottomless mimosas. Went back to his place. I tried to assemble his dresser while drunk. He took a nap. I gave up and went to angry nap next to him (angry at dresser. Not him). When we woke up we were talking and saying how we \"really really really liked\" each other. And he just said it, that he loved me. I couldn't say it back right then. But the next day I did. :)",
            "someone send help ive overdosed on the cute",
            "Congrats mate.\n\nI didn't see your first thread, but just to share, I said \"I love you\" to my girlfriend 2 weeks into dating.\n\nWe got married 2 years later, it's now been 4 years and everything is going great, we're going to start trying for our first kid soon.\n\nAll the best! =)",
            "Me and bf are at 4months on dating and we said \"I love you\" to each other before dating. We had been talking about a month or so, but after like two weeks I was just in aw of him. He's so sweet and caring and just... wow! I never thought I'd love someone as much as I love him. I've never felt this way for a partner before and it's a bit overwhelming but it's An amazing experience all the same! He said it first and I was just shocked... he was scared I was going to reject him. I was like, \"No! You don't understand dude! I have such a strong and intense feeling for you and have for awhile and I didn't know that you felt the same. I love you too!\" \n\nJust go with your heart would be my best advice on this!",
            "Ah, how wonderful :) we said I love yous at 3 months too. 4 years tomorrow <3",
            "Scientifically, love happens after 2 months of deep admiration.",
            "Imma need to go to the dentist after this and get a cavity filled because this is just too sweet.\n\nI told my SO I loved him after three months and he reciprocated. 7 years and one baby later we are more in love than ever.\n\nI'm so happy for you OP ❤️",
            "Yaaaaaaay!!!!! ",
            "Happy endings for all!! Yay!",
            "This is the best kind of update!! Congrats OP!!! ",
            "Awe! My ex and I said I love you pretty much right after we started dating. But to be fair we've been friends for several years prior and have been seeing one another for like 5 months before we started dating. ",
            "[deleted]",
            "My husband told me about three months in, and I waited like four months to respond. We've been married awhile now. ",
            "Props to you man! you said it at the best time I could think of. Cheers <3",
            "Hey we said it at like 3 weeks which I didn't want to so soon but he said it first. 2 months and going strong! Congrats to you. It really doesn't matter how soon you say it, as long as you really think about it and know that it's true. I could tell my boyfriend loved me before he even said it.",
            "Bf and I were friends since junior year of high school. The day he asked me to be his girlfriend. I told him that I love him. He smiled and got all cuddly. :) Still together too for 8 yrs now. ",
            "D'AWWWW that is fucking cute. ",
            "Goddamnit, now I'm diabetic. I hate you, OP",
            "The goofy smile doesnt leave :) I did the same thing about 7 months ago and I still get a goofy smile whenever I see my girlfriend, i just love her too much.",
            "So sweet. Not too soon at all!",
            ">She loves me back and the whole world is roses and sunshine!\n\nSuch a lovely feeling. All the best to you, OP. Here's to the future!",
            "I love it! I told my sig O first (after only 2 months), and he didn't say it back for a couple of weeks, but we've been together 5 years and are engaged. A lot of times someone just has to take that leap. \n\nYAY, LOVE! Enjoy it, dude.",
            "This is the cutest thing ever!",
            "I never understood this big deal about how long to wait until you can say it. Me and my boyfriend told each other after our first date after knowing each other for maybe a month and we turned out fine.",
            "There is no exact rule or law how soon or late you should tell your SO that you love her. Nothing is right or wrong here. ",
            "I told my girl I loved her after about a month, she said it after about three months, and now we're almost one year in :)",
            "I love this! My boyfriend and I said it after 3 weeks - we're still together after 3 years. When you know, you know.",
            "For the record my boyfriend told me he loved me after we had met maybe a total of five times. We got into a relationship the third time we hung out. I normally have longer timelines, but sometimes love doesn't have one. Just happens. People thought we were crazy but two years and a home later they're not laughing anymore lol",
            "There's no such thing as a set time for these things. I told the last person I was seeing how I felt after a month and a half and she was to the moon about it.\n\nGlad you figured this out. Best of luck to you both in the future.",
            "fuck you op.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nway to go..",
            "Brought a smile to a lot of people's faces with the update. Congrats man!\n\nI remember the way it felt to finally tell my girlfriend (now wife) I loved her. I thought I had loved girls in the past, but it was totally different with her. I think I knew before I ever really told her and it took 10 months of us dating (5 months of officially dating) for me to tell her, but honestly looking back, I think I knew within the first few months. \n\nGood for you not waiting! Look how well it turned out!",
            "You just gave me diabetes and a cavity.",
            "It's never too soon, but it can be too late.\n\nDon't hesitate. If you think your feelings are true, go ahead and let her know.",
            "[removed]"
        ]
    },
    {
        "post_id": "2sak4u",
        "author": "Hairthrowawayx2",
        "title": "Got into a verbal argument with my (30F) SIL (38F), went to bed, woke up to her cutting my hair.",
        "url": "https://www.reddit.com/r/relationships/comments/2sak4u/got_into_a_verbal_argument_with_my_30f_sil_38f/",
        "score": 2735,
        "num_comments": 688,
        "created_utc": 1421166149.0,
        "selftext": "She has been my sister-in-law for a year and we have never gotten along. She has always been rude and condescending to me. My husband wanted to visit his sister the day (Monday), and I reluctantly agreed. I tried my best to be civil, but she kept picking fights. She eventually started a verbal disagreement about how my husband could have done better than me etc. I tried to keep my cool and ignore her, but she eventually started screaming and my husband had to tell her to calm down and intervene.\n\n\nI ended up going to bed (their guest room) and my husband and her husband stayed downstairs watching TV while SIL did the dishes. I dozed off and was awoken a while later by someone touching my hair. I sleepily thought it was my husband and rolled around and saw SIL snipping my hair with scissors. I immediately pushed her away and she ran out of the room. I went downstairs and informed my husband and his brother and showed them the cut strand. They both said that SIL \"is immature and not let her get on your nerves\".\n\n\nI do not understand how they can be so passive and not think this is a big deal?!?!?! Am I overreacting? This is NOT normal behaviour for someone who is nearly 40 and I am so angry that she cut my hair while I was sleeping. I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level. What do I do??\n\n\n**TL;DR: Got into argument with SIL, woke up to her cutting my hair. Husband thinks I am being a drama queen.**",
        "permalink": "/r/relationships/comments/2sak4u/got_into_a_verbal_argument_with_my_30f_sil_38f/",
        "comments": [
            "You SIL needs professional mental health help and your brother and husband are complete morons for enabling her behavior by telling you not to let her get on your nerves. Your husband is spineless and unsupportive and a total asshole for calling you the drama queen.",
            "What. The. Ever loving. Fuck?\n\n>Am I overreacting?\n\nNo. \n\n>I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level.\n\nHe's an idiot. What the hell kind of passive doormat lets a person get away with disrespecting their wife like that? I can't even imagine the shades of red I would see if my sister did that to my wife. All the rage. Forget the wife thing but just basic personhood. Whats next is she going to sneak ex-lax in you food and you just need to get over it? I'd be in a fucking hotel by now.",
            "Time to screencap all these comments, print them out, and shove them at him because he's so used to her demented behavior that he can no longer tell when she's being COMPLETELY INSANE.\n\nIf you do that, let me just take the time to say: Mr. \"Husband\", this is not normal. This is not healthy. This is not something people do. And if you can't see that, then your wife has EVERY reason to disengage herself from both your sister AND YOU. Because this is unhealthy and dangerous. And if you have, or want to have, children, what sort of message does this send that nearly **40 year old** Auntie is \"normal\" and \"reasonable\" for *going after another women with scissors while she slept*.",
            "Your husband is out of his fucking mind if he thinks you're the one being a drama queen. What she did is technically assault and battery. Does it rise to the level of a reportable offense? Probably not, but it's a pretty solid indicator that she's not afraid to physically escalate a dispute.    \n   \nEdit for the pedagogues.",
            "Your husband and her husband are certainly enabling her, if not completely ignoring a serious mental health issue. She has the power in those relationships. They won't confront her about her behavioral issues, they instead *tell the victim to not let it get on their nerves*. I know hair can be a materialistic thing, but I would just not feel that safe around this woman. What limits does her hysteria and lack of responsibility know? Cutting your hair, to me, is disconcerting. It is a personal attack - it is a form of violence, it's serious shit.\n\n* I no longer want to visit her and he told me that I was acting like a drama queen\n\nFucking, really? This might be a sign of just how much he does not want to confront the issue. Your concern *for your personal safety* is not being a fucking drama queen, it's being a mindful god damned adult about the situations you find yourself in. **You're being completely reasonable.** \n\nIf she's not going to do anything about her behavior; and the two men who have some of the most potential to get her attention about it are resigned to do nothing, then it makes sense to remove yourself from it all. They won't defend you, and your husband even invalidates you, you're the only person looking out for you and I wouldn't back down. I'd rather go through a divorce than be married to someone who's, well, committed to enabling this much deficient mental health and behavior.",
            "It's a big deal.\n\nI think it's more concerning that your husband thinks you're the one being a drama queen when his middle aged sister decided to take it out on your hair. Be firm, explain how it's not okay, and I'd highly suggest ignoring your SIL. It's apparent that she's not mature enough to handle any adult relationship.",
            "What if next time she takes the scissors to a different part of you? This is not the works of a stable person. I can see if she were a child. Not an adult. She needs help, and your husband needs to open his eyes and grow a pair, sorry to be blunt.",
            ">I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level.\n\nThis dismissive attitude is very likely an enormous contributor to this woman feeling like it's OK for her to do whatever the hell she wants. No one bats an eye at her atrocious behavior, she's getting away with no consequences. \n\nYou should refuse to be anywhere near her, as she might escalate the aggression and actually hurt you. No exceptions made, no christmas, no birthdays, nothing; if she is to be at a place, then you're not going. If she shows up, you leave. \n\nMake it clear to your husband that you've had enough. Show him this thread, there will be plenty of people outlining exactly how harmful it is for him to be so dismissive of her action and how he should have your back. Good luck.",
            "You married into a family of weirdos. Your husband does not stand up for you at all. At first he makes you go visit SIL, with a history of being rude and condescending to you, then when she says her brother could have done better to you, what a good husband should do is get up and leave with you, not just sweep it under the rug, and the cutting hair thing is one of the weirder psycho things I have read on here and doesn't need much commentary.\n\nIf this is the general attitude of your husband I suggest you reevaluate your marriage.\n\nThe only positive thing you might be able to draw out of this, if you are into sadistic glee is that SIL probably did this (along with undermining you) is because she wanted to make you uglier, which means she is jealous of you because her life sucks. ",
            "That might be considered assault and I'd call the cops. If your husband won't stand up for you, I'd tell him marriage counseling is required if he wants to continue to be married.\n\nAnd NEVER speak to SIL again. ",
            "That's assault and you should call the cops.  Your husband should be supporting you on this.  He should also have your back when she starts on how he could do better than you, what the hell is that?",
            "> Husband thinks I am being a drama queen.\n\nNope. Nope nope nope nope. If husband fails to understand how wildly inappropriate and in fact *criminal* SIL's behavior is, then he is either a complete moron or at the very least in need of a serious dose of reality checking. What SIL did qualifies as assault and you should make sure Husband is aware that you have the right, by law, to pursue charges against her.\n\nBeyond the law, though, your Husband needs to have your back in all things, especially when it comes to the behavior of his bratty sister (however old she is). You need to make it absolutely clear to him how disappointed you are in his inability to stand up for you. That is totally not acceptable.",
            "Your husband needs to stop enabling his sister and support you, his wife, the woman he chose to be his partner and his #1 priority.\n\nEven if you don't believe in the bible or any sort of religion, when I used to go to church there was a quote I learned that always stuck with me.  It says something like \"a man will leave his mother and father and become one with his wife, forsaking all others.\"  To me, that means that when a couple gets married, they become a team, and no family member should come between them.  A spouse should always support their significant other.\n\nI would sit down with him and make it clear that you feel completely disrespected and unsafe around his sister, and that he needs to decide whether he wants an adult relationship with you or whether he wants to remain a child with his family.  Coexisting is possible, but not when she has free reign to treat you however she likes and you are expected to be the \"bigger person\" and take it.  That's not fair.  He is taking the easy way out and ignoring the problem instead of backing up his wife.\n\nI would suggest counseling because an impartial outside party can clearly see that her behavior is wrong, and their advice will probably get through to your husband a lot easier than if you try to handle this yourselves.  It's not right, but since you have a history of bickering with his sister he may see your complaints as \"drama\" and \"over exaggerating\" until they are examined by someone else.\n\nFinally, I would also suggest you do your best not to get drawn into these sophomoric arguments with your SIL.  Try your best to politely defer her.",
            "I would be taking a serious look at the state of my marriage after this.",
            "You are completely in the right. Picking fights with you, and then attacking a part of you when you are asleep, unconscious, and completely vulnerable is not an acceptable form of behaviour for a 40 year old woman. A person who is supposed to be an **adult**.\n\nI don't believe that this situation has to end in divorce, but what I do believe is that you have to set some hard boundaries right now. Something like this:\n\"I may not be able to change your mind about what you're sister did to me was completely unacceptable, and so are you for defending such behaviour, but I will never be going to (SIL)'s house again. You can whine, make a big fuss, and be angry at me, but I will not go to a place that makes me upset, and where I feel unsafe. Also, if you ever trick me into going to a place where she is present, that will be the end of us. Pick me, or pick your sister, I'm not going anywhere near her ever again.\"\n\nIf you feel the need, I also feel that a restraining order would be in good taste.",
            "You....*YOU'RE* the drama queen?\n\nIf you reacted by screaming and leaving and slammed the door behind you while cussing up a storm you wouldn't be a drama queen as that would be completely justified. SIL is crazy and your husband is an unsupportive doormat.\n\n\nNope nope nope",
            "**This woman was doing something to you while you were sleeping WITH SCISSORS.**\n\n**Today it was just cutting a strand of hair. Tomorrow--if nothing is said or done about this--it might be your earlobe.**\n\nYour husband is immature if he doesn't understand how something like this could progress. \n\nA person cuts your hair while you are sleeping because they are too scared to do something more. So they cut your hair. If they suffer **no** consequences for **violating** you in this way, they might decide to **level up the violence**.\n\n",
            "I pride myself on my kung fu master patience. But if I woke to someone cutting off my hair, even I would forfeit personal responsibility for my reaction. It would be explosive to say the least.\n\nThat is an assault on your person that speaks to your SIL's capacity to harm you as a response to her feeling wronged or upset. And your husband is treating this as though you two were feuding 10-year-olds, certainly not that his wife was a victim of a physical attack by a 40 YEAR OLD WOMAN.\n\nIf he refuses to protect you from his family, then you have to protect yourself. You are not sinking to her level by refusing to ever be in the same room with her ever again. You are distancing yourself from a nasty, malicious woman who has demonstrated that she will gladly respond physically to any perceived slight.\n\nSo, no, you are hardly overreacting. Shame on your husband for not supporting you, for not being the partner he should. His behavior is as abysmal as his sister's. Prepare yourself against ever seeing maturity run in that family.\n\nLet your husband visit her alone. Maybe she'll give him a nice haircut he can show off around his workplace.",
            "They are being passive, because they perceive you as \"weaker\" and think they can push you into compliance easily whereas they can't with SIL.\n\nI would talk with the cops, like everyone suggested. I'd also tell your husband that if he can't take your side on this one, that you're leaving him for good. She's verbally abusive, which is bad enough, and now he thinks YOU are being dramatic for being disturbed that a grown ass woman cut your hair while you were asleep? The second she said he could've done better than you should've been when he got your things together and told her that she can no longer be a part of his life if she continues to choose to treat you like that.\n\nWhat is it going to take for him to realize the SIL is the problem? Will you need to get stabbed or seriously injured for him to see that?",
            "Not at all being a drama queen, I would be absolutely livid he said that. She's a fucking crazy bitch, DO NOT VISIT HER AGAIN. \n\n",
            "You're not overreacting. You should report her to the police. If she could do that to you, I'm concerned for your safety.",
            "OMG, my first instinct would have been to punch her in the face.\n\nWho the fuck acts like that? People who don't get called on their shit, that's who. \n\nYou are not a drama queen or sinking to her level by not wanting to associate with a toxic person. If your husband wants to see her, let him. However, I wouldn't spend another minute with someone without normal adult boundaries.\n\nI would also have a hard time being married to someone who didn't take this seriously. ",
            "Leave and never go back. Tell your husband she is not welcome in your house. Also make a police report. Holy crackerpants! ",
            "Your husband should have left the house the second she tried to say he could have done better than you. I think you need to leave home or kick him out until he's ready to handle this properly. \n\nNo one deserves to be treated like this. ",
            "Willing to bet they've known her for so long they haven't realised she has reached an age where this is unacceptable (actually even toddlers who do this would be told off in some way) or been in  a family where this would be considered worrying. \n\nWhen talking to your husband/family you need to show them this outsider pov, that this doesn't happen in other households and most women (even immature ones) don't cut peoples hair in revenge while they sleep. Or explain you are not from his family/never experienced this ever and you cannot learn to live with this or it will get on your nerves. Think getting through to them depend show you express it, calmly and maybe with back up will help. Like if you had a child who did this to other children at school how would they react etc",
            "Did you yell WHAT THE FUCK IS WRONG WITH YOU?!\n\nBecause that is the only appropriate response.\n\nCrazy bitch.",
            "I've seen this before almost identically. SIL was spoiled rotten as a child and got whatever she wanted. When something doesn't go her way she throws a tantrum or acts out. They're all used to SIL's histrionics and so they don't recognize it when she does things that are totally unacceptable. They've adopted a damage control mentality where they downplay whatever she does because confronting her on her bullshit is just too difficult and complicated. It's gotten to the point where they're in active denial, as you saw. \n\nYou can't change SIL and it's unlikely you can get your husband to do anything about it. In future you should just refuse to attend any events where SIL will be present. Tell your husband he can either stick up for you, or put up with total separation between you and SIL and all the complications that ensue. \n\nTake this seriously OP, SIL is the type of person to do some really fucked up things to you if you stand up to her. I'm talking Nair in the shampoo, laxatives in the hot chocolate kind of stuff. ",
            "Call the police. This is assault. \n\nIf he isn't willing to stand up to the crazy,  then he's an accessory to the assault. \n\nDo you really want to stay with someone who chooses the crazy over you? ",
            "Call the police. This is the behavior of a crazy person.",
            "If anyone **EVER** cut my hair without my permission, I would fucking flay them alive.",
            "> They both said that SIL \"is immature and not let her get on your nerves\".\n\nMy exact words would have been, \"Mother fucker. I've just been assaulted. Now, I'm going to have to get a divorce too.\" \n\nYou should have called the cops and pressed charges. If your SO isn't the kind of man who could see you raising the issue of being assaulted as being a \"drama queen\" then you should leave him. Seriously. I don't know how you couldn't, really.",
            "Your husband is a spineless doormat. I'm a man and if my sister did that to my girlfriend there would be consequences. ",
            "Lol yep. Sounds like my sister. And when I call her out on it saying what she does is unacceptable, I get told to shush by our single mother or others. When we grew up, she was never punished for anything she had done, whereas I always had to think about the consequences of my actions. Unfortunately you cannot change your family. But **YOU CAN** get the hell out of *that* family. They are enabling her behaviour by shushing you. Do not stay silent. And stay the fuck away from anyone taking her side or telling you to not get on her nerves. **That is not OK**. I lost all my respect for your husband when SIL mentioned that your husband could have done better and seemingly, he did not protest to that. That itself is not fucking OK. You have to either get him in line, or get separated for a while (I'm sorry, I don't want to encourage divorce as I have no idea what your husband is like when your SIL is not involved in your lives but... your husband needs to understand this is a problem.)",
            "Fuck that shit. Don't ever go near her again. \n\nYour husband should do more to defend you. ",
            "Press charges.\n\nFile restraining order.\n\nA mentally unstable woman attacked you with scissors, and your husband wants you to continue spending time around her. Un-fucking-believable.\n\nYou need to take your safety into your own hands, and you need to tell your husband to suck a dick (or insisting on counseling would probably be a more productive thing to do, but it's a dealbreaker if your partner isn't on your side on this issue).",
            "Let's suppose for a second.\r\rLet's suppose you pick your child up from school someday and when you get home your husband tells you that your sister in law will be coming over soon. \r\rDo you trust this man to be in a room with your sister in law alone with your child?\r\rYou're married to him so it might be a possibility someday.",
            "Do you have kids? In all honestly if this ever happened to me and my husband said I was acting like a drama queen I'd be out the door. This drama queen will not tolerate being assaulted. I realize ending a relationship is an extreme reaction but the level of disrespect from your husband by not supporting you in this situation is astronomical. If anyone in my family ever talked that way to my SO they would be out of my life until they learned how to behave and I'm not a fighter in any way shape or form!",
            "Just cut off (no pun intended) all ties from her. She sounds like a miserable old bitch. You don't need those people in your life and you'll go through more trouble trying to make sense of it. ",
            "Your sister-in-law won't get the mental help she desperately needs unless this is reported to the police.  Her family which is enabling her will not push her to seek proper help unless this is reported to the police.",
            "Call the cops and have your SIL arrested for assault.",
            "I've been thinking about this for awhile, and I think your husband might be so used to his sister's craziness that it's been normalized for him. I don't agree with everyone here that your relationship is doomed, I would at least given him ONE chance to see the light. \n\nBut definitely get the hell away from this woman. ",
            "It's my completely unprofessional opinion that your husband is a spineless waste of flesh and your SIL is a batshit loon.  Nice genetic cesspool you married into.",
            "Your husband acted like an asshole. If you want to give him the benefit of the doubt, assuming this was the only time he has ever acted this stupid, that is up to you. He has a right to not agree with you on everything, but he doesn't have the right to insult you by calling you a drama queen. Least of all when you may be legitimately traumatized and not feel safe to sleep in the house of a psychopath.  \n\nChildren may behave like she did, but children do a lot of things that are unacceptable in adults. What she did is absolutely not acceptable. You should remove yourself from the toxic environment and demand couples counseling to get your husband's head out of his ass before he transforms into a real asshole.  \n\nImagine how supportive your husband will be in the future if he won't even support you now.\n\nEdit: I think what she did is considered mutilation. You may have a strong case against her, you should consult a lawyer though (since I am not a lawyer and this is just an idea not advice).",
            "This is assault, not just silliness. You are fully in the right to refuse to see her again.",
            "1. You and your husband need to go to marriage counseling, stat. The biggest issue here is that your husband lets his sister treat you the way she has been, and encourages you to be in her presence. That's beyond not okay. You and your husband are supposed to be a team - and he sure as hell isn't acting like a good husband.\n\n2. Refuse to spend time with your sister in law. Maybe after your husband gets his head on straight and starts standing up for you this point can be revisited, but until then, do not put yourself in the position to be treated like crap and assaulted by this woman. If that means skipping Thanksgiving, so be it. Go visit your family/friends instead.",
            "update, please update later!",
            "Motherfucker you do not touch another chick's hair. Thats a law like Michael Jordan or Water. \n\nI'm pretty sure you're allowed to kill this bitch.",
            "This is completely insane. Give your husband an ultimatum. If he wants to keep a relationship with her he can, but you do not want any relationship with that woman. Meaning you won't go over to her house and she won't come over to yours.",
            "Yeah you need to tell your husband that the way he's allowed his sister to treat you is absolutely unacceptable. I would definitely be questioning the future of that relationship. ",
            "You're  not overreacting.  You need to have a serious conversation with your husband about supporting you. Your SIL needs a mental  health evaluation. ",
            "Wtf",
            "That's assault.\n\nTell her she has to shave her own head or you are pressing charges.\n\nIf she wants to be an immature twat, treat her like one.\n\n",
            "Is she mentally healthy? Not sure about that. \nA hostile person with a cutting tool by my bed when I am sleeping is a reason for quite a bit of paranoia and never turning your back on them, and I mean literally. ",
            "You married the wrong guy ",
            "This is crazy! What the hell is wrong with your husband to make you ever be around that woman? I don't understand how he can see you so deeply uncomfortable, insulted, picked on and now your hair cut off and he stills thinks \"meh, no biggie\"\n\nHer idea of conflict resolution was to pick up a sharp object and come at you in your sleep. Think about that.  \n\nI'd never visit her again. Period. Dont care how upset or angry hubby gets.  Too bad for him.  \n\nSucks that no one defended you or even seemed to care. She is not immature she's psychotic.  Creepy as fuck",
            "I would have thrown her out a second story window. You could have rolled over and lost your eye. What would your husband do then? Say \"girls will be girls\"? ",
            "Your husband is a spineless cunt.",
            "I believe that's considered assault. What I've learned here is:\n\nyour SIL is a bitch\n\nyour husband is an even bigger bitch. ",
            "Two words:  Divorce.  OK, that's one word.  \n\n*Fucking* divorce.  \n\nThere, problem solved.",
            "Your husband comes from a shitty family and you should dump him. ",
            "I'd be in a hotel so fast. Also, the most worrisome part of this story is your husband. This is screaming Red Flag after Red Flag. Capitols for a reason. \n\nThe whole point of a husband, a wife, or a family is to feel like a team against the world. Not that that world is out to get you, but it really isn't spending time looking out for your best interest. That is the job of your family.\n\nIf\nFamily (The one you choose: Husband/Wife etc) = Team mates\n\nThan having a husband who isn't looking out for your best interests and well being is not on your team, and therefore, shouldn't be your husband. \n\nNow, if this is a one time thing, or he knows his sister is insane and has learned that having a relationship with her is more important that putting his foot down, okay. But you still shouldn't be thrown under the bus for his decision. \n\nMy question is: Does he throw your concerns under that bus for other people, including himself, or other situations, often? \n\n\n",
            "I never understand people saying someone is overreacting to having a crime committed against them. Have her arrested and tell them they are overreacting about it. After all it is just prison!  \n  \nNot only was this assault but it was done in a specific way to give deniability. This is psychopathic behavior. It could easily escalate to poisoning and other forms of sabotage.",
            "I'm pissed at your husband for this.  Just because he's not the target, he doesn't care.  In other words, he doesn't care enough about you.",
            "I'm sorry what?  Call the police and report the assault.\n\n> I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level. \n\nTell your husband to come and read this thread.\n\nDear husband - GET YOUR HEAD OUT OF YOUR ASS YOU TOTAL FUCKING IDIOT.  SHAPE UP OR OP SHOULD LEAVE YOU.",
            "You just got assaulted by a crazy lady! You're not in the wrong in any way. If you haven't already, please file a police report and/or a restraining order. If this kind of behavior is at least on file, the cops will be more likely to respond accordingly in case she tries to pull something like this again.\n\nYour husband and brother-in-law have been putting up with this brand of crazy for long enough that they're probably pretty desensitized to it. They don't want to deal with it, and by telling you you're being dramatic, it becomes a non-issue. They don't have to address it, because now it's *your* fault. This kind of thinking is dumb and it sucks, but it's not insurmountable.\n\nConsider showing your husband some of these comments and let him know that you're scared and comfortable being around his sister. Let him know that he may be used to this from her, but you're not and you really need his support. If you guys made vows when you married, bring those up. It's important that he remembers that you guys are a team, and need to be able to support each other.\n\nIn the event that he keeps being willfully ignorant or throwing you under a bus over things that are in no way your fault, I'd consider splitting. I mean, do you really want to make a lifelong commitment to people who aren't willing to stick up for you in situations like this?\n\nI hope you're doing okay, OP.",
            "Pretty sure that's assault. ",
            "Call the police. Press charges.\n\nShe's insane.\n\nAlso, why is your husband allowing people to talk shit about you?",
            "Your husband is a fucking moron.",
            "Your husband is a fucking worm.",
            "That is assault.\n\n1) Keep hair  \n2) Move to hotel  \n3) File charges  \n\nIf your husband disagrees with any of the above, you have a partner that doesn't support you.\n",
            "Your husband seriously sucks.",
            "Have your husband read this thread to understand how big of a douche he is.",
            "A lot of places, that is considered assault. I'd press charges.",
            "Your husband is a Jerk for not defending you and making you feel like you're the crazy one.  This would actually be a deal breaker for me.  He chose to marry you,  you are his family now too.  I want to cunt-punt them both. ",
            "> I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level.\n\nThe answer to that is \"SHE CAME AT ME WITH MOTHERFUCKING SCISSORS WHILE I WAS SLEEPING!  Do you not get how scary that is?  Why the hell should I ever have to go near that woman again?  I'm not gunning for revenge here or \"stooping to her level\" and I'm not stirring up *any* drama, I'm *afraid* of her and just want to stay the hell away from her!\"",
            "something tells me this is a fake",
            "Cut your husbands hair. Then when he bitches tell to stop being such a little bitch ",
            "I'm late to the party and someone may have already mentioned this, but someone cutting your hair without your permission is assault with a deadly weapon (in the US, at least).  You would be WELL within your rights to report her to the police.  \n\nThis is NOT okay and you are NOT overreacting.  They are honestly under reacting to a terrifying degree.  ",
            "Uh your husband is a moron..Find a new one as this is a deal breaker.",
            "If it were me, and I woke up to someone cutting my hair, I would probably have stabbed them with the scissors (or at least hit them). I commend you for your restraint. \n\nI would leave the house immediately, and never go back. No if, and, or buts about it. Who knows what she would have done next. Things like that escalate quickly. ",
            "what a psycho bitch. your husband is a spineless little worm for letting her scream at you and insult both of you by saying he could do better than you. She needs to be on medication, and cutting someone's hair without their consent is probably legally some type of assault. I would make an ultimatum with him, since she completely crossed the line. Aggressive, belligerent, yelled and screamed, crossing the line with her insults, and finally the psycho ass move of cutting your hair. Honestly its unbelievable, and to chalk it up to a 40 year old being \"immature\" shows that they are in denial about this woman's mental state and culpability for her behavior. How are you supposed to ignore this woman? When she screams at you and then CUTS YOUR HAIR while you're sleeping. Both men in this situation bear responsibility for allowing this to happen, and you need to talk to your husband and not put up with this again. Tell him you are not going over there again, and he needs to discipline this woman. He needs to grow a spine and not act like a little child when his sister is acting so insane, aggressive, and psycho. What's she gonna do next time with those scissors? She already assaulted you in your sleep, and he needs to realize that his sister's behavior is not normal or acceptable by any degree. Good luck, this sounds terrible. Personally, I would just say that she is cut off until something major changes, but ideally you should just try to never talk to her or visit her again after this craziness. You are the normal one, remember that, and her behavior and their lack of acknowledgment regarding the severity of this behavior are bizarre.",
            "gtfo. seriously, run.",
            "Overreacting?...No.\nMe? I'm not so nice,I would have most certainly punched her in the face.",
            "Your hubby needs to grow a pair. Dump him.",
            "Is there something missing/embellished here because how could your husband be so clueless?  I mean, I could place top 5 in the Mr. Conflict Avoider contest but if this happened to my wife I can't imagine how full of rage I would be.",
            "What she did is criminal assault. And you are married to a gutless piece of shit.",
            "Yes, call the cops. What she did was way over the line and violent. Your husband has no excuse to be so dismissive. Then you don't go to her house or interact with her until she understand the seriousness of what she did. I would be afraid for my safety if a person went to my bed while I slept and cut my hair. That is assault.",
            "It's the calling card of the passive, wimpy enabler: accusing the victim of \"causing drama\".\n\nShe caused the drama by cutting your hair.",
            "Being immature is one thing.  A child experimenting with cutting their own hair or cutting Mommy's hair because they think they're \"Making Mommy pretty\" is immature and a lack of knowing better.\n\nThis?  This is something completely different.  At BEST, I would call it being violated.  At worst, I would fall in lock-step with everyone else terming it assault.  I think it may be a tall order to prove that.  If you had been falling prey to your sister-in-law's sniping and actively engaging in responding to the insults, I would understand your husband saying that she's immature and to ignore her.   \n\nYou need to remind your husband that she crossed the line from smart-assed insults to actually violating your person, and that his response is a gross under reaction to what actually happened.  Tell him you no longer feel safe around his sister and you have no desire to speak to her again.  Remind your husband that you did not engage with her in the insults that she was spewing, you removed yourself from the situation, and she escalated physically from there.  If he does not stand up for you, then you will need to re-evaluate where you stand in his life.",
            "She is mentally ill. She could have cut your throat. Do not ever visit her again. He can go, you stay home.",
            "Leave your husband at his psycho sister's house right now and when he gets upset that he has no way of getting home, tell him he's overreacting and being a drama queen.\n\nI honestly am not sure what advice I could give you in moving forward in your marriage, because your husband to me sounds like a spineless dickhead, but I am not married, so I do not know how to judge. I just know you need to get yourself the hell out of that house and away from all of those assholes right now.",
            "She is probably trying to do voodoo on you.",
            "Why is this even a question?  Your husband is a little bitch with family issues and you should move on.",
            "You need a new SIL.",
            "You need to show your husband this thread. There is no way this is okay.",
            "I think if I woke up with someone hovering over me with a pair of scissors, I would have to assume the worst and commence fighting for my life. If she does something like this to the wrong person, they're going to take that pair of scissors and stab her in the neck. ",
            "This is a big deal, and if your husband doesn't think it is, there is yet another big deal.",
            "Sounds like you're the one that could've done better.",
            "your husband is a fucking maniac and so is your SIL. i know you're in love with him and all, but how the fuck did you get so deep into a relationship with someone like this?",
            "That's actually really weird.  If that happened to me and my husband told ME I was overreacting, I'd start questioning the relationship.",
            "You can just never be around SIL again. Period. Done. She's fucking bananas.\n\nThe real problem here is your husband.  Any therapist, fuck, any normal person, can see how INSANE it is to wake up to someone cutting off your hair.  Sister's officially crazy, so I wonder what's truly off with your husband's brain.",
            "Tell your husband how serious this is calmly and ask him what he's going to do about it. Let him know if he doesn't have an action plan, the only thing you can think of to help his sister with her clear mental problems is to call the authorities and have her court ordered to a psychiatrist so she can overcome whatever it is that's causing her to want to make non-consensual physical contact with you. Then let him know you will be going to the salon and getting a $100+ haircut and color because of what she's done. Maybe when he sees the tangible impact on his/your money he'll understand that this IS a big deal.",
            "I'd say its time to get Even, I'd teach that bitch who shes fucking with...My wife says im vindictive.... meh...",
            "Stand your fucking ground. That is so out of line. And your husband should be shocked and should pitch a fit. Holy shit, I can't even believe that a person would do something like that. ",
            "There are few times on relationships where I think an extreme reaction is needed.  Most of the ones that warrant something more than communication deal with abuse.\n\nBut this, this takes the cake.  \n\nThere was a post recently about how a wife was upset her husband didn't fight and defend her honor.  I couldn't help but think how she needed to get over herself and calm down.\n\nBut this, no FUCKING WAY!  I am so perturbed that your husband wasn't upset.  Don't worry about sinking to her level, hold you head up and demand that they treat you with respect.  Your husband and his bil have let your SIL beat them down to the point where they feel powerless to go against her.\n\nI wouldn't stay there.  I wouldn't ever go back.  I would expect my husband to take my side.  It's so sad when sides need to be taken, but when you're dealing with someone who cuts your  hair in your sleep, NO FUCKING WAY.",
            "You have married into a family of neanderthals.  This is one of the few instances where a punch in the face would be the correct response.",
            "FYI, what she did is legally assault.",
            "What she did is assault. You are not overreacting.",
            "You are not overreacting in the slightest. This is unacceptable behaviour for anyone, especially an adult. What she did is, unless I'm very mistaken, illegal and falls under the category of assault. \n\nYour respective husbands are both idiots who enable her madness, but your own husband is especially at fault for not only allowing her to mess with your relationship to this degree, but also for not supporting you. They are the ones who are out of order. \n\nYour husband needs to hear how you feel and how she makes her feel, but most of all how he makes you feel by not reacting and not supporting you. Does he not see how she keeps picking fights? And how the hell does he think that what she did is acceptable behaviour? Would he be absolutely fine if some psychopath cut his hair while he slept? Especially when he is that someone's *guest*! \n\nTalk to your husband. Explain to him your thoughts and feelings. You are most certainly *NOT* crazy, or overreacting, or a drama queen. Tell him to grow a fucking pair and stand up for his wife and his relationship.",
            "This kind of stuff I except from like a seven year old, a terrible seven year old. Not full grown adults. ",
            "In case nobody else points this out, forcibly cutting someone else's hair may be assault/battery depending on the laws in your state, you should consider filing a police report just to have a paper trail of her behavior in case she decides to escalate. ",
            "if anything, you're underreacting. a beating is about right.",
            "Something is wrong with your husbands family. Him enabling that behavior makes him almost as bad as the SIL. She sounds like she needs mental help, and your husband needs to see this thread.",
            "Time to get a divorce... your husbands a piece of shit. ether that or he so passive you might as well just start cucking him because he obviously has no fucking balls.",
            "In all honesty I probably would have beat her ass for that. I'm cranky enough when someone wakes me up unexpectedly without the addition of the assault. \n\n>They both said that SIL \"is immature and not let her get on your nerves\".\n\nAnd wtf is wrong with your husband and her husband for excusing and enabling her shitty behavior? Your SIL is a spoilt brat because the people around her allow her to be so. Not to mention not standing up for his *wife* when SIL started talking shit about how you're not good enough for him. Wtf?",
            "I strongly recommend you both read \"Toxic in-laws\" by Susan Forward.\n\nI think your husband has serious issues, and urge you to go to counselling. If he won't work hard on addressing his issues, you might want to think about a divorce.\n\nBest wishes",
            "The SIL is right, you could do better than your husband.",
            ">she said my husband could've dome better than me.\n\nNaw man, *you* can do better than *him*. That's Fucking borderline psychotic of your SIL.",
            "> I told my husband that I no longer want to visit her and he told me that I was acting like a drama queen and sinking to her level. What do I do??\n\nStick to your decision and never go back to that place. Tell your husband your SIL is not welcome in your home. If he ridicules you tell him to get fucked or give him the silent treatment (whatever works for you).\n\nI don't know what the laws are in your country but I suggest you look at the possibility of having your SIL charged with assault. Coming into your personal space like that with scissors seems like crossing a line. I'd be very concerned about that if I were you. This is why I think you may want to have a separation from your husband if he continues to ignore you or ridicule you about it. The act of your SIL putting scissors so close your head especially while you were sleeping seems too frightening in my mind.",
            "Your husband is a pussy lol",
            "I think your husband is fucking retarded/crazy too. Must be a family thing.",
            "Why your husband would be ok with assault is beyond me. Why he did not stand up for you when this STARTED is beyond me. And worse, why he did not tell her to shut up as soon as she started the \"he could do better\" speech would be a deal-breaker to me. I love my sister; I would verbally smack the shit out of her if she started that with my WIFE. Not a gf, a WIFE. Someone who was good enough to want to spend my life with.\n\nA) Don't visit anymore. What happens next time, she sneaks up on you with a knife? Obviously she does not know what boundaries are, or what acceptable coping is.\n\nB) Your husband and you need couples counseling or therapy. I do not know if he understands your point of you, and his is certainly...interesting. It might help to have a professional help you hash this out. That shit is scary as hell, and incredibly violating, and I am sorry.",
            "You've only been married to this man for a year. I predict a divorce. \n\nNEVER step foot into her house ever again. I can't believe she did that. Your husband is a shit husband for not standing up for you and protecting you.",
            "Divorce him, get far away from that fucked up bullshit.",
            "That is insane, you're not being dramatic at all. ",
            "This reads like a bad sitcom, if this really happened, get the hell out of there and away from this fucked up family.",
            "What the hell. That's not normal at all. You are not overreacting. I'd be questioning why my husband thinks that's okay behavior. It's not. Isn't that assault? I'd be getting out of there. His sister needs help. And I'm sorry about your hair. ",
            "You could visit one last time to \"improve your relationship\" with her.  While there, add Nair to her shampoo.",
            "I'd leave him and tell him to give you a call when he's done being whipped by his sister. The dismissive things he said are \"things losers say\" and I'd find it frankly unattractive that he's so used to bending over for her behavior. She attacked HIS wife, it was a show of disrespect towards him and his life choices.",
            "This has NOTHING to do with your SIL and EVERYTHING to do with your husband. What is *wrong* with him? And more importantly, what is wrong with you to let this go on for so long? If you don't get some kind of counseling your marriage is doomed. I would have kicked her ass (more realistically slapped her really hard) and my husband wouldn't have liked it but he also would have understood, taken me out of the situation and not talked to her for months. This is what a *husband* does. You should be really embarrassed.",
            "Kill the crazy Bitch, lol",
            "Sounds like yall would be perfect for Jerry!",
            "It sounds like your husband and her husband are so used to her shenanigans, they don't realize how off her behavior is. You're not overreacting, and you're completely right that it's not normal behavior for someone her age (or any age, really). \n\nAvoid her. Tell your husband that she violated your boundaries and that you're not comfortable being around her. If he tells you that you need to get over it, just calmly repeat that you're not comfortable around her. Repeat ad nauseam. Don't let him try to convince you that what she did is not a big deal, because she's clearly unstable and he doesn't see it.",
            "Your husband is a fucking idiot who either doesnt care how his wife being treated or he's too stupid to see it. Either way, this is bad news. I dont think theres any question that you have the world's permission to either go permanent No Contact with your SIL or press charges for assault or both. The bigger problem is your husband",
            "Wow, that is messed up. She assaulted you as far as I'm concerned. You aren't overreacting. If you're still at their house, call a cab and get out. She is clearly unhinged and your husband isn't respecting you. Cutting someone's hair without permission is a violation of personal space, boundaries, bodily integrity, dignity -- I could go on. You might even be able to press charges over something like that.\n\nYou should stay far away from her. You and your husband need marriage counseling. If this is how he treats you on a regular basis, you have big problems. Dismissing you out of hand is so demeaning. You are 100% correct in this. He should have your back. I would never stand for my siblings saying such things about my SO, let alone assaulting him. And yeah, you were assaulted.",
            "Call the police and then leave your stupid husband there.",
            "That is creepy as hell. ",
            "First your hair, then your throat! That's creepy as hell, tell your husband to grow some balls.",
            "If you want, you can call the cops and press charges for assault.",
            "I would have gotten violent over someone cutting my hair in my sleep. She's lucky you're nicer than I am. She attacked you with SCISSORS in the DARK. What if she had stabbed you or poked your eye out in her rage? You are not safe in that house with her believing that she can do whatever she wants to you without repercussion. Put your foot down and tell your husband that you will not return to her house under any circumstances until she apologizes/ever/whatever you want. He obviously isn't properly concerned with your well-being, so you need to be.",
            "You need to make your husband realize that this is in no way normal behavior. You need to avoid this woman like the plague, nothing good will come from continuing a relationship with her. \n\nI'm so sorry about your hair. :( ",
            "Your husband needs to grow some balls and stick up for you.  She's acting like a 5 year old and you're getting blamed for it!  She cut your hair, and yet you're supposed to keep visiting her?  WTF is wrong with these people?  Don't visit her anymore, and don't feel obligated to try to get along with her.  She's behaving abominably, and her family is just going along with it.  You sound like the only sane person in the group.\n\nAnd please get some marriage counseling.  Your husband has got to learn that it's not okay to side with the person who is cutting his wife's hair in her sleep.  ",
            "Jesus she's 38 years old!\n\nWow if my 10 year olds do that it's a grounding plain and simple, not to mention a direct apology.\n\nYour husband needs to support you, he's a coward otherwise.  I'm a guy I get to say that.  \n\nI wouldn't trust eating anything over there, she'd broached the physical barrier now, who knows how far that'll go with her.",
            "What the actual fuck? I would be OUT of there. You are NOT overreacting. Holy crap I would be so pissed.\n\nYou are not being a drama queen, you are not sinking to her level. SHE CUT YOUR HAIR. WHILE YOU WERE SLEEPING. Who the hell does that? That is just so damn creepy.\n\nI think your SO just doesn't want his sister to nag to him even more about you if you stop visiting, but honestly, he should care more about you than about his sister. And he can't really force you to go with him if he does want to visit her. I know I wouldn't freaking go anymore that's for sure. ",
            "She's a nut job and I think it runs in the family. This is not normal. Mentally stable people do not do these kind of things. Husband and BIL are the ones that need to stop enabling this type of ridiculous behavior. It is completely within your right to avoid all contact with this woman until she receives therapy and figures out how to handle conflict.\n\nDo I think she is actually dangerous? No, but who knows. You are also completely within your rights to file a police report. She needs to know that this aggression will not stand.",
            "You have a serious problem on your hands. Your husband will not stand up for you. This is terrible. I am sure he is used to his sister being a shithead but he can't let this continue now that he is married. ",
            "Oh hell no! I hope you are home and if you aren't, demand to return asap. Never visit this woman again, and have a serious talk with your husband about what is acceptable behavior in other human beings. If he thinks you are being a drama queen over this, I would be seriously worried about his ability to make good decisions about this sister in the future.",
            "Yea, if your husband isnt backing you on this he's a piece of shit!  She's a psycho, this time it was your hair cut, what will it be next time?",
            "Your husband is being an ass by saying that you're being a drama queen.  maaaaaaybe if it was just the argument, but her cutting your hair is crossing the line.\n\nthat said, he shouldn't ever let her say that he can do better than you and should have squashed the whole conversation right there.",
            "Your husband and his family sound like fucking morons ",
            "Everyone else here has already said what I would say so I'll just add this: please show your brother and husband this thread so that they understand exactly how not ok that behavior is and that they need to stop enabling your SIL. That's unacceptable. ",
            "What the fuck is wrong with your husband? Seriously, somebody comes at you with scissors while you're asleep and he tells you you're a drama queen? I'd say you have valid excuse to never have to be around SIL again. And then you should probably have a nice talk with your husband about being a normal fucking human being.",
            "That is FUCKED UP and NOT OKAY. That would not even be understandable from a child. The fact that your husband didn't take your side is just reprehensible. Tell him some guy on the internet says he needs to look out for you if he really loves you, or risk losing you.",
            "You should have phoned the police, got the bitch charged with assault,  and dropped the mic on the way out of the house. \n\nYour husband is a wimp with no loyalty",
            "Real Talk:  You already know that you need a divorce.  \n\nWhen the argument came up about him doing better than you, he needed to shut that down immediately.  Instead he threw you under the bus then and again after she assaulted you.  He sees you as an object for his sister to indulge her craziness upon.  \n\nThis is not going to change.  Now your job is to be strong enough to face it. ",
            "1. Your SIL is a dick  \n2. Your husband is an even greater dick  \n3. Perhaps the biggest dick is SIL's husband...the embarrassment would be so huge and that person must be genuinely insane to, so I don't understand how he can stay with her.  \n  \nYou should probably have a serious conversation with your husband...depending on how that goes, maybe counselling wouldn't be too bad (say, he can't see reason and won't support you at all, despite his sister always harrassing you and cutting your god damn hair while you are sleeping).  \n  \nDo not visit her ever again. If he is in anyway a considerate human being then he will understand...if not...oh boy",
            "What kind of psychotic family did you marry into....She is nuts and he is worst for just shrugging it off...the fuck is wrong with the both of them...",
            "Show your husband this thread and the replies here. ",
            "Your SIL is a sack of shit and your hubby equally so. What in the actual fuck!",
            "super creepy behavior. NOT normal at all. You're not a drama queen and you should never go back to that woman's house ever again. \n",
            "OP your husband is an idiot, as is his brother. By not caring they are being horrible to you and letting someone with obvious mental issues do as they please. Cutting your hair out of spite/anger at that age? That is something a child or someone cruel would do. You have every right to be outraged, I hope your hair is alright. ",
            "I've come to realize that I enjoy this sub so much because it's just like Jerry Springer. Carry on.",
            "Isn't it fucking BATTERY (assault) to cut someone's hair without their consent? In my home town in Washington, there was a story about a guy who kept cutting off women's ponytails on the public transit systems. He was caught and all the women pressed charges for battery.\n\nPress charges OP. I know you don't want to make a big deal of this, but apparently none of those doormat men will defend you, so you have to defend YOURSELF.",
            ">They both said that SIL \"is immature and not let her get on your nerves\".\n\nWow, what the fuck?\n\nYour husband should be supporting you. \n\nTell your husband that if he's not willing to support his wife against his childish sister, then he's going to find himself without a wife.\n\nAt the very least you can file a report with the police. This will leave a paper trail, should it escalate to anything more serious (I hope that does not happen). Best to protect yourself, your SIL clearly has issues and your husband is being an enabler.",
            "Op you should just show this thread to your husband. I know sometimes people just cannot see your point of view if they've already dismissed it, but this will definitely make him see how in the right you are. ",
            "I hope I read an update that you left your husband, holy shit if I did not support my wife if my sister did something this crazy. Holy shit, what an asshole I would be.\n",
            "Now that you have about 200 comments saying that your husband has made a huge mistake in not standing up for you, it may be beneficial to show him this thread. \n\nMy guess is she's been this way for a very long time and everyone has excused her behavior. Sometimes, when we have a family member who is like this, we overlook things that we would not overlook from other people. It's easier to deal with it than it is to grow up and cut toxic people out of your lives. This may be the push he needs to see that he's acting a fool. ",
            "Family or not, my sister does something like that to my wife, particularly when she wasn't even in the wrong in the first place, the bitch is getting cut that night.  We pack up our stuff and leave that night, but not after I tell her she needs to immediately go to therapy or we'd press charges.  \n\nI cannot fathom being in the same home with someone diabolical enough to do something like that...",
            "I don't even know where to start with how TERRIBLE this is. Even leaving out the absolute insanity of your SIL my husband would NEVER EVER EVER take his family's side over mine. I get along with my in laws now but for a few instances over a few years when Husband and I were dating they were terrible. My husband, then boyfriend, ALWAYS TOOK MY SIDE and ALWAYS made clear to his family that I took precedence.  I have never had to worry about anything like this and neither should you! \n\nAlso you should 100% shave part of that jerky SIL's hair and then ask if she's being a drama queen when she freaks out. That's not petty it's just deserved.  Or you could take the high road and be the better person, which would probably work in your favor. BUT I WOULD BALD HER ASS. \n\nUgh fuck this whole question I'd divorce that spineless idiot and I almost never agree with this subreddit and the prevailing penchant for divorce.",
            "That's classed as assault in most places, so no. You're not over reacting. Cutting off someone's hair is just one step away from causing injury. Fuck what your partner says, go to the police. This is serious shit right here. At the very least they'll make sure she knows it is NOT an ok thing to do.\n",
            "First off, your husband is being an imbecile.  Sure, it's his sister, but her behavior is shitty and you don't deserve to have that type of treatment, especially as a guest.  If he doesn't ever see that, you're way better off without those psychos.  \n\nBut pertaining more to the immature asswipe who is your sister-in-law, I say take that bitch on.  She's looking for a fight?  Give it to her.  Take that cow outside and wrench her head out of her ass.  In all honesty, standing up for yourself is a huge priority in this case - whether it's against your doormat husband or edbitch scissorhands.  Expect that most likely an argument or even physical contact may take place but it's better to stand your ground than let them walk all over you.",
            "If your husband considers this kind of behaviour normal, when WILL he stand up for you? His sister is batshit crazy and you are totally not overreacting. Even besides her cutting your hair, which is ridiculous to begin with, she also says \"he could've done better than you\". What the fuck? If you're husband is thinking this is no big deal he has to open his eyes. ",
            "You married a weak-willed coward. ",
            "holy shit, your SIL is full on psycho, do not go back there again, your husband thinking it's normal/immature that a person sneaks into a room at night with scissors is also weird.\n\nSerious chat needs to be had, what a mess!",
            "HEEEEEEEEEEEEEEEEEEEEEEEEEELLLLLLLLLLLL NO!!!\n\nWhat the fuck is wrong with your husband?!",
            "I don't say this often, but you need to smack that bitch.",
            "Husband and SIL are crap. You are not overreacting, I would lose my shit if someone would cut my hair quietly while I'm sleeping. ",
            "Your husband is an asshat. You are definitely not overreacting. It sounds like SIL has real mental health issues that they're all ignoring but that REALLY need to be addressed. ",
            "Your husband has his head up his a$$. He cant see his sister is crazy and dangerous. \n\nHe is being a selfish jerk to you, letting you go through all that just so he can watch tv with his BIL. He lets you get verbally abused and violated.....and tells you your just being a drama queen?\n\nTell him he has to get his head out of his a$$. Maybe then he can see clearly. ",
            "I my country, cutting someone's hair without their consent counts as criminal assault. Look up the legal situation where you live, show your husband. Plus, that guy needs a serious reorganization of his values and preferences.",
            "That entire family sounds extremely dysfunctional, as in she has borderline personality disorder and the rest of them enable her. Run as fast as you can to a divorce attorney, because your husband will continue to dismiss you and protect his sister. ",
            "OP your husband has been dealing with her his entire life. His views are way off than what most people would be concerning his sister. You need to have a professional explain to him how this effects you and its not OK ",
            "Your husband is a dipshit.",
            "If you had beaten her into a coma, that would also have been a reasonable response to her behavior. Fuck her and your insane, doormat, pushover, cowardly, useless husband. Your husband needs therapy (assuming he is not himself just an abuser). Your SIL needs jailtime. \n\nAnd frankly, if you doubt the sanity of your reaction, it might be helpful to talk to someone yourself. ",
            "Wow, time to set some boundaries. IE, you never want to be in the same house as SIL again. If she shows up, you leave. If you know she will be at an event, you don't go. If your husband is a dick about this, you goto counseling with him or divorce. You SO needs to have your back, and your SIL is crazy to the point your health is at risk.  \r  \rYour personal safety is not worth possible fallout with your in-laws. I would file a police report. Have what happened documented, you don't have to press charges, but starting a history of your SIL's actions will help for when it happens again (if you don't cut her out of your life). ",
            "Don't fucking go there again, that bitch is crazy. Hell, I wouldn't even expect a 10 year old to do that. If your husband wants to go there, send him alone, you don't need to go through that bullshit.",
            "Holy shit. SIL clearly has some pretty fucking serious mental issues. Stay away from her until she gets help, ditto if you have kids. Your husband is either spineless or brainless and either way I suspect you can do better than the kind of man who lets some disrespect and assault (and yes that is assault and battery) their his own wife.",
            "Huh. The short if it is that you're right and your husband is wrong for calling you a drama queen. You shouldn't have to be subjected to the SIL, and your husband shouldn't allow his family to come between the two of you.\n\nHe needs to sit down with them and tell them it's you or them...and it's you, period. They keep their bitch (the SIL) in check, or they never see him again. Done.\n\nIf he won't do that, it's time for you to consider shopping for a new husband. This is a deal-breaker.",
            "Holy shit.  I don't even. That bitch has lost her mind. ",
            "I am a grown man, weighing around 200 lb. at 6 feet tall... and if I woke up to that, I would have screamed like a little girl. I mean... uh... I would have punched her in the mouth. Yeah.\n\nJokes aside, maybe she has a psychological disorder or some kind of medical ailment. I know for sure though that is some freaky shit and I would be scared too. That is not normal behavior at all for a 40 year old woman. There are some traits in children that would look endearing on grown adults but others are simply unacceptable. As I said though, you don't exactly know if she's suffering from some kind of mental illness or has anger/anxiety issues therefore is constantly irritated by a trigger. In this scenario, the trigger is you. Maybe she's one of those possessive people and \"losing\" a brother to you makes her feel slighted? Regardless, I think you are in the right and you aren't overreacting. ANYONE would freak out if that happened to them, waking up with anybody looking at you is creepy enough.\n\nREMEMBER THOUGH!!! She is his sister. It's going to be hard for him to remain objective and admit there is a problem. The hardest thing for people in life is having to get between a spouse and family member from fighting or having problems/making confrontations. You're right though, it should be addressed and such but you have to tread carefully. You are in the right but if you appear like a whistle-blower, you will be seen as the cause of something trying to tear the family apart. You have to do this in confidence with your husband first without cornering him into it. Tell him how you felt when she did. Show him some of the \"objective and non biased\" comments here of what happened. Then see if you guys can work out something where you don't HAVE to be in situations with your SIL.",
            "Call the police.  What if she did more than that?  ",
            "Bat shit crazy people are enabled by family like that.  Fuck that.  Point it out to him, STRONGLY.  ",
            "You're not overreacting at all and your husband is an idiot for accusing you of sinking to her level. You were civil with her and she repeatedly kept picking fights with you which ended in her cutting your hair while you were asleep, something that I feel could have ended badly considering she had scissors near your face, while you were asleep. How is you being upset sinking to her level and acting like a drama queen, it's no where near sinking to her level, it's a natural reaction to something crazy and unnecessary happening!\n\nI'd leave and go home or a hotel, I wouldn't feel safe around someone who'd do such a thing, let alone want to stay in the same house as them. If your husband questions it, explain to him that it was completely out of order of her to do that to you and you're hurt that he is treating it like it's nothing when it isn't. ",
            "You are not overreacting. Stay away from her, she will kill you for no reason.",
            "Your husband sucks.  That's the bigger problem.",
            "One thing that a lot of men don't get is that women are pretty attached to their hair. Sure, it'll grow back over time and if she only got to a small amount, it shouldn't be too noticeable. But that's not the point.\n\nThe point is that she assaulted you. Does it warrant a call to the cops? Not really. But if anything similar ever happens again to anyone else, the cops need to be called.\n\nFor your husband and his brother, it also sounds as if they don't want to get into something that they probably view as trivial. When you get home, you and your husband need to have a discussion. Don't go into it as attacking him for not defending you. That can lead to resentment later on. You need to bring up how this woman treated you the entire time you were there, and see if your husband can help you find a way to deal with her. Keep not being in the same room as her at the top of the list. Again, make sure you keep it about being proactive to deal with her and don't make it all about being reactive to this one major event.",
            "Be creative, figure out how to fuck with her so she'll stop fucking with you.\n\nShe shits on you cause she can, and apparently, her whole family will support her.",
            "She cut your fucking hair? Holy fucking shit! She probably silently stood there staring at you while you slept. Thats seriously fucked?",
            "I would have whooped her ass. But that's just me. ",
            "why is this person in your lives?",
            "Your husband is an asshole.",
            "Everything that needed to be said has been said by all the posters here in the thread already, but I just had to hime in anyway.  Your SIL is insane and your husband and his brother are acting very poorly by enabling her.",
            "Sit down, and have a mature conversation with your husband. Explain how serious the issue is, and that by letting that shit slide he's enabling a mentally unhinged person.",
            "Your husband is a fucking moron. That whole family seems to be.",
            "Her behavior is not normal. However, your husband has grown up thinking that it is normal because he's been surrounded by her particular brand of crazy for his whole life. \n\nThe goal is to help him understand that what she did is not normal or healthy. She violated your space, your body (FFS, your hair!! That shit takes time and maintenance!), and trust. On top of that, she said incredibly mean things to you. He needs to have your back here. \n\nThis is not just your run of the mill petty argument- she has made it clear that she doesn't want you in her brother's life, and he can either roll with her or stand up and say that if she can deal with you in his life, then she can't have him in her life either. You chose each other for better and worse.\n\nETA Waking up with someone using a pair of scissors on/around your head is HORRIFYING. ",
            "This is the time when you (for lack of a better term) go upside a bitches head.",
            "I would've fucked that bitch up and left. Fuck her and whoever is defending her. ",
            "They are all crazy.",
            "He is not choosing you, his wife, over his sister by saying you are acting like a drama queen. There is a serious problem here and you two need to talk it out.\n\nIt is COMPLETELY reasonable for you to state you'll not be visiting her anymore, you are not overreacting. Her actions are indeed not appropriate for a near 40 year old person.\n\n",
            "Four words:\n\"Nair in shampoo bottle\"",
            "That is some serial killer shit. Never stand, sit, or lay under the same roof as that woman ever again. As far as your husband, tell him you need his support in this. Relationships work like that (where both parties support each other) or they tend to not work at all.",
            "Your SIL's actions and the way your husband handled (or lack there of) the situation tells you everything you need to know about this family you married yourself into. \n\nSIL is absolutely crazy and everyone enables her crazy and probably have been their whole life. \n\nI'd show your husband this thread to prove he is very much the only one who thinks you're over reacting. If the thousands of comments in your support don't make him think and reconsider, I'd start looking for divorce lawyers. You don't want to be involved with crazy families like this. ",
            "I would be absolutely, fanatically *livid* if I was in your situation. You are 200% justified in how you feel. SIL is an absolute nightmare and your husband doesn't respect your personal space. I would be reconsidering this whole relationship if I were you.",
            "That is ASSAULT.  I would call the police.",
            "That's assault isn't it?\n\nSo wrong. Sorry you're dealing with this.\n\nCan't even imagine wtf is wrong with your man. He should be wicked angry over this.\n\nThat he is not, bothers me about as much as the hair cutting.",
            "They don't want to do anything, because she might kill them. or you. get out.",
            "It is your husband's job to ensure that you are respected by his family.\n\nAnd sure as hell his job to ensure that you are not assaulted while you sleep.\n\nAnd sure as hell he should not be calling you names like drama queen either in private or in front of them.\n\n\n\nShe's batshit crazy, and he's not much better for the way he's treating you.\n\nNONE of that is acceptable. Stand your ground. Stay away from the lot of them... and start considering if you should even stay in this \"marriage.\" ",
            "Hair is used by some cultures to do black magic, I know mother tried to split his son from a woman she didn't like. To curse someone they need piece of the person and hair is the easiest thing to get. I don't belive in black magic but some people believe really believe. ",
            "She is about to make a voodoo doll out of your hair.",
            "That's super messed up, and definitely not normal behaviour from an adult. \nI don't think you're overreacting, and I think your husband sucks for being such a pushover.\n\nShaving her eyebrows off. That's sinking to her level. \nWanting to be respected and not be violated while you're sleeping is totally normal.",
            "Your husband is a buffoon if he really thinks you are the drama queen. Seriously, your husband is dumber than a sack of hair if that is his final answer. Somewhere deep inside, he probably knows he is wrong, but unfortunately he is letting his laziness and cowardess make the call for him.\n\nUnfortunately, you see that a lot on this reddit. People will be on the outside of dysfunctional family dynamics and see red, but their partner is too deeply invested to see it as well. What is easier, causing a big stink and completely changing family dynamics, or telling you that you are just being too sensitive? He chose the lazy, cowardly, dumbassual path.",
            "Wow some spine your hubby has. Sounds like an enabling family. Please be careful. Do not DO NOT GO AROUND THE SIL AGAIN!",
            "It sounds like throughout the trip she was mean to you and constantly went out of her way to start shit. For fucks sake she started screaming at you about how your husband could have done better! That is absolutely unacceptable and your husband should have told her so and you guys should have left. \n\nYou removed yourself from the situation by going to bed and she intentionally sought you out and went out of her way to start shit when you couldn't have possibly been bothering her. She cut your hair just because she was angry. Besides being mean and immature its also crazy and scary. Who knows what she will do the next time she gets angry or how bad things will escalate. If the screaming at you wasn't the last straw for you husband in regard to his sisters behavior this should have been. I'm amazed the two of you didn't leave that second.\n\nYour SIL doesn't like you. She has gone out of her way to make this known and harass you at every opportunity. You are not sinking to her level by deciding to remove her from your life. Why would any rational person put themselves in a situation where they are unwanted and will be subjected to abuse? Tell your husband that his sister has destroyed any possibility of a relationship between you two and that you will have nothing to do with her until unless she changes her ways and makes a genuine effort to have a normal relationship. Let him know that if he wants to spend time with his sister that's fine, as long as he knows that you will not take part and that she is not allowed in your home.",
            "It's important to trust your perception and judgement:  your SIL is disturbed and as said above by r/itsnotgoingtohappen, her family likely have normalized this situation.  It's important you don't stay there (it's unsafe).  You may have to consider counseling with your husband, but I doubt this is the only area of difficulty that he is in denial about.  ",
            "I think we will need an update on this one. \n\nYou're not overreacting. She sounds crazy. Get out of that house. ",
            "Tell that twit that this is assault and you will report and press charges.  Thank her for the evidence.  What a cunt!",
            "This is horrible!  That would be the end of my relationship with her.  I read it to my husband and asked what he would do.  He said he would get his bags and leave immediately.  Your husband is under-reacting.  ",
            "I'd seriously consider filing assault charges. ",
            "Its weird that he won't stand up for you to his SIL, I mean they aren't even blood related. I would have to physically restrain my husband if his blood related sister did that to me... ",
            "This is so fucking embarrassing... How can a 38 year old woman at so petty?? So childish??  Just picturing that made me cringe. ",
            "She's cray cray! Better not be taking your hair and making voodoo dolls and stuff. ",
            "I agree with all the top comments. I would definitely confront your husband on the lack of backup. It sounds like this behavior is normal from your sil but that does not mean its OK and should go unrecognized. Your sil husband is stupid for being with a woman like that, I can't imagine the things she's done to him! Kudos on not punching your sil in the face for that. I surely would have! Best luck!",
            "This is too fucked up. Go Sarah Connor on their asses. \n\nYOU MUST UPDATE! I'm in a rage over here for you.",
            "People get killed over less.  You don't touch any, ever, without their permission unless you want shit to go down (is what I was taught).",
            "Beat her with a steel chair ?",
            "Where I am, this is assult. If someone did this to me, I'd call the police and have them arrested.",
            "You are NOT overreacting. That's fucking weird. ",
            "Dude.  That sounds like some weird serial killer type shit.  \n\nShe needs help and your husband needs a reality check. ",
            "If she's cutting your hair in your sleep, she has no boundaries and could cut a lot more (such as your neck). ",
            "She seems mentally unstable. Wow...cutting your hair, wtf! I would have kicked her ass.I'd be pissed at your husband too for being so passive about it.I'd tell him you don't want to be around her anymore point blank period. She needs help what a weirdo, I'd be furious. What's your husband's deal,does he not give a crap about you or something?he seems to just let her treat you this way and say really rude things to you,and doesn't back you up.I wouldn't put up with that. It's just really strange he'd act like that's no big deal...she's almost 40..",
            "If it was anyone else in the world doing it, would your husband think cutting your hair in anger is OK? Of course not. \n\nYou need to leave that situation. Your relationship with your SIL is over. There's no coming back from this. Not without tons of groveling and apologies which we all know will never happen.",
            "Anytime someone comes to me while I'm sleeping with anything that could possibly do harm to me, it's a done deal. His sister needs help and so does he. Did he really call you that? One, stop visiting her. Hell, be cold all you want. Just stay away from her. Two, marriage counseling. You two have the problem of your husband not defending his own wife. Blood or not, once he slid that ring on and said those magic words, you became the #1 person in his life right after your children. If he has a problem with this, then it's about time to reevaluate some things.",
            "Run.....",
            "You need to leave fuck him let him stay. But make sure he understands that you are leaving because she's crazy as a shit house rat you dont feel wanted much less safe in that home and that he is not be a good husband at the moment.",
            "Holy shit! I can only imagine what you've had to put up with up until now. I assume your \"Am I reacting?\" Is more rhetorical, but if you've been told, all this time, shit like what your husband told you, then I can't blame you for at least kind of wanting to let this shit slide. Stuff the people closest to us carry the most weight. \n\nI'm sure your husband has been mindfucked as well, since she is his sister. But to say you should ignore it when you're the only one bearing all the weight is unfair and shows a lack of empathy, at least in this situation. \n",
            "Kneejerk reaction? The husband is a spineless sack of shit. How do people like this manage to get married? Oh and the sister is a big sack of crazy, but that much is obvious.",
            "That is disturbed behavior.\n\nTechnically it is assault.\n\nNever go back there, nor allow her to come to your house.\n\nIt might ultimately cost your marriage if hubby doesn't back you up.",
            "She's probably some crazy wanna be witch and wanted a lock for her spells.",
            "What's the quote about making sure you aren't just surrounded by assholes before deciding you are depressed? Seems relevant here.\n\n\nThe truth is, your bodily autonomy was violated and your husband doesn't seem to care. The sister is a danger to you, and your husband is an enabler. Get away from your abusive family, OP.",
            "Are you going to have kids with this guy?\n\nIf so, shame on you. You should not bring kids anywhere near that horrible family. And your husband is clearly not willing to cut his sister out of his life.\n\nYour husband is going to side with his sister in all the crazy stuff she pulls. He won't defend you. He won't defend your kids either. ",
            "What you  do is you leave that piece of crap husband since he seems to care so little of you.",
            "Omg she's 40??? Holy crap she has some issues and ur SO is crazy for thinking that you are sinking to her level. His sis has some screws loose. Yes she cut your hair but she sounds like the type to hurt you more.\n\nDont go to her place and if ur SO doesnt agree, then there is something wrong there. Even though people are used to crazy behaviors from siblings it doesnt make it right.",
            "You should talk to your husband calmly and probably show him the reddit comments and let him know that's being dismissive of what easily seems to be mental health issues and that you're no longer going to be going to your SIL's house and that she's not welcome at your house until she's being properly treated for her dysfunction. This isn't something that a 40yo should be doing, that's 14 and under behavior (and that's being generous). \n\nAdults communicate their issues and through communication they are solved, not through such unhealthy measures as to go and cut someone's hair. Go in reasonably and say that you feel disrespected for his disregard of your well being and that you're not going to allow such misbehavior to be tolerated, tell him that it was a malicious act and that well-functioning adults do not interact in that manner. \n\nGoodluck, keep calm but be assertive and firm. Do not let him brush you off and tell him \"Don't brush this off, it's important\" if he attempts to and if he does you need to show him how important this is in whatever way is going to really open his eyes to this issue (i.e. Counseling session, or telling him that this is something that makes you consider separating that not only did he disregard your well-being but he blamed YOU as a victim.)",
            "Call the cops, that's a form of assault, teach her a lesson.",
            "Ummm.. my question is why didn't you beat the shit out of her .",
            "In Denmark cutting your hair without your knowledge and permission counts as assault. Throw her immature ass in jail. Also, tell your husband he's a jerk and needs to stand up for you.",
            "If someone is cutting your hair without your permission I'm pretty sure legally that's assault with a deadly weapon. Hair is a part of your person and she took scissors to it. ",
            "Your husband does ***NOT*** get to decide whether or not this was okay.\n\nThis . . . this cannot be overstated.\n\nIf he believes otherwise, then there are bigger problems with the relationship here.\n\nWhen someone else has touched your body, without your permission--*especially* someone who does not have your best interests at heart--nobody else's opinion matters.  Full stop.\n\nThis is not even just a question of comfort, or boundaries, or emotional violation.  This is a question of, yes, safety.  Questions about SIL's character (\"she didn't mean any harm\") are now totally irrelevant.  \n\nThe relevant facts are that she was using **scissors** on your **head** while you were **sleeping.**  That is all. This is just plainly, physically dangerous.  Questions about why she did it, or what she meant by it, quite simply do not matter now.\n\nIf your husband and his brother want to treat this as something un-serious, then they can do so without you.  The boundaries on what can and cannot happen to your body are **not** up for debate.  Again, I cannot possibly put this strongly enough.\n\n(God forbid that she try and pull this shit with someone who could be a survivor of physical abuse or of sexual assault.)\n\nIf they feel that SIL's behavior is \"immature,\" then you might point out that one way for her to mature is to learn that there are consequences to her actions--consequences like alienating a family member to the point where you are no longer comfortable staying with them.\n\nAnd \"immature\" or not, you might also remind them that, as a mature adult, you can decide not to put up with people who are being shitty--there's enough of them which can't be avoided, and nobody needs the optional ones.",
            "I was so shocked that someone would cut your hair in vengeance whilst your sleeping (its very sick behavior and I would have killed her)... but I was even more shocked at your husbands reaction tbh. Your NOT being a drama queen at all. She cut your hair whilst sleeping... thats just so beyond fucked up. Your husband could at least try and empathise. Hes being a dick about it in my opinion. ",
            "THIS SITUATION IS INSANE AND YOUR HUSBAND IS AN ENABLING BLIND ASSHOLE\n\nShe cut your hair. She cut your hair and eveyone says your the crazy one. They see how thats crazy right? Obviously not because theyre morons. This is truely some evil vengeful disney princess type of shit. This is what a disney movie antagonist does to the protagonist of a childs film. How does this happen in reality? How does a 40 year old woman do this! thats just nuts. Toddlers wouldnt do this. ",
            "Sorry to say it, but sounds like you should have whopped her monkey-ass. This just makes her sound like she's fucking crazy and she was technically already assaulting you.\n\nThen tell your husband that if you're such a drama queen he can go fuck his sister. ",
            "Please tell me you are not going to let your husband bully you into being around this woman. Her behavior is completely inappropriate and you are not overreacting at all. Ask your husband how he'd feel if he woke up to someone shaving his head. I would seriously consider couples therapy if I were you, his inability to understand how fucked up that is is a bit frightening.",
            "You're not safe in that house.  Leave. \n\nIt's sad your husband won't defend you or protect you.",
            "Your husband is being the immature idiot. Just remain calm but assertive and tell him that you will not be going there, no matter what. If your very presence antagonises this stupid woman, then it is more than clear that the best and only option is to avoid her altogether. Assert your autonomy from both her and your husband.\n\nI suspect that if the silly bitch had done it to him, for whatever reason, that he would have almost certainly knocked nine bells out of her.",
            "Sorry I would have knocked her out. Then called and pressed charges. What a bitch. And your husbands a jerk fir not being there when you need him.",
            "I'd be divorcing his ass! ",
            "If my sister did that to my wife I would hold her down and shave her head.",
            "Wow your husband sounds like hes used to this drama? sounds like you married into the drama family... run for the hills... and fast... that's my advice...",
            "WOT\n\nTHE FUK",
            "I'd cut a bitch if they tried to snip off my hair while I was sleeping, let alone telling me I wasn't good enough for my husband. The fact that no one is taking you seriously must be infuriating. They all take you for granted and are turning you into a doormat. I would seriously consider a separation so that your SO can see that you need to be listened to and respected. If his brain can't turn on at that point, I'd consider finding a man who would step up for you as you need to be respected.",
            "I think your husbands reaction to this is a much larger problem than the 38-year-old child cutting your hair. Your husband is a knob.",
            "You should divorce your husband.",
            "People calling for a divorce or anything like that SHUT UP. Let's not forget the sister in law is crazy. Her husband and OP's husband are accustomed to the behavior. \n\nOP you need to make your husband realize how much this matters. If he keeps being a doormat then do something about it yourself.\n\nGo for the eyes first. Pocket sand!!",
            "Ok, your boyfriend is a gigantic douchebag, so is his brother. Fuck him, you can do better than that. You don't need people to be condescending towards you.",
            "You're not overreacting, but I'm laughing my ass off. ",
            "Sometimes, and no justification for her, people get so used to making excuses for a family member's eccentric behavior, that what it really is, isn't clear to them.  I'd recommend you and your husband go and talk to someone professional, and discuss this with a \"referee.\"  Your SIL's behavior is pretty bizarre, and may indicate more than just jealousy or anger. If your husband is used to it, he may be discounting just how weird it is.",
            "damn, that's how bitches get stitches"
        ]
    },
    {
        "post_id": "3d13ka",
        "author": "pissedsister",
        "title": "UPDATE: My sister [18F] is trying to seduce my [24F] boyfriend [24M].",
        "url": "https://www.reddit.com/r/relationships/comments/3d13ka/update_my_sister_18f_is_trying_to_seduce_my_24f/",
        "score": 2732,
        "num_comments": 361,
        "created_utc": 1436721826.0,
        "selftext": "Link to [OP](https://www.reddit.com/r/relationships/comments/3cqr0u/my_sister_18f_is_trying_to_seduce_my_24f/). TLDR was: my sister flounces around in her panties and regularly tries to engage with my boyfriend sexually, whether I'm around or not. It's extremely disrespectful and annoying and I'm sick of it.  \n\nThank you to everyone who responded to my last post. Even though I was seriously pissed off (as I'm sure you could tell), I carefully read each comment and thought about it. Thank you all for your advice. \n\nOut of the three main options--talk to my parents, confront my sister, or have my boyfriend shut her down--I decided to take two. I contacted my parents first, which was very difficult for me, and told them about what had been going on and that I was going to kick my sister out. I said it in a \"no arguments\" way, just a statement of fact that her behavior was completely unacceptable and that I had given her many chances in talking to her about it. I said I was telling them first so my kicking her out wouldn't come out of the blue for them and they could help her find someplace else to live if they wanted to. I did not send the screenshots of her FB convo because 1) I never took the screenshots and 2) I didn't feel any need to prove anything to them, it really felt like my decision whether they believed me or not. \n\nTo my surprise, my parents actually believed my side of the story, though not for the reasons you would think. \n\n1) There had apparently been an \"incident\" at a recent family reunion that I didn't know about because I'd been unable to go. Our close cousin, Bea, who is one year older than me, brought her boyfriend to our annual family reunion to introduce him to everyone for the first time. Apparently Hannah shamelessly and openly flirted with Bea's BF in front of everybody--in front of Bea, in front of our parents, in front of Bea's parents, all of our aunts and uncles. I don't know *exactly* what Hannah did, but according to Bea (who I asked about it after) she was very obvious about it, trying to touch him a lot, sitting next to him whenever Bea got up to go somewhere else. Etc. It was just very obvious.\n\nEveryone witnessed it and it was the gossip of the family for that entire day. My aunt and uncle (Bea's parents) were disgusted with her behavior and judged my parents for allowing Hannah to behave that way. ALL OF A SUDDEN my parents cared about what she was doing, because now it was affecting their reputation with the family (the most important thing to them). So apparently they were pissed at her for what had happened and had taken her car away for a few months prior to her coming to live here.  \n\n2) My parents don't want anything to endanger my relationship with my boyfriend because they consider him to be a \"catch\" (white, handsome, going to law school) and want us to get married and have smart babies. :| So they don't want Hannah to ruin that.\n\nMy parents said they would talk to Hannah and beat it into her head that she could no longer act that way and that she was close to fucking up her living situation and our relationship. They begged me to give her a second chance and to give her time to change once they talked to her. I told them I'd think about it, but once we hung up I decided I didn't trust them to *actually* talk to her (call it 18 years of experience)... \n\nWell, whether they talked to her or didn't, the very next day Hannah posted something on her facebook to the tune of \"Sometimes you can't let other people get in the way of love! ;)\" So I sat her down and decided to have a talk with her myself. \n\nI told Hannah that if she didn't cut out her behavior immediately, I was going to kick her out. I told her that I knew about everything and that it sickened me that she would not only disrespect me by trying to seduce my boyfriend, but that she would freely backstab her own sister just to get with a guy. I told her that it made me feel disgusted knowing that she had a childish infatuation with my boyfriend, but that even if she did have feelings she couldn't help, she needed to learn how to control them like an adult and RESPECT ME, my relationship, and my home. \n\nHannah mouthed off and said that my boyfriend was going to leave me anyway because I didn't put enough effort in looking good for him (I don't wear makeup every day, only on special occasions or on dates when I want to look nice for him, and my clothes are pretty plain) and that there were dozens of women in this city that could catch his eye. Then she said that she didn't have to listen to me, fuck you, you're not that much older than me, you're not my mom. She said, word for word, **\"I'm not a kid anymore, I can do whatever the fuck I want.**\"\n\nSurprisingly I kept my cool and told her that was true, there were adult consequences to her actions, consequences which could range from getting kicked out and having to move back home to getting her ass beat. She was in the real world and couldn't get away with her shit anymore. \n\nShe said \"I couldn't kick her out because it was illegal\" and that she could do whatever she wanted, and doing whatever she wanted meant \"being herself\" around my boyfriend. So I told her that she had 30 days to evict the apartment. \n\nShe stormed off. I contacted the landlord and made sure that everything was square (she's not on the lease so they didn't give a shit) and told my parents that it was final, my sister had to be out of the apartment by the end of the month. They didn't say much and seemed stunned that she would \"suddenly\" act this way. They think the influence of the big city is causing her to act out... Whatever. \n\nI chose not to involve my boyfriend further because several people said that this was between us (me and Hannah), and they're right. I don't want him unnecessarily uncomfortable/forced to do something he doesn't want to do, though he has voluntarily offered to talk to Hannah and shut her down in the past. I personally don't think it would do much to stop her anyway, given her reaction to my little lecture. So I left him out of it. \n\nI am getting a small nannycam to monitor the apartment while I'm away however, to make sure 1) Hannah doesn't break anything and 2) to protect myself and my boyfriend in case she decides to make any false accusations against either one of us. At this point, I wouldn't put it past her. I seriously have to wonder if my sister is just a huge fucking bitch as a result to being hopelessly spoiled, or if there is something going on with her. I really don't know, but I'm fed up with her acting this way when *I* did her a favor in letting her live with me. \n\nSo, that's that. Hopefully I don't have to update again and she moves out peacefully... Thanks all for listening to me rant. \n\n**tl;dr: I called my parents, they believed me about Hannah due to some past behavior but begged me to give her another chance. I talked to her, she blatantly told me to fuck off. I'm not giving her a second chance. She has 30 days to move out and I'm getting a nannycam to protect myself, my belongings, and my boyfriend. I don't know what the fuck is wrong with her honestly.** \n\n**EDIT: So far I haven't heard from Hannah herself because I've been at my boyfriend's pad, but my parents tell me that she will be out of the apartment by the end of the week. Her facebook is a whiny crying shitstorm of \"LIFE IS NOT FAIR\" \"NO ONE UNDERSTANDS ME\" \"YOU CAN'T FUCKING TRUST ANYBODY, NOT EVEN FAMILY\" and \"MY LIFE IS RUINED\". I have hidden her from my feed and I am going to watch anime with my boyfriend. I have already served her formal eviction papers as of today; thank you all for your suggestions. \n\nAlso: some people seem very upset that I alluded to my parents thinking my boyfriend is a catch because he is white. To the point where I'm getting very redundant PMs about it. Let me be clear: I am not white, I am Asian. However, I do not hold my Asian parents' viewpoint. My boyfriend's race does not matter to me; I think he's a catch, not for those reasons, and I love him for who he is. My parents are old-school racist Asian people who objectify people (including their children) and reduce them to basic, simple attributes that are categorized into \"approved\" and \"disapproved\". A strong handsome white dude happens to fall into their category of \"yay.\" They also think I'll never do any better than him, so all in all it's a pretty fucked up way of thinking for both sides. You can see why I don't talk to them much. \n\nI never condoned this attitude and I'm fully aware of how racist it is, but there's nothing I can do about how they--and a large aspect of the culture they come from--view the world. I'm quite tired of people getting worked up about that one comment and thinking that *I* subscribe to that line of thinking. I do not. Thank you.**",
        "permalink": "/r/relationships/comments/3d13ka/update_my_sister_18f_is_trying_to_seduce_my_24f/",
        "comments": [
            "[removed]",
            "Make sure to serve her formal written eviction papers!",
            "I am feeling such second-hand embarrassment for your sister when she looks back on this mess in 5 years...\n\n\n\n\n",
            "I think you're handling this very well! She might act out again towards the end of the 30 days when she will realize that you are ACTUALLY kicking her out - so be careful!",
            "I can't even imagine the amount of entitlement your sister feels. Like, how does she think she's going to get through life like this? Actually, unfortunately, many people get through life like this because others enable them. But I'm glad you put your foot down! She needs to stop being enabled by the people around her. And it sucks that your parents believe you for the wrong reasons. They need to realize that your sister is the kind of person who could easily go out of control and do hurtful shit to herself and other people. \n\nWishing you the best of luck!",
            "[deleted]",
            "I'm glad you're taking the mature, safe path with this. In addition to moving the valuable/breakable stuff to your boyfriend's place (like you mentioned in the previous post), make sure you keep the essential stuff like your wallet and phone with you at all times. I wouldn't put it past her to grab your credit card and order a bunch of stuff online while you're out.\n\nOne thing you may want to keep in mind would be to double-check on the exact legality of secretly recording someone without their knowledge, especially when they have a reasonable expectation of privacy (such as inside their home). In my state, you can't secretly record them without telling them first that they're being recorded. You don't want her or your parents to counter-sue because you invaded her privacy, even if it was to protect your interests.",
            "Make sure you give her WRITTEN notice of the eviction. Otherwise she may be able to claim that she was never properly served and you will have to start the process all over again.",
            "Do you plan on having dumb babies just to spite your parents?",
            "You have handled this AWESOMELY. I can't for the life of me figure out why your sister is acting like this. No point in trying to figure it out anyways, she'll never spill. It's time for you to batten down the hatches until she's gone. I would try and lock all your valuables away, maybe even get a lock on your bedroom door if you can? Don't have your BF over until she's gone, try not to leave her alone in your place for too long, etc. etc. It sucks that your own family member is doing this to you. Here's hoping that someday she snaps out of it and dies of shame when remembering what she was doing.",
            "If she doesn't move out in 30 days you'll have to take her to court for a judge to rule that she has to go before the police will force her out.\n\nMake sure you do it all legally.",
            "You need to formally (legally) evict your sister, despite the fact that she is not on your lease.  You told her 30 days, but if you haven't filed the proper paperwork, when that 30 days are up and she doesn't get out you will have no actual legal recourse to remove her and the police won't be able to help you.  You'll end up waiting *another* 30 days after you file the paperwork so go ahead and do it now.",
            "I come to this subreddit hoping there are many updates as awesome as yours. Go you! You've got your head on right. Good luck with your sister, hopefully she won't stir much more of this shit. \n\n> She said \"I couldn't kick her out because it was illegal\"\n\nLol classic entitlement. I know you're worried there's something going on with her, I mean she is your sister, but to me this is a clear sign that while she might have issues, those issues are being a hopelessly spoiled brat.",
            "> My parents said they would talk to Bea and beat it into her head that she could no longer act that way and that she was close to fucking up her living situation and our relationship.\n\nThis confused me for a second",
            "Good going. I'd make sure that any important paperwork or whatever she could screw with that would cause you real trouble is locked safely away somewhere, but so far it looks to me like you're doing things right.",
            "Whenever it happens, life is going to hit that girl like a fucking freight train. Parents who raise their kids like that are doing them zero favors. ",
            "The cam is a good idea, and you approached this in a very mature way.  Way to stay cool in the face of her thrown insults, those were designed to elicit a reaction that you definitely didn't give.\n\nShe's got some issues for sure, do try to remember that, she probably needs therapy, and take it easy on your parents, they may have just had to realize that they were wrong, and that's a hard thing to do.  At least nobody got hurt here, in a permanent manner. ",
            "Expect some pretty hardcore apologizing/backtracking from her around day 26 or so. Don't give in.",
            "OP Just so you know this behavior indicates that she is selecting men based on them being pre-selected by other women. It's a shortcut for her finding someone herself. I forget the term for this but basically another woman finds and vettes a man an does all the hard work and therefore the man is assumed to be worthy and the other woman (your sister in this case) goes in for the kill. She doesn't have to do the hard work. \n\nShe most likely is not thinking logically though, but that's the gist of her MO.",
            "Please update once you actually put her out. Your sister is a tornado of drama. This won't end easily.",
            "I would recommend getting a safe deposit box at your bank for all your important paperwork- passport, birth certificate, any jewelry, etc.  just on the off chance your sister does something stupid.  Good on you for handling this rationally and maturely.",
            "You are my hero!",
            "[deleted]",
            "Your family sounds shitty. sorry about that. Your BF sounds nice, so you got that going. ",
            "OP, out of morbid curiosity, what is your ethnicity? Indian?",
            "I got a pretty good image of her when you reported that she said that she was an adult and could do whatever she wants. Funny how people who say that in such a context so often seem to think that's a one way street. Yes, she can. She can go where she likes and do what she likes. But it also means that she is subject to the same laws as everyone else, and that you also can do what you like. You're just as much of an adult. She can choose to do what she likes, you can choose how to react. \n\nTwo. Way. Street. Baby.",
            "Your sister has mental issues. ",
            "I never expected your parents would believe you without proof (yay!) But I wonder if they will rewrite this event later to cast your sister in a more favorable light.  I think you should get some proof for later, text messages to your sis about why she's being evicted or something. ",
            "Drop cam or nest as they are called now is great. You can watch from a smart phone and if you get the good one it has night vision. Plus you can use it to listen or talk through.",
            "Make sure Landlord changes lock to the door.\nChange your passwords \"ON EVERYTHING.\"",
            "This is bigger than just you and your boyfriend. Sounds like she's got some mental issues if she's doing this to other womens' boyfriends.",
            "Good for you OP, its very unfortunate that this had to happen but some people need a swift kick in the ass the get them moving in the right direction. \n\nI do hope she leaves peacefully.",
            "Oh this is going to be so fun!  Please update us with any developments!  I am enjoying reading your story, you're handling this really well! !",
            "After 30 days or whenever she moves out, please give us an update on the drama!!! I would love to read about a spoiled brat who was put into her place! ",
            "[deleted]",
            "A similar thing happened to me [19M].  My sister's friend [12F] started trying to seduce me in front of my girlfriend [18F]. She was putting her arms around my shoulders, jumping up and wrapping her legs around me in an obviously sexual position, sitting on my lap, etc.\n\nIt was very awkward, and apparently she either didn't realize or care that I could have gone to jail for a very long time if she succeeded in seducing me.",
            "Please do keep us posted.  :)  Hope things turn out well ",
            "I doubt you'll read this in the ocean of comments, but I think you asserted yourself in a super mature way, despite being treated like piss!  Great job, OP.",
            "I think you handled things exceptionally well.  You were very fair, but firm.  \n\nAs a former police officer who used to have to deal with people trying to kick people out all the time, kudos to you for doing it the proper, legal way.  I can't tell you how many times I had to show up, and tell people that \"yes, I know it's your house, yes, I know they haven't been paying rent, etc. but no, you can't kick them out tonight, you can kick them out in 30 days.\"  ",
            "Lmao I like how people ignore the entire post to be offended by the whole *he's a catch because he's white* bullshit \r\rTumblrinas will be tumblrinas I guess\r\r",
            "Awesome job, I was really hoping things went ok after reading your last post. How have things been in the apartment since then? Have you spoken at all, or is it silent treatment?",
            "Ok in no way is her behavior normal or justifiable. Has she ever seen a counselor? How far has this pattern gone? ",
            "It sounds like you handled things well. Kudos to you. I agree that you should probably not have the boyfriend over until after she's out of there....",
            "Everyone's said plenty. I would keep your boyfriend away from her. I knew a girl like this and when things didn't go her way she made rape accusations. She did this with more than one guy. I'm not saying your sister would do this, but just in case I would keep your boyfriend the fuck away from her. ",
            "I just wanted to comment on why your sister is spoiled. Nothing is wrong with her mentally. It may seem that way but the only reason for her lack of connection with reality is truly because of how she was spoiled. You were right to not be close to your parents and walking away from having to deal with that spoiled sister of yours. You did great with dealing with this situation.",
            "Would recommend adding a lock to your bedroom door.",
            "If you haven't seen The Crush, you probably should, just to get an idea of what you(or your boyfriend specifically) could be in for if you don't try and protect yourself. ",
            "Something is weird with Hannah flirting with everyone's boyfriends. She needs to get herself one. ",
            "hooooooo lawdy I've been waiting on this update! I'm glad to hear your parents believed you, and things thus far are going of relatively without a hitch. Just keep a careful eye on those nanny cams to make sure she doesn't break/steal anything valuable before she's out. ",
            "OP you sound like a raging bad ass. Good job. Storing away how you handled this, just in case I run into anything similar in the future.",
            "Glad you got this all figured out OP! \n\nOn the flip side, what anime u guys watchin?! :D",
            "Haha, your sister... what a witch in the making. Glad to see you're kicking her out, you'll be so relieved once there's no more annoying ungrateful selfish immature brat prancing in front of your boyfriend in her underwear disrespecting you and your relationship.",
            "You sound very mature and level headed, hope that this all blows over for you OP.",
            "Have fun watching anime!",
            "Who cares if you don't put on make up for your guy... you two watch anime together, that's a catch. lol",
            "She sounds histrionic, look it up and see if it describes her. She sounds like she needs therapy otherwise her future is not looking good. Well handled though OP! You communicated clearly and calmly and set clear boundaries. Hope the rest of her stay is relatively drama-free.",
            ">2) My parents don't want anything to endanger my relationship with my boyfriend because they consider him to be a \"catch\" (white, handsome, going to law school)  \n\nlol yeah he's white definitely goes into him being a catch:P glad it all worked out though! Good luck. ",
            "The cameras are a good idea, and if you don't have one already, install a lock on your bedroom.",
            "Firstly, kicking her out is totally the right decision. Don't back down. She's not going to stop.\n\nSecondly... Was she abused as a child? She seems to have some serious misunderstandings of love, relationships, and boundaries that may relate to being molested. I'm just a Reddit armchair shrink, but the possibility should be considered.",
            "One thing you may want to consider: this is now a pattern of behavior. This isn't just her being selfish and childish, it really sounds like she has a mental problem worth pursuing. She is habitually crossing serious social boundaries that any rational person can pick up on. Once is a shitty situation but she's actively ignoring anyone telling her no, and she keeps trying to overtly seduce family member's SOs. Don't waste your time feeling mad at her, she may need some real help.",
            "Sounds like it's beyond just being a bitch. I know there are so many \"disorders\" in the social sciences, and I feel like the symptoms overlap a lot, but these are some symptoms of Histrionic Personality Disorder. ",
            "I love your account name you chose for your throwaway :p",
            "Well done you, OP! I'm sorry this shitty situation is happening, but you seem to be handling it like a boss. I'm so glad your parents believed you, too, although it sucks to know that this whole honing-in-on-relative's-SOs thing is a trend. ",
            "Great job sticking to your guns, OP. Just make sure to get paperwork formally filed ASAP so that if she doesn't leave on her own at the end of the 30 days, you have legal recourse.",
            "Your sister is crazy and your parents sound like yokels\n\nGood for you for having your shit locked down OP, apparently you're the only put together member of your family",
            "I hope you see this OP. \n\nPlease, please, please do the things necessary to protect yourself and then MOVE ON.  What I mean by that is shift the focus of your energy onto your life, particularly your relationship.\n\nCelebrate that you've weathered this.  Go on dates.  Pay attention to each other.  Kiss a lot.  And don't talk about Hannah.  At all.",
            "Whelp. Your sister is a nasty piece of work.",
            "Your sister is weird. Good Story now back to work.\n\nDon't let the people who worry about race affect you and don't even respond to them. It is a battle you can't win and a waste of time. Sorry that you have an \"interesting\" sister - could never imagine that happening in my family.",
            "I know you didn't want your boyfriend to feel uncomfortable, But I really feel had he just said \"Stop doing that, its weird and uncomfortable, I'm really not interested in you, your too young and act like a little kid\" etc etc. \n\nIt would have shut her down.\n\nShe seems to think your boyfriend secretly wants her, and it might have helped if it came from him. ",
            "I think it's good you are evicting your sister as you have to protect your own sanity. That's what it sounds like it has come down to.\n\nI'd like to know why your sister is like that. Is she just being extremely immature, or is there something else going on? I have read that people who have been abused as children can develop inappropriate sexual behaviour later in life. \n\nEither way I do believe your sister is in desperate need of seeing a counselor or a psychologist. If she keeps carrying on like that her life will become a disaster, possibly with an early death.",
            "One thing really stood out in your post, that your sister might have problems, make sure she doesn't end up in the wrong somewhere (like drugs).\n\nI think you did the right, it's more the Aftermatch I think you need to keep an eye out on, make sure to keep in contact.",
            "I admire your no-bullshit, here are the facts, black & white (not a racial dig) way of thinking. I think the same way. We have an issue, let's sit down & figure it out, if it can be resolved- great, if not please exit my life. Love it. Hope all goes well for you OP. ",
            "damn your sister gets a weird thrill for being a bunny boiler or being the other woman. sounds like woman version of a guy who goes about being 'alpha' and hits on girls with bfs to prove their better than other people. maybe if she confronts again you can see if this is the reason /armchair",
            "You are doing what you need to do, and it doesn't sound like your sister gave you much of a choice. However, I would recommend that you talk to your parents about getting your sister into therapy. I'm not a mental health professional, and no one could possibly diagnose your sister based on a few paragraphs on the Internet. But I do believe her symptoms seem consistent with Histronic Personality Disorder. Do some research and talk to your parents. Even if she doesn't have HPD, there's obviously something going on with her mentally.",
            "You seem like a great person. \nEspecially a excellent S/O",
            "You really need to teach her a harsh lesson before it is too late. Acting like this will eventually lead to much worse things if she continues down this path. Not sure who could sit down with her and get her to listen, but she needs to hear the brutal truth.\n\nFYI You might have to consider changing locks.",
            "You sound so fucking awesome, I was really happy to read this update! I'm sorry your parents are so difficult but it sounds like the outcome was actually pretty good all things considered!",
            "Does she know where your boyfriend lives? I wouldn't be surprised if she goes over there after she leaves.",
            ">They think the influence of the big city is causing her to act out... Whatever.\n\nI think you should start the conversation that they did this. If they don't see the root of the problem, they won't be able to help fix it.",
            ">...is a \"catch.\" ([because he is] White, handsome & going to law school...    \n\nI agree with your parents.   \n/s.",
            ">Let me be clear: I am not white, I am Asian. However, I do not hold my Asian parents' viewpoint. My boyfriend's race does not matter to me; I think he's a catch, not for those reasons, and I love him for who he is. My parents are old-school racist Asian people who objectify people (including their children) and reduce them to basic, simple attributes that are categorized into \"approved\" and \"disapproved\". A strong handsome white dude happens to fall into their category of \"yay.\" They also think I'll never do any better than him, so all in all it's a pretty fucked up way of thinking for both sides. You can see why I don't talk to them much.\n\n>I never condoned this attitude and I'm fully aware of how racist it is, but there's nothing I can do about how they--and a large aspect of the culture they come from--view the world. I'm quite tired of people getting worked up about that one comment and thinking that I subscribe to that line of thinking. I do not. Thank you.**\n\nI had a feeling people were going to bitch and cry about that \"white\" part.\n\nFuck those sensitive idiots; they need to understand that those were your parents' views -- not yours.",
            "> ALL OF A SUDDEN my parents cared about what she was doing, because now it was affecting their reputation with the family *(the most important thing to them).*\n\nand\n\n> They begged me to give her a second chance and to give her time to change once they talked to her. I told them I'd think about it, but once we hung up *I decided I didn't trust them to actually talk to her (call it 18 years of experience)...*\n\nYour story, and in particular the above two quotes, are triggering my \"narcissist\" radar.  This is further reinforced by the fact that your sister is acting like a a typical 'golden child' (she's never learned how to actually be an adult, meaning she wasn't taught by parental figures and likely given almsot everything she wanted on a silver platter).  Did you ever feel like a 'scapegoat' before moving out of your parents' home?\n\nI recommend you check out /r/raisedbynarcissists/ and see if anything there sounds familiar.\n\nEither way, get your sister out of your home; she's shown that she doesn't have boundaries, and you can't coexist with that in any healthy manner.\n\nGood luck!",
            "This sort of acting-out behavior can be a symptom of past sexual trauma.",
            "Whoa! What a horrible story. I'm sorry you have to deal with this but you seem to be handling it well. I think it's fantastic that you officially evicted her though the police. Now she'll have a hard time finding a place to live because she has an official eviction. She doesn't know what's about to hit her. She'll really understand that she can't do \"whatever the fuck she wants.\" She won't be able to manipulate herself back into your life (or at least your apartment) because you have done it though such official codes. Now you won't have to waste time listening to your parents asking you to take her back after she \"has reformed\" for next semester. Stay strong and official it's almost over.    ",
            "Why on earth would you give 30 days notice to this creature? I'd have her shit thrown out the front door ASAP.",
            "(biggest face palm in my life) Your sister is cancer to your family. Tell her to lay off the porn. She has all sorts of shit running through her head that makes her thinks banging family BFs is a hot scenario and completely overlooks the fact that YOU'RE FAMILY. You're her kin. Not to mention you're older, more mature, accomplished, and there's a reason why your BF chose you. SMH!!!!! Your sister needs to grow up fast, but I can already tell she'll be the talk around campus. Sorry. ",
            ">if there is something going on with her\n\nEveryone here is really stoked that you're throwing her out, but I honestly wonder if this is the case. It's great that you aren't letting her ruin your life and it's 100% right that she shouldn't be living with you. But down the line I'd see if you can find out the cause of her behavior. People can act like this as a result of sexually abusive situations and freshman year of college is a common time for those kinds of situations to happen. ",
            "After she moves out, I would ask her if there is anything she needs to talk about and try to help her realize what she is doing. Gently suggest therapy. She is acting like someone who has been molested. Very over the top behavior. She will act disgusted that you would suggest she is fucked up, THAT DOESN'T MATTER. You have planted the seed and that is all you are suppose to do. You would want the same from your sister if you didn't know your actions were damn near serious signs of insanity or a personality disorder. It's very likely she has know idea how serious it is.",
            "Great to see it worked out. I guess your old school Asian parents must not have not disciplined your sister enough. Did she even get straight As in highscool lol? And the joke is on your parents, law school is more of a liability rather than an asset these days unless you're going to a top law school and/or graduate with little debt. ",
            "...have you taken a look at r/raisedbynarcissists yet?",
            "I like how you listed 'white' as being one of his good catch qualities.",
            "Regarding your parents, their jerks and they subscribe to a racist world view. They're not racist, and there's a lot on the topic. Just gonna say that it's sad but unsurprising that they have this perspective given the racial climate of America. Simpler to say that they hold to a white supremacist perspective but are not racist because racism as a system in America only benefits white folks. Not going at you or anything, just regarding the topic.\n\nAnyways, you did everything right, way to go. I think it's hilarious that your sister thinks it's OK to backstab you then says \"You can't even trust family.\" Like really? Good on you to get her out of your hair. Hopefully she'll gain some more mature sense of self and reflect on her bullshit. Or someone she knows and trusts will call her out and get her to realize she's behaving like a untrustworthy brat.\n\nSmart on the nannycam, hide your shit that you want safe (or move it to the boyfriend's place), don't have the boyfriend over. She's undoubtedly gonna try to fuck some of your shit up as revenge.",
            "Out of curiosity is Hanna fat? I've both seen and heard about this kind if behavior many times throughout the years and in damn near every case it's a delusional fat chick who thinks she's all that.",
            "False allegations? What are those? This is something that no woman ever does. Remember?",
            "Scrolling through the comments I noticed what the majority of the downvoted comments were about and....wow y'all love to shut down a person of color's opinion about racism lmao. Also noticed that y'all love to tell them how THEY should feel about it and basically tell them to quit being babies. Pathetic but not surprising. ",
            "Why are you giving her 30 days?  She's not on the lease, kick her ass out immediately.",
            "Dude, she's a piece of white trash. Beat her ass. I actually have a younger sister who acts like that, I've cut off all contact with her. She can die under a bridge for all I care.",
            "[deleted]",
            "If you love your boyfriend, just let him fuck her. He wants to.",
            "A \"catch\" = white . wow.",
            ">they consider him to be a \"catch\" (white, handsome, going to law school)\n\nFuck off with your white supremacist parents.",
            "\"White\"\n\n\n\n",
            "\" \"catch\" white...\" ",
            "White?",
            "Am I the only one that caught that OP alluded to her BF being a catch because he was WHITE???? (among other things)\n\nEDIT: can someone who has down voted me explain what the deal is?",
            "Move out?",
            "What the fuck does being white have to do with your boyfriend being a catch?",
            "As a parent I understand their concern with you moving forward with your relationship.  The smart babies thing is not a small thing.   They are the future of the family.  While it cannot be guaranteed, not much could be more important in today's world.\n\nSo my perspective is basically that you're launched and Hannah doesn't matter much to you and is not your responsibility.  There could be some major sibling rivalry going on here that could ruin the future of the family.  Put her second and yourself and boyfriend first here.  Make her find her own way.\n\nIt's good to clarify this with her and get her out of there, so SHE \"gets it\" and gets on with the search for her OWN boyfriend.  And contributing her OWN children to the family line.  This situation needs to be resolved and it's impossible to spare her feelings here.  Don't even try.  I am very glad she escalated to the point where you had to follow through, because it looked like you might wimp out and let her stay.  No, she goes.  And doesn't even come back to visit for a good long while.  If you need to meet, use her place or find a neutral spot.\n\nYou were too nice to give her 30 days, probably because you thought you were legally \"covering your bases\" before having the time to find out what your legal obligations were, and weren't.   Oh well."
        ]
    },
    {
        "post_id": "3y20qs",
        "author": "familysuxthrow",
        "title": "UPDATE: My GF [30F] overheard my [35M] family talking badly about her",
        "url": "https://www.reddit.com/r/relationships/comments/3y20qs/update_my_gf_30f_overheard_my_35m_family_talking/",
        "score": 2729,
        "num_comments": 189,
        "created_utc": 1450937965.0,
        "selftext": "**Edit: Thanks for the gold!**\n\n[Original Post](https://www.reddit.com/r/relationships/comments/3smtqa/my_gf_30f_overheard_my_35m_family_talking_badly/) found here. \n\nA few people have messages me for an update, so I thought would post. First, thank you for all the kind words and great ideas. It really helped me get some perspective on the situation.\n\nFirst off, Sammy and I had a wonderful Thanksgiving. We spent  it out of town in a small skiing town. It was a great weekend and we spent a lot of time talking and discussing what to do about my family. Sammy was still pretty hurt over the matter but was adamant that I shouldn't cut all ties with my family.  I told her that all depended on my family.\n\nMy mom was in denial that I wouldn't be coming to Thanksgiving. After my last post, I let her know Sammy and I wouldn't be attending. She brushed it off until the day before Thanksgiving when she called to make sure I was bringing pie. I reminded her I wouldn't be at dinner and she broke down crying. She told me she was sorry for hurting Sammy and would like the chance to apologize. I let her know she'd have a chance after Thanksgiving. \n\nAfter we got back from our Thanksgiving trip, my parents came over for dinner. I had okay'd this with Sammy. She thought my parents deserved a chance to make this right and frankly, I think she really wanted to mend things with my family. Dinner was, awkward, to say the least. My dad started out by offering Sammy a genuine apology. He told her he was extremely embarrassed and genuinely wanted to make things up to her. They had a nice chat. The talk with my mom, well, that went okay. My mom cried through most of it and tried to reinforce that she was very sorry. I couldn't tell if she was sorry or just upset that I was taking Sammy's side. I don't think Sammy was convinced either.\n\nA few days after dinner, my mom called Sammy and asked her to lunch to talk by themselves. Several comments in my last post mentioned that my family probably felt Sammy was annoying simply because they felt intimidated  or projecting their own issues on her. I think that was spot on. Sammy went to lunch with my mom they had a very long, good talk about everything. She said my mom felt jealous that Sammy was so educated and had the chance to get an education. And Sammy admitted to being jealous that my mom has a big family. Sammy opened up to my mom about the situation with her own family and living on her own since she was a teenager. I think that hit my mom very hard because she's always been surrounded by a big, loving family. And, I think she was horrified by her own behavior towards Sammy, who wanted to be a part of the family. Overall, I think things are better between my parents and Sammy. \n\nMy younger sister reached out to Sammy after Thanksgiving. I don't think any of my siblings expected me to ditch family dinner and I heard they were pretty upset I went on vacation instead. My sister apologized over the phone. I don't know if it was enough, but it was a good step. Sammy says she's feeling pretty neutral about my youngest sister. She said she feels like my sister is more sorry she was caught, but Sammy appreciated the apology.\n\nMy brother had to endure a very uncomfortable few weeks at work, while Sammy was traveling. I think by Thanksgiving, he was confident that Sammy wasn't going to screw with his job. When Sammy got back to work after our vacation, he went to her office to apologize. Again, I think he apologized just to appease us. But, he did it in person and didn't try to cop out. Like my sister, Sammy feels neutral about him.\n\nMy other sister (my brother's twin) is the only hold out. She hasn't given Sammy an apology and seems pissed that she no longer has a built in free babysitter. She's doubled down and said she has nothing to apologize for and Sammy is the one causing troubles. This has caused a bit of a rift in my family. My parents would like Sammy and I to come to Christmas dinner, but I'm not interested in being around my sister right now and I'm not going to subject Sammy to that. My parents have even suggested that my sister should stay home to make us more comfortable in coming. While I appreciate the sentiment, I would feel guilty about my sister being alone on Christmas (her kids will be with their dad). Sammy and I have plenty of offers from friends, my sister would probably not be able to find a place to go on short notice. Sammy has told my parents she would rather not create a bigger rift and we'll come over at another time. Sammy told me, privately, that while she has forgiven my family, she's not all the comfortable hanging out with my family just yet. I'm perfectly okay with this, I feel like taking some time from my family will be a good thing. Sammy and I are still deciding where to go on Christmas, probably to my best friend's house.\n\nThe best part of the update: My best friend's wife went ring shopping with me. She let me go to all the chain stores and balked at the prices for the same ring in every store. She eventually took me to a local jeweler and we discussed a custom ring. The jeweler completely understood what I wanted and I decided she would be great at designing a ring. She's pretty backed up with orders, and said she'd be able to get to it in January. A few nights ago, she texted me a picture of a stone she had found, to see if it fit what I had in mind. Sammy saw the text and it led to an impromptu proposal. She said yes! So, now I have a fiance! We haven't really told anyone yet. I'll tell my family at some point. But for now, I'm enjoying sharing this time with her. \n\nSo, things are okay. Better than I hoped since my last post. I'm very sad about my sister because I miss her and her kids. And I miss my family. But, I feel good about my decisions. I feel like things will get better with my family, except my sister, in time. Sammy liked the idea of a destination wedding next summer, but we haven't even started any planning yet. Sammy told me after everything that's happened with my family, she feels confident that I have her back and that she finally has me as her true family.\n\nTL;DR Parents, brother and sister apologized and tried to make things right. Other sister is holding fast in her assholishness. Proposed and now I have a fiance. ",
        "permalink": "/r/relationships/comments/3y20qs/update_my_gf_30f_overheard_my_35m_family_talking/",
        "comments": [
            "[deleted]",
            "Very nice, congrats.\n\nThough I'm appalled that the one who should have been her supporter is the one hold out.  You sister trusts her to baby sit but talks shit on her and won't apologize?  Messed up.",
            "It's so nice to read an update with a good result, you sound like a very supportive partner! I'm glad that some of your family members realized how much they had screwed up. Congrats on the engagement!! ",
            "This is the very best. ",
            "[deleted]",
            "Probably missing the family xmas is a good idea.  Just to drive home the lesson.\n\nYour family is on probation.",
            "1. Congrats very much to the both of you!!!!!\n\n2. I just read your original post and was seriously aghast. If what happened to Sammy happened to me... oh lord. It would have killed me. Your post broke my heart so much, but how you reacted amazingly made it all better. I wish you guys the best.\n\n3. Your family can fuck off, MY GOD. I'm glad they are coming around, but MY GOD. I cannot believe they did that. \n\n4. Sammy sounds amazing & so do you!! <3 ",
            "Damn OP. You are handling this like...top one percent of /r/relationships posters. \n\n\n I think you need to get drunk and do something so the bar you set isnt so high.... ",
            "Congrats to you and Sammy! ",
            "You are a GOOD fiance.  Very nice work.  You stood by your girl, you set boundaries, and you followed through with them.  I'm really impressed.  I'm sorry about your bitchy sister.  Hopefully you can arrange a visit with the rest of the family, without the sister. That way you can bond and start to rebuild those relationships, since Sammy really seemed to appreciate them before shit hit the fan.",
            "Thank you for happy-updating us; this is great news :)  I'm so glad your mother, particularly, warmed up to Sammy. Half-hearted apologies from the others at least tells you they know they were out of line.  Your other sister will either grow up and learn to apologise or be uncomfortable at every family gathering ever.  Her choice.",
            "Man, you guys are both very lucky to have each other..I'm literally smiling right now",
            "This had everything that could blow up into a massive shit storm but you handled it like a pro. CONGRATULATIONS!!!!!!! To you and your fiancé!!  I think this will all work out great and wish you the best of luck!",
            "You made me cry OP, One of the best updates in this sub. Wish you all the best. <3",
            "First, I'd like to say Congratulations on your engagement!\n\nSecond:\n\n> My parents have even suggested that my sister should stay home to make us more comfortable in coming. While I appreciate the sentiment, I would feel guilty about my sister being alone on Christmas\n\nI wouldn't. Sounds like she could use some time to herself to think about things. \n\nThat said, your current plan sounds best. If your fiancee isn't up to spending time with your family again then there's no reason to force it. So enjoy your holiday. :)",
            "This may sound odd but I believe after a few years of marriage and maybe a child or two of your own the two of you will look back on these events and be grateful for the lessons learned from them. And I'm not talking about a \"silver lining on a cloud\" kind of thing. I think the entirety of this experience - especially the ugliest and most difficult parts - will end up being a real foundation for you both. I'm very happy and extremely optimistic for you both. ",
            "[deleted]",
            "[deleted]",
            "I was worried about you two. Not anymore. Congrats man.",
            "Congradulations! I hope you two have a beautiful life together.",
            "Merry Christmas to you and Sammy! I'm so happy to read your update. I've had similar things happen with the family of an ex boyfriend, except they said the things right to my face. And no one ever apologized. I still think about it sometimes because it really hurt. As someone who has been there, thanks for standing up for Sammy. It takes a lot of character to stand up to your family and I've met many adults who aren't capable of it. Your reaction shows a great strength of character and a great love for your SO. I think the future of your relationship looks very bright. Congratulations on your engagement!\n\nAs for your sister, pride can be a very destructive emotion and is likely what's keeping her from apologizing. I hope she can learn to put it behind her so she doesn't lose her family. Learning to apologize isn't easy for everyone but it's central to having healthy adult relationships. I'm sure it's really painful for you to see her act this way. Please give us another update and let us know if she eventually comes around. I think she will. ",
            "This is adorable and sweet all in one! :) It sucks about the bitchy sister but... Fuck it. She'll stew in her own bile until she gets burnt out.\n\nI'm glad you and Sammy are together now. I remember reading your first post and wanting an update so bad.... I'm glad it turned out to be alright, in the end! Hopefully the coming months go well, that 2016 is a good mistress to you and Sammy! :)\n\nAlways welcome to Reddit, my friend. Have a Merry Christmas! ",
            "You've warmed my cold grinch heart.",
            "It says a lot about your personalities that you and Sammy have friends and family who want to be with and help you and your sister will be spending it alone. Good job on supporting your partner. I hope sis wises up.",
            "Congratulations on your engagement and not letting your family get away with bullshit. You and Sammy sound awesome.\n\nArmchair psychology: it looks like your siblings are between relationships? Sounds like Sammy is \"annoying\" because she exists and you guys have a separate life from them.  ",
            "Congratulations to you and Sammy...and for sticking up to your family the way you have for her (and your) sake. You're a good man, OP!",
            "Such a happy update! You sound like a very supportive partner. You two are lucky to have one another. ",
            "You sir are awesome. And congrats on your engagement!!!",
            "I had an ex who let his family bully me, it's definitely part of why I made him my ex. You handled this perfectly! You stood up for her and did not back down, this made me smile. You sound like you're a great couple, and congratulations to you both.",
            ">My dad started out by offering Sammy a genuine apology. He told her he was extremely embarrassed and genuinely wanted to make things up to her.\n\nProps to your dad. Apologies - genuine ones - tend to be uncomfortable, and since you know him better than we do, I assume you're a good judge of how he felt. It was probably hard for him to do what he did. It's a shame that the comments had to happen, but it's a good step toward making things right again.\n\nMoms are funny, and I think my mom would react like yours. She's probably deep down ashamed at taking part in the comments, but also wants to keep the family together, even if it means not confronting your sister. My mom does this with my brother all the time - he does something terrible, or says something out of line, and she requests we all tiptoe around him until things are right again. \n\nCongrats on the engagement. You sound like the two of you will be an awesome team!",
            "Glad everything has gotten better since the OP, but I'd like to focus on this jeweler texting pictures of diamonds to someone about to propose. Talk about danger zone. It's almost like there is a chance it'd spoil the impending proposal, exactly like it happened. How about discrete emails or an invite to swing by the shop to inspect it. Sheesh",
            "Here's the question I got downvoted for asking the last time you posted this, as long as they treat her with respect when she's around, why do they HAVE to like her?",
            "Good stuff.\n\n>  Sammy has told my parents she would rather not create a bigger rift and we'll come over at another time. Sammy told me, privately, that while she has forgiven my family, she's not all the comfortable hanging out with my family just yet. I'm perfectly okay with this, I feel like taking some time from my family will be a good thing.\n\nThis honestly seems like the wisest thing to do. A little time and no further conflict with your sister will help.",
            "Great update!\n\nAfter going back and reading your original post I feel badly about your father.   He doesn't deserve a ribbon or anything, but he tried defending your girlfriend and gave the most sincere apology.  Don't forget to wish him a merry Christmas and let him know you love him. ",
            "So many times here people fail to realize that their partner should be the most significant and important person in their lives, or they pay it lip service but don't actually follow through when the chips are down. Reading what you wrote, I'm glad you and Sammy found each other. Have a great time at your friend's place.\n\nOn a side note, be aware that any apology coming from your sister at this point after the holidays may be because she misses the free babysitter. Even if she does pay lip service to the apology, I'd probably recommend putting a stop to the baby sitting service until Sammy actually feels comfortable hanging out around your sister again.",
            "This is wonderful! Both you and your fiancee are really fortunate to have found one another and be able to find a solution around a problem. Can't say the same about many other couples, including myself, basically my boyfriend walked out of a perfect relationship at the first sign of trouble. Yeah it's heartbreaking but it made me appreciate the relations and people who are willing to fight for the relationship. Because of this I do feel the need to remind or just point it out to people who have such wonderful partners how fortunate and blessed they are. I wish you two all the best man! And hopefully the last sister comes to her senses soon! :)\n",
            "Congratulations on your engagement. You're doing so well with handling your family and being on Sammy's team; many OPs who post here with spousal problems could take a lesson from your actions. I hope you both have a great holiday.",
            "I'm jealous of Sammy for having such a great man like you by her side. Congrats to you both. ",
            "Happy update, thank you and congratulations!",
            "Just wanted to echo what everyone else said, you're an awesome fiance, and I definitely think that you should hold your sister accountable.  \nAlso, I am not sure if anyone has said this yet (yeah, I'm one of *those* commenters ...)  but I know in the long run, this will make you stronger as a couple. My husband and I have been stabbed in the back my a few people in both of our families. It hurts like Hell, and is a huge slap in the face. We've since learned that we (along with a few close friends) are the only ones we can depend on, and that's ok with us. Our communication was pretty damn good to begin with, and now it's off the charts. We're more open and honest, and constantly making sure the other is at ease. We know how to take care of our shit, and I think it'll be easier in the long run. Yeah, it sucks, but what can you do?  \nCongratulations to you and Sammy both, and enjoy your Christmas with your friends! ",
            "Maybe you should go to Christmas wig your parents, but with the insistence that your sister cannot attend. She was rude and is ignoring the consequences, so the consequences should be made more severe so she can't ignore them. Your parents need to take your side on this.  ",
            "I just want to say, you are a freaking AMAZING partner! Merry Christmas and Happy New Year to you and Sammy. I so internet Love you guys right now...\n\nAs a gift, you should show Sammy this thread. It only shows what an amazing bf and partner and how lucky she is to have someone like you. Sammy Rocks, You Rock! Congratulations and Best of luck in the future!!!!! ",
            "You should have a conversation with your sister, or if you can't do it in person then do it in a letter or online messaging.\n\nRemind her of the things your fiance has done for her.  Find out why she is being stubborn about apologising.  Tell her you can totally understand it being difficult if she is just too embarrassed to do it but remind her that if it is that embarassing to her that it is worse for Sammy that she won't apologise.  In the conversation tell her, or remind her, that you've proposed (or intend to propose) to Sammy and that she WILL be part of the family and you'd really like the rift to be closed.   \n\nYou can think about asking her to apologize for your sake as asking this in this way has good and bad points with the bad being chances for an even less sincere apology.\n\nI'll say one thing that isn't any of my business, but I'll say it just because you mentioned it in your post.  I'm not crazy about destination weddings and don't think most people should do them.   I feel it puts a real hardship on friends and family who either don't have the funds for the travel or the ability to take enough time off of work for the travel or both.  Of course this depends a lot on the details of the destination, who you intend to invite and the financial position of those being invited.",
            "I wish your girlfriend was right here so I can tell her to just love you and the rest doesn't matter. As long as you both form a strong bond then no one should be able to break it with their actions, or their opinions.\n\nHaving said that, I am old enough to have found out that sometimes that saying 'blood is thicker than water'...sometimes is not far from the truth. \n\nSometimes, no matter how 'nice' you are, how loving you are people are not going to bring you into their 'true' fold because you are not blood. So, what I'm saying-it's nothing on her-it's THEIR problem.\n\nWhat is sad is what you said about her family and how she never really had one--it's not unusual to seek it out in other people but I hope that instead she digs in deep into her own heart for that love she never got..and you will help too. It sounds like you support her and value her many great qualities...the ones that are deep and not shallow. The ones that count. \n\n<3 ",
            "I can understand the slight annoyance of overly happy people, but never to the point where I would even publicly talk about it, your family took that 10 steps too far ",
            "Stupid ninjas cutting onions somewhere... \n\nCongrats! ",
            "My mother was treated similarly by my stepfather's family. He did nothing about it and allowed his family to cause a huge rift in their relationship and subsequent marriage. Now their marriage is in the toilet and a huge contributing factor to that is exactly this. \n\nI wish I could print this post out and hand it to him so he could see how he should have handled it. You are such a great person. Congratulations! It sounds like you both found someone amazing.",
            "Beautiful!\n\n\n>she feels confident that I have her back and that she finally has me as her true family\n\n\nThis is all that matters. You are both a keeper and deserve each other, I wish you all the best!",
            "I want to tell you that you are an incredible person and an incredible partner. I could say a lot more but I don't want to make it weird. Thanks for existing and for being amazing. ",
            "She's lucky to have you. A real man. Kudos!",
            "Great job sticking up for your partner.  Nice that most of your family came around.",
            "OP you handled this so well, good luck.",
            "aw, this is excellent! ",
            "You couldn't have handled it any better, no wonder she said yes! Congrats and enjoy your engagement and wedding!",
            "Congrats on your engagement, OP!  You and Sammy are both class acts and are fortunate to have found each other. :)\n\nYour family...not so classy. (Especially your one sister!) Perhaps your good example will eventually inspire them to be better people.\n",
            "You guy seem really solid. So happy for you both!",
            "\nWishing you and Sammy a lingvand happy marriage! You are off to a wonderful start. ",
            "Agreed. good on you OP. I wish you the best of luck. Seems like you have found a wonderful woman and you are a great friend, family member, and companion. I wish you the best of luck!",
            "Congratulations! Best of luck planning the wedding. I am still very bothered by this whole situation. Your family still sounds awful and are only remorseful they got caught. Their feelings about Sammy haven't changed. You have to continue to be there for Sammy and defend her or this could end badly. What if you have children who are overweight? Will your family bully them as well?  ",
            "You are amazing. I wish I could handle family conflicts with a tenth of your grace and confidence.",
            "Good for you and fiance! Hopefully now that's she's accepted your proposal to be a part of your family she'll be able to move past the ugliness, and start to integrate. Your sister is an asshole, btw. I wouldn't be doing her any favors until she comes around.",
            "You're doing the right thing ",
            "Good fucking job.  YOUARETHEMAN.  ",
            "Sounds nice man. Just make sure to remind both Sammy and yourself that any damages aren't on the two of you: Sammy was never causing rift in your family - that was your family's doing; and you shouldn't feel guilty about your sister possibly being alone on Christmas.\n\nRemember that you don't have to take shit from anyone, even your family.",
            "You did all the right things. Well done.  Congratulations to you both!",
            "Congrats on Sammy saying YES! That's what Matters... you found the woman you love...",
            "You are a real sweetheart. You and Sammy are very lucky to have each other. CONGRATS on your engagement! And with that, this internet stranger is wishing you both a very Merry Christmas :)",
            "Way to go, who put these onions here?",
            "I think that they did the right thing in apologizing, but I doubt their opinions changed. ",
            "Everything you're saying in this update makes Sammy sounds even more special.  Congrats on your engagement!",
            "I don't have anything helpful to say but I read your original post and you and Sammy fucking rock. You should get a PO box or something for when y'all get married - I would love to send you a card. Y'all just - A+ execution of being people. Well done. ",
            "Yay congrats!!! I'm sorry your sis hasn't come around. She will in time. I am so happy for you and your sweet fiancée! You should enjoy every moment with her cause she sounds just lovely! ",
            "This is the greatest update!! (With the exception of your sister being hard-headed of course) \n\nI am so happy to have read this, I got steam-rollered by a terrible head cold a few days ago so my Christmas week has been kinda poopy so far. I am definitely cheered up by your post. \n\nCongratulations to you and Sammy! 😊",
            "I read this while back while lurking and hoped there would be an update on it, I'm glad to read a happy update! Congrats to the both of you!",
            "Congrats on the engagement OP! I could never have handled my family that well, your maturity is pretty inspiring. And your fiancé sounds awesome! Hope you two have a wonderful wedding and many happy years to come - happiness, success, and love!",
            "I don't think either of you could have handled that awful situation better. Congrats to both of you! Sounds like you guys are a perfect match. ",
            "Good on you for standing by your woman, not many men do that now. \n\nWhat your family did was wrong, but at least they have apologised. It will take a while for Sammy to feel\ncomfortable, but in time, you will be able to get back to being able to hang out as a family. \n\nI had a similar situation myself, and it does take a while to get back to normal, just carry on being the awesome couple you are! \n\nCongratulations on your engagement and a very Merry Christmas! ",
            "Congratulations to both of you!",
            "I'm very happy to hear this isn't the end for you two. It's sad that you feel like your siblings weren't genuinely apologetic. \n\nWith that said, I hope you guys can repair this. Sounds like you and Sammy are perfect for each other. ",
            "Good job for sticking with your woman. Frankly if that was me I'd punch my brother square in the face lol",
            "I understand why she said yes. You already got the whole decency and loyalty thing down. You two are great with communicating and you stand up for your boundaries. Long, happy marriage ahead. Happy christmas!",
            "I really loved the part about your mom and sammy making up, so to speak. Sounds like they will have a really great MIL/DIL relationship in the future. Here's to a long, happy life together!",
            "If you live in seattle I got a cool custom ring there for my wife if you are interested...",
            "You've learned a valuable lesson to carry over into your married life and that is to stand up for your wife against your family.",
            "Thank you for your post, you are very mature!",
            "You are amazing OP. She is a very lucky woman to have someone who would defend her and do anything to ensure that she feels happy and comfortable.  you are also a lucky man yourself because to have someone like her to be understanding and forgiving after something like that is truly rare. Some people would be too hurt and stubborn to accept an apology. Bravo to the both of you and I hope you guys have a beautiful life together!!! ",
            "Great update. The only thing I'd suggest is to stop referring to your sister's behavior as \"assholishness\" and instead use \"assholery\".\n\nIt has a ring to it.",
            "This sounds like things progressed in a positive direction! I'm happy for you. Seems like you stood your ground in a way that was appropriate for your family and Sammy. I'm glad that most of your family apologized. Hope your Christmas goes well, keep us updated on your other sister/the holidays! Congrats on the ring!!!!",
            "I'm so happy for you two! You stood up for each other and were a complete team. I'm so excited for you guys, I hope you guys have a great Christmas and the test of your family owns up to what they've done properly.",
            "What a great update, you two sound like a very solid couple and congratulations on the engagement! Hopefully things will smooth out with your other sister but it's cool of Sammy to be so forgiving and try to keep things civil with your family after what they said.",
            "Well... there I go crying like a blubbering idiot.  Good for you man. You did Reddit proud.",
            "Holy crap thanks for making me bawl my eyes out. Go teamsammy!",
            "This brought me to tears, man. I am so happy for you. ",
            "These aren't tears, I'm simply lubricating my eyes. Congrats man!",
            "Sincere very best of wishes for you two!  Just be aware that when you announce your plans for a destination wedding things might get stirred up again.",
            "Oh man, a great read. You handled everything amazingly, and Sammy sounds very loving and humble. Congratulations on the engagement- tbh though the whole situation was sucky, it showed you Sammy's true side; and that side seems just ask lovely as you expected. Some people may have taken it as a chance to stir up more drama but its obvious her values are about family and respect. Good choice, OP.",
            "I can really empathize with Sammy. I don't have much family either and I always felt like I missed out on having those relationships in my life. I really love being in my husbands huge family and I would be absolutely crushed if I heard them talking bad about me. Sammy is handling this far better than I would. And you're being an amazing partner to her through all of this. I hope your other sister comes around, she sounds like a real brat. Congratulations on the engagement!",
            "Good for you! A similar thing happened when my mother and father were dating. She was on vacation with his whole family and over heard them trashing her one evening. I base the success of my parents relationship on the fact that my father confronted his family immediately, showing them he was serious about my mom and that she was his new priority. Your instincts are spot on and you've already set exactly the right precedent. My aunts and mother have had a rocky start, but for what it's worth, everyone eventually worked things out and we now enjoy holidays together as a family. ",
            "Awww, congratulations, Sammy is very gracious, and you handled the situation like a boss! ",
            "You guys are lucky to have each other. Good luck to you both. It sounds like the start of many more happy years for you two! ",
            "Congratulations! Good update. I must say, you sound like a real stand up guy, and your future wife is a lucky girl. I hope your sister comes around, and everything works out nicely.",
            "You're a hero.  Merry Christmas!",
            "You seem like a really great guy, OP. You handled this whole situation very well. Best of luck to you two in the future!",
            "Damn it's dusty in here.\n\n\nCongratulations! It sounds like you have an amazing fiancee and have done an absolutely awesome job in standing up for her.",
            "Well, this was a really satisfying update.\n\nFrom the previous post:  \n>And yes, she is fat. But, I prefer thick girls, always have.\n\nHell yeah, man.  The girls are rarely happy about it, but I love every curve.",
            "I'm glad it all worked out, but a jeweller texting a picture of a stone for a ring to you was pretty tactless...",
            "Good job dude.  But cover your tracks better with that ring text.\n\nBut I suppose its a good thing that you can't keep secrets from your future wife.",
            "[removed]"
        ]
    },
    {
        "post_id": "kjm5pf",
        "author": "antsinmycardiac",
        "title": "I've [f/29] started dating someone far more attractive [m/31], help?",
        "url": "https://www.reddit.com/r/relationships/comments/kjm5pf/ive_f29_started_dating_someone_far_more/",
        "score": 2722,
        "num_comments": 179,
        "created_utc": 1608841476.0,
        "selftext": "We've been dating for 3 weeks. Too early to know exactly where it's going, but so far he's been openly enthusiastic. I haven't felt this nervous in years! Obviously I know he's not perfect and I'm keeping an eye on that side of things too, as it's easy to get swept away.\n\nHe's very attractive, well spoken, well-read, open about his interest but not over doing it. Fantastic kisser. We're in the same industry and have similar life plans. Lots in common as far as interests. Hell, even similar ugly-duckling stories. He's been super respectful anytime I mention a boundary of sorts. I have a few as my last long-term relationship was quite abusive. Luckily my ex has been out of my life for 2 years. FWIW - I haven't mentioned my ex yet, just vague things like \"oh do you mind not surprising me from behind? I'm a bit jumpy.\" This isn't my first time dating since my ex and I have plenty of  (positive!) dating experiences from before him too. I really shouldn't feel so... Almost starstruck.\n\n**I just feel like a teenager again. Half the time I don't know what to say I'm so flustered. How do I get my nervousness under control and just enjoy the moment?** If this doesn't work out I'll be fine - I'm not so worried about my heart so much as trying to act like myself and less struck on dates! \n\nTL;DR: Met an awesome guy. Obviously trying to keep my head, but how to I stop losing my thoughts and wit while we're talking?\n\nEdit: Wow I was not expecting so many responses! Thanks all - it's great hearing stories of folks in similar situations, as well as some tips and tricks I can use to stay appropriately excited. Really appreciate the kindness shown!\n\nEdit 2: I should have phrased it like I'm not used to being so attracted to someone. I'm quite confident in myself and his interest! But that doesn't help me when he does something very goofy and charming and I'm a bit lost in how attractive he is. The limerence is strong haha. All the same the answers have been super lovely and encouraging!",
        "permalink": "/r/relationships/comments/kjm5pf/ive_f29_started_dating_someone_far_more/",
        "comments": [
            "You don't. Stay happy and gitty. Smile and enjoy. He may find it endearing. You'll get comfortable soon enough. In the mean time, have fun.",
            "Stop overthinking. He’s in to you. Be you. If he doesn’t like what that looks like, well it wasn’t going to go anywhere.",
            "Remember how great you thought your ex was in the beginning? Allow that hindsight to dial your feelings and expectations back to something more reasonable.",
            "I am also an Uruk-hai dating a drop dead gorgeous model-material stunner. This is new relationship energy, bask in it! Just remember when your self esteem drops off a cliff that this man is into YOU. that’s HIS problem. he’s allowed to decide to be attracted to you, and you gotta let him! That is all. It’s taken me three years to get to this point and I’ve needed a lot of validation from him but it’s so worth it.",
            "just remember looks always fade, bonds are stronger than that sometimes.",
            "Don't self reject, it'll get better over time the more you feel comfortable with him. He's into you just as much as you're into him. Wishing you the best of luck <3",
            "Be infatuated.  That's OK . That infatuation is how you feel about them at this moment in time , informed by the story you are telling yourself from the information you have right now.\nBut be willing to take new information on,  the things thats don't do go with that story and things that do.  \nLast point is this,  you will be OK If this works  out and if it doesn't.",
            "Instead he f telling yourself you’re nervous tell yourself you are excited. Enjoy it.",
            "Enjoy all the good, giggly nerves that come with the early stages of infatuation, have fun with it! But keep in mind: **never put anyone on a pedestal.** This places unnecessary pressure on you and them. Plus when you place someone above you in this way, they will only fall as time goes on.",
            "Sending you a big hug and also reminding you that you probably have some lingering cognitive distortions from your last relationship about how attractive and valuable you are. He likely feels the same way about you!",
            "If you have an ugly duckling story, you are a swan. You need to focus on the ways in which he’d be lucky to be with you. I’m sure they’re plentiful.",
            "Oh gosh this could literally be me talking about my new situation (dating a guy for 2 months, no commitment yet). I have also had a previous abusive SO, have had some positive dating experiences the last 2 years. Like you I’m nervous a lot of the time/being a bit of a dork to say the least! I literally have only had bubbles of feeling less flustered through spending more quality time together. Example: spent a day walking and chatting in some beautiful scenery and felt actually relaxed all day. \n\nAnyway, as my mum would say, you can only keep being yourself! I hope things go well for you he sounds lovely",
            "I’ve known a lot of women who have literally zero idea how attractive, fun, interesting, etc they are... I mean hell, I was one too as a teenager. \n\nOne of my best friends from high school is truly GORGEOUS though. Face, hair, skin, eyes, all of it, STUNNING. Legs for days, basically the classic model figure. Always had dudes interested in her, but grew up very sheltered so she was a bit stunted. Anyway. I always figured she knew how beautiful she was because like - how could she not? Then one day in our mid twenties, she mentions that she’s been seeing this guy for a little bit, and she’s nervous all the time and feeling insecure because he’s smart, attractive, and he’s a lawyer, and I quote “...I’m, just, uhh, me” and then referred to herself as a bumpkin. I lost my shit. I was like WHAT did you say?! Smart, successful, attractive dude wants to date a beautiful, kind, funny, self sufficient and hardworking woman?? BIG SURPRISE, LADY. \n\nIt really shocked me though, because I think she knows she’s generally pretty, but is very self critical and just also has some self worth issues. She’s always dated men they weren’t quite on her level in some way, and it made more sense to me why after this convo. Once she was finally dating someone that WAS on her level she didn’t feel like she was enough. \n\nAll this to say: this guy probably thinks you’re attractive if he’s dating you, and it sounds like there is also a real connection beyond the attraction here. Don’t try to find reasons why someone shouldn’t like you! Recognize that you’re a catch and enjoy being with someone who is ALSO a catch.",
            "Honestly, he might think this about YOU! Lots of girls don't realize that the guy thinks the girl is out of HIS league. Just try to be more confident, enjoy the relationship and try not to over analyze everything, especially in the beginning when both of you are reserving your true selves from each other.",
            "Just because you think you are less attractive, doesn't mean he does. Personally I've always preferred people who are uniquely beautiful, as in, they are not what is widely considered beautiful. For example Im not generally into women who are blond, have large breasts, wear impeccable make up at all times, etc (there's absolutely nothing wrong with anyone who is, just isn't my cup of tea. I'm much more into women who have that rock climbing body, like to get dirty and have fun outdoors, and go light/no make up most of the time). \n\nHe may also really like your personality. When you really like someones personality, it makes them seem much more physically attractive.\n\nI think you will feel less worried if you can stop thinking of yourself as \"less attractive\". You may not have classic good looks, but that doesn't mean you aren't beautiful.\n\nI'd like to add that I'm happy to hear that you are aware of, and looking out for warning signs and are reminding yourself to not get all swept up in the honeymoon phase.\n\n*Edit* a word",
            "[deleted]",
            "New relationship energy! I was/am in the same boat. Honestly, I don't think my giddiness faded until we lived together but, even still, I'm excited to come home to him after a night out. And he is still SO attractive to me, like \"out of my league, how did I manage this\" attractive 😅 \n\nmy advice is to stay cool and do your best to not spend TOO much time together in the beginning. I'm really independent but I struggle with allowing space during the new relationship energy stage. The best thing I did was allow things to happen organically.",
            "I'm kinda on the flip side of this, although I rate my wife as an attractive woman and - but she's 7 years older than I am and  battles with her weight and I'm fit and in good shape.\n\nI'm physically attracted to her, but the key thing for me I think she's the best person I've ever met.  She's smart, funny, kind and our values align.  It just works.  I had a work colleague meet us separately (my wife was consulting to my employer) and then saw us together a couple of times, and he made the comment that he couldn't figure out how we were a couple seeing us separately, but when he saw us together and how we interacted it suddenly all made sense.\n\nIt's held together for 24 years now and we're as strong as we've ever been.  I guess where I'm going with this is don't second guess his feelings.  Being attracted to someone comes in a lot more forms than just physical attraction.",
            "Be honest with them but don’t put them on a pedestal by overcomplementing them etc",
            "Aww, I didn’t know there can be impostor syndrome in love. You sound so much in love keep on being you and learn as much as you can to know him. You may have suffered in the past but sometimes the gods smile down on us, enjoy it and nurture it.",
            "I’ve actually found that the people that bring out these strong feelings aren’t the right ones for us. if you feel like you’re not good enough and you need to somehow measure up- then it’s not a good sign. \n\nIn my experience it’s the slow burn that’s real. The person you feel calm and comfortable with that you look forward to seeing each time. \n\nIt’s a more relaxed feeling than the heightened limerence that it seems like you’re experiencing.",
            "Be open about how you feel about them, show affection and enjoy the butterflies. Things might end up in one way or another, but at least twenty years from now you’ll be happy that you were able to experience such a profound feeling and did all you could do savour it. Take it from someone who worried way too much all the time and forgot to enioy things as they were :)",
            "Confidence is sexy too! As a man there's a lot more in relationship than just physical appearance. You want someone who you click with on an emotional and personality level!",
            ">how to I stop losing my thoughts and wit while we're talking?\n\nWhat kind of dates are you going on? Dinner dates? It sounds like he is very charismatic and you're probably not the first one to be starstruck by his manner... but after the first date you should be able to get over that, as you learn more about him as a person and as you see him under different lights. \n\nI'd suggest planning a date where you know you can shine, where you know you will be at your most charismatic and confident. Having an activity planned can help, especially if it's something you're good at (and new to him). You'll be focused more on the activity and on how good it makes you feel, instead of freaking out about how perfect he acts. You can also try for more casual settings - go for a walk, meet for early morning coffee, etc. That way you get to see what he's like on a day to day basis.\n\nI'd also recommend writing down your feelings in a diary or journal. Before and/or after each date, do a brain dump of your feelings. Writing before can help make you more confident and less anxious during the date. Writing after can help you reflect on the pros and cons of the relationship.",
            "I was in the same boat. Dude looked like the spitting image of Jason Sudeikis (who I had a big crush on). He was also wildly talented on guitar, better off financially, had the best dog I ever met.\n\n6 years later here we are zoom calling our baby niece and nephews and wrapping presents for our 2 cats and 2 dogs.\n\nYou get over it after awhile. I still have giant self esteem issues but I never make that his issue, ever. And hey, I might not be his level hot, but I am a super awesome human who with kickass hobbies, who does interesting things and has informed opinions. So that goes a long way.",
            "The first person I seriously dated after my divorce, I was a MESS of nerves.  The day after the first time we slept together I almost had a panic attack.  I was in my mid-30's...\"too old\" to be freaking out like that!  I've been with him now for more than four years and we own a house together.   I still think he's hot AF and a great catch, but as we've gotten to know each other, he was vulnerable enough to let me see all of his flaws.  Even though he's objectively attractive, and funny, and smart, he has a lot of insecurities as well.  Looking back on our first couple of months,  knowing who he is, it's laughable to me that I got so flustered.  We're both awesome but not perfect.  \n\nSomething I had to keep telling myself during that time - if he gets turned off or chased away by me being me, he's not for me.  If he's for me, then he'll be wowed by my strengths and forgiving/amused by  my weaknesses.  The sooner I start being myself, the sooner we'll both figure out if he's for me or not.  Turns out this one was!",
            "Listen to the single smart female podcast! It’s been helpful for me. She talks about hyperfocus with men (something I reeeaally struggle with when I decide I like someone). She talks about “mantourage dating” and how it’s important not to settle too quickly with someone and to keep options open in the early phases. It’s the first approach that has helped me reframe dating in a way that is helpful to me. I kind of wish there was a subreddit to discuss this approach with other women who are trying it.",
            "[deleted]",
            "Remember, people don't know what you are thinking,\n\nGet out of your head and into the moment.\n\nFocus on the conversation and what is going on around you.",
            "Remember: he chooses to be with you every day. EVERYONE has some issue with their body/looks, so he is probably thinking the same thing \"I cant believe shes into me\" \n\nStay confident, be yourself, and enjoy life. Those are the best and most sincere ways to be attractive.",
            "It's sad to hear this.....maybe know your worth. Confidence is KiNG and is the MOST attractive trait IMHO. Simply put, a 10 with minimal confidence is a 6 at best, and a 6 who's confident AF is a 9 or 10. \n\nIt's not what you've got....it's how you rock it!\nWords to live by. I tell my girlfriend this whenever she has moments of weakness......and firmly believe every girl.....fuck everybody needs to hear it!",
            "Just be sure you’re learning about him as a person as well. Don’t get too caught up in the idea of him. \n\nI made this mistake when dating my “dream” man",
            "I’ve experienced something very similar. What you think “toning it down” is - do that x10. Unfortunately I’m seeing loads of my saved responses come up on my snapchat memories and I’m just reading things I said like... wow that was really not a “chill” response. I looked up to him a lot and he knew it, and so he ended up abusing that. I’m not saying it’s going to be the same for you but just try and tone your admiration down. Letting him know you’re interested is great but for the love of god, don’t immediately let him know you think the world of him - try and be as chill as possible. Hope it works out for you!",
            "Honestly, there is a decent chance he feels the same way about you",
            "Hahahah I could have written this when I started dating my now fiancé. We were actually talking about this today and he mentioned that he thought I was the one out of his league. And we have been dating for over 2 years now.. so I would say don’t sell yourself short! He is into you. Just roll with it and see where it goes. Good luck! Sounds like it could be the start of something :)",
            "Attraction is subjective. Chances are he's not more attractive than you and you've just found someone your really attracted to physically and on the inside",
            "[removed]",
            "You're getting pretty insecure. You gotta hit that brake on it and just chill out.",
            "It’s been 3 weeks chillax",
            ">I haven't mentioned my ex yet, just vague things like \"oh do you mind not surprising me from behind? I'm a bit jumpy.\"\n\ncan you please please elaborate on this one",
            "FWIW, probably 90% of the time in my experience that a lady says a guy is out of her league, he’s generally not. It’s almost a bit of an inside joke because a couple of these perfect dudes were so goofy it was actually funny. Nice guys, but not the Romeos they were described to be.",
            "He’s a serial killer. Run.",
            "Studies show people almost always end up with people around their own attractiveness level, with the one notable exception being when the less attractive partner is rich. Since it doesn't sound like you're way richer than him, you're probably just wrong about him being way more attractive, he's probably around the same attractiveness level as you. You probably either have self esteem issues where you're seeing yourself as less attractive than you are, or you're seeing him as way more attractive than he is because you're crazy about him right now in the honeymoon phase. Honestly men especially really don't date women way less attractive than themselves, it's highly unlikely he's really far above you in attractiveness.",
            "My boyfriend is way too hot for me too. It's been about 2.5 years but I know it's only a matter of time before he notices... I'm enjoying it while I can. Pandemic sex is amazing.",
            "In this day and age, unfortunately, it is typical for a high-value guy to date down in terms of looks, because the sexual marketplace is awful for 'nice' man. He had some bad rejections in the past, lost (or never gained, really) confidence, never had enough XP with women and is afraid to approach his league. Of course, a genuine interest from a person of an opposite sex blows his mind. Your caution is justified no matter what the other commenters are saying. This situation is definitely more complex than \"he's into you, forget your insecurities and enjoy it\". I'm not saying you should dump him, but watch out for his coming realization that he's valuable (and his value's gonna grow, and yours is already deteriorating). You should try to make him realize that being with you gets him more than being with a handful pretty young chicks... Good luck",
            "Careful. The mask may still be on. Careful.",
            "Everyone’s on there best behaviour at first your still in the honeymoon phase stay grounded because if he does something you don’t like your going to go nuts and accuse him of being your ex not everyone is abusive 😊",
            "Remember this, he's not your ex. Don't treat him like your ex or expect him to respond as would your ex.",
            "[removed]",
            "I think you should take the time and talk to your boyfriend about your ex.  Because you shouldn't just explain what your boundaries are; He should know why you have them.  Finding a way to communicate with your partner about your needs is critical to success with your relationship. The more your partner knows, they more they can work with you to meet your needs.\n\nAs for how to keep your nervousness under control, perhaps try taking your time.  Slow down, and think about what you want to say before you say it.  You'll eventually become more comfortable around the man.\n\nI wish you the best.",
            "You will naturally over time",
            "Most people are their own, harshest critic, and it’s virtually impossible to see yourself objectively, or as others do.  Congrats on the new relationship, enjoy it, but realize no one healthy goes into a relationship thinking, “I’m way out of their league.” He sees you as someone attractive and well-suited to him, so go with that.",
            "just chill and vibe out, enjoy your time together. let things happening organically and naturally",
            "Be open and honest.  talk to him.  If you are not compatible , you should learn now rather than later, but from what you say, It sounds like you are on the same page :)",
            "You need to start loving and appreciating yourself, starting with the title of your post! Clearly this man values his time with you and there is a reason for it :) relax and just be present for yourself and your new partner 😉  be patient with yourself",
            "Just be honest. “I am enjoying our time together so much I find myself feeling a little giddy and shy around you!” No need to over-explain or justify it to him. Also, with the jitters it can be helpful to call it out like that. So hopefully it’s killing two birds with one stone. Grounding you and communicating to him that you are enjoying yourself and feeling a bit flustered by it.",
            "Tell him you’re nervous, and just be yourself! Nerves are completely normal and hey, maybe he feels the same way! You got this 🙂",
            "Dating is not a game of get-the-best-looking-one-you-can. Many of us are in happy relationship that we would not leave if a perfect 10 in looks came along and wanted to date us. \n\nBut okay, being good looking does give you more options, so he has lots of options but he still picked you! Take that as a compliment. Every time you start to feel like \"why is this guy with me?\" insecurity, stop that thought, and force yourself to reframe it as \"Wow, this guy is into ME.\" Say it out loud or out loud in your head to get used to the idea.",
            ":) I was starstruck by how handsome my SO was when I met him. And I'm not ugly or unconfident! But he was just so sexy and honestly, I've never gotten over that and we have been together for ten years. \n\nI got less awkward and weird over time but I just tried to be myself, and it worked out",
            "Have totally experienced something similar! My own advice based on what worked for me: as much as possible try not to not be flustered. Let it show and embrace it-the right person will be complimented and enjoy any aspect of you! Overthinking when that happened always got the best of me there. Let the teenage nervousness ride itself out 🤞🤞 wishing you the best of luck!",
            "Get into a flow state. Before you go on a date go around and talk to a few people it will get the social juices running and ease your mind",
            "Never underestimate the attractiveness of kindness, honesty and humour.  Even if you think he's more attractive, you must also have qualities that attracted him to you in the first place. Just be yourself.",
            "Talk to a professional about your self esteem issues. He clearly sees you for who you are. You might not.",
            "He'll grow bored.of you  and move on",
            "Don't worry. Have fun. And who's to say he's more attractive than you? A lot of people who are attractive to others don't feel that way themselves",
            "If you can’t be secure with yourself while with him then don’t be with him. You can easily become toxic if you have this mindset that someone is out of your league. Just because someone is more “attractive” than you doesn’t make you less worthy to date them.",
            "\\>  How do I get my nervousness under control and just enjoy the moment? \n\nJust relax.  If you can't then time is on your side and you'll get used to things and start chilling after a bit.",
            "First of all, you're adorable.\n\nSecondly, how do you know he doesn't feel the same way about you? Heck, if you weren't pretty to him, he wouldn't be with you!\n\nYou deserve to feel beautiful, so you shouldn't forget you are.\n\nGood luck OP!",
            "Dude,  I was in the exact same situation when u was exactly your age.  I stuck with it now we've been married 5 years! It's weird at first because he seemed so perfect,  turns out he thought the same! Go with it,  you sound like you're in love",
            "Be a good person to him, respectful, if you are truly interested in him, look beyond his looks, be interested in him, don't get nancy drew on him, let some shit slide... don't try to fix his world, he is most probably a bit scared (even though he seems not) and right now he is performing for you... listen to his story and his point of view, be playful, respectful and caring.\n\nThis is you giving the correct signals to him.\n\nBeing said that, if you want to know how he is with you in this relationship.\nThe talk and conversation is meaningless... Is only important in the sense that he is communication what he things is important for you to hear, or in more manipulative persons, what he thinks will get him from you what he wants. But right now he is performing to you and dazzling you with his looks and history (he know that he got them and he is using them everyone does), enjoy it, but don't fall for it. He got lines, things he says, theories that he needs to tell you so you see him in his best light... Let him, but...\n\nThe most important thing to know how he is (and his relation to you) pay attention to **WHAT HE DOES,** \n\nIf he is on time, if he pays attention to you, if he is careful and caring with you, if he does what he says he'll do, how he treats the ones around you and others than you, staff in a local, his family, other friends, your family... Don't try to make it a story, do it like a log and try to analyse it in cold after... \n\n\nHe entered, opened the door, waited i was seated, asked me what i prefered, listened to me, didn't interrupted (Friendly Banter even), was cordial and loving but respected my boundaries, wasn't pushy, wasn't needy, was friendly and reasonable with the person serving us, keep attention on what i asked for, asked if i was ok, listened and acted on what i answered, asked about what i said in other conversations earlier, do i have to repeat myself with him? is he sorry if i repeat myself and he sees that he did knew something but wasn't paying attention?... \n\nA Man, if has the \"high ground\" (from looks, status, power or relationship dynamics) or has the \"gift of word\" will/can twist a women into believing anything in a relationship, but can't hide his actions. Those are transparent.",
            "Hot people need love too.",
            "Cognitive behavioral therapy",
            "Sounds like an absolute catch! My advice is just to enjoy the feelings he gives you. I’m sure you’ll get more relaxed eventually. :)",
            "This is just the sweetest thing. I don’t have anything to add that other commenters haven’t already said .. be yourself and enjoy. you seem wonderful and I’m rooting for you!",
            "Have you considered the possibility that you have miscalculated the attractiveness differential? Because it seems possible to me that you might just be adorable. Maybe your nervous awkwardness is disarming and endearing. Maybe the challenges of your past have left you with wisdom and insight. Maybe you're just...really fun. Don't underestimate how powerfully attractive these intangibles can be. He likes you! Let's just assume it's because you're a catch, whether it works out with this particular dude in the long run or not.",
            "noble kava or maybe a weaker supplement of ashwaganda can act as a mild to moderate mood health aid. Noble kava is mostly internet-order but ashwaganda is at Walmart. It's similar to St. John's Wort but safer long-term and has other health benefits. It takes the excitability of anxiety and mutes them down into manageable chunks rather than overwhelming waves. Doesn't mute the good times, just the annoying flare ups of nagging negatives. Kava is more similar to St. John's Wort in short-term use but is much stronger.   \n\n\nBest of luck in your love life.",
            "Live in the present. Stop over thinking, that makes you absent. \n\nIf you like him - like him, you have to show him your authentic self. Let him be 'into you' now. If he 'chose to be with you', then, do the same tomorrow. And the next day. And for as long as you think it's worth it.\nGood luck!",
            "Don’t worry about being nervous all the time, it may actually be a good thing! My SO told me recently that he could tell I was nervous on our first few dates (I thought I had hid it well 😅) but it was actually attractive to him :) It made him realize that I was really interested in him, especially because he thought I wasn’t at first. That giddiness and nervous excitement are actually really charming to people who like you, believe it or not! Just keep being yourself and it’ll go away in time 😊",
            "Fucking hell. I've been feeling like a teenager too. Just enjoy it, don't stress, go with the flow and see what life has in store. Merry Christmas",
            "That part of \"does he like me\" has passed, girl he's there with you.",
            "A little presumptuous to decide for him if you are the right level of hotness to date him.\nJust trying to put a spin on it to make you realize it’s only your anxiety speaking, not how things actually are. I know I need to be a little mean to my anxiety to shut it up.\n\nEnjoy",
            "My opinion is, allow yourself to enjoy that giddy happy energy! If you spend time together you'll gradually become more comfortable and less nervous. All relationships go through different phases, and in my experience giddy nervousness --> feeling completely at ease is a common progression. At this point it's quite possible he's feeling the same nervous energy you are - regardless of attractiveness (which is arbitrary anyway), he's clearly into you! Embrace the awkwardness!\n\nIn regard to attactiveness, if he saw it as a problem he wouldn't be pursuing the relationship. If it's not a problem for him, then try not to *make* it into a problem due to your own insecurity. He has the right to decide who to date, and he's chosen you - do both of you a favor and accept his decision. \n\nAlso, it seems to me like you're a bit overly defensive and afraid to let your guard down due to your last relationship. That's totally understandable! But try not to let the paranoia go so far that you can't enjoy this relationship. If red flags start coming up, don't ignore them of course! But if things are going smoothly then you can let loose and freely enjoy every happy moment.",
            "Just make him feel loved. Do not overthink it.\n\nLooks and appereances are not everything... my ex was perhaps 5/10, but I was not interested, never even really looked at, even in 10/10.\n\nWhy? She made me laugh, feel loved, feel safe.\n\n(and the reason we broke up was for not related to this, I just did not want to have kids)",
            "Hello antsinmycardiac\n\nTo be yourself on a date with this incredible man, relax and enjoy the evening.\n\nIt is very possible that the same thing will happen to him but you still don't have enough confidence to declare it.\n\nMay the peace and mercy of GOD be with you and your family.",
            "3 weeks and you can say if he is a good kisser or not? Im dating this girl for 2 months now, still havent kisser her. Anyway hope everything goes well, good luck",
            "Don't put him on a pedastal",
            "“Hell, even same Ugly Duckling stories!” Not being obtuse but, I thought I knew what an ugly duckling story was. What does it mean if he’s super attractive and you imagine that you are not? I’m kinda confused here...\nBest of luck, by the way:-)!",
            "We all fight above our class sometimes. Enjoy the win.",
            "This is what falling in love feels like. He probably feels the same. Talk to him about it ;)",
            "This is so cute... Obviously don't fall down the rabbit hole and overlook flags to make him out as perfect, but also just try to remember that it is allowed to go well, you're allowed to be completely happy with where you're at right now. I hope all works out for you though!",
            "> Hell, even similar ugly-duckling stories.\n\n> my last long-term relationship was quite abusive\n\nThese things make me wonder if the new guy is really more attractive than you, or if you just have a hard time seeing yourself that way. Either way, it sounds like you've met a good person, and things should work out. Try not to overthink things too much, and good luck!",
            "You've got a bunch of good answers already, but I will say I had almost the exact same situation as you (prior ex from abusive relationship, shared trauma, leftover ptsd) and met my current fiance, who at the time to me was \"far more attractive\". You kind of start out starstruck before you realize you actually are dating someone who is your equal for the first time and it feels right. I would not worry too much about it, I was kind of socially inept at first just because I couldn't take it (literally just like you) but then got over it as we got used to each other, it took a few months.",
            "I think this advice is redundant because you seem like a mindful and nice person, but I would mirror his sensitivity to requests, just to show that you care really, he sounds like a good person too, good luck!",
            "I’d suggest doing some exercises to help improve your self esteem. Like setting small goals and writing down if it is achievable, timely, reasonable , what you have to do to complete it and dates. Stuff as simple as making the bed.  Also you could work on self-improvement. I suggest this because when you were describing his attractiveness everything you named were character traits. So maybe it’s a clue for you to work on improving yourself so you shine and feel like you are more on his level and he won’t feel out of your league.",
            "Lol your relationship will be over in a week",
            "Just get married already.",
            "Girl you’re in love lmao. This is so funny and cute. I hope you guys have a long life together.",
            "This was me with my current boyfriend! I'm usually pretty confident, but he knocked my socks off! I was genuinely wondering why he was interested, especially as I was very unenthusiastic about our first date and turned up looking like absolute crap, only to find out he was wonderful and turn into a gibbering idiot. I even wondered whether he could be secretly gay and using me as a beard 😂 (he's from a country where homosexuality is illegal and punishable by death). I know now how stupid that sounds and I'm pretty sure my relationships before him knocked my confidence more than I realised at the time.\n\nAnyway, we're heading towards our third anniversary, living together, and I'm still deliriously happy. I've discovered that he's actually NOT perfect and sometimes gets right on my tits, but I prefer it this way - he's no longer on a pedestal and even after seeing his less enjoyable traits, I still adore him.\n\nEnjoy the giddiness. It's a lovely feeling and I still get it now."
        ]
    }
]