[
    {
        "post_id": "54vs4v",
        "author": "embarrassedtosend",
        "title": "UPDATE Me [30F] with my BF [30M] duration, I want to send him sexy pictures as a surprise but I don't know if I should.",
        "url": "https://www.reddit.com/r/relationships/comments/54vs4v/update_me_30f_with_my_bf_30m_duration_i_want_to/",
        "score": 2722,
        "num_comments": 119,
        "created_utc": 1475060524.0,
        "selftext": "Previous: https://www.reddit.com/r/relationships/comments/53plis/me_30f_with_my_bf_30m_duration_i_want_to_send_him/\n\n\nI just want to thank everyone who commented on my previous post. This issue is such a non-issue that I can't believe how seriously you all took me. All the tips, caution, the encouragement just reminded me how wonderful everyone here can be.\n\n\nThanks to you guys and the post I made, I was reminded of all the wonderful qualities and reasons I fell in love with my boyfriend and I decided to send him some pictures. It took awhile to find one I felt comfortable with, but I did find one! I know some people think I shouldn't, but I did include my face in it because I feel like it helped show how much I trust Ben and how much I love him.\n\n\nI waited until the late evening when he told me how he was getting ready for head off to bed when I messaged him with a picture and then sent \"More surprises when you get back ;)\" and I'll admit, I got a little panicky. After a few minutes, Ben sent a message back with \"Oooh very sexy! <3\" and pretty much that was that (Outside of our usual goodnights and I love yous).\n\n\nI'll admit it, reddit, I didn't know how to take his message back on account of having never sent a photo like this before. Was he being nice? Was this a typical response which was good? Should he have said more? Should I have said more? I didn't know how to feel other than a little disappointed, especially with how long it took me to take the photo. Alongside this, Ben sent me a message the next day telling me about how busy he'll be and then never responded back. I got upset and started feeling like I made a mistake. I spent my day off work with a mix of disappointment, regret and panic, a panic that I had made a huge mistake.\n\n\nWell, that afternoon I got a knock at my door and who was there? Ben. That's who was at my door. Ben and a bunch of flowers. I wasn't expecting him for a few more days and before I could say anything he told me about how he pulled a favor with his boss (whom he's friendly with) and because the team had pretty much finished up their project he got the go ahead to head home early. Ben told me that he saw the picture and was speechless for a few minutes because he had never expected anything like that from me but knew he had to get home right away to see me. And then he said he felt like the luckiest man in the world.\n\n\nWe've spent every day together since and we've had a fabulous time and I've never felt better about my relationship and about myself. Ben has already asked if he'll get another picture anytime soon. I told him \"Only if you're good\" :)\n\n\ntl;dr: Sent picture, discovered I now need to get a full wardrobe of sexy lingerie. I feel great!",
        "permalink": "/r/relationships/comments/54vs4v/update_me_30f_with_my_bf_30m_duration_i_want_to/",
        "comments": [
            "I'm glad it worked out!\n\nAlso, don't overthink responses like that (\"Oooh very sexy! <3\"). When my lady sends me a sexy pic (which I love) there's only so much appreciation I can fit into a text response without feeling like im forcing it.",
            "D'AWWWWW\n\nAdorable. You two crazy kids have fun, now.",
            "Yay, what a great update!! Sending sexy pictures to your so is a lot of fun and his reaction was sweet. He actually came to see you after and told you how he really felt about them?? That's awesome! Honestly, the very few exes I exchanged pics with would never talk to me in person like that except to say they were \"really hot\" or something but what your bf said made me swoon for you. Best wishes, have fun!!!!",
            "This post makes me feel a little sad about my own situation, but luckily also amazingly hopeful because it reminds me what I could have myself someday. I've sent my boyfriend pictures in the past and, just like you, worried and fretted about what kind of response I'd get. \n\nNothing. Not a single reply. Not until I asked in person next time I saw him about it, and he said \"oh yeah I did get them, forgot to reply\" *kiss*. It honestly sorta devastated me, and I've yet to send him any pictures after that...sexy or not. \n\nNot to hijack your post, just reminding you how lucky you are!! You are amazing, your boyfriend is quality and this whole post is a much needed reminder of the kinds of things people do for each other in healthy relationships. I wish you two all the best, it sounds like you both are lucky to have each other:)",
            "My reaction reading this:  \nYay!...*keeps reading*  \nOh oh.. dont like where this is going... *keeps reading*  \nYAY!!!",
            "That is how it starts...before you know it things will be completely different.  You will be a 47yr old \"web cam model\" trying to kick your drug habit,  begging people daily to \"go private\" to get your next fix. You will regret daily of going down that dark, dark road to take that first sexy pic.\n\n\nJ/k congrats on a milestone you overcame.  Hope you continue on with your new found confidence,   because YOU are worth it!  Wtg! And thx for the update.",
            "Here's the thing, lady; it sucks that you have such a negative view of yourself, and my heart goes out to you. And sadly, it's so common, because women (and men, but women especially) are bombarded every day with messages on what beauty is and how they're supposed to look and what most men find attractive... And that's obviously BS. But it hurts women's self esteem just the same.\n\nBut your BF is with you because he loves you and thinks you're beautiful. When he got those pictures, he probably went insane, got a boner, and spilled his items. And when he said it was sexy, you can tell he meant it, because he went out of his way to get the hell home so he could DOOOO YOOOOOU!!! And also hang out with you because you're his best friend.\n\nMy wife is so self conscious. She really hates her body some days, and that she's bigger/curvier than how she's \"supposed\" to look. But her body type is my ideal body type, and when she's dressed cute, it makes my brain shut off, it's so awesome. \n\nSo, please believe that you are beautiful, and you are desired and loved. And if you can, change your self talk from mostly negative to mostly positive. :)",
            "That's an awesome update. Thank you for sharing\n your happiness",
            "I LOVE THIS UPDATE SO MUCH ",
            "He couldn't write a longer response on account of having to go um...brush his penis.",
            "why am I suddenly cutting onions?\nThis is genuinely heartwarming, thank you for sharing it",
            "oh my gosh this is SO cute!!",
            "What a heartwarming update!",
            "Damn that's beautiful. He's a keeper.",
            "I am so happy for the both of you! He's an amazing guy for respecting your wishes so far and you are amazing for taking a step forward. I really hope the best for your futures! And remember, you're beautiful inside and out :-)",
            "Awesome.  Consider getting a profession boudoir photography session.  The pros are great at shooting with flattering lighting and framing.  And you get to control what is seen and not.",
            "Had me going for a minute with the short response from him initially. I love this update. And good for you on sending the pic!",
            "he probably was fairly... busy.... after he saw you, tbh. \n\nBut good for you!\n\nBe confident, you loving woman. this is a very cute story. <3",
            "Congrats! You've found a keeper, OP!",
            "Ben is a lucky guy, and not just for the sexy pics. You're absolutely adorable, they way you overthink and worry... You love him like crazy and it is pretty obvious that he feels the same. This made me smile. ",
            "This is the absolute BEST. Enjoy yourselves, and enjoy each other! I'm super stoked for y'all. :)",
            "Damn, this is the cutest story I've read on this sub in a loooong time! You go, girl. You have a fantastic boyfriend. :)",
            "Girlfriend did this long ago. Is now wife. Highly recommended procedure.",
            "I needed this after a rough couple of days in this sub. What a sweet update! Good couple good life",
            "Have fun you guys.  Glad it worked out.  Be more communicative in the future. ",
            "This is the most heartwarming relationship thing I've ever read on reddit. You both sound great and good for you for doing that all on your own for him, and good for him for going out of his way to make you feel good about it. ",
            "Now start taking the regular pictures of yourself too! ",
            "You should ask him to send you some sexy pics of his.",
            "This story is so sweet... it made me cry a little. So good for you, you learned to love yourself a little more, as well as show extra love to someone who deserves it. I wish you the best of luck, you sound beautiful inside & out!!!Thank you for sharing your story. :')",
            "I think the part he probably liked the most about the photo, is the fact that you showed him a confident side of yourself. A woman who feels self conscious or self doubt doesn't send a sexy photo. He loves you, and your body, and it probably made him incredibly happy to see you treating yourself with as much love and respect as he does. I'm proud of you :-)",
            "Upvote for cute story ending!",
            "Awwww he's so sweet 😊, and you're great too girl! ",
            "So happy for you !!! This update is great !!! You go girl and don't let your self-confidence ruin this !!! omg so so so happy this is such a great update !",
            "The respect for somone's decisions/ behaviors/ decisions is the most valuable form to show your love. Ben has always been a rly great boyfriend and that's why it should feel so satisfyng to be so open with him.",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "6gthpy",
        "author": "None",
        "title": "Update: I [30F] found my friend's [30F] fiance's [30M] Tinder profile. They have been dating for 2-3 years and are are getting married in 30 days.",
        "url": "https://www.reddit.com/r/relationships/comments/6gthpy/update_i_30f_found_my_friends_30f_fiances_30m/",
        "score": 2720,
        "num_comments": 118,
        "created_utc": 1497286612.0,
        "selftext": "[Original post](https://www.reddit.com/r/relationships/comments/6fwlif/i_30f_found_my_friends_30f_fiances_30m_tinder/?utm_content=comments&utm_medium=user&utm_source=reddit&utm_name=frontpage)\n\nAfter hanging out with Annie for four hours this weekend, I mustered up the courage to tell her about Finnick's Tinder profile. I told her that I didn't want her to think I was implying anything, but that if it were me, I would want to know, and I thought she would want to know, too.\n\nShe already knew. Not because they're in an open relationship, but because he had been having a three month texting \"affair\" with a girl last year. After that girl found out about Annie, she wrote Finnick a letter about how brokenhearted she was, then Finnick 'fessed up to Annie.\n\nAnnie said she doesn't really considering it cheating, and that's fine, because it's her relationship and so she and Finnick get to determine the dealbreakers.\n\nI think she was a little concerned, though, because apparently he told her that he had deactivated/deleted his account, and that clearly didn't happen. She texted him when we were together and told him that someone else had found his profile. He apologized and swore that he didn't have the app downloaded but that he would go ahead and make sure his account is deactivated.\n\nI don't know how many people were really looking for an update, but I did get helpful advice on my last post and I really appreciated everyone's input.\n\n  ---   \n  **tl;dr**: I am not a fan of Finnick. Wedding is still on.\n\n(minor edit: phrasing)",
        "permalink": "/r/relationships/comments/6gthpy/update_i_30f_found_my_friends_30f_fiances_30m/",
        "comments": [
            "Annie is aces for not saying who told. The messenger always gets killed in these situations.",
            "Well, you did the right thing, in my opinion.\n\nGoing forward, I'd stay totally hands-off of anything regarding that portion of their relationship.   Like you said, Annie's allowed to draw her own boundaries; while I think few people here would agree with her, it's her mistake to make.\n\nBut you were a good friend by telling her.",
            "You did your part. It's on her now. You're a good friend.",
            "You did your duty as a friend, and I doubt Annie knows the full extent of what her BF is up to (and I also think she is putting her head under the sand). Be prepared to support her in the future if/when she discovers stuff she cannot overcome, right now there isn't much you can do. Don't antagonize her BF as he may put Annie against you and she will miss on much needed support.",
            "[deleted]",
            "His profile wouldn't show up if he wasn't active within a certain amount of time, he's lying. ",
            "You did the right thing. Let her regret it when he does it again. ",
            "[deleted]",
            "You did the right thing. Going forward, you can't save her from herself, so don't bring it up again or try to make her see the light. By the same token, you're well within your rights to refuse if she tries to use you as emotional support and complain about him in the future. ",
            "[removed]",
            "My best friend has been married to a known cheater for 25 years. He cheated on her before and after they married. He even got one of them pregnant after they were married. I just tell her that he is one lucky man. She's probably the best human being that I know. I used to get so frustrated with her, but now I just accept and love her for who she is. And I still can't stand her stupid husband :-/.  ",
            "Are you going to go to the wedding? ",
            "You did the right thing!  This must have been terrible difficult for you.  ",
            "You are a good friend, but the denial creates a reality distortion field that the cheater can use. Poor Annie.",
            "You did the right thing. I have the same kind of problem in that one of my coworkers found me on Tinder even though I genuinely deleted my profile and the app about 2 months ago (and even then I thought it was deleted but my sister's mate found it). Something makes me think that it'll reactivate your account randomly, because I have deleted it multiple times for it to mysteriously return.",
            "Okay on the real, this same thing happened to me. I really wasn't using Tinder though. And I really did have to go in and deactivate that shit. Kind of messed up. ",
            "You did what you had to do, and she did what she wanted to do with it.",
            "I will say, I didn't know you had to actually deactivate your Tinder. I deleted it off my phone and thought that that was it. So you can imagine my shock when a friend found my profile, and posted it to our 30 person group chat, while I was dating a guy for over 7 months at the time. I can't imagine what they thought. I'm not saying this is what happened with your friend's fiancé, but it's what happened with me. ",
            "Just saying: a tinder account is deactivated if it's not used in a certain amount of time. Like if you don't use it in two weeks, maybe a month. ",
            "As her friend, you definitely did the right thing by telling her. What she does with that information is all on her. But ugh, that sucks so hard. Watching a friend be with someone who clearly isn't good for them (or someone who's a lying/cheating douchemobile) is the worst. But yeah girl, good on you. You did what you could!",
            "Legit question, if you uninstall the app from your phone, does that also remove your profile? Or is it still there floating around for people to swipe at?",
            "That marriage is going to blow up in a very small amount of years- it's going to happen. ",
            "Well, Annie is definitely making a very bad decision, but at least you did the right thing!",
            "Hmmmm this got me thinking.  I was actually in the same situation. I saw A's boyfriend's Bumble profile, and it bothered me a little bit. But thing is, me and A aren't too close, so I still haven't told her. As far as I saw on Facrbook, they're about to get married it seems. I don't know, I just don't wanna involve in a possible mess :/ ",
            "You did the right thing. That being said, I fear this will not end well for Annie. But that is her decision to make.",
            "> He apologized and swore that he didn't have the app downloaded\n\nThat's a lie. You can't use Tinder on anything other than the app and the profile automatically hides after 2 weeks of inactivity. That means he's used the app within 2 weeks of discovery.\n\nI don't know how their relationship works, but I can tell you that she is setting herself up for a lifetime of half-truths and uncertainty.",
            "The question will be will Finnick stay reformed after the wedding or will he return to his methods and ways afterward.\n",
            "Annie is an idiot. But that's not your problem.",
            "She's being foolish, but it's on her at this point. I'd just be a good friend if/when he does something that Annie considers breakup worthy.",
            ">  He apologized and swore that he didn't have the app downloaded but that he would go ahead and make sure his account is deactivated.\n\nfyi, this isn't true/how the app works. back maybe 2 years ago the app would show you how recently profiles had been used/active, it would always give priority to profiles active the most recently then work its way back but never past 2 weeks. if a profile hadn't been used in the last 2 weeks it wasn't being show to anyone.",
            "She won't dump him before marriage, so let's hope they get divorced before kids.",
            "So much bs. If you don't log for few days, then you're account won't be findable anymore. You can only browse through recently active users.",
            "Unless this just happened after a little while tinder won't show his profile anymore unless he's logging in every so often.  My guess is he deletes the app for shoe and when he's \"bored\" r downloads it and catches up on matches/messages he's missed\n\nBut y a, it's their relationship..",
            "You know what they say: denial isn't just a river in Africa.",
            "Good on you for saying something. It's up to her now, but you can feel good knowing you did what you could do when it comes to another adult. I hope she realizes what she's getting into before it's too late. ",
            "I guess you can't fix stupid.\nI'll give the marriage 6 months.",
            "My only advice is going forward, just mind your business and completely dissociate yourself from that aspect of their relationship. Don't involve yourself again in anyway, it's on her to deal with this however way she wants. DO NOT INVOLVE YOURSELF AGAIN. ",
            "It's their relationship, if she chooses to ignore the RED flags...it's on her.  This dude is BADDDD news...",
            "You did everything in your power to make her as prepared as possible. If something *does* happen in future, she shouldn't be surprised but at least you tried. If she is willing and able to forgive me, that's - as you said - between them, Hopefully, for her sake, he's being truthful about everything now.\n\nWell done to both of you for not letting this turn into some massive drama!",
            "Annie is gonna regret that wedding in a few years. ",
            "Annie and finnick haha",
            "Well what else can you do.  Annie is in for a hard life though.  This will not end well for her.  ",
            "It's the hard knock life ¯\\\\_(ツ)_/¯ ",
            "You can lead a horse to water, but you can't make it drink!",
            "[removed]",
            "Sad she lacks the conviction to end it. Oh well he will no doubt cheat so she'll have to deal with it again at a later date ",
            "Just for a bit of insight. Me and my GF still have out tinder / bumbles active. I don't converse with matches at all, I just swipe to match and then unmatch. It is a bit of a confidence boost and I know that's not the norm but it works for us.\n\nWith that said, if she was actually messaging people I would be crushed. That's a who other level of engagement.  ",
            "Most wives with cheating husbands suffer in silence or tolerate their husband's infidelity. They feel they have no other alternatives, or don't know what else to do.\n\nYou don't have to sit back and be a helpless victim or be swept along with tide. There are things you can do to make the best of a bad situation and minimize the damage infidelity can cause.\n\nYou can take steps to protect yourself emotionally, sexually, legally and financially. You can work quietly behind the scenes to offset many of the negative consequences that result from infidelity and prepare yourself for what lies ahead.\n\nTake control of the situation. Regardless of whether you ultimately decide to stay with your husband or leave him, the guidelines below will help you gain the upper hand.\n",
            "Well if a profile is inactive for a week, Tinder automatically hides the profile from being \"discovered\", so if you found his profile, that means he definitely has it downloaded and used it in the last week...",
            "Shit, you just reminded me to delete mine. I have one that I made during a low in my present relationship. I didn't do anything with it, but it's still out there 0.o"
        ]
    },
    {
        "post_id": "92hkdh",
        "author": "noproposalthrowaway",
        "title": "Update \"Me [27 F] heartbroken after my [26 M] boyfriend of 6 years backs out of planned proposal\"",
        "url": "https://www.reddit.com/r/relationships/comments/92hkdh/update_me_27_f_heartbroken_after_my_26_m/",
        "score": 2713,
        "num_comments": 291,
        "created_utc": 1532734743.0,
        "selftext": "Link to original post: r/[https://www.reddit.com/r/relationships/comments/8fmhpn/me\\_27\\_f\\_heartbroken\\_after\\_my\\_26\\_m\\_boyfriend\\_of\\_6/](https://www.reddit.com/r/relationships/comments/8fmhpn/me_27_f_heartbroken_after_my_26_m_boyfriend_of_6/)\n\n3 months later and we have decided to end our relationship. We officially broke up a few weeks ago, and he moved his furniture out of our apartment this week.\n\nI received incredibly varied advice from my original post. I took all of it into consideration, and let him read the post as well.\n\nWe tried our very best over the last few months to move past this, but we were not able to. Breaking up seemed like the only option left.\n\nTo all of you that told me that he wanted to be with me, but didn't want to get married, you were right. I didn't want to believe it, but after months of circular conversations, it came back every time. He just didn't want to get married, he didn't feel like he was ready, and he didn't know when he would be.\n\nBasically I wanted to post an update on this thread because I needed to get it off my chest. I always figured that maybe some of you were in similar situations and you were hoping to eventually hear the outcome.\n\nThank you to everyone who had originally commented on my post! You definitely gave me a lot to think about.\n\nTLDR: \\*\\*6 year relationship ends after disagreement on planned marriage/proposal\\*\\*",
        "permalink": "/r/relationships/comments/92hkdh/update_me_27_f_heartbroken_after_my_26_m/",
        "comments": [
            "I know that this will mean nothing to you now but in 3-8 months when the reality of dating again sets in, accompanied by the existential fear of dying alone that everyone (yes, everyone) who was used to a ltr inevitably experiences: you have the most attractive possible background to people looking for a serious partner. You're not inexperienced but you have no problem with committing, you're young but not a baby, you're loyal, and you stand up for yourself and what you want.\n\n\nHeck, that's probably the best  qualities a person can have in many situations, romantic or not.\n\n\nIt's like you took one of the most unpleasant courses in the world but then graduated with special honours. ",
            "The best thing that I did for myself after my divorce was not date anyone. I took myself to the movies, got mani-pedis regularly, spent time with my friends and family, got a cute hair cut, spent time at the gym, and started working towards some long term educational goals that had been delayed because life. \n\nIt was tough, though. It was weird to live alone. It was weird to sleep alone. It was weird for a long, long time. Like a solid year. But then, I started sleeping diagonally across my queen size bed, made some new (not mutual) friends, got into a new hobby, started really making a dent in those educational goals and it was a really good feeling. \n\nI'm not that much older than you \\[30\\], and I'm telling you, you've got this. It's going to be tough, but it's also not the end of the world. Best of luck to you : )",
            "I always appreciate when people post updates, so thank you for sharing. Much love to you ❤️",
            "I'm sorry OP. I had a feeling after reading your original post that this was the case. \n\nMy sister had almost exactly the same experience. She was with a guy forever, they had plans to get married, they set a timeline -- and then he flaked. And then he flaked again. When she asked him wtf, he spun the same story about \"not being ready\" yet. And admitted that he had no idea when he'd be ready.\n\nThey broke up a few months later, and my sister was a decade older than you are, OP. He almost immediately met someone and married her within six months.\n\nI'm glad you're getting out now, still with plenty of years to find the right person.\n",
            "I’m so sorry.  But thank you for sharing.\n\nThe timing of your post is hitting me hard. My boyfriend of 11 years told me in April that he would propose in July. This was not our first discussion. He texted me a little while ago today that he had some errands after work and would be late getting home. One might think that’s a good sign. But I think he was just out buying clothes. I think he’ll have more excuses when I talk to him on Aug 1st. Your post makes me wonder if it’s worth trying to salvage things after that. ",
            "This exact same thing happened to me. I was with my ex for 4 years, engaged for 2 of them. Set the date, bought the dress, sent invites out. Then he backed out. Said he wanted to be with me but didn’t want to get married. We tried to make it work for a few months afterwards but our relationship was broken. Looking back, I am so happy that we didn’t get married. He wasn’t the one I am supposed to be w forever and he saved me from a mistake. Take care of yourself and be gentle with your healing. \n\nEdit: spelling ",
            "If you  get a chance, read “he’s just not that into you”. The book absolutely changed my perspective on relationships in a really great way. Good luck! You’ll be fine 😊",
            "This exact thing happened to me. Happy to discuss it privately if you want to. I’m sure you’re probably spent on this issue but if you decide otherwise, PM me. 5 years together, last 6 months engaged, broke up with me the morning of our engagement party, after entire family flew in to town for it. It’s been several years. Willing to share what little wisdom I gained from it. ",
            "If it makes you feel any better when a relationship gets to this point and marriage has been a question for a long time you might have changed your mind even if he had proposed.  It's not JUST about the marriage but an overall lack of commitment to the relationship. I was in a four year relationship with a guy I thought was the one regardless of how much we fought and struggled and argued.  \n\nWhen my dad died I really got a sense of my own mortality and that I wasn't happy in the relationship. When I broke up with him he revealed that he was finally getting ready to propose (and even showed me his search history with rings and everything) but by that point it had become a pissing match and I was done.  I realized at a certain point it had become a power struggle over things we didn't even want anymore.  \n\nIt took another four years but I eventually met a guy who wanted me as much as I wanted him and we were on the same page about everything.  Find the person who you can say anything to, who doesn't hold aspects of your relationship hostage, who is on the same page emotionally with you and you'll be happy. It still takes work, obviously, but you're not pouring your love and heart into a bottomless pit.  \n\n",
            "It was the right thing to do.  It's incredably hard but ultimately right. Sometimes it is just easier to stay with what you have instead of moving on because it is just that, easier.  Jobs, husbands, homes, investments and yes, pre-husbands (i.e boyfriend) are all just easier to stay with because you feel you've invested so much time so it really should work out. Please know you made the right decision and take some time to figure out the next chapter. ",
            "Now another door can open for you.  One will, when the timing is right.  Just take care of yourself.",
            "My (28F) ex heart school sweetheart (28M) of 11 years broke up with me in October after two years of going back and forth over marriage. He also used the I am not ready excuse, I am too young, my chest hurts, bla bla. He fell into deep depression which made me fall into deep depression, anxiety. He moved away and starting talking to another woman (complete opposite of me) for support, cliche. I saw a therapist and used my family and friends as support but I can finally say I am much better. I forgive him for everything because everything happens for a reason. Having a heavy heart will get you nowhere. \n\nI ended up focusing on my career and now will be moving across the world for a better career opportunity which I would not have gotten if I had stayed with him. Best thing to do is learn to love yourself.\n\nI DODGED A BULLET, as well as you! He can be someone else’s mess now :) \n\nI come from a culture where being 28 and single is frowned upon but you know what, not going to settle for the heck of it. Do you girl!",
            "Marriage is a commitment and even if he did still love you that fact he didn't want to cement it was definitely cause to break up with him, I mean 6 years and you'd been living together for a while too I'm assuming what was he waiting for? Some kind of green light to go off on your forehead saying marry you? I married my gf after 3 years (got real close after we had deaths on both sides) at 23. We are 30 now been together for 12 years and had our first son.\n\n you will find that person who sees you as more than just a commitment but as a companion for Life.",
            "That took a lot of strength but I think it was the right decision. Take care of you now.",
            "I’m so sorry you two broke up. You will find a man who will so badly want to marry you, he will tear up watching you walk to him on your wedding day, tearing up because of how lucky he feels to make you his wife. You are so young so please do not feel like this is it. There is a man out there for you, you will get your beautiful January wedding my love❤️",
            "I'm sorry to hear that this was the outcome.   Be kind to yourself! ",
            "1) Hugs and good vibes.\n\n2) 6 years was a long time and it was long enough for him to have made up his mind one way or another. Kudos to you for having the courage to leave rather than getting increasingly resentful as you waited to see if he would ever be ready to get married.",
            "I'm so sorry, OP. It boggles my mind that after *6 years* together that your boyfriend *still* wasn't ready, it doesn't take that long to know if this is the person you want to be with forever or not. It kind of seems as if he's the type of person to never know if he even wants to get married in general. My relationship of 5 years ended last month due in part to this, my ex also wasn't ready among many other problems. Sending much love your way, you deserve a partner who is excited to marry you and build a life together with you.",
            "OP, I want you to know that odds are he probably will be engaged quite quickly in his next good relationship. A lot of guys who have stayed in LTRs that couldn't commit will realize their mistake on losing out on a partner and do whatever it takes not to make the same mistake on their next best bet at a happy ending. When this happens, please don't beat yourself up over it. It's not you, it's him.  \n  \nLook after yourself and focus on your goals and dreams. You're still young, you have time. Good luck with everything.",
            "Thank you for updating and staying strong to yourself. EmergencyLychee's perspective and advice is spot on, but it's definitely not going to feel that way for a while.\n\n\nBut I promise you that you will eventually be proud and satisfied that you ended an unworkable relationship so quickly and responsibly.  \n\n\nI still occasionally have brief and embarrassing flashbacks to the previous LTR I had and it's rough, but mercifully (in retrospect) quick end.  It may not make sense outside of my head, but I actually feel most embarrassed at the obvious red flags I ignored and the time and effort I wasted at the end trying to fix it, not at the pain of the breakup. \n\n\nWhen you've moved on to better parts of your life and better relationships, I think this is how you will eventually see this moment too.",
            "I remember your post very well. I'm really sorry this is the way it ended.",
            "Hey there OP! I remember your post. I'm sorry it worked out that way for you, but now you can regroup, and then find someone that wants to be married to you as much as you want to be married to him.\n\nI stayed with a guy for 20 years. 20! That was never willing to marry me, and always moving goalposts. (We can try for a baby when you have better health insurance/more money in the bank/house is fixed up/that next promotion etc)\n\nI'm 46 now, and never got to get married or have children. Our relationship is ending because the anger and resentment I feel towards him killed our relationship. (in fairness, he finally did become willing to get married and/or try for a baby when I was 42ish. Probably figuring the chances I could actually conceive were close to zero, so he'd go through the motions. Or he realized I was serious about ending things so he 'caved in'.) By that time, it was way, way too late. \n\nSo, anyhow, my TL;DR - is: Be glad you didn't stay and end up like me 14 years later! 46 isn't 'old', but I wish, so much, I had left when I was 32, started wanting kids and he started stalling me.\n\nYou did the right thing OP. My best wishes moving forward, I hope you give us an update about how great you're doing in a year. Onward and upward!",
            "Reading all this was a rollercoaster of feelings. I’m so sorry you had to go through all that. But things only get better from here on out. I’m glad you were able to read the red flags. ",
            "Sorry OP. I know it feels like your whole heart got ripped out. I'm hoping it gets better quick and you can clearly see the next person in your life in line with what you want and need from a SO. Don't settle. Be relentless in your pursuit of joy and happiness. ",
            "I hope you feel better soon OP. \nAfter my LTR I feel like I never want to get that close to anyone ever again. I just want to be alone. A lot of these responses to your post helped me feel better ",
            "I'm sorry it had to end, but the tiny silver lining is \"at least you found out now\". Best of luck and thank you for sharing. ",
            "Aww man, I remembered that original post. I kinda thought it would go down this way. I'm sorry that happened, but I'm hoping for a nice shiny future for you.",
            "I’ll try it give you the same advice I give female friends from years of watching relationships ;\n\n- Believe someone’s actions. Dont assume they’re going to change tomorrow or eventually and just start doing what you wish they’d do or wanting what you want.  \n\nWas someone just rude for 365 days? They’ll probably be rude tomorrow.\n\nWas someone not a thoughtful or attentive bf for 365 days? Accept their behaviour when they show it to you over and over and over. \n\nDid someone avoid doing something for 1,095 days? They will avoid it tomorrow too!\n\nIf someone truly wants to do something, they’ll do it. \n\nIs someone interested in romance? They’ll be romantic. \n\nInterested in a great relationship? They’ll be reasonable and thoughtful. \n\nAccept what they’re showing you. \n\n“Accept their behaviour at face value. As it’s being presented. They’re showing you who they are. Believe them!”\n\nNever just assume “Well I’m unhappy with _____ , ______ , and _______. He doesn’t do ____ or ______ even though he knows he should. I’ve told him over and over it’s important. He agrees he should do it. But then he doesn’t.”.... is going to suddenly change after months or years. \n\n...... because he doesn’t want to. \n\nStop staying in relationships with people who want different things who you have to drag through life or fight with for them to see your point of view. \n\nIf a persons actions say “I know you want that. I don’t wanna do that. I wish you just didn’t want that so my life was easier” ..... instead of just assuming that since they’re objectively wrong they’ll eventually see your point of view and want something different .... believe them. And move on. \n\nYou’ll find someone who wants what you want. They’ll find someone who wants the same lifestyle. Everyone wins. \n\nHow do you get to that point? \n\n2. Judge people’s actions. Take the time to be cognizant of and discern the meaning behind other people’s behaviour. Aka be a good judge of character. \n\nFind out what their actions are ascribed to. \n\nAsk a guy if he wants kids. “Sure. One day, yeah. \n\nThis means. “Yea. Maybe. One day. It’s not something I ever think about it or assign any value to that idea or plan” \n\nIf he says “Yea. Of course....” then precedes to tell some long story about hanging out with nieces and nephews etc..... that’s a guy who puts value in that.  \n\nWhy it’s that important? He’d be more willing and ready to make actions to move towards that. \n\nBe aware of what people actually value and want in life. Don’t just let them tell you they value something while they clearly don’t, especially as a means of avoiding a hard conversation. \n\nAt the end of the day people will act on what they want. If they’re not acting on it, then they don’t really assign much value to that. It’s kinda that simple. Just freaking take their behaviour at face value. It makes life so much easier. \n\nBe a grownup. Stop and say “Then let’s do this! Shouldn’t we be excited for this if we both want it?”....\n\n“Don’t you think if you actually wanted ______ , you’d do ________ ?”\n\n“You doing/notdoing _______ has made feel like you aren’t interested in _______ or we aren’t on the same page. I just wanna know we’re in this together. I just want some follow through from you to know that you want this as much as I do.”\n\n“If you don’t want this I need to know. It’s ok to express concerns or tell me you want something different. Don’t just tell me what I want to hear to avoid discussing it.”\n\nShould you have to say any of that? No lol. It’s not your job to raise people or teach them how to respect others. It’s not your job to transition people from selfishness to selflessness. Find someone who already made the journey. \n\nCause guess what? You’re probably going to spend years expecting them to change and repeating the same cycle with them of expecting more over and over. Til years go by and they didn’t ducking change lol. \n\nAnd now you’ve invested years. And he thought you would’ve just accepted him and dropped all your wants and accepted mediocrity years ago. \n\nWtf right? How could he be such an idiot to think you were going to just completely change one day after years as long as he waited long enough?\n\nOh wait. Isn’t that what you just did with him? Oh no, that’s different right? Cause you told him every day what you wanted.  Well hun, so did he. With his actions. You just chose not to listen. \n\nAnd he’s angry and resentful you still want him to change. \nYou’re resentful he’s not interested in building the right future with you. \nAll this could have been avoided if you just believed him. \n\nSource : Am guy. We’re the worst. Sorry. \n\nEpilogue : You two break up. He wakes up. Actually realizes how complacent he had become in the relationship. Suddenly finds value in the ambition and thoughtfulness you always wanted him to have while with you. He’s married now and is expecting. She looks so happy. He makes her happy. She has the life you always wanted. \n\nYou hear the tip of the spoon hit the bottom of the ice cream. ",
            "Thanks for posting OP, it seems like you ultimately made the right choice. good luck with everything! To those who are commenting about being in a similar situation... \nJust putting it out there but I [F 31] proposed to my husband. I got tired of waiting and was sure we both wanted to get married (because we talked about it) but I knew he was stressed out about being able to afford the ring and all the pressure of the proposal. I bought him a ring and myself a matching band (spent about $400 for both as men’s rings are way cheaper) and proposed to him in front of the fire while on a camping trip. People are always shocked when I tell this is but what’s the big deal? So I didn’t get a diamond, I saved up and got the wedding band I always wanted and love. We’ve been married for almost two years and have a great relationship. Not all men would appreciate this, but a confident man who’s secure in who he is in the relationship won’t be emasculated by this, my husband felt relieved that I didn’t care about any of the traditions that put pressure on men. Talk about a double standard! :) \n",
            "Sorry to hear it but too bad he couldn't let you know earlier...since for you, you were wanting some kind of promise of a marriage, but he couldn't deliver, so he should have let you know earlier.",
            "So my husband and I got into an argument because of this post...our stories could not be more similar...we dated for 10 years and the initial discussion was when I completed my masters we will be getting married only to return to my home country and him saying hes not ready....I literally felt the exact same gut punch...the resentment....the tears...everyday we would bicker for an entire year until I told him we need some time apart....we eventually did take some time apart and then eventually got back together without a proposal...but it was weird...I started to start doubting if the proposal would even happen. For my 30th birthday he surprised me with a trip to NYC where I thought he would propose and by the second day I became so paranoid I broke down angry and upset that I ended up ruining my own proposal....all in all I get where you are coming from...Its so hurtful when you share a relationship and you and your partner are not on the same page...I hope somehow it works out for you guys because Ill say that  I thoroughly enjoy being married thus far..its been almost a year and a half and I guess he needed to make this decision when he was ready to be fully committed....wishing you guys all the best",
            "I was totally not ready for marriage at 21 and I can't imagine being with the person I was with when I was 21. I didn't know anything about myself or what I wanted. \n\nThis is the best decision for both of you.",
            "Hey there, I'm kind of in the your shoes right now. My partner asked me to marry him during a spurred passionate moment, and then regretted it later on when he had a moment to think. He took it back, it stung, but we discussed our relationship in detail. I had to really question myself why I even wanted marriage, because I'm not religious and don't really believe in the \"nuclear family\" model. I came to the conclusion that it's due to societal pressure, and I'm actually ok not being married. I feel like he's committed to me, and I don't need a piece of paper to prove that, and I would never want to force him into a situation that he might later regret. I found some peace within myself, and we seem to be settling over it as a couple. \n\nI'm not sure what's in your heart right now, or how you're feeling, but I hope you find peace, friend. 💜",
            "Gloria Steinem’s statement “A woman needs a man like a fish needs a bicycle”  is something everyone in this situation should remember",
            "So basically he wanted all the benefits of marriage without paper. Good for you for moving on.",
            "This may be an unpopular viewpoint, but I find it so upsetting that two people who love each other and want to be with each other break up because of these things. Maybe I’m naive but I don’t understand the intense need for marriage? Like if you love someone you love them - no matter what, right? Idk ",
            "Marriage happening doesnt have to be the end all be all for the relationship. Waiting for it is OK.",
            "This isn't going to be a popular opinion, but to end a 6 year relationship that seemed to be going very well from what you said because the guy was nervous is probably the dumbest thing I've ever heard. If it were love then the title of \"Married\" wouldn't matter. \n\nYou sound like the type of person that just wants to be married so they can say they're married all the time. Instead of actually loving your partner.",
            "I am so sorry that you are going through this.  Keep your chin up, it will get better. ",
            "I'm sorry. This isn't surprising, unfortunately. I commented as much in the original post.\n\nAlso, I hate to say this too... but be prepared for him to marry someone else, possibly within just a year or two.\n\nGood luck on finding someone else! There are plenty more fish in the sea still.",
            "I think you'll find someone else who sees life like you do and you will find the happiness you deserve.",
            "never settle. it is so painful to end up single yet again but anything ANything and Everything is better than settling because as opposed to a short time of dating and starting over, you would be miserable FOREVER, like a dog chained up in a yard, waiting on your partners beck and call only to get nothing. you made a good decision, best of luck to finding someone with the 'nads to truly commit, show action not just talk. ",
            "It’s probably because he isn’t right for you. There’s plenty of fish in the sea and I’m sure you’ll meet someone you truly love",
            "He dodged a bullet on this one. A pushy partner on such a big expensive decision is never a good thing. If he wasn't ready and you had gone 6 years already what's a little longer going to do? I would have left too. My GF and I have had talks of marriage and we both want it but neither of us is going to be so needy that we break up if it didn't happen.",
            "If you were happy being in a relationship with him, why would you end it simply because he didn't want to get a piece a of paper to make it \"\"official?\" Seems a little silly to me. ",
            "The original post gave ME anxiety - the word proposal was used so many times, kind of feel for the guy, he had been under pressure for a looooong time\nIt's 2018, if you feel like marrying propose yourself, be a team player...",
            "I struggle with this...\n\nThis may very well be what was best and I know you said that “we discussed” getting married and had both decided on Jan ‘19 but you both seemed committed to eachother, you didn’t speak of other large issues so it seems to be simply the marriage piece that was the deal breaker. \n\nI know more and more of my friends who are not getting married. Financially, legally, and even when it comes to custody and children at least currently there aren’t many upsides for men in the US.  I’m speaking as a married father of two. I have several divorced friends and for the men in those scenarios there abilities to afford normal lives with child support, alimony, and paying for secondary living expenses is impossible. I think we all know how these scenarios typically play out so you are asking your SO to risk his entire adult life on this relationship. Since they work 50% of the time thats a pretty serious risk. \n\nI talk with my wife a lot and life is tough and it throws a lot of curve balls your way and you can’t control it. Doesn’t mean your bad or weren’t meant for eachother or insert any other cliche’ here about relationships. Some of the best ones don’t work because some real life stressors got in between people and sometimes that is no one’s fault. \n\nSo I am not trying to change anyone’s mind or say either of you are wrong especially since it seems you both are being very mature about this - all I’m saying is if I was ever single again, which I don’t want, I doubt seriously I would consider marriage, in a legal sense, ever again. But I would totally commit myself to someone else without getting the government involved. Cheers and I hope whatever is next is better. ",
            "[deleted]",
            "Dust yourself off and move on QUICKLY.  Start back dating and don't hesitate to jump into a new relationship.  You want marriage, and time is of the essence.  Good luck!",
            "[removed]"
        ]
    },
    {
        "post_id": "zctd98",
        "author": "No-Entertainment942",
        "title": "How do I (14 male) ask my stepmom (42 female) to adopt me?",
        "url": "https://www.reddit.com/r/relationships/comments/zctd98/how_do_i_14_male_ask_my_stepmom_42_female_to/",
        "score": 2710,
        "num_comments": 243,
        "created_utc": 1670205491.0,
        "selftext": "I (14 male) have a really awesome stepmom. My stepmom Rashida (42 female) married my dad (40 male) when I was four years old, my biological mother has never been in my life.\n\n\nAnyways for Christmas this year I wanted Rashida to adopt me, she has always been a great mom to me and she also has my little brother (6 male) and sister (3 female) that I absolutely adore. So I want advice on how to ask her, I asked my friend earlier but they told me to post on here and I’ve just been working up the courage to do so. Can someone help me with what to say?\n\n\nTLDR; I want to ask my stepmom Rashida to adopt me but I don’t know how to ask her.\n\n\nUpdate- Hello everyone. First off thank you for the responses and now let’s get into it. On Christmas morning I wrote Rashida a letter and handed it to her, it basically asked if she would adopt me. She read it and tested up and hugged me and said she couldn’t adopt me….. Because she already DID!!!! So yeah I was surprised and it turns out she adopted me after she and my dad got married. So since people wanted an update here it is. Hope you had a wonderful holiday season and hope you have a great new year!",
        "permalink": "/r/relationships/comments/zctd98/how_do_i_14_male_ask_my_stepmom_42_female_to/",
        "comments": [
            "speak to your dad, this sort of thing is best planned with him. he'll be able to work out any of the legal implications, and give you advice on if this is even a good idea (probably is but best to confirm)",
            "This is one of the sweetest posts I've ever seen here.  I agree with everyone suggesting to talk with your dad.  But even if this can't legally happen for what ever reason, I am sure yoir stepmom would love to know how you have been feeing and that you wanted her to adopt you.\n\nIf you don't know how to talk to your dad, you could even just show him this post.  That way you don't have to plan what to say.",
            "Also agree with speaking to your Dad first, but also wanted to mention that if your stepmom isn't able to adopt you, that doesn't mean that she doesn't love you or care about you. Adoption, especially when the bio parent is still alive, can be very complicated and there are a variety of reasons (legal, financial, etc) that it might not be able to happen even if you, your (step)mom, and your dad all want it to. \n\nWhatever happens, I'm sure she'll be honored to know that's what you wish and that you view her as your Mom! Good luck and I hope everything works out well!",
            "Talk to your dad first.  Understand what you are asking for is a huge deal though.\n\nIt is an extremely emotional conversation and I hope you update everyone with good news.",
            "My suggestion, after quietly talking to your dad about it, is to put that in a Christmas card (assuming you celebrate that?) for her to open on Christmas day.  \n\nMaybe something like this?\n\n\"Dear SM, \n\nfrom my earliest memories you have always been there, caring for me,  turning my tears into laughter and lifting me up when I fall. \n\nYou have been my mother in all but name and I would like, with your agreement, to make it official.   I would like to legally become your son and would be delighted if you would consider adopting me.\n\nI already consider you to be my mother and this would not change our relationship. This would be my way of showing you and everyone else how much I consider you to be my family. \n\nPlease take all the time you need to think about it.  Merry Christmas.\n\nWith love, \nYour son.\"",
            "This is really sweet! I want to echo the advice that the first step is to talk to your dad, since an adult who knows you both can give the best advice. Good luck! Rashida is lucky to have you as her kid.",
            "Man, this is beautiful! Thanks for making my day. I have an amazing stepmom, too, and I know how lucky you are!",
            "For a step parent of a teen this is pretty much the biggest compliment you could ever give her. Teens are notorious for being difficult with step parents.\n\nBe prepared for tears (of joy) and good luck OP",
            "As mentioned below, talk to your dad first.\n\nThe man who I know as my grandfather married my grandma when my mom was 6. Mom told me when I was an adult she was always hurt that Grandpa never adopted her. She loved him very much and he had been a great dad to her.\n\nNot long after m conversation with mom, I moved in with Grandma, Grandpa had died of a heart attack and she needed someone who could drive and just be sure she was alright at night. I worked during the day.\n\nOne night when we were cleaning up after dinner and grandma was telling stories of mom as a little girl I asked why didn't grandpa adopt mom.  Grandma stopped what she was doing and smiled.  She told me he already loved her so much he considered her his.  There was no need to adopt.\n\nNot sure if that story will help,  I hope it does.",
            "Rashida in Arabic means the ‘*person who is rightly guided*’\n\nSounds like she’s living up to the name her parents gave her",
            "My mom died when I was 9. My stepmother (who was great) never legally adopted me cause I was beneficiary of moms  SS (parents divorced) and me being adopted could pose issues claiming that money Tilll I was 18.",
            "First of all, talk with your dad. Explain to him what you told us and tell him that this is your personal wish. Then, look at adoption laws where you live.",
            "You rock. \n\nLike everyone here is saying, talk to your dad first. \n\nThe main stumbling block, if any, would be laws where you live that make an adoptive step-parent, and custodial parent, get permission from your birth parent. \n\nFrom what I've seen, if the birth parent has been non-contact, an 'honest attempt to contact them' may need to be done to prove that they are an 'uninterested party'. It all really depends on your area's family/child laws. \n\nYou can always ceremonially 'adopt' your step-mom if it can't be done legally, or easily. It's a good excuse for a party, anyway.\n\nGood luck!",
            ">Anyways for Christmas this year I wanted Rashida to adopt me\n\nI just want to caution you, this is a great thing to ask for but be aware that even if everything goes smoothly it likely won't be done by Christmas. These things take time do go through the legal processes. By all means ask, but be realistic about timelines.",
            "Dude, you just made me cry happy tears. You are an awesome person to recognize how lucky you are to have a loving stepmom. Many people have already said to talk to your dad, and this is the best suggestion. But also, consider writing a letter to her to give (perhaps on Christmas morning if your family celebrates it) that tells her how much she means to you and how much you love her. It will be one of the most precious gifts she ever receives.",
            "The legal process in adopting is long (can't be done by Christmas, takes at 6-12 months average), and is a lot of work too. I hope you can do it ahead, you could start the process this Christmas, lots of options there.\n\nMaybe you can give her a \"Certificate of Adoption\". You can get it made to say (anyone with basic graphic media skills and a modifiable template) anything your heart desires, how great a Mom she is, so great in fact, you're officially adopting her! It won't be legal, but it will be from the heart, since she already lives there anyways. \n\nYou can even write out a little 'small print' area at the bottom, where you say if she'd like to make it legal too, it would be an honor. So the gift would be half a declaration gift to her, and half invitation - that in your heart, she's loved and known as Mom.",
            "Talk to your dad. With his help, write a note to your stepmom and have her open it on Christmas Day. You can ask her in your Christmas note present.",
            "Dad first, he will know if she’s going to accept such a thing. And he’ll tell you how to handle it. I’m so happy that you’re about to have an extra awesome parent.",
            "I'd first figure out whether she legally can. Some locations require the consent of the biological parent. If you'd like to share your location (state, if you're in the US), I can try to look further into it for you.",
            "Tell your dad first and explain your feelings so he can help you get paperwork together",
            "So everyone has the right if it, get dad involved. I think if you're nervous just showing him your post is a great way to get the conversation started.\n\nAssuming all goes well with dad, though, that doesnt answer the question of how to ask mom. Dad might have some suggestions on how to go about that, but since your initial question was how to ask her, here's a thought for when you get to that part.\n\nAs has been pointed out, legal processes take time. But, that doesnt mean your desire for stepmom adopting you cant start on Christmas still. Definitely run this idea by dad to gauge how she might respond (since this is definitely a big deal) but what comes to mind is using your post here again. But this time, have a print out or it's open on a device you then stash in a box and wrap for stepmom to open Christmas morning. Hopefully, and ideally, stepmom will feel as strongly as you do about your wish to make it official, so this could be a meaningful Christmas gift to you both. Thos is why you need dad in on this, and maybe he can do some circumspect investigating/priming to make sure all is going to go as planned. \n\nHell even if she knows it's coming, having the official request from you to her happen on Christmas would make your Christmas wish come true, and hopefully mom's as well. Good luck and hope however you decide to go about it, your Christmas is extra special this year",
            "I can offer no advice but wanted to thank you for an uplifting story. Good luck i hope you get your xmas wish.",
            "This is very sweet of you and I am sure Rashida would love it.\n\nAs others said this needs to go through your dad. If the bio mom is alive there may be alimony or child support. Also if the bio mom is alive then she has to sign off on your adoption giving her rights as a parent away. She might not want to or it could lead to custody battle due to parental alienation. If bio mom is dead there still may be legal issues, she or her parents could have left you money in a fund/trust for when you are 18 and that needs you to remain her son. \n\nEither way, lawyers will be involved so it's best to ask dad how to proceed.",
            "I work in adoptions and do step parent adoptions all the time! I love doing them. I get to see families that have been in place for years make that relationship official. I don't know what state you are in so I will give general advice and tell you what some of the people did in your situation. \n\nFirst, get your dad on board and make sure it's something that can be done and that it's something Rashida also wants. Step parent adoptions are generally more lenient than other adoptions so there should not be too many barriers (as long as it's something everyone wants and your step mom doesn't have any child abuse or significant criminal history). They don't take super long either, but there is a process that will take several months.\n\nSecond, maybe have your dad call around to some local agencies to see what the procedures are so you are all prepared. \n\nThird, if your bio mom has not been around, doesn't give gifts for birthdays, doesn't visit, call, provide child support, has abandoned you, etc, it would be relatively easy to prove in court that her rights should be terminated which would free you for adoption. Sometimes parents come forward to contest or say they won't agree to ak adoption, some don't respond, and others give a voluntary consent. Just remember your bio mom will need to be at least tried to be notified and informed of the plan. \n\nFor the fun part, I've had cases where the family gets the legal adoption papers and wraps them up as a gift. They're not filled out or anything. They can be blank. You can get them from your county courthouse or even online. Don't worry about having all the rights ones for this--you can do that later. Then step mom can open the papers on Christmas and you can get started on the process. \n\nOther kids have made pictures asking for step parent to adopt, some write it in a card. \n\nIf you need help with wording, kids have often said to me that their step parent has been mom/dad since they were little, and they would like to make the relationship official. \n\n(Some people might say she doesn't need to adopt you for you to be her child, and that's true, but the benefit of an adoption, especially in this situation, is if something were to happen to your dad, this would ensure you get to stay with her and your siblings.) \n\nSay you love her so much and you have always felt like her child and you'd like if she would want to make it official/permanent/legal. That's all it will take. My guess is she already sees you as her son and it won't take much on your part to convey your message.\n\nIF something were to happen to prevent an adoption now, know that adult adoption is a thing and while you'd have to wait a few years, it can be done once you turn 18.",
            "Hope this post ends up on /r/bestofreddidupdates with a wholesome ending.",
            "This made my eyes well up with happy tears. I asked my dad to adopt me at 21. He raised me from the time I was 7. Bio dad was also not in the picture. \n\nI discussed it with my mom first. Then we went onto our local city halls site and printed all the legal documentation needed. \n\nI presented it to him in a giant card with a letter on Father’s Day 8 years ago. \n\nBest decision I have ever made. \n\nAs a step mom, myself, I’m pretty confident in saying she already loves you as her own. This will make it legal. \n\nAh! I just love it. \n\nHave fun with it! \nSo happy for you and your family xo",
            "This is so lovely! There are lots of adoption videos like this that could give you some ideas. I might take some time to write down some of the memories you have with her that are extra special to you and why you love her, and then ask your dad to help you with the legal stuff. You are going to make this woman CRY!",
            "This is very sweet.  I would talk to them together.  If they say no, understand that there are probably reasons she can’t…it isn’t about her feelings for you.",
            "Wholesome post kid. All the best, and let the tears roll 😭",
            "Former Family law lawyer here.  Don't.  Just don't.  \n\nThere are a lot of compilations.  It's an expensive process.  Example: It would necessitate a termination of parental rights hearing on your bio-mom.  And since that's such a critical and permanent change, it requires due process procedures to the extreme.  If she decides to contest, you're looking at a 5 figure legal bill minimum, and I've seen them go as high as $68,000.  \n\nAnd that doesn't touch the issues of child support, child support arrears, custody, or inheritance if she has other biological children.  \n\nYou might think you're asking for a sweet inclusion into the family.  But what you might be asking for is for her to spend 10s of thousands of dollars to sue your bio-mom for the right to call you as her own.",
            "At 34 years old, my ex colleague has a 14 year old adopted son. He's actually the nephew of her husband.  She has been with him since he was 3.  One particular year, she was very sick and was bed ridden for a loooooong time.  \n\nAs a primary school kid at that time, he took his own initiative to look after her before/after school.  He cooked for her, fed her, ran errands, the whole 9 yards.  She was very touched.  After recovery, she adopted him.",
            "Write a a letter to Santa asking him to make it so. Have her proof read the letter for clarity. Make sure your dad proofreads it also.",
            "*crying on a Monday morning* \nThat's lovely, good luck to you!",
            "Let me ask you: If you are already living with her, and it seems like she is already acting like your mom, and it seems like you consider her as your mom as well, then what difference does it make for her to legally adopt you?\n\nYou already have all the benefits of her being your mom without that piece of paper that won't really make any real difference!\n\nYou should know that adoptions are complicated and take money and time and effort and lots of paperwork and lots of inconveniences that won't necessarily make things easier, legally speaking, for both of you.\n\nThink about why you want this, and consider the fact that you already have the relationship you want with your stepmom without a piece of paper telling you what you already know!\n\nThat being said, it's a lovely gesture!",
            "Just stopping by to say I love this post. ❤️",
            "This is very sweet.  Step one is talk to your dad and run it by him.  Unfortunately you don’t know any legal implications or concerns there.  While your biological mom may not have been in the picture, she’s likely still legally your second parent and therefore would need to agree to give that up for you to be adopted by someone else or your dad would need to consult a lawyer about terminating that otherwise, if possible.  So I would tell your dad and he can be clear with you about what’s possible at this point and also when appropriate to ask (likely when any legal boundaries have been removed, if they exist).",
            "Don't make her.\n\nCommunicate that you want her to adopt you. Tell her how you feel. Make sure it's genuine.",
            "Wow this is really interesting. I live in the third world and rarely is there a need for adoption by a step parent. Your step parent is as good as your your biological parent as long as the two are married and in some cases where there's no marriage, if you've lived together as a family for long enough.",
            "[deleted]",
            "It's really lovely you would like her to adopt you. But have you considered the implications to you? Even in step parent adoption, the adopted person's original birth certificate is locked away and a new one issued with the adoptive parent listed as the parent who gave birth to them.\n\nThis fact of how adoption unfortunately works has resulted in many adoptees having great difficulty or even be completely unable to get a driver's license or passport. It's especially difficult for people whose new false aka amended birth certificate is issued more than a year after they were born.",
            "So well articulated! Perfect reddit formatting! Almost too good for a 14 y/o",
            "Happy for you man, seems like others answered. Talk to Dad for sure, he’ll know what to do and I’m sure she’ll adopt you in no time.",
            "Talk to your Dad.  He’ll know how and when to ask, as well as dealing with the legal stuff. \n\nCongratulations on your new Mom!",
            "Just ask her like you did here. Probably be honored",
            "Just ask her. Don’t bother with the legal stuff rn. Just say your feelings. That’s what matters the most. You don’t want her to be your ,,mom” for the documents but for the way you feel about her. \nYou can make her a surprise and ,,propose” to her. “Mom, do you wanna be my mom?” \nBoth of them will be very happy for sure.",
            "This is so wholesome ✨🥹 Keep us updated!!",
            "I would talk to dad first but I don't think it could go wrong if you gave her a card for Christmas and spill a little of your heart and ask in the card and film her reaction (she'll wanna see that forever).",
            "Send her a Xmas card and say \"I'd love to adopt you as my Mom\"",
            "We need updates for when you ask her.\n\nAlso, talk to your dad first",
            "I love this! It’s wonderful you have that connection with her. I would speak to your dad about it first.  Even if she decided against adoption it doesn’t mean she doesn’t love you. I am hoping for the best outcome for you! Keep us updated!",
            "After you talk to your dad, I think a simple heartfelt Christmas card would be sweet. Something she can keep to look back on.",
            "This has to be the cutest thing I’ve ever seen anyone ask for advice on!! I love it and I love that you have a stepmother you see as your mom. I would say speak to your dad first and then maybe you both can come up with a way to ask her, since y’all know her the best. Good luck! I hope to see an update!!!",
            "I just want to say you are going to make her the happiest Mum on earth, this made me emotional to read this, your family is so lucky to have so much love in it, I wish you good luck, this will be a Christmas for all of you to remember. I think a surprise planned with your dad is the best option, he can seek out the adoption papers and maybe you can present them to your Mum on Christmas, before giving it to her you can tell her about how much she means to you, how she took on the roll as your Mum without a second thought and that you are forever grateful to her. She will be so happy to be able to say you are her son.",
            "Get her an adoption form and give it to her as a gift",
            "Usually I'd say ask how your step mum feels about it but I think for this you should talk to your dad about it...if you can't use your voice then write it down or write a letter to him about what you want, why you want her as a step mum and how you feel about it\n\nI'm not good at expressing my emotions or using my words for hard stuff..even though I'm 30 writing it helps alot",
            "Talk to your father first, if he also likes this idea, it could be a xmas gift. Either like build a beat w the bear saying, would like to adopt me. Or write a special letter for, on how much  she means to you, how much you see her as your mother and such and ask her to adopt you",
            "Awww. You made my day. That is so sweet  ❤️ 😍 💖 \n And it will be The Best gift ever",
            "Just like you asked this question, just come out an ask her",
            "You need to mentally prepare yourself for her to say no. Becoming a legal guardian takes time… mentally.",
            "This is absolutely the sweetest thing ever. As a step mom I can only dream that my step daughter sees me the way you see her\n\nI think if words can be hard for that a letter or a card would be a great option. Put all your feelings about how much she means to you and then at the end as if she would adopt you. You could also put a few picture inside\n\nI hope you and your family have a great Christmas OP!",
            "Alternatively, \"accidentally\" leave this page open on the family computer.",
            "So nice to read. Talk to your dad first, he needs to be informed and can help with a nice surprise for Rashida. I wish you all the luck in the world!",
            "Talk to dad first but also giving her adoption paperwork as a Christmas gift would make her heart melt I'm sure.",
            "OP, give us an update on a few weeks!",
            "Talk to dad and get him in on it! Sure it will be great",
            "This is awesome! Best wishes. ❤️",
            "Just to piggyback ask your dad and if it can't happen now (some legal technicalities with your birthmom) adult adoption is a thing. At 18byour stepmother can absolutely adopt you and it needs no consent from anyone!",
            "I'm not sure where you're living so this might be different based on where you are... but I was adopted by my stepdad in the US, and in order for that to be possible, a parent either has to have died or rescinded custody (my birth father died). \n\nSo if this legal requirement is the case where you live, you need to ensure your birth mother gave up custody of you before this is easily possible. But regardless, you should express that to your stepmom. I think her heart would be so full if you tell her that. And I'm so happy to hear she has been a wonderful mother to you!",
            "This is way cute ! Talk to your dad and let the motions move! I'm sure she's going to love this! What a beautiful thing to ask of a human.",
            "This is so sweet!! I did the same thing with my stepfather on father's day when I was around your age! My mom helped me with all the legal mumbo jumbo, so I agree with everyone saying to ask your dad for help! I think regardless of the legal outcome, your stepmom will be honoured that you care for her so much and see her this way! While we were never able to make my adoption legal, I was able to take his last name and I know he appreciated the gesture! He's been my dad for over 20 years, legally or not!",
            "I just wanted to add my two cents: \n\nIn an ideal world this would beautiful “mom-posal,” and might be able to be one IRL too. \n\nBut this is why you want to talk with your dad about it first, to see if there are any legal barriers or anything like that before you put it out there. \n\nWe all just want to make sure this is a beautiful moment for you, and you don’t get hurt if she has to answer “Uhhh… I don’t know,” because she genuinely doesn’t know if she can. \n\nI am not a lawyer, but I imagine that adopting you might involve terminating your bio-mother’s parental rights, which might not be as easy as it seems, even if she’s been MIA for years. \n\nI wish you such good luck! I really hope this works out for you! I know your stepmom will be moved to tears.",
            "At 14, for you to feel this way about your Stepmom says that you’re a loving, and you both are blessed to have each other. How you address this is important because first off, you have to make sure Dad is OK with it. Figure out what it is you want to say to her write it down and put it on paper, speak from your heart and don’t be embarrassed, as a Mom myself I would feel honored, that’s definitely going to touch her heart and resonate deep within her that you feel this way, afterwards she’s going to speak with your Dad, just know that the process of this doesn’t happen overnight so be patient, the important thing is that she now knows how you feel, she probably already excepts you as her child, I wouldn’t worry she’s your Stepmom and love is unconditional regardless if it’s put on paper things will work out in the direction they should go, I say this because she now knows how you feel, just keep loving each other. I wish you the best and many more blessings to come, Amen!!",
            "Talk with your dad first, to see in what way he can help you ask her. And you better give us an update when she agrees to adopt you 😎🤙🔥",
            "This has made me smile so much.\n\nI’m a stepmum to my son. His mum passed away when he was 4 years old and I became his mum just as he was turning 5. Unfortunately my son has disabilities so he probably wouldn’t be aware that I can adopt him or understand any of it, I am just his mum.\n\nAs a step parent I can’t even explain how much is means to be your parent and not to be seen as a step anything ♥️ of course there are situations where the parent doesn’t even deserve the step title but if the parent treats you as their own then it’s absolutely amazing when the child treats the parent as their own too",
            "Please come back and update us because I don't think a single person here would have a dry eye. You sound like a great kid, I hope the legalities can be worked out!",
            "I thought of something that’s cute! With your dad get a plush that says it’s a boy. Now with adoption papers put them both in a box and wrap it!",
            "If you are doing it alone, write a heartfelt letter and have her read it in front of you. If not, maybe ask your dad to get the forms and present it as a gift with a letter alongside it and turn it into a family thing. :)",
            "Speak to your dad first. If he thinks it can happen, swear him to secrecy, get the paperwork, write her a letter explaining why you want this to happen, package it up and give it to her for Christmas. I guarantee you'll blow every other present out of the water! I really hope it can happen for you.",
            "Make sure your dad is on board. I asked my stepdad through Christmas last year it was amazing, keep in mind I am an adult now but he was honoured. If you want her to adopt it’s probably best, good luck 😊😊",
            "Speak with your dad, but honestly, just speak from your heart when you ask her. She's been in your life for 10 years and gave you siblings. Chances are, she'll be honored. But when you ask her, make sure to have a box of kleenex with you. She'll need it",
            "Aww man. As a step mom myself this just makes my heart sing. I think it's so awesome you love Rashida that much and you realize she loves you much also. I'm hoping and praying it all works out for y'all!",
            "Talk to your dad, and give her the forms necessary for your next gifting holiday or her birthday!",
            "hey! i'm the oldest of 3 and my dad isn't my biological dad. never met my biological dad. my siblings are technically only 50% blood related but its never felt like that. i never had to ask my dad to adopt me, but i did ask if i could call him dad when my parents first started dating when i was 6 lmao. we don't really have many deep conversations, but when we do i can tell they always mean a lot to him and we both cry and hug. if i were you, i'd ask both your parents to sit down with just you and just come out with it in a heartfelt way :) i'm sure it would mean the world to them. best of luck!",
            "Definitely talk to your Dad. If he thinks that it is doable ask him to help you do a proposal version of adoption.   \n\nMaybe buy her a mother’s necklace with a charm representing you. Give it to her as you say something to her like - My life has gotten so much better since you came into it. There is nothing I would like more in this world than for you to become my mother. Will you adopt me?",
            "This sounds great. It's amazing to have a great step mom, you are lucky.  \nYou can't convince her to adopt you though.  \nThis is something that has to be decided between your dad and her.  \nAsking her directly will put too much pressure on her and she likely loves you too.  \n\n\nTell your dad how you feel.  \nAll the best to you.",
            "Is your parents' marriage strong?",
            "This right here made my day.",
            "Honestly don’t do it u don’t need labels from government for adoption papers if she good mom she’ll be there for u always without all that.. plus just in case if want get romantic one day best not be mom legally trust Me that from experience last part",
            "Tell her that you love her and that you can think of no greater honor than being her adopted son. Good luck.",
            "Maybe make contact with your mum. I think your looking for 'belonging' through being alienated from your Mum.",
            "Loved your update.\n\nCongratulations!",
            "Just read the update. Happy for you! That's amazing.  \nBest Christmas present ever?",
            "What a totally awesome update! It tells you that your Mom loves you just as much as you love her. Congratulations to you for having such a great mom.",
            "What a lovely end to your story! ❤️"
        ]
    },
    {
        "post_id": "m5uznm",
        "author": "Mountain-Buddy-6881",
        "title": "my (14m) family is falling apart",
        "url": "https://www.reddit.com/r/relationships/comments/m5uznm/my_14m_family_is_falling_apart/",
        "score": 2718,
        "num_comments": 131,
        "created_utc": 1615842672.0,
        "selftext": " \n\nUp until about March 2020, my family was fine, my parents were divorced on very good terms (had been for 9 years) But right as the covid restriction began, my dad pretty much began losing it. In turn, this really screwed up my 18 year old brother, who turned to drinking. This is how things were for a while, until about august, when my brother got a dui. Wrecking a car my dad had just bought him. And my dad isn't rich by any means. He's unemployed, with virtually no money. At this point my dad went virtually insane. Then, my dog, and cat died. Not exactly helping. Then, in december my dad finally decided to go to an impatient facility, he came out two weeks later, feeling good. For about a week. He went back a month later. Same deal, felt good a week, went back. And now we're here. He came out, same thing. But now, he's totally estranged. He told my mom \"I loathe you, fuck you.\" and won't give her back the $6000 he owes her. So my mom is also financially fucked up now. My brother is in constant conflict with my mom, and my mom is crying almost everyday. I just don't know what to do, I'm mind bogglingly stressed everyday and can't focus on anything.\n\n tl;dr: family coming apart, dad resents mom for no reason, 18 yo brother picking up drinking",
        "permalink": "/r/relationships/comments/m5uznm/my_14m_family_is_falling_apart/",
        "comments": [
            "The best way to support your family is to support yourself. It sounds selfish, but if you spiral with your family, you won't be able to do anything to help at all.\n\nYou are under so much pressure, but you are not alone. You can get through this.\n\nWhat can you do to take care of yourself? Would staying with friends or other family help you feel safer? Are you open to speaking with a therapist? Would finding a support group where you can speak with people in similar situations help?\n\nEven starting just by opening up to a teacher you trust or a school counselor who can help you find the resources you need could be an excellent first step. But please do what you need to do to keep yourself safe and sane. We love you so much.",
            "It’s normal to want to help your family. It’s normal to feel guilty that you can’t help them now because you are 14yo. Spend as much time on sleep overs with relatives and friends as possible. Try to go to summer camp this summer, either as a camper or counselor. Be around as many healthy ppl as possible as much as possible. Join after school activities. Join a homework club. Babysit. Go to the mall. Talk to your youth pastor if you are involved in that world. In short, take care of yourself everyday. Really focus on yourself and your well-being. You will get through this. You will be okay. Take it one day at a time.",
            "i feel like I should be mad at the wholesome award but that actually gave me a good laugh lmfao",
            "About the only advice I can give is don't drink, smoke, toke, or do drugs. Don't even do it once. Addiction sneaks up on you. You don't even realize it until it's too late, and then you're stuck with it even if you quit and go sober. It really screws up your life.\n\nThe reason I'm giving you this advice is because you seem to be at the perfect point in your life for addiction to strike. I can't give advice to fix what's going on in your life, but I can give advice on how to avoid what has screwed up my life.",
            "Oh man that's a lot.  It's really hard to deal with addiction in the family even as an adult.  It's important for you to remember that even when your dad and your brother are messing up, it's not your responsibility to fix them.   There isn't really anything you can do except take care of yourself.",
            "This is not your fault. You are amazing just for looking for ways to fix this. Do you have any friends that you can talk to or grandparents that you can stay with? I'm so sorry that you are dealing with this. Try to focus on hobbies and other ways to deal with the stress you are dealing with. Maybe join some clubs at school or a sport if you can. Try to talk with your brother about how you are feeling if you feel like you can trust him.",
            "Oh honey I’m so sorry I can’t give you advice. Where are you located? Maybe update that and people can be more specific with resources",
            "I'm so sorry that you are going through such a hard time. As others have already mentioned, their issues are not your issues. Try and focus on making sure you have what you need to be okay and try and leave their problems to them.\nYour father and brother both need to work some stuff out themselves it sounds like, no one will be able to help either of them until they are ready to receive help. So don't take their problems on your shoulders. Let them know you love them and care about their wellbeing, but they shouldn't try and push their problems onto you. You're too young for that. You don't need to feel responsible for them and their life choices. \n\nYour mom is obviously dealing with a lot, I assume she works to try and make ends meet and your dad refusing to pay her back what he owes adds extra stress. From what he said to her it sounds like he might hold something against her, maybe from their divorce or before, but that's also for him to work out. It's now your mom's job to focus on providing for herself, you, and your brother, until your brother decides to move out and provide for himself.\n\nFrom what you've written, it sounds like you and your brother live with your mom. If that's accurate, and you are on good terms with her, my suggestion would be to maybe talk to her and see if there are small things you could do to help her out. It doesn't have to be big things, you're only 14 and you're not expected to become the man of the house. Find small things around the house you could do to help take some stress off of her so she can focus on providing for you. Clean up around the house or make a meal or two a week. You don't need to go out and find a job. Again, you're only 14, your job is to focus on your schooling and get good grades to be able to graduate and set up a better future for yourself.\n\nIt's good to see that you are trying to seek advice somewhere. If there is extended family or close friends you could also reach out to if you feel that's necessary, that might be a good step to take as well.\n\nI wish you well and hope you have a positive update to report in the future 💖",
            "This hit hard for me, I could have written this at 14. Suddenly, my stable parent became an alcoholic, and I experienced a lot of the loss that you are describing.\n\nWhat I wish I knew at that age:\n\n1.) You aren’t responsible for parenting your parents. At 14, you don’t have the capacity to handle a parents problems, and that’s okay. It’s okay to be selfish and put yourself first.\n\n2.) Don’t be silent- tell your aunts or uncles, your teachers, your counselors. It’s not loyalty to keep everything inside, because your parents and you are struggling. There are so many resources out there to help you.\n\n3.) Never engage anyone when they are drunk. The promises they make will not be kept, they can go from happy to angry for no reason. You can’t help them overcome their addiction. \n\nI know you are going through difficult times, but it does get better. I can’t guarantee your family will get better, but YOU will be fine.",
            "You need to focus on yourself. You can't help your family. But are your needs being met? If not, are there ways you can get help for yourself?",
            "You are 14.  None of this should be on your shoulders.  You didn't make your brother drink and drive and you certainly didn't turn your dad into an addict.  Your mom is struggling as well and when both parents are not being very parental, life can suck.  Just don't own it.  Do you have relatives around that you can lean on/live with?",
            "Dude, days like your describing were normal to me too, I went through 2 messy divorces by age 14. It really really sucked.  Im sure your situation is different but I feel for you. Im so sorry you gotta deal with all this stuff bro, and I’m here for you.  I can’t make it any easier for you but what I can tell you is that I managed to make a good life outta what I have... What you’re going through, as messed up as it is, is temporary. Remind your folks and brother that you love them. Help when you can. Focus on what you gotta do for you, and as you move forward don’t look back.",
            "This might not work for you, but if your are religious at all, even a little bit, think of reaching out to a church/synagogue/temple/whatever. They may be able to offer your mom some money or food, and they might be able to provide a minister/pastor/rabbi/lay leader who could take some time to talk about what you are dealing with. If religion is not a good fit for you, your school may have a guidance counselor who can  help direct you to someone who can help.",
            "I want to send you cookies and hugs.  That sucks kid!  Life is just like that.  Please have faith that little by little it will get better.  And you’ll look back on these days as something to compare normal days with. To help realize that normal days are absolute blessings.  Some day not to far off. And you’ll be able to appreciate them.  Unlike so many people who get down about small stuff.",
            "It's okay to not be okay. No matter who you are, navigating such an incredibly stressful and difficult time would be extremely challenging. \n\nFocus on self-care, and to the extent you can, help others with the same. \n\nSelf-care means make sure you're eating decently, stay hydrated, get enough sleep when you can, shower regularly, and just focus on nailing the essentials of basic health and survival. \n\nPast that, stay up on your school work, help out around the house, and just keep moving forward. \n\nNothing is going to make this period unstressful, so don't act like freedom from stress is an achievable goal. Use your extra spoons to help your mom, siblings, and dad to the extent you can. \n\nI'm sorry you're going through this, and I'm especially sorry to hear about your pets, but you can get through this. \n\nBelieve it or not, just seeing someone else in the family working on self-care and taking care of essentials really helps other people to realize they should be doing the same thing. So moving steadily forward doesn't just help yourself, it helps others.",
            "Are there any relatives or friends homes u can stay at?",
            "I dealt with some similar stuff when I was a kid. Honestly, you have to understand that it's not your fault and you aren't responsible to fix anything. And ya know what, no matter how hard it gets, you'll get through this. For me, the biggest thing that helped me finally start to feel like I had some sanity and control over my life was when I got a car. I was able to get a cheap car of Craigslist and it truly changed my life. Just being able to get out of the house whenever I needed to escape worked wonders for me. If you have any good friends who can come and pick you up (or their parents) if you need to get out or have a hot meal, I highly recommend that too. Work hard in school so you can get scholarships to college and get a good job when you graduate so you're not dependant on your parents anymore. And, if I'm honest, you may way to set up some small savings funds to start saving for when your parents inevitably have to stop working and can't afford to live anymore (if helping them is something you think you'll want to do). \nAnd just so you know, my dad also had to go to to rehabs and anger management but he transformed a lot over the course of my life and he and I are actually really close now. My mom is a different story, but I'm still a lot happier now living in my own place and interacting with my parents only on my own terms. I honestly still can't believe that I haven't had to worry about the electric being out for months at a time since I graduated and it feels so good. You'll get there.",
            "Im sorry, man. Situations like this are awful and unfortunately there’s not much you can do aside from being there for your mom and brother (as much as possible). I hope things turn around for you, keep your head up and don’t forget to take time for yourself and your interests. You’re so young and this kind of burden can steer your life off path. I’m rooting for you.",
            "When I was your age and my family was falling apart I thought I was alone (even with 4 siblings). I genuinely thought that I had it worse than anyone else. Anyway,  I had the opportunity to stay with a friend who I thought her family was perfect.... until I saw the other side. Turns out no one is perfect. I'm not telling you this to say that your struggles aren't that bad or someone has it worse so buck up,  but rather that I found it very comforting to know that there were other people out there fighting their own fight. My life now vs then is dramatically different (in a great way) so my best advice is to find any kind of security you can while using the adversity to fuel you.  I fully credit my teen year family stuff at making me a successful productive adult. Hang in there!!!",
            "Based on this there's not anything specific I feel I can say. I want to reiterate this isn't your fault. Your brother is at a time in his life that many go through a drinking phase - it doesn't mean he will always struggle. It's also not your battle to fight.\n\nYour father is responsible for his own mental health and your mother is responsible for her finances. Focus on doing well in school. If you want to go to post-secondary, focus on that. Don't feel obligated to get a job or leave school to help your mother, and don't try to \"fix\" your father - that is his job and that of a professional.",
            "I’m so sorry. I feel your pain. I’m 15 and my family is pretty messed up too. Sending you big hugs.",
            "Im really sorry this is happening. I don't have the best family either, and I'm always here if you need to vent onto someone. This isn't your burden though, and I hope you can get into a better situation soon.",
            "Well shit. I've been through all of that (except the brother, never had a brother, and my sister never showed an interest in bad driving or drinking) and even been the drunk myself before. I don't have a CLUE what to tell you except if you have any way of getting the hell as far away from that as you can, do it. All the things I've been through stemming from all of that stuff as a kid and later as an adult all over again, it wasn't worth the experience in any form of wisdom, personal growth, or whatever silver lining anyone tries to slap on it. It's all bullshit and it's all unfair.",
            "I'm sorry your family is going through all that,  it's frustrating when you're so young there's nothing you can really do about any of it.  As others have said,  take care of yourself first,  it should make your mom and dad feel better to see that at least you are okay.  I know it's hard,  but you will power through and will be a stronger adult for what you have gone through.  This past year has been so hard for so many people and there is much upheaval,  just breathe, try to meditate, do whatever you need to to keep your own self sane.",
            "I’m so sorry, honey. The fact of the matter is that *none* of this is your responsibility to fix. You’re a child, and while wanting to see your family members happy is natural, these are all very adult issues that you shouldn’t have weighing on you. \n\nYou need to focus on yourself and your well-being. It isn’t selfish, it’s healthy. Do the best you can and please, don’t feel at all to blame for any of this. \n\nDo you have a trusted adult you can talk to about all of this? A school counselor, teacher, aunt or uncle, or grandparent? You need help and deserve someone to talk to outside of the immediate family. If you’re able to stay with one of them for a while, it might prove very helpful for you.",
            ">I just don't know what to do, I'm mind bogglingly stressed everyday and can't focus on anything.\n\nThere is nothing you can do.  Sometimes shiat happens in life that you can't do anything about.  You should focus on yourself first, don't try and fix other people that can't, or don't want to be fixed.  \n\nIf possible can you stay with grandparents for a while until things settle down?",
            "Aww. I’m sorry. I grew up in a broken home and this last year my husband had psych and addiction issues which left him homeless. Don’t give up. Keep your grades up in school, don’t drink or so drugs, don’t commit any crimes. Out yourself first. You’re only 14. None of the other stuff is your fault or responsibility. I’m so sorry",
            "I went through something very similar when I was about the same age. It was really overwhelming and the way I dealt with it wasn’t healthy. I bottled up my fears, didn’t ask for help, and tried to escape in ways that ultimately didn’t serve me. \n\nAs others have said, it’s important that you focus on taking care of yourself. The fact that you’re here is really good because the best thing you can do is ask for help. It sounds like your mom is really overwhelmed and may need some support. Do you think that involving someone else to provide her with support would help? Are there other family members you could contact to get involved with providing that support? (Such as grandparents, aunts, uncles, cousins, or close family friends.) It shouldn’t be up to you go fix things for your family, so if there is someone else you can connect with for help, I would start there. \n\nIf your mom won’t accept support from family or if there isn’t anyone you know who could help her, is there someone you might be able to live with temporarily? Perhaps a family member or a close friend who you trust and can take care of you while your mom sorts things out?\n\nAnother option would be to connect with someone at your school, like a teacher or a school counselor. If you share some of what you’re going through, your teacher or counselor may be able to connect you and your family with resources in the community that can help. I’m not sure what access to counseling is like where you are, but where I live there are many programs that provide free counseling for youth under 19. You could try googling “free counseling in ____” and include your city’s name. \n\nIt sounds like you’re going through a really rough time. I hope things get better for you soon. If you have more questions or need more advice, let us know.",
            "I’m so sorry. For you",
            "Hey man, I'm  a counsellor who specifically works with young people and people with substance use issues. I'm also currently working in the justice department in my country. I won't give specific advice over Reddit, but I can give general information. Please see a professional in your area if or when you're able and feel the need.\n\nIt sounds like there is so much going on in your family right now and it sounds like its really taking a toll on you. \n\nThe first thing I would say before anything else, is that the other comments that say you should support yourself as best you can. In our industry, we refer to the oxygen masks in airplanes as a metaphor, and say you should fit your own mask when things get rough before helping others. Fit your own oxygen mask, so you can breathe, and then worry about other people.\n\nGenerally though, there are a couple of other things. Firstly, you are not responsible for anything that's going on with your family. Your parents seem to be struggling, and you are a 14 year old young man that's caught in the middle. You are not to blame. \n\nAlso, comorbidity with mental health and substance use is quite high, as is being in legal trouble. Economic stressors are also a predictor of relationship difficulties. In fact, while this may seem obvious to some, I will say that it sounds like all the \"virtual insanity\" and \"fucked up\" stuff is likely a result of people in your family not coping. Its clear that your family needs support on multiple levels.\n\nI think that's as much as I'm able to offer on a comment thread on Reddit. If you're feeling the urge to support and help your family, please seek another adult you trust, or a professional. If you need to focus on yourself, that is completely okay and you can give yourself permission to do that.\n\nAll the best.",
            "I am so sorry you are dealing with so much difficulty. \n\nI had a lot of issues when I was your age with my family fighting, not having money, having mental problems, and substance abuse. I handled it in both good and bad ways, but I'm on the other side of it at 28 and have been mostly self sufficient for a long time and I'm so glad I believed in myself and made it through that difficult and painful time..sometimes looking back, I don't know how I did it and I barely scraped by.\n\nWhat I can say is what some others reiterated, that taking care of yourself is primary! You won't be able to fix your family, you need to survive. I agree that finding ways to stay out of the house is helpful, but try to make them good ways. I almost ruined my life by finding bad ways to stay away. Luckily was able to course correct though.. staying with friends until things are more stable, or as often as you can; will be helpful. Make sure they are good friends though! I know things are tough with covid right now. But are there any extracurricular or sports or anything you could join? Staying busy and meeting other kids who are also staying busy and doing good things will be great.\n\nCan you possibly get a part time job, for yourself? Ic you do, save that money for you. Chip in with groceries once in a while, as in going to the store and doing the shopping and paying the cashier; but do not let your parents convince you to give it to them. Speaking of, working at a grocery store is a great first job.\n\nAlso, find something that motivates you, a vision for your future. Hold onto that deep down. Be patient with yourself on your journey..things will be up and down but always believe in yourself that when you're down you will be able to pull through and create that vision down the road. You don't have to figure out exactly what you want to do, but start thinking about what you want your life to look like. If you envision a happy college years, or 20s; what does that look like ? Hold onto that and know it's coming if you make it through this rough patch and let it inspire you to make it through and not give up.\n\nCan you find a therapist? Or speak to the social worker at school? Can you ask them about a group therapy for other kids struggling with family issues at home?\n\nAnd always always remember, it's not your fault and you are not responsible for fixing your family or your parents. That is their responsibility, and they are failing; not you. Do not let them guilt you into trying to take any sort of responsibility for the family. That is their job as parents, and if they're not that doesn't make it your job.",
            "Geez kid. I'm sorry you're going through this. Stay strong. Perhaps choose one person to support and invest your extra time into. Maybe they they can be an ally.",
            "You poor baby. I am sending you a virtual hug. In my mind i feel like you could benefit from the kind of hug that comes from an auntie that's a famiky friend who will keep your secrets, hold you and rock you like you are a baby, so you can feel safe and finally let out all of the tears I imagine you have been holding in.\n\nAside from all of that i want to remind you that none of these things are your fault or your responsibility to fix. But clearly all of this takes a great toll on you.  You are doing a great job of maintaining yourself, and you are asking for help which is incredibly commendable and says that you have a lot of strengths. Take pride in your strengths and taking care of the needs of others doesn't have to be one right now. Definitely get to a school counselor or trusted teacher or school admin. \n\nAlso even though we are in a pandemic try to get involved in activities you enjoy. This will keep you busy, change your environment, and hopefully build your network of support. \n\nI really do hope and wish the best for you.",
            "When I was 16 my closest dearest friend committed suicide and my mom was diagnosed with a terribly aggressive cancer. I was a total loser in high school and my hair all fell out when I was 11, if it wasn't bad enough. My dad was a convicted pedo from years back, emotionally unavailable at all times, and wasn't shy of being mentally/emotionally/physically abusive. I have to be real with you, I don't remember much of my teen years. It was a blur. But I stuck by my mother's side and I did what I had to in order to make sure my sanity mildly remained in tact. I ran the household as a 16 year old for a bit..I even when to work with my mother to help her there too. It can be done...it's so hard and you all deserve better...but life is super difficult and unfair sometimes and we just have to do what we can in the moment. Take every day one day at a time. Remember who you love most and stick by them through it. I had to stick with my mom...my dad, who I loved dearly despite the hell he made, took care of himself and only himself. That was what he was used to. So, I focused on my mom. My brothers and I were so far apart in age and weren't close until we were adults. I'm sorry you have to deal with this. I wish your biggest concerns were what songs to put on your ipod...but life is so hard sometimes. I'm thinking of you ❤",
            "Give your mom a foot massage. Tell your dad you love him. Let your brother know that you got his back, no matter what mistakes he makes. Allow yourself time to relax , laugh, and find something in the future to look forward to.",
            "These are difficult times for so many people.  I am sorry.",
            "Not to be too nosey but I feel like your parents only separate on good terms on the outside to not make such a big scene during the divorce. If he's paying alimony I can see why he doesn't want to pay for it",
            "imagine going insane because you gotta stay home for a bit lmao",
            "It’s on you dude. In the face of all the suffering and tragedy in your life, you can choose to be the responsible one. Take care of yourself. Do what you can to help those that deserve the help. When your environment is a living hell the only thing that makes it worse is adopting a resentful angry bitter attitude and it’s not like you can be blamed for that one hit. But the only answer is to confront it with your head up and taking on an attitude of responsibility and a willingness to endure through it while keeping your integrity. Just because others have lost their way doesn’t mean you have to lose yours. I’m sorry you are going through this, I hope there will be a light at the end of the tunnel for you and your family.",
            "What would happen if you got them to all sit down with you? Or at least one by one. Is your dad becoming dangerous? Maybe notify an aunt or uncle, maybe even your schools security guard or a teacher. I think you should think of some questions to ask your family. Tell them about the hell they’re putting onto you and how you’re only 14 and you had to resort to Strangers for advice. Maybe find a relative to get away to for a week, or stay with a friend for a while, I’m sure their parents would understand and want to help. I’m 14 as well and my family aren’t arguing but we’re going through a rough spot as well. I think quarantine and covid has had more affects than we think. Hopefully when this whole thing is over life will return to as normal as it can get.",
            "Damn. If I was on Reddit when I was your age I’d’ve had a very similar post but with less doctors and more police- nothing going on around you is your responsibility. If ur having trouble in school I would highly highly recommend you email either ur teachers or ur counselor and j be very clear and transparent about what’s going on. Ur brother got into an accident and ur dad in the hospital and now ur mom is in financial trouble. It’s not an excuse it’s a reason (and probably a well documented one if anyone ever doubts you) and they should know so they can at least be understanding. \n\nYou just have to get through this. Weather the storm. You are strong.\n\nMaybe this does or doesn’t help but here’s the biggest night of conflict at my house and how I got through it. Dad cheating on mom, both complete alcoholics at this point. They are screaming downstairs and I’m with my brothers keeping them away from the conflict. My mom starts beating the ever living fuck outta my dad and I had to physically separate them. Me and my brother on my dads side get into the car with my dad, he goes back inside to tell her the cops are on their way only to find she had haphazardly slit her wrists. We drive off to his mistresses place. I was 13/14. I went into middle school the next day and not only was I tired from not sleeping but I was tired of my life. It sucked I didn’t want to have to live like this. (I’m no genius but I’m quick to switch from home to school life and participate, knowing most answers and not being afraid to just answer to keep the class moving.) I get to my first period class and I just don’t do anything, stare at the board, not even half listening and not bothering to pretend like I am. I was cracked so much that just one more tap and I would’ve broken down. My teacher asked me a question to see if I was paying attention, like she had caught me in a day dream. I looked right at her and said I didn’t know. She looked at me harder and hesitated but didn’t push me at all. It was nice of her to just let me move on. In the next period I just put my head down. The teacher of that class asked me if I was okay and instead of lying I just told the truth. Unadulterated and unfiltered I j talked about the previous night and she listened. She told me that I didn’t have to worry about her and her class and that was it. I didn’t have the time or Ability to be present and when I explained why she just understood. \n\nTalking about problems doesn’t really help, neither does someone listening, but when some understands? That’s something that can change a life.",
            "Damn. If I was on Reddit when I was your age I’d’ve had a very similar post but with less doctors and more police- nothing going on around you is your responsibility. If ur having trouble in school I would highly highly recommend you email either ur teachers or ur counselor and j be very clear and transparent about what’s going on. Ur brother got into an accident and ur dad in the hospital and now ur mom is in financial trouble. It’s not an excuse it’s a reason (and probably a well documented one if anyone ever doubts you) and they should know so they can at least be understanding. \n\nYou just have to get through this. Weather the storm. You are strong.\n\nMaybe this does or doesn’t help but here’s the biggest night of conflict at my house and how I got through it. Dad cheating on mom, both complete alcoholics at this point. They are screaming downstairs and I’m with my brothers keeping them away from the conflict. My mom starts beating the ever living fuck outta my dad and I had to physically separate them. Me and my brother on my dads side get into the car with my dad, he goes back inside to tell her the cops are on their way only to find she had haphazardly slit her wrists. We drive off to his mistresses place. I was 13/14. I went into middle school the next day and not only was I tired from not sleeping but I was tired of my life. It sucked I didn’t want to have to live like this. (I’m no genius but I’m quick to switch from home to school life and participate, knowing most answers and not being afraid to just answer to keep the class moving.) I get to my first period class and I just don’t do anything, stare at the board, not even half listening and not bothering to pretend like I am. I was cracked so much that just one more tap and I would’ve broken down. My teacher asked me a question to see if I was paying attention, like she had caught me in a day dream. I looked right at her and said I didn’t know. She looked at me harder and hesitated but didn’t push me at all. It was nice of her to just let me move on. In the next period I just put my head down. The teacher of that class asked me if I was okay and instead of lying I just told the truth. Unadulterated and unfiltered I j talked about the previous night and she listened. She told me that I didn’t have to worry about her and her class and that was it. I didn’t have the time or Ability to be present and when I explained why she just understood. \n\nTalking about problems doesn’t really help, neither does someone listening, but when some understands? That’s something that can change a life.",
            "Your ability to focus your message in a clear, coherent, and cohesive way after what has been a tremendous year is impressive. You even come across as somehow being grounded. I’m sorry about seeing changes in behavior in other family members and is what can happen when people are under more stress than they can handle. Im glad your brother is ok. Im sure he hates having wrecked the car (more than anyone) but a car is replaceable. I’m so sorry about your cat passing. And just as much for your dog passing. I bet neither wanted to leave you either, in the same amount. Your parents have lived now at least 3x your age and for them covid/lockdown is completely unexpected. Add to that the whole political circus, they are mad at not being able to give you and themselves the life they are working so hard at. It is for you too but older people, and by their age, feel like they can anticipate/plan and adapt and now, not being able to, as if the rug was pulled from under them, and depending on so many things, it’s rough in a different way is all. They have plans to be retired one day and know that you guys are on a good trajectory and this state we’re in—for lack of a better word—pisses them off. They want to help you have that good life and they feel they cant right now. But this state we’re in is temporary\n\nHearing your dad say that to your mom would surprise anyone whose never heard their dad speak like that. It seems to me he is in a lot of pain and frustration and so is your mom, brother, and you too and not being able to fix it or to anticipate *exactly when we return to a better normal is something we’ve not faced before. What’s important though, is that we will. Acceptance of not having a fixed day—as hard as this is to do, can be liberating. \n\nWould you describe yourself as resilient? Your focused message, after all that transpired and seeking others’ perspectives seems to suggest so, imo.  What are some interesting or new ways you have been passing time that are meaningful? Also, there is research that supports that taking walks in nature (park trails, hikes) can be very calming and introduce peace into your life. For when youre home and need to create a quieter space in your room, esp if you can hear arguing, and this is going to sound odd but i think helpful too—earplugs. Not just any earplugs. Walmart sells a box of these tan ones, for about $4 and WOW, they provide near complete silence. I used them because a room mate would make a lot of noise and wake me up. Best decision ever (second to moving finding a new room mate haha\n\nHow are you doing in school? (Newsflash: no one is doing amazing in school, and your inability to focus is actually quite normal for a human. You are normal, not a robot) There is talk that after we are all vaccinated, we will be returning to in-person class again. Are you looking forward to it? I hope there are at least a few (if not more) aspects about it that you like. It’s good that you find and surround yourself with positive outlets",
            "I’m so sorry you’re going through so much. I’m not the best with advice but I want to offer you some comfort. I had a rough home life growing up, some of which had to do with also having a father with a lot of issues. It’s probably hard to imagine right now, but you will get through this, and before you know it you’ll be an adult living your own life. These struggles you’re going through will make you a better person. You’ll know how to navigate the really hard stuff a lot better than your peers. Everything I’ve been through has shaped who I am and I can finally say that I’m proud of who I’ve become. Life is filled with a lot of pain but also a lot of beauty and happiness. You’re stronger than you think.",
            "This shit can happen with families. I am sorry this is happening to you. You sound like a really great human. Good on you to be able to recognize these feelings. Just ask for help, accept help, open up to someone and keep looking out for you. Looks like this post has some really great advice.. I just wanted to tell you that I am sending you good vibes brother. This too shall pass.",
            "You might want to check out Al Anon for support. It would be helpful for you to figure what you can change, what you need to accept and get advice from others who are going through the same thing",
            "Hey young man! It's a tough time right now. Its not your fault.  Gotta be brave enough to speak up for what you need during these types of things.   You're a kid.  You have needs and right now, things are broken for you.  The one AMAZING THING THOUGH?  You're here. \n\nWe're here to listen and to support you!  Life will get better but not without making small daily changes to help yourself!  Study hard.  Distract yourself by going to libraries or friends homes which are safe.\n\nYou are in my prayers little person!  Life is tough and this experience is just giving you some good lessons on how choices impact everyone.   You  deserve happiness!   \n\nBig hugs. There are a lot of supportive and helpful people here who will listen to you and try to guide you!",
            "Keep talking like this, keep opening up, stay busy and focused and look after yourself. And when you need help please ask for it!",
            "I'm so sorry for the loss of your cat and dog",
            "Write in a journal, about all the things, this is about your well-being, document everything, your feelings, you experiences, your outbursts, everything.  And when I say everything I mean everything. \nThe reason for doing this is so you can sort thru all the issues your family life will bring in the future.  It will give you a greater understanding of why you behave the way you are at the time.  These times are shaping your mind. They are planting seeds.  Write in your journal every day.   Please do this. You will have a record of everything to look back on.  Please do this for your own sake. Good luck 🤞 sending love and prayers to you.",
            "Talk to your dad, talk to you mom, talk to your brother. They've all been alive longer than you have and have serious perspective on this \"falling apart\" of which you speak. Your family is already apart so treat them as individuals who probably need a friend right now. As long as you have food and shelter then I'd consider taking on family repairs as a hobby because someday it might come in handy for your own life. Your dad taking 6k and saying he won't give it back is like nothing... It's more about how soon he can get it back to her even if it's 100$ a month. If he feels he's owed that money then he accepted it under false pretenses anyways and should be told he went about it the wrong way. Your mom needs to seek a counselor instead of taking it out on your brother. Your brother needs friends he can talk to and I think you're the only one who can relate to him right now. Alcohol is really good at what it does so I fear he'll be the hardest one to bring back to reality right now... even defend him when he gets into it with your mom. Siblings should stick together and not live in a wave of their parents regrets and mistakes.",
            "I've been threw some ruff stuff myself,keep your head up an stay focused. You ever feel scared or some type of way I know I don't know you,But u are welcome to inbox me anytime u need bro👐🏻❣",
            "I wish Reddit was a thing when I was your age. You're getting some good advice. I would start to talk to your teachers and your counselors. You might have to consider the possibility that your home isn't a place that is conducive to your long term life plans. You only have one life and often times one chance to position yourself in a good spot where you can live comfortably long term. \n\nYour stress is not normal because your environment is chaotic. You are a minor and the ones responsible for caring for you aren't psychologically sound to care for you effectively. I am so sorry that you're going through this but now is the time to be selfish AND THAT IS OKAY! \n\nGet a school counselor and your teachers involved tell them what is going on and that you're struggling. If I could go back in time and tell my younger self to do this I would because when I was young I didn't understand the impact that those traumatic experiences would have on my mental health down the line. You absolutely have to protect this and tbh you see that there is a history of mental illness in your family with your older brother and father. You are at risk for mental issues down the road and thr best thing that you can do to prevent this is to change your toxic environment. \n\nLet your family fall apart. It is not your fault. It is not your responsibility. You are a child and you need help so that you can develop into the best version of you possible to break the cycle.",
            "OP please take care of yourself first. Ask for help if you need too. Tell anyone you can trust. Take care and stay safe",
            "Unpopular opinion:\n\nYour dad is the problem and your brother is becoming one too. Whatever the circumstances a grown adult is in, it is never acceptable to abuse (financially, emotionally, verbally) other people, let alone your children and the mother of your children.\n\nSupport yourself and then, if you have capacity to, support your mom. You both are the victims here. Your father is an antagonist and your brother, who at 18 should be old enough to be able to at least support himself, has decided to deal with problems by passing the pain along as well. It's cowardly behaviour. Don't be like them",
            "My heart is absolutely breaking for you, sweetheart.  The most important thing you need to know is that this is probably a blameless situation.  That is to say, it’s nobody’s fault.  It sounds like the pandemic triggered or exacerbated some financial issues that are causing your parents some serious stress.  Even your brother, who seems to be acting out in dangerous ways, is not at fault.  Everyone’s just stressed and trying to cope.  So try not to build up or harbor resentments against your family, and DEFINITELY don’t turn inward and blame yourself!\n\nI’d recommend talking with a school counselor ASAP.  Be sure to mention that you are safe at home (if, in fact, you are safe!) and that your dad is seeking help and I’m reasonably confident that they won’t try to do anything drastic like take you into foster care or anything like that.\n\nThere’s a very good chance that things will get much better soon, okay?  I know it doesn’t seem like it, but you’d be AMAZED at how many families deal with stuff like this at some point or another.  I wouldn’t call it normal, but I wouldn’t actually call it completely abnormal.\n\nI’ll tell you two things as a mother (my son is close to your age) that I hope will help:\n\n1. YOUR PARENTS LOVE YOU MORE THAN THEY LOVE THEMSELVES OR ANYTHING ELSE IN THIS WHOLE WORLD.\n\n2. Us moms are really, really strong.  We have feelings and we cry and we lose our shit and yell sometimes, but we generally pull through hell and high water for our children, if for nothing else.  So don’t feel like you need to take on your mom’s burdens for her or step up into a caretaker role that you’re much too young for.  The best thing you can do for her, for you, and for everyone in your family is to take care of yourself.  \n\nDon’t feel like you can’t talk to her, though.  We know our kids feel it when we aren’t holding it together very well, and we worry about you.  You guys putting on some brave face and hiding your feelings scares us to death.  So you know...go ahead and cuddle up next to mom and have a good cry when you need to.  Go hang out with her after school and tell her all about your awesome day and the girl in math class you think is pretty cute.  Ask her to play Among Us with you on her phone or to help you with your science paper.  Keep the lines of communication open.\n\nLean on a best friend or relative or trusted teacher.  If your family can get you therapy, go to therapy.  Find healthy ways to deal with these huge feelings you’re having: cry, punch a punching bag, take up cycling or running or some new hobby.  Paint, write, draw.  Throw yourself into your schoolwork.  Zonk out on video games sometimes.  Whatever it takes to find that balance between coping and escaping in some HEALTHY way.  (As others have said, this isn’t the time for you to start experimenting with alcohol, drugs, or physical intimacy.)\n\nYou’re dealing with some pretty adult problems right now - don’t try to do it alone!  Hang in there and don’t lose hope.  Your dad will find the right balance of medications and therapy to get him through what he’s going through, your mom will smile again, and your brother will mature out of this “wilin’ out” phase he seems to be in.  You focus on YOU and keep your life on track.\n\nBig, virtual mom-hug to you, kiddo.  You can get through this, I promise.  ❤️",
            "The thing about living in the United States is that this country will help you if you ask for it. But you have to be proactive. No one is going to come save you. You have to participate in your own rescue. Even walking into a police station and saying you need help, they’ll point you in the right direction. There’s a lot of pressure on you right now. Don’t break, as this will pass. Keep fighting for a better life.",
            "I’m so sorry this is happening. No kid should have to deal with what you’re dealing with. It’s not your fault. You deserve safety, love, kindness and support. Please don’t feel you have to go through this alone. Reach out to a school counselor, teacher or other trusted adult. You are awesome and resilient, and you will get through this. Hugs to you!",
            "Hey man, I am so sorry. I'm from a \"broken\" household myself and dealt with similar shit growing up. It's so heartbreaking, and it will nag at you for the rest of your life (although it will become more and more bearable as time goes on). For right now, even though you're in the middle of growing up and becoming an adult, you're still just a kid. The best thing you can do is try to focus on school and your hobbies and your friends (I know, I know, harder than ever with the pandemic). You don't have to get involved with your parents or your brother when they are experiencing issues. You can just say to each of them individually, at any time, \"Hey, just so you know, I love you, and I'm here to help if I can\" and then give 'em a hug. Your mom, your dad, and brother. That's the most you are able to do, and they will all appreciate it greatly.\n\nUltimately, as insane as things are, do your best to roll with the punches and try to focus on learning and becoming the best version of yourself that you can be. When you are an adult and maybe have a family of your own, you know what you won't want your household to look like. Again, I am so sorry that you are dealing with such traumatic hardship, but I believe that you can get through this. I had a somewhat-similar upbringing, and I got through it. You can do it. \n\nFeel free to message me if you want. I actually have a master's degree in counseling now, so I'm not exactly unequipped to talk about these things.",
            "Kid, I can’t help you...but I totally wish I could. I want you to know people care about you.. i care about you. If you are in the USA, you make it somehow the next 3 years and go in the service. You can take courses (school) while you work there, and come out with VA paying for more school. For most kids I wouldn’t say this, but for you it might be a refuge. Do whatever you can to keep it together for 3-4 years. People care. I care, the other people trying to find ways to help you here care... but realistically, we can’t do much for you. Take the advice of some of these good people, and keep your head on straight... meaning don’t go the way of your dad. Good luck kid.",
            "I went through something quite similar at 16. It's awful, and it's all-consuming.\n\nLoolimg back on it decades later, that time brought me and my mum/siblings much closer together. It taught me ways to cope with crisis that have been immensely valuable since, and it gave me far more empathy and understanding for other people than I had beforehand.\n\nWhat I'm trying to say is that a lot of good things can come fron this in the long run. The important thing os to develop good, healthy coping mechanisms that you can fall back on later, and avoid damaging ones that cause more harm. \n\nThe most concerning thing might be your brother's drinking in the long run but you can't fix that for him.",
            "This all sounds so stressful and I really hope you find peace and your family is okay. \n\nI do agree with what other people have commented which is that the best thing you can do is take care of yourself, whatever that means. Put your life preserver on first so to speak. Is there somewhere safe near you you can go to cool down and get yourself settled on a regular basis? Try to think of things that are manageable and keep you happy that you can do regularly to keep yourself above water. Search for friends or other mentors you can talk to for moral support, and remember it's a very tough time right now, it's okay for you to feel your emotions.\n\nIt's unfortunate your family is having so many of their own serious issues. Someone should be stable to help you figure things out too, since you're just a teenager. There's not really one best way to cope, but maybe a regular friend weekly chat, mindfulness apps, an athletic or artistic outlet, or anything else that works for you will help you make it through this.",
            "Your school may help with food which should help lessen the financial burden your family is experiencing.",
            "Focus on maintaining a responsible and healthy lifestyle. Your dad is sick, your mom is probably tired, and your brother is being a wreck. \n\nYou need to stay on a straight path. It'll be difficult but hang in there. Be the success in your family and I promise down the road your family will gain strength from it. It might take years and some other devastating incidents may occur, but you gotta stay straight brother. \n\nGod bless!",
            "One motto I learned in life is: never follow mentally ill people in their behaviour. Never try to compensate. It will make you mentally ill, too.",
            "I was younger when I first had family conflicts, anxiety and genuine heartache but I was about your age when it all started to come to a point where it genuinely affected me.\n\nAt 14 right now you have the weight of the world on your shoulders and that sucks but when I was in that position someone said “you’re not going to be 14 forever” and it didn’t fix anything then but now, I look back to that time of conflict and the pain to now and life is much better. It gets better! \n\nYou need to be strong in the meantime. Get a Hug from mum and trust that this difficult time will pass because it will I promise. \n\nThe financial problems, your dads issues- your mum will find a way, Mum’s are good at that mate. Your dad will stop and calm down and your brother will learn and mature too. \n\nIf you have your own room then chill there to escape. Music, reading, gaming whatever you enjoy get stuck into those!\n\nBefore you know it, you’re going to an adult and all these difficult times are going to make you a stronger person. \n\nThe real thing that matters is to make a promise not to repeat the mistakes of your family but instead learn from them now. \n\nDon’t get involved in the arguments, don’t be overly critical or share in the negativity. You don’t want to become a conduit or outlet for people wanting to vent - not when you’re feeling overwhelmed and needing to be built up.\n\nIt will get better. You have got this!!!",
            "100% focus on yourself and school work. Only way to get through things like this is to rise above and hopefully be able to pull yourself out unscathed",
            "You're too young to really be able to do anything. Is there anyone you can trust with who you can speak to this about? It's not your responsibility and you need to look after yourself first before you can even somewhat help your family",
            "To agree with another poster:\nTry your hardest, don't take or drink anything mind altering until you're sure you're in a good place. Addiction will fuck you up. Never let your brain make the connection that taking drugs/drinking or even self harming makes you feel better.\n\nWrite a list of all the things that make you happy and all the tools you have at your disposal to seek support. Who is close to you and makes you feel safe? What teachers do you like and think would listen to you? Any friends or family that you can stay with for a bit so you can find a moment to relax? Hobbies like music or art to vent? These are not your problems, but you were swept up in the riptide. Find your lifejacket to keep you afloat, you will survive and you will make it. Remind yourself over and over, these problems are not your responsibility, your only responsibility is to take care of yourself as your world crumbles around you.",
            "The advice I would give you is this: don’t ever jeopardize your futur to fix someone else’s past. Get help to get through the next 3-4 years, and then, as soon as you can, leave for school! Don’t stay stuck in this, when you don’t have to, it will keep bringing you down again and again. That’s what I did and I don’t regret it one bit. I still see my family 2-3 times a year for vacation and Christmas time, but I live 7 hours away and that’s what kept me sane! I left when I was 17 to go to college I am now 34 and I am living the life I want, while my entire family is having mental health problems, alcohol problems. I feel guilty once in a while, but staying wouldn’t have prevent all these problems, it would have just brought me down! \n\nSo for the next 3-4 years, get help, find trustworthy people that can help you find your focus, do your best in school so that you can leave! Work as soon as you can to put money aside for when you leave, get a car so you can leave, but for the love of god, do yourself a favour and go! Don’t get stuck in their drama! Have the life YOU want!",
            "None of this is your fault. Remember that.\n\nTalk to your school's counselor.\n\nIt seems like alcohol is at the root of your family's trouble.\nYou might want to  seek out Alateen or Alanon. \nEveryone will have been where you are now or were there at one time. They can help you wade through the shit.\n\nRemember, none of this is your fault.",
            "You should go to a family of addiction support group,  sometimes it's easier for addicts to blame others for their problems, that way they don't have to take responsibility for them and they can keep using guilt free.  \n\nI hope things get better.  Been there buddy, it gets better.",
            "There’s nothing you can do but learn to grow up right the fuck now. Typically, remove yourself from that environment but being 14 makes it very hard. Unless you run to the ER and scream suicide, no one listens. What I’m saying is, you need a help from another entity like a treatment center or some stable care that will allow you to process and deal with this madness because as you remain in the situation you’re in, it just gets worse and worse. Ideally, one of your parents step up and end the madness whether it be finance or emotional, it’s up to one of them to provide you a real environment where you can grow. That’s not happening now. The only alternative is to find some way to change your environment and that will need the help of some other adult/organization",
            "I feel terrible for you. It’s tough growing up with these challenges. Hang in there and just try to do as much as possible. These challenges can really help you later in life. Stay away from any drinking or drugs. They seem perfect in the short term, but you’re seeing how they affect people long term. \n\nTake a walk and find a quiet place where the noisy chaos around you isn’t there. Talk to a teacher or a counsellor when you need help. It’s what they are there for. Plod through this, one day at a time and you will get through this. \n\nTell your Mom how important she is to you. She needs to hear something good sometimes. Being there to support her will help you cope as well.\n\nStay strong.",
            "You are doing an amazingly brave thing and the first step, in reaching out for help. Well done you!!! I’m sure you will get help and support here.",
            "I am really sorry you are going through this, but if you are in frame of mind where you can pick yourself up do it. Don't stop for no one and just do some job or another. This might help you keeping your mind away from home",
            "Do not set yourself on fire to keep other people warm.\n\nRead that twice.",
            "I'm very sorry to hear this. This is so hard for you. At least you have one solid parent, your mom, who you can lean on.\n\nThe unfortunate truth is that all of this is out of control. You can't fix your dad. Only he can help himself. With the right mental health treatment, he can get better. But he has to find that and really try at the treatment himself. You can't fix your brother.\n\nI'd suggest that you write your brother a letter explaining your feelings, how scary the drinking is to you, and how much you love him. Then leave it at that.\n\nIt's healthy to express your feelings. You must feel angry, and so hurt, and maybe afraid. Insability is hard to deal with and you can see how your brother turned to alcohol to help cope with the uncertainty. I'd urge you not to follow him. It's so hard to watch our loved ones struggle. We want more than anything to save them. But we can't fix other people. They are not car engines.\n\nThere are a thousand paths in front of you and most of them are good. All the good paths start with taking care of yourself and ask for help. Tell your mom how you're feeling. Ask other family members for help. Your family needs help and you need emotional support. Bad things thrive in the dark, in secrecy. Throw some sunlight on these problems by asking for help. Here's an email that could work if sent to a teacher or guidance counsellor: \"I really want to find a way out of poverty when I graduate. My mom is fantastic and give sme a ton of support, but I want more advice on more positive outlets for my emotions or activities that might be help me.\" Here's a message that could work for your mom: \"Mom, seeing my dad and brother like this is tearing me up. I feel so low. I don't want to tell you how I feel all the time because I'm afraid of making you feel bad, but I feel bad right now because of what they're doing.\" \n\nI see the next five years as a path upward for you from this very difficult time. Progress isn't a straight swing upwards, and I see setbacks, and obstacles, and more unpredictable behaviour - all of that is outside your control. Right now, I see your dad and brother continuing to hurt themselves and you. But, more importantly, I can also see you asking for help and talking regularly to people you can rely on. I see you expressing your feelings, maybe journalling or writing music, or even talking to a therapist. You find positive outlets for your grief and anger, and they don't consume you.\n\nAfter asking for help, which you've already started to do here, I can see a path of healing and happiness in front of you. I see you initially struggling at school with all this chaos going on, but then finding a few things where you enjoy the challenges, and working hard to excel. This summer, I see you maybe working part-time and pursuing a few hobbies outside the house - maybe ask your coach at school about summer sports leagues, or ask a teacher about summer activities. At 16, you're hanging out at the library after school, in a few after school clubs, and playing games with your friends in the evenings. At 17, you're applying to university or trade school, maybe far away from your family. You're spending the summer working at an overnight camp in a more stable environment, and you have friends who are also pursuing further education or training after high school.\n\nPositive things are in your future if you open up and try to rely on reliable others. Your dad and your brother can't support you right now. But your mom probably has an open ear, and there are other trustworthy adults in your life who you can turn to for support. I'm sorry you're struggling with this. You did the right thing by expressing your feelings and letting it out here as a first step.",
            " Hey, I hear you, and it's completely alright to feel this way and want to support your family. I hope you feel like yourself soon and find a way to work things out with your family. Take it one day at a time and start with loving yourself. Only if you support yourself can you support and take care of your family. And you are not responsible for any of this, this is not your fault. All this is temporary and it will pass. Remind your loved ones you love them and take care of them when you can, keep yourself before them. You could also start doing things to divert your mind and help with stress and anxiety. Meet old friends and catch up on some old hobbies, you will be fine and your family too, soon. take care!"
        ]
    }
]