[
    {
        "post_id": "4sb2ja",
        "author": "clairmac",
        "title": "[Update] My [25F] boyfriend [26M] serenaded his co-worker",
        "url": "https://www.reddit.com/r/relationships/comments/4sb2ja/update_my_25f_boyfriend_26m_serenaded_his_coworker/",
        "score": 2674,
        "num_comments": 143,
        "created_utc": 1468245958.0,
        "selftext": "Hi! Thank you all for your advice. What a stressful situation. Here's a quick update. \n\nLink to the original-https://www.reddit.com/r/relationships/comments/4rihvk/my_25f_boyfriend_26m_serenaded_his_coworker/\n\n\nAfter everything I was really pissed all of last week and was sort of planning on breaking up with him but I was taking my time making the decision because, well, break ups suck and it wasn't something I was looking forward to. I mentioned in the comments of my last post that I own a house that has been sitting vacant since I moved in with my boyfriend and it doesn't have a kitchen right now because I moved out in the middle of renovating it. I have a friend that owns a kitchen company so I asked him to come out to the house to look at it and draw up plans. He told me he would do it at cost without charging for labor and ever since I told my boyfriend that he's like \"what, are you fucking him? But how many blow jobs is it costing you?\" I work for the FD so obviously I work with a lot of (good looking) guys and he's just been so jealous lately, especially last week, trying to tell me who I can and can't talk to while at work. So, all that to say, it was definitely time for us to break up anyways. I just can't believe that he is giving me such a hard time but thinks him serenading this girl right in front of me was ok. \n\n\nI did look at a text he got that makes me think they were hooking up. I spent Thursday night out at a hotel with friends for a birthday and came home in the morning. He had a text on his phone that said something like \"omg noooo I was sleeping\" so I read through their conversation (which was conveniently deleted except for two messages) and he had texted her at 3am to see if she was awake. Maybe I'm reaching, but every time a guy has texted me that late it's been to hook up. That sealed the deal for me so I just left, it wasn't even worth fighting over because for a whole week now I've been pretty much done with him anyways. He didn't take it that well, which was surprising because it sure seemed like he wanted to break up, but whatever, it's done now. \n\n\n**tl;dr**: I broke up with him. ",
        "permalink": "/r/relationships/comments/4sb2ja/update_my_25f_boyfriend_26m_serenaded_his_coworker/",
        "comments": [
            "Usually that jealousy and lack of trust stems from a party knowing that you shouldn't trust them, so they assume that they canw trust you. You can't *talk* to attractive coworkers but he can serenade a woman in a pool, practically in front of your face... the details in your post were like icing on the cake. Who wouldn't be thrilled about you getting a new kitchen on the cheap!? That blowjob comment, blegh. Glad his character surfaced strong at the end and you got him out of the picture.",
            "A kitchen at cost?? You have the best friend.  Make sure to buy that dude a nice dinner or a bottle of his favorite liquor (top shelf). That's a sweet deal.",
            ">I just can't believe that he is giving me such a hard time but thinks him serenading this girl right in front of me was ok.\n\nHe was giving you a hard time because he was projecting. He was assuming you can't have a platonic relationship with male co-workers or friends who are attractive because he can't. ",
            "[deleted]",
            "Good for you. He sounds like a complete loser. The others are probably right. Even if he wasn't cheating he was well on his way. \n\nI hope that kitchen turns out great :) I remodeled our kitchen last year and it changed the whole look of the house. \n\n",
            "New kitchen, free to date. Yay!",
            "I have no doubt in my mind that your boyfriend's serenading of his co-worker and their behavior that night was the subject of much gossip among your friends and their co-workers.\n\nI guarantee that all your friends (if they haven't told you in person yet) are rejoicing that you had the good sense to dump his ass after the way he humiliated you at your 4th of July party.\n\nAnd as for your ex and the co-worker, the respect of their colleagues for them has most certainly gone down a few notches as well.",
            "It sounds like he tried with her and failed to close. She enjoyed his attention and your discomfort but didn't actually want to do anything with him. That's the vibe I get from this whole thing.\n\nGood on ya girl!",
            "That's the way it goes. Once you know you're done, what he thinks or how he feels ceases to matter. \n\nI wish you all the best.",
            "One of the first things people who are cheating do is start accusing their partner of the same thing. You made the right call.",
            "Your ex is fucking gross. Talk about projecting. ",
            "So you ditched a BF but are getting a sweet kitchen remodel/install. Two great decisions.",
            "Hey sorry, what's FD? I tried Googling but it wasn't very helpful!",
            "[deleted]",
            "That blow job line would have made me say \"Just because you can't stop from fucking your co-worker doesn't mean I cheat on you.\"",
            "Dude. No person in a committed relationship should be texting other women in the middle of the night/early morning (same can be applied to you with men). Even if it were innocent (which is unlikely - my bf has close gfs and he doesn't text them in the middle of the night) it's disrespectful. \n\nI'm sure he wouldn't appreciate the same behavior.",
            "He is projecting, he thinks or wants to think you are banging someone so he can feel less guilty about what he is doing which is banging his coworker.",
            "You just walked away with your dignity intact, and could not have handled the break up better. Good job, and good luck with the renovations! ",
            "Jerk wanted to have his cake (you) and eat it too (cheating on you). Thank god you kicked him to the curb. You're a strong woman for doing so!",
            "He was definitely projecting ",
            "I'm so excited about your new kitchen.\n\nAnd fuck that guy.  As soon as you said he was jealous about your interaction with men, i was like \"bingo!\" because he is projecting, hardcore.  Pretty much proof that he is fucking around.",
            "I'm not sure if I'm more excited about your new kitchen or the fact you got rid of this guy.  We'll call it 50/50. \n\nCongrats on both accounts.",
            "Smart decision, he sounded like a piece of shit.",
            "Unless something at work was almost literally on fire and only she could put it out, there is zero reason for your ex to have texted that girl at 3am unless he had a thing for her. You made a great decision to leave him. Good luck!",
            "In my experience, the people who always accused me of cheating (I have been completely faithful in every relationship I have been in) were the ones who had cheated themselves, or who were considering it. I'm not sure why that is, guilty conscience maybe? But that might be why he jumped immediately to the blowjob comment.\n\nAnd at this point, even if he weren't cheating, the trust is broken between you two. It's very hard to come back from broken trust.",
            "(28/F) Good for you! Sounds like you have your shit together (owning a home!) AND have your head screwed on straight about that crappy boyfriend. Stay strong.",
            "I'm sorry this happened to you. It happened to me when I was 25 and my husband 26. We'd just had a baby and this friend was running around in his bikini. He told me he never even noticed. Gah.\n\nOf course they ended up getting together, and our divorce was final 2 years later. They are still married (25 years) and it still makes me ill when I see others having to put up with this crap.\n\nYou'll be fine, give it some time. ",
            "My ex cheated on me constantly, yet also constantly accused me of cheating on him. \nI was confiding in a friend one day. He had told me that his dad cheated on his mom often during their marriage. \nHis wise words made me start separating things financially and prepare for the end of our marriage. \n\nHis words \"only the guilty accuse.\"\n\nLeave. Don't look back. You won't regret it. ",
            "Some people don't take it well because they feel like they lost.\n\nGood for you for breaking up. Hope your new kitchen is awesome.",
            "they were fucking, for sure.  you did the right thing ",
            "I scrolled right down to the tl:dr and gave a little Kermit: Yay!",
            "YES!! 😃 I'm glad for your sake that you made the tough choice before things went from bad to worse. Good for you!! Congrats on your kitchen :)",
            "Enjoy your house and new kitchen and new life away from the loser! Cheers to you, OP!",
            "Based on past experience not mine but friend as well. Usually if someone is getting jealous or angry that you're talking to someone they view as a threat is because that person is doing what they think you're doing. I hope that makes sense. So if he thinks your cheating he will get mad and upset when you talk to other guys because he's cheating on you. People who cheat usually get paranoid their partner is cheating too. In my opinion that is what's going on here. The fact that he deleted all the text is a huge red flag, if he had nothing to hide he wouldn't delete them right. The fact that he serenaded(the fact he replaced the original name with hers is just way to obvious that he's into her) her right in front of you. Dump his ass, of course he'll be upset, he was probably hoping you'd stick around so of things didn't go well with her he'd still have you. Once you break up he may pursue her, if that doesn't work he will try to weasel his way back to you more then likely. Don't let him. There are plenty of guys out there who would be more then lucky to be with you. I'm sorry this happened. Hope things get better for you. ",
            "He sounds like a gigantic anus and you're much better off without him. Get yourself tested for STDs just in case he's been hooking up behind your back.",
            "As soon as I got to the \"What, are you fucking him?\" I was like \"Ruuuunnnnn!\".  Just got out of a relationship where I was accused of cheating with any guy I liked hanging out with or just made me laugh. Fuck that never ending noise.",
            "I'm not a guy who suspects cheating right away....\n\n> I told my boyfriend that he's like \"what, are you fucking him? But >how many blow jobs is it costing you?\"\n\nHe's cheating on you.",
            "I would like to give you infinite awesome women points.\nGo you. \nseriously, /internet jumping highfive.",
            "Good for you. The guy was acting like a turd monster. You don't need that.",
            "It sounds like you showed a lot of class in how you dealt with this. I wish I had been as self-possessed and sensible at your age. He clearly isn't ready to be a grown up and you are! Congratulations.",
            "What a fuck face. \n\nGood for you.",
            "I am really curious to what type of tantrum this guy is throwing now",
            "you did the right thing OP, more power to you",
            "after the first post, when he completely dismissed your concerns, that's when you know he's an asshole.\n\nand the whole \n\n>\"what, are you fucking him? But how many blow jobs is it costing you?\"\n\nvery uncalled for, no respect or trust for you.",
            "I have never been so angry reading one of these posts, glad you left that hypocritical scum to the bag q_q",
            "Good for you. Glad to read this. ",
            "You did the right thing, screw that guy.",
            "He reacted like that because HE is cheating. I am so glad about your kitchen! Yay for good people.",
            "I am very happy for you!!! ",
            "You sound like a bad ass lady. Take no shit.",
            "This happened to me but the boy was 13, am i overreacting?",
            "Well, at least it's over now, and you got rid of him. Severing relationships always sucks, but imo it's necessary in order to get rid of toxic people.",
            "I must be an old fogie, because I put my phone on silent at 10:30 and go to sleep. How do you get any sleep if you are constantly texting?",
            "Dudes love a gal with a nice kitchen",
            "This thread sounds like there is a big typo in the title.  All the \"2\"s should be \"1\"s.....",
            "An ex-girlfriend used to do something I thought was very clever and so totally respected with me, because I attract a lot of women and am a bit clueless to what I'm doing. All I know is they are there, but never really understood why or what I was saying. Anyway it used to bother her a bit and so rather than being jealous and therefore devaluing herself in my eyes, she actually would always come up to me and give me a hug. What I didn't know was she would always put her hand on my chest right over my heart. She knew from 'personal' experience how I reacted physically when I was actively interested versus just seeing someone pretty. She said because she would always see I'm relaxed and my heart was all chilled out she knew I wasn't in what I like to call 'hunt-mode'. \n\nThis ladies is a great great way to check in with your man without him knowing and it'll save you from looking foolish in front of your man and his friends too. \n\nWhy tell this here? OP next time you see stuff like that, just be cool and calm and go over and get your hand on his heart. If he's vibrating with enthusiasm then you know he's turned on and on the hunt. The thing is even if he was banging this girl before for even a whole, it would have to be for QUITE a while for him to be cool as a cucumber while infront of you. Anyway it's not an easy thing to hide and gives you grounds for an immediate and full frontal right there e.g. \"Everyone out now, party is over. BF and I need to talk.\"\n\nAnyway just my two cents for OP and others for the future.",
            "You'll get back to him in no time. Or you'll secretly pine for him when you meet Mr Dependable Guy"
        ]
    },
    {
        "post_id": "4m0gq3",
        "author": "Punchdrunklady",
        "title": "[UPDATE] Me (21F) with my boyfriend (24M) he wants me to cut off contact with his brother because he defended me in an argument.",
        "url": "https://www.reddit.com/r/relationships/comments/4m0gq3/update_me_21f_with_my_boyfriend_24m_he_wants_me/",
        "score": 2680,
        "num_comments": 285,
        "created_utc": 1464774531.0,
        "selftext": "Original Post [https://www.reddit.com/r/relationships/comments/4lubms/my_21f_with_my_boyfriend_24m_he_wants_me_to_cut/]\n\nHi everyone. \n\nFirst of all, as I said in my edit on my original post I want to thank everyone who offered advice and support. I was amazed at the huge response I got, and while I couldn't reply to every comment I did read all of them. \n\nAfter R texted me, I replied to him asking if he had known my BF to behave like this with other girls in the past. \n\nOver the course of many texts it came out that he often yelled at and belittled his previous girlfriend in front of others, and some of his friends and family had suspicions about how far he was taking it. \n\nAfter the break up, the girlfriend posted some stuff on Facebook about how BF had hit her, said awful things to her and did other things like spying on her and deleting people from her phone behind her back. \n\nInitially when this happened R and his parents questioned BF, but he insisted that the physical abuse accusations where not true and that his EX was saying those things to cover up the fact that she had allegedly cheated on him. BF admitted to yelling at her but he told his family that she did the same and just as often. \n\nHis family eventually accepted that, but R and his parents were always wary of BFs behaviour and R in particular had made a point to keep an eye on things. \n\nBFs ex apparently had also called R around 6 months after myself and BF had gotten together and asked him to help me if anything happened. At the time R was not quite ready to believe BF would physically abused anyone, but he told her all the same that he would watch out for me or any other girl in the future. \n\nR told me that after the way he saw BF behave at my party he became more convinced that BF was likely to get physical and that was why he chose to step in. He also told me that even if it didn't go that far, I should not put up with how BF treated me. \n\n\nI agreed, what R had told me, and all the information and support I recieved here had me pretty convinced that I was not in a good situation. I decided to go and stay with R and his roommates for a short time. \n\nI don't have too many other options for accomodation this urgently. My parents live too far away and the few friends I could stay with are other girls with enough on their plate, and I didn't want to risk bringing this drama to their doorsteps. In retrospect I'm glad I chose to go to R's, because I feel like what followed could have been even more frightening and dangerous if only myself and another girl had been present. \n\nI didn't have much time to get my stuff together before BF was due to arrive home, so I packed a few bags of essentials and valuables, along with my school things, and R picked me up. \n\nI left a note at the house for BF I was leaving and that I did not plan on returning, other than to retrieve the rest of my things. I didn't tell him where I would be staying and that I would rather he didn't contact me directly, suggesting he communicate through his mother instead. \n\n\nI got to R's and got settled in, while choosing to leave was difficult and I had a few bouts of crying, I also felt immensely relieved. \n\nR/BFs parents came around and brought some dinner. They were incredibly nice about everything and told me I had to do what was best for me. We always got along well but I never expected them to be so kind and supportive given the situation.\n\nHalf way through dinner, my phone rang. It was BF. I did not want to answer it and everyone else agreed that was probably a good idea. After my phone rang out, R/BFs Mum's phone began to ring. Predictably enough it was BF calling. His dad answered the phone, the phone was not on speaker but BF was loud enough that you could hear him yelling down the phone. \n\nI couldn't tell exactly what was said, but his dad was telling him to calm down, and not to do something. BF hung up on him, and R/BF's dad told us BF was coming to R's place, and saying this was all R's fault. \n\nR started to get a bunch of text messages from BF making threats and telling R that he knew I was there and ha was coming to get me. R replied to him saying that if BF came here and caused trouble he would be calling the police, but BF ignored him. \n\n\nBF showed up at R's probably 15 minutes later. He drove up the lawn and almost hit the letterbox, and got out of his car and started yelling. R and his dad went out while I stayed in the front room with his Mum. BF yelled for a while and was kicking at random parts of the garden. \n\nBF started to yell towards the house that he knew I was there and to come out. I wasn't planning on coming out at all and R told him to leave. \n\nBF ended up running around the side of the house to the back patio entry, the screen door was locked but the solid back door wasn't, and he started hitting the fly wire trying to break it. He kept yelling into the house that he knew I was there and that if I didn't come out, he would destroy all my stuff and log on to my school accounts and cause problems on there. \n\nR and his dad caught up to BF and started pulling him away from the door, BF started throwing punches and his Mum and I both went out to the inside of the back door, because we were worried someone would get hurt. \n\nBF saw me and started trying for the back door again, and saying if I didn't get in the car he would kill himself. His mum said she was going to call the police. \n\nBF/R's dad ended up hauling him out to the front yard and told him to leave. \n\nBF did eventually get into the car, he spun his wheels and tore up the grass and drove off. \n\nI felt pretty awful after all that. His mum and dad were both visibly really upset and R's rental property had been messed up and I felt responsible, they were still so nice about everything though. They really are wonderful people. \n\nI spoke to the police and they said they would be speaking to BF about what happened and I got some advice about obtaining a VRO and making sure I could find away of retrieving my stuff from the house, so that is all ok for the moment. \n\nThe latest news is that BF has been all over Facebook saying that R and I had been having an affair and posting all these random cropped blurry porn pictures from the Internet saying it was us, and that he had caught us in the act. None of us are responding to any of it at this point, haven't really decided what to do there. \n\n\nMy plan is to stay with R for now. It's still my best option and R has said he won't leave me alone at the house in case BF comes back. Either he or his male roomate would be there, we also spoke to a couple of the neighbours that R is friendly with and they said they would keep an eye out for his car or call us if they saw anything dodgy. \n\nI'm at a bit of a loss as to what to do next. I'm planning to talk to my uni about getting in to student housing, I'm planning to go out tomorrow to buy some pepper spray also. I'm tossing up about reaching out to BFs ex, but I'm not sure if that will cause more problems for everyone. \n\n\nSo I suppose that's it, for now at least? I'm sorry that this was a bit of a novel- but I know a lot of people wanted an update and considering how nice everyone has been I wouldn't want anyone to worry that I had gone back/stayed with him. Rest assured that is totally out of the question, the more I think about things that happened within our relationship with this new perspective, the more I realise how fucked up some of those things were. \n\n\nAgain a huge thank you to everyone, I'll do my best to keep up with the comments and respond to any PMs \n\n\n\n   \n**tl;dr** left BF, staying at R's. Lawn traumatised as a result ",
        "permalink": "/r/relationships/comments/4m0gq3/update_me_21f_with_my_boyfriend_24m_he_wants_me/",
        "comments": [
            "your ex's family sound like great people. I am glad that they are supporting you and you are safe before he got a chance to get physically violent against you, which would have happened eventually if you stayed. Maybe you can file for a restraining order against your ex.",
            "Firstly, props to all the people who called it originally, and to you for listening. You made the right choice. \n\nSecondly: **change your passwords!** Also, run a security scan to check for keyloggers and whatnot. Check your phone for tracking apps too. ",
            "When an ex's *parents* even tell you that you did the right thing by leaving them, you most definitely did the right thing.\n\nYour next step should be to get that restraining order sorted ASAP. Your ex is a dangerous man who won't let this go without a fight, so you need the protection of the police if/when he comes back. With regards to Facebook, block him. Don't concern yourself with what he's posting. If people choose to believe him, then you're better off without them in your life too. \n\nYour priority is to stay safe and get him out of your life 100% - and this may unfortunately mean cutting contact with his lovely parents and brother. It's wonderful that they're helping you and being supportive, but unless they completely cut their violent son/sibling out of their lives, you continue to put your safety at risk by remaining in contact with them. If they're as nice as you say they are, they'll understand.\n\nGood luck, OP. I'm relieved to read that you're safe.",
            "I am so touched by the actions of everyone involved in protecting this girl. The brother, the parents and the so thoughtful ex girlfriend who tried to protect the next girl, just bless her.\n\nBest of luck to you in everything OP.",
            "If you are close with your parents you should definitely let them know about the situation. Friends too. Your bf might contact people close to you asking to get you to talk to him or lie and say that our were having an affair.",
            ">BFs ex apparently had also called R around 6 months after myself and BF had gotten together and asked him to help me if anything happened.\n\nShe's good people. And clearly your ex was abusive enough that she was very legitimately concerned about what he could do in future to someone else. It might be cathartic to discuss things with someone else who has experienced ex's behaviour, but you might also want to move on and forget about it, or she might, as she contacted R quite some time ago? Maybe wait for things to settle a bit more and you can think over whether you want to do that.\n\nYour ex's family sound like lovely people, and hopefully the fact that your ex's own family is testifying that he got violent trying to get to you and threatening to hurt himself if you didn't do what he wanted will negate any lies he manages to spin for the police about none of this being his fault. Definitely sort out a restraining order ASAP! This is exactly the sort of situation they're for.\n\nAlso I know you're a bit overwhelmed by everything that's happened right now, but it might be a nice idea to think of ways you could thank R for stepping in and giving you a place to stay. Maybe helping to sort out the damage caused by your ex's tantrum or taking over some household duties? \n\nI'm glad you got out of there, OP :)",
            "Wow. So your BF really was a psycho.  What an amazing family to support you like that. It must be hell for them to have to see their own son act like this. \n\nI would advise you protect your school and social media accounts by changing passwords just in case your BF makes good on his threats.",
            "[removed]",
            "...how did such a badass family produce such a flaming reject of a son?!? \n\nOP, you're handling this as well as it could be handled. Do get a police escort when you go back to retrieve your stuff, if possible. \n\nAs for the Facebook posts...meet with a lawyer. Print off any posts he's making about you and bring them. Ask them to draw up a cease-and-desist letter and have it mailed certified. Usually that scares people into shutting up, and it's WELL worth the money, if you've got it. \n\nBest of luck, and THANK GOD this family has sense. Stay safe!!",
            "OP, really glad you're away from your ex now, you absolutely made the right choice.\n\nI know you said you felt guilty when your ex was leaving as his parents looked really upset, but that's 100% not your fault. His parents are upset that their son is a terrible person and an abuser who was willing to throw punches at his dad and brother to try to get at you. Good luck getting the VRO sorted out and getting the rest of your stuff back.\n\nI would definitely reach out to his ex to at least thank her, since it sounds like a lot of R's vigilance came from her request to him. You don't need to make it a public thing, but it would probably make her feel better to know that she helped someone else by speaking out.",
            "I've been watching this for updates because I was seriously SO concerned for you.  I'm so sorry you had to go through that, it sounds absolutely horrifying.  I can't help imagining this guy trying to break into his brothers house, breaking the screen to try to \"retrieve\" you.  That is traumatic, honestly.  So glad you are with R and his other family, exBF is psychotic and hopefully that outburst showed them really how far he was willing to go.  Please be safe OP, hoping that your future is clear of him.  Thanks for the update, happy youre moving in the right direction.",
            "> tl;dr left BF, staying at R's. Lawn traumatised as a result\n\nSorry, it's not an ideal situation but your tl;dr had me laugh out loud.\n\nR and his parents sound like good people, so it's a little disturbing where your ex bf got all his abusive qualities from. \n\nScan for key loggers and the whatnot, backup your school data again if you can and change your passwords. ",
            ">I felt pretty awful after all that. His mum and dad were both visibly really upset and R's rental property had been messed up and I felt responsible\n\nThere's no way you were responsible for any of that - all you did was go to R's house and stay inside. Your ex caused his parents and brother to be upset, your ex ruined the lawn and kicked at the door. No one in the world would ever lay any responsibility for that at your feet. Every single person has the right to leave an abusive relationship and go somewhere they feel safe, and that's all you did.\n\nSo glad for you that you're out of this terrible relationship and I know it's difficult and traumatising but it sounds like you've got the support of R and parents and you'll be okay. Look after yourself.",
            "Most people on here have great advice about your situation, I wont repeat anything but I will add on on piece of advice:\n\nWhen buying pepper spray, do yourself a favor and buy 2.  Take one out to an open field or something and get used to spraying it. Learn to pay attention to the wind and how far the spray goes and how to avoid it.  Pepper Spray is tricky and the publicly available ones can be real pains to work.  And I've seen so many stories of people using it and doing more damage to themselves than their attacker because the wind sent it back in their faces or they sprayed it in close quarters or what have you.  If you're going to have it learn how to use it so you can really be safe",
            "[deleted]",
            "I'm so glad you managed to get away from him and that his family were so supportive!",
            "Follow up on the restraining order and contact your university police to let them know what's happening. They often will provide escorts on campus in situations like this especially to and from your car. \n\nYou may also want to contact your advisor or any professors you have currently that he may know as he might try and contact them to negatively affect you. \n\nDocument *everything* and next time he shows up to R's or somewhere you are, call the police immediately. It went way too far last time. \n",
            "Change all of your passwords on everything, right now. Ask the police to escort you to get the rest of your things before your ex tears them up. DON'T ask R to do it - you need police there in case bf starts trouble and you don't want R to get accused of anything.\n\nSounds like this guy comes from a great family. I wonder what the hell is wrong with him?",
            ">The latest news is that BF has been all over Facebook saying that R and I had been having an affair and posting all these random cropped blurry porn pictures from the Internet saying it was us, and that he had caught us in the act. None of us are responding to any of it at this point, haven't really decided what to do there.\n\nThis made me crack up.  Keep ignoring it.  Let him make sure he looks like an idiot to *everyone*.",
            ">He kept yelling into the house that he knew I was there and that if I didn't come out, he would destroy all my stuff and log on to my school accounts and cause problems on there.\n\nWhile chances are your stuff is likely destroyed, you should be changing every password ever if you haven't already. And to be safe, you should change them on a device that your ex-boyfriend had no access to. I wouldn't put it past this guy to install some sort of keylogger onto your stuff which would give him access to the new passwords. ",
            "After finally leaving an abusive relationship, my abuser's \"psycho, lying ex\" reached out to me and it was a rather cathartic experience. I was able to speak with her and confirm that the lies he claimed had actually been the truth, and his claims of her abandoning him was exactly what I had done myself, going no contact to escape the abuse. Even though we didn't stay in contact for long, it was extremely reassuring that I wasn't alone, that I wasn't crazy and that my reactions were warranted. \n\nGiven that the ex in this situation was even looking out for you and made sure R had your back, I think reaching out to the ex, at least for a talk, would be a good idea for your own healing process.",
            "Contact your university and tell them that someone malicious may have control over your account and they will help you get through that.\n\nIf you're going out for pepper spray, make sure more than one person is with you. If you don't want to go out, I have Amazon Prime and would gladly send it to your location; it would take two days to get there.\n\nIf you want to go back to your ex's place to get the rest of your stuff, ask a police officer to escort you. I've learned from this sub that there are many officers who would gladly escort someone to keep an eye on them while they get their things to avoid any kind of confrontation that may happen. And if something *does* happen, then your ex will be arrested on the spot.\n\nAs for the facebook post, that's entirely up to you. Either you can make your own post or you can just ignore it. I'm a very petty person so I would have made my own post saying \"Funny how, even though (name) is now my ex, his entire family has rallied behind *me*, despite his claims of my infidelity. The truth of the matter is that he is abusive and controlling, and there are plenty of witnesses to back me up on that. Also, thanks, (name), for using those porn photographs to depict me. I'm flattered that you would compare my body to someone whose profession is to look beautiful naked. However, that is not my body! Stop spreading lies, and get help!\"\n\nThat is not advice, though. That's just what I would say.\n\nGood luck, OP! I'm so proud of you for recognizing your situation and leaving. You'll definitely get through this.",
            "Change all your computer passwords especially ones that exBF knows!\n\nClose any joint accounts or utilities in your name! Or any accounts including credit cards that exBF might have access to use. Do you need to get new credit or bank card numbers?\n\nContact and inform your school. Find out if you need to inform multiple places.\n\nGet an RO so exBF can't go to your school, your friends or R's. Keep an eye out for BF for the next while. The photo thing is absurd and unreal but could it mess things up for you for your next BF or job application? If you contact fb, etc. with info of his verbal attacks and now attempted physical attacks on you, I think they have to take it down, right?\n\nDefend R's and your honor on the internets, where exBF can't see!\n\nThank the ex, that was so sweet of her! It's touching. It was so the right thing for her to do.\n\nThank R's family, they sound great. They are so decent and responsible!\n\nHang out with R and his board game playing roomies. I'm glad you have these people around to restore your faith in humanity. It's great that one of them is R's back-up for you.\n\nHang in, OP. I'm sorry this happened. You're doing absolutely the right things. Sadly, it was better that you found out now. No one deserves that treatment from a BF. Please go to therapy ASAP to process this experience and to learn more about red flags! \n\nBest luck! Enjoy some of the nice weather.",
            "I was waiting for your update. I'm glad that you are safe with R and that the ex BF's family is so supportive.\n\nI would reach out to your friends and family who ex-BF might contact to let them know of the situation. The last thing you need is for them to accidentally let you know where you are, and you are alone at the time, and he try to come after you. Although it may worry your parents, they should know the situation that you're currently in and they may be able to offer additional support, even though they are far away.",
            "Staying with R is really not your best option.  Its only escalating the drama, plus your bf knows where you are.\n\nGet a restraining order, Go stay with a friend.  Don't tell anyone where you are.",
            "This is great to hear. I was so worried about you. ",
            "i don't have much to say except well done, so far you've done everything right... and that the facebook thing is HILARIOUS because i'd say most people wouldn't post nsfw \"evidence\" of an affair all over their social media pages and i bet loads of people, even without hearing your side of the story, would think he's a dickhead for doing that.  \n\nalso please change all of your computer passwords immediately!! regardless of whether or not you think he knows them. best to be safe!",
            "Thank god you ended it. In addition to talking to your Uni about housing, also let campus security know about the threats. They might not be able to do anything until you get a restraining order, but its useful for them to know that he will stalk you and destroy other people's property.",
            "Wow.  Everyone in the situation except your ex sound like lovely people, including your ex's ex for asking R to look after you.\n\nYou did the right thing by leaving.  The lawn can be replaced- you can't.",
            "If i were you, i would scan my computer for a keylogger. Then change every password. ",
            "Uh, if you were MY friend, even if we weren't that close, I would totally want you to tell me and I would make sure you had a place to stay using all the resources available to me. \n\nFriends, family, neighbors, and people in our community -- that's what they are for! To help you through the rough parts of life, mistakes, tragedies, abuse, and so forth. \n\nTell your friends and let them help. ",
            "Stay safe and I'm so glad his family is not sticking up for him. We see too many stories of that here.",
            "I'm so glad you left. That dude is nuts. ",
            "Called it; as much as I wish I hadn't. I've had similar happen; I moved in with my neighbor and my ex started spreading rumors that we'd been cheating on him for like a year.\n\nDon't worry. When someone is spreading that much vitriol it's usually really easy to see through - all of my friends saw through it, and I kept a lot of our mutual friends and he pretty much has no friends (also he's now in prison for abusing his next gf.)\n\nIt won't hurt you to reach out to her. If you're feeling weird about how he changed over time, it's okay and comforting to ask her, \"was he always like this?\" I did this for my exes ex after he got sent to jail for a domestic altercation and she said it helped so much to know that she is NOT the crazy one and she did NOT \"make him like this.\" He was always like that.\n\nThank your lucky stars his family has been keeping an eye on his behavior. They're good people. Let them help you for now. You got out of this early enough that you're going to be just fine. Go to counseling if you think you need some help sorting out this crazy mess, but make no mistake - there is no rhyme or reason to an abusers behavior, so if you want to understand \"how could someone be like this??\" There's really no solid answer to that question. So people are just bad.\n\nYou can find a pdf online of a book called \"Why Does He Do That\" - reading this helped me way more than counseling could have. Best of luck, you're going to be fine. You know what kind of red flags to look for now in relationships and always keep a supportive social network around you. It is so hard to get out of any bad situation without one. ",
            "Looks like your 21st birthday was a blessing in disguise. You finally found out what turd your ex-BF is. No man should ever treat woman like that. and Vice versa. He has no respect. Who the fuck does he think he? He's an immature brat and has some serious mental issues. \n\nI think one thing you should do is document everything. Including videos of his tantrum. Perhaps even if you showed his tantrums he might be able to conquer his demons through his therapist. Just because you dodged this turd doesn't mean the next girl he meets is as lucky. And while it's not your responsibility to help him with his demons, it's also a crappy feeling knowing you could have prevented the next girl from an abusive relationship. \n\nWish you the best! ",
            "You absolutely did the right things, getting away, getting safe, going through the authorities to get the rest of your stuff back.\n\n And re: what other people have said, definitely hide your social media presence from him as much as possible and follow up with the police about possibly getting a restraining order.",
            "I would talk to the ex of his so you know what further to expect with his actions. I'd move forward with a restraining order also and the cops to help get your stuff. If you want do a well written post on fb explaining the situation if you want people to know to help counter over what crazy ex is posting. You don't owe anyone further info if you don't want too. Expect bs to come from his friends and whoever so be ready to block them also from your social media. Pepper spray and not traveling a lone for a bit might be a good idea. ",
            "I'm sure there is no doubt in BFs family's mind now as to what he is capable of. They sound like wonderful people. Make sure that campus security is aware of the situation if you move there. Listen to the combined wisdom of the lovely folks here about restraining orders, passwords, etc. Get a police escort if you can when you retrieve your things.",
            "In terms of what to do next, go speak to student counselling/assistance services at your uni. They can put you in touch with resources like free/discounted legal advice to pursue a restraining order if needed and also likely help you with alternative housing options. It can be hard to get into uni housing in the middle of a semester if it's all booked up, but if they know that you're in an emergency situation because you're leaving an abusive relationship, they will hopefully be able to set something up for you.\n\nYour university has resources for people in tough situations just like you are now, don't be afraid to use them, and be very proud of your own smarts, strength and bravery in recognising this was a bad situation getting out so quickly and decisively. You did good and you will be just fine going forward! ",
            "Be sure to practice your method and technique with using pepper spray. A self defense weapon only works if it is used effectively.  Familiarize yourself with the safety mechanisms, trigger, and practice drawing and \"firing\" with a pepper-spray-sized object.\n\nIf you're ever in a situation where you need to use it you don't want to be reading directions or holding the can way out in front if you where he could snatch it.  Be informed and educate yourself so you'll be prepared.",
            "So glad he's your ex now. Start looking for a new place to stay and make sure Ex has no idea where that is. Save all threatening texts, document all his outbursts and incidents where he threatened you and R. Use all of that to get a restraining order.",
            "SO glad you got away from him. That took guts, girl. Stay brave and watchful.",
            "You should have recorded his outburst to show the courts. (especially all the threats)\n\n\nThen you could have simply posted that outburst on facebook and people would realize how crazy he is and pay no mind to his rumors about you and R.\n\nThe cops should have been called before he showed up to the property.\n\n\nNext time, dont wait until there is a man banging on the door to call the cops.   Call them when he says he is coming over so they are there to welcome him. ",
            "Hey, OP. Echoing everyone else on how awesome it is that you got out.\n\nDoes your bf know your school schedule? You may want to alert campus security that this happened and get an escort to and from classes. ",
            "I'm glad you made it away safely.\n\nAs far as the Facebook thing, it would probably be best to have one or both of his parents respond to the accusations, if they're amenable to that. As neutral third parties, a denial from them would have a lot more credibility coming from them than it would from either you or the brother.",
            "Oh god, that must have been super scary. I'm so glad you got the full support of R and his family. Would you live alone if you entered student accommodations? I'm kinda worried for you living alone. Your ex is crazy; who knows what he may attempt.\n\n\n> BFs ex apparently had also called R around 6 months after myself and BF had gotten together and asked him to help me if anything happened. At the time R was not quite ready to believe BF would physically abused anyone, but he told her all the same that he would watch out for me or any other girl in the future. \n\n\nThat's really kind of her. I'm not sure if you should reach out to her right now, but maybe send her a note of thanks or ask R to pass it along. She helped to make R more cautious around his brother, which ultimately helped you.",
            "I'm so glad that you left, OP. I know things are still very dramatic and potentially dangerous right now, but you're out and you're resolute about it. That's really great.\n\nGod bless the ex-girlfriend. I don't think there would be anything wrong with you contacting her, if you feel it would help you in some way (or if you just wanted to thank her). The thing with domestic violence is that people are very often not believed and very often begin to doubt themselves. I think the ex would appreciate some affirmation that, yes, this guy was terrible and that yes, he pulled the same shit on you (even down to the accusations of cheating). She was worried enough about you (without even knowing you) to contact her abuser's brother and that says a lot. I think she'd like to know that R followed through on looking out for you (and will likely continue to look out for future girlfriends) and that you're okay.\n\nIn terms of what you need to do now/in the near future--change all your passwords to prevent your ex from fucking up any of your stuff online. If you think he had access to your school account, call someone at the school and talk about it to get things straight. Request a police officer to go with you when you pick up your things--most departments are glad to do this because it's better for them to prevent trouble rather than have to come out on a call after you've been attacked. You've also already got a paper trail going, so this should be very easy to obtain. Your ex tried to punch his father and brother, so a police officer is definitely a good thing to have in this situation. Follow through on the restraining order. Perhaps talk to someone at student housing about security--do they let in random people off the street or is a student ID required? Obviously make sure your ex doesn't have that address, but you might want to know what's likely to happen in case he somehow manages to find out where you live. Other than that, I think you're good. It doesn't seem that the ex has been harassing his ex, so I don't think he's going to turn into a persistent stalker. You're out of the relationship and you should certainly protect yourself (especially for the next few weeks/months), but I think you'll be fine.",
            "\nYou did awesome.\n\nEveryone here has given you good advice about changing passwords, documenting and saving everything. But I would like to add that I feel it would still be good for you to read Why Does He Do That. It might help consolidate everything that has happened, and help you recognise things and patterns that you may not even aware of yet. This can help you understand what to look out for in the future. I went through 20 years of abuse, and even now I still have moments of realisation of things I wasn't even aware of before. \n\nAlso, his family seem like decent people. **But there is a massive conflict of interest**. They have just had confirmation that he is a horrible person, and that's got to hurt them. They are going to be confused and in a lot of pain. Whilst they have helped you, they also still care about him, he's their son. They may always do the decent thing, but when he turned up acting insane, the police should have been called. Whilst they probably do care about what happens to you, there is also the possibility they think they can control the situation and avoid getting him in legal trouble. \n\nYou need to re-group, you have just been through something traumatic. But it might be wise to start thinking about moving on. Have you talked to your family?\n\nPlease talk to your Uni, please talk to the police, please keep everything on record, and when you are ready start looking for your own place. ",
            "Normally the phrase \"you dodged a bullet\" is a metaphor. I think you might have literally avoided one this time around. ",
            "All of this because you were jumping on a trampoline.... ",
            "I'm a little confused as to why R and ex's parents did absolutely nothing when your ex said he was coming over. That would've been the logical point at which to call the police. In fact, there were many, many points long before he started trying to break down the back door at which it would've been a smart idea to call the cops. I understand the choice to stay with R but you really need to think realistically about whether that's safe...they didn't do the smart thing when it mattered and pepper spray is not going to help you much with protection.",
            "Wow... batshit insane.  Glad you got away but I really feel like the restraining order is a good idea.  He seems to think he has the right to control and do what he wants with you, like you're a piece of property or something.  I'd personally be carrying some pepper spray etc as well.  This guy is unhinged.",
            "Like I said on your Original Post, it speaks volumes of your ex's character when even his family is trying to save you from his abuse. Good for you for getting out of that situation before you were seriously hurt.",
            "This is an amazing outcome. I'm happy you acted and fast. I'm so glad his family is being this supportive and protecting you from him. RO and pepper are nice/necessary precautions. Continue to stay safe! ",
            "I'm glad to hear you're ok and that R and his parents are supporting you through this. Stay strong.",
            "I am literally so scared for you right now, but I know that you've absolutely done the right thing to go to his brother's house. His family are already aware, and clearly are really good people. I'm so glad you have somewhere thats at least a little safer than elsewhere. \n\nI would absolutely get the restraining order. ASAP. He isnt listening to reason, and has already crossed a huge boundary behaving the way he has. People like that just dont listen to you, but if the police get involved, then he may well listen to them.\n\nStay safe, I'm thinking of you. ",
            "Really wish his family had called the cops the second he rolled up. They seemed to know what was going to go down, and having the cops witness it, and probably have him resist arrest, would have helped getting a restraining order.",
            "I am very glad you have people like R and his family to help. Next time, call the cops the second your ex threatens to come over. Also, if he threatens suicide, you and his family can have him committed for a 72 hour watch where they will make sure he is not a threat to himself. ",
            ">The latest news is that BF has been all over Facebook saying that R and I had been having an affair and posting all these random cropped blurry porn pictures from the Internet saying it was us, and that he had caught us in the act.\n\nHe can't control you anymore, so his only option is to try and control how others see you.\n",
            "Your exbf's family don't seem particularly surprised by this turn of events. It might be a good idea to have a serious conversation regarding his mental health history. Full and Frank disclosure as it were, because you really need to know what you're dealing with.\n\nWhen you do, please be as  gentle as possible. Smart money says he has been putting his family through a sort of hell for years. Re-reading your posts, it seems this may be very much the case. \n\nYou must do what it takes to choose safety. \n\n\n\n\n\n",
            "Better the lawn than you! Glad that you are away from him, and safe. Please don't let your guard down!",
            "If you ever doubt your decision. Read this post again. Make note of how the physical aggression increased in the short time since the last time.",
            "Good job. You did exactly the right thing and removed yourself from a very dangerous situation.\n\nIf you have the option to do so, please take it as far as you can with the police. For the exes he has hit in the past, for you, and for the poor girls he will meet in the future and undoubtedly will be abusing.",
            "I am so, so glad that ex's family are being supportive. Stay safe, be kind to yourself, and remember that absolutely none of this is in any way your fault. ",
            "I'm glad you're safe.  I'd like to encourage you to try to find other arrangements as soon as possible though.  The family seems lovely and you can repay them, a little, by not being a burden.  You may also not wind up being the last woman they have to rescue.  ",
            "I'm glad to see you left him! I commented on your other post that I had left an abusive relationship myself. I don't have the time to read through some of the comments here yet (will later) but just wanted to give my two cents on contacting the ex. Honestly I don't think it's a bad idea to do so if you want. She asked R to look out for you, I'm sure she's probably more than ok with letting you know what happened in her situation ect, IF you can be 100% sure her name will not be brought up to your now ex. Since she's reached out to R yea you could tell him you spoke, but I wouldn't even mention it to his parents either. ",
            "I kind of wish you were having an affair with R now, he seems like a great guy.\n\nI realize I don't know you at all, but I am happy that you are safe, and have people around you to support you during this insane time. No one deserves what you and bf's family are going through right now, and don't forget it's all bf's fault. ",
            "You changed all your passwords, right?",
            "I do have one piece of advice that I haven't seen so far:  Do not get into a relationship with R. ",
            "glad youre safe, but i think its best for you to get away from the whole family in general. R and his parents sounds like great people, but pitting them against their own brother/son has got to be tough on everyone. But i hope everything turns out okay! good on you for being strong.",
            "The drama sucks, but leaving an abusive partner is usually nothing less than dramatic.\nThe important part is you got away and you're not rekindling anything with him. His family's support for you is an huge plus. Take care.",
            "> I'm tossing up about reaching out to BFs ex, but I'm not sure if that will cause more problems for everyone. \n\nI would.  If only to thank her.  She did you a massive solid imploring your BF's brother to look out for you.  Speaking with her will give you both some support.  \n\nI don't think it will cause any problems because there is no chance she is on speaking terms with your BF.",
            "#TAKE PHOTOS OF THE DAMAGED HE CAUSED\n\n#TAKE SCREENSHOTS OF ALL THE TEXT MESSAGES HE SENT  \n\n#GET ALL THE PROOF YOU CAN RIGHT NOW  \n\nyou might not end up using any of it. BUT YOU NEED TO MAKE SURE TO GATHER IT SO YOU HAVE IT\n\nmaybe to use for the restraining order. maybe to use as proof that he was lying about the affair. ",
            "I didn't see this posted yet, but as long as you are staying with his brother and/or knowingly contacting any of his family, it's going to antagonize him. I definitely mirror how great they are being to you, but right now I would do all you can do be as far away from this potentially dangerous situation as possible, even if that means stepping away from his family who has been really nice to you. Your ex is an irrational person, and I really can see that you staying at his brothers just making this more dramatic and scary for you. \n\nWent through an abusive break up myself, and unfortunately breaking ties with all his family and our mutual friends(friends I considered my own by that point) was just something I had to accept in order to get away from his abuse. It's not right and I shouldn't have had to, but it wasn't worth the anger and terror it caused by keeping in contact.\n\nGood luck.",
            "R seems like a really great guy. He clearly cares about his brother, but doesn't enable his abusive behavior. He probably feels sorry for getting you into this, the same way you do (since technically he could've warned you off earlier, I don't think he was negligent but abuse tends to make those involved feel guilty even if they did nothing wrong).",
            "You are amazing and strong and R and his parents are wonderful people. I'm so glad they were there for you. \n\nAlso, your tl;dr was the best ever. ",
            "I'm very happy you got out OP, and are with good people who have your best interest in mind.\n\nI am also incredibly surprised by their restraint. If either of my younger brothers was making threats to their SOs in front of my face I would beat the ever loving shit out of them, and my dad would as well. I don't know how your family stayed so calm.",
            "[removed]",
            "Just a heads up, OP, I'm not sure if you're Australian or British (or NZ) from your post, but either way while it seems like a great tool, pepper spray is illegal in all areas but Western Aus. This is generally forgotten or not known by a lot of people. \n\nIt's really good that R is being super supportive and his family is helping you get away from BF. Don't forget that a lot of womens shelters have resources to get out of abusive relationships. Your uni would also have information, and most likely a legal aid centre. \n\nHoping that everything works out okay. ",
            "[removed]",
            "Hey hun, just letting you know- if you decide to get pepper spray, that counts as a concealed weapon in at least a few states. You would need a permit to carry it if that's the case. Please check your state/local rules! I wouldn't want you to get in legal trouble for defending yourself :)",
            "op where do you live? I live in western Canada and if you're anywhere near there is a spare room here for you, even if you just need time away from your city for a little while. ",
            "I'm so glad you chose to leave. It takes a lot to make that decision when you're in an abusive relationship, and unfortunately many choose to stay. You're incredibly brave and strong to have chosen *you* in the relationship. And R sounds amazing. His parents should be proud. \n\nI would reach out to the GF also. The fact that she told R to watch out for you and be there if you need him is important. Even if it's just to thank her for that. ",
            "HOLY SHIT. He did all that in front of his own family!? He either has no shame, he sees nothing wrong with his behavior, or he's just flat out crazy. Please do everything you can to protect yourself from this psycho!",
            "So glad you're okay. Thanks for the speedy update!",
            "I have always thought it was horse shit how families will cover up for their kids but I have also met girls who would still date them despite all the warnings. Luckily you broke it off when the warnings became clear. Maybe your ex will end up in jail to get help with is rage. He might have a drug or alcohol problem. ",
            "I am so glad you made the choice you did. It may not matter, but there are a lot of people who are proud of you for being strong here. \n\nHopefully if someone else is in a similar situation, they will see your posts and be as brave as you have been. His family is wonderful and I hope you plan on staying in touch with them in the future.",
            "I am so, so glad you are away from him now! Please be safe, it seems like you're in good hands.",
            "Sounds like his family need to get him some help, ASAP. Glad you're out of there and hopefully things turn out for you.",
            "Your Ex shoud be in a mental asylum. \nShoud have gone for the brother but bad luck.",
            "I'm so happy for you!  It's going to be tough in the beginning but it sounds like you've got some terrific people to support you (and special props to his parents for not being all \"No, my perfect snowflake could never do that!\").  \n\nThis guy sounds like he might approach your friends/family.  If you're comfortable doing so, you might want to contact them and warn them, and tell them how you'd like them to respond to an approach.\n\nFinally, try filing a police report re the threats and property destruction.  Even if they don't/can't act on it just yet, it can't hurt to already have a documented history of his previous transgressions",
            "BF is phycho... when I hear about people like this, I just hope they don't end up hurting someone.  This dude sounds like he's going to end up in jail or a mental hospital.  \n\nI'm glad you have support to break away from him OP. Thanks for the update. ",
            "Going forward, I suggest you keep an eye on your privacy settings, in case he stalks. Up your settings, if you rent be wary of things that hold addresses. You sound like you're not in the US (\"mum\"), but we have a website here called White Pages, you can look up most anyone. Make sure to try and hide your information if you have anything similar, just in case (when you move, etc). Congratulations on getting out, it took a ton of guts. I hope you stay safe. ",
            "Make sure you change all your passwords!",
            "Sorry for how tough that went, but good for you in sticking to your guns and doing the right thing for yourself. I would advise just making a facebook post for your friends only vaguely explaining the situation to squash the rumors that he is spreading. If anyone believes him over you, they are not your friends, end of story.",
            "I just want to add to these comments to say you did amazingly in this situation. Many people wouldn't have had your strength. I hope things get better and better from now on.",
            "Well, props to R, he really pulled through here and did the right thing, his friends and parents too, there aren't many people like that, on this sub we're more used to family being the problem, you got really lucky, this is the type of people you want to be around with. \n\nNext up is the clean up, document EVERYTHING, change your passwords, think about getting legal advice, and look ahead, good luck!",
            "OP I am so sorry you're going through this, but it's great that your ex's family is so supportive. \nR seems like a great guy and really cares. ",
            "Screen shit his Facebook posts and sue him for libel. At the least they'll help you with the restraining order. ",
            "So your abusive ex boyfriend goes into a rage about his brother, and your solution is to go live with his brother and have his family take care of you? Yeah, that sounds like a great idea. I know you think you may be inconveniencing your other friends, but this is the situation where friends will show you why they're your friends. Thank R for his help, and its time to move now.",
            "You are very fortunate for his family to be so great and nice about everything. The same thing happened to my sister with her ex-fiancée. She wasn't ready to listen to those red flags though and, unfortunately, the ex-fiancée attacked her and scared the hell out of my 8yr old niece. (My niece didn't see what happened. She was in another room and just heard loud noises, and then was yelled at by the ex-fiancée) To top it all off, the family of the ex refused to believe that their daughter would ever do something like that. Just took her back home and asked my sister to consider dropping the whole thing, like she was over reacting. Again, it is really awesome that his family is able to see their son for who he is and to support you in this awful situation.",
            "That was honestly so scary to read, I can't imagine being in it. What a horrific situation (for you as well obviously) but his parents...imagine huddling in a house protecting this girl you admire from your own abusive, manipulative *son*. They are truly great people, as well as R, and even his ex! Ringing R up to tell him to look out for you is a truly wonderful thing to do as well. It's shit right now but you have so many wonderful people around you, good luck. ",
            "Get the cops to go with you when you go back to get your stuff. ",
            "Oh my god. That sounds so terrifying. How are you after all that? \n\nI'm so glad that R and his parents are such good people, even if your ex isn't. If you can, get yourself a taser as well. Pepper spray is effective, but having both might help you feel more secure. Also, tasers are loud, which can help more when trying to scare someone off. \n\nStay safe, OP. Block him on everything, and don't ever tell him where you are. Student housing sounds like a good idea. Security and roommates to keep an eye out.  ",
            "It was very clear from your last post that your boyfriend was emotionally abusive. I'm so happy to hear you are safe, and so happy to know your ex's family consists of supportive, sound-minded people. ",
            "Glad you got the pepper spray. Sounds like you are handling this well. I'm sorry this happened to you :-/",
            "In my experience people are inclined to believe an allegedly abused woman over a guy. Sometimes that's horrible, but in this case it could work in your favor. I would post a succinct message on social media that you've escaped your abusive boyfriend, that he's trying to ruin your life and to advise people not to engage with him.",
            "Word of warning! If you're in the UK pepper spray is illegal. It's classed as an offensive weapon the same as a knife or something. You can't carry it round with you on the streets. Look into another form of protection that won't get you arrested!!! Something that can double as a weapon but isn't illegal to have in your bag.\n\n",
            "You should briefly mention on social media that your BF has become violent towards you and others and ask that people not contact him over anything about you, or at all. They are very likely to believe you. This is for protection, you don't need people reporting back to him any information that would allow him to further jeopardize your wellbeing.",
            "Thank goodness everything went relatively ok and you got out of the situation before too much damage was done. How are you feeling op? :)\n\n\nDon't go to retrieve stuff alone ok? And your ex's family is gold. Amazing people. They're heroes in the eyes of a lot of people right now. \n\nTake care and wish you all the luck!",
            "Good for you and good on your ex and his family. Many others have already said it all better than I could, but just wanted to add: please listen to them, keep yourself safe and also when you go get your things back, have a police escort.",
            "Reminds me of a whacko my friend used to date, complete with multiple threats of killing himself and all.\nYou're doing a good thing by getting out, it likely would have just gotten worse and worse.",
            "Wow, so so so glad you decided to listen to R & all of the posters here that commented yesterday (myself being one). I know I'm just some internet stranger but you don't even know the relief I felt reading your post. R saved you from being physically abused, for sure. He and his parents seem like wonderful people.\n\nWith regards to your ex-bf's behavior on social media - just ignore it. If you feel that it's absolutely necessary to address it (people are asking, etc) just say that there was no affair, that R alerted you to the fact that Ex had previously been emotionally/physically abusive with his girlfriends, and that you left him because you felt it was in the best interest of your safety. To your closest friends/family, tell them what you told us in this post so they understand what happened and won't give Ex your contact info (in case he comes to them spinning some crazy story of getting back together). ",
            "[removed]",
            "Change your passwords to everything use Rs computer to do it. Have someone who knows there shit wipe your devices incase he but key loggers on them. Let your collage department head know that your being stalked and harassed by a ex and your getting a restraining order and if he contacts them go let you know so you can keep the police informed about what he's doin. ",
            "Might be worth getting some guidance from /r/legaladvice , you seem to be on top of everything in terms of getting a restraining order and having started a paper trail by calling the police, but they might be able to give you further legal advice going forward, so that this doesn't affect your life any more than it has to.",
            "You dodged a huge bullet here. What a pshychopath.  ",
            "You sure your ex bf's brother isn't trying to get with you?\n\nedit: next update is going to be: \"me and R are now together, and ex bf won't leave us alone\".",
            "Ignoring all context, your boyfriend was worried about how friendly you were with his brother, so you text the brother 9999x and then go to live with him...",
            "Next time will you please use names instead of letters. Thank you",
            "Guy sounds like a controlling angry asshole, more than enough reason to walk away. \n\nYou mentioned that a lot of this stems from his EX saying that he beat her, which he denies, but his family believes is true and are now keeping an eye on him, which has made you additionally fearful but did he ever actually do that to you? \n\nIm trying to get into his mind set and see if from the other perspective, if everyone thinks you do something bad then treats you accordingly and interferes in your life with the idea it still going on, that could tinge everything with a lot of anger/frustration/injustice.\n\nEnd of the day if he is unwilling to talk to you calmly and rationally to work out an issues and your unhappy then you ending it was the right thing! ",
            "[removed]"
        ]
    },
    {
        "post_id": "pkae09",
        "author": "safeassign",
        "title": "*UPDATE* :My old classmate (M, 21) wants me (M,22) \"to put in a good word for him\" at my job",
        "url": "https://www.reddit.com/r/relationships/comments/pkae09/update_my_old_classmate_m_21_wants_me_m22_to_put/",
        "score": 2663,
        "num_comments": 123,
        "created_utc": 1631107245.0,
        "selftext": "Edit: WOW,  last time I checked, my post had been removed, only checked now to see all this. THANK YOU ALL FOR ALL THE COMMENTS  AND SUPPORT. MUCH LOVE! <3\n\nI figured I should make an update in case anyone who commented on my previous post  wanted to know what happened.\n\nMy previous post: https://www.reddit.com/r/relationships/comments/pbz4sp/my_old_classmate_m_21_wants_me_m22_to_put_in_a/\n\nAnyways, I got a lot of suggestions on what to tell him (Thanks for that) and I pretty much decided on 3 things.\n #1. Tell him to send an application on the jobs portal like everyone else. \n#2. Once he applied, I would \"put in a good word for him\" (I wasn't gonna say sh*t)\n#3. NOT give a single co-workers email, number, contact etc. To him. (I did send him to the company's page on LinkedIn, though, if he really wanted to talk to my co-workers).\n\nBacktrack, as we we're talking he started asking more and more questions about my job and just other stuff, eventually I found out he was sharing with other people our convo. Cause our mutual friend and others brought some of the stuff up to me out of the blue. It was no biggie, it's just i didn't want many people to know I got a new job before I was settled in and my ex classmate went and told people behind my back. Also during our convo i sensed a hint of jealousy, because he started to downplay my job and my employer and laughed when I brought up work stuff, yet he wants to apply to where I work only after hearing the pay? It just made no sense.\n\nSo yes what happened next.\n\nI told him step #1 and #2 but he insisted that I give him my co-workers contact info first and \"put in the good word\" then he'll pick things up from there. I said no...we went back and forth.\n\nAfter that didn't work he wanted me to apply for him. (His angle was playing dumb, and thought I knew it best).\n\nI said no he had to do it himself...he wasn't happy and tried to guilt trip me HARD. \n\nEventually I said, \"if you just apply I'll help with with step #2 and #3\" it was evident he was too lazy to apply.\n\nHe said \"are you gonna help me or not?\" (Convo took a turn)\n\nI said \"that's all I can do for now take it or leave, it's your choice\"\n\nThen he blocked me lol\n\nTL; DR update, ex classmate blocked me after I didn't \"put in a good word for him\".\n\nBut yeah thanks guys and gals for the advice.",
        "permalink": "/r/relationships/comments/pkae09/update_my_old_classmate_m_21_wants_me_m22_to_put/",
        "comments": [
            "He wants you to do everything from application to the actual job. Nope. He's a lazy fellow. You'll destroy your name if you let this kind of employee at your job who doesn't want to do anything.",
            ">ex classmate blocked me after I didn't \"put in a good word for him\".\n\nOhhhhhhhhhhhh well.",
            "Dude... if he's too lazy to apply why would he ever expect you to put your name on the line for him? That's the kind of idiot who makes your boss think you're an idiot by extension for recommending them.\n\nI've only recommended a couple of friends for jobs because in both cases I thought they would do really well there. Also in both cases, I made it clear that I was putting my reputation with my boss on the line by recommending them so please don't screw me over.",
            "Consider this a bullet dodged; whether or not you had put in a good word for him, if he'd gotten the job, he'd have made sure *everyone* there knew that you and he were connected, and then when he utterly and completely failed to *do* the job, that would have had an effect on people's opinions of you.\n\nThis is the best possible outcome given his attitude.",
            "Well done, you definitely got out lucky this time given that he didn't apply and you now have one less asshole in your life.\n\nAs a rule of thumb, never recommend anyone you wouldn't personally want to work with everyday. That pretty much means never recommend someone who wasn't one of the rare awesome coworkers that you've worked with closely for at least a year (some people are good at hiding crazy). You might be applying for the hiring manager someday and they'll remember when you recommended a person who was dead weight for the team. That manager will assume you're no better.\n\nYou've also learned an important second rule of thumb, which is never tell anyone who you don't trust 100% how much money you make. Money can make people weird and word gets around. Next thing you know you're at dinner with 6 friends and someone says \"how about you get the bill Mr. Moneybags?\". I'm telling you, that stuff is no fun unless you're really making so much money that you don't mind paying for everything for the rest of your life.\n\nYou're new in your career and people will judge you in part based on your work relationships and in part based on your judgement. If this dude had gotten hired and told everyone you recommended him, your prosperity at this place would have been in jeopardy. The friends worth putting your neck out there for are the same ones that you know for sure won't let you down. Friends like that are few and far between.\n\nAnd hey, congrats on the new job! It's not easy to find something right out of college that pays enough to make \"friends\" jealous! lol.",
            "Why do you even waste your time talking to this guy \n\nShoulda ghosted him a loooooong time ago",
            "How a person handles a no says a lot about their character, remember that.",
            "A grown-ass man asked you to *fill out a job application for him* and then is butthurt that you won't recommend him for that job??\n\nI tend to just assume people are shitty so I'm not often shocked when they are...but man, this dude is next level.",
            "Surround yourself with better people. Dude sounds like a waste of air. Happy to hear he threw a tantrum and blocked you lol.",
            "I got burned once recommending someone for a job.\n\nNow I only recommend (or hire outside of the normal interview process) people that I know are absolutely rock solid and will make ME look good when we work together.",
            "I'd be inclined to mention to your manager that ex-classmate might be applying, and that you do NOT recommend him, despite what he may say in his application.",
            "LOL gotta love it when the trash takes itself out",
            "He probably would’ve expected you to do the whole ass job for him.",
            "You shouldve blocked this dumbass punk a long time ago. Leave him on read or something to piss him off - you owe him nothing",
            "Fyi never do this for anyone. Make it clear the best you can do is get their resume on the desk.\n\nIf you pull for someone else, there's only one way to win here. It's if they are a great employee and you don't want to leave anytime soon. Otherwise the options are:\n\n- he sucks and doesn't get it you look bad for recommending him.\n\n- he takes the job then is terrible and you look bad for recommending him (and the employer has to decide whether to fire just him or both of you).\n\n- he takes the job and is decent, but you get promoted and have to boss your friend, which ends badly 90% of the time.\n\n- he takes the job and is decent and you get a better offer and leave. Now you look bad because it looks like you wanted to leave the whole time and brought him in to replace you and now they may not give you good references.\n\nLong story short this is a lose-lose situation for ALL scenarios except the one where he is magical, stays a long time and is a hard and good worker, and you do too. For EVERYTHING in the future, no matter who it is, the best you can do is set their resume on the desk of the person hiring. It's up to THEM to stand out and then ace the interview.",
            "Lmao good riddance. The dude is a 'user' through and through, especially when he blocked you the minute you were no longer useful.\n\nFWIW, the steps you gave are completely normal, even if they were a good person to reference. I just got a friend hired, and she still had to apply (with my referral link) like normal, go through the interview process, etc.\n\nMeanwhile, it sounds like he literally just wanted you to hand him the job without him doing a damn thing.",
            "This doesn't sound like a productive conversation or relationship. I'm happy for you that it sounds like it's over.\n\nI probably would have approached this like you did at first. If someone asks for a professional reference I'll give it unless they've done something specifically bad. If I have positive work experience with that person, I'll include a recommendation with the reference. If I don't have that kind of experience with them, I'll just communicate that this is a \"network reference\" and not include any recommendation. That's how I would approach this one. You're not putting your name on the line, you're basically just acting as a recruiter and fostering the process, which helps your company regardless of the outcome. This guy is a person in your social network and you're not specifically recommending him, just making the connection. That's how you manage the relationship with your company and avoid overstepping boundaries. You can make references with or without recommendations, and that's the secret sauce.\n\nFor the second part of this, dealing with the guy himself, I wouldn't have engaged when he started negotiating.\n\n>I told him step #1 and #2 but he insisted that I give him my co-workers contact info first and \"put in the good word\" then he'll pick things up from there. I said no...we went back and forth.\n\nHere's where it goes off the rails. You can literally just ignore choosing beggars. I wouldn't have said no, I would have said nothing. I would have left him on read if this was over text. If this was in person or over the phone, I would just shrug and end the conversation \"ok well, nice talking to you\". There's no need to go back and forth. You've made your offer and he can either accept it or not. You eventually chose to explain that to him, but you don't need to do that either. He doesn't need any of that explained to him, he can figure that out on his own with his big ole brain.",
            "I asked my bf what he'd have done, lol. He'd have just left the guy on read. (But he's notoriously bad at responding to texts/calls.) Anyway, glad you don't have to put up with your ex-classmate anymore!",
            "I had a work friend from a previous job years ago, after I told him about an opening where I working, ask me to put in a good word, help him get his foot in the door, etc.  I told him I'd do what I could, but couldn't promise anything either.  He was adamant I not tell any of the other guys from the old work group tho.  The job opening closed, and I casually mentioned his name to my contact in HR who had no idea who I was talking about so I called him and he told me.. \"Oh,  I never applied.\"",
            "Sounds like you’ve got some valuable insight into the types of people to avoid associating with professionally (and personally) and the red flags that come along with those types of people.\n\nGood on you for taking the high road and holding your ground!",
            "\"Can you help me with a job application by doing the job application for me?\"",
            "At least if he has blocked you it won't come up again :-)\n\nAlso even when nepotism is at play, people still usually have to fill in the application form and attend interviews.",
            "Wow, lazy and entitled, your company dodged a bullet with this guy.",
            "What's funny is i had the exact opposite interaction with a friend i had known since elementary school. I got a job at one of the two big biotech companies in our hometown area, and he asked for any help to just get his foot in the door. I was entry level in clinical manufacturing, but they were hiring temps for our department, so i got his resumen and got him a temp job. He had a degree in Occupational Health and Safety, so he was qualified, plus he was a really nice guy, so i was ok with recommending him. Well, a full time position came up in the safety department, and he applied, and didn't get it. But oddly enough, another one popped up at the other biotech company in our hometown and he applied and got that one. He's been there for 7 years now, and just got promoted to Supervisor.",
            "Lmaooooo nice job staying firm, and great job taking out the trash!",
            "I hope you realize if he had gotten the job with you, he likely would have come to you to do all his work on top of your own. He was out to just keep using you for as long as you let him.",
            "I can’t believe you even spent that much time and energy on this. Learn to ignore people who show you how garbage they are from the jump",
            "> Then he blocked me lol  \n  \nOh no. The pain. The horror.  Such a great loss.  However will you survive without him.",
            "Yeah I won't ever put in a good word for anyone that I don't know their work ethic or reliability.\n\nIts absolutely embarrassing if you end up with a bum.\n\nI did this for my own sister, she never showed up on time, always called in and she quit on the spot when she got another job. It was embarrassing for me. People didn't think we were related because of the polar opposite of my performance vs her. I was a supervisor too, so it didn't reflect well on me and choices of hiring people.\n\nLet's just say she got fired from her next two jobs after and they were government jobs to boot. Which if you don't know, it's hard to get people fired from a government job. She has two kids to support and she still can't get her act together.",
            "I'm a bit confused about this. The way it has always worked for me is that I check my company's Job Bank portal to see if there are positions available and in which department. We are then allowed to refer people to that hiring manager and forward the friend's resume to that manager directly. That's about as far as the process goes.",
            "One thing from your original post: even if you’ve just started a new job, you can refer someone you know. No one cares. If you just started but you know someone who’s an excellent worker, there’s value in going to bat for them. It’s not like your longevity at a company somehow makes you more likely to know potential high quality hirees.\n\nCaveat is that you want to make sure you’re vouching for someone you’d really think would be good. At a minimum, if it’s someone you’re not too familiar with, you would do a 30 minute interview with them, have them walk through their resume, and get to know them a bit. If they seem like good quality, submit their resume to HR directly for them. If they’re not, you just be straightforward and tell them you don’t think they meet the open position’s requirements and expectations yet, but they can try again after they have a few more YOE under their belt. People generally appreciate straightforward constructive criticism presented in a respectable manner. Anyone who reacts badly you wouldn’t want to be coworkers with anyways and you can forget about them.",
            "He wants you to actually APPLY for him? What a lazy POS. Good instinct here.",
            "You have set your self up for doom if you allow this guy to work there! You said you had to help him alot and he would never help you. So do you think that would change now that he works where you do? No it doesn’t. He will say help me out and you won’t be able to get your work done. Or he will bomb on something and say well you helped him out it’s your fault. He will throw you under the bus to save his job. If it came down to you or his job he will choose his job. So why should you help him out at all on anything? Say get your own life and stay out of mine thanks. This is why I don’t tell people about my job, how much I make or anything. Not even my close friends. It’s my life and I treat it very important. It’s nobody’s business about your job. Let them figure out crap on their own. \nI know about this because this happened to me when I was interning. I went to school with this chick who kept asking for help on assignments, I thought she was my friend. We interned at the same place. She wanted help all the time there, I had to do her work and mine because she couldn’t get the concept. I got a job offer after the intern. And she overheard and begged that I ask if they would hire her too! Hell no! So continue to do her work and mine?? She continued to text me daily saying tell them! I had to eventually block her and start concentrating on myself and my life!",
            "what a terrible friend. also why are you worried about your friends knowing where you work?",
            "Based on that interaction, I'd say sure I'll talk to my employer and tell them to definitely not hire this person. Extremely lazy and wants other people to do his work. I recommended...that they don't hire you!",
            "This guy is going to be a nightmare wherever he ends up unless he gets his crap together. Good job sticking to your guns.",
            "I put in a good word once and that guy proceeded to steal money from the register. Never again",
            "Hahaha the epitome of a leech.",
            "He sounds like a moron.\n\nBut I love referring people to my company, even if they just cold-outreach to me on LinkedIn and I don’t know them. Most larger companies offer referral bonuses, and it also feels like it’s paying it forward. I generally just refer people who seem qualified and like nice people. Your ex classmate doesn’t seem like he’d fit either of those descriptions though.",
            "When people show you who they are, believe them. Seems like you've made a smart choice here.",
            "Lol good shit. Just as a hint as you get started, who you recommend is a reflection of you. If you recommend someone and they completely shit the bed you will be working to earn some of that reputation and pull back. Dude was a bumming off you.",
            "Sounds like he solved the problem for you",
            "Man what a leech. Good job standing your ground. This dude has some balls trying to get you to do all of this when it sounds like you weren't even that tight in college",
            "Good on you for not giving in just to be \"nice\" which is what he was counting on. He showed his true colors in the end huh? \n\nFor future, recommending someone to a job is putting YOUR reputation at that job on the line. If that person isn't hired, your boss will remember you recommended someone who wasn't a good fit and they \"wasted\" interview time on them. If that person is hired and they do a shitty job in any way, your boss will count it against you and look at you as someone who has bad judgement.\n\nIf they do a great job, you will be looked at in a good light and your boss will trust your judgement more. So it can pay off for you for sure.\n\nBut, unless you know someone REALLY well or you're about to leave the job yourself and don't really care... don't ever recommend someone because the negative impact can in some cases damage your career.\n\nAnd bonus points for not giving out any co-worker contact info!!! So many people do that without thinking it will cause any harm, but it is a huge invasion of someone's privacy and again will reflect super badly on you. In fact, never do it even if you know 2 people know each other, hell even if they're family. ALWAYS ask the person who owns the contact info for permission, never assume it's OK to share that kind of info. \n\nI'm proud of you for standing your ground!",
            "I dealt with this summer as well. From a guy aged 50+ whose work and college history was all in another country. So I made sure that was fine with my workplace and it was, they wanted him to apply. He texts back saying he doesn't like interviews. I say that is part of the process. He says, I see you don't want to help me after all. \n\nLike NO I was willing to help, but you have to put in some actual effort.",
            "I might have told him to get you a resume so you could give it to your boss and then just…. Misplaced it…. In the trash.",
            "Tell him text his moms if he wants to be sucking on nipples and getting spoon fed",
            "Yup just wanted to use you",
            "Wow what a brat. He probably just does this to so many ppl",
            "Sounds like the turd has taken himself out.",
            "Better he isn't a co-worker lmao",
            "Congratulations on dropping a dead weight in your life.",
            "You did the right thing.  Legally,  you cannot apply for someone else.",
            "All jokes side, one month into a job you can't refer anyone at all. It's usually after **probation** **periods** but hell, I'm still hesitant to refer anyone being in a company for that short period of time (usually \\~1 year mark I'd be more comfortable). You're putting your career and reputation on the line for a shitty character like that? No thanks, I'd honestly ignore them.",
            "He's toxic and an idiot. If he applies and your manager inevitably asks you if you know him, you should say you have no idea who he is and you'd feel unsafe working with a stalker.",
            "The trash takes itself out once again. Success!",
            "This type of character always shows up whenever one is levelling up. Knowing how to \"tai chi\" them away is crucial to keep moving forward.\n\nThere's also the counterintuitive version of these guys, where they try to make others look like \"that guy\" to try to look high value.\n\nPersonal advice - don't waste any time being polite, but at the same time, don't be impolite. They often have no idea what they are doing, despite their high capacity for character assassination... Just rats looking for cheese.\n\nIf you accept any friendly invitation from them in the future and get roped into something stupid, don't be surprised at all.",
            "Looks like it resolved itself OK, but work on saying “no” OP.  What if he had applied?  We’re you really going to put in a good word and give out your coworkers’ contact information?  Saying “no” up front means you don’t have to decide between being a liar and hurting your professional relationships.",
            "Bullet dodged!\n\nThis guy would absolutely have embarrassed you if you helped him in any way.",
            "If he does try to apply and your boss asks you about him tell him honestly that he’s not reliable and he expected you to do the work for him for applying.",
            "As a rule, I NEVER stick my neck out for anyone, besides my siblings.  And that's because we have a wicked strong work ethic and I've worked with them before.  \n\nI once ever stuck my neck out for someone, who backstabbed the shit out of me, talked shit about me, and made people question my judgement because he was TERRIBLE.\n\nSo NEVER EVER again.",
            "This ex classmate guy is laughable. He'd be hard pressed to find someone to reccomend him to be a burger flipper with an attitude like that.",
            "This is when you go to your boss and say \"Yeah, if this person applies, throw their application in the trash.\"",
            "You wasted your time.",
            "There's a pattern here.\n\nYeah, even if he got hired there, he'd want you to do his work for him.",
            "> Ex classmate blocked me after I didn't \"put in a good word for him.\n\nOh no!\n\nAnyway...",
            "Good God. This is one lazy s.o.b. He would be an awful coworker. This worked out for the best.",
            "Yep. You made the right choice.\n\nThis is the sort of person who makes a terrible employee.\n\nWhen you refer someone for anything in life, a job, personal connection, financial transaction, etc, you have to know beyond a shred of doubt that they are someone you would be excited and ultra-satisfied to choose if the roles were reversed.\n\nThis guy would have absolutely been a lazy, dishonest, disingenuous, apathetic, disinterested, unethical and insincere employee. He would have definitely shown management an awful window into your character and personal life - when we refer friends or acquaintances for positions [especially] in our own workplace, for the most part it is primarily because we like them as people and believe that they would make a great and valuable addition to our work community.\n\nAlways remember this. Birds of the feather tend to flock together. Had you referred your friend to your office, his terrible attitude and rude behaviour would have led management to see you in the same light as they see your friend. Like attracts like. \n\nThis guy is not a friend. I wouldn't even dignify him as an acquaintance. He is rude, immature, lazy, insincere and dishonest, and clearly had no issue with asking you to do yet more work for him. Except this time, he was asking that you fill out his job application for him, and certify to your own employer that your friend did it, thereby committing fraud.\n\nHe blocked you. This guy is toxic. And he is trouble. He's not worth your time or attention, much less you risking your life, career and safety.\n\nKick him out of your life. He will eventually go back to you, with fake apologies and vague and empty promises to be a better friend, when he finds himself all alone with no friends because they have all woken up and have seen him for what he truly is.\n\nWhen he does this, don't even give him the time of day. Tell him that you don't want to speak with him or be around him. And leave it at that. Don't give him the opportunity to give excuses and try to guilt you or make you feel bad.",
            "What an asshole. The classmate that is.",
            "YESSS!! Didn’t see your original post, but here to celebrate sticking to that boundary!!!! I’m a work in progress with those, so I aspire :)",
            "I once trained a person at assisted living for caregiving. She was shadowing me, running around during lockdown making sure everyone okay and putting in the odd housekeeping moment/deep Convo with the old folx, and she, all tired, says, \"My last caregiving job, the dude liked me, so I made him do everything for me.\"\n\nI was like, \"Girl, you actually have to help these people if you want to work here,\" and put in \"a good word\" to my shitdumpsterfire management.\n\nShe didn't come back.",
            "You have more patience than me to carry on that conversation.",
            "That's really weird. Almost made up weird.",
            "if he can;t bother to apply himself does he even want to work there?",
            "You did the right thing. I wouldn’t have even humoured it that far tbh. Extra points for patience.",
            "What a lazy ass your classmate is.  I wouldn't stake my reputation on someone with such a low work ethic.\n\nSometimes, there are backdoor ways like referrals but dude still got to do some prework.  This isn't some government job in a third world country.",
            "Neverrrr put in a good word for no one. You don’t know how they work. Maybe they’re awfull employees who don’t do shit and you do not want to be the one who recommended that person",
            "Question: does the OP then go to HR to warn them about the potential candidate and the behavior exhibited, so that behavior is considered in any future application by them?\n\nIs this bad to do? Responsible? Vindictive? How do you see it, Reddit? Just curious!",
            "Not your lose, your ex classmate is lazy, he won’t go nowhere if he just depend on people",
            "If he were to get hired, he will completely bring shame to your name 🙄",
            "Thanks for the following up! Glad this worked out for you and you stood your ground.\n\nI love when reddit communities help :).",
            "Oof be glad bc if he worked w you and told everyone you got him the job (even if you really didn’t but he still got hired) it would be super embarrassing to be associated with someone who acts like that! Imagine the type of coworker he would be !",
            "\"he insisted that I give him my co-workers contact info\" WHAT???!!?!?!!  Who the fuck asks for that? Is that a 21st Century thing? Because I've never heard of any of that shit. No fucking way would I give anyone my work mates contact details no way!!!\n\n\"... first and \"put in the good word\" then he'll pick things up from there.\" He will WHAT? Nuh-uh brother, NUH UH! \n\nThe only time I've ever 'put in a good word' for anyone, they've then called out sick for a week right after getting the job and made me look bad. They lasted less than two weeks in the position. NEVER EVER AGAIN.",
            "What a manipulative loser! \n\nIf he does end up applying and lists you as a reference (which I’m sure your employer would notify you of), be sure to destroy him.",
            "I love it when the trash takes himself out. LOL"
        ]
    },
    {
        "post_id": "dc9a58",
        "author": "califalcon9",
        "title": "I (31M) was just told by my partner (29F) that she wants to stop working fulltime.",
        "url": "https://www.reddit.com/r/relationships/comments/dc9a58/i_31m_was_just_told_by_my_partner_29f_that_she/",
        "score": 2666,
        "num_comments": 536,
        "created_utc": 1570018073.0,
        "selftext": "First let me start off by saying my partner has been through a lot. We had been dating for 2 years and planning a life together when she was disagnosed with cancer. At the time she was in school for a dual graduate degree program and managed to finish it. Treatment was rough on her and she strugled a lot through it, and hasn't done well mentally dealing with the unfairness of it all, how different her body is after surgeries, and the fear of it coming back. All perfectly understandable, and I've been as supportive as I can throughout it all.\n\nNow all that said, she went into the graduate programs after we started dating and one of the degrees was at a very expensive school for something that was only related and not required for the work she planned on doing which would never pay very well. I questioned her about it gently at the time but she was adamant about getting the expensive degree. It was her life, and we agreed it would be fine because we could utilize public service loan forgiveness to pay off her debt that would total \\~$100k. This was before cancer.\n\nI earn a considerable amount more than her, when we started dating I made \\~4x and even with her degrees I make \\~3x what she does. I've always been happy to spend money on her, and after having moved in together over a year ago and proposing shortly after I really went into the mindset of it being \"our\" money. When we moved in she was finishing her degrees and I covered 100% of our bills, including some tuition costs for an extra semester since she was slightly delayed by her treatment. This was totally fine because school was her job and she'd be able to contribute when she graduated and even though I make much more if we are both working full time jobs it felt fair.\n\nNow that she has graduated and started working, she is miserable at her job mostly because she is incredibly anxious that she isn't doing it well and doesn't feel like her school prepared her. She was already prone towards anxiety and depression (she takes medicine for it) but mentally she is in a very bad spot because of all this. On top of that she feels like she doesn't doing enough for her health (mostly exercise) to keep her healthy to reduce the cancer from coming back but she says she is too tired after work to do much else than occationally go on a walk.\n\nRecently she got the idea in her head to start working half weeks to give her more time to exercise, and stress her out about work less. She says not knowing for sure how long she'll live has changed her priorities about working. Before all this she was a pretty driven type a personality working multiple jobs. But working part time doesn't meet the requirements for public service loan forgiveness.\n\nWe've talked about it extensively and she feels it is important for her to work part time, but I am not very comfortable with the idea for many reasons. I get where she is coming from in her needs but feel like she is looking for a quick fix to her problems that puts us in a pretty big hole financially because she is so miserable instead of fully dealing with her problems. I'd be more ok with it if it was short term while she sorted through some things but she says she just wants more time to exercise and be stress free so she doesn't know when that would end.\n\nI just feel like she is taking our relationship which is already unbalanced and asking to make it a lot more so--and soley because she is in a position to do so because of my job. We can financially afford it but I haven't been able to come to terms about the disproportionality it would create in our relationship.\n\nI am just looking for some advice on maybe a better way to think about this that would maybe make me feel more comfortable with it, some opinions on if I'm just being a greedy/selfish asshole, and some comiseration if anyone has been in a similar situation.\n\nI probably left out a lot so feel free to ask questions, this post is already very long, and if you read it all thanks for sticking with me! I obviously shared my side but I tried to not be too uneven since I think she has legitimate points but it hasn't changed my uneasiness with it.\n\n**tl;dr** My long time partner wants to start working half time to relieve her work stress and give her more time to take care of her health but it makes me uncomfortable because she has $100k of debt and it would make our relationship very unbalanced.",
        "permalink": "/r/relationships/comments/dc9a58/i_31m_was_just_told_by_my_partner_29f_that_she/",
        "comments": [
            "I can see both sides; no, you shouldn't shoulder the majority of the financial burden, and I get why you're apprehensive about something that could delay her PSLF eligibility. But also, she just went through something traumatic, and it's not uncommon for people to take some time to process that trauma and to figure out how to move on. She doesn't want to completely stop working; she just can't manage her stress while working full hours.\n\nThere's probably a middle ground here you two can figure out, but it's going to require a lot of communication about how this is going to happen, for how long, what alternatives are available for the parts you or your GF don't want to do, etc. For example, is it possible for her to go on short term disability while she works on her anxiety and depression? It would pay more than part-time, and it's going to have a timeline that forces you two to reassess in a couple months or so, once the time has run out. Or, can she agree to only doing it for a year, for now, and going to therapy throughout so that she makes sure she's getting the best help she can find for managing her stress? Or, can you two agree that she can go part time indefinitely, so long as you don't have to handle more financially than you already handle? Etc. A couples counselor could also help mediate you guys through a discussion to help you two reach the best decision for you. \n\nBut bottom line is that both of you have valid concerns, so you two just have to keep trying to figure out a solution that adequately addresses both of your concerns.",
            "She needs therapy to deal with this. She can’t fix it on her own.\n\nEdit: everyone is focused on the money and the student loan debt. In my opinion this is about her mental health. She’s had her entire life rocked by the cancer. It’s changed everything for her. If she really did used to be a type A and now she’s wracked with anxiety, depression, body image issues, and imposter syndrome then she needs professional help to work through this. Just throwing pills at it won’t help. And trust me, I did the SAHM thing and said I’d exercise all the time and keep the house up and I did not. It was just a different environment to be depressed in.\n\nShe should work together with a psychiatrist, therapist, and her GP to tackle these issues. She should NOT try to do it on her own.",
            "\n\nThis one hit really close to home for me. Mrs. Anderson also had a bout with cancer when she was your wife's age. I could write a bloody novel here, but I will try to keep focus and give you only two pieces of advice.\n\n\nFirst, and I cannot overstate the importance of this, but **speak with an employment attorney before you make any decisions**. That includes whether or not your girlfriend reduces her hours. I don't know what country you're in, but there are good ways to handle this and bad ways, and the financial ramifications are huge. It is 1,000% worth a few hours of somebody's time to make sure you get this right. Make sure you factor in any disability policies or SSDI that your girlfriend might receive if she's no longer able to work due to the permanent effects of her cancer treatments.\n\n\nSecond, the default mindset of the caretaker is to prioritize fighting the disease and the comfort of the patient above all else. I think that's what any loving partner would do, but it's so easy to lose your own identity and everything is about the sick partner. Well, you matter too!\n\n\nYou are 31 years old and your girlfriend, through no fault of her own of course, is now in a very different stage of life from you. She's 2 years younger and 30 years older than you, all at the same time. What were *your* plans and goals for life? How do you feel about this new life?\n\n\nJust to be clear, I am not advising you to leave your girlfriend. That's up to you. But what I am saying is that you need to take careful deliberation and own your decision so you don't wake up 20 years from now filled with regret.\n\n\nI don't know if it helps or not, but I'll add that Mrs. Anderson and I were already married and had kids by the time cancer struck. Yes, we stayed together, and no, it didn't even occur to me that leaving would make any sense, and no, I am not experiencing regret. But I'm me, and you are you. \n\n\nApologies since I'm sure this came across as callous. But it's important information, and life isn't always rainbows and unicorns. Wishing you the best as you navigate this.",
            "I’m chronically ill and have had to give up a lot to remain alive and functioning. You do have to listen to that voice which tells you you’re heading for a crisis, but you also have to consider multiple solutions.\n\nWhat if you were to sit down with her and a financial planner and game out all the options, including changing jobs, getting therapy and staying in this job, changing careers, stopping work entirely? Work through the financial and emotional pros and cons of each scenario, thinking about what happens if you stay together and what happens if she becomes single for whatever reason.\n\nIf she can’t face thinking all that through, she probably needs to take a vacation and seek better mental health treatment. But she shouldn’t make any major changes until she can look at all the possibilities.\n\nI think your role right now is to say you can appreciate she needs a change, and there will probably be a way to make things better. Once she’s feeling calmer you can be upfront about your worries and your dealbreakers.",
            "I'm going to disagree with a lot of people here. I don't think she is \"using\" you, I think she is in a bad place. Major health concerns can be traumatic, and also working so hard for a degree and not loving the outcome of that. \n\nI was working full-time a few years ago and basically had a mental breakdown. I ended up taking short term disability from my career and going into a treatment program. It was 8 hours a day of intensive therapy and then we all went home, and half way through I went to work part time and therapy part time as I worked on my transition back to normal life. \n\nIf she works for the govt they probably have some sort of short term leave plan, and I highly suggest a program like I was in. They worked with the short term disability program and submitted all the paperwork and as long as I went to therapy I got 65% of my weekly pay, which was more than part time work, even at my company. \n\n\nThis program has group therapy, individual therapy, nurses, doctor's, etc. My health insurance covered it and for what my copay was they let me pay a little each month. If she is struggling with her physical health it could help there, too. \n\nIt absolutely saved my life, and it could be worth looking into something like that for her! I don't live in a progressive or even super metropolitan area.",
            "you have really legitimate concerns. and so does she. i don't think either of you is being selfish. balancing her health and happiness with the financial health of you both as a household is something you need to solve together.\n\n\\- could the two of you make any reduction in expenses? is this break for her more or less important than other things you are saving up for?\n\n\\- are there any other ways she could change her job/workplace/career? would another position be less stressful? could she get some kind of mentor (either at work or from a professional association for her career) or additional support to help her learn and feel more competent? could she talk to her therapist (and boss) about better ways to structure her work to accommodate her mental health? has she explored all these things?\n\n\\- why did she decide \"half\" time was the answer? would a different ratio make a difference to your thoughts about money?\n\n\\- is there anything she/you both could change about the daily schedule that could help her have more energy? maybe she works out for 15 min in the morning, or finds a way to workout during the day at work before she's worn out. maybe she changes what she eats/drinks during the day. maybe a walk IS enough exercise for someone who's got an intense new job and a body still recovering from a serious disease.  (how long has she been at the new job? because IMO it takes a couple months to stop feeling completely exhausted with any new position. you're just learning so much and interacting with new people and it takes a lot of mental energy!! and anxiety on top of that? oof)  has she talked to her doctors about what timeline to expect for energy and body recovery or what she could do to help it out? could she see a nutritionist?\n\n\\- does she have a specific plan for what her time off would look like? i'd want to hear what she was going to try and why she thought that would help. \n\n\\- if she didn't have your salary available, what solutions would she be considering right now?\n\n(my sister recently went on a 4 week stress leave and then went back to work 4 days a week and it was TRANSFORMATIVE for her mental health and happiness in general. her workplace is horrible right now, due to the struggling state of the industry she's in as well as the specific boss and specific circumstances of her company. but she's always had anxiety and been a perfectionist. she worked really hard while on leave to read self-help books and go to therapy and meditate and do activities that brought her satisfaction and contentment rather than just escape. AND once she was back at work part time, she was able to interview a couple places and get another job.)",
            "I went through cancer. Had surgery and quit my job because the mental toll it took on me was so great that if I worked, I wouldn’t be here. I didn’t work for over a year (I did a few small jobs here and there to have a little money for bills). It sounds like she needs some time. She may be fine physically right now, but her mental state is struggling.",
            "I was really sick as a teenager and even though my treatment etc finished and I was \"well\" I think it actually took years after that for me to feel healed. Chemo batters your body. Illness batters your mind. I ended up dropping out of university because I was burnt out from years of treatment. I really needed to not have deadlines and not have somewhere to be every day to give me a chance to process everything. If there's any way you guys can swing this, I do think it's potentially very beneficial for her health. \n\nI get why you're concerned about her loan forgiveness - that's a lot of money to potentially lose. Could you see a financial planner or check out whether the forgiveness rules have a disability exemption of some kind?\n\nEdit. I wanted to add, it must have been very difficult for you while she was sick - she's not the only one recovering. It must important for you to feel like she's back to full health and maybe her working part-time goes against that? Make sure you're looking after yourself too.",
            "Reading these comments turns my stomach. People talking about her taking advantage, and how if she's not 'making the time' to exercise now, why would she when she's working part time. It's very obvious to me how much most people commenting HAVEN'T experienced serious health problems. I don't know if she's still experiencing physical symptoms post-cancer, but the stated need to exercise and exhaustion from work implies she might be (do correct me if I'm wrong). People are chatting about her like she's lazy. She continued with a dual graduate programme while she had cancer and was going through gruelling treatment! The woman's a fucking power trooper!  \nIt sounds like she's at or nearing a crisis point. I agree that therapy might be helpful, but also, she may just need to take some time out. It sounds like she's going straight from a dual graduate programme AND having cancer to working full time. Often when faced with a traumatic situation and too much on our plates we battle through and don't have time to process our emotions and rest and recover properly.  \nMy personal background is of an ambitious overachiever whose health totally crashed after I just battled through too much for too long, and I've had to come to terms with the painful fact that I can probably never work full time ever again. But if I'd taken more time out to rest and sort through my trauma after certain events, rather than throwing myself into overwork, then maybe I wouldn't have long term chronic illness now. I don't have a supportive wealthy long-term partner and have basically had to come to terms with being in poverty due to my illness.   \nIf you made 4x the amount she did when you started dating, and now make 3x the amount she does after her graduate degree then frankly it sounds like you're rich as fuck. So, what do you want to do with your money? And how much do you care about this person and want to stay with her? Can you still live comfortably if she works part time? (and I'm not talking about fine dining out levels of comfort). What's more important, the relationship being financially balanced, or the mental and physical health of your partner? Maybe she'd be fine working full time after some therapy, therapy sounds like a good thing to explore anyway tbh. But maybe, after working too hard at the same time as having a major health crisis, she needs a bit of breathing space. Ultimately, it's up to you where your priorities lie, going forward into the future.",
            "I’m coming from another point of view. It is a bit of a difference since my husband and I do have children. \n\nI am mostly a SAHM and wife. I started working part time after my daughter turned 1 to help out financially. But it was still a given that I would be responsible for most house chores, kids and dinner. \n\nJust within the last two weeks we found out that i miscarried. This is our second miscarriage back to back. Very traumatic because I’m in the second trimester awaiting surgery. And even those this isn’t life or death for myself I have a history of clinical depression and anxiety. I asked my husband if I could stop working for a while and he was very understanding. I deeply appreciate that he is willing to take on the full load for a while. But I truly believe this is detrimental for my future mental health and I need to get fixed mentally before I can take on life again. For my children and husband. \n\nmy opinion is that if you truly love her and can afford it, is it possible to just talk about a timeline in which she can work part time? Tell her that she would need to go to therapy and expect certain limitations on spending. Also bring up an end date. 6 months sounds realistic. For myself I want to give myself a 3 to 6 month break. But if I feel ready faster that would be a plus. \n\nA relationship is about compromise and doing things out of love. She isn’t asking to be taken cared of forever. She has gone through a life changing event and she just needs some time. And if you two were financially able to I would understand but she’s just asking for less hours not for you to take care of her as a SAHW forever.",
            "After reading most of your responses, I see that you are actually very supportive of the idea letting her work part time to recover. Like you said, you're just uncomfortable since she didn't give you the end date. Not knowing when that end can be scary. Why don't you just let try 1-2 months, then revisit the planning for the future. She is living for the moment right now since she experience a lot of shocks. Cancer is no joke then realized that the job that always wanted is not the job that you like? You guys are not married so you can pick up your stuff and leave any time. If you love her that much then be more patience and give her time to sort everything out. If she gets more comfortable and just want to live her life easy for long term after a few months of part-time job, exercise, and therapy then its a sign for you to walk. Good luck buddy.",
            "I think you are getting too hung up on the financial aspect of it. If you really make 3x what she makes and she goes part-time, you'd still be at 87% of your combined income (you make 6/8 and she was only making 2/8 anyway). Unless you are under a very strict budget, it doesn't sound like it would force you to re-think your lifestyle.\n\nYou're obviously committed long term, since you have gotten engaged - but did you ever talk about children? It's not uncommon for one person to be a stay at home parent and very often that person earns very little or nothing. Would you feel the same way? \n\nThe best advice I can give is to try it on a temporary basis for one year and agree in advance under what conditions it could / could not become a permanent arrangement.",
            "[deleted]",
            "I (43F) am a cancer survivor. I am also a PTSD, depression and anxiety survivor. I also have a spine injury that happened when I delivered my son 16 years ago that changed my entire life. My spine is like most 70 year olds, if not older. I also have student loans. \n\nHere is what I think: I think that your partner bit off more than she could chew with the expensive schooling. I think that there may be some differences in your attitudes with finances? This is a shot in the dark. The fact you state that you asked if it would be okay, and she said it would tells me that you may be a bit more conservative with your money. You have an \"expectation\" that she would handle this $100K, and now she is not fulfilling her end of the bargain. \n\nDespite the fact she isn't fulfilling it, she has undergone chemo. She has gone through something that can change a person's entire perspective on life. She may never be happy working 40 hours a week. I noticed your comment that you hope a therapist can talk her into it. It's not going to happen that way. It just isn't. She feels that there are other things in life that are important now, things that are beyond work - things like her mental health and physical health and making her life mean something, is the usual mindset. \n\nLife's terms changed for her when she was diagnosed and went through the treatment of cancer. This now means that she wants to \"renegotiate\" the expectations she had for her life. She thought that her education and work would give her purpose, and it sounds like it just isn't happening. Expecting her to keep forcing herself as a round peg into a square hole is not going to work. While I agree that counseling may help, I also think that maybe a re-evaluation of what she really wants to do is in order. She may not know. \n\nI do not think that she is trying to shove this burden onto you. I believe this because taking on a dual Master's is not something a lazy person does. The people that I know that have taken on that kind of challenge are people who are highly ambitious and want to make something of themselves. They love the challenge. \n\nHowever, when the body is ill and it is worse than having the persistent feeling of having the flu, it will drain someone of their life force. She needs to re-charge. I see that you are open to that - and that is GREAT! This is where you will need to have a discussion with her in regards to the finances and the amount of time this goes on. You can make a lot of money but $100K is a chunk - and I think this is where you need to express your expectations in regards to how that debt will be handled, how to go forward with a wedding and subsequent life events. \n\nI have gone through therapy and I know many therapists do not agree with not working. That is the worst a person can do because they can get caught up in their mind as others have stated. As I do have a spine injury, it is important that I still remain physically active. I lost the ability to walk due to my injury, but regained if by exercise. I get up early to do yoga. Yoga is amazing because it can help center a person, it is low impact, and it can also help with mental clarity. I do it in my living room, I do not even need to go anywhere. Sure, it takes some discipline, but two weeks, and it's a routine. I also found that I could handle my job better. The things that bothered me slowly no longer began to bother me. This would be a great way for her to start as she begins to progress into the winter and I am not sure about this student loan forgiveness program - but it sounds like she has to work more than part time? \n\nThat is my opinion on the situation. Relationships are a constant re-negotiation. It sounds like most relationships - two people from different backgrounds getting together and their differences in finances are causing a strain. We have this problem in my home too. I just think that is where it is... you have an expectation and now it needs to be refocused.",
            "Damn you guys are cold af. Consider yourselves lucky that you’ve never experienced the level of trauma and illness she has - because if you, or someone you knew had, I guarantee you’d be less of a collective asshole. \n\nMake sure if all ya’ll on here ever get married, you remove the “for better or for worse, in sickness and in health”, part from your vows. Right now OPs partner is “for worse” and “in sickness”. It is completely understandable that right now she would benefit from part time work, and full time healing, instead of full time work, and part time healing. And because I know some of you will mention it, *no*, you can’t just heal “part time” and work “part time”. Many people may be put in situations like that where they have to, but that doesn’t make it right. If OP and his partner have the means to allow her to heal right now, they should 100% be focused on that. She almost lost her life - you don’t just come back from that without issues, let alone the real health aspects that need to be managed post critical illness. Christ’s sake it’s not even like she’s saying she wants to quit work completely.",
            "I've seen the top few comments discuss the psychological factors here, but having had a few friends been through cancer and healing from that, depending on what she's been through the body takes about 3-5 years to return to fully workable.  Half time for someone who's been through these sort of things is wonderful.  Often you're talking nerve damage and chronic pain which is very hard to understand because people suffering these look normal on the outside and do everything to hide symptoms.  I personally don't think it's the time to get back at it full time.  You both took on the few risks of being unable to finish her expensive degree and lost.  You may not like it or have agreed with it, but you went ahead with it then.  Cancer just isn't her fault.  \n\n\nI don't think it's fair that you are basically the sole income earner, but it's in the exact same ballpark as I don't think Cancer is fair to anyone, that's not her fault.  Chemo, leaves behind all sorts of damaged nerves and organs, and chronic pain and surprise fatigue events and the mental trauma is pretty close to having been to a war zone.  I don't have cancer (as far as I know), but I've had my year rocked by some pretty serious health concerns myself. It's very hard for people to understand that I'm not giving up, I'm just significantly limited right now in what I can do.  My closest friends don't find that easy to rationalize.  It's especially hard right now because I'd love to be where they think I am, when I'm in severe pain and they are not. As I've been regaining mobility lately, they automatically assume I'm not in pain.  I'm not saying this is where you and your wife are, I'm saying this is a factor that most people close to me can't wrap their heads around. This sort of thing is traumatic.  It can really mess someone up. There are a few really heavy factors pulling on both sides.  I don't think Reddit is anywhere close to a liscened therapist for such a matter.  Perhaps someone significantly more educated, qualified and experienced in sorting this sort of thing out for you can hear both your concerns and address them accordingly.  I'm sorry, but I really don't see a reason to trust the general public on matters of understanding chronic pain, or traumatic medical events even, compared to a therapist.  If my wife had any problem with my return to work plan, which has similar inequities as your wife's that would be my next step.",
            "You're going to be fine financially with your own salary?\n\nYou don't need her to work in order to pay the bills?\n\nHer job is not allowing her to heal from her medical and emotional trauma?\n\nThen support her. Obviously. Let her know she can take the time she needs. Thats what she is primarily looking for from you right now: permission to do what she feels she needs to heal.\n\nDon't attach strings. She's a grown up. She's a cancer survivor. She got through grad school. Nothing about this person sounds like she wants to be lazy or mooch. So don't treat her with suspicion, but trust that when she's feeling healthy again, she will resume contributing in whatever way she can. \n\nYou cannot make it a precondition to getting space to clear her head, that she clears her head and discusses her 5 year plan with you rationally. She's struggling. Let her know you're stable and she can take a moment to breath.\n\nEdit: all of this is assuming this woman is your life long partner, obviously. Like, you don't have to be married to be utterly committed to each other. This is a big ask for a BF. It's not a big ask for a future husband.",
            "Hey, so I'm a disabled person with a spouse who takes care of finances due to my health. I figured my perspective might be useful for your situation.\n\nSo, first off... Disability. Your partner has been through cancer, a life-threatening illness. The treatment affects her health, maybe forever, and there's always the possibility of it coming back. \n\nDisability changes a huge amount in a relationship. I don't know where you live, but I live in the US, and a lot of this is true for other countries as well.\n\nIn an ideal world, the government would use power and finances from the whole population to take care of people who can't care for themselves-- orphans, elderly, disabled, etc. However, these social frameworks don't really exist, at least not to the degree they are needed. Additionally, those that do exist are high barrier and use a ton of resources and stress just to apply for. \n\nBecause of that, disabled people in society fall into two categories: wallowing alone until we die or being taken care of disproportionately by our loved ones. \n\nAs a healthy person (I'm assuming from your post) who loves a disabled woman, the burden which all of society should be helping to shoulder instead falls on you, and other people in her life. (Family, friends) But because of how society sees married couples as a unit, most disproportionately on you. \n\nRelationships with disabled people therefore are always unbalanced, and this will never be fixed until there is a massive change in how society deals with disabled people. Your choices are accept an imbalance and set anything that is required of *you* to keep her at baseline as the \"zero\" of your relationship (as in, don't count it as something you're doing for her in your relationship which is unbalanced because she can't do it for you-- count it as an unbalance against society since you're doing what society should be doing, the basics of food, shelter, healthcare-- and only things *after* the basics actually factor into your relationship balance. \n\nIt is not either of your faults that the systems in place don't allow her to bring an equal slice of the financial and energy pie to the relationship, but unfortunately this is the world we live in.\n\nSecond, Marriage. So, families are mini-units of shared resources. Some cultures have all family members pool their money into one account and the household head then spends it in bills, maintenance, etc. But Western society is highly individualistic. Some married couples merge finances while others keep them separate. Frequently, there is a sense of shame about asking family for help and it's expected that you do it yourself and should be self-sufficient. \n\nWell, I already went into how that doesn't really work for disability. In a more communal structure, disabled people are taken care of from the pool without being expected to contribute the same as a healthy person. (Some disabled people, like myself, can't work at all, while others may be able to work part time, or full time but only certain types of work.)\n\nDisabled people don't really fit into an individualistic structure, because the way society is set up, we can't be independent. There isn't enough government support for that. So we have to rely on others. Or we live in squallor and eventually die miserably. It's the unfortunate truth, sometimes the world is an ugly place. \n\nSo, you mentioned you proposed and that you are engaged. I recommend thinking about what marriage means to you. What does a married life look like? Can you imagine yourself married to this woman if her cancer comes back? What if she survives, but needs a higher level of care and can't work? There's some support you can get, but again, it's limited and difficult to get. \n\nDoes your definition of marriage fit in with having a disabled spouse? Or can you only imagine marriage working if your spouse is healthy and contributes equally in all things?\n\nAll relationships will have their hardships, and it's just luck of the draw which ones you get. Disability and chronic illness are a unique hardship, and not one everyone is capable of handling gracefully. But it can be done. Our first few years after I got sick, my spouse didn't deal well at all. But now we're doing much better, we're in couples therapy, and we're learning and improving together. \n\nFor more specific advice to your situation, I recommend that your fiance find a good therapist, especially one who has experience with disability and cancer. I also recommend she drops to part time and sets up a regular exercise schedule, such as swimming once per week. (Swimming is great exercise and it's easy on the joints. Bonus, it's a lot more fun than exercise machines so it's easier to keep at it.)\n\nI also recommend couples therapy, which contrary to popular belief is **not** only for breakups. Most people just wait until the point of no return to go. There's nothing shameful about it, it's a great resource and helps a ton, as long as you find a good fit. Especially one who has experience with interabled couples, this will help you figure out your plans for the future, including helping her determine where she can take accountability on her end too. (I centered a lot on the disability aspect because it's poorly understood, but no matter how sick you are there are always ways you can take accountability in your life and relationship, even if you use a different measuring stick than a healthy person.)",
            "Can I just ask where her parents and family is in all of this?",
            "[deleted]",
            "I think you are kind of minimizing the fact that she is a cancer survivor here. Yeah the relationship is financially unbalanced, but it's also unbalanced in the sense that YOU DON'T HAVE CANCER. You can afford for her to go to part time and focus on her health, but you don't want to because you think *it's unfair???*\n\nExercise can be an incredibly effective treatment for anxiety and depression. If she is already seeing a therapist and taking medication, adding exercise is a great step. The fact that she wants to do that is a sign that she is dedicated to working on her health. If she has to go to part time for now to do that, she is making a decision that will allow her to live and thrive. \n\nThere does need to be a timeline for reevaluating this. If she agrees to re-assess her work schedule in six months to a year, I think you should support her decision to go part time for now.",
            "Unpopular opinion on this one. You love this woman. When something as traumatic as chemo happens to a person their minds shift to “time” and she is spending all of her time in a place that is depleting all of her reserves. Her continuing that path will only make matters worse. Would there be a situation to discuss where part time was a temporary arrangement while she got healthy? With parameters of course, ensuring she’s committing to her equitable portion, which is focusing on her health and the health of your relationship. She cannot contribute to the relationship fully if she is not well, allowing her to do so requires team work and ample communication. Your perspective is that you already make more than her and she wants to now make less. Is money a true priority in your relationship for the next small period of time? Marriage is hard, jobs are changed and lost and money comes and goes. Stability in expectations and each partner finding their path to happiness and mental hygiene requires work from both parties. I see why this can be frustrating to shoulder the financial burden continuously but any shot she has at getting to a good mental space does not include keeping pace with what you’re both doing, and perceiving currently",
            "Given the massive amount of moving parts here: relationship dynamics, personal finance disagreements, cancer, etc.   I think it might make sense to break this up into smaller parts.\n\nI would encourage you guys to do two things:\n\n1) Regardless of anything else, she needs to be in counseling of some kind.  She needs to work through everything that has happened, and that's something you can't give her the way real treatment can.\n\n2)  If it were my wife in this situation, I'd be suggesting that she take a 6 month sabbatical to focus on rebuilding.  Her physical health, her mental health, her plan for her life...all of it.  I'd be more than willing to say, \"Let's give you 6 months without the obligations of work to get into a good place.  Your job can just be getting healthy.  Once we hit May 1st next year, let's figure out what the next step is.\"\n\nAt that point, you've given her an incredible gift of time and clarity, and you'll also get insight into how seriously she takes this.  If she hits the gym every day, starts a regular counseling schedule, and generally seems trending in a good direction, you'll know she needed this.  If she balks at treatment, doesn't actually hit the gym, and treats it like an indefinite vacation, you've learned something that should tell you this relationship isn't for you anymore.\n\nI can't tell for sure on your description, but I think \"burnout\" and \"Don't want to work-itis\" are both possible issues here, and I think if you're willing to do it in terms of carrying the burden for 6 months, I'd want to solve which one it is.  I think your relationship needs to be on probation in your mind: she is sending up red flags that as your friend would have me telling you not to marry this person.",
            "> I just feel like she is taking our relationship which is already unbalanced and asking to make it a lot more so--and soley because she is in a position to do so because of my job. We can financially afford it but I haven't been able to come to terms about the disproportionality it would create in our relationship.\n\nYou've hit the nail on the head, right here.  This is the core of the problem: the relationship is already unbalanced, and she wants to make it *more* so, by shifting more of the responsibility for your financial well-being onto your shoulders.\n\nFor a relationship to be healthy, *both* partners need to be contributing equitably (not to say *equally*, because there are plenty of valid setups where one contributes in one way and the other contributes in a completely *different* way), so that both feel that what they are putting into the relationship and what they are getting out of it are fair.\n\nShe went through a *very* rough time, and you were there for her and took up the slack while she did.  \n\nBut that can't be the default state of the relationship.\n\nIt seems as if she wants you to be working on making sure the *relationship* has everything it needs, whereas she wants to be working on making sure *she* has everything she *wants*.\n\nThat's an unworkable model.\n\nThe first thing to try would be to get her into counseling/therapy to deal with her anxiety and impostor syndrome about her work.  If she can get her head sorted out so that work is no longer an anxiety-inducing thing, that may allow this imbalance to be resolved.  \n\nIf she won't try that, or she tries it and it doesn't help, you're left to play the cards you have in your hand.\n\nThere's nothing you can do to *force* her not to cut back to part time.\n\n*You* have to decide whether that balance of partnership is one you can live with, or not.",
            "Hate  to be that /r/relationships poster who says go straight to therapy, but I have to say, debt + miserable job + coming from sickness probably means she has some form of depression or at least a lot of mental/emotional stress. In general, therapy, both couples and single, would help a lot for her to figure things out, while you can try to talk to her about your fears and potential resentment with a professional third party present.\n\nIn terms of practical advice, I think it's important to sit her down and let her know what you said here, that you went into this relationship expecting an 'equal' relationship in terms of contribution over at least some span of time. Your concerns are simply you don't see how that can happen if she has no plans beyond working part time and you basically have to pay off her student loans. I'd put out other solutions-- maybe she can work for as long as the forgiveness plan requires, maybe you two can talk about easing her into another job she likes, maybe there's some other ways she can ease stress and fears of her cancer coming back (suggest therapy). Maybe you're okay with her just being a stay-at-home partner but you just really want her to pay off this loan first. Above all, be firm you're not okay with the 'compromise' being that you basically pay for her loan.\n\nAll that said... being together for two years and her already being so financially reliant on you makes me think you guys moved too fast. If she's become someone you don't think you can be with in the long term, that's totally valid-- yes, it's unfortunately due to cancer, but it's totally valid if you don't want to be with someone who wasn't as ambitious/driven as you thought. It's not like you two are married, so it's something you may want to think about.",
            "If she's working full time and you make 3-4x as much as her, your problem as a couple is likely overspending or living a far more lavish lifestyle than you should be. What's your contingency plan currently in your finances if you lost your job for instance, and couldn't get one that pays as much?",
            "it's just money, man. if you can handle it and she's worth it do it.",
            "I can only really address the student loans here. I'm not recommending she work part time, but if she really wants to and you disagree, I think it will only make things worse and eventually lead to disaster. \n\nPublic service loan forgiveness is all good, but have you ever seen the articles about it? There are thousands of applications and very few of them all ever accepted, so I don't know if that is a real, viable option. She needs to complete the application right away to make sure any payments she makes will actually qualify. \n Income based repayment has forgiveness after 20-25 years, so I would consider that instead.  Payments are based on household income, if you file a joint tax return, it will be based on your combined income so the payment might still be fairly large. If you file a separate tax return, there are a couple of plans that will only count her income, so if she does actually end up working part time, the payment will likely be $0.  Although, the year the loans are forgiven, the amount of debt forgiven is counted as income, so you will have to pay the taxes on that. I'm pretty sure she'll end up in income driven if she does public service loan forgiveness anyway. I service student loans for a major servicer, I'm no expert,  but I know a couple of things.",
            "I don't think I see this answered anywhere, so forgive me if I'm missing something: How long has it been since your partner graduated and started working? \n\nThat transition is difficult enough without also having dealt with cancer, which I genuinely can't begin to imagine. I admire your strength and support for her; this situation is tough on everyone, and being the primary caretaker of someone who is ill, on top of being the breadwinner is just A LOT. So, kudos to you for seeking a mutually beneficial solution.\n\nAll of that said: I wasted YEARS in a demanding job that sucked the soul outta me. By the time I realized how burned out and depressed I was, I had no choice but to quit without another job lined up...and then I moved my whole life a couple thousand miles away. I'm was grateful for the skills and endurance I gained at that job, but I can't get my 20s back...missed opportunities for relationships, love, life, etc...and it haunts me as I play catch-up. My biggest regret is not taking care of my mental health at the time, instead letting my fear of instability and financial ruin corner me into a miserable life. \n\nAll of this is to say: If your wife can scale back her work hours and dedicate that extra time to get the professional help she needs to cope with her traumatic ordeal, I truly believe it will be worth it in the long run. Though the student debt is a monster, there are many ways to mitigate the financial burden in the short and long term. Taking a year off from throwing all your extra money at making high payments on your debt for a year is going to hurt a bit in terms of accruing interest, but not as much as it would if your wife reaches the point of no return mentally and emotionally. Plus, student loan debt is relatively easy on your credit if managed properly. Try prioritizing paying the highest-interest loans first, and stick to the minimum payments for low/no/deferred-interest loans. \n\nAnyway, on top of all that, patience and communication are key. You're doing great. I'd suggest therapy for you, too, as being in your position is a lot to cope with. Good luck!!!",
            "Two years ago me and husband both worked full time. Then after some unlucky and not easy years (endometriosis and a surgery involved) I got pregnant naturally. After four months of pregnancy we found out our baby girl had no chance to survive birth due to a very serious cardiac defect. We had horrible months. I started therapy, as my husband suddenly decided to change his life. He started to work part time in a job he hated, and started university. He totally changed him. Now he smiles, laughs, he’s always happy. Before of all that he was often on bad mood and anti social, obviously for what happened to us, for the unfairness of what happened to our girl. Well it’s not that easy, we’ve got a mortgage and a dog, so the expenses are many. But seeing him so happy helps me a lot. It totally saved our relationship I think, and I personally think it was worth it. Life is so short, I prefer a happy healed husband than a big bank account.  But that’s me, and not you. It’s up to you both to decide. That’s just my experience.",
            "She should have planned her cancer more conveniently and then surviving it. What was she thinking? /s",
            "Hi, OP. I’m a cancer survivor (DX w/ breast cancer at 31). I can relate to many of the sentiments your fiancé has expressed to you. Dealing with a cancer diagnosis, especially when you’re in the “prime” of your life, is one of those experiences that truly change your life (and those who love you) in the most profound way possible. From my own experience, I offer you some feedback:\n\n1. The period following cancer treatment is notorious for causing anxiety, depression, and PTSD. Yes, PTSD. \n\nI use the metaphor of a car crash: the diagnosis and treatment happen quickly; you don’t have time to process it. It’s a blur or surgeries, medications, and therapies...you’re just holding on, trying to survive.\n\nAfter treatment, if it’s successful and you’re in remission, you have a chance to really take it what’s happened; the spinning car comes to a stop. All of a sudden, you realize the enormity of what you’ve been through. You should be happy, right? Everyone else is! Time to move on and get on with your life...but you can’t. You’re terrified of having to go through the same situation again. You have stared your own mortality in the face and everything is different. You realize that you can’t control your fate by “doing the right things” anymore, and that’s frightening.\n\n2. Priorities _do_ shift. You had it all planned out before cancer. Now that plan doesn’t seem important anymore. You’re focused on your quality of life now. Yes, you have a career that pays well, that you invested time and money in, but that career is a source of stress. She very well may need to work less until she has addressed the trauma she’s endured. Let her invest more time and energy into recovering, mentally and physically.\n\n3. Your fiancé needs counseling. Ask her oncologist for recommendations for someone who has experience with cancer survivors. I truly believe after-care should include therapy of some sort. Your fiancé needs someone to objectively help her work through her anxiety, fears, and decisions for the future. Maybe it’s developing helpful behavioral habits or finding a medication that brings balance to her life. None of it is a “magic bullet”, but it can bring about meaningful change.\n\n4. If she wants to work less, then talk about what that will look like for both of you. It it’s going to put her back on the road to healing, then it should be considered. However, these are decisions that need to be made together, with both parties understanding the financial impact and lifestyle changes it will bring about. If it’s feasible and a financially responsible option, let her reduce her professional workload. It’s not permanent. If you’re concerned about wasting the investment of her education, know that the risk of her burning out and quitting if she exhausts herself is far greater than the temporary loss of income that comes from moving to part-time.  If working less helps her recover and focus on her well-being, that’s what needs to happen. \n\nSpeak to a financial advisor about the loans, get a budget together...if both of you agree to make this change, be sure to prepare intentionally. If y’all are not on the same page, it will only lead to resentment if she feels “forced” to work to appease you or “stick to the plan”. Similarly, you’ll feel resentful if you feel “forced” to accept her career change out of guilt.\n\nLook, y’all have been through one of the worst things that can happen, and you made it. Accept that life is going to be different now, and you may need to deviate from the course you had previously planned. Seek counseling from trusted sources, communicate your concerns, and make the choice together.",
            "If you can afford it, what's the problem?\n\nHow do you feel about your job? Do you want to take more time off? If so, the proposed arrangement would cause resentment.\n\nIf, however, you love your job and don't mind going to work, I don't see what the problem is. Maybe your GF could take a year working part time, then go back to work full time after that. It sounds like she hasn't had time to fully recovered from the ravages of. Hemp.\n\nSome other things that can take the pressure off:\n\n- Maid. Does she do the bulk of household chores on top of working? That's not easy.\n- Ease the commute. Maybe a cab on Monday mornings is fine.\n- Massage, yoga, therapy, good sleep. Make sure you both get a chance to really rest.",
            "yeah, surviving a potentially terminal illness, contemplating your own mortality and constantly living under the threat of cancer coming back has a way of changing your priorities. can't say i blame her.\n\npeople can always make money, but they can't make time. i would consider cutting her some slack for now, seems like she's earned it. if some time goes by and she still doesn't want to go back full time, then you are gonna have to make some hard choices in regards to your relationship. \n\ncancer, understandably so,  changes people. you may just not be on the same page anymore.",
            "This seems kind of cold. Its obvious shes asking for help from you. She's been through the ringer. Throughout your post you talk about how much more you make than her and you could afford it. Her mental health is as important as her physical and I think you could stand to see it all in a new perspective.",
            "This is a very difficult situation. Could she take a career break for a few months ( 6 months at most) work on herself and then get back on the workforce? Quitting her current job and joining a new one would be the best, but even a sabbatical from her current one would be better than nothing. I was and am an A-type person, but when I had my first child, followed by PPD and lactation issues, I was just unable to keep working. My husband supported me when I quit my job. I ended up having another kid and staying home for a couple of years and then going back to grad school and then onto a much better and sustainable career. I am very appreciative that I got to have that break, it seems like a blessing in disguise. I will tell you though, I was too broken mentally to plan to return to the workforce at the time I quit my first career - it only happened AFTER the cobwebs of my tired mind were cleared, so to speak.",
            "She had cancer. Dude, she needs some time. Maybe in the future, she would want to go back to full time, but either way, after what she's been through, I think it's fair she take the time she needs or wants",
            "I'd recommend looking more into public service loan forgiveness.   Everything I hear makes it sound like you won the lottery if they actually approve your forgiveness.",
            "I hope when she gets better she will dump your ass. She had CANCER, I hope you never have to deal with going through that personally, but if you did I hope you have a spouse whose willing to support you. Things are not tit for tat in a long term relationship, when you are in the fucking dumps you'd probably hope she'd be willing to step up to the plate to help you out. Fuck your awful attitude.",
            "Welcome to getting cancer under capitalism.  \n\nShe's made questionable financial choices, and our societies are not kind to those who have fallen ill.  She's in a shit place, and she made it worse by taking on considerable debt.  \n\nYour income will help, but she's sorely mistaken if she thinks it'll make everything go away. \n\nShe sounds depressed.  Therapy!",
            "Your partner has a horrible disease that could come back and kill her at literally anytime. She’s already been through hell. I get your feelings but...what is the end here if something doesn’t change for her? Are you ready for her mental health to further deteriorate? Her cancer to return? \n\nI’m not asking this to be snarky, I’m genuinely curious if you have really thought through the possibilities.",
            "She had cancer!!!! \n\nShe needs a supportive partner who can help understand she needs time to heal! \n\nWtf is wrong with men these days?! \n\nThey want us to keep working even though our mental health or physical health is bad? \n\nJust so they can split the rent? \n\nGrow a heart!\n\nThis girl needs a more supportive partner.\n\nI feel sorry for her.",
            "Did she undergo chemo? It affects the whole body, including brain. Your partner is not well. Is she taking omega 3, noopept, etc?",
            "/u/califalcon9, my girlfriend of four years has anxiety, depression, PTSD and had cancer and now she now runs her own business (still with PTSD, anxiety, and depressiong tho) . disclaimer: What I'm about to say is not \"hah my gf had it worst and she's working... wtf is yours doing?\"\n\nMy gf is doing much better now but still has to see a therapist and take medication once in awhile.  I asked her to take a look at this thread and she chimed in (paraphrasing)\n\n>Cancer fucks with you and messes you up even more when you have mental health issues. you should've seen me after cancer. I was resentful and bitter and just not a fun person to be around. I had to really work on recovering from the physiological effects of cancer before I could fix my mental health issues which was the actual hard part. Give it some time and she should be better or at least on a more intelligible mindset. \n\nI wasn't with her when she had her ordeal with cancer so I can't speak on how hard it is but I just have to say from the sound of it that it's a journey and it's going to be difficult. You probably feel resentment on the difference in income especially without any guarantee of when it'll \"end\" or stop being as distant as it currently is due to the uncertainty of her mental illness and the effects it has on her ability to work. I can't guarantee you she'll get much better or that she'll become fully functioning in a year; that part is on her and her therapist/doctors. I can only ask you to run the scenarios in your head and see what's acceptable to you and how much farther you'd be willing to last in this suboptimal setting for the potentially better version of her. This would be a lot easier if you hadn't proposed so it gives you both time to see if this is what you guys want but maybe bringing up the delay in marriage is a good idea although it might make her feel less wanted and make her mental health issues get worse. My two cents would be to get couples counseling where you can talk through this in a more controlled setting.",
            "I just want to chime in and say there are lots of ways to balance equitability in a relationship. Maybe for OP that means financial balance but that can skew heavily one way or the other when you take individual health needs and household needs into account. Just another perspective to think about. Not every couple has two full time workers but I guess I can see the frustration of the big student loan.",
            "I recently starting working part time instead of full time. I struggle with my mental health, but nothing as traumatic as what your fiancee has been through. I have just spent years in a high-stress career and was burning out. I have no impending plans to go back to full time work. \n\nI am so lucky. My husband didn't even question it. In fact, he encouraged me to find something part time or to quit working all together if that's what I needed. No time limit, no mention of him \"pulling all the weight\" (because he's not. I do all the cooking, cleaning, grocery shopping, etc and he recognizes that that is a huge contribution to our life together). \n\nI don't know, OP. You're going to need to stop keeping score on your relationship if you're going to get married. You write as if she's selfish for asking this, but to me, you seem selfish for putting your mild discomfort above her need for healing from a hugely traumatic illness. \n\nHave the two of you sat down and really looked at how this will affect your financial goals? Like really get into the nitty-gritty of the numbers. Like you, my husband earns way more than me even when I'm working full time. My dropping down to part time work is a negligible difference for us. It may ease your stress some if you can look at the actual numbers.",
            "it seems like she needs to stop for her own health. \n\ni would sit with family, someone also said financial planning, to figure out how to live decently on a smaller income.",
            "How would you feel if she became so sick that she'd be unable to work? If you don't know, ask yourself and try to be really honest with yourself. This may happen even with previously completely healthy people, and your partner is at a higher risk with her history of cancer. Would you be okay with taking care of her completely then? Or would you not want to shoulder that burden, and leave her?\n\nShe wants to prioritise her health, to stay as healthy as possible. She is understandably scared of cancer coming back, and wants to do everything in her might to prevent that. Once you've figured out where you stand generally with your willingness to take care of her if need be, sit down together and talk about ways she can do that, and what she would need from you in order to do that. Maybe it boils down to her working part-time, maybe you can find other solutions, but always keep in mind that for her, this very likely isn't about money but about her health and her fear of serious illness and death.",
            "One person working and the other person staying at home doesn't make an unbalanced relationship. One person making more money than the other doesn't make a relationship unbalanced. It's about effort. \n\nI've been on both ends of relationships that one person works and the other stays home. If the person staying home puts a high level of effort into what can and needs to be done at home, they can make the life of their partner much better, while at the same time, have a better life than if they were working.\n\nRunning a household is a big job. Putting someone on it full time can increase efficiency greatly. Don't make your lives worse in the interests of fairness.",
            "She was never financially realistic and her health problems have provided convenient cover for not becoming so.\n\nShe owes $100K and has the option of working in an area that would include public service forgiveness.  If the job she has is causing stress, the answer isn't to stop working, it's to find a different, more compatible job.   The only reason she can even consider this half-time idea is that she expects you to pay for the roof over her head, the food that she eats, and shoes on her feet.     It's time for her to accept responsibility for her choices.",
            "As gently as possible I would ask her how she felt if you were the one to cut back because of stress and want to exercise. As someone who has been through chemo myself it does have lasting effects, some physical, some emotional, but having said that your mental and emotional health matter too. If you aren’t married that’s a good thing for you buddy if she chooses to press the issue.  Let her know that while you love her and have been supportive you simply can’t support that because it would put you in a more unstable place which would offset the balance and potentially cause you needing to be the one to take time off etc.  Be vulnerable in this situation, and maybe ask her how she expects you to perceive the idea of the impending debt that is actually just hers, I get it you’re partners but you can’t shoulder the whole load by yourself",
            "Sorry OP, but if you were my SO and I saw this post, I would break up. You don‘t love this woman, let her go.",
            "It sounds like you can afford to financially take care of her, you just don’t like the idea of her taking advantage of that fact.\n\nSo, my question is: would you rather have a happy, healthy girlfriend or a miserable, tired girlfriend?",
            "[deleted]",
            "It sounds like she's dealing with some PTSD post cancer. That's not uncommon. She could probably benefit from some counseling to deal with it and help her get her head straightened out. The bottom line is she's got 100k debt now that she needs to work to pay off. It was her choice to go to that expensive school and it's not fair for her to stick you with the bill now just because she doesn't feel like working. Tell her she can quit when that bill is paid off.",
            "I would REALLY caution against relying on public loan forgiveness- the first round of folks who are eligible to actually have their loans forgiven are up now, and they only honored a tiny percentage of them. It's highly unlikely your partner would receive it even if she met all the requirements. You both need to work together to come up with a plan for contributing to them.  Also- plenty of people go to the gym and work an 8 hour plus day, so your gf could figure that out if she wanted to. Is she in therapy?",
            "Hey there OP. I get that your girl has been through a lot. But as someone that was also the 'breadwinner' with a partner with anxiety and depression....taking time of was NOT good for him. It gave him far too much time to 'think', and brood. Despite being on meds and seeing a therapist, his mental health declined. And he was exercising, working out, eating right, 'working on his issues', with me paying 100% of the bills.\n\nHis mental health continued to decline, despite it being the environment he thought he needed to improve. I can see he did far better when he had a job to go to and focus on vs having time to dwell on his issues, and a normal daily routine.\n\nNot gonna tell you what to do, but quitting work/going part time may well not be your answer, and then you will have a dependent that has no money of her own, nowhere to go, and no money to support herself even if she did (ask me how I know this one) which would make breaking up so much harder. Wishing you both well today!",
            "[deleted]",
            "I am sorry. Your situation is beyond difficult and I understand why you're torn. \n\nIf it is possible for you to be comfortable with her working part-time, it sounds like a detailed plan could help you be comfortable with the idea--budget (especially planning for if you get sick and can't work), how she will use the time off specifically, how the time off will benefit her, when will she know she is ready to work again, etc. Just by eliminating the unknowns that are worrying you, I would image the idea would be more appealing. \n\nBut, to me, and I could be wrong, it sounds like you fear that this time off is less to try and get her life back on track and more her giving up because cancer has taken the hard working drive that you fell in love with. If that is so, I would worry if I were you that going to part-time would be a sign that she is no longer than woman you fell in love with. Especially if she usually makes plans and she has no other plans than to go part-time.\n\nYour situation is hard. You were a caretaker and provided primary financial support. It has been your role to worry about so many things in this relationship. Take care of yourself and make sure whatever happens is your preferred outcome.",
            "Is there any way she could just take a mini vacation, and use it not only to exercise, but to job hunt? Or perhaps hunt for a second, less stressful part-time job (and have two part-time jobs)?\n\nMaybe she can work part-time, and then also be a dog walker or something. (Even a fitness instructor or personal trainer if she knows a lot about that lifestyle?)",
            "Best thing you can do is talk to her extensively about it. There are alot of people saying to leave her and this and that. What? All this from a snippet of your life? But bottom line, this is your partner. No one knows her but you. Communication and compromise is key. Tell her your concerns and if you both still cant come to some type of agreement then maybe think about seeing a couples therapist.",
            "I think you would need to set up boundaries - express you are not/ or are ok with this decision (but you should explain the reality of the cost of the degree- You can't be the \"get out of jail card\" from monopoly whenever something does bad). Just cause you can be the financial provider does not mean you always should (are you positive you can do it your whole life/ kids, taking care of parents? Emergencies? Retirement? ). Marriage is based on equality (not necessarily money related), but it is the general thought of pursuing it that counts. Unbalanced relationships are not healthy and at some point losing independence does a lot of mental damage.  \n\nBut a temporary part time situation to help the mental stuff might be more ideal, and the intention to go back into the work force. However - I don't think there are any excuses if you have a will there is a way - I work in healthcare and I have seen miraculous things with determination.\n\nTL;DR - communicate your financial and power dynamic reasons - get the therapist... hold of on the leaving job for a little or shift to part time temporary......... Or leave if she is not being receptive to your needs(Im assuming your not, but I just mentioned in care)",
            "I think if she is a good person deep down and you stand by her now, she will stand by you when you need her. I would talk to her about entering counseling first before making life changes so she can do it smoothly emotionally and financially at first. With mental health help she may not want to take a break at all. Combine therapy with meds. She need to talk to a doctor about what \"working out enough\" is and her fatigue.\n\nI feel like everyone freaks out like this after school because they BABY you in school. Most young professionals take at least 2 years to really get adjusted. Having a stable home life helps expedite the process. You sound stable so I advise you to seek counseling for emotional support and tools for helping out a sick partner in their time of need. I don't think enough supporters get the help they need to endure things like this.\n\n&#x200B;\n\nNutshell:- therapy for you both to help- doc appt for physical therapy for proper fitness & nutrition(nutrition is everything when you are having energy issues)- in therapy - agree on deadlines that the PT issue will end and iron out all the financial issues before committing to changes.\n\nMaybe she should just look for a different job too instead of cutting it in half. Maybe her job actually is a crappy draining one and she doesn't know any better as she is fresh out of school.Good luck to you two!\n\n&#x200B;\n\nI think you should cut her a bit of a break. Cancer in your 20s isn't suppose to happen.  \nYou sound like you can afford it so hey.... there is always more money. Good people are hard to find.",
            "I went down to working 4 days a week instead of 5 for about 6 months and it transformed my attitude to my work. When I went back to full I was so much happier. That extra day was invaluable to improving my mental health and my life. Surely 80% salary would be manageable financially, and a good compromise?",
            "So, me and my partner are in kind of in a similar position here. I was diagnosed at 21, treatment lasted a year. I ended up dropping out of uni and had to quit work as I couldn't cope. I also had pre-existing mental health conditions too (Anxiety, depression, PTSD and then post cancer PTSD). Luckily, I'm in the UK though, so no medical debt. I had been intending to go into a medical field, but absolutely couldn't after spending so much time in hospitals.\n\nI went back to work full time after that, but after a year I had a break down and ended up quitting. Then I found another full time job and a year later had another break down and came to an agreement with my work to quit.\n\nMe and my partner talked extensively about how we would live. We came to the agreement that I would work part time and have proper therapy. I work around 30 hours a week and I can manage my mental health a lot better around that. My partner works full time. I do pretty much everything around the house and all the cooking. It works for us. With bills, I pay 40% and he pays 60%.\n\nIt took a lot of talking. I felt a lot of guilt. But has said he would rather have me healthy and he never has to worry about chores. We had to find the right balance though and it took a long time. If he decided he wanted to cut back on work then it would require more conversation to find the right balance again. We both pull our weight.\n\nI think that therapy has been the thing that has helped the most, apart from my partner. I think she needs to know how you're feeling about everything, especially because of the debt from the degree. Couples therapy might be a good place to start, especially with someone who has experience with life after cancer. It cant take over the rest of your life or be the card that is played in every fight. I know I was guilty of that early after treatment until my therapist pointed it out and said I should start living for now not then.\n\nIt might even be worth her looking around for other jobs that she would be qualified to do and be happier doing. My job has nothing to do with what I intended to do when I was at uni. A time frame would also be really important, can she go part time for an agreed length of time, have some therapy and get a bit more settled, then another conversation to decide on the future?\n\nNeither of you is in the wrong, it's just getting to an even ground.",
            "I feel that having a well communicated plan is key, such as therapy, wellness plan (food/exercise), and timeline of half-time. I would say maybe give a time line of a year, with a reevaluation of where she is at in 6 months. As well maybe have her keep a progress diary, nothing negative in this. You should keep one as well so that at the 6 month mark you will have notes to discuss during that evaluation.",
            "Would you consider working through a plan with her?  For instance, if she spends one hour of her new free time going to cbt so that she has the personal/mental skills to deal with anxiety when she wants to return to full-time work.",
            "I have a degenerative autoimmune disease.  I also have two graduate degrees.  I'm currently working 34 hours a week (four 8.5 hour days, with Wednesday off).  Right now things are medically managed pretty well, but I still have some pain and a lot of fatigue.  Having Wednesdays off gives me time for doctor appointments, rest and self-care.  It means I never have to work more than 2 days in a row.  But according to my government job - anything over 32 hours is considered full time.  I don't know what the requirements for loan forgiveness are - but there might be a way to cut down a bit and structure time differently that will allow for more rest while still meeting the requirements.",
            "I can understand your partner's increased anxiety and desire to go part time. I deal with the same thing, for different reasons. If she allows herself to withdraw to part time without examining WHY her anxiety is too strong to overcome, it might make things worse. Can you ask her to go to counseling to explore why she is wanting to do this, and if it's the best thing for her? I'd hate for her to do it, and then wind up holed up in your home, not engaging with the world. She needs to deal with the emotions she was too busy fighting cancer to feel, and not let them control her future.",
            "It honestly just sounds like she's being crushed under all the stress and needs to get away from it, but can't offer you a solid time frame on when it would end.\n\nI'd advise to maybe go with it in short bursts, but not to say that things need to change after X amount of time, but rather that after X amount of time you two need to sit down and hash out your options again - to check in and see how things are going.\n\nShe might feel rejuvenated three months from now. Or you might be ready to call it quits three months from now. But neither of you know that right now. \n\nIt's better to have check in points than to just leave things alone indefinitely or to plan out a rigid schedule.\n\nJust figure out a good time frame you'd be willing to *temporarily* shoulder all that burden for, and plan to do a check in at that point, as well as halfway *to* that point. Reassess and reevaluate your options as that time passes without making any hasty decisions along the way, if you can.",
            "The only advice is to figure out how you feel and then examine that and make a decision from there. \n\nMy only advice is that if you plan on having children with her you seriously rethink the \"the disproportionality it would create in our relationship\" statement. Cause I don't think you'll also be pregnant.",
            "I want to stop working full-time too",
            "I think she needs help to work with her anxiety and dealing with the health issues before she quits work. She's going to have the same anxiety without work. work is not the problem. Her mental health is. \n\n&#x200B;\n\nTherapy. Stat.",
            "Because of her anxiety, depression, bad choices (expensive degree), and health,  she is never going to contribute much financially. Not to mention the imposter syndrome she is experiencing. Expect that your income is going to be it and anything she brings in is a bonus. If you can't change your mindset, then you need to be with a different person.\n\nYou keep saying that the relationship is \"unbalanced\" because you make more money. But there is much more to a relationship that money.  Do her other attributes balance out her lack of income?",
            "Are you kidding me? If she's working part time, she's still contributing and if you make *so* much money, then it's a non-issue. Support your woman. That's the point of a committed relationship. Eventually she may go back full time or she may not. She went through a huge health crisis and there is no guarantee the cancer won't come back. Let her live the way she wants to. If she works 30 hours a week, she's still pulling in money, perhaps the majority of her income can go to bills and student loans and your income is what you use for savings and living off of. Pull your head out of your rear and have some empathy.",
            "Is there a chance she went into a master’s program to avoid working? She sounds like she just doesn’t want to work. No one does. Everyone has imposter syndrome. No one just has time to work out. Everyone is stressed. She needs to go to therapy, not work part time. \n\nThe loan forgiveness program IS NOT A GUARANTEE. Only 1% of applicants are approved, even if they meet all the requirements. She has to figure out how SHE is going to pay those loans off. $100k in loans to work in NFP/Govt/teaching is literally insane.",
            "I mean you aint wrong for not wanting to be the only bread winner. would she at least fill the part of a stay at home wife(cooking cleaning etc) if she expects you to play the part of the typical 50's salary man?\n\n\nAlso who is she expecting to pay her $100,000 in loans if she aint working...",
            "[deleted]",
            "[deleted]",
            "You don’t owe her your money. I’d talk to her and explain that you do support her working part time, but that support will only be emotional. Let her know you’ll pay for your stuff and some of the stuff you’re comfortable paying for he, but stuff like her school payments are entirely on her. That’s just how it is. \n\nAll life is crazy. Nobody knows when they’re going to die. She deserves a year to work it out, but not at the cost of you carrying everything. And honestly, I’d ask about if the situations were reversed what would she do? Would she go back to work and earn all the money if you got cancer? That’s a huge responsibility to put all on you. \n\nBut maybe she’s not even assuming youll carry more? Maybe you’re taking that on without her asking? Have you guys set down and figured out a financial plan for the future or anything? \n\nAll you can do is talk more. She went through trauma, but so did you. I know if my boyfriend had cancer I’d be devastated, and caring for him for at least a year like you did would be extremely stressful. You need to take care of yourself and stop stretching yourself so thin to keep her comfortable",
            "I would ask about a timeline on how long she wants to do the part-time thing and what is her plan for after this part-time phase? Like is she going to be trying to find another job or will she be able to automatically go back to full time? What are some other resources her job may have that can accommodate her during this time. Maybe using her vacation/sick time to take some time off work, consulting with her doctor about some solutions.",
            ">Now that she has graduated and started working, she is miserable at her job mostly because she is incredibly anxious that she isn't doing it well and doesn't feel like her school prepared her. She was already prone towards anxiety and depression (she takes medicine for it) but mentally she is in a very bad spot because of all this. On top of that she feels like she doesn't doing enough for her health (mostly exercise) to keep her healthy to reduce the cancer from coming back but she says she is too tired after work to do much else than occationally go on a walk.\n\nIs she in counseling?",
            "a few quick thoughts on depression from someone who's been depressed ... cognitive therapy is a form of skills based therapy. cognitive therapy would help her to reduce the frequency and power of her negative thoughts. ACT, CBT, DBT and MCBT are different forms of cognitive therapy ACT and CBT can be learned from a book although it's better to work with a therapist. DBT has a very steep learning curve so it's better to work with a therapist or go to a DBT group. i have no experience with MCBT, all i know is that the M stands for mindfulness.\n\nyour girlfriend should start going to group therapy and support groups. the DBSA is a good support group for people who suffer from depression. Recovery International is a support group for people who suffer from any form of mental illness. i don't know if there's a support group that's specifically tailored for people suffer from anxiety. she should also join a cancer survivors support group. therapy groups and support groups tend to be scheduled for evenings and weekends to make it easier for people to attend them after work.\n\nthere are two short books about personal finance that might help you with your discussions of how much income she needs to generate to contribute her fair share. 'the one-page financial plan' by carl richards and 'the index card' by helaine olen and harold pollack. i recommend both books because they take different approaches to personal finance but they're both worth reading.",
            "So, relationships are about ebb and flow and you take a lot on already but i think you need to consider a lot of factors here b/c part of a relationship is working towards a life together and sometimes that requires sacrifices on everyone's part. If this is the way this ends up going, is your partner worth it to you? \n\nI know you believe in equal parts in the relationship but that doesn't always work out that way. It's just how the world works out sometimes. In her case, health problems can really screw stuff up but i think you two need to figure out a working plan on how things will be paid for and managed if you go this track. \n\nAgain, I love your attitude here about equity! But relationships are always equal in reality. But what happens if you need to quit your job for a time? What happens when you get a house or a car or have a kid ect. You need to consider these things and i think you've got a harder question to ask your self here. Is this what i want? Am i willing to make a short term change for the one i love? \n\nI def don't think she's using you but i do think this is a test in your relationship. These is something you need to think through for the longer term.",
            "She Ned’s individual counseling and you both need couples counseling.",
            "Who’s doing cooking and housework? Outsourcing that or you doing it could give her the extra time and mental space she needs. Since her working full time is so important for the loan maybe make sure she doesn’t waste energy and time and mental energy on things you could do or pay someone to do",
            "I think if you guys could agree on a time frame, that might make you feel better. I'm a little biased I think though, having gone through something really similar as your girlfriend, so please know that, too. First, you are a gem for supporting her through such a rough time. I guess try to think of it like the rough time isn't over. I'd say, \"okay, you can work part time until January. During that time, you will go see therapist/psychiatrist whatever, and commit to an exercise plan. When January comes around, you'll need to get a job so that we can both start saving for our future.\" Something like that maybe?",
            "I totally appreciate how she feels, but what she needs to do is get into intensive weekly active therapy with someone who does CBT & other management modalities and work on learning how to manage her mental health. It will help her be happier and more balanced in the long run if she puts the work in now. If she sits back and takes the part time work etc approach, she will end up sliding into a rut. It's avoidance, and speaking from experience with my own mental health, avoidance doesn't work at all and just ends up with you in a shittier situation that's harder to dig out of.\n\nThis is hard for you too, but this should be a line in the sand for you, either she gets a good therapist and starts serious work on her coping skills, or your relationship has to be reconsidered. Otherwise you'll end up resenting her in a little while and resentment is a relationship killer.",
            "Has she thought about picking up a lucrative hobby that can generate income to help pay down debt and potentially help her become F.inancially I.dependent so she came retire early? It may take awhile, maybe years, but it's better than going at this with no real plans other than \" I want to work part time\" :s",
            "Look into Talkspace. They are on a number of EAP panels. They also have differing plans for private pay to help with costs.",
            "I'm sure going down to part time would be beneficial for lessening her anxiety and figuring out who she is now - post cancer.  It seems though that the anxiety isn't going to dissipate and it will instead just transfer to you.  Finances aside, the responsibility to provide for BOTH of you - relationshipwise - should be equitable too.  Help her understand by conveying to her that maybe some of the work stress she's feeling is how you might feel if you are the main provider.  She may not know how you are feeling, but she sure knows the feelings she is having and probably wouldn't want you to feel that way.  \n\nPerhaps if part time work isn't feasible for your relationship, you can help make other aspects easier for her.  She's had a rough time and may need more from you such as help and motivation to exercise or healthy dinners made for her sometimes.  What's her love language?  Can you provide for her in other ways to help her destress?  It is a bit of work on your part, but if you're in a better place to provide that, then you can possibly steer away from financial work issues.",
            "Marriage is a partnership and in a situation like this I would recommend going to counseling.  There are ways to still work fulltime AND exercise.",
            "Keep in mind that just a generation ago this was a completely normal state of affairs.  Why do both adults have to work again?",
            "Yeah that is a lot to put on you. I wonder if she can find work where she works from home. When I switched to working exclusively from my home office, suddenly it was much easier to get my workout in in the morning, and now get laundry done, and things that I just never had time for because of prep I was doing to go to work and the time it took coming home and the energy loss. I work full-time just like before, but now my time is managed much better, at a pace that really works for me.\n\nAt the very least, she needs to work the amount of hours required to get the loan forgiveness, because it is a stupid idea to do otherwise, and I believe she owes that much to BOTH of your futures!  \n\n\nEDIT: After reading more comments, I have changed my mind. She needs to focus on her health. There might be a different way, but I think you need to listen to her when it comes to her health. You said you can afford it. In my situation, I would not be able to afford it if my boyfriend went through the same thing, but if I could...ya I would want him to drop whatever work he needs to drop to get his head and body in the right place. I think he would do the same for me. Her health problems are real, no one wished them on her.",
            "Can you clarify the timeframe a little.\n\nHow long ago did the cancer go into remission? How long have you been dating now? How far into the relationship did she move in with you?\n\nIt's one thing to need a lot more from you in the first year or even two maybe after remission, but at some point she needs to stand on her own two feet to stand by you in an equitable relationship (and not force you into the role of her long-term care provider).",
            "I see where you're coming from and you're not being unreasonable. However,  I think you should tackle the biggest problem first, which is your partner's mental health - for piece of mind tho,  see a financial advisor! Perhaps you're missing something about your finances (you know, ever-changing laws,  loopholes you can use, etc.).  It's worth asking to an expert before deciding what you can or cannot afford). \n\nAnyway, one positive thing about your fiancee's situaton is that she acknowledges that she has a problem and is seeking the appropriate venues for help (reduce stressors, exercise, eat healthy,  etc.). I feel like the best course of action atm is to let her do this, so that she can get to a place, mentally,  where she's ready to work on the elephant in the room: her trauma from cancer. \n\nOfc it changed her priorities in life, she's not the same she was before. She's maybe feeling a bit lost... Working part-time will only work if she sees a therapist, otherwise her anxiety will just stop being about the job and shift to something else.",
            "Question - Do you love your job? Dead set on keeping it? \n\nIf so why couldn't you both go part time? Make your budget leaner and possibly move so that you both contribute equally is also an option. \n \nY'all will really have to talk it out. \"Hey, I'm going to be working full time which I'm okay with if this is either going to be part time or if we find a way that we can contribute equally to the relationship.\" 💖💖 GL!",
            "Her debt is a big problem.\n\nOtherwise I would tell her sure she can work half weeks as long as she does ALL the chores in the house including meal prepping and lunches. All that stuff. \n\nHousewives are a thing for a reason, I would gladly work full time and let her work half or less if I could avoid all that stuff. \n\nI highly doubt she would be up for that tho.",
            "If she's doing loan forgiveness, the payments/jobs don't have to be consecutive. Sure it would be nice to get the loans forgiven sooner, but her health and happiness is more important. She just has to work 10 years in a qualifying job total, it doesn't have to be now. \n\nIf her current job is truly so terrible, she should start looking for new jobs and/or take some time off. \n\nYou don't need her income to survive, yours is more than enough. So if she were to totally quit for six months or a year, and then go back to work, that might be better than her working part time in a job she hates that doesn't pay all that much and won't forgive her loans. That time can be used for her to recover, heal, and prepare herself for a job that she actually likes. \n\nYou have options here, not just the one she proposed. So explore all the options.",
            "My suggestion is couples counseling after you speak to her.  Let her know the apprehension and ask to go in and talk and find out how to communicate in a healthy way.  After this is done you can figure out what you want to do.  She may not see how this affects you, whom she wants to depend on.  And you may not see her point of view fully.  Good luck!  I hope you two work it out.",
            "I would continue to hold firm in stating that I wasn't comfortable with her plan, and see if there are any other options for her to apply to different jobs that might be less stressful. Or if there is some other way for her to freelance or consult or do some other type of work that would still qualify her for the debt forgiveness.\n\nI understand that she has a lot that she's working through, and people are right that she deserves support. But telling you to get over your discomfort and shoulder the entire financial burden seems really foolish to me and a great way to build resentment over time. You need a compromise that doesn't lay a groundwork of resentment going into your engagement/marriage.\n\nThere needs to be a timeline in place, at the very least, and a concrete plan for what steps she's going to take to get back to permanently working full time after X months have past.",
            "Well her loans can go into an Income Driven re- payment plan based on her new part-time income. It doesnt have to be a permanent solution it may only be temporary. This way she can pay the lowest amount over time and when she feels up to it, go back to fulltime then she can pay more on them. Dont discourage her just yet, I think she's just trying to find her routine again and find out what she loves especially having a near death experience with cancer. she might just be feeling a lull and needs a new motivation to give her life meaning. If she wants to exercise more let her just make sure she doesnt accidentally give herself a food disorder.",
            "Life is for living not working. But you need to pay for food and shelter and have some savings for your future.\n\nMy husband almost died before so we take a relaxed view to working. He works long hours in the winter to take the summer months off. I work a short week all year round. But we pay equal amounts to bills all year round. It’s only our own personal disposable income that gets affected by our reduced hours.\n\nShe can reduce her hours if she wants. But you shouldn’t have to pick up the tab.",
            "You're in a  tough spot, my friend. \n\nFirst, she has the right to prioritise her health over whatever financial goals you both might have had prior to her illness. It's true that coming so close to death (and not being rid of it) changes your worldview entirely. I think you might be misunderstanding and underestimating how much having cancer and facing her mortality like that, and not truly being free from it (cancer could return) affects her. \n\nSo I wouldn't agree when you say she is taking advantage of the situation. I think she is clearly overwhelmed. It's hard to struggle through the mundane tasks of whatever her work is when being faced with the possibility of death, and it's very possible that this is not even a conscious thought, but an unconscious fear that dogs her every step.  Work has likely become meaningless to her, which doesn't mean it's fair to you. She is clearly already anxious and needs help (which she has done, she's being medicated). *I believe she 100% needs therapy right now*. She is panicking and that's why she's throwing in the towel entirely when it comes to work. Don't panic along with her, she's very likely to change her mind about it. \n\nMaybe she doesn't want to work in her field at all, which she might be too embarrassed to acknowledge because she clearly put so much effort into it, and even asked you to support her during it. But she may feel that anything else, choosing any other work, would be deemed a failure by you, her family, I don't know, whoever. So she panics and says \"no work at all\".\n\nI would suggest you have this conversation. Maybe you can sit down and talk to her about it, honestly. Is it any work, or just the path she has chosen that drains her so entirely? If she knows she has support in stepping away from her chosen field entirely, then she can work anywhere else. \n\nYou dilemma is not coming across as an asshole who only cares about money, and it's a delicate time so she may very well see it as you being unwilling to support her, especially since financially you *can*. That doesn't mean she is entitled to your support, but relationships aren't business transactions. \n\nMy advice would be to try to find a solution to why work overwhelms her. Therapy will do that. Maybe you can agree to shoulder the expenses until she is ready to work provided she agrees to work towards the goal of earning *some* money. But I would approach it from the angle above first, before you make it about money.",
            "I totally see your side of things, financial imbalance is definitely not fair. That being said, cancer can take an unimaginable mental toll, and maybe taking time off now is what she needs to be stronger in the future, rather than go further into anxiety and depression and the devastating effects of that. I think this is just something where it is important to compromise, and remember that health has to always take priority over money.",
            "Tl;dr: Support your fiance in a way that supports you too. Have this candid conversation and get on the same page. Your girlfriend isn't freeloading, but you're both in this transition right now, of this post-cancer pre-marriage lifestyle. Life is going to throw curve balls at us that are going to require us to adjust accordingly at unexpected times. So adjust. See my story below. \n\nSo, I've never had cancer, but I've been a hard worker my entire life. And recently, it hasn't been paying off. I faced the reality that my career choice wasn't what I had expected, that I wasn't appreciated in my company nor compensated reasonably for the work I was doing (a field wide problem) and was bringing so much stress home with me, that I just didn't feel like doing anything once I got home, which is unlike me. \n\nSo, I shared this with my fiance, with my goal of only working 3-4 days a week, and be making in that time what I've been making working 50+ hours a week, and I've been doing that. I'm happier. I'm doing more around our house and cooking more often. And I'm working on actually living the life I want to be living versus that societal norm we were both sold, and it's working for us. But it's absolutely something I could not have done without my fiance's trust and support. We've had scary moments and leaps of faith, but again, it's working out.\n\nHappiness doesn't pay the bills, but it feeds my soul which is what gives me the motivation in the other domains of my life. Deciding to do this was a joint decision, where we both talked goals and fears. I want to be a mostly stay at home mom and a business owner someday. Cutting down on my work and creating a lifestyle that supports that now, is making me happier and preparing is for that transition. Rebalancing our finances is preparing us for that transition.\n\nIt's great that you're in the mindset of both your monies supporting both of you if you're marrying each other, but having the mindset and practicing it are two different things. So lay it all out. Goals. Fears. Budget. Look at the big picture together, and collaborate on how to make this work.",
            "I think what is going on here is you do not feel appreciated. It sounds like it is not money it is the inequality of it. She chose a degree you thought was not worth it, but you supported her. She got an unforeseen illness and you supported her. Life is too hard now, and you are willing to support her. What about you? I feel bad for her too, but what about you? Allow me to pose some questions. No need to answer, just think about it. \n\nHow will you feel if she just doesn't want to work anymore? How will you feel if you give her what she asks for, free time, and that actually makes it worse?(Time to sit and stew usually doesn't help depression) What if she wants to travel after she quits her job? What has she done for you lately? When was your last foot rub? Has she ever said she understands how unlucky you are too? Does she understand this happened to both of you? What burdens does she shoulder for you?\n\nI hate sharing, but this story got to me a little. I am the sole breadwinner and we have no kids. Never once have I ever felt it was uneven. My wife has always made it a point to appreciate me. I won't list the things out of embarrassment, but my point is what do you get? I know that sounds shitty. If asking it makes me shitty too that is OK. She probably isn't malicious but when someone falls, we want to pick em up. We do kind of expect some kind of thank you for it. You might say expecting a thank you makes you shitty, I agree, but we all kind of do expect it a little. Not thanking someone is shitty too,shittier in my opinion.\n\nYou are a human being with needs too. Just because life has been hard to someone you care about does not mean those needs go away (they increase). This feeling of unbalance will only get worse. She is  focused on her, and you are focused on her. I am focused on you, and I think you are in for a bad time if something does not change. You are in a awful position. I guess my last question is, do you want to be the \"bad guy\" or unhappy? If you have anything negative to say to someone with depression who just survived cancer, then by most opinions (unfairly i think) you are the bad guy. If you want to save your feelings for her, the sooner she understands and starts helping you too the better your chances. \n\nGood luck and take care of both of you.",
            "This is an excellent plan. You’re only as strong as each of you individually. You both need to give equitably and she is unable to do so if she’s not given time to heal mentally. If she does go through with a temporary shift in a job setting, the work will still need to go into making sure she’s the best she can be for this relationship. Carrying the team is really difficult, but wouldn’t you find solace in having the same from her if the time comes? Life is weird, relationships are weird. Give lots of love to yourself and give where you can to her to make her day better. \n\nI’m sure she knows the sacrifices that come with a reduced household income. These can be a giant weight to bear for both parties. Making her feel guilty for not being able to chip in while she heals won’t strengthen either of you. Come together and find a way that makes it work for both of you. It’s not an impossible equation, just takes work, and compromise, from both sides. Once she gets through the trauma and works her way towards being better, her confidence can grow and she’ll be able to thrive in her career. \n\nI wish you both luck and strength through this one!",
            "Work sucks at the best of times. It’s completely understandable that she, after suffering a chronic illness, “doesn’t care anymore” and wants to prioritise her health. I know someone else in a similar situation. I mean, in the end, if you know you might die sooner rather than later, what does money mean? The problem lies in the fact that you are perfectly fine and that she will be living off your dollar. The only decision to be made here is: do you want to do that? Do you want to support her? Because loving and being with her means just that. She’s not going to reach some epiphany and fall back into a money-making mindset anytime soon. A life-threatening illness will do that to you. She does need therapy for her other issues (insecurity, grief, etc.) but essentially her priorites have changed. And it’s ok if you don’t want to “shoulder the burden” if that’s what it will be to you. It’s a lifelong commitment and it’s tough. You also deserve to be happy.",
            "OP, I think the amount of thought and empathy you're putting into this situation is truly admirable. You're paying attention to your gut (that uncomfortable feeling) while also taking into account her experiences.\n\nYou say you worry about being selfish or an asshole. This is a legit concern. But as a disabled person who's partner is also disabled (I've seen both sides of this coin) I'm gonna gently suggest you take some time to be hardcore selfish while you think things through.\n\nYou can't take care of your girlfriend unless you are stable and okay yourself. \n\nYou need to look out for yourself and your needs while deciding how to go forward as a couple. It sounds like you love her and want to take care of her, but concerns about how that will affect the relationship and you are making you pause.\n\nAfter reading your post yes I'm concerned for your girlfriend, but I'm also concerned for you're feeling and doing. Like, the person you love got a possibly fatal illness and had their entire world rocked. I'm guessing it rocked your entire world too. Bad things don't just effect the people they happen to they effect everyone around that person especially those closest to them.\n\nSo after your gf's illness and the entire cascade of effects from it what do you need to be able to go forward strong and happy yourself? That could look like a lot of things- therapy for you as well as you guys/her would be totally reasonable. Like, the person you love might have died and had a rough time and needed a lot from you. That's hard and shitty!\n\nI think when you've had some time (and it can be as little as 5 min zoning out in line at the grocery store) to think about what you need it will be easier to plan with your partner from a place of love and caring without feeling like you're getting screwed over by caretaking.",
            "Hey there. \nI understand this is a difficult topic, and i can see it from both sides.\n\nMaybe it’s wise to consider what she would do if she didn’t know you? Would she be able to take care of herself and her debt with a part-time job or would she have to work full-time?\n\nI can relate to this pretty well, because about a year ago i was diagnosed with cancer (for the second time, first time was 13 years ago). I too was studying, and i still am, because of the delay it caused in my study progress. I had surgery and my recovery was long and really difficult. \n\nI really understand why she would decide to work less. Her cancer treatment might be over, but recovery takes a long, long time. Physically but especially mentally. It takes a lot of energy, not being sure about your future. If i was her, i would never started a full-time job immediately after graduating. This can be too much at once. \n\nI’m driven and ambitious, but i’m very conscious about my wellbeing and my energy levels. Therefore i picked up my study and both work for about 50% and gradually increased this, and will keep on doing this. \n\nOff course it’s really important to have a job you like. It does not sound that she is enjoying her work. This together with her impaired energy levels and insecurity about her health can take a major impact on her wellbeing. \n\nTo be honest, i would fully support her, and try to help her to find a part-time job she likes. If she likes it, if she stays healthy, her energy levels will rise, she will get more confident about her health and then she might be able to work more. \n\nMy post might be a bit chaotic, sorry for that. I feel for you both, as i know how difficult your struggles are. I hope you will come to a solution together. But please don’t forget that recovery from cancer is really hard and a long process.\n\nedit: typo’s",
            "Everyone else has addressed the health concerns and those are valid, but, you mention she thinks she is doing poorly at her job.... has she actually gotten any negative feedback? I often get imposter syndrom then my annual reviews are great, I've gotten a good bonus every year, etc... I just tend to overthink things and maybe that's what happening now?",
            "Life insurance policy. Take out a sizeable life insurance policy to cover her debt in case her cancer progresses.",
            "Is she in therapy for the anxiety and depression? Have they given any indication of how likely the cancer is to recur? Will she still be able to make her student loan payments?\n\nI would probably lean towards doing this if she is in therapy. Two years from a diagnosis isn't long and she still has physical and mental healing to do.",
            "I agree with all the comments, this is something that happened to my parents. My mother had a debilitating condition and had to take 5 years off to recover mentally and physically while also managing a household and 2 children.\n\nI'd say to you, sit down as a couple and prioritize. Your goals together and what you hope to achieve in the next 2 months, 2 years, and so on. Remember why you both got into this relationship and what is important about her that brought you to love her, that's what you're trying to preserve, that happiness as a couple.\n\nMoney will work out, stress will work out, all will be well if you overcome this. Both of you have reasonable concerns, so maps those out and see what will be best for both of you. Regarding the loans, her work, and counseling for you both. Ask yourself, are you willing to adapt to this situation to ensure a higher quality of life for her, and will you be happy? \n\nShe should have been more practical with her early financial decisions, but at that time, we're driven by our wants too much to see what's best in the long run. So that is difficult to face as the person in her life and whose financially strong, but you're not in that bad of situation. This happens all the time to couples in one form or another, and many are not as financially stable. Find a way this can be dealt with and whatever you choose, whether you work and she doesn't or whatever, strive to be equal and don't worry my friend.",
            "If you guys are engaged then surely you must know the vows that you will say to each other in the future? \"...in sickness and in health?\" It seems like she hasn't gotten to the health part yet. The world is run by money and it is absolutely important to be financially stable. However, her desire to work on her mental health is important and it very well may cause unequal contribution to finances. \"...for richer and for poorer?\" You make those vows because you believe your ability to love each other is stronger than the hardships you may face. There are many valid factors that can play into why a relationship couldn't work, married or not. But I would ask that you revaluate your situation and ask yourself what your relationship with her actually means to you. There is nothing wrong with being true to yourself, even if that means this isn't the type of relationship you wanted. Your partner went through something terrible and she wants to be better than she is right now. The question is, are you willing the carry the load while she does that and not see it as a burden? Counseling will help you understand each other, and then compromising will not be seen as a hardship for either of you. Because you love each other and you understand.",
            "You’re not an asshole. But I’m able to relate to her in the fact that I have once attempted to work full time, go to school, and somehow not die because I was so sick???? It’s exhausting. That’s just so, so much. Too much for one person to do.\n\nMaybe give her a trial run, then a limited amount of time (6-10 months?) to graduate before she starts working full time again? I do understand both sides of things though and it’s no fun having to be someone’s wallet all the time.",
            "This is the sickness/health part of wedding vows.  But it's also ok that you can't long term support both of you, and it's ok if you long term don't WANT to support someone (and pay off their tuition bills) when they are not willing or able to work full time.  But if you can afford it, taking a sabbatical might be good for her to recharge and set some new goals.\n\nTell her that you are not comfortable with being the sole income earner long term.  What are the options for a short term medical leave - does she have benefits that could cover it? That way she still is bringing in an income, she has some time to manage her health and mental wellness while still bringing in some income.\n\nIf she needs - say - six weeks to get back on track, you can support her for that limited time, but after that you are not willing to support the household and both partners have to work full time and there has to be a time limit. \n\nAfter the time limit she returns to work full time.  Maybe a break will give her perpective, allow her some time to think and plan, give her a chance to explore other opportunities.  The break would have to include a mental health treatment plan as well. \n\n If she chooses not to return to work full time, then you're free to make a different plan for your life - and it's ok that you need a partner to put equal effort into maintaining a household, even if they earn less. full time=full time and you can adjust your budget to accommodate a lesser paycheque but are not willing to be the workhorse while someone goes to the gym.",
            "She needs better therapy, not you to support her so totally so she can quit being an adult.\n\nIt's also worth noting that if she has been in this job less than a year then the \"I dont know what the fuck I'm doing\" part is basically inevitable and she needs to just ride it out.  That plus therapy and probably a meds adjustment.\n\nThis would earn a hard no from me, and I'd insist on couples counselling so she could understand how unreasonable it is to even ask.\n\n&#x200B;\n\nPS: If you DO decide to go through with this on the view  that she will change her mind or get better in a year or two.... You are lining yourself up for a very expensive divorce and alimony bill.     Entering the workforce gets harder, not easier.",
            "When you get sick like she did it changes your priorities in life. Maybe part time would be best and she can do a side hustle for extra money. There are lots of gig jobs. I work one and make very good money. I work when I want. I make my own schedule and can change it at the last minute. I was sick for 7 months and doing gig work has given me freedom to rest when I need too. I deliver food but there is Shipt which is shopping for people. Amazon Flex delivering packages for Amazon. You can make $20 an hour or more. This is how people pay student loans and credit card debit off a lot.",
            "As someone who has recently been diagnosed with a life changing problem, the only insight I can give you is that it fucks with your head, your outlook, your energy, anxiety levels, fears, hopes, dreams, everything. In my own experience, I am not able to work full time at all and my fiance, like you, find this difficult. The weight has changed in our relationship but the most important thing is that we are a team. In the beginning he felt alot of pressure supporting both of us, but when I almost died something in his head changed and my health became his priority too. \n\nI can see where you are coming from and why you're feeling the way you are, but imagine the roles reversed. Put yourself into her shoes. I think a cancer diagnosis would mentally change anyone's attitude, especially towards stressful things in life, and that's without even mentioning the physical toll a full time job would take. Her recovery and general health are THE most important thing, and I think it's a huge positive that's what her priority is. My point in this comment is that when you find out there's something wrong with you, this prioritising is so important. She's fighting it, she wants to be healthy and have more time to focus on that. Remember the seriousness and severity of what she's been through, and could end up going through again.\n\nI think you're taking the right approach trying to find different ways of understanding this and your feelings. At the end of the day it's between the two of you, but I bet you that your support means the world to her. Its a weight off my shoulders that my fiance has taken away the pressure so that I can be healthy. \n\nI wish you both all the best and hope you can work through it with her.",
            "You guys have totally different perspectives at this point. I deal with chronic illness. My health fell apart after getting my graduate degree. I'm not able to work at all. My husband thankfully has a good job.\n\nI think going half time is reasonable if she starts going to therapy for her anxiety and health disappointment. Dealing with chronic issues needs professional help. Exercise cannot fix a fear of death basically. \n\nThis is really why college should be free. People didn't be put in these situations.\n\nEdit: an option would be to take FMLA leave to try out part time without risking the loss of her job. \n\nTherapy is also recommended for the partners of people dealing with health issues as well.",
            "Personally, I don't think anything will make you feel comfortable with it, except for a time line for when she'd be going back to work full time. It sounds like you're like me, and want a partner in life to work together with. Some people like the whole stay at home wife thing and that's good for them, but I don't think you should feel pressured or obligated to do it just because you make good money. It's not your idea of what your relationship would be and you don't have to be comfortable with it. I think you need to voice your feelings\nLet her know you're here to help her get healthy again but you're not okay with this being your relationship and need a time line and plan for her going back to work full time.",
            "There is this adaptation curve from being a full time student to a full time employed person. Yes, work can be miserable, but you also need to get use to it first. Working is not the same as school. You wont have time as you used to anymore, it is part of growing up and becoming an adult. I understand that she had cancer but these thoughts in her mind are quite normal on people. \n\nWorking part time won't really fix it, as eventually she wil have to be part of the matrix. It is a shame, I know, but if she really wants to escape the matrix and start living in her own terms, she needs to have some business idea or write a best seller, otherwise, we are all together in this.",
            "I get where you're coming from, people may call it being selfish/greedy if they want, but we're really just humans at the end of the day. She needs a break - she jumped from grad to a full time job while being treated for cancer in-between on top of it. Even a strong person would crumble under that pressure, I'm honestly amazed that she hasn't had any sick leave? Is that not a thing where you live?   \n\n\nIt's a great thing that she is being vocal about it, many tend to just keep on working until they reach the point of a burnout - and then it takes EVEN LONGER to heal. She's aware that she is stressed to the point of only being able to go for a walk after work, even though she used to work multiple jobs, as you said yourself. Try to see it from that perspective. You know what kind of person she can be.  \n\n\nEveryone needs a break once in a while. What you're saying is essentially that you're afraid to be taken advantage of - that you don't want to become a caretaker in that sense for the rest of your life, perhaps a bit upset that she even suggested going part time in the first place while being aware of the debt that needs to get paid off - a debt you don't feel should be there, because it wasn't highly necessary in the first place. It's almost a taboo to say \"I'm actually frustrated with this outcome, because it wasn't part of the plan we made\" once cancer is involved and you're a partner/family member - it's okay to feel that way, really. Diseases don't care for plans though, that's what we gotta keep in mind. She didn't choose to get sick, hell, she really tried to push through with it but has had to admit that it just isn't working for her right now. She still sounds driven to me.",
            "I guess it's a difficult one. My partner had leukemia before we met. He's been in remission for a couple years, but he stopped working when diagnoses as obviously he was going through treatment and regular blood transfusions as well as basically single handedly looking after both of his maternal grandparents as they had dementia.\n\nHe has not been working since. And luckily has the money to be able to do it comfortably, but he gets very bored with not working and feels well enough to get a job now, but he still has regular hospital appointments (normally 3 or 4 a month) so finding somewhere happy to work around those is difficult.\n\nI guess what I'm trying to say is its difficult. She's been through a hell of a lot, and majority will probably side with her due to that. But you need to both be comfortable with your finances and, as harsh as this may be, she needs to think about the future because there is no guarantee she will get sick again.\n\nMaybe it is worth considering some kind of mental health input as it sounds as if she may hVe anxiety and/or depression. Not surprising given what's she's been through but working less will probably make her worse almost as she'll be socialising less, therefore she will find it easier to be withdrawn. \n\nSorry its so long....",
            "I think if you can afford it then you should support her going part time, that's what I would do.\n\nI also went through a horrible traumatic illness while completing my PhD and I didn't take time out or take it easy even though I should've just looked after myself and properly recovered from the trauma, and it just really fucked me and I regret it totally. I think if she's asking to go part time instead of just not working at all then it seems like a good thing to do, if you can afford it. This is the person you're going to marry, your family, and she's asking you for help. \n\nMy partner also went through mega stress at work and I now earn more than him, and offered to cover the bills for him to go part time because I just hate seeing him in a terrible state. It's just what you do for each other. As long as she does things for you as well and supports you in other ways then it's worth helping her with this. Maybe ensure she goes to therapy weekly or something as well, so she can concentrate on really building herself back up.\n\nIt totally messes with your confidence and everything to have a serious and life threatening illness at a really young age. Having someone supporting you, telling you it's ok to ease up a bit and look after yourself is really helpful. It's also great that she's recognised that she needs to take time to recover, as for a lot of people who are ambitious, they keep on pushing and pushing until they totally burn themselves out and just can't cope anymore.",
            " When I switch jobs I usually have the “imposter syndrome” for at least the first two years and feel overwhelmed and think constantly about quitting,looking for something better. \n\nDuring the third year it tends to die down. And I’m in my 50’s now.    I wonder if the anxiety is because of that. \n\nI get the cancer diagnosis being a life altering thing.  I almost died from a virus in my 20’s. But I still go to work, I just try to enjoy life as much as I can out side of the 40 hour work week.  Also, I think the work she did toward her profession shouldn’t be thrown away easily. \n\nAlso, are you planning on starting a family one day?  If so that would be the time to allow her to stay at home.  \n\nI’d also worry about what happens to her if for some reason you pass before her. She sounds totally dependent on you and that is not healthy for her.",
            "If anything, consider it, ask her if she could consider going back to full time eventually or to simply ask her if she could think a bit more, that you won't always be able to assist her. Though if it were that she wanted to completely quit and stay at home i woulda said get outta there",
            "Are you two married? You don’t gave to pay her loans — she can do a forbearance or income driven repayment? \n\nAlso I’m surprised she’s willing to even work part time. Cancer’s a beast and maybe she’s in denial about needing a total break to recover.",
            "Tell her not to do it. It is the worst thing she can possibly do. I suffer from the same anxiety and often dream about a life in which I didn’t work. But her life will become hell - getting smaller and smaller as she gives in to her anxieties. She needs to work on the anxiety, not leave the job.",
            "If your financial situation makes it possible without any strife and it would clearly benefit your partner in a magnitude much greater than it would the average individual, the only issue is your discomfort with the greater disproportionate nature of your work and relationship. You have to ask yourself why that is. It sounds like you may place too much value on work, people have inherent worth beyond their occupation. If you don't view her as a burden because of this, which you shouldn't based on how you describe your finances, you have to remember there is just as much dignity in working part-time as full-time. The only imbalance would come from you yourself treating her differently, it doesn't just naturally occur.",
            "If you are ok supporting her potentially for ever stay in the relationship.  If that is not something you think you can live with then let her know and be prepared to move on.",
            "Less than 10% of public service loan applicants are accepted so just wanted to throw that out there",
            "I can see both of your sides, and I know it can be daunting if she were to work part time, but it's a small part of your life and won't affect you negatively long term. And I'll be honest here, I recommend everyone work part time if they can afford it. You too.\n\nHeres the thing - if she continues working full time, she will have a break down and burn out in the near future. This will end in her quitting and umemployment will last MUCH LONGER than her working part time for a while. \n\nShe is unhappy and she is actively working on herself - this is super important and proactive. If she doesn't have her health, she doesn't have anything.\n\nIf I was in your shoes, I would tell her to go for it. Let her work on herself and do what she needs to do. Don't worry about a timeline - she doesn't sound like a gold digger, she sounds like she just needs time and she has already proven she can commit. The one thing I would say is if you're concerned, drop your budget down and live on a little less for a while. Then financially it won't burden you and she will understand.\n\nIn my relationship, I worked part time when I met my husband and he worked full time.\nThen we both worked full time.\nThen I worked full time while he quit his trade he hated and depressed him.\nI worked full time while he stayed at home and taught himself his new job for 3 years.\nI dropped to part time while he was still not earning at home, because I burnt out. We made the drop in money work.\nNow we both work part time, together, because those years he 'took off' made him create his own job that financially supports both of us.\n\nHad I said no, we'd both be stuck in shit jobs working full time unhappy, sick and depressed.\n\nGive her time. Be her shoulder. Support her. One day she will take the load off you if you get sick.",
            "As others have said all her feelings are valid. But how you feel is important too.\n\n\nAt some point you have to decide if it's all worth it and whether you would find a more equal relationship elsewhere.\n\n\nYou're not an asshole for doing so.",
            "I have a colleague with a very similar situation, but on the other side. Going through her cancer really marked her and even months after coming back to work, she couldn't handle a full week of work. Having your life endangered like this really does something to you, you want to treasure everything and you kind of have new priorities. Your energy tank will NEVER be as full as it was before cancer. She's been working part-time for about 3-4 years now. She has a child, too, and it's a big priority to take care of herself and her family. She once told me her husband was having the same concerns you have at the beginning, and ended up accepting it. Gradually, she did feel a bit better, had more time to work on herself and build herself up. I do think she was depressed when we started working together and I see the change in her. She now accepts that when we have busier weeks she'll have to work full time or when I go on vacation to cover for me, but it's not something she could do all the time. She also takes a few freelance contracts here and there. On the other hand, she is not insured by our workplace since she's a contractual part-time now, but she does have insurance with her husband's work, so make sure you can cover for her because that's another important part of the puzzle.\n\nI would say give it a go but she needs to see someone. She definitely seems to have depression or something like PTSD, but I'm no expert. This is about her health, more specifically her mental health, it is NOT about the money and it doesn't make you an asshole to think about the financial aspect of it because it does have consequences.",
            "Sometimes it isn't working itself but the job that's causing distress. I quit my lucrative job to go work in a little bookshop to preserve my mental health when it needed it, best decision I ever made. Maybe something a little less hardcore would be helpful.",
            "I'm late to comment, so I hope you see this. I'm a young adult cancer survivor. She's going through post cancer depression and anxiety. I went through this as well, and for me, this was by far the worst part of cancer, especially the first year post treatment.\n\nThe physiological side of cancer is hardly talked about or treated. I wanted so bad to figure out everything I could to make sure it didn't get it again. I did extreme diets, became a gym rat, and further added stress to my life, but I felt like my life was so out of my control so this was one way I was trying to find the ground under my feet again. I felt that working full time was a waste of a life. I couldn't understand how I could just let my life float by by spending the majority of my life at a mediocre job. I felt I had to do everything I ever wanted to do now with extreme urgency before I got cancer again.  So I spent 4 months traveling around the world alone figuring out my next steps. \n\nWhen going through treatment, you're so focused on getting through each phase of the treatment. You've got a whole medical team, tons of people offering support. But then when you're finished and in remission all the support suddenly isn't there and they basically pat you on the back and send you on your way and people think you're back to normal, but she's got a new normal now.  When the dust starts to settle post treatment and you start to fully realize everything that's happened, and it's a real mind fuck. \n\nThis weekend was my 7 year cancerversary. I'm in remission still, but cancer drastically changed me. I still fear it and worry I'm not doing enough to live a good life. But that's my new normal and therapy has greatly helped me manage all this and ground me. It's hard being a young adult survivor because most of her peers don't know what it's like because they've never had it.  \n\nYou're never going to be able to fully understand her emotions regarding this. She really needs to talk to other young adult cancer survivors like her to know what she's going through is totally normal. Therapy is also key.  Hospitals are a good place to see what is available. She should also check out First Descents and Camp Koru to meet other survivors.",
            " I think there's also a point to make here and that's that physically and mentally, your relationship is also unbalanced. You are healthy, she had cancer and is not in a healthy state mentally, and can not be expected to be fine after that occurs. Cancer is life changing. I understand you don't want to take on every financial responsibility, she absolutely needs a break. The fact she balanced cancer and grad school is absolutely insane. If she doesn't it's going to be 100X worse. Also....  \"quick fix to her problems that puts us in a pretty big hole financially because she is so miserable instead of fully dealing with her problems.\" Depression and anxiety make it so you can't just deal with your problems. It doesn't work that way. You're going to have to be more empathetic if you wish to stay with her.",
            "She's been through a difficult time, but she chose to get the expensive degree which now has to be paid for. It sounds like avoidant behavior from her anxiety. \n\nCreating more unbalance in your relationship isn't a good looking term strategy. She's had to deal with things that she didn't count on, but the shouldn't be the expectation that you should just take responsibility for her decisions because she changed her mind.\n\nShe needs to come up with a solution that doesn't put more burden on you. It doesn't have to be financial, but you should feel like she's contributing equally to the relationship.",
            "I have severe, and at times debilitating, chronic pain. I had a double mastectomy so I wouldn’t die of breast cancer like my mom and 7 of her family members did (BRCA positive, genetic mutation). \n\nI watched my mom go through terminal cancer. It was terrible And I didn’t know until about 3 months before she died. My parents never told me. I did research on my own. \n\nGoing through chemo is something I would never wish on anyone... it sucks the life out of you. Your body changes, you get chemo brain (which I totally understand due to fatigue and a medication I’m on that makes me VERY forgetful). If she had to have multiple surgeries, that takes a toll on you too. \n\nAnyone here who says she’s using you is fucking disgusting. They’ve obviously never had a chronic illness let alone cancer. They’ve probably never even known someone who has cancer and if they did likely had little to no sympathy - kind of impossible to NOT know someone who has had cancer... I agree that getting therapy is extremely important. And a very close personal friend of mine does have PTSD from breast cancer so that happens. \n\nI think it would be a good idea to go to therapy together and for her on her own. Support groups are also a HUGE help. If I hadn’t had the person I mentioned earlier in my life I think I would have gone insane. My husband was as supportive as he could be, but as the saying goes walk a mile in someone else’s shoes before you truly understand. There have been times even now that he’s frustrated by my chronic illness and sometimes I’m a lot better at faking it til I make it... I can have a conversation with him despite huge pain internally and then there are times where my pain is comparable to kidney stones (not exaggerating, read an article on it and started crying because it felt validating... then I found out a couple weeks later my Uncle went through it and he was blown away I’m able to work when attacks like that come on).\n\nListen, at the end of the day, you sound like a great guy and I’m so glad you’ve come to ask for advice. You love her, but you want to see her get more help than she’s willing to get for herself. I truly understand and I wish I could talk to her myself so she had a listening ear. I don’t know what kind of cancer it was, if you feel ok letting me know I can help you find some support groups. I know a lot of women who have been through multiple cancers since my diagnosis of BRCA positive. Please remind her she is not alone in her fight and struggle to get back to normalcy. We are here for her!!! Good luck man. Keep us posted.",
            "I think the question for her is, \"where do you want to be in 2-3 years, ideally?\"\n\nThen, the question for you is, \"are you cool with that future scenario?\"  If YES, then I would work together to manifest that outcome.  If NO, its time to have serious conversations about differences in what you want out of life.",
            "You should do some research on public loan forgiveness. Basically no one has ever had a loan forgiven. I would plan on paying off those loans rather than counting on that program to work the way it is supposed to.\n\nIs she even able to keep her job if she drops to part time? A lot of phD appointments require full time work. I also think that an end date on the part time, maybe even set it up with her work as a medical leave/work reduction, would be better than an open ended time.",
            "OP, I fully agree with the other comments that suggest both of you seeing a therapist. I would recommend doing it individually but also together if you think that would help you guys. Almost three years ago I was in my first semester of grad school (full-time) when I had a seizure on my kitchen floor early one morning during finals week. I was then diagnosed with Juvenile Myoclonic Epilepsy which I never knew I had. I was 22 and had already had my fair share of chronic health issues. Spent a lot of time in and out of hospitals as a kid for Crohn’s disease. I cried my heart out the day they diagnosed me with Epilepsy, because I saw it as yet another label slapped on me, yet another thing “wrong” with me. I felt so abnormal and different, and not being allowed to drive for six months certainly did not help. I lived with my parents and still do (I was seriously lucky I had them at the time) and they drove me everywhere I needed to go, including to my grad classes. The whole time, I felt isolated, depressed, lonely, and tired. My entire soul was tired, and I finally decided to drop one of my three classes after I broke down crying on campus. I had the unique luxury of not having to work while I was taking classes for the first year of grad school. It was exactly what I needed after my seizure and my diagnosis. I was SO fearful for so long after it happened, and the anxiety stayed with me for a good long while. I started wearing a medical ID bracelet which actually became a source of great comfort for me. I really just needed time to recover, (seizures will do a number on ya) adjust to taking new medication with temporary side effects, and just come to terms with reality that I have this condition and I will probably always have it. I did see a wonderful therapist throughout the ordeal which did wonders for me. My current boyfriend is the most special, incredible support system for me even though I wasn’t dating him at the time I had my seizure. He wants to help and understand and be there for me. We’ve even talked about what to do if I should ever have another seizure, and that is SO comforting to me:) My brother went through extremely aggressive cancer (leiomyosarcoma in his colon) and I know exactly what you mean about your girlfriend being a different person now, so is he. He’s still got some of his old spark, but he is SO much more timid now, so anxious about his scans every three months, just a quieter person now. Try to communicate as much as you can with your girlfriend and make sure you come to a compromise! I know you care about her health and well-being, and you should both be comfortable with the decision you come to. Good luck! And good luck to your girlfriend, may she live a LONG and healthy life:)",
            "There's a lot of back and forth in this thread with both sides making valid points. However the debate in this thread (though not necessarily OP's dilemma) can actually be reduced to a single question:\n\nDoes his GF want to start working part time because: \n\n1: It's the best move to get her mental and physical health back on track post-cancer? [Legitimate reason]\n\n2: Or because she's the personality type that takes the easy way out when things get difficult and stubbornly ignores reasonable advice? [Illegitimate reason]\n\nPeople who perceive OP's GF as #1 favor her perspective and people who perceive her as #2 favor OP's perspective. But we really don't have enough information to know which one is right, only OP does. Additionally, its certainly possible (and perhaps even probable) that at least some of both 1 and 2 are correct.\n\nGoing further into Decision Analysis OP could forgo the focus on motivations and fairness of the above questions and examine the pros and cons of his actual real world options and his commitment to any course of action.\n\nHowever considering options prompts us to do something even more important, which is to form a clear Problem Definition. It quickly become apparent that the real problems at the center of this seem to be 1: GF is miserable at her job due to her frustration at her own poor performance and 2: GF is frustrated at her stress levels and lack of physical health due to not having the motivation to exercise and do other mental health promoting and stress relieving activities.\n\nSo returning to the beginning, we see that the initial question that OP and everyone else is caught up on is actually not a particularly useful question to answer, since regardless of what side you come down on, OP and his GF are still in opposition. Solving that initial question only answers which one of them has the objective moral high ground, which, while being an attractive topic, actually does almost nothing to work towards a solution to their impasse.\n\nThe next step of examining options, and weighing pros and cons, is more helpful, but it isnt until an attempt at actual analytical problem solving is made that any real progress occurs towards a resolution.\n\nThe most critical aspect of solving any problem is defining the problem correctly. With the previously established clear problem definition, many more and better options become apparent as OP can consider actions which focus on addressing the real origin of their conflict. This in turn prompts the real critical questions which are:\n1: what can OP do to help his GF improve her job performance and 2: what can OP do to help his GF manage her stress levels and motivate her to exercise?\n\nOnce he has considered and modeled the best strategies to achieve these two goals (which, depending on his internal modeling, may or may not end up including supporting her working part time, at least for a while), he will have the solution to their problem and a resolution to their conflict.",
            "What is your job? I hope that isn't an out of line question.",
            "You're getting some really solid advice, which is good. I'd also like to add that you should try to bring up the conversation about beginning therapy. Medicines are great to help combat depression and anxiety but only go so far. Therapy is a major part of learning to properly cope with those. Also, it seems as though she might have PTSD from her cancer treatments. She really should have someone help her work through these anxieties and how to deal with them in a healthy way.",
            ">Recently she got the idea in her head to start working half weeks to **give her more time to exercise**, and stress her out about work less. \n\nIf she's not making time to exercise now, it's unlikely she will make time to exercise when she is working part time. A lot of people are too tired after work to hit the gym. So they go in the morning. I honestly think if you agree to let her go part time, she will eventually quit and will likely never go back to work. And that just might be the death knoll for your relationship.\n\nIf she needs a little time off, see whether she can take a couple of weeks vacation and go sit on a beach somewhere. But in your shoes, I would be very reluctant to support more time off than that.",
            "You can be in love and still be taken advantage of. Being an adult means you need to manage your time and NO one has enough time to do everything they want. Some people are okay supporting a stay-at-home wife but you seem like you want more of a partner/teammate in life. There is nothing wrong with that. Anxiety can be managed with other methods, and she should consider those as well, rather than just working part time and exercising. \n\nDon't get married until you have your future sorted out and a plan. And that she is going to stick to the plan. She could easily get fired and never get another job again after the marriage. Just things to think about.",
            "If you are okay with her always expecting you to support her, then continue what you are doing.\n\nIf not, talk to her and explain what you are willing to do. Set boundaries.\n\nRealize that if you set boundaries she may break them and then you either let them go or break up with her.\n\nI'd expect if you set a time length for supporting her or letting her work part time, there will always be something that requires an extension.",
            "Does she understand the reality of the financial situation? Sit her down and walk through a household budget - she prob doesn’t have a good idea of all the expenses.",
            "Roll out homie, your not obligated to carry her weight. Gonna end up resenting her.",
            "Everybody wants to stop working fulltime. The greatest lie told by capitalism is that we need a dream job.",
            "Personally, I agree with you that she is looking for a \"quick\" solution to her problems. Everyone experiences stress - maybe not related to having to battle through cancer - and we have to learn to deal with it. It sounds like she's undergone a lot of changes in the past few years and maybe therapy would help. I don't think working part-time is going to be the solution she is looking for; if she never deals with the actual issue, she will just keep finding more and more things to be unhappy/stressed about. I also think as a partner, she's acting a little selfishly. I understand that she has been through a lot, but I don't appreciate the way she seems to be seeking to decrease her stress at the risk of increasing yours. That isn't fair to you.",
            "You aren't going to get a lot of sympathy from me. Banking on loan forgiveness is a terrible idea, and not just that, it's completely unnecessary here. What did she think she would accomplish with this masters (you mention it's only tangentially related to her job)? The fact that she went into this with it as the actual goal would have immediately put an end to the relationship.",
            "two years and engaged is way too fast. \n\nIf you chose to go ahead with this and all the crazy amount of debt she has accumulated, anything and everything you guys buy should be 100% in your name only. \nher life expectancy has already been cut by a quite few years compared to you, and it would totally suck if she passes and tou inherit that debt. \n\nalso, busses hit people, accidents happen, people drive drunk...... and her being reliant on you is just a terrible idea, and what happens if you get cancer too? dies that mean you both get to decide to sit at home and do part time and exercise for the rest of your lives? \n\nshe is new in the field of work and everything she learns will be new, school does not really prepare anyone for work but it does prove that you are capable. she is definitely capable, she just has to keep going and soon enough, she'll be a pro. giving up now is not doing her any service.",
            "I couldn’t find anywhere in the post of her expecting you to front the loan payments. She’s free to make her own choices on working, let her deal with her own loans. You’re not married, and even if you were it wouldn’t be a joint debt.",
            "Not to be mean, but I would not call being together for 2 years \"long time.\" I also think this is way too soon for you guys to be so intertwined financially.\n\nFor me, this would be a dealbreaker. Financial responsibility is important to me, this is not a sound financial decision for her. She can work out and exercise while working full time, cancer has become a way for her to rationalize something else going on (depression, laziness, anxiety, being bad at her job, I don't know what.) Right now I work full time (\\~50 hours a week), go to school full time, am planning a wedding, and house searching. I work out 2-3 times a week and I'm fine. I also am medicated and it helps! If I can do it, she can do it.\n\nI personally would say no, and that you support her doing that, but it would be a reason to end the relationship if it was me.",
            "Her debt is her debt. Unless you two become married, it’s not your problem. \n\nLike I think it’s reasonable for you to pay for her living expenses. But taking over her $100k student loan debt is unreasonable for a boyfriend. \n\nIf you two decide to get married, you two need to have a talk about how the debt will be shared or not shared.",
            "[removed]"
        ]
    },
    {
        "post_id": "4518ub",
        "author": "nakedcopyandpaste",
        "title": "[UPDATE] My [24M] girlfriend [23F] accidentally sent me a naked picture",
        "url": "https://www.reddit.com/r/relationships/comments/4518ub/update_my_24m_girlfriend_23f_accidentally_sent_me/",
        "score": 2658,
        "num_comments": 232,
        "created_utc": 1455083023.0,
        "selftext": "Original post [here](https://www.reddit.com/r/relationships/comments/431j8y/my_24m_girlfriend_23f_accidentally_sent_me_a/)\n\n**tl;dr original**: My long distance gf accidentally copied and pasted a nude photo of herself into my Facebook chat. She apologized and said it was meant for me later as a surprise, but we have never exchanged photos and I don't believe her. \n\n----------------------------------------------------------------------------\n\n\nThanks to everyone for their replies. It really helped put things into perspective: for example, it is way more common to take self timer nudes than I thought, and that it's possible to check the metadata for a photo and find out some details like whether or not it was taken on a self timer. \n\n\nI want to especially thank /u/justtotalkaboutrelat for asking me if Christina and I had actually dated for a full year yet, or if we had an anniversary coming up. Because, as it turns out, we did (I don't know why I didn't make the connection on my own)! And, as it turns out, **my girlfriend is not cheating on me!**\n\n\nA couple days ago I got a big package in the mail to celebrate our one year anniversary. Among other things, it contained an envelope filled with multiple nude photos of my wonderfully awesome girlfriend, with a note saying \"I know you never asked, but I wanted to give you something special since I can't be there with you!\" Among the photos was the one that she accidentally sent to me. She also included a USB with the photos uploaded, along with the physical copies, so that I could have digital versions.\n\n\nHere are a few extra details to better explain what happened:\n\n\n* Christina did indeed take the photo's herself. I asked her (nicely) how she managed to do a self timer at such a good angle, because my initial reaction to the photos were that somebody else obviously must have taken them. She showed me through Facetime how she was able to prop her phone up against some objects in her room, and they were exactly from the angle she sent them at!\n\n\n* To further corroborate this story, Christina had actually confirmed my address with one of our mutual friends a few days before the accidental-copy-and-paste situation went down. So she had in mind that she wanted to send this package *before*, not as a cover-up for accidentally giving herself away\n\n\n* When I asked her how she accidentally managed to send that particular nude, she said that she was copying and pasting the files from one folder to the USB she sent me. She forgot that the nude was still on her clipboard. When she tried to send me that gif, it didn't copy properly, and instead she pasted what was on her clipboard previously. She said she was just relieved that it was me she made this mistake on, and not somebody else!\n\n\n* Finally, I took the advice that many of you commented/messaged me. I checked the data on the image files and they were indeed taken recently on a self timer. \n\n\nSo, sigh of relief! Thank you to everyone here for putting my mind at ease. I was convinced that everyone was going to say I was definitely being cheated on. But honestly, Christina has never done anything to even make me suspect that she would be cheating! I am very happy. \n\n\n   \n**tl;dr**: My girlfriend is not cheating on me! She took those nudes to send as part of a surprise package to celebrate our one year anniversary. ",
        "permalink": "/r/relationships/comments/4518ub/update_my_24m_girlfriend_23f_accidentally_sent_me/",
        "comments": [
            "It's nice to see a happy ending on here every once in a while! You lucky fucker.",
            "So what did you get her for your one year anniversary?",
            "Jesus your gf really trusts you! Sending physical and digital multiple copies of nude pictures is a big deal. Especially after 1 year. I would never send a boyfriend that much material. I know way to many people who have had their nudes leaked by their SO. I hope that in the case of if you guys break up or go through a rough patch you will either destroy them or return them. She trusts you with these so don't do anything mean or stupid with them if things between you guys go south.",
            "I like how she gave you prints and the digital copies like you paid for the extra photography package. Did you get wallet sized ones too?",
            "> When she tried to send me that gif, it didn't copy properly, and instead she pasted what was on her clipboard previously.\n\nI believe it. Trying to copy a link or something and your browser/keyboard are like \"nope\" so you paste the wrong thing and the person's like ? wat.\n\nSometimes I'd have to test my copy/paste before I used it to make sure it had worked. Never any nudes on my clipboard but still, sometimes you just don't want to paste the wrong thing. Like playing mafia online and you don't want to paste private logs to everyone if you're mafia talking with your scumbuddies.\n\nGlad there was nothing to worry about!",
            "Moral of the story: talk to your SO before you jump to conclusions.",
            "Glad it worked out but idk. If my boyfriend was that skeptical of me sending a naked pic and questioned me cheating and jumped to conclusions, I would not be happy. ",
            "Meh. I don't know dude, I really think it was ridiculous of you to jump straight to her cheating on you. And then you really went as far as cheking the image data? You even asked her to show you how she did the camera angle? Come on... You said it yourself that your girlfriend is trustworthy. Maybe next time don't jump to conclusions so fast, it's really not a good look for you. I also think your girlfriend would be pissed as hell if she heard of you suspecting her of cheating",
            "So you end it saying she is trustworthy yet you needed to go all amateur PI on her ass?  I'm not sure what's more disturbing you needing proof via angles and data or he fedora losers agreeing here.",
            "You seem super suspicious, should probably reign that in if you want to keep her. ",
            "I find it disturbing that you think it's normal to do all those things to corroborate her story.  If you can't trust your partner you've got bigger issues.",
            "Yay, I'm so glad this worked out! I can imagine it's hard to notice details like that and think rationally when you're blindsided by naked pictures, haha",
            "Christ... I'm glad this was a happy ending (no pun intended) but what the fuck!?!? Do you have THAT much distrust for her that you had to go all Sherlock Holmes on her after she accidentally sent you a nude photo? You better be counting your lucky fuckin stars she's not seeing this as a massive red flag and still decided to send you the package. DO NOT make this same mistake again or I promise you it will severely damage your relationship. Time to let go of your own insecurities",
            "Seems like you have another reason why you wouldn't trust her and instead look at metadata and question her about camera angles. That or you have trust issues on your own",
            "Hey man, you are very lucky. Don't fuck this up by not trusting her again though. ",
            "Now please start trusting your girlfriend. Don't start reading into everything. ",
            "Nice that it worked out, but damn you're an asshole.",
            "Apparently she trusts you more than you trust her.",
            "Wow, do you not trust your gf much?",
            "Pics or it didn't happen",
            "That gif copy paste thing happens to me all the time and I can totally see how this mistake happened. Glad everything turned out well!",
            "I have to advise you to break up with her anyway, just because it's tradition in here. ",
            "Yay! I love a happy ending. ",
            "It's nice to see that you've sorted this out!\n\nAlso, thanks for making an update!",
            "She sounds like a keeper, OP. I wish you two all the best!",
            "It's really sad that this post is even a thing and that you even checked on those things. She sounds amazing, and you don't trust her a bit. SMH. ",
            "It's great seeing a happy ending here. Have fun this weekend!",
            "Wow! I can only assume you typed this whole update with one hand.\n\nCongratulations, buddy! Your girlfriend seems pretty awesome, and you did the right thing by not immediately accosting her. I guess that makes you pretty awesome, too. ",
            "Good thing she found a gif to send to you before she found another one to send to a friend or family member. That would have been a little awkward. ",
            "/AWESOME UPDATE AND AWESOME GIRLFRIEND!! :)\nkeep those photos safe!",
            "That's awesome! I hope she doesn't hold the suspicion against you. I would have thought the same thing if it'd happened to me!",
            "Good stuff :) Good luck with the relationship. Distance is hard but worth it. ",
            "Nice to see a happy ending to one of these. I would suggest you take this as an opportunity to truely trust your gf. Good luck!",
            "Congrats dude! Glad I could kind of help through my experience with self-timer nudes? \n\nBest of luck to you and Christina!",
            "Glad to hear it was nothing more than an honest mistake.  Enjoy your pictures!",
            "This makes me so happy to read! Thanks for the update.",
            "my best friend takes naked pics for me sometimes. theyre artful (they arent but they arent too out there). i had to get that off my chest. maybe it really was for you.",
            "When You send pictures via Facebook, Facebook deletes exif and metadata.",
            "Damn that's a good ending. \n\nGood on you for checking every elements I imagine you'll sleep like a baby tonight ",
            "You should trust your gf and get over your trust problems, do this freakout where she can see and you will lose her.",
            "Pics or it didn't happen",
            "It´s great to hear that not everybody in this world is a bad person... and a happy end is something that gives me some confidence that not everything end the bad way - Best wishes for both of you :D ",
            "Such a cute story!",
            "so glad this turned out well :)",
            "She sure covered her tracks well. Props to her.\n\nIf she accidentally sends you a picture of herself fucking another dude, just come here and ask us about it. We will remind you that she might just have done this because she knows how much you like porn and wanted to give you the special gift of porn involving her.",
            "I don't believe you. /s",
            "Wow, you're really lucky. I barely get any kind of pictures, even with her clothes ON. lol. And to this day I have never gotten something in the mail from her.",
            "Boo, Hiss! I wanted drama. But I guess a happy ending is a pretty good consolation prize, congrats.",
            "Its very possible she sent you the nude gift package just to give herself a plausible explanation for taking nudes after she accidentally sent you one.. Especially when she knew you were suspicious.\n\nShe could still be cheating and just be clever about making you believe what you want to believe.",
            "This is miracle shit. Glad it worked out. ",
            "glad it worked out for you OP.  I'm glad you didn't jump the gun. it shows you have a lot of respect and trust for your girlfriend even when confronted with a sketchy situation, and that's going to mean a lot to her.",
            "It's Friday so, I will say something dumb.\nPics to prove or it never happened! :)",
            "Show pics or didn't happen",
            "Well shit. I was convinced she was cheating",
            "[removed]",
            "[deleted]",
            "Long distance relationships don't work",
            "You're a lucky bastard..",
            "I may sound like a suspicious dick here but still. All of that sounds pretty darn realistic, except for ooone thing. How the hell did she accidentially send you the photo in the first place. She actually wanted to send it to someone else, which is a major concern. ",
            "I think we need to see the photos now, you know, for science. ",
            "Hmmm.  OP, did you actually test facebook messenger to see if it works that way?  I'm on a Mac, just opened up facebook messenger.  Clicked on a file on my desktop, hit command-C to copy.  Opened up a messenger chat with my friend, hit command-V to paste.  I don't get the picture.  I get a weird icon that just says \"JPEG\".  I think the facebook people already thought of this and have protections in place to keep people from actually pasting stuff by accident. \n\nI think you've been had.\n\nEdit: I'm using a work laptop, it's possible that the security settings are set up to prevent me from pasting files by accident.",
            "you should try a reverse image search anyway..\n\njust saying...\n\nCongrats though."
        ]
    }
]