[
    {
        "post_id": "1b7lxpf",
        "author": "jeesuscheesus",
        "title": "4 reasons why CS is absolutely 100% dead",
        "url": "https://www.reddit.com/r/csMajors/comments/1b7lxpf/4_reasons_why_cs_is_absolutely_100_dead/",
        "score": 11443,
        "num_comments": 597,
        "created_utc": 1709685881.0,
        "selftext": "1. It's way too competitive. Everyone agrees with this.\n2. It used to be exclusively done by a group of elite people but everyone and their grandma went into it. Now it's flooded by mediocre normies.\n3. Grinding. You have to grind CS for a thousand hours and then you'll just be average.\n4. Cheating. So many people cheat so it's extremely unfair.\n\nSo that's why the new Counter Strike game is pretty much dead already. It has some neat smoke physics but otherwise it is inferior to other games. Unrelated to computer science btw",
        "permalink": "/r/csMajors/comments/1b7lxpf/4_reasons_why_cs_is_absolutely_100_dead/",
        "comments": [
            "CounterStrikeMajors",
            "No CS is not dead. Y'all just wanna complain. If you think CS is hard, you should see how hard it is for COD people out there.",
            "i love how this joke went over every commenters head",
            "lol I’m sorry about Counter Strike",
            "Interesting how few people actually read the whole post",
            "I've been saying the same thing about Battlefield for years? Can I just get an old school Metro in here?",
            "I got to the third point and had to check back if i was in the csgo subreddit only to get baited when I finished reading the whole damn thing.",
            "[deleted]",
            "Relatable. That's why I never went pro CS and switched to CS",
            "![gif](giphy|sJWNLTclcvVmw|downsized)\n\ncs is cooked",
            "Yeah way too competitive with how it is. Like people got it all figured out and know exactly which pixel to throw a grenade and the exact position it will land on the other side of the map.",
            "![gif](giphy|y2i2oqWgzh5ioRp4Qa|downsized)\n\nThat was so funny lmao",
            "I loved the punchline. So many people using aimbots on their final exam.",
            "I love how 2 of these points still apply.",
            "Edit: Joke flew over my head, mb.",
            "I feel dota is dying too.",
            "CS was good back in the 90s, but it didn't change much since then.",
            "Imagine people not even reading the post and comment",
            "\"ThIs PoSt iS jUsT gAtEKeEpInG cS bRuH.\"",
            "Siege is dead too but I still play.",
            "Totally agree too many spin bot degree holders",
            "I am a CS player and first resonated with the “CS is dead” meme, then saw this being about csMajors subreddit and brushed it off, lol.",
            "y'all are idiots still stuck in CS. I'm in CS2 and having a blast",
            "Jfc. For number 3, grinding is expected. You should be grinding coding like crazy. If you're not grinding, how are you gonna be able to code cheats better to avoid VAC bans? Come on now. If you can't beat 'em, join 'em.",
            "I want to slooowww daannceee with yoouu",
            "can confirm i have over 3k hours in cs and im still dogshit",
            "I miss csgo ;(",
            "Teachers teach counter strike???",
            "thanks for the giggle",
            "Ha true",
            "Those were the days where you'd have a blast in 10v10 pubs. ",
            "CS isn’t dead.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt’s just not as popular as other games like fortnite, warzone, valorant, etc.",
            "Competitive but full of mediocre normies 🤔",
            "omg hahahaha i was like damn",
            "Improvise, Adapt, Overcome",
            "💀😭",
            "Lmfaooo I’m triggered 😅",
            "I wish i b rushed on most of these technical rounds",
            "got me by the first….3 quarters",
            "![gif](giphy|4GrG8An8nfPmE|downsized)",
            "REEEE",
            "If Cs is hard you can always play dota 2",
            "Ngl, you had me in that first half.",
            "Man thats some good analogy",
            "Had me in the first half, not gonna lie.",
            "LMAO",
            "Had us in the first half ngl",
            "Such a ridiculous post. CS is the best game I’ve ever played.",
            "Not gonna lie you got me! Good one keep fighting the good fight.",
            "Rainbow Six Siege is better.\n\n\\^\\^\\^ Change My Mind",
            "Fellow Counter-Strike player here since 1.6! I don’t think it is dead ‘yet’. Just give it time for people to get used to new version. Nice joke and clickbait by the way!",
            "mwa. chefs kiss",
            "Coming in from /r/all thinking this was a counterstrike post even as a CS major, watching the rmrs has absolutely donked my head.",
            "I wasted my time trying to get good at CS when I should have been getting good at CS",
            "I had to read this twice before my drunk ass realized it was actually about Civil Service, and how those fuckers are ruining us",
            "Not really funny. This kind of jokes have long been expired tbh.",
            "Amazing Shitpost",
            "cyka blyat",
            "just update to cs2",
            "[deleted]",
            "everyone says you need a mentor to be successful. I met this guy who probably spent 5 years in CS, I’m talking thousands of hours. I asked him if he could teach me and he wanted me to pay him. I’ll learn the smoke spots on my own.",
            "Thanks for reminding me I spent the last 30 trying to get a dead degree.",
            "We are cs1.6 master race",
            "That's why I got my Dr.G instead. So much more relaxed and just as fulfilling",
            "I paid $20k for a bootcamp in CS, now I only do COD 😔",
            "Cs is 100% not dead. People like you are people that have only been in the field for one or two years. If you really think its dead then go back to Apex or Fortnite.",
            "It’s not that it’s dead. It’s that everyone and there mom is going into it so the demand for jobs is absurd",
            "Guys I just attended a bootcamp and honeslty getting a job is super easy: you just fill out a form and then they give you a uniform and a strange keyboard with only one button. If you press it, it makes a loud noise.. I think I just deployed my first project. It is very dusty here and everyone speaks a foreign language.",
            "Some people got an attention span of a puppy. Yall need to quit doom scrolling on reddit AND tiktok.",
            "I know that CS is stem but it wouldn’t hurt for some of you to practice reading. Not too many people made it to the last sentence lol",
            "I agree but with CoD, like half of my ranked matches end early because they can’t find 8 people to play",
            "This post is beyond brilliant! Love it!!!!!!",
            "I agree with this about CS.",
            "I have given my account to be boosted in india server",
            "[deleted]",
            "I was more in the Rainbow Six stream",
            "CS is the starter game for most cheat devs, that’s why I quit..",
            "Hey you stop spreading this lie.\n\nMy grandmother stayed faithful to Global Offensive!",
            "bravo.. well played",
            "My college roommate played CS religiously and was a CS major. We were out one time and someone asked him what his major was. Without hesitation he replied “Counterstrike”.\n\nTo be fair, he is very good at both. Thanks for reminding me of that.",
            "I would say the new ranking system killed it as well.\n\nI played from 2017+, I was a silver until they did the rank re-evaluations in 2021 where I was placed into DMG, it seemed to be the silver/GN hell that a lot of people were experiencing.\n\nThey removed the rank system, made it per map which does absolutely nothing. They expect that a 13 round game is better than a 16 round one, which it isn't. And if you don't want to play ~~mirage~~ primer mode than tough shit. Cheaters climb to 16k instantly, and the silver/GN hell is back because one map you can be GN1 but another map you're just unranked.",
            "Nowadays I wonder if I'm better at CS or CS2. About to graduate and I I'm near 3k elo 😎",
            "Personally I think these things contribute to CS being bigger than ever.",
            "Too much recoil in CS",
            "Nice one",
            "[deleted]",
            "While CS is definitely in a really difficult situation, it’s nowhere near as bad as CS. Like there are so many more issues with CS that makes it way more dead than CS.",
            "I wish CS2 was more popular. I mean I know it wasn't entirely finished and is quite buggy, but it looks to be a fun game nonetheless. Cities Skylines has always been one of my favorite games.",
            "It sounds related to computer science too",
            "it’s funny how it applies to computer science anyway",
            "lol",
            "4 reasons why , good 😅😂",
            "Ahem...",
            "If you're an elite coder you still are in demand",
            "It took me till item 4 to realize this wasn't about computer science majors....",
            "Why I was agreeing even before Counter Strike part arrived in your post",
            "OP had us in the first half...not gonna lie 😂😂😂",
            "I Love this 😂😂",
            "I realize this is supposed to be a joke but is ironically so true about CS.",
            "🤣🤣🤣🤣🤣🤣🤣🤣🤣",
            "Don't forget AI, all the mediocre ones just use AI cheat to get along. And that's why we should all go back to the previous version of CS, 1.6, Computer-Science 1.6",
            "I don't get why \"everyone getting into it\" is a problem for such a plain jane major like CS",
            "Almost had me in the first half, not gonna lie.",
            "How is it both too competitive and full of normies? Wouldn't a normie flood make it an easier, less tense game? Or do you mean that all normies are strong and extremely competitive?",
            "1.5 for life",
            "I deal with SaaS representatives regularly that try to upsell products that don't work, earlier this week I asked them if they had a bunch of interns on their UX/UI team, later found out they outsourced all their jobs, and fired almost all of their employees when their company was considered \"Innovative\"\n\n&#x200B;\n\nOf course my boss went through with importing all of our user data since they had the cheapest subscription model. We plan to go through with everything up and running by next week.\n\n&#x200B;\n\nI question the reason for holding my job position, but I guess I have to pay rent.",
            ">3. Grinding. You have to grind CS for a thousand hours and then you'll just be average.\n\nThis is 26 weeks of 37.5 hours work.\n\nYou're complaining about half a year of work to be average?",
            "Lmao got me in the first half haha",
            "![gif](giphy|Le3OnIP7xyWC4|downsized)",
            "CS is rigged\nunless you are ready to spend premium fee",
            "> 4. Cheating. So many people cheat so it's extremely unfair.\n\nThat's because CS was developed in USA, and USA is known for lacking any VACation time.",
            "Hahaha 😂😂",
            "bootcamps might be a great idea but 95% the people who complete them are just behind that certificate so that they can spam job applications and exponentially raise the applicant count for that one opening",
            "100% related the 2nd point though 😢wow",
            "bait",
            "Yep sadly changing my major im not risking another career bomb again im getting too old for this shit",
            "Everything after the original HL mod hasn’t been legit.",
            "and here I thought CollectingStamps was gonna be over saturated...",
            "Glad I went into GOW.",
            "😂💯",
            "Exclusively done by elite people?  Don’t kid yourself.\n\nhttps://youtu.be/lcZKNdrSEyw?si=oWhAEiDa_lyBIirH",
            "Bots have always been a problem. I started with source after HL2 came out using the source engine. What made it work wasn’t all the normies but the creative engineers who designed the best dedicated servers. You’re right. It’s overcrowded and CS is dead. It’s hard out there trying to put what you’ve trained for to work. I just gave up. Hard to beat AI.",
            "I started reading it as computer science(cs) and I agreed with all the points till I realized that this post is about counter strike",
            "Can someone explain the joke",
            "Reading is hard\n\nhttps://preview.redd.it/3uqdhecncpmc1.png?width=1080&format=pjpg&auto=webp&s=26a5a7086acd37be21689a1292986c1e5b73816e",
            "Me taking CS - in hottest demand and high pay.\nMe graduating - over flooded.\n\n\n*cry",
            "Thinks putting in 1000 hrs is \"grinding.\" \n\n\nI rest my case.",
            "Don’t know why this showed up in my feed, thought it was about computer science until counter-strike was spelled out :(",
            "Try FPS mod in Roblox then we can talk",
            "What a rollercoaster for me, I first saw the title of the post, and since I'm playing CS I just thought it was the GlobalOffensive subreddit, then I checked the subreddit and I saw CSMajors. So I was like \"ok, funny how I confused these\" then I read the post, and I was at the fourth point like \"wtf cheating ?\" And then I realized it was actually counter strike",
            "They had us in the first half",
            "Titanfall 2 is where it's at",
            "r/angryupvote\n\nYou son of a gun",
            "Stupid me who thought you were talking about CS as in Computer Science 😭.\nAll the points completely make sense for computer science too💀",
            "I was so annoyed and ready to downvote at first until I read the rest of your post. Well done friend",
            "\"This thing is dead because more people than ever are flocking to it\" is a weird take.",
            "Sir this is wendys",
            "Idk man I just wanna play surf maps",
            "Agreed, CS is too sweaty and tryhard, not worth investing your time + money in",
            "“Gotta grind for 1000 hours”\n\nYou can learn a lot of shit on the toilet, I’m #justsaiyan (pun intended).",
            "L joke",
            "Lol",
            "Sounds like a skill issue, couldn't be me",
            "this may be true if you want to get into FANG type company. however tons of non tech company higher CS majors all the time",
            "Nobody majors in CS anymore; the classes are too crowded.",
            "People just want easy money",
            "You got me in the first half....",
            "It’s really funny how many grandmas actually are into CS.",
            "I appreciate your effort in scaring the tech influencers away",
            "I had a full ride CS scholarship back in 2016, one of the first of its kind but i turned it down to pursue a more traditional career path.",
            "Not gonna lie, had me in the first half",
            "lmao when i got to point 4 i was like... dafuq, and went through an array of emotions... i'll see my way out",
            "You had me on the first half lol",
            "Computer Science is dying good luck to all the people crying for a job and same for counter strike.",
            "How can something be dead and competitive at the same time. Normies stay entry position and good workers move up. Same as any other field.",
            "🤣",
            "It used to be a major full of nerds passionate about doing new and cool things with technology. \n\nNow it’s filled with people who couldn’t give less of a fuck about what they do.",
            "I'm a ... Valorant player 😔 Forgive me CS majors",
            "Damn I miss playing cs 1.6",
            "So, you’re telling me that CS is the new graphic design. lol",
            "Oh!\nNow I get it. You made that post look like about Computer Science but it was actually about Counter Strike.",
            ">mediocre normies\n\nLost again last night?",
            "But, but, but...you haven't even tried rushing the A or B bombsites yet.",
            "There are more job postings with fair pay and lifestyle for CS than there are for almost any other profession.  The only exceptions are for professionals (doctors and lawyers, who have their own unique stressors) and high risk workers (oil rig). Literally every job these days is flooded by hundred of applicants. CS is unique for the quantity of job postings and the lifestyle and pay combination it provides.",
            "As a suffering CS student who has never played CS, I shall mind my own business and enjoy the comments",
            "Didn't know what this subreddit is and for a moment i thought you were talking about computer science",
            "Fuck, man. Before I enrolled, I was debating between a couple majors. I wish I bit the bullet and chose being a Valorant major over a CS major. Now I feel like it's too late to switch.",
            "It is indeed dead for mediocre normies, just as it should be. The rest are doing just fine.",
            "😭i didn’t even for a moment comprehend that this was on the computer science subreddit I thought you meant the game from the beginning",
            "Okay got donked",
            "sounds like you need to get good.",
            "not for nothing but points 1 and 2 are contradictory & if you were even a little bit skilled you would stand out ahead of the 'mediocre normies'.",
            "If you think CS is dead. Then don't even think of engineering majors.",
            "It’s not for any of the reasons you listed but it’s because of the lag and netcode issues.",
            "Had me in the first half, Im not gonna lie",
            "at first i was gonna comment “skill issue” but then i realized this was satire hahahah good work",
            "![gif](giphy|y2i2oqWgzh5ioRp4Qa|downsized)",
            "Inventing new code is actually very hard",
            "Ill keep my PhD in Arma III",
            "well played, OP",
            "At first I thought you meant computer science lol \nYour points still would stand",
            "😂😂😂 god this made me laugh man",
            "[deleted]",
            "I like gambling.... Thats why i chose CS",
            "/r/lostredditors",
            "Had us in the first half not gonna lie. Also who's grandma playing CS, can you share the info?",
            "Had me in the first half ngl",
            "Bring back cs go. My life is empty without it D=",
            "Eyes up guardian",
            "Ahhh you got me op🤣🤣",
            "Millions of people *try* themselves at soccer every year, 99.99999999% of them aren't even good enough to earn a living at it, and yet the sport is thriving. \n\nJust because more people *try* to go into CS doesn't make it any less important. None of the four points take anything away from the subject. It remains one of the most important sciences of our times, instrumental to the development of technologies that help us conduct our lives in safer, more entertaining ways.",
            "Git gud",
            "you had me in the first half, eventually i cracked up hard lmao.....",
            "You already just made the top r/csMajors post of all time",
            "You had me worried I was picking the wrong degree for a second T_T",
            "For real i thought this was about Creep Score on League, had me fooled nice",
            "Skill issue",
            "I see no standoff players here",
            "No it is not dead, but yes very competitive, and still there are opportunities for even average",
            "Hahh this was a good one",
            "I've been bamboozled",
            "Collective bargaining baby.",
            "I swear I thought this was about computer science.",
            "Not gonna lie, you got us in the first half..",
            "I don’t play world of Warcraft, I’m playing Hello Kitty Island Adventure",
            "This killed my dream",
            "Dang 10k in 2 day on a subreddit with people having existential crisis consistently",
            "**\\*Had us in the first half**",
            "Applies to CS field completely.",
            "put a thousand hours into any other profession and tell me there's as much payout. get lost lol",
            "Is it the same for data science major?",
            "Been thinking of getting into csgo but my experience with shooters is mainly with Halo on controller",
            "I like how counter strike went into everyone’s head lol",
            "Is Bro talking about counter strike or coding?",
            "Just a few remarks:\n\n* It is far less competitive than other fields and only like 2-3 years ever 10 years or so when there a crisis. The rest of the time, just puting your CV online get you a job withing a week.\n* It was always flooded by mediocre people because like everywhere else, elite people are elite, that is a small minority.\n* Like most jobs, yes you are bad when you are just out of university and you need to get some XP to become decent. I'd say at least 5. But outside of very basic job that's kind of always the case everywhere.\n* I don't know what you imply with cheating, but once you are working, you have to be sure your boss and coworker have a good opinion. If you were stupid enough to cheat and not learn, for sure things become complex.\n\nOverall it is isn't for everybody by far, but it is being on easy mode. This isn't like other field with high pay are so much easier like health care or law or even sales. \n\nI think computer science is easy and pay well. This is just we are in these times where it is a bit harder than usual.",
            "Skill issue",
            "Man I wonder how cat science is doing 🐱",
            "Skill issue, entitlement, skill issue, valid",
            "this was amazing, lol. welll done.",
            "People buy the cheapest price.  Period.  That destroyed customer service.  It isn't businesses that let it die, it's the profit margins that allow them to bend over backwards.  We did it to ourselves.",
            "you had me in the first half",
            "*damn he’s good* sigh, take my upvote",
            "I was wondering why tf this post had >10k upvotes after reading the title😂😂",
            "LMFAO YOU GOT ME",
            "I saw this on TikTok and I don’t know if you stole it from him or he stole it from you",
            "I thought computer science and the first 3 sentences were not too far off",
            "Lol I play fortnite. Have fun with 5yo building a castle over ur dead body",
            "Everyone agrees. My grandma. Your grandma. Everyone. My ex-wife called me up and said \"Danny, you know that everyone agrees on this right?\"",
            "Oh",
            "CS isn’t dead. Kids are going into it because it’s the best return on investment and opportunity. You just have to step your game up and work harder.",
            "I remember when people had to go to the mall to play counter strike",
            "This is why legal hemp fucked up the weed scene \n\n\n1. Too much competition from greedy corporations and not enough love for the plant as medicine and culture\n\n2. It used to be done exclusively by a group of elite wooks, okay there used to be shady shit 20 years ago too like beasters and grit weed, but now everyone and their former cop grama went into it. the market is flooded with mediocre gelatos \n\n3. boof. You have to smoke a thousand pounds of mids just to feel average\n\n4. Cheating. fake terp and distillate spray pack.",
            "fuck it we ball",
            "Had us in the first half, not gonna lie",
            "I just wanna point out that 2 and 3 are nonsense together. Great joke btw",
            "我差点看成计算机科学。",
            "Quality shitpost",
            "They had us in the first 3/4 not gonna lie",
            "Duck \nI was thinking of computer science",
            "I thought i was in computer science majors and i just got lost on cheating lmao id do it though",
            "The amount of shit posts in this sub is insane",
            "Вся разведка - бред ебучий, и можно хоть тысячи гигабайт укладывать и интерпретировать",
            "I think if anything, it’s leveled out.  For awhile computer science majors were just getting paid ridiculous right out of school but this was picked up by the people who were very smart and maybe were upset with their choice in majoring in marketing.  Those people taught themselves to program.  Computer science majors are now starting to see the same entry level salaries that most engineers see and still competing against the self taught that are smarter than them.",
            "GregorAI is going to make us obsolete",
            "What are you talking about dude?\nThe world still needs mediocre programmers. They will do web programming and e-commerce sites…",
            "What sub am I in?",
            "XDDDDDDDDDDDDDD",
            "Haha...I thought CS meant Customer Service! The same rules could apply...lol",
            "5. A huge percentage of jobs are offshored, and more are offshored every day\n\n6. AI Devon is just the beginning -[https://medium.com/@AIPlusInnovateLab/ai-revolution-meet-devon-the-worlds-first-ai-software-engineer-303a9320723a](https://medium.com/@AIPlusInnovateLab/ai-revolution-meet-devon-the-worlds-first-ai-software-engineer-303a9320723a)\n\nThis job is extremely easy to automate with AI. It will be one of the first to go.",
            "CS is absolutely 100% dead because…\n\n1. There are too many people doing it. \n\n2. There are too many people doing it. \n\n3. It’s too hard. \n\n4. There are too many people who aren’t good at it. \n\nUmm, yeah. Also no one goes to my favorite restaurant anymore because it’s too crowded. I don’t know how they’ll ever stay in business.",
            "Yeah counter strike kinda feels dead man. I downloaded it the other day cuz it's popular. But disappointment.",
            "Almost convinced me to change my major",
            "Hahaha, this post is gold 😂😂😅🏆🥇"
        ]
    },
    {
        "post_id": "1c6u5s0",
        "author": "roguethrowaway0999",
        "title": "Google hiring?",
        "url": "https://i.redd.it/89ro5323x5vc1.jpeg",
        "score": 5389,
        "num_comments": 440,
        "created_utc": 1713413181.0,
        "selftext": "This should open up their positions 🫡",
        "permalink": "/r/csMajors/comments/1c6u5s0/google_hiring/",
        "comments": [
            "A 100+ people on this post right now, damn. This is gonna be a full debate huh",
            "[removed]",
            "[removed]",
            "2 minutes of silence for people who believe company is like a family or 2nd home 😂😂",
            "The facts are unclear, Google says they fired people who were disrupting the work of others and had to be removed by police, while the protesters say that among the 28 fired, some were just handing out flyers outside the building.",
            "Google is always hiring, op maybe you should consider meeting the bar for once…",
            "of course it's a throwaway account dickriding google.",
            "Wow, this sub is awful.",
            "What’s up with the masks?",
            "That’s why a CS degree desperately needs  an ethics course, because so many people lack any.",
            "these people have more of a backbone than 90% of the people on this sub and everyone scrambling to fill their positions should know they are just as disposable to these big corps. how does it feel to know you stand for nothing aside from money? morality is cheap these days and i hope one day the guilt catches up to you",
            "The girl with two pony \n\nWhat in the actual google cloud it is trying to connect to.",
            "Streisand-effect in action.",
            "They're going to have to trade in those shirts for ones that say Xoogler.",
            "Yes. In India",
            "Those people knew what they were doing. They knew they will get fired. Now everybody around the world knew about their message. \nThey succeeded regardless. \nThis rat looking Google CEO is now being outperformed by small engineer team from OpenAI. He will get fired soon too",
            "People are saying sue google but like… what did you expect to happen? That protesting is a bad image, bad for business, bad for partners, etc. No matter what stance you take on the conflict, it’s pretty obvious that as a company, Google was going to fire them. \n\nThey can be terminated at will so",
            "They probably will have more job openings, if more people quit over Google's deal with Israel.",
            "NAH I stand with them they have moral not like google",
            "Israel is the one running The US obviously, you get fired if you speak against them, they pass any note they want, they commit crimes and no matter how many Americans protest they don't care, they take tons of tax money to spend on everything while in the US a 5 mins with a doctor could bankrupt you. Celebrating the fire of people peacefully protesting a genocide is a disgrace, one day you will have a conflict with the system and you will be treated accordingly. And yeah this is not capitalism. Respect for those who put their careers in danger to do the right thing, one day they will be the one standing up for those cowards who celebrate them being fired.",
            "9028 jobs going to India",
            "we still need masks for Covid? Or is that to hide their face and protect their identities? I’m genuinely curious what is the purpose in April 2024 of masking up.",
            "These people actually have a spine unlike 99% of people in this sub -- They should unionize and get more people involved so that someone can finally hold google accountable for something in this dystopia we fucking live in",
            "Don't see many Indians in that group...",
            "Lol @ antennas 🤣🤣",
            "Child killer company at it's finest",
            "Hope this ends in google getting sued.",
            "Shame on you.",
            "sure, potential indirect child killer. go and apply.",
            "Money talks",
            "I’m about to grab some popcorn; this comment section is about to get really heated. How about keeping topics that people are divided on out of this sub? It just causes drama and fighting",
            "Serious question: what were their jobs?\n\nEngineers? Or some HR position?",
            "I guess we’re using yahoo or bing from now on",
            "It’s funny how they thought the Multi billion dollar company’s gonna give a shit about their ‘protests’ lmao. There’s 1000s of people already in line waiting to replace them",
            "[removed]",
            "They did good. The workplace is not a place for politics. And Israel is an ally of the USA anyway.",
            "So much virtue signaling in here. Like as if you did anything to support the cause other than donating a 5 dollar bill.",
            "I have nothing against their contract with Israel, can I be hired?",
            "Good thing, if you're asking a company to cancel a billion dollar contract cause of your political beliefs then you're not professional enough to be kept in the company",
            "Can anyone explain what this numbus project is for which they are protesting ?",
            "What a bunch of privileged people, many thousands of applications for a handful of positions in this tough market for jobs. Imagine having a job at Google and loosing everything over a conflict thousands of miles away that won't stop no matter what you do",
            "this was also a topic of discussion when posted last time and my thoughts are also same.\n\nmoney >>> anything if not extremely illegal\n\ncome on, lockheed martin makes motherfucking rockets, missiles, whatever, their engineers are serving for the same purpose. do the engineers over there protest like “boohoo stop firing missiles”. no, because everyone at this age is desperate for even one cent. we need every drop of the money.\n\nI dont know how someone can be this entitled when there is bajillions of people wanting to be in your position for that money. ffs.",
            "Good riddance! Come to work to work, play stupid games win stupid prizes",
            "Google W",
            "![gif](giphy|7k2LoEykY5i1hfeWQB)",
            "Damn maybe now I’ll have a good shot at a google interview (doubt lol, millions still applying and will continue to)",
            "Hmm $1.2 billion versus 28 employees with a combined salary of \\~$4.2 million a year in an economy where they can be replaced within a few weeks... looks like Google managers know how to do basic math.",
            "[removed]",
            "People need to understand that companies are there to make money , not cuddle their feelings!",
            "Anybody knows what teams they belong to ? Let’s start applying",
            "Yes cancel the contract and let Israel contract it with India/New Mexico/Asia",
            "Good",
            "Can they do protest like these in other companies also? I guess more opening",
            "After listening to the land of the giants. I’ve always been curious how tolerante they have been of employee protests.",
            "[deleted]",
            "[deleted]",
            "thank god, these people and their kin are despicable.",
            "Why does Google even have 200,000? They are a search engine that has barely changed over the last ten years.",
            "[ Removed by Reddit ]"
        ]
    },
    {
        "post_id": "1bobktp",
        "author": "Adventurous-Hawk3662",
        "title": "First day teaching Coding class to my community. This kids it's their FIRST time they have used a computer",
        "url": "https://www.reddit.com/gallery/1bobktp",
        "score": 5372,
        "num_comments": 226,
        "created_utc": 1711469186.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bobktp/first_day_teaching_coding_class_to_my_community/",
        "comments": [
            "Awesome job bro keep it going.",
            "Awesome. Goodluck brother",
            "Finally a good post",
            "I give you my respects, brother.",
            "That’s awesome to say the least. It must feel pretty good to be a part of students seeing all the possibilities computers have for the first time. Only reason I would ever consider teaching because it can be a life changing moment.",
            "Amazing keep up the good work.",
            "Well done brother, proud of you",
            "I’m curious, if these have never used computer before - are you teaching them the basics of a computer first before you begin coding, or did you just jump straight into coding LOL",
            "The kid with the red shirt looks mind blown",
            "can we all shut the fuck up about all the \"pajeets and third world country enjoyers stealing our job for 0.5 cents per hour\" for a single post and look at how this dude is doing a motherfucking awesome deed. yes I am angry too, but come on.\n\nkeep it going champ",
            "Good job",
            "Not a coder but this is really cool and a great thing to do. Good for you man",
            "r/mademesmile",
            "Good choice in using scratch.  Should also check out [https://picoctf.org/](https://picoctf.org/) it's the gateway to cybersecurity for young students developed by CMU",
            "What country is this in?",
            "Jensen Huang coping and seething  😤 \n\n(Great post OP)",
            "https://preview.redd.it/d9awnmc3brqc1.jpeg?width=1170&format=pjpg&auto=webp&s=1a5a377ba0a0bad72b783f16296c8ce4f528c83e\n\nHe is starting to believe!",
            "Big bro looking at the screen is me the first time I found out about OOP in C++ 😭",
            "awesome! how'd did they like it? did they catch on well?",
            "Respect 🫡",
            "Great work.",
            "It's the second person in two day spamming subreddits with a very similar story and ending in asking for more computers. Those who ask how to help them, beware of scams. Help your neighborhood",
            "[deleted]",
            "Keep it going bro.",
            "Keep up the good work man",
            "Well done, keep up the good work",
            "Amazing",
            "holy W",
            "Keep it up brother, amazing job!",
            "Congratulations, brother",
            "More power to you!",
            "That’s awesome! Good stuff! Appreciate your work!",
            "Wowowoow keep it up brother",
            "Sensational",
            "This is such a great initiative! Good luck brother, keep it up!",
            "Teach them assembly and C",
            "Cool. Do they know python?",
            "I think this is great! As a former teacher, I think it might be best to help develop some typing skills before diving into and coding/programming since it's their first time using a computer.  Either way, keep it up!",
            "That one kid's face kind of cracks me up lol he's so fascinated.  I feel like he'll be one of those who does the best and carries your work forward.",
            "Putting your computer science knowledge and education to the best use...awesome...I aspire to work like u in the future...",
            "Good for you. Also educate everyone not to pull scams on elderly lonely people or kids overseas.",
            "Love the Fiesta Texas shirt!",
            "Damn, Sam Hyde wasn’t kidding about the ‘teaching refugees JavaScript’ bit",
            "This is my email address nahumwyclife@gmail.com.\n   Feel free to reach me if you have any clarification",
            "This is awesome to see. You're doing a great thing! Even if people don't want to program for a job, general computer literacy is an awesome skill",
            "Man, great work!🙏",
            "Man, great work!🙏",
            "Which tool and language are you using?",
            "hell yeah, love to see it",
            "ZULUL",
            "This is awesome. Keep the kids going buddy. You got this.",
            "The kid in the red shirt in the second pic is absolutely flabbergasted and the motherly figure is like “and what can they look at now????”",
            "I remember learning coding as a kid, made a basic calculator. It was a core memory in my life, you are giving a lifetime gift to these children. Good on you, and I hope they remember these moments as well.",
            "I love it keep it up <3",
            "Doing hero work bro 🫡🫡",
            "A big salute to you bro. Keep up the good work.",
            "Super cool, but tell us more? What are you starting out with, what is the plan going forward? How do you figure out what good starting projects are for teaching someone who has never used a computer before?\n\nI love it, I hope your students love it too! You are amazing dude",
            ":)",
            "Great work! I am just curious about the 3 white/brown power boxes on the desks - are those power transformers or UPS or what exactly?",
            "Amazing, great work my friend.",
            "Thanks for helping these kids man. Best of luck to you",
            "W post.",
            "Super hyped for these kids. they look stoked.",
            "Good luck.",
            "Excellent… thank you please never stop",
            "Cool asf",
            "I worry that things won't go perfectly, but only because I don't want you to be discouraged and stop doing what you're doing.\n\nKeep it up man. Don't let anyone stop you",
            "Thank you",
            "I volunteer to teach coding to kids, ages 7-17, specifically in unity. I knew only Python when I started. It's been great for me to learn (as in I have to cram study before each group) and also the single most rewarding thing I've done in the past decade. Having one 7 year old get excited over a simple bug fix can carry my optimism though for about a month. \n\nRaspberry pi foundation has a great library of coding challenges, introduction to topics and languages, and even some simple scratch games they can make. We work off their unity syllabus. \n\nKeep up the good work! I know you'll find it just as rewarding and exciting as I do! It's so beautiful to bring opportunities to people who would otherwise not have access, or maybe would be dissuaded from pursing coding as a vocation like I was. OP, you're an inspiration and a hero!",
            "Cool as fuck",
            "Cooking the field 🥶",
            "This is awesome, just out of curiosity what OS are you using?",
            "Windows 10",
            "You are doing a great service decreasing the digital divide which is the cause of so much suffering and inequality.",
            "They look so amazed. Wish I still had that kind of wonder in my eyes about tech💀",
            "I saw your active communities, this is in Kenya? Baraka kwako regardless man this is amazing. It’s the type of opportunity our people need",
            "This is great, way to pay it forward. Good luck to you, they seem very interested in it!",
            "Kid in red is either mind blown or watching someone get blown",
            "This is fantastic. Amazing work 🙏",
            "or consequat id porta nibh venenatis cras. Tellus cras adipiscing enim eu. Pretium fusce id velit ut tortor. Porttitor massa id neque aliquam vestibulum morbi. Pellentesque sit amet porttitor eget dolor.",
            "“It’s their FIRST time using a computer”\n\nThat is plain to see. Lol.\n\nhttps://preview.redd.it/k5rapnwknrqc1.jpeg?width=1170&format=pjpg&auto=webp&s=2db07ccc6c7d6bedaedf02d24baef23e92f393fb",
            "Respect man",
            "Hello world",
            "This makes me so happy. I hope they are able to find the joy in cs like many of us have!",
            "Wow good job!",
            "Looks excellent dude, keep it up\n\n(love that you started with Scratch btw, it's the best tool to teach algorithm)",
            "Bros creating more competition\n\n/s",
            "Amazing!! Much respect man keep up the good work",
            "Can they reverse linked list",
            "https://preview.redd.it/wytx7s9m9sqc1.jpeg?width=467&format=pjpg&auto=webp&s=2ef089f31413a44ac3bded47a4b78566023e37e7\n\nI agree with this kid's shock. Computers are wild machines!",
            "What type of computers are you using?",
            "This is awesome. Wishing you all the best and hope they enjoy it, it's like a puzzle to me and it's possibilities are endless!",
            "I absolutely love the look on the dude in the red shirt's face. Keep doing what you're doing and changing lives for the better.",
            "Are those PI's",
            "My very first hello world was also learned in very similar setting. Dirt floor. Bat droppings everywhere. 10-15 kids to a machine. Made my heart feel all kinda of ways the first time I booted up a computer - running on MS DOS too! I’m now a working dev and couldn’t be more thankful.",
            "This is the best thing I’ve seen all week bro! Keep it up!!! Love seeing the world educate the youth!! They’re in good hands🙏🏽🙏🏽",
            "I hope one of your students goes on to create the next unicorn startup that brings prosperity to your community",
            "What you're doing is so awesome, I'm sure these kids will be grateful to your work forever\n\nAlso, thank you so much for sharing this - I was in a bit of slump with my life and this really put into prespective how privileged I actually am. I can't wait for these kids to be the best programmers there is",
            "Great Work man. Wish someone do this in india too",
            "https://preview.redd.it/o0cpg2e04tqc1.png?width=1080&format=pjpg&auto=webp&s=fcf1a6b8d6e4d0c45402df28dd2817ac513a34f1\n\nMe using pivot on 3rd grade",
            "Finally something good on this sub",
            "If it's their first time using a computer, they would benefit more from a few months learning how to use a computer, MS applications, Internet and email. Not every one becomes a programmer, but anyone can get an office job if they try.",
            "Great job!",
            "Fantastic work.",
            "Such a good idea 😊",
            "Never give up",
            "Is there an organization on the USA side to send PCs or cash to Kenya?",
            "you are top g",
            "Love that you share what you know with your community. Solidarity!",
            "Respect mate",
            "You fuckin rock dude!",
            "Literally crying. Techonolgy will make everything better",
            "Education is the ultimate tool. Good work.",
            "Such an amazing project ✨✅",
            "Dark.net programming",
            "mashallah",
            "This gave me tears… what a wonderful human being. We need more like you in the world.",
            "Mah man you are doing great job keep it up!",
            "Those kids are **mesmerized**. So cool that you’re doing this!",
            "That's sick brother",
            "Do you think teaching coding to them will be a productive endevor?",
            "My mom did a similar program in her village and she now has a bachelors in computer science!! Thank you for your hard work it changes lives!",
            "I was about the same age when I first had access to a computer. It’s good that they know other stuff in today’s world before studying it!",
            "Keep the good work up 👏",
            "Nice! What are you teaching them?",
            "Fuck yea",
            "Kkllll lllll si te ñllllmkl l i'll lllll",
            "Chi...bbb que m",
            "Kongmunity\nKongputa\n\nMod please delete this comment its so wrong i can’t help myself oh no my thumbs are rebelling against their master and typing on their own nooooo",
            "Bro I am so proud of you. Please don't give up!!",
            "how am i supposed to compete with them for a visa??",
            "Nothing but future scammers",
            "[deleted]",
            "The job market is already oversaturated, you're gonna have these kids competing as well??",
            "[deleted]"
        ]
    },
    {
        "post_id": "1b7ahcp",
        "author": "Spare-Feed-4788",
        "title": "Brave Google software engineer interrupts a session on Project Nimbus in NYC",
        "url": "https://v.redd.it/bgrf01mbsjmc1",
        "score": 5254,
        "num_comments": 1390,
        "created_utc": 1709658446.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b7ahcp/brave_google_software_engineer_interrupts_a/",
        "comments": [
            "Already 100k applications for the position that opened up.",
            "Comments here seem so toxic. \nGoogle used to have a motto called \"Don't be evil\" and that used to be why a lot of idealistic people dreamed of working there over other tech companies that do little or no good for humanity. \nIt is kind of sad to see that most people in CS majors nowadays only care about money.",
            "You gotta respect this man, he respects his values so much he was willing to lose his job over it.",
            "Yeah most of you would have looked the other way and built the gas chamber for a bit of extra pay.",
            "The comments on this thread are kind of concerning… lol",
            "doesn't want to build anything that does surveillance            \nworks for google                  \nLOL",
            "I do not agree with him but he took a stance and is willing to put his money were his mouth is.\n\nMost people here don‘t have the guts to do that.",
            "Lot of people in the comments mocking the guy for possibly damaging his career.  But honestly, I have a ton of respect for someone who stands up for the things the believe in. \n\nWould I be able to do the same thing if a company was having me work on something I was morally opposed to?  Given how bad the market is for job searching.  As much as it pains me to say it, I'd probably just keep my mouth shut and resent it internally.  But I don't think thats really the right and honest thing to do.  It depends what your priorities are in life.",
            "y'all are crazy for these comments",
            "How dare someone touch him that isn't security!",
            "As soon as my work transitioned to being morally unsavory, I left and joined a university to work in global health. Best transition ever, and I'm proud of my work. The number of people in this comment section willing to facilitate immoral behavior for money is sickening. I hope it's just a loud-mouthed minority.",
            "I think he’s brave, all the weirdos in the comments are hating. He has more heart than 90% of the engineers I know",
            "Fuck sharehoalders, fuck that room of shareholders",
            "people in the comment section would easily sell their morals for money, imagine being fine by feeding your kids with blood money",
            "This comment section is about to be locked soon I can feel it",
            "based",
            "I applaud him, people need to speak up and he’s doing it. We will remember him in history with those who were not quiet during genocide.",
            "So about half this thread doesn't seem to understand that people's opinions on what is ethical can differ from their own, and also about half of this thread seems to think that any such opinions should be entirely disregarded for money. Great.",
            "Lmao i hope he has a backup job already",
            "chase weary pet lock rain sense tender soup gaping worm\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I’m glad there’s someone out there doing that.",
            "i mean, he is right",
            "I salute this brave man, we need more people like him who are willing to make a stand for what they believe in.",
            "Based",
            "Idk man, we're just outsiders looking in, this guy had a profession that required him to know/understand a lot of the ins and outs of whatever he was working on. When he says it's going to put Palestinian people in danger, his voice and inflection gives off some genuine concern and passion.\n\nHe doesn't want to contribute to what he sees the USA has contributed billions of dollars towards already. He seems pretty young too, so he may feel this is the only way he can appropriately take a stance. I highly respect his stance.",
            "puts on GOOG",
            "Holy based",
            "Well done brave man, men have lost morals and ethics.",
            "But building AI for facial recognition of Uyghur for China is OK, because America bad😡\n\nJust amazing how some Americans can care so much about one genocide while knowing nothing and actively cooperating with other genocidal governments",
            "People over here talking about morals and ethics, picking sides in a complex conflict that has been going on for decades living in their country far away from conflict protected by a military. Man I don’t care who you support but stop lecturing others about morals and ethics.",
            "And that is what a good upbringing and an unblemished moral compass looks like.",
            "\"I'm a Google cloud software engineer.\" \n\nNot anymore.",
            "The wild part to me is the crowd jeering at the employees standing up for what they believe in.",
            "Amazing man. Id hope to have the guts and I hope I would quit my job in this case too. I would say I would but I have never been in his shoes. I hope he will be alright",
            "Jewgle",
            "Look at the reaction of the audience. These comp nerds truly have no morales. We need to bring back bullying.",
            "he’s so brave for this and a better person than most of us — very few people will stand up like this to do the right thing",
            "The problem is that most of the people in that room considered the people with a voice a pest and tried to shut them down. If more people stood and protested against it in that room and in public, there wouldn’t be a project nimbus anymore.",
            "As much as I disagree with his political position, I can strongly respect him standing by his moral position as an engineer over his pay because it actually sickens me that many engineers are willing to compromise their moral compass for a paycheck, especially since I really care about the impact of what I intend to do with an engineering degree over my income.",
            "Yes, because Israel is waiting on you to build stuff for them 😂",
            "They forgot to finish the title.\n\n**Brave Google software engineer gets mocked as he briefly interrupts a session on Project Nimbus in NYC.**",
            "mf needs to learn to shut up and take his 300k TC",
            "How to fuck your career within seconds",
            "there was no need for surveillance if there were no terrorists originating from the West Bank. Those terror attacks happen on a DAILY basis, including today. he's either uninformed or morally bankrupt.",
            "well i guess he's looking for a new job today.",
            "Brave, lunatic. Potato, patahto.",
            "I think you mean ex Google software engineer",
            "Ok google, fire them and give me the job. I'll build whatever u want me to build.",
            "Mans talking about surveillance yet work(s/ed) at Google, the company that is the biggest wiretap on the planet. Working at Google absolutely contradicts anything principles for anti mass surveillance or privacy.",
            "\"I don't want to build blah blah blah\" \nI just don't get it. Just quit the damn job bro.",
            "Are the new openings announced?",
            "This is your brain on tiktok\n\nIf he truly had honourable motives he would just leave his 300k tc package",
            "Yes guys, the new opening was announced in Bangalore, India. Chill down and support the genocide.",
            "\"Brave\" is a strong word.\n\nMisguided might be more accurate.",
            " -job",
            "Taking a huge risk by doing this. Good on them.",
            "I wish just once that the camera would pan and show someone with a clean haircut and we’ll fitting clothes that looks like they work out. All we get is this instead. Justice for CS majors man.",
            "Brave? I guess people have very different definitions for bravery. To me, he seems like an attention-seeking baby.",
            "Drama queen. If you have a problem with the project this is not how you attempt to solve it. There are better ways to communicate your issues without being childish. And if he already tried those ways then he can always just go find another job..",
            "Glad more people are speaking up",
            "Literally LOLed at the 'brave' adjective.  Nice mask douche.",
            "serious kudos to these guys who actually spoke up, that takes some balls, and doing it for the right reasons too\n\nSome comments on the other hand are actually pathetic lmao real scab energy.\nthis is why we cant reach meaningful change",
            "thread is full of unemployed international students who would support genocide if it meant they could get an h1b and a 60k salary job",
            "Wow so brave /s",
            "He could just request a transfer to a non surveillance project and voice his dissention to his supervisor like an adult but instead he takes to the crowd to shout out Internet buzzwords he probably doesn't really understand. Good riddance. \n\nI've been in the same position and voiced my discontent on a different topic in a conference much like this one but I didn't heckle out of the crowd like an asshole, I waited until they started taking questions. Fucking terrifying btw I was shaking afterwards for a while.",
            "Another public embarrassment for Google and Blundar Pichai.",
            "K bye",
            "\"Brave\"",
            "Absolute none sense from someone who doesn’t know what he’s talking about",
            "full bakchodi",
            "Delusional \n\nThe moment he say, pay thr tax, he is doing that. It is not just a particular project",
            "Dangg",
            "I saw comments about Sundar and I wonder if we remove Indian managers would it impact brown labour hiring?",
            "Mozilla firefox",
            "For a moment I thought this had something to do with the Brave Browser.",
            "Yap",
            "OMG, yes. It is extremely brave to interrupt a session at Google. Because it's very dangerous in that room but he actually stood up out of his chair and screamed. It's honestly incredible and so inspiring. We need to find out this brave soldier's name so we can ensure he's nominated for a Nobel Peace Prize.",
            "Blegh",
            "So I hear Google's got great culture.",
            "All of these comments feel like propoganda shills\n 🫡🫡🫡",
            "Awww this reminds me of u/support_chicken",
            "Cringe",
            "While protesting at meetings is great, what really stops this stuff is unionization! Contact [code-cwa.org](https://code-cwa.org) to organize your workplace.",
            "So Google is evil but Lockheed,Boeing etc. are not ? 🤷‍♀️ Legit building and selling weapons.",
            "CS majors think they are a Wozniak, but once they get paid they turn into a Jobs",
            "What’s the big deal here? If he doesn’t want to then don’t do it?",
            "will people stop using Google over this?",
            "Props on putting his money where his mouth is I guess.\n\nAlthough good luck finding a company that has absolutely nothing to do with whatever issue you're bandwagoning at the moment.",
            "Fuck Google.",
            "So real talk what is google doing that is supporting Palestinian oppression? Like specifically the issues the population is facing now not denouncing the Hamas attacks.",
            ">Asked if the tech giants could decide at any point to shut down services, leaving Israel in the lurch, attorney Zviel Ganz of the legal department at the Finance Ministry said, “According to the tender requirements, the answer is no.” The contracts also bar the firms from denying services to particular government entities, he said at a briefing with reporters on Monday.\n\n[https://www.timesofisrael.com/israel-signs-deal-for-cloud-services-with-google-amazon/](https://www.timesofisrael.com/israel-signs-deal-for-cloud-services-with-google-amazon/)\n\nThere are provisions within the Project Nimbus contract which prevents Google and AWS from backing down, so the project will be finished regardless.\n\nPersonally, I hope Israel becomes more self-sufficient in the future. Its reliance on the United States (especially on foreign aid) is not good for America economically, nor for our public image. Israel has a very strong tech sector and economy, so eventually I think they can become more self-sufficient and less reliant on the United States for help.",
            "I don't think they work for google. They strike me as protesters who managed to sneak in.",
            "What's this guy's linkedin tho..wanna connect",
            "Join us at r/NoTechForApartheid",
            "Comments seem to forget one thing. Google has big offices in Israel, nothing in Palestine. At US Google, there are tons of Jews, I have met Zebulun, Perez, Dan etc.",
            "We need an international coalition to go into occupied territory and remove all the settler-colonists’ computer equipment.",
            "What's Project Nimbus?",
            "Nice mask bro. Lol",
            "Say goodbye to those 400k a year salaries",
            "Not all heroes wear capes 🦸🏿",
            "What a whiney baby",
            "No job 4 you. Stuff like this does nothing, gain power and actually do something.\nI grow tired of pointless protestors “spreading the word” the only person i think had any true emotion affect was Aaron Bushnell. Not telling people to go burn themselves to death, but instead of screaming free palestine and annoying the average person who barely FEED themselves never the less give their last time to charity, and yapping like a puppy to a lion. Extremist vegans have been doing it for years, last i checked i most people never stopped eating meat.",
            "“Im a google software engineer and I refuse to support….. surveillance” 😂",
            "Hasn't Google been doing evil longer than this guy has been able to compile code? I don't get how he could join Google in what has to have only been the past 5 years and think they were some do gooder corporation. Just got mindrotted by current affairs.",
            "this is what u call bravery. so many of the us ' top schools that recruit were jewish admins patronizing their own and penalizing other groups\n\n&#x200B;\n\nthese guys getting blacklisted from all these faang companies for saying the truth\n\n&#x200B;\n\nhalf htese companies would hand our data over to israel if they requested it",
            "Google and Amazon sold Israel server time 3 years ago as a part of a contract for defense and data collection (which in today's world is very normal). These companies literally can't leave these contracts.\n\nIf these people really \"morally opposed\" this, then they shouldn't have worked there to begin with. Why make a scene at a developer conference?",
            "Cloud apartheid is almost as stupid as gluing yourself to the road or throwing tomato sauce on the Mona Lisa. He's looking for attention and a clip to share on social media; he will forget about Palestine in about a month.",
            "They were all ears until the guy said the word genocide",
            "Bruh lol",
            "But he’s happy to build software that censors speech and suppresses the free flow of information and refuses to show pictures of white men. How brave of him in his echo chamber of overpaid entitled brats",
            "bwhahahaha They hired a bunch of brain washed lefties, now their code is trash and they can't go 5 mins into a meeting without an outburst hahaha.",
            "Diversity, includion results 😂😂",
            "What’s worse is people screaming at them saying “you support terrorists”. Im not advocating for either side as I don’t think this proxy war is about terrorism, it is about the elites trying to get more and more control (on both sides). Innocent people are being displaced and it’s wrong. I don’t support violence or war. It needs to end!",
            "r/NoTechForApartheid"
        ]
    },
    {
        "post_id": "1cjewo2",
        "author": "whiskeylactone",
        "title": "Career goals",
        "url": "https://i.redd.it/zgf32h3z19yc1.png",
        "score": 5211,
        "num_comments": 125,
        "created_utc": 1714758693.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cjewo2/career_goals/",
        "comments": [
            "Peak first generation immigrant moment",
            "I wanna buy this guy a pint and just listen to his story.",
            "I totally understand him. All that time working on a computer brings you nothing more than a pure love for nature...",
            "He also spent like 8 years at HP before moving to MS and stayed there for 22 years. Considering he has also done his PhD + 3 years of lectureship hes like 60 and joined MS at around 40y age. \n\nHis longevity is already incredible can't see many GenZ or millenials repeating this especially with the way companies work these days + the increased number of people doing CS + uncertainty with AI and everything",
            "Yea...he was fired by Microsoft and now he is raising geese for 2 years.",
            "Those things must lay golden eggs",
            "It’s true\n\nhttps://www.linkedin.com/in/dryuan?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=ios_app",
            "Dude completed the storyline.",
            "Reminds me of this post.  \n[https://www.reddit.com/r/cscareerquestions/comments/kfcmbj/ive\\_walked\\_away\\_from\\_software\\_development/](https://www.reddit.com/r/cscareerquestions/comments/kfcmbj/ive_walked_away_from_software_development/)",
            "This is my career goal too. Enough money that I don't have to work for money just enjoy and eat whatever I want .",
            "https://www.linkedin.com/in/dryuan",
            "I'd be the happiest man in the whole world if I get to this level in my future career",
            "this is my career goal",
            "I am 23 years into my IT career and can definitely feel the pull to switch to goose farming.",
            "same company for 22 years\n\npeak boomer moment",
            "Post link?",
            "Good for him. He is doing what he enjoy the most.",
            "\"on-site\" no way",
            "If you are telling me he got fired after 22yrs. I really do not understand why they are loyal to the company they work in. Should always come and go with a \"I provide service and yall pay me for that\". The recent lay offs were a huge eye opener for me.",
            "bro got fed up on all the blind posts",
            "![gif](giphy|7wq5iawqr1IZy|downsized)",
            "Would’ve been better if it was remote",
            "Untitled Goose Game",
            "[https://www.youtube.com/watch?v=K44V7Pc-vfw](https://www.youtube.com/watch?v=K44V7Pc-vfw)",
            "I might have intersected with him on windows phone. 12 years at there for me, I was the new guy.",
            "Glad MS didn't kill the golden goose but instead let him lay more eggs.",
            "In this economy you can skip working for Microsoft and go straight to being a goose farmer.",
            "Chad!!!",
            "Literally my dream, make enough money to retire and just farm all day",
            "Goose farming sounds like hard work",
            "It aint much but it's honest work",
            "You can get out of IT , but you can't get the IT of the guy ..\n\nThis is all gud , but just curious as to why would one update this on LinkedIn ??",
            "My boy on this track. Msft ai team making bank and he plans to retire way before this lol",
            "So this guy literally moved to farming in this bad market. An idol 🫡",
            "This is giving me anxiety. Imagine giving 20+ years of your life to a company and then they fire you over \"performance issues\".\nI mean whatever the real firing reason mightve been, the throat clutching self doubt would've destroyed me. Amazing guy!",
            "they’re living my dream (retire to mexico on a farm)",
            "fake hype",
            "There's a joke where a man walks up to a fisherman living in a shack on the beach, and asks him why he doesn't get a job to buy shit so he can retire and go fishing, drink beer and live on the beach when he already does it. So, I guess it's poverty when you're doing it for a living and retirement when you almost die to make it happen haha.",
            "Me in parallel universe",
            "My dream too is to retire as a farmer in a remote area far away from people",
            "I know a guy that bought a farm and makes honey. Another bought a wood lot and makes maple syrup.",
            "This is the best thing I’ve seen today",
            "Normal late career of engineer",
            "https://www.linkedin.com/in/dryuan\n\nHere is the guy",
            "ah yes the legendary goose farmer",
            "Simple life is the happy life :)",
            "Crazy you have to get all that experience to hop over to goose farming. Lmk if anyone knows of any universities with a GF degree.",
            "What's up with so many people on tech changing careers to have a farm? I include myself because I'd love to have one someday",
            "Shouldn't it be Geese farmer?",
            "Honestly I feel bad for people under 30. As someone closing on 40, I made the jump into D+ and felt a pressure release valve open. My performance reviews are much less stressful and there’s no rush to find the bottom.\n\nI definitely don’t treat employees at my contracting firm like a revolving door.",
            "If he had held RSU in these years or invested wisely, he should have enough $$$ to do anything he wanted.",
            "Based",
            "I identify as goose",
            "Goosfraba",
            "bro was the laziest",
            "[deleted]",
            "More boomers who bring very little apart from their out dated tech stack need to get the boot"
        ]
    },
    {
        "post_id": "1bi6lte",
        "author": "ProcedureMassive6210",
        "title": "What a time to be alive",
        "url": "https://i.redd.it/s9lfb9hlo6pc1.png",
        "score": 5031,
        "num_comments": 254,
        "created_utc": 1710807346.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bi6lte/what_a_time_to_be_alive/",
        "comments": [
            "Bro just cannot stop losing",
            "this is generational talent.",
            "[deleted]",
            "how you do this timeline",
            "Lmao we need more of male tinder, sh\\*t is too funny",
            "Mr 000😭😭😭. But what does apartment application mean in this case? (Im not from the US)",
            "[deleted]",
            "What happened with the 2 matches?",
            "Humiliation kink",
            "Change your pitch. All of them.\n\n\nIt's a branding/optics problem...",
            "They call him double oh seven\n\n0 girls\n\n0 jobs\n\n7 posts on Reddit about being ugly\n\nI'm sorry dude, I couldn't resist. You'll get through it though, I know you will. Genuinely. You can do it.",
            "You lift weights? If not probably wouldn’t hurt to start.",
            "I respect this a lot. Never stop applying.\n\nI'd rather go 0/1000 on swipes and apps than go 0/10, because if you go 0/10 that means you stopped trying, you lost confidence, you gave up. \n\nNever stop trying",
            "![gif](giphy|10LXerxbCMshpe)",
            "I want to give you the biggest hug ever, I know its super hard, but, stay positive",
            "LMAOOOOOOOOOOOOO",
            "How to make these charts",
            "Painfully relatable. You just gotta push through though bro, even when life tells you that you are painfully inadequate.",
            "Plenty of fishes in the sea. The sea:",
            "Bro you need a reset button in life",
            "Being unlucky is one thing. This is just something else man lmao.",
            "Haha. Life of an average male post 2020.\n\nForget Tinder and apartment and focus on getting a job. Then apartment, you don't actively seek for women when you are trying to get yourself stability. \n\nWomen have a very good olfactory organ, they can smell brokeness and desperation from miles away - even from picture.\n\nGet that money right first, the side effect of having decent finance is women. \n\nNever subscribe to the \" not everything is about money \".\n\"Love don't cost a thing\"\n\nHoez / good women you need money. Focus on getting that right first.",
            "now, what app did you use to make the graph, that i'd like to know",
            "Face reveal",
            "The trifecta: single, jobless, and homeless.",
            "This is the most reddit post I've ever seen",
            "Are you winning son?",
            "But really, how many came in a fluffer?",
            "I know it's a meme but if you really wrote 400+ applications and got only two interviews, you need to check your CV and your letter. Take a weekend to learn how to write them.\n\n\nLast year, I wrote five applications and got invited to four interviews. The only one that didn't come back to me was Google.",
            "This is the saddest post I've ever seen on the internet.",
            "🤗 welcome hehexd",
            "Fake for karma.",
            "why this is so RELATABLE",
            "Creating a flow chart on your life is wild.",
            "[<image>](https://pbs.twimg.com/media/FCPV8ovXoAUjvfx.jpg)",
            "oof",
            "Im sorry man",
            "Ok but now lets see the results if you were the other gender.",
            "When I have a shit day I just look at this sub and I am so happy I chose social science.",
            "Don't feel sad OP you deserve the best. keep on going.",
            "pouring one out for you tonight. and also rubbing one out for you tonight.",
            "Life of the average male in the information age",
            "Hop on Grinder I want to see something",
            "Pain.",
            "Basics necessities of life check \n✅ No house\n✅ No job\n✅ No love",
            "Bros Mr 000",
            "This man “sucks” sorry op just trying to cheer you up.",
            "Maybe the fact that you’re making a chart detailing all of this is part of the problem.",
            "I’m not gonna lie, I’ve looked through some of your post history and you seriously gotta work on your confidence man. You’d be surprised how much of a self fulfilling prophecy it is when you tell yourself you’re not good enough every day. I don’t think you need plastic surgery, I think you need to see a therapist, find some form of physical exercise you enjoy, get a good skincare routine, and a fresh haircut. Once you gain that confidence, just be unapologetically yourself and you’ll be suprised how many people admire you for that. Best of luck man I hope it works out.",
            "My life summarised in an instant by this figure. I think any average/below average male would be in this position!",
            "Get you priorities straight. Focus on Tinder. Spend a couple of more hours each day and your numbers will get up.  Gods luck. You can do it.",
            "Try showering",
            "[deleted]",
            "Bro it’s time to stop applying and swiping and start grinding. Watch those numbers flip after",
            "1341 swipes and 2 matches means your pictures are shit.",
            "Don't want to be mean but i have a feeling you are doing something terrible in all 3 and you never really bothwred to figure out why",
            "Refreshing candor.. but your W is coming, stay strong. 💪🏾",
            "Someone who can't commit",
            "/r justneckbeardthings",
            "Typical CS graduate in 2024.",
            "i feel you on the tinder front brother. Hinge has been difficult because i’m extremely short… such is life",
            "You would not catch me admitting to those Tinder stats. Waterboard me, break my legs, ludovico technique, nothing. Respect for the grind",
            "&#x200B;\n\nhttps://preview.redd.it/quvc79cfvbpc1.png?width=168&format=png&auto=webp&s=ad00d3ca58e322222dff9cf1b7f0fd5457cf3570",
            "Is that with some co-op/internship experience?",
            "how are you guys tracking these?",
            "Just curious, what makes applying for an apartment so hard?",
            "Idk which is worse 😭",
            "Where can I make such a graph?",
            "Hold on to your papers!",
            "Takes skill to miss that much 😂",
            "1,341 swipes without a single date, bro literally just lost the numbers game\n\nAlso from the look of it you need to get better at either lying or presenting yourself, or both. You don't have to be interesting, you just have to act interesting. As in dates as in interviews\n\nThe rest will work itself with time assuming you're actually compatible. First impressions are about acting a part because there's no way you can effectively capture what makes you unique or interesting in 5 minutes or less",
            "How do you only get 2 matches 💀",
            "Gotta be a you problem",
            "how do you make this chart?",
            "Is this statistically possible?",
            "Dude, meet women in real life even if you don’t have everything set for you. You have to start from the basics — being comfortable striking up conversations with female strangers. You may meet one that’s comfortable with you in your mediocrity, while you improve.\n\nForget about online dating. Most people would never have dated if they were judged only by their pictures. Meet women. You have to start so you can quickly get over the awkwardness at first meeting. Some women will make it difficult for you because they’re straight up not interested, can’t maintain a conversation, shy, etc, but some will help make the conversation fluid.\n\nBe direct with female strangers…don’t go around throwing compliments or calling them romantically. Only do that when you’re certain you’ve broken the ice. Try not to talk too much or ask too personal questions. Also don’t touch unless their body language shows they don’t mind.\n\nAlways know all women aren’t the same…they may share some traits, but they still have distinct traits deep down, so what works for woman A may not work for woman B.",
            "I kill on dating apps but absolutely fall on my face on my job search. Wish I could reverse it for a bit",
            "Mr. 0 😭",
            "Must be ugly and bad at work",
            "Maybe its time to get off the computer and linkedin and go outside lol",
            "Winning at losing is a skill bro. But tinder be too real 😭",
            "Bro you have like zero confidence. Your post history is tragic man. I would recommend therapy before plastic surgery.",
            "Homeless, hoeless, and jobless lol",
            "Try Hinge prob better luck",
            "I wish I could try tinder out, I wouldn’t do anything but I just wanna see if I get any matches. My girl friends have told me I’d get a ton but I’m a lover boy, and I don’t wanna be seen on those apps 😔"
        ]
    },
    {
        "post_id": "1bfk4ft",
        "author": "BeingOk9936",
        "title": "The day will come guys. Trust me.",
        "url": "https://v.redd.it/eo1o0ushejoc1",
        "score": 4818,
        "num_comments": 178,
        "created_utc": 1710525490.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bfk4ft/the_day_will_come_guys_trust_me/",
        "comments": [
            "Then we gotta find our Dragon warrior quick",
            "https://i.redd.it/k60ggg5gojoc1.gif",
            "As long as AI can replace the HR department, I am fine.",
            "In that case, what would be Po?",
            "Just send an empty JIRA ticket and say \"Good luck\"",
            "Even if this is the case I really only got into this field so I could fund my true dream, either want to buy a bunch of land to start my marijuana farm or buy a bunch of land to build a cycle ranch and host races. Lots of money in both. And so far everything has started out well, make right at six figures and am saving money.",
            "What is this from? Kung Fu Panda?",
            "Who’s going to be the panda?",
            "It won't.\n\nJust had this discussion at work.\n\nHow do you market AI to consumers?\n\nIf no work produced by AI can be patented/copyrighted then nothing they produce is IP.\n\nIt's a bubble that will pop.\n\nDon't get me wrong AI/AGI has a lot of potential just not in a capitalistic economy.",
            "AI scares me, 10 years ago it seemed that AI would appear in 100 years, if at all, but now AI can do absolutely EVERYTHING, entry-level programming, creating pictures, videos, faking voices, driving, simulating communication with other people, and this is just the beginning, all this appeared in a little less than 10 years",
            "I for one will appreciate my AI overlords and their free healthcare, simply by eliminating all need for work as it would be effortless for a machine.",
            "I feel like the fear of AI will destroy more careers than AI itself",
            "What’s this clip from",
            "“Why won’t those nerds stop trying to kill humanity?!?!?!”",
            "Po will be another AI, right?",
            "😂 Program ourselves out of a job, time to go to plumbing school",
            "All the business people jump in joy when they can fire all the expensive engineers and use AI for everything instead.  Until AI becomes sentient...",
            "😭👍",
            "Did Shifu really have to dump his ass as soon as he found out he wasn't the Dragon Warrior?",
            "More like \n\nhttps://preview.redd.it/pcwol1nz8koc1.png?width=1330&format=png&auto=webp&s=4106f2e741a12045e95eadd3192303c5a5c1ed04",
            "\"Who filled my head with dreams?!\"",
            "this meme format goes hard",
            "Are you even a doctor?",
            "u/gingerbre159",
            "He's already here and he's called Devin  \n[https://www.cognition-labs.com/introducing-devin](https://www.cognition-labs.com/introducing-devin)",
            "That day is already here",
            "u/savevideo",
            "even when that day comes, someone still has to update and maintain the AI. Plus Data entry jobs still haven't been replaced yet so I think software is safe for awhile",
            "Song name?\n\nu/auddbot",
            "I hope the AI sodomises the lot of them with a fire extinguisher.",
            "If AI can only learn from software engineers then we’ll be ok",
            "what do u call ai that's made by ai",
            "Seems possible that it becomes more of an \"on the shoulders of giants\" thing",
            "We need a dragon warrior.....we need PO",
            "Shifu always wins",
            "u/savevideo",
            "AI would won",
            "Do you even know how many GPUs Chat-GPT requires without googling it?",
            "Already done bro",
            "u/auddbot",
            "We all must unite and raid Ai companies",
            "u/savevideo",
            " I hope the bugs we wrote along the way which would be used for training will be our saviours.",
            "Shifu could smack his ass but didnt have the heart to do so, because he sees him as his child.\n\nLuckily, we programmers dont see our projects as our childr-oh wait...",
            "I always heard that people considered these AI more tools than replacements, then again I only do python and sql for data analysis and visualizations so my experience is less than others who may see it a different way. AI has mainly made my job more efficient than anything.",
            "Haha no it won't. This ai fear mongering is so stupid. For an educated take, check out what ray kurzweil says about it, not morons like Elon musk.",
            "Name of the movie??",
            "bro it's already here and it's named Devin",
            "This is one of those scenarios where I don’t think anything is being “blown out of proportion.” AI is advancing scarily fast. \n\nSure it can’t “replace us” now, but it only took a couple of years to advance to this point. Who’s to say that a couple more years won’t make the difference? Especially with CEOs backing it as a viable alternative to human work.",
            "[deleted]",
            "Its too late",
            "This is why I worry about my future career"
        ]
    },
    {
        "post_id": "18fxetx",
        "author": "TEMPERA001",
        "title": "True?",
        "url": "https://i.redd.it/w6n8aypqro5c1.jpg",
        "score": 4682,
        "num_comments": 252,
        "created_utc": 1702309367.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18fxetx/true/",
        "comments": [
            "I know a ton of people who blend the buff guy and the snoop guy…and when they talk they sound like the “nerd” in the first picture, and at raves might wear a feather boa that the lower left picture person would approve of.",
            "Need fat neck beard representation with a stained shirt",
            "bro stole my meme word for word bar for bar💀",
            "we need the fat neckbeard weeb guy and the hacker guy / OG nerd with a think pad and some obscure linux distro",
            "sip marble rainstorm bake ludicrous rude decide absurd roll deserve\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Is the first one the Indian guy that makes the tutorials or a Silicon Valley fan boy?",
            "I disagree with the \"become\" part. Most people who do cs are already one of these 4 long before they start their degree.",
            "TRT makes you better at leetcode",
            "This is just anyone going into college",
            "Finally some representation for the SARM goblin computer science community💪",
            "CREDITS TO u/ienjoymusiclol",
            "whats the 1st personality about ?",
            "I am on TRT now",
            "The pot head is the only one that knows how to wine down but then they forget everything that was the task the next week.",
            "Basically everyone",
            "/u/maxhamster69",
            "I’m the 3rd pic and I’m concerned. I’m predictable.",
            "I sure do love my thigh highs",
            "TOP right looking for his BOTTOM left",
            "Glad personality 4 is being represented",
            "Depending upon the situation, I can be any one of them except femboy.",
            "Damn tha girl hot",
            "Where is start up billionaire wannabe?",
            "switch snoop dog and computer nerd and you got a political compass chart",
            "I’m a woman but yeah, the guys in my class generally fall into three of these four types.  I’ve seen a good amount of neck beards and no buff types yet though.  \n\nWonder if they have something like this for women.  So far I’ve only seen the quiet, nerdy types who don’t make a peep or girls with blue hair (I used to be one of them).",
            "Sauce for bottom left?",
            "they didn't add a pic of a guy who looks like a homeless fellow.",
            "I'm thinking to switch careers, you pros out here: do cs majors make more money than MD physicians? Say neuro surgeons?",
            "This type of shit seriously makes me reconsider going into CS",
            "No fat dude (me), downvoted",
            "Why not... all four. At the same time.",
            "My life goal is to become 2 and 4",
            "Boy on the bottom left is the happiest btw",
            "Bottom two are the only ones to get bitches.",
            "I dont know if it’s true but I fall into this bucket.",
            "is that neetcode dude on the top left",
            "The person who wrote this thinks they are Snoop Dogg but they are really just Cartman eating hot pockets but also high.",
            "I became the shredded guy",
            "Jokes on you, I am unironically all four.",
            "Yeaa... I mean I was between the upper two at some point, but now I'm only 1.\n\nI should try to get some of that 2 again.\n\nAlso, I literally haven't seen any 3 here. Should be replaced by something else. Maybe like that guy that is in only for the money.",
            "🤣",
            "This made me giggle",
            "Personally trying to be somewhere between top right and bottom left",
            "No, most of them are fat with sunken eyes",
            "Weirdly, I think I'm in the snoop club. I don't get high, but I'm very laid back.",
            "I think this covers most type of guys lol",
            "not really, it should just be the top left guy in all 4 squares",
            "which way western man",
            "add unemployed valorant gamer.",
            "So join CS and become Indian?",
            "Interesting I dropped out of CE at warwick UK, among my many problems were finding them boring, Then thinking of myself as gay I might have stayed and done better if I had seen the buff guy. Instead finding myself more forced into snoop dog and even more mental health shit. \n\n&#x200B;\n\nRandomly when I was diagnosed with type 1 diabetes a decade later I did finally succeed in becoming the buff guy but by that point decided on enviro sci with the open university, wanting to repeat next to nothing of my time at warwick.",
            "Millennials will always be 2nd quadrant. Maybe GenZ be one 3rd quadrant",
            "Missing the fifth archetype, Terry A Davis.",
            "all four is good",
            "Notice how none of them are women",
            "fuck i’m bottom right",
            "I'm definitely the combination of the first two and second right picture lol",
            "Lol isn't this any profession in general?",
            "Isn’t this like, all the types of people that exist?",
            "False, I am all four.",
            "If you're a cs major and you look like upper right, you've failed your classes lmaooo. No one ik has that much free time on their hand unless their some Harvard genius.",
            "Nope it's just the first one.",
            "Ain’t non of y’all top right lol",
            "I am the overly jacked guy. Going into my senior year started working out freshman year quickly became an addiction. I’m now 6’4 250 lbs with a lean physique. (Not bragging) unless…perhaps…. I honestly just think where my brain is so logical I see it as a way to boost my smv and I now do everything to max out my looks because I noticed people treat me better when I’m healthy so I obsess over it lol",
            "Turn into fem boys? Lol everything else is accurate.",
            "My degree is in computer engineering. I am none of these four. I'm your average, diagnosed adhd person with a broad array of interests and hobbies that does not pigeonhole me into a personality or lifestyle. You can see by how average looking I am and remarkably unnoteworthy.",
            "Yeah I don't get any but the upper left.  I would imagine that's at least 50%.  Even those who didn't make it into the faangs even for internships still talk about them and might have stickers on their laptops.  Everyone wishes they would dare to try the lower left, for a perceived advantage.  Who falls into the right half?",
            "Hahahahaha no. I wish",
            "It hurts how true this is",
            "Some, like myself just blend it all up and are a bit of each",
            "Oh fuck Im the top left I think",
            "What type of person is bottom left?",
            "Political compass",
            "I'm a combo of three of these",
            "Theres also the totally atomised ones that lose their soul forever.",
            "I'm the two on the right. Can afford all the personal training and weed I want!",
            "I meant I’m the top left guy, but my dev experience = my lifting time * 1.743 = about 3/4 of a decade",
            "I am 3/4 of these lmao",
            "Andrew Eubanks",
            "I’m #2 but #1 at heart lol",
            "Baxate is all of them combined",
            "In reality, 90% of people you work with are just normal dads",
            "u are describing the destiny of any zoomer",
            "It for 20 years, I’m buff dude  +snoop but replace weed with bourbon",
            "Pretty much",
            "In which college can I find the third kind ?",
            "Lets see Andrew Eubanks do this leetcode problem",
            "A dude at work decided he was a woman today. Everyone was ok with it and just got to work. I think he got upset about that.",
            "You forgot the ‘hacker’",
            "been through all of those phases",
            "I have CS and CE friends and can confirm this completely true",
            "I don’t know,  I think I can fit in all of these maybe less on the femboy stuff though. Pretty much qualifies me seems like it.",
            "iv never seen the top right form",
            "These are just the four kinds of people that exist",
            "Bottom left had me pondering for a minute.",
            "There are also hot girls in cs. A lot apparently",
            "Let's see Andrew Eubanks hit this leetcode challenge",
            "I guess I am not a CSE then",
            "Yea I think I'm snoop over there lol",
            "Rajesh will still remain Rajesh",
            "im so snoop dogg atp",
            "I’m in this picture…fuck",
            "Real (I’m top right in front of the homies but become top left the moment a girl walks in)",
            "Who is the femboy? Asking for a friend",
            "Centrist",
            "everytime",
            "True shit",
            "Hi. I'm bottom left",
            "Been Snoop since 1992",
            "Honesty this is the greatest field for me to be a jacked pot head in. I kiss up to the managers while the nerds do the work! I was told when I first started “performance doesn’t get promotions relations do” and I took that and ran with it.",
            "Top left is literally me 🗿",
            "I am absolutely the bottom left. Get it? Bottom? Heheh",
            "The w. S.  E coif turf u cc ok \n D nmmon m\n   Just\nReL",
            "Honestly I think I am or at least have been all four at some point"
        ]
    },
    {
        "post_id": "1axr6b6",
        "author": "Rare_Reporter_4434",
        "title": "My boy tried using CS to get a girl 💀",
        "url": "https://www.reddit.com/r/csMajors/comments/1axr6b6/my_boy_tried_using_cs_to_get_a_girl/",
        "score": 4417,
        "num_comments": 269,
        "created_utc": 1708661094.0,
        "selftext": "Me and my boy were out when he seen a girl he found really attractive. I was going to leave the scene but he said he wanted me to be kind of close to rate his game 💀\n\nHe asks her what she does for work, and she states what she does. \n\nShe asked him what he does for work and mf goes “I’m a computer scientist.” 💀💀💀😭😭\n\n Okay Mr PHD 💀💀. Mf failed college algebra 3 times and has been on the job hunt for 9 months. 😭😭😭😭(me too but I’ll still be using that line 👨‍🔬)\n\n\n",
        "permalink": "/r/csMajors/comments/1axr6b6/my_boy_tried_using_cs_to_get_a_girl/",
        "comments": [
            "I cannot be the only one who read that title and thought bro wrote an algorithm to attract a girl",
            "Actually, I'm an engineer, a software engineer",
            "big ups to bro u gotta take ur dubs in this market",
            "Might as well hit her with the \n\n\"Oh I am a prompt engineer\"",
            "Did it work? Cant hate on the brotha for trying 🤣",
            "why you hating on your bro 😂",
            "I mean the college fees has to help somewhere. Game is game.",
            "Saying \"I'm a computer scientist\" is basically saying \"I'm unemployed\" nowadays.",
            "But was she bad?",
            "Mans was cookin you can’t hate on that 😭",
            " 💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  💀💀💀  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭  😭😭",
            "Game is game",
            "I literally make 200k at a faang right now and am 6’1 with a fit body and still struggle with women.\n\nEdit: Lots of people checked out what I looked like and reached out to dm me lol. Women included so thanks for the outreach. In case anyone else is curious about what I look like.\n\nHere are my dating profiles \n\nhttps://imgur.com/a/v67IOmx\n\nhttps://imgur.com/a/ZmwEal2\n\nhttps://imgur.com/a/kag9xx0\n\nAlso for those who wonder why I still struggle with women, here’s the gist. In tech hubs, women can find high paying dudes easily. If you’re hot without being charming, women will be down to hookup and will make moves but refuse to do anything long term. I had a few women that straight up told me they’d like to make out and hookup but not interested in relationship. \n\nI also typically don’t have too much issue with women making first move on me and most of my successful interactions have been when they make first move. I usually don’t do as well when I make the first move.\n\nIn terms of what lessons this has for the original post, the message is that personality matters and money and looks can’t compensate for a cs personality.",
            "That's a lot of emojis 😃❓🫠🌊🪀❓🧦😊📞💿🌊",
            "Wonder if anyone every used “I am a Python” Master 😂",
            "😩😩😂💀",
            "https://www.reddit.com/r/csMajors/s/IyC5GJpti9\nHe posted his side of story too....😂",
            "What the hell is a computer scientist.",
            "Well if he has the degree is does technically count",
            "I didn't fail any thing 😎",
            "This is the dumbest post I’ve ever seen",
            "I know your son personally he is really a computer scientist. He has many job offers he just doesn't like to show off. Great guy",
            "I thought he meant counter strike... The game.. 🥹 🤣 Nade boost FTW!",
            "Reminds me of this:\n\nhttps://www.tiktok.com/@fantabz/video/7018277816886250758",
            "The hot ones want labourers anyway",
            "Too many CS majors out there these days. You pull that on a girl, 50% chance she pulls out a whiteboard and asks you to balance a red/black tree.",
            "how do you fail college algebra and grad with a CS degree \n\ndo ya'll not have to take calculus?",
            "[deleted]",
            "He's gonna be in trouble when reality checks💀",
            "Damn as a future SWE, the crying posts here scared me, but im more relieved after I read this post and realized the retardness of the average OP.",
            "Do you know how many people with CS degrees' code I've had to fix over the years?\n\nThis isn't the flex he thinks he is. He should say what he really is, which is JUNIOR DEV",
            "😂😂😂😂",
            "Sis doesn't know about the current market",
            "haaaa haaaa",
            "He a game dev or something?",
            "\"Computer scientist\" I did the actual KEKW wheezy laugh when I read that and so far that's been the coolest part of having this drippy sinus issue and cough. So... thanks!",
            "Well..did he get her number?",
            "He'd better just say \"i'm an IT guy\" next time specially when you're around lol",
            "He should've said that he graduated from Johns Hopkins and that he used to blaze up every day with John Hopkins and Sloan Kettering. If he really wants to make her panties wet, tell her they used to be Step Brothers.\n\nAs funny as it is sad, 99% of women would not pick up on the reference, even afteryou blatantly did it for them.   lmao",
            "Sadly I tested and It doesnt work anymore :/ but it used to very well",
            "He’s a keeper, protect him at all cost !",
            "I have a mustang...A toy mustang",
            "I'm smelling jealousy 💀",
            "\"You know memelords? I'm one of guys that makes those people possible\".",
            "People at my uni would put ‘computer scientist’ in their insta bios, so cringey 😭",
            "Ok but did he get it tho",
            "Everyone in this situation sounds like an idiot. There is NO job title of \"computer scientist\", and I would immediately assume someone was lying and knows nothing about CS if I heard them say that. You either work in some specific field of software development or data or other field of IT, or you do research. ",
            "I’m kinda a computer scientist myself!",
            "My boy takes the opposite approach, he claims he works for our public water company. That way if they keep talking you know they aren't just looking for someone who they think makes a ton of money",
            "My man your friend just met the wrong girl.\n\nDuring uni I met a really cute girl who shared a Cs lecture with me, but studied something else.\n\nAsked her whether she wanted to study together, she said yes. Got to know her. On our exam day we afterwards played mario kart and drunk a fuckton of beer. Ended up FWB ending up in a relationship.\n\nBonuspoints: Played league back then, she did too. One night she wasn't feeling it, so I went to play her favourite hero. She literally said \n\n> You dick you're doing that on purpose. You know it turns me on seeing you play Diana\n\nI'm not even kidding. Good times.",
            "This is why, here in my country, the profession is protected by law and you can't call yourself a computer scientist if you aren't legally one",
            "Needa try this",
            "bro",
            "Not me hoping he used code to impress her instead of a crusty lie 😞",
            "The question is did he get the girl or the number or even a date ?",
            "No one cares that I’m an MLE because I forgot to shower :(",
            "What do you do for work \n\n“I work in CS”\n\nOh, lol… I don’t usually hear it abbreviated like that. What discipline?\n\n“Counter Strike…”",
            "This does not impress women.",
            "That’s some reesa reesa shit",
            "I don’t actually see what the problem is except they may be unemployed and lied? Is that what’s going on? I’m confused 😂",
            "Coming from /r/all, I thought this subreddit was about major counter strike tournaments and your friend was a pro player",
            "I remember when we had to hide that if we wanted a chance",
            "This is a super nerdy thing to be freaking out about ",
            "😂🤣🤣",
            "You’re bad LMAOOOO",
            "I explained to my now wife how to add binary numbers the first time I met her in person. Just got to have that confident geeky vibe and be genuine.",
            "It’ll eventually work lol just maybe not in girls at a bar.",
            "I honestly thought the title meant he used CS gas on a girl. The skull didn't help.",
            "\"I'm a doctor.\"\n\n\"Well, I applied to med school.\"\n\n-some TikTok video about wedding costs",
            "sanitary engineering technician (janitor)",
            "Reddit decided this would be on my front page today, saw “Using CS” and thought this dude tried to use Counterstrike to get a girl?? No shot that worked. after reading and seeing the sub this is in, dude tried to play the nerd in highschool who is now rich card…well played.",
            "He could've tried bragging about propane and propane accessories.",
            "Since when has this become something to pose with?\nWhen I was dating 20 years ago I talked about my year as a medic\n and they loved that.\nBut never ever mention computers, boringness level even below accounting.\n\nYou know, fat jerk sitting in front of the screen all day, trying to hit keys with sweaty sausage fingers.\n\nAh yes, good times.\nOn the other hand it was rare enough that knowing how to call printf without segfaulting got you a job hehe",
            "I mean I used my CS degree to get a completely unrelated job lol. So I wouldn’t say this But, I’d probably say a software engineer over a computer scientist lmao. Your friend shot his shot can’t be mad about that lol",
            "When I was single my usual go to when a girl asked what I do for a living was \"I'm a writer.\" When she'd ask what I wrote, I'd say \"I write code 💀\"\nMost thought it was lame, but it also worked great on some. Which is fine you don't need to impress them all.",
            "im a freelance dev. If someone asks what I do I just say I'm a contractor. They assume I whip people to lift bricks.",
            "And I’m a master business administrator (can’t administrate for shit)",
            "Computer scientist is just another word for unemployed fuck that either got laid off or can't get hired nowadays 💀\n\n.....Man we're fucked",
            "😂😂😂",
            "I do Position Acquisition (I apply to jobs)",
            "i love this game 😂😂😂",
            "I thought bro embedded his prompts into an AI to get him to a conversation phase so he can slide in",
            "https://preview.redd.it/e63vejaylmkc1.jpeg?width=1170&format=pjpg&auto=webp&s=a933d3ac88a069f6a4d64e3a73725fe6e3136925",
            "That he was trying to get into her GitHub account",
            "I was thinking this was the Counterstrike subreddit and he was dropping his rank to pick up girls lmao",
            "Is a computer scientist even a thing??? If it's your job you're a software engineer. If she sniffed that out that'd be even funnier",
            "This came up randomly in my feed and I thought CS was CounterStrike lmao",
            "Every app is a dating app if you are brave enough. Especially in the age when people are dating Eva AI virtual gf bots."
        ]
    },
    {
        "post_id": "1chsdr8",
        "author": "Remarkable-Bicycle32",
        "title": "Just wow",
        "url": "https://i.redd.it/68xi1dclruxc1.jpeg",
        "score": 4330,
        "num_comments": 593,
        "created_utc": 1714585703.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1chsdr8/just_wow/",
        "comments": [
            "Polish tech market is booming",
            "Went to a cybersecurity event and some companies were oh we have our hardware people hired from Mexico and software engineers from Israel Tel Aviv…then why are you here dude",
            "Guys do i live in the wrong india?",
            "This is indeed the future of employment. Something called technopolies and how labour is outsourced to places where it’s cheaper and the only people that get to live on fancy cities are the ones who profit off of these people. Many books had it in writing long before we could even start to see signs, yet people think the idea of “late stage capitalism” is some absurd concept",
            "Great that Google is on the AI (Actually Indians) hype train.",
            "Our company created a center in a country in Latin America for 500. People were ecstatic and happy. \n.. and six months later laid of 500 ppl here in usa",
            "Cheaper humans💀",
            "I remember saying this will happen once everyone started justifying not needed to be in the office.",
            "This is why I’m aiming for financial services companies",
            "I hate going back to school just to get this shit lol",
            "Where is the hiring happening ;_;",
            "36 top AI employees jumped ship. From Google to Apple. From the U.S. to Zurich \nThings are changing fast…",
            ">Silicon Valley creates the issue where the Tech Industry is extremely expensive. \n\n>Tech industry slowly starts moving away from Silicon Valley year by year.\n\n\nThey're basically punishing people for making them successful at this point. In other news, more fucking West Coast Tech bros are gonna invade my city.",
            "More BS. I actually wanted to work for Google but it’s extremely unsafe to do so now in the U.S. Wish something was done about this shit.",
            "If the government could do anything about this that would be great",
            "I have a strong feeling this won't be good for them long term.\n\nThere's little downside to outsourcing manfacturing since its mostly a solved game and can thus be commoditized.\n\nHowever, engineering is literally what made Google what it is today, most of the important decisions and strategies Google chose are ultimately engineering decisions. Factory workers have little impact on, say, how good the new Ford model is. Meanwhile 95% of what makes Google's products good is their engineers (especially senior and above).\n\nI highly doubt Google will be able to maintain their company culture and standards for engineering excellence when you have all these teams split across poor countries with completely different culture and work environment than the US. I think there's a reason why almost all of the important/innovative/profitable tech companies came from the US, even though the US is only 4% of the world's population. Somehow I doubt Google's next big product, or any big tech breakthrough for that matter, is going to come out of Mexico City or Mumbai.\n\nOffshoring is something companies do when they're desperately chasing short-term profits, not growing and innovating.\n\nWe also don't need to look far to see how offshoring has made other companies deteriorate. Boeing, anyone? And all of the dying automotive and hardware engineering companies? Google's situation seems awfully similar: slowing growth so they start cutting corners to maintain facade of good profits for shareholders.",
            "The comments \nAI = Actual Indians \nMe being an Indian wondering why am I still unemployed",
            "idk if this is dumb but at some point, all those countries would also become more expensive to hire from right? directly because of foreign companies providing them jobs and stuff? it might take a lifetime but it'll probably reach that point no?",
            "Google can do whatever they want and no one can stop them. They want to hire programmers who are literally hungry to work and won't ask questions and work overtime without a complaint.",
            "watching the cs majors subreddit become a r/.workerstrikeback / antiwork  adjacent subreddit has been a pleasant surprise…\n\nnever thought i’d see the tech kids and tech babes be worker class revolutionized....",
            "Man Im telling you - Life in India is atleast 10x harder than life in US.\n\nThere are just so many people, corruption and Indians usually get paid peanuts. US is and will always be the best place to stay",
            "Think about it like this. Already the people that get hired are usually immigrants that have worked extremely hard, went to US school, and are extremely smart. All they are doing now is deciding to get these same caliber of people but from abroad since remote work and a global workforce is way more manageable. \n\nI think about it like we’re complaining as Americans that we have to now compete with the rest of the world. And we have to pay American prices for everything. It’s super bad for us. It’s so so bad.\n\nBut the only option is to join smaller companies that need to first get off the ground running and become a high level position so that when the company becomes large enough to do stuff like this you’re more of someone overseeing the vision instead of doing the actual work. \n\nIt is what it is.",
            "If AI is actually Indians, then is ML Mexican labor?",
            "So the American Google Indians get laid off for cheaper labor Indians from India who can slave away for less pay and double the hours.  What else is new from an Indian CEO",
            "Worked for the auto industry!",
            "Time to start ditching google products. If only it were easy.",
            "I don’t think people realize how cheap indians can work on. It’s not even about quality, if they do the bare minimum, that is enough and the companies just choose to pay the least for the bare minimum. Add to that that india has cheaper cost of living that somewhere like the US, people are willing to work for a lot less.",
            "This is why I'm aiming for working in a police station :)\n\nWhen layoff waves and protests come, I can legally hit 4.0 GPA kids with a baton.",
            "This is what work from home means, it has been going on for a long time but you knew that this was going to be the ultimate outcome. The technology has been long vetted and now organizations are built around the concept of no office environment. Once through this hurdle the inevitable of offshoring white collar jobs would be accelerated. Those that thought that this was not going to fundamentally affect them both in terms of employment and holding onto any compensation leverage were kidding themselves. You don’t need someone from Berkeley make 400k  to work on new emoji’s.",
            "Is CS career the next factory plant career?",
            "All the AIs are gonna start talking in an Indian accent soon",
            "Tech needs to unionize. Seriously these corporations need to understand that the American worker will not be sold out anymore. If billionaires are gonna billionaire and we live in trickle down society then the least they can do is trickle it down. Fuck their bottom lines, what about our bottom line?",
            "Well what did you expect... Why pay 200k for a junior when they can pay 100-200k for the best people of an entire country. US software engineers are highly overpaid, especially fresh graduates. \n\n(Yes I'm talking out of envy ofc, wish I had a 300k job)",
            "A few years after AI displaces the people who actually know something their code base will be unmaintainable, a few years after that things will be grinding down, then they’ll need cs again.",
            "India and Mexico to ai on a Nvidia gpu funnel coming next",
            "Just yesterday, Google organised a Search Engine leaders connect with selected IT folks (working in different companies)  in Bangalore.\n\nThe whole event was about how Google is doing great things in search, and sounded like a potential recruitment event. I can connect the dots now.",
            "Don’t worry - we’ll all just have to re-skill and learn manufacturing so we can do manufacturing jobs.",
            "Why are we surprised? What's more outsourceable than tech jobs, especially when people elsewhere work harder for less, and they even need to cross borders?",
            "Companies with a certain % of its operations team outside its own country should be obligated to sell their services/products based on that foreign country pricing. It's time to stop companies from hiring cheap overseas labor and charge US prices, both to foreigners and Americans.",
            "Gotta switch to trades fam",
            "Get into a stable government job while you can CS Majors! The competition is already getting fierce. You may not make as much as you would in the private sector, but your job will still almost certainly still be there the next day.",
            "So who do i vote for to stop this from happening??",
            "Incoming racism in 3...2...",
            "when production of goods became a big thing (and a mundane thing) it was outsourced to countries with cheaper labor and more lax labor laws. now that this is happening to software and AI, it’s reflective of how we view these services….no longer specialized but mundane",
            "This sub is cs majors but the post doesn’t specify its software people. What are the positions? Not that any layoffs are better than others but just wondering",
            "There is an antidote against employers like this: unionization. We need to organize.",
            "This was my last job. Take complex roles no one thought could be offshored and offshore them. I love working remote, but if your position can be done from home it can be done cheaper in another country.",
            "I'd be interested in knowing the correlation between believing \n\n* the top 1% in America need their wealth redistributed\n* the American middle class should be protected from international competition\n\nIf you believe exactly one of these things, good on you for consistency. If you believe neither, may the jungle you believe in claim your soul. If you believe both, you are in for a rude awakening in the next decade or so.",
            "This has happening at all companies. They hire one very senior lead and give them a team in India to run and execute.",
            "My company's been doing the same... cut 10-15 people from sweden and america, stopped hiring in canada and sweden, hired ~20 from india.",
            "Why pay a single swe $300k to work remotely when you can pay five indians $30k each",
            "Didn't y'll wanted remote jobs? Here you have.",
            "Can I kindly get an Indian passport sir?",
            "AI = All Indians",
            "Amazon does this and their customer service and seller support are awful. These people dont care about solving any issues",
            "This SUCKS! But it makes sense. Why would a company pay 3x the salary just to hire locally? Engineers are typically the biggest expense.",
            "When they hiring again imma finesse my way in there",
            "Welp on to doing plumbing.",
            "My friend work for ET&E for 18 years, they laid them off but told them they could move to Mexico to be Team Lead for $9.50, more than the $5.50 they were paying the Reps. 😂😪😪She was like, “Nope!”",
            "Even funnier to watch youtube morons who claim that the companies are overhired.",
            "Microsoft is moving to Africa https://news.microsoft.com/en-xm/features/furthering-our-investment-in-africa-microsoft-opens-first-africa-development-centre-in-kenya-and-nigeria/",
            "Core capitalism....",
            "Since the 90s there’s been shareholders frothing from the mouth the thought of cheaper labor overseas.\nWith it comes the caveat that you need to pay people locally to fix it. Ends up costing more. \nCycles back to hiring locally.\nTale as old as tech.\n\nJust another doom-post",
            "I knew this going to happen as Google has grown into a monstrous globalist driving force. They must think we (the US) are not worth their loyalty, and they'll exploit other countries' citizens because it's cheaper and demonstrably a winning strategy for their bottom line. But they must know they will hurt the US economy, and they couldn't care less.",
            "How wrong would it be for congress to write a bill that requires US companies to have at least 90% of their workforce sourced in the US?",
            "If you can be replaced by low wage specialist without education was you a good specialist prior?",
            "how come there wasn't any  engagement farming under Twitter comment???",
            "No big deal, you guys that got laid off can just learn to cod....oh nm. Dang, maybe you can drive a truck.",
            "I keep saying European men and its decendentes are under attack by the big 4 but I'm just a extreme right idiot with no culture or history.",
            "This is the type of stuff that makes me appreciate Japanese employment laws. Near impossible to get fired or laid off here.",
            "I’ve said it many times and will say it again. There isn’t a FAANG company (or company of similar repute) in existence that pays its developers enough that I would stake my livelihood on it. Maybe if I was single and transient, bouncing between AirBNBs and could pick up and start over on a moment’s notice, but I can’t imagine trying to raise a family that way. No thanks, it’s not for me.",
            "Before commenting does anyone even know if this is true. Or do you just randomly believe accounts on twitter",
            "Been waiting for the google dominance to start fading away. Looks like they’ve decided to jump start that process.",
            "It’s been happening in the auto industry for decades. Honestly if you want to know what the tech industry will look like in 20 years. Just look at the Auto industry. Competition on a global scale. Ultimately ends in China beating everyone because all the work goes there. They steal the ideas and make cars for Pennie’s on the dollar.",
            "This has been happening for quite some time now. \n\nAlready some of the best people working at faang were immigrants who came to America through grad school\n\n\nNow the grad school part is removed and hence you get even better talent",
            "Hey anyone who sees this, I am in my first year doing software engineering at a uni in Australia. Should i switch courses?",
            "Cheaper employee with AI equals profit unfortunately.",
            "Why don’t we also outsource the executives? Surely we could save big bucks hiring abroad as well.",
            "Source: Some random guy using allcaps in twitter",
            "“Too many techbros are ruining my city!”\n\nTechbros get laid off.\n\n“Oh the humanity!”",
            "Press F to spit on google",
            "Yet Ive never seen outsourcing software engineering goes well. Like there is 40 years of experiences on this and every time its a disaster.",
            "The South African tech market is booming.",
            "There are no internship listed on openai,google ,x  for ai in india.where they are hiring from outer space.",
            "I can’t believe and this seems to be just the starting point.",
            "Dang.. hope those former employees know the risk of black lung",
            "Indian CEO so makes sense",
            "This is how the world works. The jobs happening in the offices or you wanna say \"white-collar\" jobs will be mass replaced by AI and remotely working cheap labor. Cyberpunk happening.",
            "Wow it's fucking over....",
            "Googlers from America just have to learn to live on the money that IT developers in India live on, then no one will replace you. Strange guys from America thought they would be paid 500k-1000k forever?)",
            "Actually Indians has me dead haha 😭😭😭😭",
            "Finallyyyyy it’s about time.. this is the smartest thing to do if u want to make big money.. why haven’t they done this sooner… I can’t wait until other companies start doing this as well… omgggggg this is going to be awesome",
            "Protip - don't specialize in a field that can be shipped overseas :).",
            "didn't they try outsourcing years ago and it failed epically",
            "So we just need to move to India then?",
            "The saddest thing is that you KNOW they aren’t paying these Indian and Mexican workers anywhere near what they should be.",
            "Why are people so surprised?",
            "The best one “AI => Actually Indians” . True definition of AI!!",
            "I would normally agree with the sentiment here, but the google software engineers and others in the US are paid S O  M U C H  that i dont see how a company can rationalise not offshoring. Its genuinely busted how much many US engineers get paid for the same work",
            "This whole \"eat the rich\" thing, it's not just a catchy slogan anymore, it's starting to feel like a viable option, you know? I mean, these billionaires hoarding all this wealth while folks are struggling just to put food on the table. Maybe it's time we stop talking about it and start figuring out how to actually do it. 🤷‍♂️",
            "So we’ve outsourced our manufacturing, now we’re outsourcing our services…. Who will be left???",
            "The irony here is that even with all the jobs moving to India, it's actually fucking impossible to get hired here as a new grad. These companies get relatively more experienced devs there (think 2 YoE domestic positions outsourced to 5-7 YoE devs there). Ironically, that 5 YoE is remarkably shit and borderline comparable to a newgrad. (source: have been a part of an Indian tech team and it's kinda embarrassing) The entire system is churning out inept engineering grads because of how being an engineer is a cultural phenomenon, making it difficult to get in subpar colleges and even more difficult to get hired but honestly, doomposting aside, all of us just really need to weather through till the system implodes and things will ideally reset back to normal and they will, once the companies starts bleeding money due to enshittification of their services and staff.",
            "Indians: we are being taken advantage of and we deserve the same total compensation as the US.\n\nAlso Indians: you want me to work 80 hours per week on call for 800 rupees per month, SiGN ME UP! A job is a job",
            "[deleted]",
            "![gif](giphy|ngjM4ATTzHOSuY6gVl|downsized)\n\nIndians realizing theyll need to work the same Google job in india for 1/1000 of the pay when their visa expires.",
            "That's what happens if you can just hire Top 1% devs from low wage countries that can do the same quality of work for 1/3 of pay. You'll have 3 good workers for the price of 1. It's Inevitable."
        ]
    }
]