[
    {
        "post_id": "196vccw",
        "author": "PregnancyTestsByShaq",
        "title": "That’s pretty much half the competition gone.",
        "url": "https://i.redd.it/bwezile03icc1.jpeg",
        "score": 1664,
        "num_comments": 87,
        "created_utc": 1705279344.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/196vccw/thats_pretty_much_half_the_competition_gone/",
        "comments": [
            "I train every day just in case they need a fully STACKED engineer 🤫🤫🤔😤😤😤😤🤔🥵",
            "I know a few people that were being difficult because they didn't want to carry their laptop around...  \nThey were very annoying.",
            "Guys i think he meant he can lateral raise 25lbs. Everyone should fear him.",
            "LMAOO",
            "I suppose it's a way to discriminate against the physically disabled in a roundabout manner",
            "Hold up? Being a requirment for this type of role is already far fetched, but does it say remote? Lmao. I really want to know what they expect people to lift. I'm going to assume that they provide some heavy duty company laptop that is somehow up to 25lbs.",
            "You can't lift 25 lbs?",
            "Sam Altman rushing",
            "Good, this should appear more in JDs.",
            "On top of my head i feel i cant carry 25lbs but my cat weighs 11lbs and his waifu cat is 12lbs when i put them together i feel i can carry them and if i add a baby kitten it should still be doable. Therefore i qualify for this job",
            "25 pounds is literally nothing. You are a grown man/woman you can easily lift 25 pounds",
            "I got this.",
            "This and communication skills are the real reason why so much of this sub and r/cscareerquestions are unable to find jobs",
            "Finally my time to shine",
            " Thank God I’m STACKED 😤",
            "‘Remote’",
            "\"With or without accomodation?\" Wth does that even mean?\n\n\"Steve, here's $20, go lift that 25 lbs for me\"",
            "And another 49% of the competition gone if the job description requires US Citizenship.",
            "I’m on track to becoming 6’4” and 200 pounds lean. Last weigh in was 180.2. I got this.",
            "Dream is to bench 315 then drive to my job at google 🙏",
            "Every CS major is either a soft femboy or jacked gym rat",
            "I've seen the \"What do you bench?\" scene from Pain & Gain and this is clearly a red flag that will only result in that intern getting played by Marky Mark in a crime drama biopic.",
            "I hope this is a remote job",
            "25 lbs is not even heavy dude",
            "I’m in Bothell hahaha",
            "i bench 315 loser",
            "Cross-functional?",
            "wait til they say ability to bench 225"
        ]
    },
    {
        "post_id": "1bvn9in",
        "author": "pololololololol",
        "title": "They know we’re desperate",
        "url": "https://i.redd.it/kqe81utktgsc1.jpeg",
        "score": 1649,
        "num_comments": 108,
        "created_utc": 1712237635.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bvn9in/they_know_were_desperate/",
        "comments": [
            "aaaaand an automated rejection within an hour of submitting the form",
            "Might as well add, can you work for free (if required)?",
            "I just put yes to everything to get the actual interview. Then you have some game in the playing field. Gotta play the game.",
            "Do you really think you’re going to be working weekends and overtime as a BI developer intern? Say yes and move on",
            "Just put yes and don't work. As simple as that",
            "6. Will you suck my dick From The Back if required?*\n\n🔘 Yes\n\n⚪️ No",
            "Really dumb. They’re going to filter on it though so might as well not apply if you answer no 😔",
            "Can you sell kidney if required? Yes",
            "Would you blow your manager (if required)?",
            "Try Upwork my bro cause thats crazy",
            "That’s desperate ?\nBeen working like this since ever..",
            "Can we assume this is a paid internship? Those fall under the same requirements as a paid employee, meaning they have the right to force you to work overtime and holidays, but they are also required to pay overtime wages.\n\nIf it's an unpaid internship, they are not allowed to force you to work overtime or holidays under the FLSA. The internship experience must reflect a student learning experience.",
            "Maybe, but they are not desperate enough to provide entry level and training. Until that happens, these bs senior roles and junior roles requiring 2 yoe are going to keep being reposted, and any employee shortfall is 100% their own fault. \n\nNo sympathy for any company right now complaining about lack of workers. They could have people in 30 minutes if they pulled their head out of their asses, but they actively choose not to.",
            "“Do you wear wigs?”",
            "\"Will you pay me?\" would be my response. I will do many things for the right amount of money",
            "What kind of internship asks you to work weekends and overtime?",
            "You gotta compromise your way to the position first. Then once your in start establishing boundaries because they’ve invested time in the hiring process to get you. Sounds slimy but that’s sadly how it is as an employee competing for these jobs.",
            "Tbf, they’ve always had those questions on some applications. Not a new thing.",
            "This is the stage where you're supposed to just be a yes-man. You can negotiate the actual terms later.",
            "Should put yes for everything so you might actually get an interview",
            "I interviewed for a BI intern position lasr year, 6 rounds and then they revealed the rate is 15$ an hour. Ghost the recruiter immediately after that.",
            "The know I'm desperate\\*",
            "Can you be our slave(if required)",
            "Unless the first question they ask if you can...\n\nWell yes you can, but they dont ask if you are willing to do that...",
            "There’s alot more work up north if you want to go to NYC. I know people who went to Monmouth",
            "Yeah like just lie on these things if you need work.",
            "It's not desperation. These guys are making sure they get hardworking ppl for poverty wages.",
            "“I can but I won’t.”",
            "Had this on my job. I rarely get overtime work on Saturday eves (deploys) and I get paid for that overtime in addition to salary. Then again, rules for Canada are different.",
            "This is for an internship?",
            "I'm sure 99.99% of applicants put yes for everything. Honestly I would pick/hire you for being different and honest and putting it as it is instead of being fake/lying like the masses.",
            "Intern ... relocation?!?!?! What?! Do interns travel for internships? Do they even get paid?",
            "That’s so sad",
            "Damn relocating for an internship? That’s wild",
            "Working weekends, holidays, and overtime is outdated. It is a relic of the previous generation.",
            "OP secretly changed to \"yes\" after the screenshot",
            "I do this all. Except relocation. Sometimes you need to. It doesn’t mean that it’s usual thing and it’s payed off. Or it’s an emergency. Or it’s my fault.",
            "I don’t think any of that means anything. Every potential employee fills it out regardless of potential job title and potential job requirements.",
            "O(1) rejection",
            "CS man baby when he can’t play ping pong at work.",
            "Lol you are a punter, they wouldn't ask those questions if they didn't expect them of applicants",
            "This is inhuman",
            "I'm trying to imagine the amount of the EU issued fine if some US company tried this questionnaire here. But when I start imagining it, the result always comes as NaN. My imagination just doesn't allow exponent of that magnitude.",
            "Overtime? As in non paid overtime.\n\nThese corporations are soulless. View other humans as replaceable robots.",
            "Just interviewed at a role which required a 3 day take home assignment. The scope requires PM, write models by code, and build data pipelines, all for the pay of a senior BA.\n\nI told the interviewer maybe ChatGPT is what they wanted.",
            "I would answer yes to all. Not because I can work on weekends, means I will work on weekends.",
            "Dude wtf..",
            "Can I do any or all these things? Yes. Will I? Probably not, but depends on how much you’re paying.",
            "FYI — If you see these types of questions, just know that working at this company would suck. Working weekends, 40+ hours, etc as a new grad is some diabolical shit. Sadly, it helps to lie. If you answer no, you get filtered out.",
            "No wayyyy. WTF",
            "Time to start your own business!",
            "Lmao where does it end?",
            "Well, it’s an internship. If it’s good enough experience surely you can stick it out for a couple of months?",
            "I’m an old guy (45).  I don’t usually work overtime or weekends nowadays (but occasionally do) - but did more when I was younger (it was not necessarily the “norm” though).   What is the expectation for people graduating now?   I give some kudos to new grads seeking jobs with the balls to tell an employer you won’t do those things - but is that realistic (and still land a job)?  Most of the comments I’ve read on this Reddit are from young people (I assume to be brilliant as CS majors) struggling to find work.  Did I miss something?  (Just curious- no judgment here)",
            "Do you get that if there's candidates willing to do all those things, and you're not, that you will lose?\n\nBefore the pandemic, it was pretty normal that if your job wanted you to travel for work, you just did it.\n\nBefore the pandemic, you moved to the city where your job was (except in unusual cases), and nobody really complained.\n\nWorking holidays and weekends makes sense to ask if you are working in a company that truly needs 24/7 on-call availability for whatever reason.\n\nNone of this is that crazy. Y'all just got spoiled by very recent history.",
            "Will you be applying for more jobs while working this one, preferably better than this one with better pay/benefits/work-life balance and less asinine questionnaires, if required?",
            "answer yes, get the position, keep interviewing.",
            "Well, completely fair questions. If other candidates would work holidays (probably against getting off other times) then they're a better fit/more willing than you, so.."
        ]
    },
    {
        "post_id": "137t5yd",
        "author": "prawtuts",
        "title": "Offer rescinded for asking about negotiation",
        "url": "https://www.reddit.com/r/csMajors/comments/137t5yd/offer_rescinded_for_asking_about_negotiation/",
        "score": 1635,
        "num_comments": 381,
        "created_utc": 1683219517.0,
        "selftext": "I went through the intensive interview process at a Series B startup **Fathom Health**, which included:\n\n* 1 Hackerrank\n* 1 Recruiter call\n* 1 Phone Screen (Leetcode-ish)\n* 4 onsite rounds (2 system design and two leetcode)\n* 1 Tech Talk (A presentation with a topic of my choice)\n* 1 round with CEO and 1 round with CTO\n\nAfter doing well on all of these rounds, I got a call where the CEO gave me an offer.\n\nThe recruiter had mentioned that their typical work day is 10-7 PM and there there would be some form of on-call for a few hours every other Saturday.  Also, there was no bonus aside from the total compensation.\n\nSo, I asked for a base compensation that was 8% higher than what they offered me. A day later, they called and said it was the founders decision to rescind my offer.  I understand that not all negotiations work out it is outrageous that they are not even willing to talk about it.\n\nThis is a tough market and , needless to say, this news felt like a gut punch, especially because I gave three weeks of my life to this process, and excelled at every round. To pull an offer from a candidate you thought was a good fit for the company just because they asked about negotiation is entirely inappropriate.\n\nThe whole experience took a huge toll on my lot of mental health.\n\nLink to email : [https://imgur.com/a/PEZxNQ5](https://imgur.com/a/PEZxNQ5)\n\nP.S. I have received an overwhelming amount of support and kind words from everyone. Thank you all so much.\n\nIt is especially hard securing any offer in this job market, especially being on Visa. But if someone treats people this way before even joining the company, I just feel it is for the better. I am back to square one, and I know only amazing things will happen.\n\nP.S.\n\nAs there is no point looking back, I am one week from away from graduating with a masters. I am still open to Machine Learning Engineer/Software Engineer opportunities. I have three years of industry experience in software/ML. Over they last couple of years I have been studying and researching in ML, and I also have published some of my research in reputed conferences. My interests are in applied machine learning and backend development.\n\nIf you are hiring or know anyone who is, please reach out to me on chat or email [ahpkohli@gmail.com](mailto:ahpkohli@gmail.com) (throwaway).\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/137t5yd/offer_rescinded_for_asking_about_negotiation/",
        "comments": [
            "Dodged a massive bullet",
            "They could've just rejected your offer and stood their ground on their offer. The fact that they rescinded the job offer because you tried to negotiate is such a red flag. It sounds like they are basically saying that a person who stands up for themselves and advocates for themselves is not a good fit for this company. In other words, people who do not advocate for themselves are good for this company.",
            "Dodged a bullet, sounds like a terrible company to work for. Be sure to rate them poorly on Glassdoor's interview process. They could've simply politely rejected the extra 8% as part of negotiating.",
            "What did they even offer? This seems horrible unless you're getting paid a massive amount which I doubt is the case lol.",
            "A tech talk?! Bruhhhh",
            "I lived exactly the same situation with a canadian company operating in salesforce industry, after i got the offer which was below average, they said that it is open for negocitation, which i did i asked for 17% more to make it average (everything was on a call)\n\nThey rescinded the offer with a small ''email'' stating that : you were not satisfied with our initial offer so you are not motivated enough about the job and we don't know your value yet so can not give your more than the base salary for your title, they added some bs about my ''lack of communication'' too\n\nSome companies just want people they can abuse i guess",
            "Douchebags. The same happened to me recently with another company. The market is tough but I am keeping score, and there's no way in hell I'll interview with certain companies again, and I'll be sure to tell each and every one of my friends. We all have been exchanging our experiences interviewing in this market, and some companies are blacklisted. \n\nVisa Inc., for example, likes to interview people and ghost them when it's time for an offer. If you mention you have another offer, Visa will drop you like a hot potato. Chewy is freakin' toxic and gives people PTSD. Google has been interviewing people and giving them hope only to let them drown in the team-matching phase forever. They don't even have any headcount now, but they're still interviewing. The list goes on and on. \n\nI hope we don't forget our collective experiences when the market corrects.",
            "Sounds like you got lucky imo That place would of been a hell hole. You should name drop them",
            "Sounds like they offered multiple people the job and someone else was will to accept with the first offer. That or just a horrible run company. Either way dodged a bullet with how things were handled",
            "Thanks for letting us know who is willing to waste our time and then not negotiate.",
            "They made you do a tech talk presentation?  Really?",
            "Finally someone who names & shames these companies! Never going to apply to this 💩 company, thanks for letting us know. If you landed a job with these picky pricks I bet you can find a better job elsewhere, good luck and godspeed.",
            "I’m curious, does the subreddit have a “blacklist” of companies that pull off trashy moves like this? It makes no sense to pull an offer because negotiation was attempted- you just say “hey we aren’t willing to go higher than this” but still keep the offer.",
            "Hey nice! I also interviewed with them a while ago.\n\nOn the intro call I talked to their recruiter, and they mentioned the 10-7 workday immediately, and presented it in a very \"suck-it-up-or-dont-work-here\" kind of way. They also did the interview over Google meet but didn't turn their camera on, and mentioned their founders a lot, both of which felt weird and mind gamey.\n\nOverall, I got pretty toxic culture vibes from them and ghosted them. I am now at a much better company.",
            "[deleted]",
            "Fuckem. They don't want to negotiate salaries they lost a candidate.\n\nI encourage each and every one of you to demand a higher salary than your initial offer.",
            "Yeah you most definitely dodged a bullet there",
            "wow they have such long recruiting process and they rescinded the offer just because you tried to negotiate? wtf",
            "bro on-call on Saturdays as an intern is crazy🤣",
            "I’m sorry this happened to you. You need to understand that the tide has turned, and it is a buyer’s market right now. Without any experience, any offer is probably a good offer right now (if it is within reason).\n\nTech has been crushed with layoffs. Hiring has either frozen or slowed to a crawl at many places. There is no shortage of SWEs right now. In fact, there are too many. I was laid off from a startup recently and it took me 5 months to find employment. I have more than 12 years of professional dev experience and much of that as a lead SWE. I had to lower my expectations to find something (I took a senior level position).\n\nI wouldn’t focus on money in the present. I would instead focus on gaining relevant experience and self-improvement. This will become increasingly important as AI improves and is more accessible. Entry level SWE jobs will be phased out, and it will be nearly impossible to get a job programming without many years of experience and/or great skill. I feel for anyone graduating right now. Good luck!",
            "Thank you for sharing. But yes you did dodged a bullet. completely understand how tough the market is even having an offer. but a bad job seriously could f you up ( my experience )",
            "There are ways to be the most successful at negotiating. I like to start by thanking them for the generous offer(if it is.) I then ask for a bit of time to consider the offer fully. I finally respond with a thank you and ask if they will consider some percentage increase based on my understanding of the role, market factors like salary comparisons, and the cost of living in the geographic region. I end with thanking them for considering my request and that I am in no way intending on closing the door for additional conversations regarding an amount that works for the conditions of the organization and my desires. I have received basically every amount I have requested. Sometimes it is a little less but comes with an explanation for why they could not match my request. Best of luck with your search!",
            "Think of all the effort you went through as the price you had to pay to maintain your own sanity. I can't imagine how toxic the company must be and how much of a toll working in a place like that could take on someone. You've clearly got some skills if you can pass such a rigorous interview process, so maybe just count this whole thing as practice for the future. Best of luck going forward!",
            "send them an email with a link to this post.\n\nalso what a shit interview process. 1 tech talk??? wtf. you prepared slides and shit?",
            "Wow. Fuck those people.\n\nFor what it's worth, my first offer out of college (2013ish so times were different-ish...) ...it was no cash. Move to bay area, get to live in a house with several other junior engineers, be given a stipend for food and gas, and that's it. No cash, no stock, just some living expense and the honor of working for them. I asked for stock or cash on top of this and they ghosted me immediately.\n\nI pretty instantly started making good money in a place that was cheaper to live.\n\nRescinding an offer like that is flat out disrespectful.\n\nIt's not some special honor to work for anyone. You're bringing a lot to the table and if they can't show you respect then they can fuck themselves.\n\nSleep well tonight knowing you never have to deal with those people again.",
            "You dodged a massive bullet. These guys seem like assholes. They would make your life a mess",
            "Ten interviews? Did I count that right? I would not have had the patience for that nonsense. \n\nHow much time are they wasting in interviews? Only to reject you because they effectively did a \"Take it or leave it,\" without letting you know that negotiation meant they'd rescind the offer?\n\nYou dodge a hailstorm of bullets. Good luck in the rest of your search!",
            "Bullet dodged. Wouldn’t want to work with pompous pricks like that anyway",
            "Man that sucks big time. You definitely dodged a bullet on this one though.\n\nSide note: For those that unfamiliar with contract laws. They can do this bc a counter offer invalids the current offer. You can get around this be simply asking if there is any room for negotiation as this counts as an inquiry rather than a counteroffer.",
            "That company would have ass fucked you with no lube.  Blessing in disguise.",
            "Hey man- I feel your pain.  Same thing happened to me a few weeks ago.  Applied and interviewed with a company who made me do the following:\n\n- Initial Leetcode and JavaScript trivia questions round\n- Homework with framework of choice (React/Angular)\n- Group Panel with more programmer trivia, CSS trivia, backend trivia and hey, even math trivia/brainteasers - as if it was some kind of hazing ritual\n\nApparently after my first round of leetcode and JavaScript trivia, despite my resume showing I had 8 years+ experience as a Sr FullStack engineer working at many well to do companies; the hiring manager told my recruiter that I wasn’t smart and he didn’t think I should get paid what I was asking for.\n\nI thought to myself - what a fucking jerk, that manager sounds like he has a stick up his ass.  The recruiter told me not to take the manager seriously and that he would do a good job for me to get the best deal.  I was a bit desperate given the layoffs in the market so far and so I went thru with the other interview rounds and completed the homework even though I didn’t get paid for it.\n\nI finally got a verbal offer after all that and it was pretty lowball.  The recruiter said that I should take the offer, so I asked him if the company could wait until the next day for me to make a decision.  He said okay, and said he’d have paperwork for me to sign anyway in a day.\n\nThe next day, the recruiter texted me said that the company decided to rescind the offer.  I was taken aback— like wtf?  What a shitty toxic company— they didn’t want to wait even one day for me, they decided on their own that my hesitation to sign was enough for them to rescind.  \n\nI felt gutted too because I was thinking of taking the job since I was starting to run out of money.  \n\nToday I can tell you I am so glad I didn’t take that shitty company’s offer.  I got another offer today and it was written for MORE than I made at any of my previous jobs.  I’m so happy! \n\nSo I write to you that despite all the crap that goes on in tech—you dodged a bullet, and so did I.  There are good companies out there and if you just work on your skills and interview to many places, you will get something good eventually.  Just keep working at your interviews and good things will happen, don’t put too much weight in any company, especially the shit toxic ones.  Weed those out, and let them waste their money and time until they do everyone a favor and go out of business.\n\nGood luck!",
            "That’s an unnecessary amount of interview steps for them to not give an ounce of flexibility.  That’s pretty shitty tbh.",
            "I think tech job seekers are over-spoiled... It's no longer the market back in 2021, so don't be that greedy.",
            "So you feel rejected.\n\nThe interview goes both ways. You asked the right question. The point of your interviewing them is to get rejected if there is not a match. \n\nThey are looking for technically superior but completely naive and manipulable employees.\n\nThis would have been a nightmare job, where they are going to ask the candidate for nights and weekends, 80+ hours per week, and basically total crunch until the point where that candidate breaks or dies. \n\nIn the poker game of job interviews, you had to fold. Better than to go all in on a busted hand.\n\nYou don't want this job. The candidate who got the job does not want this job, but will be somehow sucked in and stuck.\n\nYou did good! You caught them before you got sucked in. They almost had you.\n\nGo back and do it again. Make sure you are interviewing management as hard as they are interviewing you. Honestly, if they have nothing to hide, the fact that you are not naive will be in your favor, and weed out the bad management.",
            "This means nothing until you post the numbers",
            "Everyone saying he dodged a bullet and they are assholes. \n\nOP said he discussed salary with them in one of his comments, and that discussion had them lowball him so he countered with a higher range he would be satisfied with. The final offer was in the middle of the range he gave which was already basically a negotiated amount, and then he asked for more on top of that. This is a red flag from a hiring standpoint, they met his ask, and then he asked for more. It's a no brainer to go with an alternative candidate.\n\nAlso negotiation is always a risk. I don't agree with how this company handled it and they should have just responded that they are firm on the offer, but it is still basically like he negotiated a salary, then tried to renegotiate it after settling on a number that was previously acceptable to him. You can't just keep asking for more and more and expect employers to not bat an eyelash.",
            "This is insanely scummy. I'll tell everyone I know at my college not to apply there. So wildly unethical.",
            "I say good riddance. Happened to me once 10 years ago. I was so bummed about it for several months. Turns out the CEO who was a toxic POS and the startup crashed and burned.",
            "Without knowing the numbers it’s tough to say",
            "Your email seems very diplomatic.\n\nI am curious about their reference to \" ... your original guidance in the first interview for the role.\" They are claiming that you stated a salary that would be acceptable, and then you attempted to renegotiate (which is different from negotiate) after they had met your expectation.\n\nMay I make a small suggestion? Unfortunately, frustrated as you are right now, publicly badmouthing an employer *can only hurt you*. (It sucks, I know.) In this case, your name is attached as well. \n\nBased on everything, I think you'll get other good offers soon. Good luck!",
            "Get used to being firm on your principles like this. Next time name and shame. At a minimum warn your peers.",
            "I think this was a red flag so you dodged a bullet.\n\nI recently tried to negotiate by asking for an extra 10% . They respectfully replied that the offer cannot be changed. So I accepted the original offer.",
            "\\> I understand that not all negotiations work out it is outrageous that they are not even willing to talk about it. \n\nYou took a risk for a very small reward, and it failed.  On the other hand, you learned something about job-hunting. You also learned that start-ups are a different beast. The founders have an emotional connection to their business whereas a FAANG company is a massive bureaucracy that probably brushes off your demand with no negative consequences.",
            "Do you mind reviewing my resume? I'm getting 0 interview calls ☹️",
            "For a mf six step process, you should've asked for a 50% increase. Any assholes out there requiring that much of a candidate deserve to lose that talent.",
            "it sounds like OP gave a range, got that range then changed his mind and wanted more over his range. this is a red flag for a company because it means the candidate lacks commitment, is wishy-washy, greedy and doesn't negotiate in good faith. \n\nHe didn't even give a reason as to why he's worth more, he just says that his financial goal is to have more money. \n\nCompany kind of sucks too though since they could've just said no and stood by their offer instead of rescinding it. \n\nBoth parties in this negotiation comes away looking terrible.",
            "IMO, name and shame. Companies that won't negotiate shouldn't have the advantage of anonymity. Unless there's something missing here, that's a nonsense policy.",
            "toughen up. a company doesn't owe you shit, and vice versa.",
            "People always say to always negotiate, but then I see these posts, and I'm like hell no, I'm not risking an offer that took forever to get over a small boost in pay.",
            "Dodged a massive bullet. \n\nThis place must be exceptionally toxic. Everything you wrote was standard negotiating procedure with a TJO.\n\nYou’ll find something better.",
            "Thank you for naming, at this point mods need to ban people who share horror stories but don’t give names. If it’s shared right no one will be identified and the rest of the community stays informed",
            "For real, the kind of person who creates this kind of post on Reddit while naming the company probably is a bad hire.\n\nWhy would I hire you if you are going to put me on blast later? If they did something illegal or discriminatory that would be one thing, but they didn't. They just didn't want to give you any more of their time after they decided it was not going to work out.\n\nI would absolutely work for them based on the way they handled this and would not be willing to work with you based on the way you handled this.\n\nI don't think you're a bad person, but you seem like you're early in your career and have big ideas about how the world is supposed to work instead of accepting the way it actually does work.\n\nIf someone discriminates against your or does something illegal, I can understand putting them on blast and I personally have and have had consequences in my career as a result. I can no longer get references from an employer who allowed me to be sexually harassed. Your situation isn't really what most of us would call being treated poorly, no disrespect.",
            "This is what you get for being greedy. Tons of people would die for a 90k job, you should’ve just taken what you got",
            "i cringe at OPs self-love. maybe personal taste",
            "No one complains like software devs lol",
            "Damn they’re cold",
            "that many rounds?? brutal af. \n\nYou definitely dodged a bullet",
            "Never ever negotiate an offer via email, you always want to do it over the phone or in person. The way you worded it was distasteful too, they probably interpreted it in a negative way.",
            "You did everything right. Your email was very professional and courteous. If they’re this inexperienced with hiring then it doesn’t bode well for them in the future. You dodged a bullet. You would have been abused.\n\nIf it was me I’d call the CEO back and ask if he’s seriously this incompetent.",
            "What in the actual fuck? Negotiation is such a normal part of the process. It's almost like a cultural must. It'd be weird if you don't negotiate. Even when I was completely happy with my offer I negotiated 2%. They said no and I was like cool, when do I start?",
            "Assholes",
            "The negotiation may not have been the reason or only reason. I couldn’t read the email cuz the image was not quality. \n\nEither way, it sucks. Don’t be afraid to negotiate after this experience. If they weren’t willing to budge then who knows how intractable they might be on other things.",
            "sounds like they did you a favor. 3 weeks lost to dodging a bullet is better than getting sucked in and having to deal with what would probably be bullshit. if they aren't willing to negotiate in good faith before you're even on board, imagine how much they'd fuck you once they had their hooks in you.",
            "Name and shame them!",
            "This happened to me as well.",
            "I just asked for a bunch of different things from a company, and they very calmly and politely just declined them. Rescinding an offer is unheard of.",
            "“The cofounders have spoken” 😹",
            "Man that was an awesome original email you sent. Sorry it went bad. What was the offer if you don’t mind me asking? What position?\n\nUnfortunately, I think a lot of tech jobs are being saturated so the salary is getting lower each day.",
            "It's one thing to say take it or leave it.  It's another entirely to pull an offer after you put a fair number of hours into them already.  Gross and unprofessional on their part.",
            "The way the company handled this is still unfathomable to me. So sorry.",
            "I think that they hired somebody else who accepted the offer, so they didn't bother to even tell you that they don't have positions??",
            "What a heaping pile of garbage, seems like they felt personally insulted which is incredibly stupid.",
            "How much were they offering? You went through so many rounds for a startup wtf",
            "You should be celebrating. Sounds like a shitty company you don’t want to be a part of.",
            "Holy shit bro that is genuinely terrible. I'm so sorry you had to go through that. But so many massive red flags, good thing you dodged that bullet and then posted about it here so other students can avoid the company. \n\nReally not sure why so many startups seem to think they are entitled to top talent and then simultaneously treat said top talent like trash. Hopefully this news spreads like wildfire and they are humbled when they realize treat your employees like trash = no one wants to be your employee.",
            "This happened to me right out of school. I was desperate and willing to take a lower paying position. I asked about wiggle room in the offer and they rescinded. Years later I’m really happy I dodged that bullet.",
            "They should pay you that just for the interview process. You dodged a bullet. 10-7 plus on-call and no bonus.what a joke",
            "The CEO is a chach. He or she didn't get to where they are without negotiating.   When the ceo offered to that's who you should've countered to directly.  If when you countered (hopefully it was on phone) and they said no,  that's when you should've decided to take it or leave.",
            "Holy fuck fuck these guys",
            "Curious why OP didnt out the initial offer",
            "Negotiations are always a risk, it's very possible they had a close #2 candidate and were internally debating which one to offer. You just won the offer, but the negotiation posture may have allowed internal folk favoring the other candidate to push for their choice. \nYou did nothing wrong,  these things happen.",
            "They implied that you \"gave them a number\" earlier in the process. If that is true, it would be justified to be irritated, but the rest of the e-mail looks professional enough that a 180 is more than a little odd.",
            "All it was, was a power trip and an emotional attempt to hurt you. You can’t take it personally.",
            "What a disgusting amount of rounds of interviews and interview process lol",
            "is this for an internship???",
            "It isn’t an employee market, employers have plenty of choices so anyone who gives them any slight trouble have a good chance to be dropped, unfortunately.",
            "New fear unlocked",
            "Fuck them",
            "What did they offer",
            "Dodged a bullet, any time a ceo does this, it reflects poorly on everyone. Wouldn’t want to work for someone who’s that much of a petty person",
            "My suggestions... did you discuss with the recruiter first if there was any flexibility on their offer ? It’s better to discuss these topics first with the recruiter before making a formal counteroffer.. Also what was their offer and did they include stock ? If they felt like it was a very solid offer and then you raise them after asking questions about working hours ( it is a startup ) I wouldn’t be surprised that they passed .",
            "You just learned a lesson about business.",
            "This is what I’m always afraid of. People on Reddit be like just negotiate your offer.",
            "Makes me want to schedule interviews just to ghost them lmao",
            "What were the numbers? Your wording was good but sometimes if the numbers are so left field it’s possible",
            "What's the original TC?",
            "Wow whoever the CEO of this company is, good to know he's a fucking idiot.\n\nI kinda hope he sees this thread so he can see how many people will happily confirm for him that this kind of thing is immediate evidence that anyone working for your company would be working to enrich some full-of-himself Boomer fuckstick.\n\nPersonally I'd rather have a wheel for a leg.\n\nYou stuffed a job that would've sucked, OP. You didn't fuck up, you saved yourself.",
            "The market is definitely not as bad as media makes it out to be. That also being most of recruiters and HR being cut. Engineers are still cut but at the same time always will be in demand. Try financial companies. They often have big tech dept. and still hiring a lot.",
            "Sounds like you just asked for too much.  I dunno, definitely not worth crying about.",
            "Un-Fathom-able!",
            "What part of country are they located?",
            "what the actual fuck",
            "That's 10 rounds of interview. Unless you apply for a C-level position, this is way too excessive.",
            "Name and shame, OP",
            "Man, that's why I always have salary negotiations before we start the interview process.",
            "Good on you for naming and shaming them. These worthless dregs of corporate sludge do not deserve anything better.",
            "Which country?",
            "8% and they rescinded. Fuck them for wasting your time like that. There’s someone with a big ego at the end of their purse strings that you do NOT want to be working for.",
            "was there a signed offer? No signed offer means nothing has been rescinded, just that you didn't get an offer after negotiations. \n\nOffer means written & signed offer.",
            "THANK YOU FOR NAMING NAMES!\n\nWe can stop letting these people get away with crap like this.",
            "You dodged a bullet bro,",
            "Try coding yourself some bitches 🤣😭",
            "10 rounds and no negotiation? Yea fuck them",
            "It's always a possibility when negotiating. Had a former boss that would shut down the interview process if you dared question the compensation. We lost a couple of good candidates because of that.",
            "That is really, really strange. I think you dodged a bullet. If they feel insulted that you did the absolute standard and normal thing by trying to negotiate a slightly higher starting pay, then they probably wouldn't have paid you well over time.\n\nThat said, I could maybe see this if \\*you\\* had specified a salary earlier in the process and then later asked for more. In a way, that's going back on your own position/words. That wouldn't be kosher. But I imagine they put forth the salary range and then offered you a value in that range, and then you asked for 8% more. That's perfectly fine and IMHO standard.",
            "L company",
            "You dodged a huge bullet and gave people ample reason not to apply at Fathom Health.",
            "Unfortunately the market is only becoming more and more saturated with devs; allowing shitty companies to pull shit like this knowing they can find a “better fit”",
            "A typical work day is 10 to 7 in the evening?\nHow tf is that even considerable? I know job and money means a lot but mental fucking peace is a high priority to me.",
            "Dodged a bullet but your writing style is a bit weird. Just get straight to the point that you want to negotiate and don’t over explain things. They should already know why they want to hire you.",
            "8% is a lot and it’s your fault for being greedy and over valuing your skills.",
            "A tech talk!!? How long was it and what was the topic?",
            "Was the 8% consistent with initial range you provided or did you try hook them and then squeeze them?",
            "This is a toxic company. I call them founder centric companies. Decisions never make sense because the founder is a sensitive baby and everyone has to do what he/she says. It's insane.",
            "This tells me one thing — the founder is not a grounded and reasonable person.  You don’t want to work for someone like that.  No reasonable person pulls an offer just because the candidate negotiated.  It’s crazy.  At the most, they should have come back and said, “sorry, our offer was best and final and we can’t go higher, do you still want it?”",
            "its not outrageous. you asked for more and they said nevermind. thats the real world.",
            "Sounds like an awful company who the hell wants to work 10-7 😂. Also, why such the long interview process? They really strung you along. Clearly they didn’t value your time as an applicant.",
            "This company would have been absolute Hell to work for.",
            "Lol I feel like you wouldn't have had to censor the names and I still would have been able to guess what kind of name it was",
            "Health tech startups are a dime a dozen. Nothing really missed by getting the offer rescinded, other than discovering they are d-nozzles. Thanks for the heads up, I'll be sure to avoid them going forward.",
            "You’re getting a masters?! I’ll be like eff you, pay me! I read reviews that company and you’re better for going to a competitor.",
            "Thanks for naming the company",
            "Were you a new grad?",
            "Wow that’s insane, hopefully you find something way better!",
            "Id remove this post OP. They might come at you for defamation since the email can be traceable. Probably just summarize your conversation instead and call them out.",
            "Yep, def dodged a bullet,\nI had a better offer and discussed that during my first screen w recruiter during the final stages.\nI basically killed the recruiter round in such manner that she might have gotten wet hearing my answers.\nAs soon as I told my expected numbers, never heard back from them",
            "Fuck'em.\n\nTake the confidence booster from nailing the interview into the next one and nail it even harder.\n\nI'd say you dodged a major bullet.",
            "this is a massiiiiive red flag, name and shame if you can!\n\nEdit: u did name, am blind.",
            "Did you go into the interview process with a number beforehand? Ballpark number from recruiter?"
        ]
    },
    {
        "post_id": "t9o0ra",
        "author": "Capt_Doge",
        "title": "Just Pushed My First Changes To Discord!!",
        "url": "https://www.reddit.com/r/csMajors/comments/t9o0ra/just_pushed_my_first_changes_to_discord/",
        "score": 1635,
        "num_comments": 58,
        "created_utc": 1646765788.0,
        "selftext": "My manager just approved the changes I made to discord's codebase and integrated them this morning! I'm just an intern, so this was definitely a new and exciting experience. I'm proud that I've left my mark on the product!!",
        "permalink": "/r/csMajors/comments/t9o0ra/just_pushed_my_first_changes_to_discord/",
        "comments": [
            "I love these posts becasue immediately I now know that \n_____ app is currently down. They're like service announcements lol.",
            "Congrats! I'm interning at Spotify and my mentor just merged my changes too! 🥳",
            "csMajors is where I come if I want comedy",
            "nice post you got the up^(vote)",
            "I think this flew over a lotta heads lmao...",
            "WHERE ARE THE GCP SREs? WE NEED YOU",
            "We got a funny guy here",
            "[deleted]",
            "oh nonono",
            "Grind LeetCode",
            "Discord is currently down....this u?",
            "Bitch I forgot my login, you better log me back in",
            "Discord has interns?",
            "I mean who wouldn’t want to know how good of an on call engineer everyone in the company is right",
            "Congrats 🔥🔥",
            "WHY CANT I ADD MORE THAN 10 TO A GROUP CHAT?",
            "Can u give me free nitro? <3",
            "Is someone gonna make a post like this EVERY time any service is down? It’s basically copy & pasted every single time.",
            "So you’re the reason it was down?",
            "jokes on you, Discord didn't hire interns this season. they will next year though.",
            "Who's going to tell OP?",
            "Did your boss fire you yet? 🧐",
            "how are u interning at discord",
            "Congrats!!! Crazy feeling when your work has actually been merged and implemented",
            "My senior ass who hasn’t gotten a single internship just looking at all the success stories🥲",
            "What did you do! /u/Capt_Doge",
            "Discord has interns?",
            "."
        ]
    },
    {
        "post_id": "1axrj4r",
        "author": "queueareste",
        "title": "Don’t really care about FAANG, makes life much easier",
        "url": "https://i.redd.it/jjzr61a2i9kc1.jpeg",
        "score": 1628,
        "num_comments": 109,
        "created_utc": 1708662229.0,
        "selftext": "Still making ~$100k and the offer I accepted didn’t even have a technical interview. Now I just chill all day n enjoy the stuff I work on. Also helps to actually put time and effort into your applications and only apply to places you could actually see yourself working at. \n",
        "permalink": "/r/csMajors/comments/1axrj4r/dont_really_care_about_faang_makes_life_much/",
        "comments": [
            "https://preview.redd.it/o9jkb4nskckc1.png?width=498&format=pjpg&auto=webp&s=aa2f65c6183bd5462c9e03936bbcaa3bd47187c4",
            "bro please drop the 3 companies you applied to 🙌🏻",
            "What was the interview like?\nI work and study leetcode on the side but it’s going at a snails pace honestly.\n\nWould love to make a higher salary but those leetcode interviews\n\n-_-",
            ">\\~$100k and the offer I accepted didn’t even have a technical interview\n\nAs a recent grad? Tell me where you interviewed, you lucky motherfucker.",
            "gonna camp here",
            "There's no fucking way, i have applied to 25+ applications and all got rejected and the worst part is i don't know where to improve.",
            "How in the fuck.\n\nCongratulations!",
            ">Also helps to actually put time and effort into your applications \n\nLol and how did you do that?",
            "What companies?",
            "this is me as well. i applied to only 1 company and accepted their offer. i'm not trying to stress myself out for faang",
            "Drop the resume",
            "lucky, congrats! ",
            "How are these charts made ? Since they all look the same format I assume it’s the same thing everyone’s using",
            "I applied to Palo Alto Networks. If ur working there, could you tell them to let me in😝",
            "Same I don’t care about faang and got 9 offers",
            "I was kinda similar, ‘23 grad and accepted an offer after 17 applications. Definitely also far from the hundreds of applications a lot of people here submit. Congrats!",
            "Congratz",
            "Do you think people with hundreds of apps and no offers are all just applying to the same 5 companies 20 or 40 times?",
            "Does anyone know what is the tool used to render the image?",
            "Chunky sankey",
            "Sounds kinda sus ngl… what kind of tech position doesn’t have technical interview. But congrats regardless",
            "My personal bet is this is something like defence software eng. Even just limiting to citizens makes the world of difference in terms of the companies available talent pool.",
            "r/thathappened",
            "i hate you",
            "Same thing happened to me, but it was 2021.",
            "This chart looks so pretty!",
            "Congrats. Could you let us know about the timeline too?",
            "Please show me your resume 🙏",
            "edge strong tidy smile ripe shaggy overconfident violet advise frighten\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "This is the way.",
            "what companies did you apply to 🙏",
            "How to make a chart like this?",
            "Never have I ever felt more envious in my life",
            "Where can I do this funnel ?",
            "SHHHHHH! You asshole",
            "I have a friend who works for State Farm. Very easy and quick (30 minute) technical work. It’s just to make sure you make the right decisions on a very simple problem. Then face to face where they ask you behavioral and simple technical questions. Had a job offer (right out of college) within a month timeframe and 5 years later he’s making 130k.",
            "OP can you drop your Anonymous resume pls???   :)",
            "Sir can you send me your resume pleasw",
            "Congrats!!",
            "Well , I would say you should apply anywhere to get a few months of experience. After a few months you can start to choose. But what do I know? In Balkans 25k/ year is considered good pay.",
            "How is this even possible? I also don’t care about FAANG, applied to hundreds of internships and full time positions, and tailored my applications, reached out to people and asked questions. I also have a Fortune 500 internship I did last summer, and my resume has been checked over and over again by ATS systems. I’ve been applying constantly and I haven’t even heard anything back from most of them, other than automated rejections. It’s absolutely ridiculous how much luck plays a factor.",
            "How did you find said listing for the job? Surfing LinkedIn & zip recruiter or going to company sites you already had in mind?"
        ]
    },
    {
        "post_id": "18biu58",
        "author": "Appropriate_Cloud782",
        "title": "I want to sleep forever.",
        "url": "https://www.reddit.com/r/csMajors/comments/18biu58/i_want_to_sleep_forever/",
        "score": 1619,
        "num_comments": 161,
        "created_utc": 1701801379.0,
        "selftext": "I did everything right. I had the top school, the FAANG internships, and yet here I am with no return offer to Google and unable to get a job anywhere else. I'm submitting my application literally everywhere (almost 200 so far), and I've only gotten three OAs. Maybe I shot myself in the foot just returning to Google since I'm so rusty at interviewing now, but I really didn't think they would leave me without a full-time offer after two internships. I'm poor, and these two summers gave me more money than my family ever saw. I'm gutted that I passed hiring comittee but won't get an offer because of headcount. Recruiter said update by end of September, then October, then November, than \"no tangible timeline if/when you will get an offer\".\n\nSorry for the sad post, and I know I'm fortunate for having these internships in the first place. I'm just so burnt out, I feel sad, and hopeless and tired, I just want to sleep forever instead of waiting each day staring at my Gmail inbox hoping my recruiter might have an update for me.",
        "permalink": "/r/csMajors/comments/18biu58/i_want_to_sleep_forever/",
        "comments": [
            "I believe you’re less likely at the moment to hear back from anyone in the month of December since the vast majority of people burn all their PTO this month + you’re also applying during performance review time. Come January, you might hear back from more people as recruiters and HR start working through their backlog of applications. Keep your head up and don’t give up, job market in general is pretty rough right now. Took me about 3 months of applications before I even landed my current position and I have about 4 years of professional experience (and I would even say 3 months is incredibly fast). \n\nLook into getting some certifications as well, your chances of getting a reply back increase significantly if you can say you have an AWS cert. Best of luck.",
            "Return offer? I can’t even get an internship offer",
            "[deleted]",
            "I’m career switching to cs but if I’ve learned anything in my professional career, it’s that you can’t be cold applying. Especially not in this market in such an impacted field. \n\nGo to meetups/career fairs ask for coffee chats with alumns. Do whatever you can to NOT cold apply. Got my previous ft job at a unicorn that way and SWE internship at top tech company next year like that. Close to 300 apps, 7 finals, all from career fair, 1 from referral. Stop cold applying!",
            "I had to apply for over 700 companies to get my first job",
            "Damn bro google internship with no return offer that’s sad. Come join the McDonald’s crew. They are hiring",
            "hey, same position with another faang company. I lowered my salary expectations to half, and I’m getting interviews (but bombing a few bc I expected the return, so I started apps late and didn’t prep as hard as I could have). \nI got to final stage with a company paying under half of what I had (waiting for decision), but it is what it is and hopefully in the future the experience or networking done at Google will help land a job later!\n\nI’m actually also considering MS and return intern, but idk if that’s just delaying the pain of searching for a grad role haha",
            "Something ain’t adding up if you got a Google internship and can’t land a job. The market is bad no doubt, but jobs are still available.",
            "You dont need to work at FANNG just lower your standards a little, like wtf?????\n\nEdit: I say this as some one who tries to plan for the worst and hope for the best. I have never even considered working at FANNG because I know the people who even get interviewed are far beyond me.",
            "Post like this keep me working in my current job.",
            "Bro they didn't reject you they're just waiting on headcount. Like 70% of converting interns are in the same boat, just hang in there",
            "Things will turn around for you. Keep your head up.",
            "Lots of smaller companies aren't going to give you an offer because they know the second the economy improves and the big tech companies start hiring again, your as good as gone.",
            "Posts like this make people like me who have nowhere near these kinds of advantages also want to sleep forever",
            "Hey OP, I've been in a similar spot. You feel like you've done everything right, but then you're cursed for your own ability. It feels hella damming. While I know it's frustrating now, I'd try to maybe take on some of the suggestions other people are doing. Just keep at it and your head high friend. <3",
            "Been there.\n\nUsually you hear nothing for months and then all of the sudden companies are bidding for you because they hear you have an offer and vice versa. \n\nHang in there, its just how it is.",
            "I have a friend that was in this same position last year, he was even told altogether that he wasn’t gonna get anything from Google in March. In July, headcount freed up. They put him back in the system and his recruiter eventually got him a return offer in September. During this time, all his other applications finally started pulling through as well. \n\nThis is all to say, things can seem dire and you definitely can’t rely on Google, but don’t give up!!",
            "I was in the same shoe last year! (Graduated during  layoffs lol). I did end up getting a return 10 months later!  \n\nHeadcounts are not your fault. You have google on ur resume and have great career ahead - be optimistic! Go do a masters or build something yourself. Things will turn around.",
            "hey dont doom yet. there is still a lot of time. i got my google return offer last week and they are still rolling out offers! its slow but it isnt over until its over. definitely keep applying to other companies though :)",
            "I mean at lest you got 2 internship and 2 big fat payments, you're way better than most of the sub. This is normal, 200 application is nothing compared to other ppl who have 1k+.\n\nJust keep applying, keep practicing your interviews, build projects and just hang in there, you'll get through this, even if you don't land another FAANG gig.",
            "Hang in there buddy",
            "Only 200?",
            "Yall got FAANG internships?",
            "In the exact position but with a Finance career… top uk uni, two internships but different working conditions and environments cut the return offer. currently nothing now… even with two internships I haven’t even been given a first round",
            "Unfortunately your first job expectations need to change…. You likely won’t start your career at FAANG, so just change your expectations and your luck will change. Try small companies or startups",
            "I'm in the same position as you - interned at Google this summer, indefinitely waiting on FT return offer. Applied to ~120 places (high and mid tier), haven't heard back from a single tech company yet - ironically interviewed with 4 top tier trading firms. \n\nSeems to be a combination of yield protection from lower tier companies and a serious lack of new grad positions by high tier companies. \n\nI'm still hopeful for a Google RO during next Spring, but definitely can't rely on it.",
            "Look at startups, it's a good intermediary & you'll end up working a lot right now, but when you interview you can use that experience to talk about how you're a self-starter, ambitious, etc.",
            "If you have time to apply 200 times you are probably doing something wrong…..\n\nThe shotgun approach works  only for when the market is good.",
            "Welcome to life, you can make all the right choices and still lose. Sorry.",
            "[deleted]",
            "Send me your resume.",
            "Is Google opening new grad in January?",
            "Shitpost",
            "Better luck next time kid",
            "Maybe if you’re as smart as you think you are, you’d consider lowering your expectations for pay and company name. Imagine crying about not being able to get a job but only applying to the top 1% of job postings. You’re entitled",
            "Only 200 applications? Thats nothing little bro.",
            "I know how you feel. It will improve, tech isn't going anywhere and they need us to do the smart stuff they can't.",
            "oh jeez lmao I see what people were talking about now   \nGL man, I hope there's a reality where hard work pays off",
            "I want a job u/hiimresh",
            "What geographic area are you looking at? Also what salary range? I'm hiring in the near future in the Indianapolis or Newark areas",
            "I can definitely relate. No return offer to FAANG, highly unmotivated to do well in school, just want to sleep for 4 straight days and get a hard reset to my system.",
            "I had trouble getting a job out of college. I ended up taking a coding job in the non profit space. There’s also government coding jobs. The pay won’t be anywhere near faang level but it got me out of the junior job hunt hell",
            "Standard applications won’t get you anything at the moment. You NEED to network. It’s pretty much the only way to get anything right now. Go on your linkedin and ask around. Connect with people IRL. It’s rough but we’ll get through this.",
            "In the exact same boat bro🫠",
            "You will look back on these days and wonder why you put yourself through such anguish, keep your head up!! Be ruthless and persistent, your time is valuable and u mean business. The only application that I would ever rely on is one that I completed within 2 days of posting, otherwise u might as well have thrown ur resume into a well. Find out the recruiters emails through mutuals and email, email, email.",
            "I can understand your situation. I am waiting for return offer from Amazon. I feel the best thing to do right now is to calm down and evaluate all the scenarios. Even if you do get the return offer, what's the guarantee that it will stick? The best thing to do here is to start preparing and grab those offers.",
            "Been 2 yrs since I graduated now from a top 50 university. Given up on CS after hundreds of apps sent with 0 responses, starting my own business venues and am still improving on it. Already got money from it and hopefully I can scale it. I would say so far my current choices is a much better one then sticking with looking for CS jobs.",
            "[deleted]",
            "It’s just a cycle man, chill",
            "I'm so sorry there are a lot of insensitive replies, but it's likely because considering that you went to a top school and have a Google internship under your belt, you are in a better situation than others in terms of finding a job. You aren't the only one who is having a hard time right now. The money struggle absolutely has to suck, but I'll say I'm proud of you for making it out of that. You'll get through this, keep applying. The job market absolutely sucks. Burnout is real. Make sure that finding a job isn't what you're doing all day. Focus on hobbies as well. I did see someone else say that they are still rolling out offers, so I hope you get one! Good luck.",
            "Wait you had two internships at Google and can't even manage an interview at a no name company?\n\nEdit: To be helpful you should have a recruiter review your resume and make sure it has all the bells and whistles wanted in 2024, start applying now and January seems like a small uptrend in job openings.",
            "same bro. same",
            "Hey! I see there are already a LOT of comments here, but just wanted to give you my say about this. Currently we’re in a tech crisis, and there are definitely not a lot of jobs in tech on the market right now. There were a bunch of layoffs at massive US companies last year, so the market is saturated with a bunch of highly skilled engineers. I’ve been looking for a job over the past year or so, and finally got one after 100s of applications and about 10 interview processes. Don’t beat yourself up about it, the market is slowly getting better again, but right now is definitely a bad time.",
            "200?? That’s rookie numbers. Didn’t you see the guy that did 2k or something? Just keep on going",
            "you seem to be smart and have a good profile. wait till spring but even if you don't get anything, I doubt you'll have to wait more than about a year before you get a good position anywhere else. it genuinely seems like a rough patch for the job market right now, it sucks and it may even get worse before it gets better but...it will get better.",
            "In the same situation as you, I got an inclined decision after the Amazon internship but received no offer. At this point I don't believe they will give an offer. I apply for about 2 hours each day scanning through career sites of top 100 companies and LinkedIn jobs. I didn't even receive a single interview.I am graduating in a month, Its just bad times",
            "Please take care of your mental health",
            "How long was the internship?",
            "It's slow rn due to the holidays. More apps should improve in Jan/Feb next year. With 2x google you have already have a huge advantage to other applicants. I wouldn't start worrying unless you get to May with no offer.",
            "On average it takes like 3 to 6 months to find a job out of college. You’ve made it this far so you can do it. Things will speed up after the holidays and make sure you do take care of yourself. Do get plenty of sleep.",
            "Me from tier 2 college with a peanuts job and no life only work balance 💀",
            "The next few years are going to be hard but you have an advantage over other people. You know what it feels like to be poor and you've survived.   \n\n\nDo what you need to do to earn income to keep yourself alive until your wave comes. And it will come. Maybe not in the way you hoped but the economy doesn't care what we want.  \n\n\nStay on track you'll get there. Just breathe.",
            "why you people dont get offerts after internship, what is the issue? Maybe this is the new thing for todays age",
            "Hmu (FB). I see plenty of IC3 product generalists roles are looking to be filled.",
            "You'll get there eventually hun.\n\nPerhaps make some side projects? You gotta sell yourself in this field, sadly.\n\nYou'll do great. Don't lose hope!",
            "I was in a similar position last year but different company. I know it’s tough but just keep grinding and have hope because that’s all you can do. I was so stressed, the holidays were just a blur and then I ended up getting an offer in February so you honestly never know!!",
            "If you want to take a more direct approach to networking with people who work at FAANG, this is the best time to start following other people using Threads app from Meta. \n\nSearch using the hashtag “Tech Threads” and you will find many people who work at FAANG. Follow them on threads, comment on their posts, slowly build a relationship online for a few weeks. This is the new LinkedIn. Your goal is to have them “discover” you.",
            "First off, just take a second to realize that you’re not a failure for something like this. The job market isn’t in the best spot right now and things like this are largely out of your control. \n\nFocus on trying to network, specifically with recruiters. cold applying almost never works and is a highly luck dependent. You’ll land something, just don’t get down on yourself and have some resilience.\n\nInterviews are hard and I saw you mention that you bombed a few, that’s totally fine! Just learn from those failures and be better prepared for the next ones!",
            "Learn to weld"
        ]
    },
    {
        "post_id": "182bbag",
        "author": "duggedanddrowsy",
        "title": "My job search as a 2023 CS grad",
        "url": "https://i.redd.it/ymn9l3l6062c1.jpg",
        "score": 1615,
        "num_comments": 71,
        "created_utc": 1700774630.0,
        "selftext": "My job search this year (last October to this October), most of these applications were between January and July of this year. \n\nApplied to mostly mid-small size companies in Kansas City, St. Louis, NYC, Chicago, and California. \n\nJob titles including junior/associate software developer, junior/associate data scientist, a few teaching positions, and control systems engineer positions. A control systems position is the one I landed which is sweet because robots. \n\nI found the jobs pretty much exclusively through LinkedIn and Indeed, maybe 25ish were through looking directly for the company website or through my school’s job board. \n\nI got the data by going back through my email, indeed, and LinkedIn accounts. \n\nI only counted each company once, so there’s probably another 25-50 jobs I was rejected/got no reply from that aren’t reflected here, but all my interviews and coding assessments are accurate.",
        "permalink": "/r/csMajors/comments/182bbag/my_job_search_as_a_2023_cs_grad/",
        "comments": [
            "I also applied to just under 300 for internships. Had about ~10 companies interview, idk how many OAs and tests, but got like ~6 offers (all Bank level companies or worse). Congrats on getting your offer, your hard work paid off!",
            "I forgot to mention and can’t seem to edit the post, I never had an internship.",
            "What’s everyone’s cv looking like to do 1:300",
            "Bachelors or associates? Also how many of these were remotes vs in person?",
            "Kinda looks like my tinder tree",
            "Congrats dude. I'm kinda in the same boat as you, but with about 500 applications lol. Got about 10 interviews  and only one offer so far. However, since this is a gov job in national security, the background check is taking forever, so I'm considering going back to school for my Master's degree. I have another interview coming up next month, and hopefully get an offer before the grad program starts.\n\nMy background: BS in Comp Sci with no prior experience/internship.\n\nMay I ask what were the questions asked during your interview?",
            "Wow, look at that, all OAs lead to rejection. Who would have thought",
            "How much effort do people typically put in per application if you're putting in that many applications?\n\nI mean tailoring your resume for each individual job description , adding customized cover letters based on company, reaching out to recruiters for coffee chats etc, researching current employees or hiring managers and to to discover similar events interests etc that can be brought up in the interview\n\n(The last one is too much ik)",
            "I think we were in the same class. Congratulations!",
            "I see so many similar charts and find the ratio insane, are you using recruiters?      \n\nI recently got a new job through a recruiter, who lined up 13 interviews within a week, and was accepted to 7 of those. I have 3YOE and no degree.     \nI’m not in the states, but it’s interesting how the market can be so obscenely different in a field where we can work from anywhere in the world.",
            "Did you job hop? Or were to unemployed until now?",
            "As a final year CS grad student for which role should I look for? Full Time roles or just internships with PPO?",
            "\"No one wants to work anymore\"",
            "I’m going to college for CS in 2 years am I screwed or very screwed",
            "The hell is Coding/Personality test?\n\nYou have MBTI along with FizzBuzz?",
            "GPT eating all the offers it seems.",
            "Better than mine 5 years ago",
            "Very nice. Impressive. Let's see Paul Allen's job search.",
            "where did you made this?",
            "Cancel LinkedIn. That shit is just twitter for boomers",
            "Lucky man/woman. One offer. One acceptance",
            "How did you make this graph? Congrats on job!",
            "Well… at least it looks like the majority of jobs who had any contact with you actually gave you a rejection notice",
            "Congrats brother. Guess I’ll have a job in a year :D",
            "If you don't mind me asking what type of stuff were you asked to do during your technical assessments?"
        ]
    },
    {
        "post_id": "1bwz85f",
        "author": "Independent-Win-4187",
        "title": "Just gonna leave this here",
        "url": "https://i.redd.it/764hzux9irsc1.jpeg",
        "score": 1608,
        "num_comments": 339,
        "created_utc": 1712367009.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bwz85f/just_gonna_leave_this_here/",
        "comments": [
            "Please excuse my lack of knowledge but I'm genuinely curious why is aerospace engineering on there??",
            "physics deserves better 😭 my favorite subject. sometimes I watch physics lectures for fun.",
            "I don’t see us",
            "From the same source, CS has a 4.3% unemployment rate and a 16.7% underemployment rate (that's really good!!)",
            "TL;DR Everyone but medical school is f-ed.",
            "Are Physics majors considered underemployed when working in tech jobs? There's physics majors who are SWE and may or may not use their physics knowledge.\n\nSame thing with the liberal arts... Are you underemployed if you work as a manager or as a teacher or as police or as a military officer?",
            "I'm surprised political science isn't on there.",
            "Someone posts something positive for once and people here goes \"We'rE nuMbeR 11 FoR sUrE\" \n\nLike, at that point you should see a psychiatrist and get checked for anxiety or something",
            "How about nursing , I bet best employed ?",
            "Computer Science is at 4.3% in this data. Here’s the source: https://www.newyorkfed.org/research/college-labor-market#--:explore:outcomes-by-major",
            "It’s kinda sad that those arts majors don’t get appreciated enough. Without the arts we would just be a depressing capitalist machine",
            "well stem still better performing than anyone else!",
            "Damn why is aerospace doing high? I thought that was a major that gives a good job after graduation. So many defense companies you can go to for example. I was thinking of doing aerospace if not CS, and even thought of switching to it.",
            "The engineers, data scientists, and UX designers tasked with updating this schematic were laid off.",
            "Physics and Aerospace engineering shouldn't be here. Coz those are the fields where just a bachelor's won't cut it.\n\nMasters is a minimum and for Physics PhD is a minimum",
            "Expectations are different, Liberal Arts students know they are not going to get a job with that degree, so they are content.\n\nEdit: typo",
            "I am surprised that business is never an unemployment degree in the US. It is the opposite in Europe...",
            "Can we just appreciate the design of the graph",
            "It's cause people here think that not being a SWE = being underemployed lmfao They think doing adjacent tech jobs is \"not prestigious\" enough. CS isn't just SWE and that will always be the reality, the underemployment and employment rates will remain low because there's tons of jobs that aren't just working on the latest tech stack and programming apps.",
            "This is one stat im glad were not in the top few",
            "I believe that unemployment affects non-citizens more than citizens, and some courses may not provide practical skills.",
            "Apart from 2 streams everything in India is not even considered money making. And kids here will be knocked on their heads if they do not understand that. I don't know what you do in the US though. \n\n1) Physics\n2) Aerospace engineering. \n\nThe only ones that can give you a sustainable lifestyle.",
            "Physics majors surprise me but I imagine some of that is how competitive their field is. A physics major is very well suited for software engineering, data science, or just about any business job.",
            "Physics and Aerospace Engineering are very surprising to me. Especially when considering the amount of jobs available in the public sector and usefulness of STEM majors in general.",
            "Thank you. We need more things like this to keep us going. Turn the narrative around in our heads, doesn’t matter how real it is. The negativity on here can be suffocating.",
            "Art history is like a ponzi scheme. Only way to make money is to become a professor and convince undergrads to follow the same path",
            "Computer science is listed at a 4.3% unemployment rate. We are doing worse than philosophy, leisure & hospitality, special education, marketing, and criminal justice just to name a few.",
            "Computer Science will soon be on the list with the way things are going.",
            "hmm i wonder why, maybe because they're useless degrees meant to money farm mentally ill people. Useful Degree = Low unemployment rate. simple really",
            "[deleted]",
            "What is the difference between Liberal Arts and Fine Arts ?   \nWe don't have these majors in my country so I am asking.",
            "This post isn’t gonna be a circlejerk at all",
            "Do you happen to have a link for mobile?",
            "Where is cs??",
            "Me double majoring in religion and history, as a pre-med 😭",
            "why is aerospace engineering there?",
            "History major, make 6 figures. Haven't been unemployed since I was a teenager.",
            "How many Aerospace Majors are in here? Why are all of the other majors generic while Aero space is very specific? I wouldn't trust this chart it's also missing a few other majors like accounting. Most people know folks in the CS field would be more in demand than a few other majors but this was a poor attempt.",
            "Ummm wouldn't underemployment and unemployment be the same things, just a contextual difference lack of work is still lack of work it doesn't matter how you allocate or dress up the numbers",
            "It says the rates are for recent graduates, those 22-27 with a degree or higher, but are there specifics on how long is considered recent?",
            "I can't believe it",
            "I’ve known a physics PHD from Yale and yep even he was underemployed. Pretty much worked as a tutor for rich kids.",
            "How can this graph be that misleading.",
            "What's the content of an \"English Language\" degree in the US? \n\nIs it like the UK English Language and Linguistics degree, covering modules such as child language acquisition, psycholinguistics, sociolinguistics, World Englishes, TESOL, phonetics phonology and grammar? \n\nOr English Literatures? Poems, novels, and other weird shit?",
            "Also pictured: the degrees people on r/antiwork decide to get while bitching about student loans and not making enough money",
            "It makes you think that society doesn't care about arts, culture and collective- and self-reflection.",
            "Sociology can be an impressively quantitative major if you take the right courses. I've seen people do some very impressive stuff with bachelor's degrees in sociology. Shame it has such high underemployment.",
            "Speed that up in a few decades and I'm sure you'll see a lot of inverse patterns.",
            "I have fine art, graphic design, and programming, - so I’m actually 60% _over_ employed. I also know some English.",
            "Me, going for cs and graphic design, feeling screwed",
            "Bachelor of Fine Arts & Graphic Design major. In nearly 30 years, I’ve been unemployed for about 6 months total. I’m sure that acquiring front and back end dev skills played a factor in that.\n\nLet me assure you that many with a GD degree went into it with no skills and got their degree from a school that did not require a portfolio review. Now they can’t find work because they don’t have the chops. \n\nCan’t speak for the other professions, but in my experience, there has always been a dearth of quality graphic designers.",
            "CS should be there too. ",
            "I had to offset my History undergrad degree with an MBA.",
            "STEM is always relevant. \n\nExcept you, space engineers.",
            "With AI, these will be the hottest jobs in the future",
            "We’re #11",
            "As a dev and bootcamp grad with a liberal arts degree I can agree that degree is junk.",
            "I have an art history degree and it has helped me get every job since.  People simply lack creativity and the ability to sell their skills.  Now I have a cs degree and people keep asking me what I’m going to do with it - I thought that was low hanging fruit…  I do know a few physic phds that have a hard time finding work, they are too specialized it seems",
            "I feel like even the average unemployment rate is misleading. \n3.5% might sound pretty good. But this likely covers a lot of people who spent $150K on a college degree only to be working at Starbucks or some genetic clerk job they could have done without the degree.",
            "College isn’t about money. I repeat, college isn’t about money. \n\nLiberal arts PM checking in. Critical thinking comes from diverse views",
            "Not sure why people study arts",
            "Stop using bs sites that no one heard about to get such info, this is completely inaccurate if you actually used real sources.\n\nPhysics? The average 2nd highest IQ major?",
            "That high rate for aero engineering is still very high. Notice it’s the only engineering listed. That’s because it’s a trash industry filled with sophist losers.",
            "Genuine question ... If 60% of a particular group is 'underemployed' at what point do you accept that they are employed at the expected level?",
            "Why is CS not on there",
            "Yep. Tech is not always steady, but that’s why you build an emergency fund."
        ]
    },
    {
        "post_id": "1az6957",
        "author": "Forward_Opinion6038",
        "title": "Everybody jumping on the cs bandwagon",
        "url": "https://i.redd.it/450g27x4slkc1.jpeg",
        "score": 1594,
        "num_comments": 374,
        "created_utc": 1708810900.0,
        "selftext": "Random I saw on LI, saying how he graduated with a 4 year degree to go to med school but took a bootcamp and now is else searching for work. ",
        "permalink": "/r/csMajors/comments/1az6957/everybody_jumping_on_the_cs_bandwagon/",
        "comments": [
            "Unfortunately he's competing with people with a four year CS education and at least one internship. Good luck!",
            "[deleted]",
            "Lmao imagine leaving med school to do a boot camp \n\nJesus Christ",
            "Dude did chemistry at UCLA. Then did App Academy and now doing online Masters in CS at JHU. Feel bad for him that he is doing JHU while he could do GaTech with 1/3 of the tuition.",
            "This is kind of sad on the outside. If they really fell for the “boot camp” trap. But I honestly suspect some other things at play here. Medical school is incredibly tough. It’s not uncommon to drop out. This person just seems like they are using the fact that they wanted this as a cover. But regardless I’m not sure.",
            "Bro 4 real, you left medical school and join a codeboot camp?",
            "Number of people calling themselves software engineers without even knowing the most basic things about computer architecture or system design is shocking. Can I call myself a mathematician after learning how to do addition, or a chemist after knowing H2O is water?",
            "Damn, some people really lack decision making capabilities.",
            "sOfTwArE eNgInEeR\n\nImagine someone taking a physics class and calling themselves a mechanical engineer",
            "Leaving MED school for CS is probably one of the dumbest decisions you can make in life…",
            "This person is either in a shit-ton of debt or blew a shit-ton of money and they probably won't get a decent paying job anytime soon.",
            "It’s hilarious these people go to 1 bootcamp and they put all these technologies in their profile. There’s just no way you have any depth knowledge of Python, Java, and JavaScript after a little bootcamp. It’s like they don’t think or something before putting it on their profile header lol…",
            "Oh my god leaving med school for a bootcamp Jesus christ",
            "My guy or girl made a big mistake. Completing medical school would yield way better ROI and job security than swe ",
            "Eeeeh, don't worry. I'm nearing a decade of IT experience and I'm quitting to live off the land somewhere in the wilds so at least a single spot will open up.",
            "Imagine applying to jobs and the only relevant experience is a fucking bootcamp",
            "I thought this was the case 7 years ago when i graduated, i guess we reached a peak in 2022, but the state of market+ AI means were going downhill",
            "That these people get hired means something is fundamentally wrong in this industry. This means that the skillset of a bootcamper is practically indistinguishable from those with 4-year degrees. This means that it is a low-skilled job just like manual labor in the blue-collar field. There will be no reason coders get highly paid. I expect the salary to go downhill infinitely if this trend continues.",
            "Cooked",
            "App academy 😂",
            "Lmfao he isn't gonna find shit, nothing to worry about",
            "Another day, another regarded person falling for the bootcamp scam",
            "This is horrible, scammy behavior praying on someone who is looking for a new career. And Jesus this guy wasted 4 years to compete with people a 4 year degree in CS. He is beyond cooked, and just to say that he mastered all those skills in 6 months after paying 20k. Yeah no",
            "The worst decision of his life",
            "Leaving medicine for a coding bootcamp is crazy, All I can say is good luck to her",
            "lol it’s like someone jumping on the titanic halfway downed because it’s a Luxury cruise and tons of rooms are opening up as we speak!",
            "It's sad to see but people do need to get out of CS, it's part of why people aren't getting jobs.  \nCompanies have been overhiring by 200% and they're now making it hard/almost impossible while laying off people.  \nThe positive is that it will get rid of most of the kids who thinks it's a \"easy life style with 6 figures\" out of the market  \nBut the negative is that it will also get rid of the motivated people who actually care about this job such as you and me.\n\nVery unfortunate but this is reality I guess.",
            "I dropped out of nursing school to switch to CS. Honestly I am way happier, the overall experience of nursing is miserable and I hated every shift. Legit on my way to work I would consider driving into oncoming traffic just so I didn’t have to deal with the stupid shit people give you as a nurse. (I was an LVN and getting my BSN) \n\nI don’t know what CS holds for me, I’m a second year atm so I have a ways to go. Hopefully the market gets a little better by the time I’m graduating, but if not I still don’t think I’d regret my decision at all.",
            "You can almost hear his interview pitch being “I left medical school for this”",
            "Lol why does this field have absolutely zero standard in hiring? No wonder nobody respects tech workers. We are living in a society that values zero hard work, so every single body goes for easy money. ",
            "So he gave up medical school to learn a skill for which he now has to LOOK for a job?",
            "cs is becoming extremely competitive. The entry bar is much higher than what it used to be a few years ago coupled with AI nobody can make any predictions if ANYBODY's jobs are safe. I wonder what the job market in 5yrs will look likr",
            "People. Don't call yourselves software engineers or computer scientists after a couple of bootcamps. \n\nDo you know how computer architecture works? Do you know how OS works? Can you differentiate between different types of RAM? Do you even know what's at the very core of a computer? Heck, I doubt you even know how assembly language works or how it is translated into machine code.\n\nIf not, don't jump into this pit. It's very hard to get out.",
            "This thread is giving off r/medicalschool vibes",
            "I used to D ride CS a lot especially as a medical student but now with the market medicine looks so attractive.",
            "Linked in lunatic. What a chump",
            "Honestly, this current climate in tech needs to stay for a couple of years like 5 or so years. We need total demoralization because it's clear there are still a lot of people who are delusional and think a boot camp is enough to break into a highly competitive field.",
            "This sub is such trash lol. It’s just a bunch of CS students unable to be happy for other people because y’all spent more time and money to get the same fucking job. \n\nSad bunch you all are.",
            "Okay I will say I worked with some really good software engineers from App Academy, but they graduated almost a decade ago",
            "This is batshit crazy",
            "This is why I plan on going for jobs that require a graduate degree.",
            "So for someone joining the computer science band wagon, what is the right path to take? Just pursue the 4 year degree and skip the boot camp?",
            "Keep looking when even people with 10+ years of experience don’t get any replies these days 😂",
            "That’s what he gets for doing a bootcamp",
            "App academy?\n\nCompanies prefer hiring people with a bachelor’s degree over these bootcamps",
            "Well, you'll be #lookingforwork for quite a while.",
            "Cs degrees are just as useless without real work experience",
            "Im sorry… when the fuck did a bootcamp give people the title of engineer? Is this a fucking joke?",
            "I know someone who is an engineering manager and only has a GED.",
            "idk if its just me, but I really wouldn't consider any bootcamp graduates to pose a major obstacle to CS graduates. Considering a CS major upholds a good GPA, has some projects and internship experience, they are leagues above someone who completed a bootcamp over the a fraction of the time. And more employers are realizing this, too.\n\nJust my opinion, though, correct me if I'm wrong.",
            "LinkedIn post like this is cringe. He talked like no one else goes through struggle",
            "They’re not gonna get hired lmao",
            "His biggest failure was leaving medical field with which he had double more chanse to land a job compared with this dead market",
            "I love the implication that all software jobs are either full stack, back end, or front end.",
            "If they get a job as a SWE, that is so insulting to those of us who worked our asses off for CS degrees. That’s like a social studies major taking a 12 week course on human biology and applying to become a doctor. Hope they get rejected from every tech company 🙂",
            "Bro’s gonna go back to med school once he sees the job market for CS",
            "I’m not in CS. I code as a hobby, and to automate tasks for work. but holy shit you guys are kind of mean. Granted this is the first post Reddit recommended to me. I guess the market is over saturated",
            "We are all sinking.",
            "The same shit here in Canada. Get a 6/12 month diploma and then internships - certifications. \n\nAnd these same guys scream, \"My passion is programming.\" Fuck off with that.\n\nCS as a field is done.",
            "Couldn't hack it in med school? Makes sense he'd think he can become an SWE after only 24 weeks 💀",
            "Ok?",
            "There really needs to be tougher interviews for bootcamp grads to help control this over saturation in the field due to career switchers.\n\nThey should be much tougher, because why tf should a bootcamp grad take jobs away from CS grads who put in 4-6 years of hard work for the same job. Idk if this is a thing but it definitely needs to be.",
            "I feel like most Americans must be taught that a job is a job. This is what most Indians are taught. We do jobs because we want money not because we necessarily like it. I mean you should be competent in your job but it doesn't mean like you should like it. \n\nAnyway how does this logic even work for majority of roles. I can't believe majority of accountants love their jobs or people who work in Walmart or one of those random white collar jobs where you play around with excel sheets etc . \n\nThe very fact that his parents and friends didn't prevent him from doing this mistake is a bigger issue I say",
            "Imagine that.  A human pivoting trying to find themselves and what they love.",
            "CS is cooked",
            "I looked this fool up. He didn’t even go to med school. He graduated with a BS in Chem last year.",
            "I graduated from App Academy, and there are > 100 of us working at Google (probably many more, but that’s the amount in our internal Google group). It’s no joke, as much as you may want it to be. It’s honestly one of the best decisions I ever made, and I’m glad I didn’t go back for a second bachelor's in CS.",
            "The elitism here is shocking. \n\nThey have a four year degree. That is enough signaling that you can stick with hard things. \n\nNow they pivot to SWE. And it’s not that people dont learn stuff in bootcamps. If its worth it vs self study i dont know as i dont know the bootcamp and its pricetag. \n\nThey will have to compete with CS grads but especially at co’s that make medical software their background might even be beneficial. \n\nThere are a lot of things in a job that are new also to CS grads. \n\nNobody is special. All power to them that they follow their intuition and have the courage to try a new path.\n\nJesus people.",
            "I know a few doctors and JDs who left to do CS.",
            "Ain’t no way bruh 💀",
            "My cousin who is in UK did the same thing and  left his med degree. He was already practicing programming on the side and he mentioned that there are institutions dedicated to help people from other disciplines get into CS jobs. He mentioned they had certain positions reserved for this sort of thing though of course you would have to compete with other people from non cs fields for the limited positions. Anyways he managed to and will start working soon.\nHe only told his parents that he has left med school after he got his first CS job",
            "While bootcamps and shorter studies in computer science can definitely create some decent developers with potential to become good.\n\nThey are neither CS Majors nor Engineers.\n\nCS Major? Bachelor, then a Major in Computer science, meaning you’ll have a cand. Scient.\n\nEngineer? Takes as long as a Major and requires studying and you’ll end up with a cand. Polyt.\n\nThere’s room for all of them, but getting the degrees you’ll typically be at very different levels.",
            "Well another competition!",
            "I gave up a med school admission to take a job at Facebook. I still don't know if I made the right decision 😞.",
            "Welcome aboard.\nThe struggle is just about to begin 😁",
            "Not really related but people think Cs is harder. But no. I am taking chemistry courses as a Cs major for fun (including from second year to third year) it’s not red easiler than Cs and some of them is harder (like physical chemistry)",
            "You're not some OG cause you decided to get a cs degree 4 years ago. ",
            "From what I've been seeing lately, OP sounds like bullshit/hype. I feel so sorry for those just starting now. Early 80s I went for a BS in CS (from a college of engineering) and could choose between multiple\n offers with a semester still to go. Company I went with (now long gone) offered to pay for many extended learning opportunities (e.g. certificates, masters degrees, and beyond). Worked my way into systems engineering and systems architecture and retired early after doing what I loved for 30 years. With the way things sound today, if I had to choose a career path over again, I seriously question if I would choose CS again.",
            "Engineer lol",
            "A long struggle ahead... Try to catch up with fellow cs students on project with basic concepts...",
            "damn, big oof.",
            "People think that getting a degree or a certificate will guarantee a job in the field. I don’t think it ever was like this, for any major. The degree is the baseline and you need to go above the baseline to compete with others.",
            "Glad I quit CS last year when I still had time and money. Maybe I’ll be on the wrong side of history for thinking it’s over-saturated but then again I am a degenerate gambler.",
            "I graduated from app academy but got a job during 2021. I do not think doing so now would be a good idea.",
            "Medicine is quite literally the best career you could be in, why in earth would you switch?",
            "It’s been like this for a while now- all of my friend group INDIVIDUALLY talked to me about transitioning into tech from healthcare, law, retail, marketing, etc etc. It wasn’t anything coordinated but they talked about it to me. I’m not sure how they’ll compete with people that have actual degrees and experience if even we struggle. It’s pretty scary to see because “normal” people know about and have been grinding leetcode so not only is entry more saturated, it’ll also be harder and the bar will be raised. Leetcode used to be something less known and only for higher achievers, but now we got millions of people doing it. I know because my old coworker at Walmart asked if I study that.\n\nFuture looks pretty bleak for most of us lol",
            "This person is crazy, leaving medical school to compete with another 100 million third world coding monkeys.\n\nPoeple make bad decisions, me too.",
            "You can get a degree In counter strike? Has this always been a thing?"
        ]
    },
    {
        "post_id": "14q8wqo",
        "author": "luckyfaangkid",
        "title": "To those who say HCOL salaries aren’t a lot because everything’s expensive: my first year in downtown Seattle as a new grad SDE",
        "url": "https://i.redd.it/edjerx74pw9b1.jpg",
        "score": 1580,
        "num_comments": 704,
        "created_utc": 1688458201.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/14q8wqo/to_those_who_say_hcol_salaries_arent_a_lot/",
        "comments": [
            "If you have double the income and double the expenses you can save twice as much money.",
            "only 22k tax on 119.5 net income? also the rent looks very cheap and the med/dental is kinda weird",
            "You spent $1000 on groceries for the entire year?",
            "bruh 170k as a new grad wtf",
            "Can you tell us a little more about your background/where you went to school and your age?",
            "Im LCOL in canada and your savings eclipse mine so much. I started around 63k, im at 78k and soon will get 92k as i should get senior.. thats with 2.5 YOE. I saved 25k last year and thats pretty exceptional i think, my mortgage is ultra low too since i bought my house 10 years ago and renegociated it.\n\nNow if only i could get a US salary while staying in canada.. thatd be great lol.",
            "Would love more posts like this",
            "I'll save this to post whenever someone is /r/cscareerquestionseu trying to cope saying that it is much better to make €70k in Amsterdam than $300k in San Francisco",
            "My experience is that in HCOL areas, the rent is the only part that is way more expensive. You have the capability to spend a lot more money if you want, but you can also just buy groceries at the local flavor of Kroger and it'll cost about the same.",
            "What software do you use to make this graph?",
            "bruh, american salaries are really something else\n\nhere in Europe you're happy if you manage to put 2000€ aside as a new grad",
            "This is such a pleasing visualization",
            "Dining/groceries and entertainment are pretty low for Seattle.  Any tips on how your keeping those down?",
            "Is this for 2 years? I see 401k for ‘22 and ‘23",
            "This post is my copium. Thanks bossman",
            "There aren’t whole lot of other places where you can save 95k a year as a new grad.",
            "Lemme guess, Seattle WA cause no state tax? Great job regardless! if it’s Seattle that’s what I’m trying to do. Love the NW and the no tax",
            "[deleted]",
            "Doesn’t make sense to show two full calendar years of 401(k) and HSA contributions. It should just show the max possible in a calendar year \n\nI also don’t see any employee contributions for medical and dental coverage / other benefits in a pretax basis. Does your employer give you all that coverage for free?",
            "Damne here i am as a new grad making 80k feeling hella inadequate",
            "I love the chart. Very interesting. Just wondering tho…\n\n$100 on medicine? So no health insurance? Not like paying for that would take away from the point you’re making with this post, but just thinking about how one healthcare incident could wipe out your annual savings.",
            "9k for groceries and dinning or should I say\n\n#8000 for takeout and eating out\n\n1k for frozen pizzaz... how tf do you only spend a grand on groceries do you just not know how to cook?",
            "How are your taxes only $22k?",
            "Hope you’re married or did back-door otherwise you over contributed your ROTH IRA.",
            "Been there done that, here’s the flip side, since you are an Indian you will hit a wall when it comes to H1B, green cards for Indians is decades and way too much uncertainty. So you have a clear pathway of a few years to make this money. I personally moved back from California to Pune and make about $250k while living in India and the dollar goes much further here.\n\nDepending on how you see your life panning out and at the mercy of US immigration, cash in while you can and move out. $170k aint worth the uncertainty in life :) good luck!",
            "From your cost breakdown, so\nE would say your living a spartan lifestyle. Btw hood job with the 401k. Hoping my son jumps on that bandwagon when he gets done with uni",
            "[deleted]",
            "OP, Can I dm you? Recently joined AMZN as new grad and had a few questions related to 401K and HSA.",
            "Wow you make almost as much as me and I have 25 years experience. I am fully remote though.",
            "What the hell only 22k in taxes?!?!\n\nI make 145k and I pay 38 k in taxes.\n\nJust federal income taxes and FICA I pay 31k.",
            "Washington’s lack of state tax is a very understated benefit. You would lose another $13,500 if this was California (though I wonder if Amazon adjusts with that in mind). \n\nSmall thing, but is the 401(k) pre-tax or after tax? If it’s pre-tax, then an estimated tax amount should go towards expenses instead of savings.\n\nLet us also not forget the stock. You didn’t include the stock here (probably because of the horse crap 5%/15%/40%/40% vesting schedule), but it is another part of the story that vests as passive income if you stay. What is that amount? Like another $40k? If you somehow saved $0 and just had the stock, that’s already still better than the median Americans’ retirement savings by their late 30s.",
            "One thing people overlook about expensive places to live is only local resources (housing, labor etc) cost significantly more. Groceries are about the same, cars, clothes etc anywhere in the US. Flights are often cheaper. For a high income earner western WA is great since there's no income tax.",
            "Looking at the exact same for next year but living in a single so paying 2500/month instead. Glad to know it won't be that hard to save",
            "Do you guys not cook in USA? Why does everyone eat out? Asking genuinely don't mean any offense. \n\nEDIT: Comment seemed confrontational.",
            "People on leddit have no idea how to manage money, of course they say dumb shit like that",
            "Congratulations on your role brother! I saw you are international too, so was curious if I could PM you with a few questions about your experience as a non-American in US SWE. Would be so so appreciated!!!\n\nFellow international kid here :) a CS junior in Cornell atm",
            "You save more as a new grad than my gross earnings after 10 YoE in low COL. Hell your one-year gross is more than 2 years of my gross. You must be one hell of a developer.",
            "How do you track your spending in a nice graph like this? Is it a tool that integrates with your bank account or do you manually input a csv or similar?",
            "You son of a bitch. And here I am in the UK on poverty wages",
            "[deleted]",
            "Sorry, what type of graph is this? I always see them but here but can never remember",
            "Off topic : How did you record these expenses? Do you manually enter every expense everytime you purchase something?\n(I am looking to track my expenses )",
            "[deleted]",
            "1000 on groceries tf?",
            "What’s this type of graph called?",
            "How do you spend more on Ubers than on groceries?",
            "Yeah it’s just some copey bullshit LCOL use to justify their worse jobs. People in LCOL can make a lot too, you just gotta be remote or work at a satellite office of major tech co.",
            "That is a very good rent price for Seattle. Under 2k per month.",
            "[deleted]",
            "Dang dude what happened to your teeth this year?!?",
            "Somehow I earn more than you but I save significantly less money, no state taxes in WA makes a big difference. That and your rent is pretty cheap.",
            "I had about the same breakdown but higher rent because SV is expensive and I made a little bit more. People say it impossible to live cheap in HCOL cities but you just need to be smart to make it work No kids or dependents helps too",
            "Don't you make too much to have a 2023 Roth IRA?",
            "Woah okay nice! I’m getting paid the same as you and I never buy anything (apt is almost as bare as day 1), but somehow I’ve only saved like 40-50k in Arlington VA. Maybe it’s the tax…I’ve got to look at where all my money went lol",
            "How’d you create this chart?",
            "1500 rent in Seattle... Is this like one of those crash-pads the pilots use with like 10 bunk beds inside? ...and it's downtown!?\n\nThis is a massive savings so it's not expensive if you can make the one thing making Seattle expensive, cheap.",
            "Your apartment is in downtown? Props to you for getting a cheap rent (even if with a roomate)",
            "Agree with this post.\n\nThat being said, I am trying to move out of the city. After a good number of years in the job I am getting sick of city apartments and I want a nice quiet house. In most city offices its hard to get one of those that isn't over an hour commute to the office. \n\nCity centre as a grad is the best though.",
            "You spent more on dining for yourself than I spent feeding a family of 4, lol",
            "NGL, 8000 on dining and 1500 for ubers during the year 2500 on rental cars. That's over 10,000.\n\nAlso 95000 savings is wild.\n\nThat's basically 100,000 extra dollars most people will never see.\n\nIt's important to just recognize that when your poor these aren't things you get to include in your budget.\n\nI'm very happy for you. I think it's awesome that you are doing so well!\n\nI would just like to add that a lot of this budget is discretionary spending that poor people just don't have the option.\n\nAgain, please freaking negotioate, get the highest salary you can, these companies are making millions off of you.",
            "I personally wouldn’t count 401k toward savings. Looks like you have 38k actually saved. Good luck saving for a down payment on a home in the area you’re renting",
            "Bruh rent only at $1540/m? In Seattle? That's gotta be like 300 Sq feet or in a bad area, right?\n\nI live in a low-medium CoL area and my rent is $1130 for 800 sq ft with included 1 stall garage (detached). That's an absolute steal in my area, and unit quality is mid.",
            "[deleted]",
            "Ah yea $1000 a year in groceries",
            "Mmm hmm you spent exactly $1k on entertainment in a year.",
            "Are those American salaries sustainable ? How long have they been this high ?",
            "Just amazing US salaries...",
            "Love this for you my guy!!!",
            "Wow. This is so patronizing. $169,000+ is NOT gross.",
            "A) how is the new grad making over 100,000 a year?\nB) how did you furnish your entire home for less than $2,000?",
            "[deleted]",
            "Now add a spouse and kids....",
            "Three problems:\n\n1. Not every new grad works at a FAANG\n2. Did a quick search, for $1900 you live in a shoe box.\n3. Are you going to rent for the rest of your life? Most people who say \"HCOL salaries aren't a lot because everything's expensive\" IS because homes are expensive. A home in Seattle-Redmond is $1.5 - 2.5m. Maybe this doesn't apply to new grads but most people aren't new grads.",
            "Holy shit why do people make dumb financial decisions like renting their own apartment right out of college?  Get roommates.   No wonder reddit is full of people bitching about how unaffordable real estate is when they spend the first five years of their life throwing six figures away on rent.",
            "How are you only paying $22k in taxes...? Mr. IRS, yeah this guy. Please get this guy",
            "Not so subtle brag post lol\n\nTime to buy gf?",
            "Why are you maxxing out a 401k in 6 months in 2023 thats stupid",
            "It’s high cost of living and software development engineer, like we need more acronyms.  Anyway good job on the CS career kid.  Edited SDE.",
            "1900 rent + utilities in downtown Seattle means you're living in a room. Not exactly a thriving lifestyle. \n- No kids\n- No pets\n- Healthy individual\n- Mommy and daddy paid for school if there are no loans\n- No mortgage\n- No property taxes\n\n1k on grocery I call bullshit. We spend 600/mo for two people in CTfor food and essentials\n\nWhere is your:\n- Renters insurance\n- Health insurance premium+ deductible payout\n- Car insurance\n- Gas money\n- Car maintenance\n- Internet plan\n- Phone plan?",
            "[deleted]",
            "Hello, what is this program?",
            "What tool did you use to make this?",
            "Is this after Federal taxes and FICA taxes, only 22000 tax? Are the 401k contributions pre tax? So they would be taxed at withdrawal right?",
            "Damn… 2 YOE and not even close to that.  gotta work harder😭",
            "[deleted]",
            "That's the dream. Really nice.",
            "HCOL and $1500/mo rent? Hahahahaha!",
            "Can you please tell me what’s the name of the chart/graph?",
            "Where do you work?",
            "HCOL area and rent is 1500/month? That's dirt cheap my man.",
            "1,500 for rent? What, a 200 Sq foot room?",
            "[deleted]",
            "Did you really only spend 1k on groceries over the course of a whole year? That’s like nothing, you spending $83 a month if that’s true",
            "What app created this flowchart? Looks good.",
            "What is this graph called and how do you make one? It looks cool.",
            "Wow your expenses are really low. I’m not from the US, the 401k is that all pension savings you get or is there any public part from taxes as well?",
            "What did you use to make this? Very cool looking and I've seen this before, but never seen how people make it.",
            "I think you shouldn’t factor in 401k into savings necessarily but it’s own category cause you wouldn’t withdraw it without taking significant penalties. You also are taxed 43k on your income.",
            "Would rather see the numbers for a single calendar year, having both 401k totals but only paying 1 year of federal taxes skews the numbers, you also weren’t making quite as much or anything the first half of the year which is why your tax withholding is low.",
            "This makes me want to leave New York",
            "What app are you using?",
            "This is excellent! Ty for sharing! Also your money acumen is amazing!",
            "Damn i thought i was doing good: make 110 gross new grad,78 take home and save 2k every month. Biggest expense is rent with 2100(CT)",
            "What do you use to budget/keep track of expenses?",
            "why is 401k not included in your take home pay?",
            "18,5 per year rent in downtown seattle\n\nTf is it so expensive to live in florida, so many apartments around me are like min2K",
            "What did you use to make the chart?",
            "Seattle is not like NYC and Cali in that you get taxed out the ass with state and local income tax. That additional $20k you get to keep goes a long way.",
            "Now do this for a family of four on your salary alone. Good luck.",
            "What tool did you use to make this graph? I want to do something similar for my job application process",
            "This graph looks off…. Just looking at the 401k and Roth contributions for 2023 shows glaring misunderstanding of the annual contributions limits",
            "Bad representation of data this way using multiple years of benefits.",
            "What's hcol?",
            "How do you create this awesome flow chart?",
            "Which software did you use to create that chart?",
            "did u include stock here?",
            "What program was used to create this? Looks amazing",
            "Job title and company?",
            "Doesn't Seattle have high property taxes? A tech salary is nice and comfy if you're single and renting, but expenses add up when you have a mortgage and a family.",
            "You're one year into your career, and you haven't experienced lifestyle change, let alone inflation, yet.",
            "Shat app is this? Its so cool!!!",
            "Dumb question: how did you only spend $1000 on groceries? I probably spend 4-5k/year on groceries. And if I have dinner out, it's like $40+ per dinner.",
            "How do you pay so little taxes? Lol also, that’s cheap rent. Do you have a roommate? I live in a slightly cheaper city but pay 30k in rent alone",
            "How could you contribute that much to a Roth IRA given the income limits for contributing? It looks like you are over the income limit"
        ]
    }
]