[
    {
        "post_id": "155ur6y",
        "author": "Pigglewiggy",
        "title": "What I learned from my internship: I don’t want to be an SWE",
        "url": "https://www.reddit.com/r/csMajors/comments/155ur6y/what_i_learned_from_my_internship_i_dont_want_to/",
        "score": 383,
        "num_comments": 107,
        "created_utc": 1689961225.0,
        "selftext": "A few weeks left of my internship.  I got to try on many different hats from SWE,  application engineer, business analyst, product owner.  I discovered I don’t like coding all day and not speaking to people.  I kind of liked going into the field and configuring practical applications in the retail space as an application engineer but can’t see myself doing it long term.  I like working with data (sql and PowerBI), improving processes, finding out ways how to create business value using technology as a business analyst.\n\nI loved working in the product owner role where I’m collaborating with different teams both internally (engineering, merchandising, finance, operations) and externally( stakeholders and business partners) to move things along and bring the vision to reality.  Loved working with our business partners Samsung and Apple leveraging their technology to influence and change customer behavior,  streamline operations to run frictionless and more efficient.  \n\nWhat I especially loved was seeing the technology in action in the end and how it made an impact on customers, stakeholders and bottom line.\n\nSo product owner it is.  I want to build my domain knowledge in the tech retail spacd.  It’s nice to finally have a focused career goal.  \n\nTLDR; ending internship…I came in thinking I was going to be an SWE but now want to be a product owner.\n\nAnyone else discover they didn’t want to be SWE and wanted to do something else?",
        "permalink": "/r/csMajors/comments/155ur6y/what_i_learned_from_my_internship_i_dont_want_to/",
        "comments": [
            "Yes! I’m the same way. I enjoy coding, but I particularly enjoy getting feedback from users and implementing it onsite into the system so that it works as they’re wanting it to work. It feels great!",
            "Congratulations. This internship was a success. It taught you what you want to be. It might taken a few years to become a product owner, but now you can work on that path to get to your destination.",
            "Funny though, I used to be a product owner intern who also wear the hat of software engineer. Absolutely hated it, so I’m never gonna go into engineering again. However product owner/manager is not an entry level position, so finding a new grad job is pretty tough even with experience. You could try BA, but BA gets a lot of competition because basically every major can apply.",
            "You can be a technical PM. You get to work (and talk to) with and solve problems with stakeholders from both sides of the spectrum from technical to non-technical. A lot of companies treat/interview newgrad technical PMs like software engineers so you still got to leetcode but you dont have to do the engineering work.",
            "I got a year into a therapist masters internship before I realized I hate talking to people all day and would much rather just code",
            "(I am not a CS major—I have many years of experience—but Reddit recommended this post to me.)\n\nThis might be an unpopular opinion, and I’m not suggesting you slog through years of SWE work if you really, truly hate it, but I will say that in the current market, business analysts tend to make many tens of thousands of dollars less per year than engineers. At my company, the pay is literally half for senior positions. The work environment is also not as flexible. The benefits aren’t as good. It’s harder to find a business analytics job, because so many more people from different backgrounds qualify—so there’s less job stability.\n\nProduct managers are about on-par with software engineers, but project managers _also_ make significantly less. “Product Owner” could mean either of those things or some blend of them depending on the company, which means your salary would probably be somewhere in the middle. “Product Owner” and “Product Manager” are not typically entry-level roles, though, so you will probably have to do something else until you get there. And “Business Analyst”, at least at all of the companies I’ve worked at, was not a role that would qualify for a Product Manager role. So, you would probably be slotting yourself into a career-long lower salary range by starting out as a business analyst.\n\nHave you considered being an analytics engineer instead of a business analyst? Analytics engineers typically design the data warehouse, help define business definitions for the data, work to get business stakeholders the data they need to make decisions, and manage basic ingestion of data—more complicated coding and infrastructure work belongs to data engineers, who report through the Engineering department. Analytics engineers do code, but it’s mostly SQL and the Python data stack, not applications, and they report through the Data department vs. Engineering. Because they code less, for better or worse, analytics engineering doesn’t pay as well as software engineering, but the pay is still better than what business analysts make, and you get to work with stakeholders across the business. If you do analytics engineering longer-term, you could also try to go into data team management, supervising data analysts, as well. You could go back and get a master’s, then become a data scientist. You could go back and get an MBA, then become a product manager. You could teach yourself a little more code and get the higher salary as a data engineer. It’s a much more flexible role.\n\nI mention all of this because, when I was fresh out of school, I wanted to go into technical writing, because that’s the role I found most interesting. Then, I was offered a job—and the hiring manager actually called me from his personal phone to tell me not to take it. He said that technical writers make WAY less than software engineers and convinced me to go into software, instead. So I did—and it was a fine job, but I didn’t love it. So, five years in, I went into technical product management (which is similar to a “product owner” job) and then engineering management (supervising software engineers). I went back to school to get my MBA, and now, I can get a job doing almost any role I want. That would have almost NEVER been possible if I’d gone into something like technical writing, business analysis, etc. outside of Engineering.",
            "This is the value of internships... Try before you buy! Sounds like you're having a successful summer. Congrats on your newfound clarity! I had the same experience with my own internships - sending me in a  different direction than anticipated.",
            "I figured it out in my final for CS.  We had to program a database for a state organization that wanted their database moved from windows 95 to win 7 (which was what was new and shiny at the time). \n\nI wrote all the documentation for the programming but did none of the actual coding.  \n\nI figured out I like technical documentation more than SWE.",
            "I have learnt that SWE is very broad in that every company has varying standards of responsibilities for their SWE. What I’m trying to say is that maybe you didn’t enjoy the SWE responsibilities at that specific company?",
            "Im the same. I got into a tech lead role and its perfect its like 50% managing/helping my team and in customer meetings, 25% traveling and installing/maintaining software on site and 25% actually coding. I simply cant code all day but it helps if you have a few years of doing it. But take ownership of what you do so your name comes up more often with the higher ups. I worked really hard to master a project and now im the lead of it 🤷🏻‍♂️ just my two cents",
            "Same here! Kind of a shame that I spent so many months trying to get a swe intern and end up kinda hating it, even though the pay is good, I just don't enjoy it enough to take it as a career path. I'm personally trying to pivot back to business/data analyst myself as well",
            "Similar experience. It’s why I’m going for a phd and industry research roles insteadd",
            "Youare formtunate in that your internship exposed you to enough to gain a good feeling for what you would want to do in the field. \n\nIf you want to pursue a Product Owner role, take a look at getting a CSPO certification. Many companies use SCRUM and it's a relatively inexpensive cert to get but has some value. Others to look at are PSPO or Safe POPM",
            "Sounds like you would prefer the Technical Program Manager, or something in Developer Advocacy roles.",
            "BA, PM or strategy roles in tech are good choices.\nTech consulting in top firms also do similar things, more variety and interesting work, and have a clearer promotion path - less WLB though",
            "I speak to so many people daily as a SWE intern lol",
            "I think your experience was pretty great and really shows what internships are all about: giving you a taste of working in the role(s) / environment(s). You may also consider Product Manager (perhaps the same as Owner) or Project Management. Product management may be a bit easier if you have some SWE experience though. Project management is a different skill set but seems to line up to the things you liked about your internship: leading cross functional teams to deliver some product or service, defining goals, mitigating risks to goals, reporting to and collaborating with key stakeholders, etc.",
            "Yeah exact same boat as you last year. This year I’m working as a TPM intern, hopefully it stays that way or I can go into PM, either way not interested in SWE",
            "Interned at FAANG as SWE and I did not enjoy the work at all. Probably going to go into a position that deals with more “high level” stuff.",
            "I did a SWE internship and absolutely hated the daily grind of writing software that has more/less been done before many times. Since then I have decided to go down the machine learning and AI route for some new cutting edge stuff.",
            "You just described my nightmare of a job lol. Great on figuring out what you're inclined to though! The earlier you figure out the earlier you are on your right path",
            "You’re young. It’s not uncommon to find a career path isn’t for you and there’s no shame in it.",
            "Sounds like you prefer to talk the talk, but not walk the walk.",
            "soup soft crowd profit spotted slap chunky worry chubby serious ` this post was mass deleted with www.Redact.dev `",
            "So whats the bottomline here? You like being meetings all day where you lay out what to do to people over actually implementing the work?",
            "Just say you couldn't cut it. Be honest about it",
            "i guarantee you, that internship did not properly expose you to everything in any real depth",
            "are you female? woman are born to communicate, so working on their own is boring for them.\n\nfor me, it's boring to communicate with \\[stupid\\] people around. computers don't lie",
            "[deleted]",
            "Save",
            "I think this is me. But I’m only just hearing about product owner. Is that like product manager? Or different?",
            "I went to school for CS. Got my degree. It was very engineering based (lots of math and some good EE courses, but not like comp engineering amount). Got an internship in Telecom and never looked back. I work on Microwave and fiber backhaul, and a large private MPLS Network. Glad I stayed in telecom.",
            "Same here for me.",
            "Funny enough, I got accepted for an engineering position after grad and it ended up being a tpm role. I was pissed at first with the bait-and-switch, but I think it was actually good for me after meeting some of the engineering teams I work with.",
            "What program did u do? I wanna try this out"
        ]
    },
    {
        "post_id": "md4106",
        "author": "Insanelysalomon",
        "title": "Idea for people without internships",
        "url": "https://www.reddit.com/r/csMajors/comments/md4106/idea_for_people_without_internships/",
        "score": 379,
        "num_comments": 32,
        "created_utc": 1616694459.0,
        "selftext": "Last summer I got screwed over had internships cancel and drop me from the interview process because of Covid. So I had to do something to get on my resume for the summer. I reached out to a small business owner I knew and offered my help for the summer for free. I was able to get some great experience and build my resume. Now I have a great offer that ultimately was because I had the experience last summer. \n\nFirst off keep searching and use this as a backup until it gets too late for anyplace to hire you.\n\nSo here’s the idea: If you don’t have anything for the summer reach out to a small business honor and offer to work for them for free. Offer build them a website or overhaul the one they have. Offer to make them a in-house program that solves a problem they have. Find a inefficiency they have and solve it. If you really need the money you can work a second job that won’t help your resume and do this on your free time. They won’t care what hours you work or how fast your making progress since you’re doing it for free. Ultimately the cost of doing this is low compared the the return you will be able to get by having a internship on your resume with these skills. It’s essentially moving some personal projects over to job experience. \n\nTLDR: Help yourself out by helping a small business owner",
        "permalink": "/r/csMajors/comments/md4106/idea_for_people_without_internships/",
        "comments": [
            "This is what I'm doing now for my current employer. Some recommendations:\n\n1) Hammer out and define the requirements of the project as much as possible early on. Both you and your client should be crystal clear on what you're trying to build. This will eliminate confusion and wasted time for both of you.\n\n2) Have something new to demo each week if possible. This will increase your client's confidence in you and offer frequent opportunities for course correction. \n\n3) A small-ish project you complete is better than a project that is too large and complicated for you to complete by yourself. Limit the project to 2 or 3 workflows max to keep it to a manageable size, otherwise you might get overwhelmed with complexity.",
            "[deleted]",
            "To add on to this: last summer I applied to a bunch of places with no success, mostly because I was a noob. I needed money for the summer so I couldn’t do something for free all summer.\n\nWhat I did really leveled up my skill set which was: pick up a job at a Amazon warehouse working from 5am-10am. Start my day super early, make some money, and then work on projects and learn programming stuff from 12pm til 5pm. I took June to build out a full stack app for the first time ever. I learned a lot. Then I took July to learn some more in depth topics in the area I was focused on. August I finished up the projects, touched up resume, started grinding DS&A and applied.\n\nTook me til February to land my summer offer cuz I was just learning how to interview, but now I lined up something for Summer and Fall. If you’re smart about how you do it, you can turn no internship into a positive",
            "[Check out websites like this.](https://www.builtinchicago.org/jobs/nationwide/internships) A lot of smaller companies are still hiring, also check more local, or with your professors.",
            "Coincidentally enough this is exactly what I did last summer and it paid off tremendously. I can vouch for it.",
            "Thank you this is a very meaningful tip.",
            "[deleted]",
            "Or just do some personal project",
            "Another idea is to apply for research positions at your college or university. It looks great on resumés and you learn a lot.",
            "I recommend against putting this on your resume under “jobs”. Unpaid internships are why so many smaller companies are trying to lowball students, and if more people start doing this then its giving them an impression that students are willing to work for free. Put it under personal projects. Also internships like these get tricky for background check later on for big companies.\n\nUltimately you can use it to get your first real internship and i would put it under projects afterwards.",
            "Thank you for the tip and I have a question: How do you approach them? Also, is there a specific industry that you'd recommend that might be in more need of people like us?",
            "What is a realistic contribution a freshman can make during an internship?",
            "I did this my freshman year after finding it hard to get anything paid with little experience. I just reached out and asked for a shadowing/internship type thing with their data analytics branch. It was only for a month, not the whole summer, but it worked out well to make me look like I had some industry experience. Then the next summer I got a FAANG offer :)",
            "You can find unpaid internships on angel list, that’s what I did and now I have a paid gig.",
            "I was thinking about this this past summer and even recently but i cant think of what I could do. The first thing that comes to mind is building a website but that can be easily done with shopify or wix, where you can just drag and drop textboxes and create a pretty nice website. Anybody who has done this, what do you offer to a small business owner that Shopify or Wix etc. does not?",
            "Ask your professor's for list of people doing studies. I am now helping with a study on similary score library for NLP and was told by the previous intern the experience greatly helped with internship finding",
            "Why has nobody mentioned REU's (or doing summer research with a professor)? I spent a couple years applying with no luck. I had heard they were competitive (had a roommate rejected from all six they applied to the year before) but decided to shoot my shot to get research exp for grad school. Applied to a bunch and got offers from three, including one at a top CS school that I eventually went to. Even if you don't necessarily want to go to grad school (half of my cohort didn't go immediately) it's something to put on your resume :)"
        ]
    },
    {
        "post_id": "1bv57qj",
        "author": "LinearArray",
        "title": "[PDF] Microsoft's research paper on \"What Makes a Great Software Engineer\"",
        "url": "https://www.microsoft.com/en-us/research/uploads/prod/2019/03/Paul-Li-MSR-Tech-Report.pdf",
        "score": 384,
        "num_comments": 48,
        "created_utc": 1712180493.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bv57qj/pdf_microsofts_research_paper_on_what_makes_a/",
        "comments": [
            "Basically be a virgin living with your parents.",
            "75 pages of yapping I wish there was a more readable poster version of this",
            "Wow, I can't believe that they never mention leetcode!",
            "These attributes would make anyone great at any job…",
            "I really enjoyed what I've read so far. The figure at the beginning is comparable to an \"infographic\" summary if any of y'all have short attention spans like me.",
            "# Short Summary: Attributes of a Great Software Engineer\n\nGreat software engineers possess a blend of technical expertise, interpersonal skills, and key personality traits. They are:\n\n* **Technically strong:** They possess deep knowledge in their domain, understand tools and processes, and write high-quality code.\n* **Problem solvers:** They can analyze complex situations, make informed decisions, and develop creative solutions.\n* **Team players:** They communicate effectively, build trust, and collaborate well with others to achieve shared goals.\n* **Driven and passionate:** They are motivated to continuously improve, take initiative, and are passionate about building great software.\n\nThey are essentially **masters of their craft, effective collaborators, and dedicated individuals who continuously strive to make a positive impact through software development.**",
            "Great. Now average engineers looking for average roles will be compared to the ideal. The arms race never ends.",
            "As it turns out same qualities as a Lego Master Builder.",
            "Summary?",
            "This should have a title: \"Annotated List of all Positive Adjectives in English Language\"",
            "Just a minor note: the second author is addressed here by her deadname. She is [Amy J. Ko](https://faculty.washington.edu/ajko/), a professor specializing in human-computer interaction, software engineering, computing education, and programming languages at the University of Washington.",
            "Are they going to train Devian’s ugly brother from a different mother using this paper?",
            "76 pages? Bruh the HR managers over there are probably a bunch of Liberal Karens who just needed some work to do",
            "Wow really, finding a job and be given the opportunity to gain industry experience and get better at it as time goes by? Wow Microsoft, you really are the best! ",
            "too long didnt read"
        ]
    },
    {
        "post_id": "1bcks28",
        "author": "marciltheshell",
        "title": "Just got a job offer",
        "url": "https://www.reddit.com/r/csMajors/comments/1bcks28/just_got_a_job_offer/",
        "score": 384,
        "num_comments": 51,
        "created_utc": 1710207035.0,
        "selftext": "Hoping I can improve the mood of this sub. I'm 33 years old, worked in the live music business for about a decade before deciding to go back to school during covid for a CS degree. Happy to say I graduated in February 2023 and I even got an IT job about a year before that.\n\nI was laid off in December from that job, applied to about 65 job postings, had 4 interviews, no offers. I have a mortgage and a 2-year old daughter, so taking low paying internships isn't an option.\n\nI decided to swallow my pride and go back to my old career. I'm analyzing all the things about it that burnt me out before and focusing my effort on not only doing the job, but using what I've learned over the past few years in school and working in IT to build solutions to those problems.\n\nMoral of the story, especially for you graduates in your early 20s, if you're not getting jobs in tech, go work for a small company and build your portfolio by building something that can help that company and therefore, YOU. The job market is shit, so make lemonade.\n\nAlso, don't rely on a salary alone. Get a reputable financial advisor who will  help you with investing. I got one at age 22, and it's one of the best decisions I've ever made.\n\nEdit: Damn, this sub really is doom city. To those desperate or won't accept anything less than a SWE or IT job, best of luck to you.",
        "permalink": "/r/csMajors/comments/1bcks28/just_got_a_job_offer/",
        "comments": [
            "Even the good news is bad news, we’re cooked",
            "Dude had us all in the first half 😭",
            "Your helping the mood of the sub by getting laid off and getting no offers and going back to your old career? Not everyone has an old career to go back to… and financial advisors for investing can be a waste of money, just buy SPY or VTI. Happy it’s going well for you but this is not inspiring lmao",
            "Thank you king",
            "I'm not going to lie, I know this tried to lighten the mood a little, but you went back to school for multiple years to study CS and haven't worked in Software Engineering since. That's depressing for people looking to break into the industry having maybe internships or placements as their biggest resume pull.",
            "I think I just got more depressed",
            "TLDR: Dude went back to school 4 more years to get a cs degree but doesn't even use it because couldn't find a job, so now he works old job..man I don't even do cs and that's depressing 💀😭",
            "Bad advise AND shitty story. Millennial-ass story telling to top it all off.",
            "This sub reddit is depressing af! Is the job market really that shit, if it’s when do yall think will it go back to normal",
            "It's so over",
            "What college did you go to?",
            "Who's your financial advisor?",
            "Congratulations! Wishing you the best",
            "I'm laughing and crying",
            "So what I’m hearing is I should switch majors. Got it.",
            "We need need flags or some way to start analyzing all this doom and gloom. Everyone struggling to get a offer, like where did they go to school, was it a T1 research uni ?, people who did internships, were and why didn't the company follow up with an offer ? Are we talking junior web dev spots here ? Do you have an hackerrank score and do you know your DS & algos ? I'm near New York and I've seen some success stories out of my uni at financial, insurance, and accounting firms that are going after CS majors. But here's the thing, if you went to the 200 ranked CS school in the nation do really think you can land a Magnificent 7 internship ? \n\nI have a job that pays a decent wage, I went back to finish my CS degree, I really want to start hearing good news on this reddit. I know the majority were international undergrads, but this post isn't good especially if you went to a T100 school. I love tech so I'm in it for long haul, but come on, you have realize and understand that AI will kill things like web dev, UI experts, and will be able to auto spit out code of many simple technologies that used to be skills for a full stack web dev. \n\nI think if you really want to get that offer, the barrier for entry just went way up. You need to have the skills that can't be automated by a language model. \n\nMaybe the people landing jobs are just not posting because they are busy working ? Jeez, bad news every week....",
            "I must be missing something, where’s the job offer ?",
            "Good news became bad news",
            "I dunno if any single person can improve the mood but congrats",
            "Congrats 😎",
            "Imagine thinking you need a financial advisor as a regular 22 yo.",
            "This was a waste of a read",
            "Are you still applying to CS-related jobs as well?",
            "Congratulations man. Love to see people doing well in the field !",
            "[deleted]"
        ]
    },
    {
        "post_id": "17e569l",
        "author": "ShaUr01",
        "title": "Hot take: the location of your university is as important as the prestige when it comes to getting hired",
        "url": "https://www.reddit.com/r/csMajors/comments/17e569l/hot_take_the_location_of_your_university_is_as/",
        "score": 378,
        "num_comments": 94,
        "created_utc": 1698013652.0,
        "selftext": "title",
        "permalink": "/r/csMajors/comments/17e569l/hot_take_the_location_of_your_university_is_as/",
        "comments": [
            "Yep, there is a reason why so many people who work at Faang came from San Jose State and not a lot from a school like UConn.",
            "For smaller companies, living near their office will give a huge boost because they don’t want to give relocation assistance.",
            "Even the worst UC is “more regarded” than most universities that ranked higher from other states or countries, because most large tech companies are based in California and every Californian have heard of UC and it’s prestige.\n\nYour HR is not going to follow individual universities ranking, but they have definitely heard of UC and they are just safe bets",
            "Yep. \n\nWent to a small liberal arts college (LAC) in the Philly suburbs. Our career fair wasn't very good, but our proximity to Philly, NYC, and DC (via Mega/Bolt Bus) helped give me access to college hackathons, conferences, tech meetups, and other networking opportunities (also on the East Coast in general.) \n\nI'd looked at LACs in the midwest and would not have had the same opportunities there.",
            "Hard agree. I think prestige can make up for a disadvantageous location, and being close to tech hub can make up for a lack of prestige. If your university has both, you're in a really good position. If you don't have either, then you probably chose the wrong school.",
            "Yup. For sure. I would argue that in some cases location is more important than the university.",
            "Boston: I'd do it again in a heartbeat.",
            "NJ is amazing",
            "On a similar note, I got an internship from a high paying, amazing startup ($40/hr and learned AWS) earlier this year and they revealed to me that they generally don’t prefer candidates from prestigious schools cause those students are always looking “out west” meaning to work for FAANG and therefore aren’t as motivated to be there as opposed to students from other schools. \n\nThey had a few employees from my university who they said were some of their best employees even though my school is only a T50 CS school and not known for its CS program.",
            "Eh, I just graduated from a no name school in July and had a job two months after graduating. I’m not working at a prestigious company but I am making decent money and have a killer WLB.",
            "What about universities like Michigan? Or CMU?",
            "What about schools that are sorta remote? Like UVA or Virginia Tech",
            "What about Purdue down in Indiana",
            "My university is a feeder university for the defense industry.",
            "Y’all just come on here and say anything fr lol",
            "Your gender and ethnicity are as important as well.. apparently.",
            "Simple example… \n\nMichigan and Berkeley both have fantastic CS programs. Berkeley has a trillion times more to offer for job proximity.",
            "Plug for UW in Seattle: huge tech hub (Microsoft and amazon HQ, all major FAANG have big presence) and there’s no other big state school nearby, unlike California. No other big prestigious university. Great choice! More than half my cs friends work at FAANG lol",
            "how about for online masters like omscs? Will the location of my house matter?",
            "Why is that?",
            "Bruh can we stop with the rat race",
            "That is so fucking sad. It's not your fault that you can't afford the university but you have less chances than others.",
            "Virginia Tech in DC",
            "Based on the take above , Any good universities you people recommend for an international student ?",
            "Not really.",
            "Not a hot take",
            "What about the Ivy leagues? Cornell for instance is located in Ithaca, a remote town in upstate New York."
        ]
    },
    {
        "post_id": "17b4744",
        "author": "uknowmee_",
        "title": "My full-time offer got rescinded",
        "url": "https://www.reddit.com/r/csMajors/comments/17b4744/my_fulltime_offer_got_rescinded/",
        "score": 379,
        "num_comments": 61,
        "created_utc": 1697670514.0,
        "selftext": "My full-time offer got rescinded today. After months of hard work at internship with shitty pay and working 10 hours a day - got an offer, then what? Rescinded. Currently a Computer Science grad in a top 10 school. Next plan? Apply to companies and get into the grind, need to find a job by May 2024. What if I don’t get a job? Get married to my partner and settle down. Not a bad plan huh?",
        "permalink": "/r/csMajors/comments/17b4744/my_fulltime_offer_got_rescinded/",
        "comments": [
            "Name and shame.",
            "Hiring is slowing like crazy till end of year. Lucky for you, your grad date is next year",
            "expedia？why not name the company",
            "[deleted]",
            "Dude just name drop the company it's not like we know you or they could tie this back to you. It's completely anonymous.",
            "What is the first initial of the company name",
            "Listen, I did my internship and the guy running the program told me I wasn’t worth60k and i think it’s cause he only made like 62 after 8 years. I snapshotted my offer for 65 and sent it to him to watch his head explode.   I didn’t take that offer because I had a better one.  Ref, this was in the middle of 2008 mid the housing crisis.   \n\nInternships are for learning, a lot of the time they see how far along you are and they make dumb hiring decisions.  Your internship is more valuable on your resume to a brand new employer. \n\nBtw, the guy in charge of interns is rarely the star of the show, it’s generally a mediocre dev they don’t trust on the important shit.  \n\nYou don’t want to tie your boat to a middle tier talent.",
            "Right now is a shitty time, next year should be way better. Keep your head up.",
            "if financially viable, doing a Master’s might be a solid plan B. good luck!",
            "[deleted]",
            "Checkout government positions. Always hiring and pay is decent out of college, lots of holidays off, good benefits, pto, and great work schedules",
            "Keep your head high up.\n\nI see you have a good plan B.",
            "wtf thats a shitty thing to do , i hope good stuff happen to you in the future dude",
            "mid size company？",
            "top10？ no worries，u can do it！",
            "Bring those JOBS back to USA",
            "I have an offer and I'm starting in a couple weeks. This is my biggest fear..",
            "\\> After months of hard work at internship with shitty pay and working 10 hours a day \n\nAnd invaluable experience gained.",
            "Good plan",
            "Linnedin?"
        ]
    },
    {
        "post_id": "15goyut",
        "author": "frozenYogurtLover2",
        "title": "Does anyone actually know what kubernetes does or is it just one big inside joke?",
        "url": "https://www.reddit.com/r/csMajors/comments/15goyut/does_anyone_actually_know_what_kubernetes_does_or/",
        "score": 386,
        "num_comments": 107,
        "created_utc": 1691022593.0,
        "selftext": "something something containers something",
        "permalink": "/r/csMajors/comments/15goyut/does_anyone_actually_know_what_kubernetes_does_or/",
        "comments": [
            "Programs like web systems need to run on some machine. But why just choose one machine, when you can run them in a virtual container that can run on any kind of machine with very consistent behavior, no matter the actual machine they are running on! And you can duplicate them as much as you want, as traffic scales up and down, in different locations around the world, so that it minimizes latency and maximizes throughout for everyone! Plus, when you push new code, or need to restart everything for various reasons, wouldn’t it be great just to create new containers before destroying the old ones, and have them automatically route traffic to the right containers, so there is never any downtime? Boom! That’s kubernetes.",
            "this reminds me when someone in my discrete math class said anyone who understands proof by induction was lying lol",
            "Instead of having a big box that holds your program in your office, you take a picture of your program, send it to a box somewhere else, and the picture gets turned into your program there and runs inside that one.\n\nSometimes, if a lot of people use your program in the other box, it will have babies so there's enough programs for everyone. Then when less people want your program, it kills some of the babies. \n\nThat's basically how kubernetes works.",
            "I don’t think so lol, for like docker and kubernetes are really hard to understand if you don’t have a solid system knowledge.\n\nThey say “they know them because they will them in their personal project” and that’s abt it",
            "Kubernetes pays my bills and affords me amazing job security through these times. Can't complain.",
            "Kubetnetes manages containers.  \n\nFor example, spinning up replicas based on load.  Restarting failed containers.  Rolling out new updates, and rolling them back if errors are detected.",
            "\"I don't understand it, therefore no one does\" is definitely a take",
            "I didn’t ask for kubernetes in my life. But here we are. And I make a shit ton of money knowing what it can do.",
            "It’s a container orchestration system.\n\nYou had your traditional bare metal systems running, aka how most people run their OS on your desktop or laptop in most cases. Then came VMs. Now my hardware AND OS kernel is virtualized or simulated and I can run another OS on that virtual hardware. I can even do some cool stuff like shift VMs around hypervisor hosts, copy VMs, scale horizontally. And I can have multiple VMs on top of my hypervisor.\n\nBut then now I have my next issue. I’m running my three tier web app across multiple VMs. My load requires the front and middle tier to scale out. But now I’m taking a long time for the VM to come online. It’s online now, but now I need to run my config scripts and whatever else to actually make my instance ready to accept requests and process them appropriately… all this time so I can run an app that is much smaller than the size of the OS and hardware I am running the VM… not to mention just like the old bare metal problem, I’m wasting precious money, data center space, and licensing costs and not getting as much juice as I can out of the underlying hardware because most of it is going to handling hardware and OS\n\nIn comes containers. Now I add containers on top of my VM (I can do this directly bare metal too). And the container SHARES the same kernel as the OS. Also I can prepackage all of my configs and processes that run with my component of my web app.\n\nBut now I have yet another problem: I’ve now deployed my front end containers, middle tier containers, and maybe backend containers. How do they talk? Do I need to do this for EVERY container?! Ok my VM that had the containers crashed. I need to provision it all again?! What about networking. I already network my VMs, now I need to network my containers? What about ports for communication? Now I need to take down one of my hypervisors or VMs for maintenance, how will I move all of my containers? I now need to keep track of a container lifecycle and write the automation myself to do it.\n\nIn comes kubernetes. Now you just tell Kubernetes what containers you want to run and how you want them grouped up. Now comes along kubernetes, the container orchestrator. I install the kube utilities on to three VMs. Together they become a “cluster”. Now I give kubernetes a YAML file, that says I want x front end containers, y middle containers, z back end containers. And kubernetes will distribute it across your 3 hosts. Kubernetes can also handle DNS load balancing across your pods and the networking so all you need to worry about is setting the rules about what GROUPS of containers can talk to which GROUPS and it takes care of the rest. \n\nLast, reliability and reprovisioning. Let’s say the third VM dies suddenly. Well, a third of your containers were on there. Normally you’d need to apply your deployment scripts to get more containers up… but instead you defined it in Kubernetes. Kubernetes knows you said you wanted xyz containers across your cluster. So kubernetes will see that your third VM in the cluster is down, and automatically begin reprovisioning your containers on the remaining two VMs to get back to the specified number of containers. Third VM comes back up. Kubernetes will repopulate on the third VM automatically, then kill containers on the other two to bring the number back down.\n\nIt can get complex real freaking quick but this is the gist. I’d watch videos by mumshad on udemy or tech world by nana on youtube. This honestly only scratches the surface. K8s is valuable though in industry, learn it and rake in the dough",
            "It’s kind of like an airport. Kubectl is your phone line to the flight controllers and the highest manager of the various support staff",
            "It's an urban myth, trust me",
            "It makes \"It worked on my machine\" a valid argument",
            "I dare you to manage (create, read, update, read, then delete) 100 containers of 8 separate services without any form of container orchestration (Docker Swarm, Kubernetes, ECS etc) You may divide the 100 containers among the 8 services any way you like.\n\nI jest but give it a shot. I promise it will be educational. Best case scenario, you'll invent a Kubernetes competitor.",
            "Kubernetes (k8s) is Docker Swarm + Docker Compose on steroid, but that description minimizes the usefulness and impacts of k8s, k8s is much more than those 2 technologies combined. \n\nManaging k8s alone is very annoying, hence Helm Charts was invented to simplify lives",
            "Something to do with providing computing resources to whatever is running inside of a docker container. So I write a program and put the program in a docker container. But then the actual CPU and memory is provided by “kubernetes”",
            "And new grads wonder why they can’t get jobs…",
            "Based on my understanding from work, it essentially runs your container in a larger environment.",
            "I know what micro services and pipelines are and it seems to be related to both, seems like a way to manage a multitude of servers",
            "All of the complex parts of kubernetes are the ones people using it never need to know anything about. Somebody already did the hard part for you, hint, it was the developers who built the platform itself.",
            "haha",
            "i do but only because i was trying to get a job at docker never would’ve known otherwise 😍",
            "It’s like C++, Java, and Go. They’re all inside jokes that got away from the original authors.",
            "lol",
            "Kubernetes is not an inside joke; it's a widely adopted and essential technology in the world of cloud-native and containerized applications. It serves a crucial role in simplifying the deployment, management, scaling, and orchestration of containerized applications across various environments. Kubernetes addresses the challenges posed by the complexity of modern application architectures and the need to efficiently manage distributed systems. It provides features for automating tasks, ensuring high availability, managing networking, and scaling applications based on demand. Kubernetes is backed by a large and active open-source community and is used by organizations of all sizes to streamline their application development and operations.\n\nSimilarly, KubeMQ is a vital component in modern cloud-native architectures, specializing in efficient communication and event streaming within environments like Kubernetes. It provides essential messaging patterns such as publish-subscribe and request-reply, facilitating event-driven communication between different parts of an application. KubeMQ supports real-time event streaming, ensuring that applications can seamlessly interact and react to events. With features like scalability, message persistence, and integration with Kubernetes, KubeMQ helps developers simplify the complexities of communication in distributed systems. Just as Kubernetes revolutionizes application deployment and management, KubeMQ enhances how events and messages are handled, contributing to the overall efficiency and resilience of modern applications.",
            "We know exactly what it does :) It's awesome!"
        ]
    }
]