[
    {
        "post_id": "16ndvzb",
        "author": "94rain",
        "title": "Company says congrats in a rejection email 💀",
        "url": "https://i.redd.it/49dn3jssscpb1.jpg",
        "score": 1587,
        "num_comments": 66,
        "created_utc": 1695190872.0,
        "selftext": "“Congratulations on your many achievements so far! Unfortunately, we've made the decision to not move forward at this time.”",
        "permalink": "/r/csMajors/comments/16ndvzb/company_says_congrats_in_a_rejection_email/",
        "comments": [
            "I raise you this -\n\nA FAANG recruiter called 1.5 months after I'd finished 6 interviews to say \"I've got good news and bad news. Good news is I've heard back. Bad news is we're not hiring for this role anymore\" (they'd frozen hiring due to COVID). I was crying inside 😂",
            "I see this and I raise:\n\n>Firstly, massive congratulations for making the **top25** candidates for the role (we had over 700+ applications). You really stood out to us, and that's an enormous accomplishment. You should be proud 🌟\n\nIn other words, Congratulations for successfully failing!",
            "Congrats on getting this job… update on your application status! In all seriousness though sorry bro. Keep it up you got this!",
            "Tried so hard and got so far, but in the end it doesn’t even matter.",
            "Lol what do you expect when most of these companies call their workers \"we are all family \"?",
            "That company is evil 😭",
            "Just got a rejection from a German company. Two sentences saying the position had already been filled. Thats it. Gotta respect it.",
            "You have been selected as a customer ☠️",
            "Congratulations on your achievements, this ain't gonna be one of them though",
            "[deleted]",
            "Imagine getting a notification: thank you for your application to company for software engineer. congratulations…\n\nJust to click and continue reading to just get disappointed.",
            "It's Glean. It's weird when I read it today.",
            "can't imagine that sudden change of emotions",
            "Honestly I'd like companies to just have in their subject line the name of the role and then rejected.\n\nIt's nothing personal lol. I don't need to read a paragraph of your apologies.",
            "Congratulations on your many achievements, of which getting this job is not one.",
            "What a horrible rejection message - should be a text book example of what not write when turning down a candidate.",
            "task failed successfully!",
            "This is like companies giving out participation trophies",
            "“You’re a winner! Just not here now get out”",
            "Theyre congratulating your resume 😭\nBecause saying it was good but not good enough",
            "When I see a no-reply email I auto assume it would be a rejection email.",
            "Got the same email",
            "at least you get an email",
            "Bruh😂rollercoaster of emotions reading that…",
            "Politest rejection letter ever",
            "And if I remember correctly, if you use Outlook, there is actually a little animation when it detects the word “Congratulations” 😂",
            "Come on, they were just trying to automatically let you down easy.",
            "It's called a soft landing.",
            "Did nobody read the fucking email?\n\nRole: Software Engineer - University Grad\n\n\"Congratulations on your many achievements so far!\"\n\nThey're literally saying congratulations on graduating college with your degree. Even if it's automated it's a lot better than seeing a big **FUCK YOU** instead",
            "Kind of sounds like you excessively oversold yourself, maybe",
            "It's ok",
            "You could have been the #2 applicant out of hundreds for a single seat. Don’t let it get to you, keep applying and you’ll find a spot somewhere!",
            "Yeah but....the \"congratulations\" would've maybe made my day tbh:)) i find it kinda wholesome..",
            "I had something similar where the recruiter said I was a strong candidate for the job, and ultimately said they wanted to find someone else.",
            "Well, you dodged a bullet at least. Working for a company does this will put you through hell.",
            "Reminds me of an interview process I went through, 3 interviews in 1 day, result was to be given out in a week. Texted my recruiter, he said he wants to schedule a call to give the results in person. Kept on postponing for one reason or the another but was adamant on giving the verdict on a call. Eventually after 2 weeks, said you're not selected, I just wanted to do it in person since you spent so much time interviewing 💀",
            "Like bffr",
            "I got the same email from the same company lol",
            "😂🤣😂",
            "I got an email a while ago that said something like \"Congratulations on submitting your application! Unfortunately, this role has been filled.\"",
            "The funniest thing is when you receive a rejection email without filling in your name and position in the template.\n\nLike: \nHi [applicant name] \nWe are excited about your interest in our company for the [position] ...",
            "Congrats, you've been chosen as a customer!"
        ]
    },
    {
        "post_id": "psxpby",
        "author": "bIackberries",
        "title": "People in This Field Are Abhorrently Bigoted",
        "url": "https://www.reddit.com/r/csMajors/comments/psxpby/people_in_this_field_are_abhorrently_bigoted/",
        "score": 1552,
        "num_comments": 495,
        "created_utc": 1632276723.0,
        "selftext": "Quite tired of seeing people parrot crap about how the evil “Diversity Hires” are coming to take CS majors’ jobs.\n\nOne of the most common things I’ve seen said about tech is this: “Don’t worry about not knowing everything. You’ll never know everything when joining a company, you learn on the job.” Why, then, does it seem like underrepresented people in CS have to practically be Steve Jobs in order for many of you to consider us competent enough to get a job offer? Either we know everything and can jump to senior level on Day 1, or we simply got an opportunity because of our sex/skin color. Cool. \n\nWhen minorities (particularly Black people) or women joining the industry is brought up, suddenly everybody is concerned about “keeping CS meritocratic.” I read some comments earlier on a post about being a woman in CS, and some comments were (predictably) whining about how companies care more about diversity now and not about who can best perform in the position. \n\nThe problem with this mindset is it presumes the two are mutually exclusive. Newsflash: there are plenty of Black/POC and women software engineers who can do the job; I’m confused as to why so many of you automatically think otherwise. Many of you seem to believe any minority or woman can just walk right into Google today, ask for a job, and be given one without any demonstration of potential. I’m pretty sure this isn’t happening anywhere.\n\nOne minute, y’all are raving about how hot the job market is. Then, when minorities or women are brought up, y’all start talking about “diversity hires” taking the jobs and how “we’ve just changed who we discriminate against” (meaning men, usually White, feel like they are being oppressed because Black people and women are joining the CS workforce and often are *actually* as good at software engineering as a lot of them *pretend* to be).\n\nWhenever someone asks how to snatch an interview at certain companies, many of you say “get a referral,” fully aware that it’s acceptable to partly rely on your social connections to score opportunities in tech instead of entirely on your aptitude. I thought y’all were concerned about protecting the meritocracy of CS, though? Why are you asking friends for favors if the job absolutely must go to the best-suited candidate?\n\nI’ve also seen some comments (mainly on Twitter) complaining about minorities in tech “ruining the vibe of the workplace” by finding each other and sticking together. If you are someone who thinks this way, I’d challenge you to reflect on why that might happen. Underrepresented demographics in tech enter workplaces with virtually nobody they can relate to beyond occupation. This can be jarring in multiple ways. Then to also have to deal with a litany of microaggressions and major incidents of racism/sexism…it’s not hard to see why we find each other and stick together in these kinds of environments.\n\nSome see this topic as just a “political debate.” Sorry, but the idea that minorities and women have the potential to perform well at a job in tech is…not political. That has absolutely nothing to do with politics and everything to do with your own personal biases.\n\nI posted this here because I presume most of us, being CS majors, are in school and have yet to fully enter the industry. A lot of you should do better at interrogating your underlying (or not so underlying) racism and sexism before joining the workforce; we all do, to varying degrees, but I feel like some of you have done absolutely nothing to tackle your own prejudices. Ultimately, I wish y’all would just boldly stand in your bigotry instead of hiding behind some false intellectualism. Trying to shroud your biases and hatred in “logic” only works for so long and on so many people before the rest of us look past the bullshit.\n\nTLDR: a lot of y’all are bigoted as fuck and need to reconcile that.\n\nEdit: wow thank you very much to the generous people who gifted gold and other awards. This post was something I simply thought needed to be said among us who are preparing to become, or already are, CS professionals. I’m glad it resonated with many of you.",
        "permalink": "/r/csMajors/comments/psxpby/people_in_this_field_are_abhorrently_bigoted/",
        "comments": [
            "Kinda ironic that the people who hear about a woman/minority in cs and immediately go **must be a diversity hire! They are surely unqualified** is _exactly_ the reason why diversity hires exist in the first place. When these people go on to become recruiters, you bet your ass they’re automatically filtering out all the women and minorities until someone tells them they absolutely have to. That’s the thing with prejudice, when someone thinks all minorities are incompetent, they don’t think they’re being biased, they just accept it as part of their worldview and it becomes part of their mental hiring agenda.",
            "To add onto this, I think what people don't understand is that people in the underrepresented minorities often don't even apply for these roles. And it's  because they don't think they're good enough precisely because of people with the bigoted attitudes.\n\nThe diversity programs are all there to have outreach and tell them that they're welcome in the company and should apply, and many qualified candidates who may not have applied otherwise will end up applying due to this. \n\nThey still have the same assessments and everything that we all take.  they're diversity hires in the sense that they wouldn't even have applied for a role they're 100% qualified for, not because they're just trying to fill a quota.",
            "Man, you beautifully summed up what I couldn't put into words...\n\n\nI have been interviewing lately and sometimes I do wonder if there isn't some bias from the interviewer - whether it's conscious or unconscious- working against me, due to it being pretty obvious I'm Mexican, lol.",
            "Not cs but I know a lot of people in it. At my large university, Facebook did not hire a single white male intern. That is statistically impossible when it was around 60 people, mostly urm. Also IAs hiring clearly places a large emphasis on diversity. In the field I want to go in, I go on LinkedIn (anonymously) and look at the typical interns at companies. A disproportionate number of them are urms. The skill level in my field is very easily verifiable externally and the URMs are almost always less qualified. CS has leetcode and codeforce, so I don’t know why you think it’s not like that in cs.",
            ">TLDR: a lot of y’all are bigoted as fuck and need to reconcile that.\n\nBigot as fuck? Bruh stfu. People aren't complaining about \"race\" or \"minorities\" not being able to get a job or having these people replace their jobs. I never seen anyone complain about this shit until people like you start to force this weird conspiracy theory towards everyone in the CS field. Even if there were, it's because people like you made them believe a \"false\" theory going on right now. Women and minorities of many races have been working at tech companies since 2009, so wtf you on about?? Where do you even live? Tech companies in NYC and Cali has been hiring women and minorities for more than a decade LOL\n\nThe REAL issue is that companies hire \"cheap\" talent via outsourcing over ACTUAL fucking quality, you know. Not over race and gender. That's retarded. It's all about hiring cheaper wage slaves for good quality instead of paying a veteran CS Major of 15+ year of experience for 2.5 times the amount\n\nLook at Microsoft and Apple with Windows 10 and macOS Big Sur. The worst fucking cancer of software development in ages. It's buggy as shit and this is the RESULT of hiring low quality developers via outsourcing for cheaper costs and the layoffs of QA engineers. THAT IS THE ISSUE. DRILL IT INTO YOUR HEAD AND STOP PUSHING YOUR PERSONAL POLITICAL SHIT ON CS FOLKS! These people are the most chill people out of all the other fields I've seen in computer technology related fields\n\nIf anything, you (the OP) sound a leftist Trump supporter bum that has nothing to do all day and gets off by instigating shit like this on reddit. Politics solves nothing. Work does\n\nNow go back to work and contribute to society instead of spewing useless political posts OP LOL",
            "As they say, “When you are accustomed to privilege, equality feels like oppression”. 99% of the ppl ranting on diversity hires (atleast the ones I’ve met) are the ones who won’t get their desired jobs anyway. This is the convenient excuse they resort to.\n\nGetting a job in an under-represented field is not just about cracking 3-odd coding interviews. You have to overcome chauvinistic ideologies, natural biases and non-existent networks just to be present at a place where u are. People really need to understand the difference between “equality of opportunity” vs “equality of outcome”. Diversity hires, for eg, fosters equality of opportunity. \n\nThe day URM ask for standard hikes, regulated career growth, reserved nobel prizes and the likes, by all means we’ll all stand for meritocracy for the good of all.",
            "Excellent post, OP, thank you for sharing your thoughts! You especially see this mentality on other anon networks too like Blind. Just recently, there was a post about how someone thought they did badly in their Google onsite interviews but still got an offer anyway. 100+ comments calling them a \"Diversity Hire\"... and then the OP of that thread commented that they were a white male. \n\nAs someone who interviews candidates myself, I think it's just incredibly sad and annoying to see people jump to \"diversity hire\" as a way to put down underrepresented peoples' achievements. \n\nWhat's also particularly annoying is the spreading of misinformation such as \"Diversity hire === Giving a free job offer without interviews to all the underrepresented people in the world!\". It's not; as other comments have also noted, it's about better outreach to ensure more underrepresented candidates have access to resources and information to access the same opportunities as others. They still go through the same interview process.\n\nIn fact, they likely have it tougher because they also have to overcome potential unconscious (and very conscious more often than not) biases (which good interview/hiring processes try to help reduce as much as possible but it's not perfect).\n\nExcellent post and thanks for echoing sentiments a lot of us also share!",
            "The irony of ppl proving you right is not lost on me OP. There’s a lot of ppl that carry resentment towards us, out of nothing but pure jealousy (or insecurity). Sad story.",
            "[deleted]",
            "This is the best post here. I appreciate you, everything is on point and I couldn’t have said it better myself. May your light keep on shining, it’s truly needed in this field!!",
            "Oh my god thank you for putting this into words. I am a woman in cs and I have been called a diversity hire by so many people even though I was way more qualified to do the job than they were and I still am better at it. People suck in this field.",
            "Commenting here as an Asian female with prior experience. I agree with everything you've just said. What you also fail to mention is another huge can of worms: the treatment women, particularly women of a visible minority, get in this industry. There is 100% a white male brotherhood going on and you'll just never be able to be a part of that, and it's a fact. The average John Smith will never see you on the level of his white male buddies. He might see another non-white guy as such at most, but as a non-white woman? Good luck.  \n\n\n>I’ve also seen some comments (mainly on Twitter) complaining about minorities in tech “ruining the vibe of the workplace” by finding each other and sticking together.\n\nI hate this so much. Nobody complains about white people being friends with white people, but god forbid any minority from making friends with someone with the same language and background! How come no one ever shits on white people for only being friends with whites? How come there's such a double standard?  \n\n\n>Ultimately, I wish y’all would just boldly stand in your bigotry instead of hiding behind some false intellectualism. \n\nAs much as I want to keep my mind open to the fact that one day things will be different, I've just accepted the fact that I need to work 2x as hard as a man and 2.5x as hard as a white man to get ahead.",
            "[deleted]",
            "It's crazy how in this very post so many people are proving your point.     \nThey would rather get mad than confront their own bigotry.",
            "[deleted]",
            "I'm a man and I don't care about diversity hires much. But the process goes like this:\n\n\"I studied a lot to get my degree and then I had to study 6 months only succeed the interview process. \n\nThen I had to work a lot to be promoted because otherwise I could be fired for not being promoted.\n\nThen you discover that if you were a women the interview process have would been easier and the pressure after being hired is lot less.. for the same salary (or a little less)\"\n\nThese men love their work but found hard to work for a big corp and are pissed off when someone in the same exact situation (age, experience, salary) gets it easier. It's woman o black people.  \n\nYou would be pissed to (probably) if you feel you need to do 100 and others need to do 80",
            "Yes, yes, 100%, yes. I say this as yet another English speaking western white male - this field needs to get its act together and be vastly more welcoming and inclusive for people from all walks of life. The diversity hire programs barely scratch the surface of the problem.",
            "You must be real proud of yourself for building up straw men and knocking them down. FWIW, I support affirmative action, but the real conversations to be had about affirmative action are difficult and nuanced and you haven't even tried to have them.",
            "The funny thing is, why would a company for profit, risk taking bad developers just bc they want diversity, companies don’t care about that, they only care about hiring the best so they can make money, so there’s no “diversity hiring” it’s bs",
            "Diversity is critical to the success of any organization and or company.",
            "Perfectly said, it’s so prevalent in tech spaces (discords, Blind, Reddit, Twitter) to disparage URM. It’s extremely common to see students complaining about diversity programs, like FBU, Google STEP, CODE2040, Explore, Twitter Academy, etc… Its honestly so tiring that URM have to work 2x as hard to have the same validation as there peers.",
            "preach 100%",
            "This sub is filled with comments like \"there's only one woman/black person at my current job, therefore they must be a diversity hire and have no skills\" but if you point out their racism they'll deny everything.",
            "This is a really great point and I couldn't agree more. But I do have a question that I'm genuinely just curious about. As a POC myself, I've noticed that sometimes people like us - or any visible minorities - tend to get past resume screenings more often when there are others with comparable experiences. I mean resumes that are very much similar. However, minorities might get the chance at the recruitment process while others might not. I honestly feel I've gotten some interviews I didn't merit. Now, I understand that resume screenings can honestly be a lot of luck, a lot of the time. But I've just noticed this sometimes, to the point where I wonder the question myself of whether I got lucky to at least get the interview. Of course, what happens beyond the resume screening is all merit/luck.\n\nAnyway, just wondering if that's something that favours minorities, or is it just something that I've noticed around me?",
            "That's the problem with the \"diversity hire\" buzzword floating around. It makes people second guess their worth and it makes jealous people think others got in easily. If a company was straight forward and said, \"we hire the best person for the job\" then no one would complain if they saw a black woman walk into the office. The problem starts in the PR department. \n\nPeople in this field are generally very liberal and accepting of race/sex, but also very elitist in regards to intelligence. If they think someone skated by, they'll be monsters. It sucks. \n\nI honestly don't care if you are black, white, gay, trans, etc. I only care if you can help me hit a deadline. That doesn't make me a bad person, it might make me lazy though...",
            "What a massive shit show this comment section is",
            "As long as they are hiring competent people that get the job done right it doesn’t matter who they hire",
            "I believe in meritocracy. And that has nothing to do with colour or race or whatever. In other words, if I were to evaluate someone, I would completely ignore the race or colour or gender or similar attributes.\n\nThe below responses to your post may be taken from the perspective of an Asian male (so *not* an URM from my understanding).\n\n>many of you say “get a referral,”\n\nNever had a referral. And yes, I agree that it's odd from a meritocratic perspective and not something I encourage.\n\n>minorities in tech “ruining the vibe of the workplace”\n\nNot sure why that should happen. Again, to me I don't care since I don't consider the race.\n\n>y’all are raving about how hot the job market is\n\nCan't say that's the case for me; hard to even get interviews. I've failed more than 400 times after all.\n\n\\---\n\nHowever, my policy on meritocracy is quite hard and hence I am indeed not always comfortable when I see things designed only for URMs. The reason is that having events for a particular group alienates people from other groups who may also be disadvantaged but are not eligible simply because of their gender or race.\n\nA classic example from the UK is the case of the (consider the two equally competent) \"poor white boy\". I don't see them eligible for most of the diversity events by companies, while a \"rich black kid\" - let's face it that person is relatively advantaged right from the start - can access all the company diversity events. Who is better off in the end? Who *needs* access to these events from a fairness perspective? Similarly, in India, you have an easier chance getting government jobs if your caste is right - *ignoring everything else*. Yet another example are people with autism.\n\nWhat I'm trying to say is that grouping by which race or gender you come from isn't always the way to go, because that ignores several factors that are similarly important to consider.\n\n\\---\n\nPlus, this means that I would not consider acceptable for an URM to pass an entrance test while someone else with higher scores does not (which I've heard and have links to, but cannot verify, in India); that is, the passing mark for a test cannot depend on whether someone is an URM. This would be same for a referral too.",
            "A lot of people in CS put little to no emphasis on diversity. They see no problem with CS classes be dominated by white/Asian males.\n\nI wonder how many of them would flip out, if the tables were turned...",
            "This right here!!! You said everything that needed to be said so perfectly",
            "I’m white. \nDon’t have much money.\nWanted to sign up to a course in San Francisco.\nThey only had scholarships for minorities, so I couldn’t have one and couldn’t go. \n\nI don’t think people should be discriminated against because of the color of their skin.\nThis means there must be no biases during interviews, but also means no diversity hiring.\nOne comes with the other.\n\nStopping bias during interviews is a harder to avoid, but possible and a laudable goal. \n- Dummy names for candidates\n- non presencial interviews with cameras off\n- multiple interviews (one for coding, another for profile) with different interviewers\n- interviews having multiple interviewers to reduce bias in candidate selection.",
            "Imagine literally encouraging racism and sexism in the hiring process.",
            "Allllll of this",
            "All the \"diversity hires\" that I know of were smart, passionate and heavily engaged in the field. They deserved the position regardless of their gender/race/etc, they might have gotten extra attention on the initial resume process but thats because they are underrepresented and might get overlooked.",
            "Diversity hire? Tech is the one place I just don't see that happening... What are they gonna do, give easier coding challenges to women and POC? \n\nLogic and problem solving is the most meritocratic measure you could use for any non-physical job. \n\nThose who do the best will get the best offers (b/c they will get multiple that they can use as leverage).",
            "People are going to think I’m trolling, but this is a sincere question. Isn’t the notion of having a lack of merit sort of baked into the concept of a diversity hire?",
            "I see this as an opportunity for me. For example ive been saying im part of the lgbt community for years and i always get calls back for at least a phone interview.\n\nYou can teist this the way you want, the fact is i wasnt getting any calls before this and now suddenly im mr perfect!\n\nIm not complaining though lol",
            "Whiny little shit. Why don't you go do some leetcode?",
            "I'm a minority woman in tech and totally feel this. I'm ridiculously educated and credentialed, and I have about 15 years of experience and I would still hear some fresh out of college guy say within earshot that I'm on the team because I'm a cute chick and I'm just here to be the mascot.  I feel like I have to prove myself so much harder (hence the multiple masters degrees and imposter syndrome) just to be talked down to anyways.  They don't even care about what your background is, but will judge you right off the bat for your gender/race/thing you can't control.  I recently had a contractor on my team who we had just met who hasn't even worked with us yet say that he didn't believe the other female engineer and myself could possibly understand how to set up infrastructure (us two women are both senior data engineers and both have triple this guy's work experience).  The managers picked up on the sexism right off the bat and he was let go, but it's sad that he's going though as many years as he has treating female engineers that way.  I have also met women who have been developers from way back in the 80s and they're disappointed at how the gender mindset in this field has shifted so drastically over the last 40 years or so.",
            "There are some points I agree with you on, but you can't just outright deny the existence of diversity hiring.\n\nI've literally been face-to-face with employers and employees that gleefully and shamelessly gloat about the practice. You can't just scream \"RACIST!!!\" and expect to change the mind of someone who's had a firsthand account of it.",
            "My husband and I was wondering about this very topic because our son (we’re African American) graduated High School at 15 last year with almost a year of college done and is currently set to graduate college in April of next year in CS, he’ll get his MCSIA (I might’ve spelled that wrong so please forgive) He’ll be 17…I’m worried what recruiting him will look like in this field….years ago in Accounting and Finance there was the same claim and I really don’t know what him going through this because he really works so hard!!",
            "People need to understand that even minorities need to be qualified for a job if they are going to be hired/interviewed. You are competing with people who are just as qualified or more qualified than you (applicant).",
            "Thank you for posting this.",
            "The people who worry about diversity hires are usually mediocre.",
            "I think it's just that people are insecure about them not getting a job. I was like that only some time ago but then I thought about it and I guess it does make sense to have diversity in the company for it's employees and the company (different ideas, different cultures). I think companies should brand it carefully. Because the ultimate goal is to help underrepresented sections work and prosper there mentally and physically. If companies label their hiring drives as women only or something like that then people who get hired in that might be looked at as a 'diversity hire'. Maybe just hide the fact that it's diversity hiring or hire in ratios during hirings to hide the fact.",
            "\"I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.\"",
            "I mean jobs with huge companies are literally posted with \"if you are not a woman POC DO NOT APPLY\".... so",
            "You whine a lot. \n\nNobody cares what color you are. Nobody cares what gender you are. That’s what meritocracy means. \n\nWrite good code and you’ll be successful. I don’t give a fuck about the rest.",
            "[removed]",
            "Typical virtu signaling reddit post. Companiws at Color stack or GHC literally hand out interviews but\"DiVERsITY HiRInG does not exist!\"",
            "This was beautifully written. Thank you so much.",
            "“Newsflash there are plenty of Black/POC and women software engineers who can do the job” \n\nThen why do we need the “diversity” hires in the first place or for that matter why do we have to indicated race and sex on applications?",
            "I don't really understand the intention behind \"diversity hire\". Does that mean that you hire people based on their skin color or culture, not actual skills? Sounds pretty bigoted to me. I conducted a few interviews and never really cared about people's hobbies, political interests or skin color. Sure it's interesting to work with people from other countries but I tried as hard as I could not to give anyone any bonus points based on that. Apparently to some people that's just unacceptable and racist but to be honest, I feel like nobody really cares.",
            "I dont mind minorities, women, trans, etc on the field.\n\nThe only thing i am against is how forced it is. Nowadays, no Matter which person you are, nothing is stoping you to join.\n\nYou gotta stop playing the victim card. I am friends with black people/women in the field, and nothing is impeding to join. They do not have a problem.\n\nWhat i am against is when they purposely hire more women. They hire should be based on skills NOT sex, race, ect. Right? For me it does not make sense. In doing that, you are discriminating. We should aim for equal hiring, not this.\n\nWhen I go to job fairs and they tell me to my face that they are only hiring women, I am against.\n\nWomen make 5% of the people in CS, of course there will be less. When you force yourself to hire them more easily you are discriminating.\n\nIt is not make sense and it is NOT bigoted to argue and complain about it.\n\nJust calling bigoted whenever you oppose a Woke Ideologie is plain dumb and ignorant. Intead of arguing, you just attack and call bigoted. You should be able to argue. If you cannot argue then sorry but you cannot defend it and you are just giving this critiques reason.",
            "Two cents as someone who actually (tech) interview people: \n\nI think diversity might (? I generally don't know) play a factor in terms of whose CV got selected, or get put on the desks of actual engineers to review and do interview follow up. But it in no way affect how I evaluate the candidate. If you can answer the question? great, hired! If you can't, and show lack of competence, good bye.  In fact engineer interviewers are explicitly told not to let race/ gender bias you.  And when we are writing interview feedback, we are required to leave out all info on race and gender. So the final hiring committee who are reviewing the interview notes (the same people calling the final final shots) don't even know what you look like.",
            "It’s not just this field, it’s everywhere. Academia, consulting, medicine, engineering, law, etc…\n\nUnfortunately things won’t change overnight, but it will change slowly. Keep in perspective that there are black folks alive today that were legally not allowed to use the same water fountains as white people when they were children. The era of discrimination wasn’t that far ago. The things we learn in history class about MLK, Rose Parks, and others isn’t ancient history - it was relatively recent. \n\nGive it several more generations and eventually there will be a lot less bias to the point diversity hire won’t matter (or so that’s the dream).",
            "THANK YOU!!! The worst part is everyone on Reddit and Blind will give each other advice about how to get higher TC and how to get into the field, with things like \"just grind Leetcode\" or \"lol the job market is so hot this is too easy\", but apparently women and colored people are excluded from this advice. When a guy is hired for $100K as a fresh grad with bad CS fundamentals but good LC skills, he is applauded and congratulated for \"hustling\" and told he will learn on the job anyway. If a woman does that, she's incompetent and considered a diversity hire",
            "There's no doubt that women and minorities are able to do the job if they're hired. But you can't ignore the fact that so many D&I programs actively seek out these individuals when other similarly or even slightly more qualified individuals get resume rejected or ghosted. When people say they want to make CS meritocratic what they mean is that (a) a person should be selected for an interview based on their resume and not their race or gender, and (b) when a choice must be made between 2 qualified candidates, it should be made without considering race or gender. \n\nYou can say that companies can hire whoever they want and that is true, but that doesn't make it fair. \n\nI don't believe this view is bigoted at all. I am extremely supportive of D&I initiatives that foster interest in CS.",
            "I think the whole idea is that qualified people ought to take precedence over less qualified people, regardless of skin color or sex(lookin at you affirmative action).",
            "I don’t think anyone has a problem with competent black people or women. \n\nIt is when a lower standard is applied to them than whites, Asians, Indians that people have a problem.",
            "I agree with this post. But I think an important issue to address as well is how so called \"diversity hiring\" is happening much more on the internship and new grad level. It's STILL much easier for majority groups to get mid to senior level positions, who are people that have much larger impact on the company.\n\nWe need to keep companies accountable to make sure diversity isn't just performative too.",
            "Elephant in the room: most of those comments are coming from Asians. They hate to see the “lesser” minorities (black/Latino) succeed.",
            "while many (specifically big names) do hire underrepresented people so their culture looks more diverse on paper, very very often those people are also good engineers.  \n\n\nI have a single female on our team of 5. When I joined the company as a junior (it's a big tech company) and observed who was doing what and how I asked her to mentor me. She was the most well structured and organized person in the team and I want to learn how to lead projects from A to Z not only come up with new mesmerizing algorithms.",
            "I don't live on USA, but I don't really see, how diversity hiring would work here where I live. The vast majority of people in my country are white. Some of the get the job they want, others don't because they do not qualify. As for man/woman ratio, I can't exactly blame the companies either. Many of them are looking for graduates or even students. This also has to do with some laws as it's often more profitable for them. On my university just by looking at the students, I feel confident saying that about 95% of them are men. Even in my highschool, I was in a class with CS profile and the vast majority of students were also male. So I believe that there's something wrong going at much earlier stage than job hiring.\n\nNow, I can't speak for the situation in other places of the world, but I don't feel that the IT companies here are the primary reason for underrepresentation. Sure, they can do the 50/50 hitting ratio, say that woman don't have to be students/graduates but would that be even fair in this situation? Would there even be enough women interested now, given that it was very rare to find girls who were into CS back when I was a highschooler? Honestly, I don't know. I don't have enough data. I just feel that historically we mostly failed at supporting girls interest in computer science and now we are facing the results.",
            "I’m in IT but pretty much sums up the experience",
            "THIS THREAD RIGHT HERE!! ALL FACTS. As a Black woman at FAANG, I deal with this on a daily basis.Thank you so much for articulating this.",
            "[removed]",
            "[deleted]",
            "Discriminating against someone based on race or sex is absolutely abhorrent. So when organizations are established with the expressed goal of benefitting one group based on race or sex to the exclusion of other races/sexes, doesn't that broach the line of bigotry as well?",
            "whistle fly future cow nutty alleged swim stocking wistful overconfident\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "So do you think genetic characteristics should play a role in hiring? Yes or no question.",
            "[removed]",
            "\"Underrepresented demographics in tech enter workplaces with virtually nobody they can relate to beyond occupation.\"\n\nAre you telling me you can't relate to people based on:\n\nSimilar hobbies, similar TV shows, similar books, similar games, similar music, similar travelling preferences, similar morals/values, similar foods, similar opinions on the news, similar etc.?\n\nYou care more about if someone is the same skin colour as you than the content of their character? How incredibly shallow and disappointing. MLK would be dissapointed with people like you.",
            "I haven’t been around this field long enough to know how rampant prejudice and bigotry really is here. If it is bad then I applaud you for standing up to it. I think it may be possible that the types you describe are more vocal, and your findings may be biased. And your examples are good examples but seem rather anecdotal. \n\nId also like to point out that you called out stereotyping by stereotyping. \n\nPeople who say ‘diversity hire’ are just angry that they can’t find work and want something to blame besides themselves. When the truth is, they don’t want to put in the extra work to better themselves, to go above and beyond. Many of us think because we have a b.s. degree that’s enough\n\nThat or they won’t take a job unless it’s exactly what they want. (Need $200k, 8 weeks pto, 3 hr work days) So they stay unemployed.\n\nIm not saying you’re wrong. Im just saying that it is less likely to be pure racism/sexism and more likely to be self hatred they can’t admit.",
            "[deleted]",
            "… or you are using them as a scapegoat for your poor professional skills.",
            "No justice no peace ✊🏿✊🏿",
            "[removed]",
            "[removed]",
            "[removed]",
            "Even if someone is less qualified, having more diversity can be beneficial for the company culture. The company will make decisions that help them and don't care about how you feel.",
            "[removed]",
            "Yeah I always thought it was weird - especially bc I'm thinking of removing my last name and using my white sounding middle name on my portfolio and resume when I apply to jobs soon",
            "As a minority whose about to transition into STEM/tech, I needed this reality check that there are people who want to see me fail",
            "Yeah.. welcome to the tech industry. I used to try to change things.. “diversity” committees and helping with hiring and mentoring and public speaking but honestly I think this industry is just fucked. It’s so full of technoutopian libertarian bigots it’s hopeless. My strategy now is purely mercenary. Get rich and GTFO then go live your best life after retiring at 32. The toll it takes trying to change things isn’t worth it. Sorry to be jaded.",
            "This. Just this whole post. Everything you said plays a cripplingly massive part in why I struggle to build confidence in my role and was so terrified of interviewing.",
            "Are white people majority in tech? Because im doing interviews and it’s mostly asian/indian…am I getting a skewed sample or something? Doing big tech interviews. Def fewer black and women though, I can agree with that. More asian/indian women than white men so far.",
            "Yep. I posted about how I got my first 6 figures job. And there were SO MANY butthurt dudes going on about diversity hires. Lol. My dude I have a very niche knowledge and set of skills in a very niche field. Why would I care about ur small dick energy’s opinion 😂",
            "Catch all the \"you can get a $200K salary if you grind Leetcode\" but when it's a woman who grinded Leetcode she's a diversity hire",
            "Bravo.",
            "I am a black crack baby and first generation college student, I should fucking hope I am a diversity hire. f any whites have a problem they should take it up with their grandparents, or their neighbors grandparents. \n\nI had to scratch and claw from one of the worst neighborhoods in Chicago just to get to this point, as if I could ever give a fuck about what these losers think, cry more.",
            "I’ll be a diversity hire and laugh right to the bank, get fucked",
            "I’ve gone through plenty of lawsuits from ex-employees (white/male) who got passed for a management promotion due to DEI candidates in California. We settle out of court every time for high six figures. Most of the experienced white guys are now dreaming to get passed for a DEI candidate as its a massive payday for them.",
            "Lol this is a top troll post",
            "I don't know anyone who genuinely believes that minorities can simply walk into a tech company and take whatever job they want, but it is a fact that women and PoC have an unfair advantage over other candidates. For the record, I believe that referrals are unfair as well. Or even prioritizing citizens over foreign applicants. Hiring should be 100% meritocratic, without any regard for an applicant's race, gender, sexuality, nationality etc.",
            "Tech isn't perfect, but on the whole it's very progressive. I don't see any affirmative action for male teachers or healthcare workers. People only care about CS because the jobs are safe and have a lot of money moving around. \n\nMy gripes are based on my experiences; I fully admit it's monkey brain and not logical. I've had to struggle while seeing these exclusive scholarships, clubs, and networks crop up. Meanwhile, life for every working man is still the same struggle it's always been. Is it fair that a female CS student with a wealthy family gets a scholarship because they're a woman? Women now outnumber men in post secondary. I try my utmost to have a kind heart. I just want to be able to secure my future, and it's competitive out here. \n\nI would also like to know where these invisible networks for white men are that people purport exist, because I have the same people available to me as the black guy next to me, except for any exclusive \"diversity\" groups. \n\nA lot of people in CS act like they've never had a shitty shit job and it shows.\n\nIf anything I'd say that this \"diversity\" trend is being used to depress the (perhaps inflated) wages in the field. And you bet your asses the rich CEOs are white men.",
            "I don't mean to be insulting. I did my best effort not to sound so without obscuring my point. I have nothing against people in minorities or groups that are considered underrepresented; I am in one such group myself: I am an immigrant, and not from Asia. The country I am from is relatively rare in America. When I was finishing my high school with 3,800 students, I know for a fact that there were two more people from my country other than me and two more with parents from there, nobody else. Hopefully, this allows me to express my stance without looking like a bigot.\nAlso, someone might correct me, but diversity hires aren't really a thing (look at any employer's website, they always cite some laws prohibing them to even consider race, sex etc.). \n\nNow, I did most likely take advantage of diversity college admissions, and I couldn't even refuse, I hate it. I am in very good college, and probably the biggest achievement of my life I deserved *in part* because I am an immigrant from a relatively rare country and the university wanted to contribute to their zoo of nationalities. I don't like this feeling, it is unfair to the others who weren't fortunate enough to be born outside of America and don't have an unpronounceable name. \nIf diversity hiring was a thing, I would be against it. Not because I don't want to be replaced by someone else. Also not because it's unfair (the moment I leave college and enter corporate world, the company is not obligated to be fair in their hiring process bc I don't pay taxes to help it). \n\nThere are several main reasons:\n1. You can devise any random number of groups and measure their achievement. Some of these groups will end up underrepresented, and the more random parameters to divide people you find, the more unequal groups you'll statistically get. Beautiful/handsome people will most likely be overrepresented bc they are more attractive. People whose name starts with select letters will be underrepresented (bc our of 26 letters, there will definitely some that subconsciously sound ugly when a word starts with them). People with unlucky names like Harold or Karen will be underrepresented bc of subconscious bias. People in suburbs or rural areas are discriminated against (by the life itself) when choosing extracurriculars (which are some of the most important factors in determining yr future, I can cite research if needed) and teen jobs bc if they don't have a car, they are practically under home arrest, while when you live in a city, you are free to get around by public transit. People of some other groups will be underrepresented for random reasons we will never understand, mostly subconscious bias-related ones. According to this idea, we as a society are obligated to fix that all and enforce that solution on the companies. To me, that sounds absurd. And I don't understand what's the difference between this and what diversity hires would be, if they existed (and what college admissions are rn). What we did is we happened to select the groups that we, humans, happen to easily recognize (or whose political voice was loud enough) and started helping out exclusively them at the expense of other discriminated people. \n\n2. There will always be a bunch of people who were in a similar (or even worse) circumstances than those whose \"underrepresentedness\" we are trying to solve, and who are not in any of these groups. This will stomp on them even more bc they don't get the benefits, but have the same adversities. My best friend in high school was Asian. He was one of the most hard-working people I knew and one of the smartest, but he lived in very big poverty. He couldn't even get a junk car (American South; completely car-dependent Charlotte, NC. Everyone else I knew had a car bc it was a necessity), so he had to spend huge money and many extra hours getting to or from work or extracurriculars (pretty much like me, but he was born here and would have enough time to make for a car if not for the need to support the family). He did end up in a pretty good college, I guess he got through. Yet, to pay for it, he had to join the fucking military (how broken does a system need to be that in order to go to college if you are poor, you often have to join the military). There would be way more scholarships available to him if they were given according to the main determinant of need: your family income, compared to the cost of living where you live. But they instead use race and national origin, so he was cut off. Yes, there are also some scholarships that target Asians, but proportionally to the college population, their availability is way worse. And if he just happened to be white, American-born guy, than any scholarships specifically for him would be considered discriminatory. Same with extracurriculars: you can easily make an all-girls STEM club, but an all-boys STEM club is gonna be considered discrimination and sexism. What if that's the only, say, robotics club available without a car? Or even available at all in a town?\n\n3. I did not see any convincing evidence that there is still discrimination in the workplace. The fact that some group is underrepresented does not mean on its own that it is discriminated against. As a simple example of one *first crossing the mind* reason why a group can be underrepresented: I would assume that there is less female police officers than there are male. Does that mean that there is discrimination against women in police? Maybe yes, maybe no, but that still isn't the reason why 80% of police officers are male. The proportion of females who would consider a job on which they might kill or injure someone else or even get in a fight is most likely much lower than that of men. \nOr see the number of parents among Asians (and no, I am not Asian) who force kids to work their whole childhood to get into a particular small set of jobs, like doctors or software engineers. I tutor coding part-time. I teach a Korean girl whose parents freaking forbid her to play toys bc if she wants to play, she can play piano or go do her hw. She has like 8 extracurriculars in 9 yo. Almost all other Asian students I had were like this (usually not to this extent, but the character of their relationship with parents was similar). So, if, say, 60% of Asian parents are like this (a random number. The point is that it's higher than in other races), it is reasonable to expect that significantly higher proportion of Asians will grow up to be in this field and low proportion will be in less luxurious fields. Does that mean that, say, construction building or trucking companies discriminate against Asians? No. They are, though, likely underrepresented bc they will be a disgrace to the family if they go into construction building or truck driving jobs. Does that mean that IT discriminates in favor of Asians? Probably also no, but they are overrepresented. There can be a million other reasons that we just don't know about bc we just don't know of the effects of some group-based factors on society that have nothing to do with discrimination but influence success. But you can't even talk about that bc you are immediately labeled a bigot and get shut up by others.\n\n4. This war on who is more discriminated shifts the public discussion from how to really fix the problem that your parent's life choices are so unbelievably important in determining your future to redistribution of inequality towards people whose adversities are less obvious. Maybe if instead we focused on the real reason why this happens, we'd figure out a way to curb suburban expansion or pay need-based scholarships to participate in extracurriculars, or pay government-funded parental leave or whatever else. But we are talking about the fact that some groups are more affected by all our problems than others, so let's dump the problems on someone else, so that it stops being as obvious",
            "Least castrated redditor",
            "."
        ]
    },
    {
        "post_id": "1bvcyyj",
        "author": "NonpoliticalLoser",
        "title": "The absolute state of Blind",
        "url": "https://i.redd.it/wdgvdg93sdsc1.jpeg",
        "score": 1533,
        "num_comments": 100,
        "created_utc": 1712200812.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bvcyyj/the_absolute_state_of_blind/",
        "comments": [
            "I read that as laid off. 😶‍🌫️",
            "She knew he couldn’t solve Leetcode Hards",
            "Need this level of delusion in my life",
            "that 200k TC be making these dudes delusional",
            "Least socially inept computer scientist",
            "It’s all horny dudes suffering midlife crisis",
            "I could say from personal experience that this isn't 2 years worth of no sex",
            "Guys a girl wants to hang out with me, does this mean unconditional sex afterwards?",
            "CS is a joke. I read this and can tell he’s balding.",
            "This is no different then sending your resume to 100s of places getting some interviews and then offers. Out of the resumes sent, you get a few interview requests and then a few offers. Offers here are the sex. If you create more value as a person and are not just an average guy with average salary, the conversion rate gets better or it’s a battlefield and if you keep applying i.e showing interest in women, you find ones that want you after a shitload of rejections. Take it personally though and you have lost already.  I get rejected frequently too but I just do it so much that the numbers I get something always comes out of it. Next time try telling the girl you find her pretty ask for her number she says no then that’s it move on or else yk where this is heading.",
            "Mood when you go 5 rounds and they tell you they are going with another candidate.",
            "Read title as \"almost got laid off\", read till to the end trying to figure out how you prevented it, and found out you prevented something else...",
            "Two years lol amature",
            "Recently got laid off so went on blind since a friend said people gave referrals there. holy shit the cesspool of discussion made me leave so fast and not want to associate with the tech industry",
            "Least horny Blind user",
            "The blind leading the blind",
            "“Would you like to grab a cup of coffee sometime?” If yes, get her number. If not, move on. It’s a flow chart. Hope this helps. 🤣",
            "Ive seen some of my boys delude themselves preeeeetty hard trying to believe a girl was into them, but this takes the cake.",
            "Looks like OP made a typo, should have been 29 years instead of 2",
            "TC?",
            "Where is TC and YOE?",
            "Yeah how dare he make a post without TC",
            "I had to keep rereading cuz I thought bro was getting laid off",
            "I will never understand the level of delusion guys will have when it comes to something like this.",
            "You should of told her to go with you and grab the jacket",
            "it helps to you know, meet that person more than once...\n\nif you meet somebody that you like, dont try and fuck her boy.... get her number. \n\nfucking is for the third date, in the civilized world, boy.",
            "What is this community called Blind? This reeks of another community I don't want to name and I'm not sure if I should take the curious this-exist-bait",
            "I really understand people who marry with 20. \nthey save themselves to be on either side of interactions like these",
            "\\#meta",
            "TC?",
            "Maybe he could have asked for a coffee the next day, skill issue🤦🏻, instead of following her which could lead to sex in some highly delusional romcom.\nBut what does meta means here, the girl worked in meta? Or he was in meta at that time too he was not getting sex. 🤨",
            "This is so funny. He's so tender!",
            "Opposite thing happened to me. Was at a party. At the end a girl I had been talking to said that she wants to go together and I can drop her to my place. I told her that my jacket was downstairs and I started talking to other folks. She left and I realized later what had happened",
            "Guys, a girl said she wanted to hang out, is this a sign something might happen?"
        ]
    },
    {
        "post_id": "17j4nnr",
        "author": "Boring_Inspector9857",
        "title": "What’s with all these muscled up guys in CS classes",
        "url": "https://www.reddit.com/r/csMajors/comments/17j4nnr/whats_with_all_these_muscled_up_guys_in_cs_classes/",
        "score": 1529,
        "num_comments": 219,
        "created_utc": 1698591389.0,
        "selftext": "I am an accounting major where all the guys are weak with tiny noodles arms and girls have staches. \n\nLast week I was walking outside a compsci classroom I saw the class was full of incredibly muscled guys. They were so ripped that even the dumbbells seemed to blush in their presence. These guys had biceps that could make Hercules jealous and abs that looked like they were chiseled by Michelangelo himself.\n\nWhat gives?",
        "permalink": "/r/csMajors/comments/17j4nnr/whats_with_all_these_muscled_up_guys_in_cs_classes/",
        "comments": [
            "Those are called brogrammers",
            "For every bug we create, we do 1 pushup.",
            "We go gym to destress , last year the gym was the only thing keeping me sane",
            "Lifting + CS go together like bread and butter",
            "I'm technically one of these guys. The reason is because im scared I will die early from sitting at a computer so many hours a day if I don't exercise. So I go to the gym very frequently as a preventative health measurement to balance out how horrible for you sitting at a desk so much is.",
            "Gym is just a good hobby to have in combination with coding, it’s all muscle and no brain needed.",
            "Stop venting on reddit and go ask these guys out.",
            "All of the smartest people I know are either sick or in great shape",
            "At my school everyone in CS is a fat fuck, and all the hot guys are in CE",
            "That happens when you learn to code from BroCode YouTube lol. \n\n\nBut seriously how is this even a legitimate question. People working out and being healthy ?",
            "They had ChadGPT work out the optimal workout regime for them to fit in between leetcoding.",
            "This is a fake post made to look cs majors look better : P",
            "I remember my high school cs teacher like 16 years ago. Mr. Vrinten, dude was six foot five and jacked. Spent his lunch hour in the gym challenging students to out bench press, out curl, out push up, out anything him. \n\nBasically he was the real life version of Mr. Incredible sitting at a tiny desk.",
            "It’s so they can fight the AI",
            "Lifting improves your central nervous system. The first martial arts were invented by monks who needed a way to stay in shape while sitting for 8 hours a day.",
            "We have to match our income with our body types. Big money big muscle == big boob fat ass \n\nIt’s a hard life and we are constantly learning. \n\nThe best thing is when you get a art major girl with a computer science dude they tend to flow very well together. I tell my cs friends to take art classes to meet there future wife.",
            "The stereotype of cs majors being skinny and meek is dying off. Me and the boys go to the gym at 7, then head to our 9am courses everyday.",
            "I work on core and strengthening my back because I don’t wanna develop back pain when I’m older because of sitting and slouching all day. I also try to develop my forearms because I like seeing my veins while I code",
            "To mog interviewers to give them a better impression",
            "I wouldn't ever call myself \"jacked\" but I do go to the gym. Personally I know working at a desk and living a sedentary lifestyle isn't great. One of my friends who works as a nurse at a retirement home once told me he can guess pretty accurately who either worked out or played a sport in their adult years. The ones who can are often the ones who are able to shower and use the bathroom themselves. The ones who didn't, often can't do one or both of those things. I want to hold onto my independence for as long as I can so that's why I work out.",
            "is solving leetcode mediums between sets optimal?",
            "bro met the gymcels",
            "The stereotypes have flipped, haven’t you heard?",
            "Do you even leetcode bro?",
            "If you go to the graduate level in compsci, you will see the weak guys with tiny noodle arms and girls with staches just as if they're accounting majors, except they're more brown and with thick accents.",
            "I'm a CS girlie and I still have a stache",
            "the schools trying to get more women into tue program so they hire actors",
            "LOL'd out loud as a 6'2 cs bro. Yah, I bench 😎😎 but honestly? I can't really give a straight answer. For me, I work out whenever I get really mad my code won't work so I don't punch my monitor.",
            "Tech bros",
            "More plates, more dates",
            "my cs schedule in undergrad just worked so well with powerlifting lol",
            "It’s a side effect of not wanting to deal with things like blood clots and ED from sitting for 12-16 hours a day.",
            "Hahaha yeah when I was in CS and EE I was always in the gym. Sorry about your stereotype there bud",
            "Wouldn’t call myself ripped/super fit and I’m mid-30’s, career switched and still taking classes part time while I work. But a date last week commented on how strong I apparently am. Fat kid strength I guess. (She was no slouch herself and picked me up for shits and giggles.)\n\nI don’t do traditional gym workouts. But I hike, shoot, and spar (HEMA longsword), and used to do various other sports as well.",
            "You'd be surprised. There's good crossover between nerd culture and lifting. This is someone I always looked up to as a weightlifter and computer scientist/mathematician:\nhttps://edmontonjournal.com/opinion/life-and-times-academically-driven-weightlifter-maintained-passion-for-fitness\n\nRead WSJ between sets and lifts at competitions lol",
            "escape tub dinosaurs lip yam jar sheet bewildered unused modern\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "When AI takes over, us programmers are going to turned into the frontline soldiers to directly combat the bots. We are preparing ourselves for the inevitable battle. We are not the heros the world deserves, but the one it needs right now",
            "its the smart thing to do and CS majors are smart",
            "I'm skeptical. I'm in the workforce, I don't see this ;-)",
            "Feeling a bit insecure OP??",
            "Well sitting is the new smoking. So we try to hit the gym and work out to make up for the lack of exercise at work",
            "In backend software-engineering, we make sure to adhere to SOLID principles and try to ensure our designs are as loosely coupled as possible. \n\nUnfortunately, human bodies are not designed as such. They are a tightly coupled system. Body and mind heavily depend on each other. As such, the best devs make sure to put in gym time.",
            "Just cause we smart doesn't mean we can't have big muscles... \n\n-no longer cs student but a principal engineer with a home gym.",
            "I double majored in accounting and CIS and this was flipped. However, a bunch of podcasts have come out since I went to college about lifting weights making you a better programmer, so there’s that",
            "What state are you in",
            "It's from carrying the rest of you non CS people. What do you guys even do?",
            "Where do these people end up working after graduation ? I've spent the past 25 years in tech, most of it at FAANGs, and I've never worked with anyone that I would call \"ripped\". Quite the contrary.",
            "Contrary to popular belief us brogrammers get BITCHES. We’re intellectually and physically stimulating 😏😏",
            "Me.",
            "When I was in school 15+ years ago, it was rare for engineering and CS majors to be in shape. Me and a few friends were the exception (my dad was a bodybuilder and gym owner, I've been lifting since I was 14 or 15, and wrestled in high school). After that, Zyzz got big, as did fitness communities geared towards more geek/nerd subcultures (especially on Reddit), and a lot of people that ended up as programmers or were already programmers, got into bodybuilding or powerlifting. IME powerlifting was more popular due to this very American bias against doing anything for aesthetics.",
            "Me",
            "It’s important to go to the gym since we sit at desks so much for so long",
            "Gym is just more math.\n\n\nSets×reps all day",
            "Ask Dom Mazzetti",
            "Nerds are going extinct it’s the natural evolution of man and society.",
            "Guys we aren’t allowed to be into lifting as well as cs 😭😭😭",
            "Quick sort the dumbbells gives better results",
            "Were they all sitting there with no shirts on? How do you know what their abs looked like",
            "I’ve seen the same in engineering. When I was in high school all the STEM-oriented students were your classic nerds. Now a lot of them are full on grindset douche bags.",
            "have to kill the stereotype of CS students being smelly nerds",
            "Slip days are for programming projects , not the gym.",
            "Average C programmer",
            "bro just discovered the other type of comp sci students",
            "When you realize you're gonna be sitting at a computer for school, work and recreation, you begin to worry about your health",
            "Idk bro I’m the only muscled up guy in my classes",
            "Healthy mind in a healthy body my friend.\n\nJokes aside, my cs classes had 2 guys like that. One regularly did weightlifting competitions.",
            "Servers can be heavy.",
            "People are finally starting to realize that if you have a desk job you need to train your ass off, or at least do some exercise.",
            "Men adapt to their changes and surroundings. If women today seem to prefer those types of physique then that's what the young men will put more effort into.",
            "I think a lot of the self improvement YouTube gurus might contribute to this a bit",
            "I've no idea tbh, ever since I started my degree, I felt compelled to start exercising out of nowhere.",
            "For what it's worth, many electrical and computer engineering folks switch to comp sci if they can't cut it in ECE, it's the most common fallback major where I went with some sort of business degree being the other common one. Not to mention the computer engineering kids who made it took nearly enough comp sci to minor just as side electives out of necessity so they were mixed in with the comp sci people most of the way regardless.\n\nOur engineering classes were initially more like half and half in well rounded often athletic types and pure nerds, so maybe they are polluting things lol.",
            "Sounds like a positive development",
            "Maybe all the typing from\nProgramming for their forearms on swole",
            "It’s j a w combo what can I say",
            "as a brogrammer myself, I’d rather cope with my pain in the gym and not spend my internship money on cocaine.",
            "When sitting in a computer and coding all day, going to the gym keeps us active.",
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)\n\nAverage CS major",
            "I think its really obvious, the crossover is the DEEP ROOTED perseverance that both require. Some people need instant gratification… CS is NOT the place for people who need instant gratification lmao",
            "Can’t begin to explain it, but for some reason a lot of bros take to cs. It use to be AeroEng but seems like that same crowd has shifted over to the cs side.",
            "Bro, never skip brain day.",
            "I don’t have any of these guys at my school haha, my program is all grease goblins",
            "You are probably referencing a prestigious uni or college. In general, the noodle arms is exactly the description of an SWE / CS grad.",
            "Wassup I’m one lol 😂",
            "CS requires the best athletes OG",
            "Blue collar workers who want out of the industry and stop destroying bodies, want something easier and less hours that can provide for families and have more family time finally",
            "I feel the same, I have my bachelors degree in school of management, and I learned computer science in my masters degree, those guys are very tall seems like with mussels under the clothes, male hormone…",
            "Someone sounds insecure.",
            "I think there's a thing going around that lifting is healthy for body and mind. Also bros are everywhere.",
            "CS was viewed as this nerdy thing back in the early 2000s. Now you can find anyone getting into it even \"gym bros\". Theres no gatekeeping mentality as there was in the early days.",
            "Programmers are all about optimization. This applies to all areas of life. Including fitness and nutrition.",
            "What school you going to?? This is not typical from my experience …",
            "r/moreplatesmoredates",
            "Probably optimum tech fans",
            "exercise = better brain = less bugs",
            "weakest roblox player",
            "its becoming really unfortunate magnet for idiots who are inspired by people like elon musk and simply want the paycheck. typically jerk each other off on twitter/linkedin/etc. as opposed to actually developing skills and feel completely entitled to immediate success."
        ]
    },
    {
        "post_id": "1bidnk2",
        "author": "Rare_Reporter_4434",
        "title": "Me and my boy just got offers at the same company! Never give up 🙏🏼",
        "url": "https://www.reddit.com/r/csMajors/comments/1bidnk2/me_and_my_boy_just_got_offers_at_the_same_company/",
        "score": 1527,
        "num_comments": 39,
        "created_utc": 1710829426.0,
        "selftext": "We just both accepted offers last week at chilis for a front end and back end position. He’ll be a front end developer waiter serving tables to the front. \n\nI’ll be in the backend cleaning dishes. \n\n\n\n",
        "permalink": "/r/csMajors/comments/1bidnk2/me_and_my_boy_just_got_offers_at_the_same_company/",
        "comments": [
            "Remember to load up a full stack of plates!",
            "Full snack developers",
            "so inspiring! I just applied to be at the backend of Wendy’s, but for some reason the job description didn’t mention anything about me being inside the restaurant itself. I’ll see y’all out back!",
            "You guys are honestly scaring me",
            "Dreams do come true 🥲",
            "Glad to hear it. I’ll be working as a backend Java intern at Starbucks",
            "🤣🤣🤣🤣",
            "We need to scare away potential cs students, who are going in now lol. Keep the posts coming 😂.",
            "Congratulations",
            "Lmao, if this is a true story, awesome sense of humour.",
            "🤣🤣🤣🤣 geeeeeked",
            "Most CS students would end up with PTSD if they attempted to do a single busy service as a restaurant dishwasher",
            "sauce me a position asap",
            "LMAO",
            "Good one 😂😂😭",
            "This was so funny my awesome blossom came out of my nose!",
            "congratulations and fuck you",
            "Front end and back end:  who is taking it in the back end?  lol",
            "Am a full-stack developer at subway !",
            "You got me",
            "You had me in the first half, ngl 🤣🤣🤣. Given the market situation, it's so bad. 😭",
            "For a sec I was happy for you and then I read the rest. Laughing and crying at the same time..",
            "Full stack of pancakes at the diner with a side of Java",
            "Lol to this!",
            "Congratulations.Im a full-sub dev at subway.",
            "Just stopped my leetcode grind for the day. Came to Reddit. Went back to the grind.",
            "I hate this sub"
        ]
    },
    {
        "post_id": "10xhx20",
        "author": "BrenoFaria",
        "title": "It finally happened",
        "url": "https://www.reddit.com/r/csMajors/comments/10xhx20/it_finally_happened/",
        "score": 1503,
        "num_comments": 108,
        "created_utc": 1675907457.0,
        "selftext": "My roommate (business student) and his friend came to me with their app idea and wanted me to code it 💀💀",
        "permalink": "/r/csMajors/comments/10xhx20/it_finally_happened/",
        "comments": [
            "\"No, we're not paying you, but you can use it as experience.\"",
            "\"it's like uber but for chimichangas\"",
            "Facebook 2.0",
            "Did u sign NDA before listening to their idea",
            "Imagine Uber but for Dogs!!😱😱😳😳🤯🤯",
            "\"you can code it and i'll handle the business side\" (there is never a business side)",
            "It worked out well for Zack Zackerberg with Facebook.",
            "well they're on their way to become the next nameless rowers, and you're gonna be the next zucc. Please add horny avatars to metaverse 5.0",
            "If i had a nickle for each time that happened to me, i'd have 2 nickles. Which isn't a lot, but it's weird that it happened twice",
            "This happens to me atleast once a week. It’s getting ridiculous. Mfs in business school watch The Wolf of Wall Street once and think they are going to take over the entire US economy.",
            "I'd agree and bullshit them while building out a competing product using funding from your best friend...but that's just me though",
            "Me: a double major in business and computer science",
            "stonks",
            "Tell your roommate to go find 3 paying customers first, and then come back.\n\nIf they validate the idea, then congrats, both of you are on your way to having a scalable asset.\n\nIf not, then you didn't lose any time of your own, so no risk to you.",
            "[deleted]",
            "Can we hear the idea?????",
            "Why is everyone an asshole about this? It’s happened to me too and I saw it as more like a compliment. Obviously they don’t study cs so just explain to them the amount of work it would take to get them on the right path?",
            "Better have them sign a contract that includes a stake in the company as payment for your service. Use your leverage to make a good deal for yourself or they can ask someone else.",
            "this is why the business majors started studying cs themselves…so they wouldn’t have to ask cs kids for help",
            "So if I go to an accountant to do my taxes…?",
            "Just tell them to use ChatGPT",
            "This is one of the most entertaining comment sections I've seen in a while loll",
            "Son of a b* I’m in",
            "LMAO",
            "Haha I did this to my friend, except it’s a game that I’m doing all the art for.",
            "“Don’t worry homie, we’ll be rich! You’ll get tens of dollars from this and resume material! Why do you look mad? We did all the hard work thinking it up.”",
            "Rite of passage. You’ve made it BrenoFaria",
            "Imagine Spotify, but for ✨ deaf people ✨",
            "Let me guess...it has to do with automated balancing checkbooks and financing and taxes right? Automated finances correct?",
            "Tell them u are still in 100 level classes",
            "That is not necessarily a bad thing, look at what mark did with facebook.\n\nIn my opinion at our learning stage it is good thing to lurk into these projects to advance our skills to create something.",
            "u/higpt whats going on here",
            "Haha same thing happened with me",
            "You're slightly mad ?",
            "Just pull a zuckerberg on them 🗿",
            "The rite of passage",
            "Waze but for boats",
            "Do it under the condition that you are one one of the co founders",
            "*”Hand Covers Bruise” softly plays in the background*",
            "Social network 2.0",
            "LOL",
            "What was it?",
            "."
        ]
    },
    {
        "post_id": "1bgytqm",
        "author": "jvyzo",
        "title": "IYKYK",
        "url": "https://i.redd.it/ov52j37smwoc1.jpeg",
        "score": 1494,
        "num_comments": 118,
        "created_utc": 1710685666.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bgytqm/iykyk/",
        "comments": [
            "We are the new faces of unemployment",
            "“I love inside jokes. I hope to be a part of one someday.”",
            "Me who's gonna start CS in 2024",
            "What's the joke?",
            "are we gonna have the same outcome for comp engineering as well? Cuz i heard that the semiconductor and embedded systems industry is gonna be booming in a few years...",
            "\"roast me\"",
            "What's the joke?",
            "Now artists, coders and Philo students can all hold hands and cry about being unemployed.",
            "[deleted]",
            "This subreddit is trash",
            "👨‍💻",
            "Dw guys, mcdonalds is always hiring",
            "By dumb luck I abandoned the ship before it started sinking.",
            "Finding a job in the year 6.460263446 E+5814 will be quite difficult indeed",
            "This sub is a shit hole.",
            "Nah, I'll win :P",
            "At first glance I thought this was DMX 🤣🤣🤣",
            "Sigh another soon post i guess?",
            "learn 2 weld",
            "Awww c'mon guys.  I'm like 39, know every relevant language under the sun and shit software rainbows out of my ass.  Aren't some of you supposed to be replacing my old ass?\n\nWheres the fire?\n\nI had a kid with a masters degree who couldn't network his way out of a paper bag.  I'd be worried about chatgpt too if I were this guy.",
            "Best of luck!!!",
            "bro looked like all he had to do was follow the damn train",
            "Guys is it really over? Like be honest",
            "My memes made it to cs reddit😭beautiful",
            "I’m graduating in 2024…. getting my MBA 2024-2025🙂‍↕️",
            "You might as well have gotten a philosophy degree."
        ]
    },
    {
        "post_id": "1874vx4",
        "author": "mangos5",
        "title": "Graph of my job search over 7 months",
        "url": "https://i.redd.it/7z4sjbemrd3c1.png",
        "score": 1493,
        "num_comments": 98,
        "created_utc": 1701304467.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1874vx4/graph_of_my_job_search_over_7_months/",
        "comments": [
            "I have a few questions if you don't mind...\n\nHow long did you spend on your whole job search?\n\nHow long did you spend on each individual application? Did it vary?\n\nAnd last one, what did you do in the meantime? Did you work another full-time or part-time job? Did you do certifications? Any coding practice?\n\nThank you, I'm an aspiring developer and I'd love to know what others are doing on their job searches.",
            "💀",
            "You’re a dedicated dude, congrats on getting to the finish line.",
            "Good shit man. What’s the new TC?",
            "Domestic?",
            "is it unusual that the percentage of interviews that resulted in an offer is *way* higher than the percentage of applications that result in an interview? if you’re good enough at interviewing that you get offers for like 20% of them surely you’d be doing better than getting interviews for like 1 percent of the jobs you apply for",
            "Were you applying for roles you were actually qualified for ? \n\nI know some people just sort by quick apply and fill out a box",
            "this is somehow motivating. and the rescind is just funny LOL it's like they knew and bothered to get back to you and take back their offer. thanks for sharing :))",
            "Accepting 2 jobs!! Wow, congrats! How much is the total pay then? And how are you gonna handle both jobs?",
            "Where did you find jobs to apply like websites etc. I’m struggling to find them tbh. And did you only apply to entry level or also mid lvl positions?",
            "I have a few questions if possible \n1. What is the job role \n2. What type of previous experience did you have?",
            "Can you share the story about the rescinded offer?",
            "That's like, six applications a day. Good job.",
            "No offense or anything but do you know why it took that many apps",
            "What’s your resume if you don’t mind sharing?",
            "Into the 5th month of my search, commenting to hopefully get the same success some day soon",
            "Software engineer with 5 years of experience. I've been looking for a new job with the hope of getting a promotion since my current organization is laying people off every so often and all possible promotions are frozen.\n\nI don't keep track but I've submitted 100s of applications and have landed only 2 interviews since March. I didn't move forward to get an offer even though I felt perfectly qualified.\n\nI guess what I'm trying to say is that the market is awful right now for this field and for all of you coming in fresh, you better be ready to either be super lucky to land something or join everyone else in the struggle.",
            "Jesus. And here I thought my 30 apps were a lot",
            "Mine looks very similar, congrats!",
            "How do you make this graph",
            "Are you an international student?",
            "pov: applying to jobs today as a comp sci major",
            "I've applied for 3 jobs in my life and got offers from all 3",
            "Can someone please tell me where are these stats coming from ? What is the platform ?",
            "Which app",
            "this is FAR from normal. As a dev with a good looking CV, you will get a job after 2-3 tried. This is insanity.",
            " Could you DM me your CV?",
            "How do you manage to track all of these ?",
            "Wtf",
            "Can you dm me your resume please 🛐",
            "Which platform make this type of graph?",
            "Check PM’s🙌",
            "Do you mind sharing which all websites you used to apply for jobs? LinkedIn, indeed?",
            "Holy fuck dude I’m like insta depressed looking at this.",
            "How do you keep track of all the applications",
            "Out of curiosity did the offers come at the same time?",
            "Where are y'all getting these graphs from?",
            "What is this platform/graph called?",
            "What is this platform/graph called?",
            "Shit man I’m rly not doing enough lol",
            "Did you submit with a portfolio?",
            "1/1217 huh? I guess it's prime time to change career",
            "I applied to almost 600 and got 2 interviews I know the struggle ☹️",
            "Also r/overemployed I see. Nice. I wish I could snag those remote jobs.",
            "Not sure if you'll respond because I'm a bit late, but did you have to do this manually? Or did you write a script of some sort that plugged in the info of you applying to each job?",
            "HR needs to have a cut-off for the first 50 qualified candidates only. this also should be for other fields as well."
        ]
    },
    {
        "post_id": "sr12wz",
        "author": "AllinTheSauce",
        "title": "Here’s the truth, sorry if I sound mean or jealous",
        "url": "https://www.reddit.com/r/csMajors/comments/sr12wz/heres_the_truth_sorry_if_i_sound_mean_or_jealous/",
        "score": 1467,
        "num_comments": 185,
        "created_utc": 1644699525.0,
        "selftext": "I fully expect to delete this post Bc of the backlash I’m going to receive. \n\nBut I want to preface by saying this is a community, we’re everybody helps everybody so we all succeed or put ourselves in a better spot as a result of interacting with others in this community. So although this  is ganna sound like a person bashing CS, I’m not but people need to broaden their horizon.\n\nYesterday in class kid to my right had tears down his face in the middle of lecture, just to be a good person I asked if he was alright and needed anything, he told me he didn’t get an offer from Meta which he was expecting. I told him shake it off, it’s not the end of the world, plus it’s Friday so after lecture you can hang with your friends and go out and stuff. After he hear those words come out of my mouth he just went silent and said he is solely focused on job searching and that non of that “irresponsible hooligan stuff matters”. I stopped talking to him because I got annoyed for a second. By the way we are only sophomores lol.\n\nFirst of all there is more to life out there in computer science people. Finding friends, hobbies, or things that you enjoy doing is almost as important to a person then just some computer science internship. Go out with friends at night, meet new people, go enjoy life. Sitting inside until you land a VP job at Google is not healthy, I respect the grind but there is more out there. \n\nI also wanna say this, if your not an upperclassman, you should have zero expectations to get into these companies. Aim for small or mid companies just to get experience, it’s so early in our lives that it’s better to start building from small companies to get the experience to work at the big ones.  \n\nIf your in a place right now where u have things outside of computer science then your doing great, keep it up. For those who won’t rest until they work at a company with 500k TC, I respect the grind, but take a step back when you feel down and go do something fun, and will probably bring you more joy.\n\nJust remember this, nobody on their death bed said “wait let me write one more line of code”.",
        "permalink": "/r/csMajors/comments/sr12wz/heres_the_truth_sorry_if_i_sound_mean_or_jealous/",
        "comments": [
            "No backlash from me.  for touch_grass == True....",
            "People put the pressure and expectations on themselves. There are more important things in life than prestige and salary, and it's sad that most people don't realize that until after they're already adults",
            "Don't delete the post, I'm sure many people need to hear this",
            "Lmfao “hooligan stuff”. That kid needs to understand leetcode isn’t real life. In an interview and in the actual workplace being a relatively personable and sociable person matters. You also need those qualities to help build connections if you want to progress up the ladder.",
            "I wouldn’t take it personally OP. Society puts a lot of pressure on people to be perfect and he’s obviously not in a good headspace at the moment.",
            "A hint - you're actually more interesting to employers when you have good social skills and evidence of a rich life.   I know so many people who took a \"dream\" job and left it within 2 years for something else.  No one employer is worth that much drama.",
            "Aww that’s sad but you never know what kind of pressure he’s under. Maybe his family needs financial help and they push him? Or he pushes himself. I have a friend who paid for his single moms home by going into this field. Your school mate sounds like he grew up in poverty, possibly.",
            "Some of this grammar is killing me!\n\nJkjk. But you are right. If my non-internship @$$ can land a job then yall can too. So don’t sweat it.",
            "I am aiming high, I failed two FAANG onsites in the Fall because of lack of preparation but I'd love to work for a company like Google or Apple. So this year I made a change and do leetcode almost every single day to strengthen my chances for when I apply again.\n\nThis being said, the question I always have for people who care about TC and prestige to the point that they have no hobbies outside of their work, what do you want the money for? Is the money just there to sit in your bank account? And if so, what's the point of making it? These are rhetorical questions I even have to ask myself everyday and I think a lot of us who are in the grind of looking for the best \"prestigious\" situation need to think about more.",
            "Funnily enough, I started doing better in school once I stopped caring so much about my grades. Spending 8-10 hours a day studying on top of overloaded semesters, and pulling multiple all-nighters in a semester got me kicked out of my school's honors program because I was just stressed and on edge all the time and I performed horribly during tests and stuff, resulting in a massive GPA drop. I think prioritizing other things was a big stress reliever & then the little bit of time I spent actually studying/doing schoolwork was more efficient, stress-free, and almost enjoyable.\n\nI also realized that even when going out with friends or even just chilling, I was still learning things about life, just not from textbooks. Learning how to manage my money during a weekend when I had fun stuff planned, how to be street-smart, how to comfort or distract a friend going through a hard time, or even how to relieve my own stress are all equally as important as learning to code or doing well in classes imo.\n\nThere are 168 hours in a week, and 40 hours of work per week means that just over 75% of your time per week *isn't* spent at work. There's so much you could be doing in that huge chunk of time to destress, relax, develop new interests, and just become a more well-rounded person in general.",
            "Don't delete; a lot of people here are obsessive over FAANG to the point where they'll bash on PIP (rightfully or not) without having a single clue what ISO9001 compliance is. Context, and considering opposing viewpoints are key to growth.",
            "Well said. I am in my early nearing mid 30s in a totally unrelated career trying to transition into tech. Anyway, as someone older than many of you, I stress to you all to see the bigger picture in life and it is not money or titles, but your relationships with people and experiences. Career goals are great, but it will all mean nothing if you are devoid of happiness because all you do is work. Stuff doesn’t go with you, experiences do.",
            "This kid is gonna wake up some day and he's going to realize he wasted his life doing this stuff\n\nI was that kid",
            "Replace \"Meta\" with \"anything\" and you have people in my category.",
            "Small companies are way underrated on here. You can get so much interesting and varied experiences if you are THE intern in the office vs being 1/1000 new recruits competing for time, attention, and full-time offers.",
            "1. Good on you for noticing and offering a few supportive words. The world could use a few more good classmates like you.\n2. I'm an old. I'm saying this to help you: please get comfortable with shooting for the stars and missing sometimes. It's an incredibly healthy, normal part of the process.",
            "Sophomore?? He has more than a year before he needs to worry about applying to new grad jobs. Sigh poor kid but sophomore year is when you first take intro to programming and are most likely not ready for those interviews yet anyways. Focus on school, start worrying about the new grad jobs end of junior year.",
            "Lol i feel bad for the kid, dont delete this. You are right, life is more than just a job. They will realize it eventually.",
            ">If your in a place right now where u have things outside of computer science then your doing great,\n\nYeah, I do crypto trading on the side! It's such stress relief.",
            "As a 32 year old going back for a degree is CS I agree. Life is meant to be lived. There seem to be many good jobs in the field. Don’t worry yourself to tears.",
            "Nice try OP. Never slow down the grind, give me 400k TC new grad or give me death",
            "This is exactly what I always reply to the toxic freaks in this subreddit. Do these people not have anything better to do than sit in a corner all day filled with anxiety hoping that Google reaches out back to them with a return offer? \n\nBefore I went into CS I was really hoping that most of the stereotypes you see online were the minority, but oh boy was I wrong. Toxic CS fanboys (yes, that's what I call them because they are no different from console or car fanboys. They jerk off to their favorite FAANG company) are way too prevalent in this industry. They are arrogant, love to look down on others who don't have the same knowledge they do, and somehow think that getting into FAANG will get them laid. \n\nI 100% understand the argument for creating generational wealth through a job at FAANG and being able to live comfortably, but going about it the way they do is only going to mentally destroy them, once they realize that nobody is impressed that they joined FAANG, other than the jealous peers and their parents. Joining FAANG won't get you any pussy, it won't get you any meaningful friends, and it is not a hobby. It's a well-paying 9-5, and that's it.\n\nAnd for anyone feeling down about landing a job, I have a friend who graduated from college 4 years ago and he got a job at IBM and recently joined Apple, making 6 figures. All without a single internship ever during his college life. We hung out all the time, played video games and basketball, went to the beach, and not once was he stressed. He took it at his own pace and now he's doing incredibly well for himself rn. \n\nI swear CS fanboys don't like to enjoy life, it's like they love staring at a monitor for more than 8 hours. Please go outside, go to the gym, form meaningful relationships, cause at the end of the day, all of your programming knowledge will be meaningless when you're on your death bed, and the only thing that will matter was every relationship and good memory you formed in your life. Go do something else outside of obsessing over getting X or Y job, you'll thank yourself for it, trust me.",
            "thanks!! needed this",
            "also an unpopular opinion: \nCS is not a personality trait",
            "Irresponsible hooligan stuff lmaooooo",
            "while mood == sad {\n\ntouch\\_grass();\n\n}",
            "There's nothing wrong with ambition. Having it means that failure sucks more, but you also push yourself to be greater. If you don't want to go far then you can lay back and chill, but let people decide how far they want to go on life",
            "In a way I hear him. I’m finally about to MAYBE up my salary from 40k to 75k, but I’ll still be barely scraping by once we redo our lease or sign a new lease almost anywhere in Vegas, a place that nearly tripled its rent prices in the last 10 years. It’ll soon be as if I never made it past a 30k salary.\n\nSo I feel for him stressing out over getting a job that’ll keep his head above water for the forseeable future, because soon even 100k won’t cut it unless you wanna live in a deserted village in Arkansas or something.",
            "[deleted]",
            "They just lost a quarter trillion in market cap last week. By next year it might not be the place everyone wants an offer from.",
            "You’re exactly right.. and you’re only sophomores?? I hope that guy is alright",
            "this is important.",
            "i go to a state school notorious for parties, so most people here are very chill, but when i meet people whose lives revolve solely around CS, i can’t help but feel bad for them because most of the time it comes from a place of social anxiety/social isolation and not often by choice",
            "Saw this and went right out to hang out with my guys. Thanks!",
            "Its funny, I don't even a degree in CS but i'm in here to read advice basically because I'm trying to get into the field without one basically. But I find it really silly how some people can get so upset over not getting a job where 100s of others applied.",
            "I would imagine being depressed when you finally land the job and being like…”this is what I sacrificed my youth to get?”",
            "This isn't only a problem in c.s its just a very obvious problem in it because a lot of people that go into it tend to be, well nerds (sorry but the stereotype exists for a bit of a reason) so when you have a crowd that's already not big on having super large groups of friends or into large social scenes, and then give them the idea that if they grind away there time on some really specific tasks they can get well off economically then there gonna do it because there thinking once they have money then they do the fun stuff.",
            "I work in tech interview a lot of people like the person you’re describing—they’re hard to hire because they are usually myopically focused on their own success, and in the end they tend to struggle in their role because they can’t relate to other people. \n\nYou can’t be an effective SWE if you don’t know how to work on a team, listen to and provide feedback in a constructive manner, and even make small talk with people to build social capital to move your career forward. Those are things you learn from hanging out with people socially and becoming comfortable around others. \n\nI wish more candidates would take a page out of your book because you’re 100% right.",
            "I don’t care how much $$$ they offer - Meta has scummy business practices and I wouldn’t want to work there.",
            "If(socialLife == 0){\n\nSystem.out.println(“No hooligan stuff on weekends ever”);\n\n}",
            "This facts, plenty of people in CS need to get some bitches",
            "[deleted]",
            "How do u sound mean or jealous lol? And I dont see where what you said would lead to a backlash",
            "There's no point working for TC and nothing else in life. \"Irresponsible hooligan stuff\" is what we live for. There should always an equilibrium between striving for our dreams and enjoying our life. The kid next to you may end up in Google for all we know but would that be a life worth living? I wouldn't be jealous.",
            "people sometimes forget that experience is what matters in life. Part of life is living it! and not just being a hard working robot all the time. it's vital not to set unrealistic expectations for yourself. Just live! If you're smart, which you probably are if you've made it this far, you're gonna do fine in life. If not better than fine :)",
            "I know for me at least money has always been a pretty sensitive topic and I’m trying to get better with it. When I think of people making more money than me, I think “wow that means they can retire early or live more comfortably or splurge more on luxuries like travel without having to worry” and i make it a big competition in my head that money equates to that success when it reality that isn’t true. Everyone has different paths in life it doesn’t always seem fair but what’s more important is that everyone is happy and thriving in what they do in some way",
            "Amen",
            "Bruh I can’t believe there are people like that",
            "I applied for 450+ companies, hardly got 10 OAs, never got a face-to-face round. I never felt bad because I know I can succeed anyway.",
            "Legit",
            "I completely agree with what you said. But, being the guy who went without an offer for a long time, I can say that it is really easy for the outsiders (people who have things sorted already) to say \"chill\" while you have these unsorted things and imposter questions tormenting you back of the mind. I'm pretty sure he must have said that \"irresponsible hooligan stuff matters\" out of the same frustration. :)",
            "Having no life out of cs is so self-destructive. I’ve heard of only a few people that have truly no lifed cs and had a great career after, but for the most part they all burn out.",
            "While I am of the thought that life isn't just compsci, I do feel for the guy because he probably trained his butt off for this. Idk, I was in his shoes a couple of years ago, and the reason I cried was because I sacrificed a lot of relationships and \"hanging out\" in order to get in to college, and none of it felt worth after I got rejected from so many. If there's one thing I learned that I can pass on to this guy, it's that when you prioritize smth, you're revolving your life around it, and so far, I've been living college life putting my priorities into a number of things.",
            "Why would someone backlash at this? I felt the same way when i was getting turned down untill I stopped giving a damn. If i get the offer, great if I don't, also great. I got so relaxed that at one point it felt like I was doing these companies a favour by getting up for interviews. It was then when I landed an offer in a very nice cultured company or so Ive heard, ive yet to start my internship with them.\n\nAlso don't forget the amount of nepotism a.k.a networking this field has. Also don't forget how biased some recruiters can be. One company literally hired only good looking girls from my college. It was disgusting. So if you try your best and get rejected, don't blame it on yourself everytime, think about it carefully.",
            "I’m worried about having to deal with such people in the workforce. Really don’t want to work with a bunch of overachieving hyper-competitive no-life weirdos",
            "Needed to hear this a bit. I recently received an internship offer with great pay but the potential salary for full time is a little less than six-figures. Going on here and CSCQ and seeing new grads getting return offers in the six-figures made me question for a moment if my internship is even good. Thankfully, I’ve mostly broke out of this thinking but it’s so crazy how coming here and CSCQ and the general competitiveness of the field can be so toxic. \n\nI’d be completely okay with a return offer of less than 6-figs if that means I can still enjoy other aspects of my life instead having to grind and burnout. There’s always an opportunity to pursue it later.",
            "[deleted]",
            "Gtfo loser i make 400k as a fresh grad with over 25k leetcode problems solved and 4 top conference papers published.",
            "the reason that this is here is exactly why more good peopke are bit in coding...you are one of the reasons. Elitism. I came from extreme poverty. Isolationism is the only thing that saved me from that toxic enviroment. this post needs reported into oblivion. This is how a bad person is. Priviledged. In anti work and in recruiting hell this has always been reffered to as priviledged people that dont need the money can always get hired first because of bot being isolated by poverty.",
            "yes everybody has to enjoy only the things you enjoy and if they don't they're wrong",
            "[deleted]",
            "you're\\*",
            ">But I want to preface by saying this is a community, we’re everybody helps everybody so we all succeed or put ourselves in a better spot as a result of interacting with others in this community\n\nI pulled up to this community, so I can 360 no scope these FAANG internships. Honestly, idgaf about what u/sendmeanimetities or whatever weird mf's do. \n\n>. So although this is ganna sound like a person bashing CS, I’m not but people need to broaden their horizon.\n\nok, this is your view of the world that people need to have \"broad horizons\". \n\n>First of all there is more to life out there in computer science people\n\nok, that dosen't necessarily mean you should indulge in it. \n\n>Finding friends, hobbies, or things that you enjoy doing is almost as important to a person then just some computer science internship\n\nWhy? This is your personal view of \"importance\". \n\n>Go out with friends at night, meet new people, go enjoy life\n\nWhat if spending time on computer science helps you enjoy life? There is nothing sweeter than seeing an offer letter. \n\n>Sitting inside until you land a VP job at Google is not healthy,\n\nWho said you are sitting inside to get a VP job? You obviously don't understand how it works. In our society, being at that level buys almost anything you want including happiness. \n\n> if your not an upperclassman, you should have zero expectations to get into these companies\n\nWhy? A bunch of my friends were extremely talented coming into college (USACO, \"hacker\" culture, etc.), but upperclassman like you told them \"to chill  out\". It's a fact that when you see someone younger than you who was doing more at your age you feel threatened. There are 100% some underclassman who should god damn expect to get into these companies. I'm surprised that you haven't understood that age dosen't matter in the CS world. There are 13 year old's our there 100x better than me at coding. What do you not understand about that. \n\n>. Aim for small or mid companies just to get experience, it’s so early in our lives that it’s better to start building from small companies to get the experience to work at the big ones.\r\n\nWhy do you have to start at small companies first? why can't you hack a project together on your own? AWS, Databricks, etc. have all commodotized computing. It's never been easier to start a side hustle. On top of that, even if you don't have experience, starting at a big company is incredibly valuable since you can leverage it for better experiences. \n\n>If your in a place right now where u have things outside of computer science then your doing great, keep it up.\n\nThe fucking superiority complex that reeks off of this sentence is absolutely insane. I bet OP looks down at people who are successful by saying \"that they have no life\" to justify his own mediocrity. \n\n>Just remember this, nobody on their death bed said “wait let me write one more line of code”.\r\n\nThis is not true. In an interview with Andrew Ng, Ian Goodfellow (godfather of deep learning) said that he had a near death experience and that's when he started going 10x into his field. He lives an incredible life, making millions of dollars a year, doing something he loves, and as a side effect, he has an incredible happy family life as well. Source: ([https://www.youtube.com/watch?v=pWAc9B2zJS4&t=386s](https://www.youtube.com/watch?v=pWAc9B2zJS4&t=386s)).",
            "L",
            "You are such a clueless person.",
            "Lol. I failed the Amazon interview once, and I failed the Meta interview twice. And now I’m pretty sure that Apple is ghosting me after one interview. Right now I work as a senior software engineer but still I am doing just fine and I can try again later with other companies anyway.\n\nIt’s also a lot of good practice. Anyway the Facebook recruiter told me that sometimes people fail the interview more than once before they get an offer.",
            "Well said! Sure, working hard is important, but I agree that it shouldn’t be your sole focus especially at such a pivotal time period like college. It’s okay to relax and have fun! It might even help you get in a better, more productive state of mind anyways (I think it did for me).",
            "This makes me feel a lot better. I may not necessarily have an internship this summer (*cries* - at least I’m a sophomore rather than a junior ig), but I do have hobbies that I really enjoy and I have a boyfriend who is wonderful and I have like a solid 3 friends. And I could have a happy life if I didn’t make a crap ton of money. \n\nPlus I’ve been through a lot in life so maybe I should be more gentle on myself for messing up.",
            "Lol i watched a tiktok skit a while ago addressing this mentality kinda where some guys are just so focused on stacking money and retiring early (cs,investing, crypto,nfts etc).... and like for what to retire early and sit at your computer all day?? Alot of ppl miss the whole reason or dont even know why they are working in the first place. Good on ya for having a good work ethic and wanting to be successful but success means nothing if you're going to be unhappy or have such an unfulfilling life while doing so.",
            "Kid sounds like a good lmao",
            "Just for the record I intend to say \"just let me write one more line of code\" on my deathbed... could work right?",
            "Amazing mindset! Can’t agree more",
            "It's weird and ironic since OP himself seems to lack soft skills and empathy. If the person is crying, it obviously means the job meant a lot to him. Maybe it's his financial situation or family situation or just his passion towards the job, but obviously the person put a lot of effort. Telling him to just shake it off, isn't going to do anything. Moreover, if something is your passion, it's okay to be a little obsessed over it. Hanging out with friends?? I used to skip meals and sleep over my studies because I was working and studying so much. But I had to, because I couldn't be a burden to my single mom and I wanted to help her out as soon as I could.",
            "."
        ]
    },
    {
        "post_id": "1bn00fx",
        "author": "roguethrowaway0999",
        "title": "This gonna get me banned",
        "url": "https://www.reddit.com/r/csMajors/comments/1bn00fx/this_gonna_get_me_banned/",
        "score": 1458,
        "num_comments": 137,
        "created_utc": 1711325811.0,
        "selftext": "Yo stop acting like a motivational monk after getting a random offer. No one cares about your offers, just take it and go be a corporate slave. But stop flexing and bragging here if you have nothing of value to contribute.",
        "permalink": "/r/csMajors/comments/1bn00fx/this_gonna_get_me_banned/",
        "comments": [
            "wish i could give you one of my offers",
            "I get the frustration lol especially when you see META and only 10 applications submitted lol",
            "I've worked retail for 10+ years. It's so much worse than being a 'corporate slave' lol!",
            "Why is that the title",
            "“Go be a corporate slave” \n\nAin’t that your goal too pal?",
            "I'll happily be a corporate slave if I can WFH and make over $100k+ a year. No it's not ideal, but what other options are there for someone coming from a blue collar family thats just scraping by?",
            "bro is hurt.",
            "honestly refreshing post in a sea of doom (which I don’t even see, just people complaining about the doomers) and ‘motivation’",
            "Bro is the free thinker 💀",
            "I 100% prefer seeing those posts about people getting offers than seeing posts about how this field and everyone in it is doomed. Besides, the people who post about getting offers often give advice and I honestly really appreciate it.",
            "You popped lil bro",
            "someone is projecting not getting an offer lmao",
            "REEE only stories of 1000 apps and bagging groceries allowed",
            "What contributions do you consider to be \"of value\" then? Because pretty much the only other type of post on here is people talking about how doomed we are or how they're going to drop out/switch majors. \n\nI'm genuinely trying to understand if you prefer those over a few people trying to spread some hope and positivity 💀",
            "I am not impressed by just seeing FAANG job success stories, most burn out anyways. Now if you can work there and do max 40 hrs a week then thats a true success story.",
            "The same people who usually whine about someone being a corporate slave are the same people who would suck Elon Musk's proverbial cock if offered the same amount lmao.",
            "\"Your offers don't define you\"",
            "I get what you’re saying. Luck plays a big factor in landing something and people suddenly act like they have advice that no one knows about. It’s like those LinkedIn influencers that get followers cus they landed a FAANG internship. 😂",
            "Im gonna give you the advice I got when I got laid off. \n\nSTAY OFF REDDIT.",
            "Just stop following this sub if you're gonna complain like an ass. This sub has been like this for quite some time",
            "Just got my first internship offer and genuinely feel like a sage, wise man who now has to offer advice to any that ask",
            "Jealousy is the thief of joy.",
            "wierd form of bitter sour grapes but ok.",
            "fr man all these hoes being like \"you can do it\" is the same as me slapping my **** on the table and flicking you off",
            "fr its just humble bragging, people who won the lottery telling others how they did it",
            "COOK",
            "So you want more doomer post? Its good to have more post like that, give us more hope. Or you are just jealous?",
            "Morgan Young and Skyler Basco not be the most infuriating delusional slaves in Plato's cave be like",
            "For a second, I thought this was counter strike related",
            "Real",
            "Bffr they be here tryna sound humble and positive but they’re just making us rejects feel worse while coming off arrogant af😭",
            "Dude this sub has no room for positivity at all 😭 Tech career reddit is literally the worst part of Al Reddit",
            "That’s fair if you’d say the same for the doom posts, but if not, then tf? 😂 this sub is so negative",
            "damn, bitter...",
            "Very curious what you have done with your life to be saying this. You’re over 25 acting like you’re better than anyone who takes a 9-5 job. I also believe that you working a 9-5 is hell but that’s no reason to put someone doing so down. We need all types of people in this world. You just seem bitter, I did enjoy this tweet about you though https://twitter.com/reddit_lies/status/1734785353653879147",
            "I have more free time than many business owners and entrepreneurs. But I guess I'm the slave",
            "I agree that people shouldn’t brag but it’s also important that we get positive news here so people in the market can see that it’s not all doom and gloom. Also we’ve all been in that position where we were depressed in our search. It’s good to celebrate if you do land one. But I agree. None of that motivational BS. Getting an offer is about skill for sure, but getting an interview to begin with is mostly down to luck",
            "But those get all the clicks and upvotes.\n\nAnd tbh I'm not convinced most of them are even real. If you read them closely there are clues that they are fiction. Experienced engineers will pick up on those clues.",
            "Right on. If one dies a retired corporate slave there’s not much to be proud of.",
            "Why would this get you banned lol",
            "Let him cook.",
            "lol says the dude who can’t get an offer",
            "Foreal, goal is to escape slavery. Nothing proud about being a slave under one of these companies for the remainder of your lives 💯",
            "Very based",
            "Someone didn't land their dream job.",
            "Mood",
            "Nostradamus predicted that the superhero Spider-Man would thwart a world-ending crisis on March 32nd, 2256.",
            "Unpopular opinion but I appreciate the job offer posts more than the hundredth \"we're cooked\" post. All that negative was getting to me and a lot of other people.",
            "Let ppl celebrate man",
            "The irony in your statement",
            "Here I was ready to give good advice smh",
            "Hell nah i love the flex",
            "![gif](giphy|3ohhwBo4gMSdzmjJaU)",
            "Forgot to mark nsfw",
            "https://preview.redd.it/9ytgl5qa8jqc1.jpeg?width=224&format=pjpg&auto=webp&s=068237e90ebe5147592631aca3d4fe158d07c26d",
            "fr bro mfs posting abt their “faang” offers like amazon isnt hiring literally everyone with a pulse\n\ncongrats and move on dawg",
            "Ggs that was me",
            "Is this a shitpost? And is this the continuation of “I told a girl I’m a computer scientist”? ",
            "So, you’d rather only hear from people who never get an offer?\n\nPeople ask why this sub is a spiral that doesn’t reflect reality. Posts like this are why. \n\nYou are posting and saying that people who got jobs reporting back on their process is somehow not bringing value?",
            "This is you -> [https://www.reddit.com/r/GenZ/comments/1bfto4a/youre\\_being\\_targeted\\_by\\_disinformation\\_networks/](https://www.reddit.com/r/GenZ/comments/1bfto4a/youre_being_targeted_by_disinformation_networks/)  \n\n\nlike these posts cannot be real people",
            "Seethemaxxed and copepilled post.",
            "Lmao bro needs to learn how to be happy for others",
            "This is more worthless than 100x \"I got an offer\" posts.\n\nU mad brah?",
            "Glad some of y’all agree 🫡",
            "Yo this is gonna get me mass negative karma.\n\nSounds like someone's mad.",
            "You see posts like this, and then you fully understand why they have 100+ unanswered applications. It’s okay lil bro, maybe one day",
            "Bro does not do well in interviews haha",
            "OP needs an echo chamber to validate his deadbeat-ness.",
            "Damn bro take your mood stabilizers"
        ]
    }
]