[
    {
        "post_id": "18pqrxn",
        "author": "GroundZer01",
        "title": "Fuck this internship bruh",
        "url": "https://i.redd.it/nko07weq978c1.jpeg",
        "score": 1452,
        "num_comments": 100,
        "created_utc": 1703405045.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18pqrxn/fuck_this_internship_bruh/",
        "comments": [
            "Op reposting the same picture from over 100 days ago. Just do it already boi get it over with",
            "Update: no more internship :)",
            "I mean …. If you’re working for a company where an Intern has sudo authority to delete anything of meaning permanently…. They kind of deserve it.",
            "So did you rm rf the whole thing?",
            "r/WaysToGetFucked",
            "I think shitting on the floor at your desk would cause more damage than deleting everyone on a computer.",
            "Forgot `--no-preserve-root`.",
            "I did this by accident once on production. It ran until crashing when trying to delete the network files being used to keep my terminal open, and gave me just enough time to dump and export the database before the server totally shot the bed. I bought the office a bottle of liquor to say sorry.",
            "How's that lawsuit going?",
            "What even is this",
            "Is that an ssh session that allows... passwords?",
            "https://preview.redd.it/vrrw1vzltt8c1.png?width=1080&format=pjpg&auto=webp&s=38f6a65d8ca904841141fb4e4a160839f174cab1\n\nMan that didn't last long",
            "what am i looking at",
            "Imagine if you deleted everything, lmfao.",
            "The fact that I have sudo access to anything is way too dangerous. And why is it production servers but *not* my own desktop",
            "Is that Windows?? Ngmi",
            "Docker instance?  No worries.",
            "Make sure to add --no-preserve-root",
            "*",
            "--no-preserve-root?",
            "Lol that's nothing, i am about to do the same with my company's Production server ;)",
            "You’re helping them",
            "😂😂😂",
            "You’d liable to be sued and potentially criminally charged for deliberated destruction of company property."
        ]
    },
    {
        "post_id": "1b1pk7h",
        "author": "Professional_Gas4000",
        "title": "I found all the entry level jobs",
        "url": "https://www.reddit.com/gallery/1b1pk7h",
        "score": 1437,
        "num_comments": 300,
        "created_utc": 1709073929.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b1pk7h/i_found_all_the_entry_level_jobs/",
        "comments": [
            "Like 90% of the IBM people I work with are Indians so that tracks",
            "Man that’s wild",
            "American tech companies betrays its people and outsources all the jobs",
            "They can hire 20 Indians in 100k per year. They can't even hire 2 in America with that amount. Witnessed this myself.",
            "Same thing happened with Target. As soon as the their version of CTO become Indian they started to ship out ton of jobs to India, and slowing down the hiring in Minnesota. They always had entry level and internships, but not anymore.\n\nEdit: Also blame Section 174 for this too. Section 174 is causing most of the issue, but no one is realizing it. Write to your congress member about this at: [https://www.congress.gov/members/find-your-member](https://www.congress.gov/members/find-your-member).",
            "I still won't get a job in India",
            "No hate against Indians, I'm happy their hardworking is paying off for them but it's hard not to feel some type of way when you're entry level but there are no entry level jobs in your area. And it's not like you can just up and move to India for a job or else I would.",
            "And you think getting a job in india is easier than US? Dude, India is life in the hardest mode.😂",
            "https://preview.redd.it/elnctfimr9lc1.jpeg?width=1290&format=pjpg&auto=webp&s=c240830e44e42edc6f545b7c54b312a08eef964a\n\nIBM, lmao. Let’s check Amazon, an actual company: Roughly 1,700 jobs in the United States and 256 in India.\n\nAnd in your IBM example there’s nothing specific to SWEs; across the board all the hiring is in India.",
            "Indian here working one of these so called entry level jobs.\n\nThe annual CTC is 300k INR which is 3619 USD. People here saying in India engineers work for 1/3 salary.\n\nThey r wrong. If average salary in US in 60k then we r being paid 1/20th of that.\n\nThere is no tax on the above mentioned income as the government thinks the income is too low. We have the same problems as u guys.\n\nUnemployment & shit government. In my company last salary hike was in 2021. Ppl r quitting the company due to this but we have so many graduates there is always someone else to replace the person who has left.\n\nSure some ppl r making good to great money but they r like top 5% most of us r just happy to have a job in this economy. I was unemployed for an entire year after completing my Bachelors. I won't wish that on anyone.",
            "They did it for blue-collar jobs with China, they're doing it again for white-collar jobs with India. I hope people in the comments are civil and not racist against Indians. We need to direct the hate towards corporations not each other!",
            "IBM has a new Indian CEO so this is the inevitable destiny",
            "6+ yoe jobs are listed as entry level",
            "I can bet no indian wants to work at IBM in India cause\n\nShitty employee treatment\nLiteral pennies being paid\n\nBtw even in India there little to no jobs for freshers, as someone who has applied to 500+ posts",
            "I think Capitalism means companies choose profits over people where it makes sense. America is supposed to be a beacon of Capitalism and free markets. You either favor that or communism. Choose one, you can’t have both.",
            "You should also take a look at the pay differences between the countries for entry level jobs. Let us know if you are still envious",
            "IBM = Indian Business Machines 🇮🇳🇮🇳🇮🇳",
            "Hmm it’s almost like the push to make every job remote is having some completely predictable consequences",
            "My gf’s company outsourced a lot of work to India and the Philippines to save on wages. But now, all the work takes 10 times longer and is full of errors.",
            "yikes",
            "https://careers.ibm.com/job/19534452/backend-developer-gandhinagar-in/?codes=WEB_SEARCH_NA\n\n\nFound a role which is marked as entry level but requires BS and 3-6 yoe?? How the actual fuck is 3-6 yoe entry level good lord the market is fucked",
            "Capitalists when they send labor overseas and destroy the American middle class for short term profit: 🥳🥳🥳",
            "All of those jobs say they are entry level and yet they ask for experience",
            "tbh my experience applying anywhere lolol",
            "Lmao idk how the mods allow such posts. There's no content. Oh no, there are jobs in India and not in USA. Oh no what will we do, it's as if businesses care about profits only and they find cheap labor. Oh no why didn't India handle the fed rates so this wouldn't be a problem? Oh that was USA. Oh why did India not intervene when organizations were laying off in USA? Oops again India not at fault. The blatant racism and ignorance in this sub is unreal. \n\nUse your head, understanding a different perspective and a complex issue takes a lot more than just blaming other countries. Whatever floats your boat for your own countries/organization's mistakes. \n\nIndia isn't going through that much recession. It's evident India would have more jobs. What a dumb take.",
            "Stop shitting on Indians . Even for a single entry level job there will be 2k to 5k resumes applied . The level of competition and desperation to get a even a entry level job is insane in India.",
            "Outsourcing",
            "If it makes you feel any better, IBM gives about 4 lakhs per annum here. If you live in Bangalore, the rent comes out to be about 2.4 Lakhs and food comes to be about 65 k. It's a very low paying job.",
            "All the Data Science jobs are in Indonesia for some reason. I might just move 😭",
            "Msft expanded their operations in India too and offer more training and scholarships there too. But the mainstream still considered companies like that western corps lol",
            "Dawg i left india to move to the USA because India had VERY FEW job opportunities.",
            "5000$ an year salary. 100k = 20 devs. India.\n100k not even 1 dev. USA.\nIndians are willing to work for dirt and companies are taking advantage of it. Demand and supply.\n\nBefore that angry Indian runs in and tells me faang salaries, that's 0.01% of population. The average salary is still $300 a month.",
            "This is EXACTLY why I dont like Indian people. \n\nBunch of damn poop throwers.",
            "IBM is a shitty company to work for anyway. Of course they sell off their labour to the lowest bidder. \n\nWhen interviewing candidates, I put IBM next to WITCH companies as orange flags, because the majority of people from these professional backgrounds have a history of performing so poorly.",
            "And all the mid level jobs are from US/UK/AUS/CAN to fix all the fuck ups from the Indian workers",
            "It could also be due to an ageing society coupled with high cost of retiring in the more developed country, meaning the older and more experienced are not retiring, hogging the mid level and managerial roles. That’s why entry jobs are now taken up by 3-5 years experienced people.",
            "they are better at doing this gig, free market free movement of labor and capitol. they say.",
            "Theres no arguing against india being the next world power",
            "I'm glad that most indians don't speak German (yet), leaves enough jobs for us over here lol",
            "[deleted]",
            "I'm sure this thread will be productive, non-racist, and very insightful.",
            "To be fair. Those jobs will be killed by AI come 5 yrs anyways",
            "My fellow Indians unite 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳",
            "💀",
            "Everyone pushing for remote jobs led to more off shoring,. \\*shocked pikachu face\\*",
            "What is the problem ?",
            "It’s very concerning. I would say quality over quantity and although most cases it is true, I don’t know for how long we still have those 21 jobs. I work at Fortune 500 company and over 60% are offshore vendors which is insane.\n\nI don’t know what the end of this is? You’re effectively gimping your own nations growth by outsourcing everything, will this be replaced by AI eventually? \n\nEither way I think tech is in a pivotal place the next decade will make it or break it for tech. Either tech and companies replace us and competition for few jobs skyrockets or people are still getting hired as they are now in CS is still a viable field.",
            "That is a very bleak outlook",
            "Isn’t it a dead company with 2-3 projects and just hoarding ip?",
            "Maybe the new tax law will reduce outsourcing",
            "Bullet dodged with IBM anyway….",
            "IBM? You guys have have it, thanks",
            "and every entry level job or internship literally has 5000+ applicants for 1-2 vacancies btw (also with a shitty pay)",
            "Finish my degree then move to India?",
            "Finish my degree then move to India?",
            "Until they can find talent cheaper at least",
            "Just look at who their CEO is",
            "Quillbot loves to tag they are built in Chicago.\n\nTheir entire development team is remote workers in India and their main office is Disneyland compared to the little shit shack they have setup for Indian workers (again they work remote, so minimal investment in workers and you pay them fractions of what you'd pay seniors in the US)",
            "Entry level CS job in the US: 70000$\n\nEntry level CS job in India: 10000$\n\nYou can literally hire 7x the people in India with the same skillset.",
            "Companies benefit massively when it comes to outsourcing talent so its kinda understandable why they enjoy this type of hiring model",
            "Yup! That’s how it is. Let’s give them more tax breaks though.",
            "Yup, i know many companies that laid off a heavy amount of their work force so they can hire in India for only a 1/4 of the cost."
        ]
    },
    {
        "post_id": "rxqbvf",
        "author": "scarrlet_witch",
        "title": "What is the easiest question you’ve gotten in a technical interview?",
        "url": "https://www.reddit.com/r/csMajors/comments/rxqbvf/what_is_the_easiest_question_youve_gotten_in_a/",
        "score": 1440,
        "num_comments": 241,
        "created_utc": 1641506785.0,
        "selftext": "I will go first:\n\nCitrix final round\n\nThe engineer asked me to implement a function that adds 2 integers together and return the sum. We were using Hackerrank as the platform and the default code when you open it is literally a function that does exactly that. I was so confused and I asked him if the function on the screen is the function he wants me to implement and he said yes. So I just said it’s already implemented on the screen, then he was like oh okay, we are good then. Like WHAT💀",
        "permalink": "/r/csMajors/comments/rxqbvf/what_is_the_easiest_question_youve_gotten_in_a/",
        "comments": [
            "Fizz buzz",
            "[deleted]",
            "Microsoft phone interview:\n\nReverse each of the words in a sentence. For example “My name is Argus” -> “yM eman si sugrA”",
            "Reverse string for one final and isPrime(unoptimized was ok) for another final lol",
            "\"Find the minimum number in this array. Feel free to use standard library/built in functions\"\n\nIn Python there's a builtin called `min`. Passed that round. Didn't pass an HR round later on.",
            "U better tell me u got the offer after that",
            "Why can’t I get interviewers like that😭😭",
            "Two back to back interviews and both interviewers asked the exact same questions (all behavioral) 💀 not sure if that was planned",
            "I got asked to reverse a linked list. That question isn't that easy on its own but it's such a meme question and I've practiced it a bunch of times but for some reason I was getting tripped up by my pointers on the spot. I couldn't help but laugh uncontrollably during the interview at how ridiculous this situation was. Lesson is to always study the meme questions, you might actually get asked 2 sum, reverse a linked list, invert a binary tree one day",
            "a function that outputs numbers which can be divisible by 7 or 3 from the given array",
            "palindrome for a final round 💀",
            "For my Google interview, I was asked to delete every other node in a circular linked list. \n\nAside from one edge case (when you loop back to the beginning), you just make every node connect to the next node afterwards. \n\nI couldn't believe that was my interview question, and I thought there must have been a case or scenario I wasn't thinking of. \n\nBut nope, that was my interview.",
            "I got Fibonacci… and I forgot how it works.",
            "Basically FizzBuzz using the company’s name instead lol",
            "Meta interview: Valid parentheses. I think I got this question because my interviewer forgot he had an interview with me and was late by 40 minutes.",
            "Got amazon propel OA next week. hope i could get me a fizz buzz :,)",
            "microsoft swe first round: how do you know a string is a palindrome",
            "At a FAANG final stage interview, basically got asked (in a roundabout way) to implement BFS or DFS. Currently working at said FAANG.",
            "I got asked to convert a number represented as a string to an integer, like convert “123” to 123.",
            "Count the amount of vowels in a string. My dumbass count even do it on the first try… still got the offer tho 😎",
            "what the fuck",
            "count # of a certain character in a string",
            "Got rotate an array k times for my first ever technical interview - solved it and then got rejected",
            "I think FizzBuzz, but a close second was swap two numbers without making a third variable.",
            "Valid parenthesis for a FAANG",
            "Was given a recursive implantation of fibonacci and was told to memorize the function.",
            "Baby’s first BST;\n\nInsert, delete, search.",
            "1. Find number in an unsorted array and return index\n2. Is a power of two -> 1 liner solution cheese lmao",
            "Find the length of string and 2 sum. 2 sum turned into 3 sum tho.",
            "Difference between == and .equals",
            "Not me but my friend got mergesort which he literally practiced for shits and giggles like 2 days before the interview. So jealous.",
            "If online assessments count, two sum for a FAANG\n\nIf not BT Insert",
            "I got FizzBuzz, failed it and still got the job",
            "I got a question to add two floats x and y, but interviewer strictly told me to not to do x+y so i had to do elementary style addition",
            "“Hello world” -> “world Hello”",
            "Instantly weeds out the people who don't even know how to open the editor. The fact that it's worthwhile doing that means that a *lot* of people are trying to bullshit their way into a coding job.",
            "twoSum lmao",
            "I got a tree question that was asking is two binary tees are the same. And the other one was how can we know if a number is divisible by 6 without using ‘/‘",
            "Fibonacci sequence for Amazon final round lmao",
            "🤣",
            "bro what",
            "I interviewed for JPMC. \nThe programmer was a Java Dev of ~10+ years exp. She asked me to add two lists (arrays) together in Python. I just used List A + List B. She was shocked as she did not know this feature. ☺️\n\nPS: I have faced several rejections in SE roles. Please be nice in the replies 😅",
            "Easy for me because I knew it and it’s how I really grasped dfs and bfs but I got number of islands. I’ve actually gotten that question multiple times at faangs lol",
            "My Citrix final was just really basic system design with an alarm clock application, and I didn't even do it right (misused a HashSet in place of a HashMap at one point) but still passed. They took literally 2 months to get an offer out though so I accepted another one.",
            "For my Amazon final, I got Remove Duplicates and Valid Parenthesis, except it was only one parenthesis.",
            "Why do I get stuck with strings always? Just give me these garbage questions",
            "Amazon web services final round: how would you explain how the internet works to a 5 yo?",
            "Chevron internship\n\nImplement a function to calculate factorial. Then they asked me to do it recursively and only for even numbers(so factorial of 7 = factorial of 6 = 6x4x2).\n\nGot the offer",
            "Encode a string using different characters for the specified target characters and do it in O(1) space.",
            "\"what is a for loop\"",
            "Did you actually get the job? xD",
            "A simple F to C converter with a simple IF statement at GM",
            "Whats your name, Almost answered “yes good morning” cause I was so nervous 🥲",
            "string concatenation",
            "Fibonacci",
            "roman2int for Amazon final round 🤣",
            "I wonder if the dude interviewing you was baked lol",
            "Swap the values of two integer variables without using a temporary variable (Goldman Sachs onsite). Got the question but not the job lmao",
            "Salesforce final technical interview for internship. \"Write two functions. Given an excel column header as a string (A, B, ... AA, AB, ...) return the column number as an integer, and vice versa.\" Took literally 5 minutes of for-loops with a modulo and division and it was done. Got the job",
            "What's the difference between a 64 bit and a 32 bit computer?",
            "What’s the difference between a set and a list - asked by a big bank",
            "Two sum",
            "Island with max Area",
            "I've gotten 2sum twice at my company, once to get in and once to internally transfer lol",
            "Amazon\n\nInsert an item into a linked list at a designated position. Followup was how do you ensure you don't insert a duplicate. That's all I needed to get the internship offer.",
            "I got hello world in python in the final round for my current internship",
            "Dos you check for null and asked about requirements, such as must they all be always positive etc? Feels like he wanted a discussion? Dno",
            "I don't think that's how this problem should be viewed, it's actually a good question for checking fundamental understanding. \n\nThere can be a lot of cases, like: \n1. When you need to take very very large input and can't fit in and then you need to write code for adding two strings. \n2. Let's say you are getting a stream of input and you can't store in string then how would you solve.",
            "IBM technical interview: The sum of the digits of a number\nBloomberg phone interview: First repeating character",
            "What courses are you taking?\nWhat are you planning to do in future? Work or grad study?\nAnother question which lead me to talk about my personal projects. \nGot hired as an intern, I’m still there as a senior engineer in AI.",
            "How would I go about designing a simple minesweeper game. I had been working on a fun little minesweeper clone in my own time, so that was a good one!",
            "The interviewer and I went to the same school so he just asked football questions. It was pretty fun. Last round of technical interview was a Leetcode hard so I got rejected",
            "reverse a linkedlist",
            "The only technical question I got in the interview was “What is an API…”\n\nI got the job.",
            "\"What's your favorite programming language?\" I was being interviewed for a Jr C# Developer position. So I said \"C#\". Got the job and worked there for 9 months.",
            "Given an integer n, print out the “N x N” times table…\n\nUsed nested loops, got the offer",
            "I was asked the exact same question on a final round of interviews, I coded the function in a word document in like 5 seconds. I got rejected because they were looking for a senior level software engineer LOL! Some of these small companies are a waste of time",
            "How do I find this kind of interviewer",
            "I was once asked to write a program that prints \"Hello world\" LMAOO",
            "Piece of cake. that is so funny, tell me you got hired after this?",
            "« What’s your name? »\n\nIt was really simple!",
            "Find 2nd largest",
            "I got asked Kth smallest value in a list and then calculate the power of a number without using the powder function, but I somehow didn’t get the job. This was for Facebook and I am still surprised because I thought I killed it and I had the most efficient method",
            "Probably the standard \"what's the SQL syntax?\" or \"what's the difference between the WHERE and HAVING clause?\"",
            "Today just got the question valid parentheses from leetcode and got a 350k offer from that lol",
            "Switch the first and last elements in an array.",
            "Fizzbuzz",
            "Microsoft explore final round\n\nWrite a function that determines if a string is a palindrome\n\nWrite a function that determines if a number exists in an array",
            "My coworkers and I ask this all the time, and only one person has gotten it correct…\n“What’s the difference between hashing and encryption” we work in fintech handling lots of PII…",
            "What lol",
            "Write a function that prints hello world. Not kidding. Which was followed up with create a program that scrapes for the most reviews on every movie in the past 30 years currently on Netflix if they don’t exist on Hulu.",
            "."
        ]
    },
    {
        "post_id": "kpsf3x",
        "author": "freeteehookem",
        "title": "#Why does everyone on #LinkedIn type like #this?",
        "url": "https://www.reddit.com/r/csMajors/comments/kpsf3x/why_does_everyone_on_linkedin_type_like_this/",
        "score": 1433,
        "num_comments": 80,
        "created_utc": 1609706060.0,
        "selftext": "I **\\#get** it you really want to **\\#flex** your **\\#FAANG** internship offer, **\\#shitty**-**\\#ass** motivational meme,  or **\\#God** forbid your **\\#Coursera** completion certificate. \n\nDon't **\\#forget** to seperate each **\\#sentence** with a **\\#line** **\\#break**.\n\nLike this.\n\nWhile we're at it let's add a **\\#sob** story to invoke some **\\#sympathy**  **\\#reacts**.\n\n➡️ Let's also add some **\\#fucking** emojis into this **\\#bitch** 🚀🔥💯\n\n **\\#God** **\\#I** **\\#really** **\\#despise** **\\#LinkedIn**",
        "permalink": "/r/csMajors/comments/kpsf3x/why_does_everyone_on_linkedin_type_like_this/",
        "comments": [
            "Sometimes I end up on Linked feed while searching for jobs or checking messages and then regret it so much every single time. I never learn!",
            "bc linkedin is just a professional version of facebook",
            "Needs a bit more line breaks",
            "I don’t know what it is about LinkedIn that makes people feel so special. I get it if you’re a high traffic profile, you post some stupid drivel. But people I personally know post obnoxiously long posts about how the company they work for personally does all this amazing shit and how they are so blessed to blah blah blah blah blah. It’s grating.",
            "Which one of the users are you?\n\nReact with...\n\nClap: If you are the activist that use linkedin to share politic shit independent of your side.\n\nHeart: #If #You #Write #Like #This.\n\nLike: If you make things like this.",
            "People who make posts on LinkedIn in general 😂😂😂",
            "\\#because #they #want #to #get #more #followers",
            "Thank you. Thought i was the only one. Why is the linkedin crowd so culty and cringey?",
            "I’m not that pissed off by that, but the fact that every popular LinkedIn influencer ends every 2 sentence post with “tHoUgHtS?” just to boost their content in the algorithm makes me seriously consider never opening the app again.",
            "LinkedIn is nothing but a huge circle jerk",
            "I heard the LinkedIn posting cadence referred to as \"broetry\" before, and it's all I think about whenever I scroll through the feed.",
            "I once applied for a job where the posting had a lot of emojis. I knew I was in for a treat. The treat was a 6-step application and interview process which was more complicated and required more work on my part for a company of 30 people that payed less than my high school job. I did not give them any of my time past the first interview where I found it all out.",
            "LinkedIn is so garbage, sucks its so engraved into the hiring process.",
            "Solution: #LinkedIn and #Github shouldn't be used to measure anyone's competency. Period.",
            "LinkedIn is one strange fucking place I stg. And the scary thing is you’ll find yourself being more and more like them the more time you spend on that website",
            "Emojis got me lmao",
            "Fookin relatable",
            "You fell victim to one of the many classic blunders: you made a LinkedIn account",
            "LinkedIn makes me depressed seeing everyone my age with all their shit together getting amazing internships while I sit next to my list of 100+ sent applications with no offer.",
            "the irony of making fun of LinkedIn users while on Reddit is hilarious",
            "Basically it's for more reachable posts when someone searches for some topic, but LinkedIn dumb influences overdo it to seems like important post,\nIf you make a post you can see in the bottom there is a place to write your hash tag and this is the right place for it",
            "Linked in is useless, change my mind",
            "Have I told you about that one instance\n\nWhere I closed one door and opened another?\n\nI was in the bathroom when the dog hired me💩🐶☝️",
            "I suppose you don't use other social media platforms.",
            "Sincere question, Was there a time when LinkedIn wasn't as cringy as it now? \n\nThe idea of having a professional network seems noble, wonder what caused it to go downhill",
            "I #hate #linkedin too",
            "I thought I read a copypasta",
            "Damn, so many bitter folks on here. \n\nI never post on Lnkdn and I don’t think I ever will because, cringe, but let the cringers cringe. How else would we have entertainment.",
            "I use that methodology to express the post with hashtags that work with the message so there’s not also a long list of hashtags at the end needlessly elongating the post and adding extra data. This allows the benefit of the hashtags in extending the post’s reach, while also avoiding the look of an Instagram influencer’s post-authoring style.",
            "This needs more awards",
            "It’s called broetry.\n\nOnce I was down and tried my hardest\n\nThen I got knocked down again\n\nSo I tried\n\nThe someone gave me a chance\n\nBut I failed\n\nBut I kept trying\n\nAnd now I’m humble bragging about my $350k TC at google\n\nEveryone can try and fail, it’s those that luck out that win.\n\nhttps://www.fenwick.media/all-blog-posts/mastery/broetry-dead-broets-society",
            "Change the list of companies you follow and unfollow few people. Remember that 20/80 rule ? I made it in a way to target some engineering blogs and helpful videos. The system feeds more the stuff you like / follow.",
            ".",
            " #because its a #circle #jerk of #imbeciles."
        ]
    },
    {
        "post_id": "qhtqre",
        "author": "AlonePlankton",
        "title": "FAANG -> MANGA",
        "url": "https://www.reddit.com/r/csMajors/comments/qhtqre/faang_manga/",
        "score": 1438,
        "num_comments": 77,
        "created_utc": 1635446885.0,
        "selftext": "Meta Amazon Netflix Google Apple",
        "permalink": "/r/csMajors/comments/qhtqre/faang_manga/",
        "comments": [
            "DILDO: Deloitte, Instagram, Lowes, Docker, Omar’s Seafood & Grill",
            "If you are using Meta instead of Facebook, then why not Alphabet instead of Google?🧐",
            "MAAAM: Meta Amazon Apple Alphabet Microsoft",
            "TITS: Tesla, in n out, target, sbarro pizza",
            "FAANG: FAANG, Apple, Amazon, Netflix, Google",
            "FAANG -> NARUTO\n\nNetflix, Apple, Robinhood, Uber, Twitch, Optiver",
            "Replace Meta with Microsoft and you got yourself a perfect acronym ( ͡~ ͜ʖ ͡°)\n\nEdit: okay, apparently Facebook changed its name to Meta, which I didn’t know about. I thought Meta was some new unicorn used just to make this acronym.",
            "GAMMA: Google, Amazon, Meta, Microsoft, Apple",
            "i hate it",
            "ASS: Apple, Spotify, Shazam\n\nPENIS: Pandora, eBay, Nintendo, Imgur, Salesforce\n\nVAGINA: Valve, Amazon, Google, Intel, Netflix, AMD",
            "Gentle reminder - The hiring process is still hard. \n\nYou may now return to your LC. Thank you!",
            "LIGMA ; LinkedIn, Instagram, Google, Meta, Apple",
            "Worst thread I’ve ever seen in this godforsaken subreddit",
            "Why was it never FANGA, instead of FAANG?",
            "this is the way",
            "We're in the metagame now",
            "YES YES YES YES YES",
            "Lol that's what I thought 🤣",
            "FLESHLIGHT: Facebook, Lockheed, Etsy, Samsung, Huawei, Lenovo, IBM, Google, Hot Dog on a Stick, Tesla",
            "[deleted]",
            "Error: pointer \"FAANG\" has no member \"MANGA\"",
            "i prefer the anime",
            "The M in MANGA can also be Microsoft lol",
            "Why is Microsoft not part of FAANG?",
            "[removed]",
            "I would change the N from Netflix to Nvidia",
            "[deleted]",
            "When is it anime?",
            "Why are ppl ignoring the fact that Google is also Alphabet?",
            "Why is Netflix still included in this but Microsoft isn’t?",
            "The G-MAFIA as originally called y this lady writer on TWIT Podcast.",
            "I will still call it Facebook no matter what they change the name to.",
            "Facebook changing to Meta is the meme that keeps on giving",
            "Anyone have a rough estimate of how much of the internet is actually processed by these companies?",
            "AHHHHHHHHHHHHHHHHHHHHHH thx. i always read people working at manga and i was like wtf? manga? anime? otakus? what is going on",
            "."
        ]
    },
    {
        "post_id": "18yvl7f",
        "author": "anniexapocalypse",
        "title": "I did it!! New grad job search finally over after 2 months",
        "url": "https://i.redd.it/n9o4l2ag9jac1.png",
        "score": 1432,
        "num_comments": 149,
        "created_utc": 1704421921.0,
        "selftext": "Moral of the story is us normal people can do it, too! Also, girls can code too. 💅",
        "permalink": "/r/csMajors/comments/18yvl7f/i_did_it_new_grad_job_search_finally_over_after_2/",
        "comments": [
            "nice!! how often were you sending out applications and did you tailor your resume differently depending on the application?",
            "Congrats!!!",
            "Nicely done, the relief must be immense",
            "let’s fricking go bro that’s awesome\n\nhttps://preview.redd.it/bm8c64ws2kac1.jpeg?width=224&format=pjpg&auto=webp&s=bf340223688fdc88bf56c8a29f49884e230424a9",
            "Congratulations girl 🎉 you deserve it , I am manifesting this as well ✨",
            "Congratulations! Did you apply specifically through company sites or using LinkedIn/Indeed etc. I heard that people have had better luck getting attention from applying directly instead of a third party site",
            "1. When did apply for the job you got?\n2. Do you have specific skills or experience that align with the job you got?",
            "Where do you guys make this application tracking thing?",
            "Girls can code too? Some of the best programmers I've worked with were women!",
            "Finally some good news 😁",
            "all it takes is one !",
            "No, no, you're not doing it right. In here we only send out 3500 applications and get one phone screen because everything is fucked and the industry is hopeless.",
            "What company?",
            "Congrats!!!! Happy for you.",
            "What were the requirements of the job you got? Was it a new graduate role, junior or just a regular software engineer?",
            "Congrats! Did you have a lot of internships under your belt?",
            "Hell yeah, congrats!",
            "congrats keep it up",
            "Nice. You know you're going to do well when those interviews were good first try",
            "Wow...congrats bro you really deserve it.",
            "Congrats! One question about having only 1 option... Do you feel you got a good deal? Either way, getting the foot in the door is the hardest part, and you can always get upgrades later ;)",
            "Fuck you and congratz",
            "Congrats!",
            "Congratulations! It was around 2 months for me too. Let's go women in tech!",
            "Congrats! It’s so hard out there I’m glad you were able to find something. Are you comfortable sharing what kind of role it is?",
            "thas gangsta",
            "Congratulations 🎉👏",
            "Nobody wants to work says the 77 ghosts",
            "Congratulations!!!",
            "Congrats! Also, These numbers are so real lmao. I dont think a single company took me to next steps besides the only one that accepted me 😭",
            "Let’s go girlllll",
            "Great job! Btw what is this tracker called? Like what is the app generating this chart called?",
            "Girls can code?",
            "Congratulations 🎊",
            "What job title? Also what degree did you got, did you go for comp science, IT, or Computer engineering bachelor degree?",
            "Is the job on-site?\nWhat type of projects did you have?\nDid you do leetcode prep?\nCongrats 👏 👏 👏",
            "Congrats OP! \n\nAlso could you send me an anonymized version of your resume?",
            "Did you have any projects? If so, what type of projects? Thanks for sharing!",
            "You seem like the nicest person and I’m so happy for you girl! But I’m also so jealous 😭 I had 4 internships, multiple higher level projects, a few certifications, and I applied to over 200 jobs, starting in September of the previous year, and I literally got one offer, a pretty good one, but since I’m international none wanted to sponsor me.",
            "Congratulations 🎉...had the same feeling a few months ago and yes girls can do whatever they put their minds to💅🏻👑",
            "How much are they offering, compensation wise?",
            "[deleted]",
            "What projects did you do? I’m curious as to what an employer would see on a project that would think hey let’s pay this guy money ? I always feel insecure feeling an AI could just code whatever project I just came up with and there’s no need to hire a dev like me",
            "Slayyyyyyy",
            "Why does it matter that you're a girl?",
            "Did u graduate 2 months ago or are u still in school applying? I’m graduating and low-key want some time before applying to work on my leetcode. And applying during school is just sort of a lot",
            "[deleted]",
            "Hi! I always see posting their results here. Just wanna know what app/platform this is and why people use it? And is it only for jobs or internships too?\n\nps: i'm studying data science and will appreciate all tips regarding my field too.",
            "R u a citizen or GC holder?",
            "If we’re being hones college is just studying your failures, and documenting it to the point on no return.",
            "What is the company's industry? Did they ask you leetcode and system design problems? How was the behaviour interview? Also, congratulations 🎉",
            "Buddy how you make this graph you can please send the links for this\nCongratulations!",
            "you mentioned defense industry. Are you comfortable sharing comp?",
            "Why do you all use this chart type it’s so weird",
            "How are people making these charts",
            "Congratulations!!! 🎊🎉 so happy for you!!",
            "Did they ask you to provide your diploma/transcripts?\n\nWhat was the interview process like?\n\nIs it remote or local?",
            "My question is, do ppl think girls can't code or is it just a saying?",
            "Congrats!",
            "Did you direct apply or did you apply through LinkedIn/Indeed? Only asking because I have over 250 applications out right now and am having a very hard time hearing back from anyone. Congratulations though that’s awesome!",
            "Congrats, you made it!",
            "are you citizen or international student?"
        ]
    },
    {
        "post_id": "1balf97",
        "author": "Extension_Presence42",
        "title": "This is why we can’t get jobs smh",
        "url": "https://i.redd.it/xpzfzzjl3cnc1.jpeg",
        "score": 1424,
        "num_comments": 75,
        "created_utc": 1710001229.0,
        "selftext": "Still broken ",
        "permalink": "/r/csMajors/comments/1balf97/this_is_why_we_cant_get_jobs_smh/",
        "comments": [
            "Someone forgot to add the Phrase keys",
            "They made chatGPT write the code and now it’s buggy",
            "Their app has become worse I heard. They’re using AI translators and they laid off most of the previous ones, but they’re still charging you extra for a poorer quality version of the app.",
            "Should’ve hired me instead… just saying",
            "[deleted]",
            "Someone's about to lose their job.",
            "Isn't this the company that only hires from Ivy league universities?",
            "The thing is the utter arrogance of people on this post. The guy made a mistake on prod, big deal. It happens to the best of us. \n\nHave some humility guys.",
            "As a programmer, I can still read this 💀",
            "Having seen their hiring process, no wonder",
            "Everyone complaining about jobs is a waste man. There are so many people who didn’t go to top tier universities in Canada, like ontario tech or TMU, that are getting great jobs at companies like IBM, Microsoft,TD and BELLS. You guys have to make use of what’s around you not just grind grades and apply. Use your guidance counselor or teachers whom you made a good impression on to get a referral. Work harder instead of complaining.",
            "What did duolingo mean by this?",
            "Add a screen shot of this to your resume and apply for a job there.",
            "I kid you not, I’ve seen errors like these in many apps. Also Twitter changing every 4 days",
            "Hey Siri, code me an app that does what I need",
            "My mom is actually trying to learn English on Duolingo with native Vietnamese. The app is stuck on a question that makes you say “ten dollars”. No matter what we do it keeps saying wrong. She even asked a white guy to try it 😂.",
            "It’s probably the HB1 or over seas coders lol\n\n\nSo much hate lol\n\nAll I am saying is that, companies need to put a hold on sending jobs over seas or hiring Hb1. Help the American people who want to work lol\n\nJust stating my opinion"
        ]
    },
    {
        "post_id": "18kx0fn",
        "author": "dazzy_rohit",
        "title": "While other kids play with toys, this one plays with Python",
        "url": "https://v.redd.it/14x2dexviy6c1",
        "score": 1418,
        "num_comments": 114,
        "created_utc": 1702863401.0,
        "selftext": "😳😳",
        "permalink": "/r/csMajors/comments/18kx0fn/while_other_kids_play_with_toys_this_one_plays/",
        "comments": [
            "This is the guy that gets those 5+ YOE req entry level positions",
            "https://preview.redd.it/i7szdsh5qy6c1.jpeg?width=1918&format=pjpg&auto=webp&s=b8fc2d3c255f58902c4b2934b58c025517d4a7e9",
            "https://preview.redd.it/n9sdvgnimy6c1.jpeg?width=2426&format=pjpg&auto=webp&s=3eeac6f886720525167d6336b36a0b048f054f66",
            "I used to play with one that was a turtle that drew lines, but I turned out stupid anyway.",
            "the next generation of indian guy from youtube is looking good.",
            "Joever",
            "Not sure if this is serious or not, but I suspect some coaching from swe dad in the background? Or maybe kid narrates while big bro types code.\n\nSomething like how Lil Tay got coached by her older brother to flex about houses in front of strangers.\n\nOf course there's also the possibility the kid is just a child prodigy, but then prodigies are the exception to the norm so again no point worrying about personal inadequacies there.\n\nSource: my vast quantities of copium as a laid off junior swe",
            "Ngl but let kids be kids. If this is what the little lad really really wants, sure, empower him. Otherwise, don't let ambitions and insecurities ruin his childhood. He'll have plenty of time to do Python later in his life.",
            "https://preview.redd.it/52r4y4n9uy6c1.jpeg?width=1290&format=pjpg&auto=webp&s=350da359093bbb88b6c5c78ae73c02deb8e67e0f",
            "Okay okay okay... At 6 I couldn't even type on a computer, and here he is writing a whole ass two-pointer optimization algorithm 😭",
            "Seems like he is regurgitating a solution.\n\nI don’t understand the problem tho?\n\nMax area of what? Multiplying a pair of numbers in the list? Adjacent numbers only? Problem is poorly presented. That is why I say he is just regurgitating a solution because he didn’t really explain what he is doing.\n\nEdit: I see he cites leetcode problem 11, but he really doesn’t discuss the problem at all.\n\nHaving a kid show leetcode solutions is cute content tho. It could easily be a programmer having his kid show the solutions since it is extremely watchable content.",
            "feel bad for these kind of kids",
            "Now give the dude a problem that he didn't prep for.(you won't believe the amount of shit indian parents would do to make this kinda shit up lol)",
            "We are so over!!",
            "I’m killing myself.",
            "long recognise disgusted roof support frightening detail pocket towering nippy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Really? Approaching a problem without having solved it before, and thinking _on the fly_ to come up with the solution in _one go_? I have to call shenanigans here. More likely that he was coached or has been explained how to solve the problem before",
            "At one of my friend's universities there was a teenage professor that taught math classes. Literally everyone in the class was older than the professor lol",
            "https://preview.redd.it/0lwby4mcnz6c1.jpeg?width=1200&format=pjpg&auto=webp&s=9b4c35f20cb19ff06da72f7565f24fcbfdb2d7ff",
            "Did you know? Kids who play outdoors everyday and in sunlight before the age of 12 have better eye sight and do not need corrective eye wear till their early 40s. \n\n[Source](https://www.wellandgood.com/going-outside-good-vision)",
            "Ain’t no way 💀💀",
            "Bro is gonna get ME a job",
            "r u serious.",
            "not only just python, leetcode python",
            "\"maxArea\" in python eww",
            "I can’t take it anymore man",
            "Whatever, pretty soon AI is gonna replace children, and human children will all have to live in orphanages.",
            "Not a prodigy this kid 100% has swe parents or family of some sort. Good for him though, I wish I could’ve gotten introduced a lot earlier",
            "I don't want to water your wine but...\n\nI don't feel happy for him, at his age there are more important things to do than code.",
            "This is why the next generation will be filled with socially awkward losers that sat behind a computer for most their lives",
            "2 min sochna pad gya indian subreddit hai ya nhi",
            "And you think you can compete with these mfs.",
            "This is wolf Gupta isn't it?",
            "What in the, is this child labor?",
            "💀💀💀",
            "So this is that one person in class who has been coding since he was born.",
            "It is a bit strange that he used camel case instead of pascal case for Python. Usually you would see that from a dev who learned Java/javascript first. Sus",
            "What’s this legends channel?",
            "Hope AI takes over, atleast this guy will go out to play with his friends.",
            "Joke aside; how much does that matter if an AI can do it is seconds?",
            "Kids like these a fucking creepy.",
            "💀",
            ":skull:",
            "Is that Python? Since when were types a thing?",
            "Pathetic",
            "Someone teach the kid about pep8",
            "Companies hiring 20 years of experience at age 18, this is it!",
            "Ram Ram? running out of memory?",
            "looks just like my 5 y/o nephew😭",
            "this guy is my compsci professor",
            "[deleted]",
            "Hustle culture is out of control",
            "might as well kms right now and get it over with",
            "ok he’s quite talented but damn… this kid is like 6yo he shouldn’t be learning python he should be playing lego or smth\n\nAll those parents who try to make their kids work super hard since primary school and end up raising a burned out overachiever just seem weird to me, let kids be kids while they still can",
            ".\n\nhttps://preview.redd.it/067dqz5fa27c1.jpeg?width=300&format=pjpg&auto=webp&s=ec5cb30f546651a50ada28eb38a352636b292188",
            "rip to his cousins who are in college/uni🤕",
            "By the time he reaches 18 he can def apply for senior roles 🤣",
            "bro IS the stereotype",
            "no childhood, poor kid.",
            "Channel name?",
            "What a miserable childhood"
        ]
    },
    {
        "post_id": "18imbn3",
        "author": "MessayWaffle123",
        "title": "I was referred by the CTO of Intel and got rejected",
        "url": "https://www.reddit.com/r/csMajors/comments/18imbn3/i_was_referred_by_the_cto_of_intel_and_got/",
        "score": 1408,
        "num_comments": 202,
        "created_utc": 1702597690.0,
        "selftext": "I didn’t even get an interview.\n\nEdit: context - I got an email with the rejection and how it was referred. I am also a sophomore so this could be the reason. ",
        "permalink": "/r/csMajors/comments/18imbn3/i_was_referred_by_the_cto_of_intel_and_got/",
        "comments": [
            "Thats rough buddy",
            "All he did was upload your CV. A referral is where he writes to the hiring manager on why he thinks you are a good fit.  People confuse those two even after working for 20+ years.",
            "Lol had similar experience with Pony AI. James was my older cousin’s buddy so he handed my resume to the hiring manager and that dude rejected me. That brave dude stood up against the CEO. Te salut",
            "Greg Lavender? Dayum bru friends in high places.",
            "skill issue",
            "CTO did not refer you, CTO lied that he referred",
            "I was referred by a Microsoft VP who is very close with Satya and I got rejected 🤣🤣💀it’s really rough out here, continue grinding🤝🏾",
            "If you were actually referred by the CTO and didn't get the job, that's the biggest L of 2023. I hope you recover by 2024.",
            "You weren’t referred you were presented as a “nepotism” hire.\n\nThe CTO didn’t refer you because he thought you had good skills and has confirmed those skills but because of being acquaintances with your dad.",
            "The other dude got referred by the CEO",
            "Ask GPT 4 for a referral",
            "CTOs don't refer people, they get them hired directly.",
            "I am not the CTO of Intel, but I have referred people as a board member of a publicly traded tech company. I would hope that my referral is not \"hire this guy\" as much as please consider this guy. Since I am a board member, I assume the resume would be read, but, as a board member, I would not want the company to hire somebody just because I referred them. I want them to hire the best candidate.",
            "well, why don't you request work under him not the hiring manager instead?",
            "He probably put down that he doesn’t really know you or your work.",
            "LMFAO bro u gotta be on a different level of skill issue if this is real, I'd just leave the industry and hit up starbucks if i were u 😂",
            "Nah that j means you were ass lmfao",
            "SKILL DIFF 🌝🌝🌝🌝",
            "In the company I work for, whenever we put in a referral, we have to state how we are connected. It looks like this:\n\nHow do you know this person?\n* I don't know this person directly.\n* I know this person, but haven't worked with them.\n* I went to college/university with them.\n* I have worked with this person before.\n\nNext question is:\nDo you endores this person professionally and recommend them as a hire?\n* Yes\n* I don't know enough\n\nIf you've never met the CTO that referred you, I would guess that he had to answer similar questions on the form. \n\nI doubt that the internal recruiter will put any weight to the referral if he answers \"I don't know this person directly\" and \"I don't know enough\". \n\nI wouldn't put to much faith in referrals unless they come from people you've actually worked with, and even then, you have to be a good fit for the role.",
            "Holly molly!",
            "Don’t feel bad. I had a buddy refer me to a VP at a F500. Went out for coffee and still couldn’t get a job. I have one now but it was rough because the position would have paid well, benefits were impeccable, and it was fully remote.",
            "CTO referral isn't a suggestion. They definitely did not commit.",
            "Hahahahaha\n\nDid you know the guy personally, or just hit him up on Linkedin .. ?",
            "Doesn't mean your resume was the best for the position.",
            "Fuck it. Just realized this is a shit post.",
            "Damn, thats rough. So companies these days don’t really give f these days about referrals these days i guess",
            "Buddy you are, rough that is.",
            "Even easier to understand and get feedback.",
            "Time to take a look at your resume LOL",
            "These comments are wild.\n\nHalf the posts on this sub: \"Nepotism is real!\"\n\nThe other half: \"The CEO submitted my resume, but the picky hiring manager wouldn't even grant me an interview!\"\n\nYou can't have it both ways. Either the hiring managers follow a process and choose the best candidates for a job, or executives push candidates through based on personal bias and connections.\n\nThe chances of my team granting an interview to some random person that the CEO, CFO, CTO, or CIO personally referred are next to nil. Our executives don't tell us whom to hire for technical positions. That is not their job, and we would be doing a disservice to the organization by listening to them. We are the technical experts and have **far** more knowledge about what a technical role does and the qualifications than any executive would know. Their job is to recommend and hire management, set policy, and plan strategy, not to tell us which college graduates to interview or hire.",
            "The CTO is not the hiring manager",
            "This also proves who u get a referral from doesn’t actually matter ***\nYour caliber does",
            "ur dads old boss was the cto. my dads a god damn peasant who doesn’t even speak english much less know any math .",
            "That's rough",
            "Lol",
            "lmao",
            "Go to work at Intel?",
            "Did he ever personally surprise you ?",
            "DM kid",
            "Happens, try again",
            "Mann can your dad refer me for an internship for summer'24",
            "Damn.",
            "Can’t lie your cooked",
            "It's not merely joever. It's Joseph Robinette Biden Jr. over.",
            "Shit processors. . Shit company. Shit tracks. .",
            "You sound like an expert at javascript",
            "OP, you mentioned that the CTO of Intel is \"your dad's old boss\". This is nepotism at its finest. The CTO was your dad's boss, not yours. It sounds like there may have been a bit of an expectation to be held above everybody else as far as standards go in this situation by riding the coattails of your dad. Referrals are not intended for \"X's extended family and friends\". They are for people who are directly familiar with an individual and their experience in a given industry. Quite honestly, and this may be unpopular opinion, but if I was the CTO of Intel, and I was in that situation, I wouldn't have referred you.",
            "CEO of  Merck and reject :(\n\nInternational though ..",
            "https://preview.redd.it/0ltqj129wd6c1.jpeg?width=941&format=pjpg&auto=webp&s=dc176eb3e1d07c768a793cb68eaf14626c460398",
            "Fakepost.",
            "He didn’t refer shit lmao, just made you think so",
            "I got a referral for intel too. I never heard anything back. At least in the states they want people with advanced degrees unless you got in there as an intern beforehand",
            "nahhh that's crazy tho what?",
            "I was referred by no one and got rejected.",
            "You know what your mistake was, you should have got a reference from the CEO and not the CTO",
            "LMAO that reads: Skill diff",
            "Do you even know what is a referral?",
            "Good. Fuck nepotism.",
            "lol The problem with hiring is there’s so many moving parts and people involved. It’s hard to know the nature of how he referred you with this post. Did he approach the various people in the interview process and speak to your skills, their needs, and potential. If all he did was do the referral with a specific link it’s hard to know if that meant anything to those screening and interviewing. There was actually a post in the recruiting subreddit where some recruiters said less than 20% of people referred were a good fit or stood out to them.",
            "Depending on the company and level, this can actually backfire. At one company I worked for, the son of the CTO applied for several tech positions, and no one would even give him an interview. They didn’t want to fear he would go running to his dad if he received critical feedback.",
            "Sometimes it’s not who you know, but what you know",
            "I was referred by a Director, and got the job.\n\nKnew the director from a common interest group, even though he himself stopped being active there.\n\nHe's actually at a different company now, maybe I should ask for another referral? 🤣"
        ]
    },
    {
        "post_id": "18g0lqj",
        "author": "Dazzling-Rooster2103",
        "title": "The Duality of CS Majors on Tiktok.",
        "url": "https://i.redd.it/2ukih1r7np5c1.jpg",
        "score": 1408,
        "num_comments": 85,
        "created_utc": 1702319983.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18g0lqj/the_duality_of_cs_majors_on_tiktok/",
        "comments": [
            "I could beat both of their asses in Clash Royale",
            "Baxate, the 157K salary man",
            "Who is the lil guy under the mighty Ben Awad?",
            "I don’t understand this meme, doesn’t every major have people that look noticeably different. \n\nYou can find these two people in business and arts too.",
            "Female vs Male gaze",
            "It's almost as if different people are different.",
            "Baxate is so annoying",
            "Im more CS than both cuz they both could probably beat my ass.",
            "ben got that female appeal",
            "Funniest thing about this pic is that both of them are at least part Lebanese haha",
            "Ben Awad > Baxtae",
            "Fuck pics, show me their githubs",
            "[deleted]",
            "Ben Awad 😍",
            "Im fairly certain you can find a skinny dude and a jacked dude working in every industry",
            "Holy shit lmao\n\nNone of you people look like the below, this is copium",
            "Bro overloaded his HGH buffer for sure",
            "The upper one looks like a nerd and the lower one looks like a frat bro, both on the deep end of the bell curve. They making us look bad",
            "And Ben gets by far the most bitches",
            "it’s fun being the token jacked guy working in technology",
            "cute couple",
            "I’d bang both (i’m a male)",
            "I always automatically assume the upper one is smarter / the better computer scientist.",
            "I am like the second guy but bald",
            "Looks like hasan",
            "Not too much on Ben",
            "Ben Awad 😍",
            "crazy thing is they could be the same person at different times",
            "Forgot the femboy",
            "1st guy: How did her assignments.\n\n2nd guy: How did her."
        ]
    }
]