[
    {
        "post_id": "tsnco9",
        "author": "Stunning-Tower-9175",
        "title": "Have woke professors gone too far?",
        "url": "https://www.reddit.com/r/csMajors/comments/tsnco9/have_woke_professors_gone_too_far/",
        "score": 1363,
        "num_comments": 46,
        "created_utc": 1648686329.0,
        "selftext": "My professor just gave us a lecture on binary trees, but spend the first half explaining that there's also non-binary trees and that they are just as valid as binary trees.",
        "permalink": "/r/csMajors/comments/tsnco9/have_woke_professors_gone_too_far/",
        "comments": [
            "Wait until they hear about Red-Black trees.",
            "Have you got to graph coloring 🏳️‍🌈?",
            "The title had me in the first half.",
            "The first time i ever saw a trie i was perplexed...",
            "Yeah, how dare they spread the Woke Agenda™? How dare they indoctrinate you like that?",
            "The caucasity",
            "this is hilarious ngl",
            "Man and I thought linked lists would be rough",
            "Damn CRT commies and their non-binary trees!!!",
            "I wasn't there, but as typed I'd say that's just as likely to be said in jest.\n\nI took Discrete Math a few years ago and in an assignment had to prove that in a class if 15 people at least 7 students were male OR at least 7 students were female. I jokingly started my proof with *Let's assume there are only 2 genders*. 🤷‍♂️",
            "They’re so woke",
            "I think your professor is right and you are a secist",
            "Next week we'll be going over rainbow tables,  so I'm going to need all of you to finish the chapter on non-binary trees before we meet again Monday.",
            "Someone really typed this up, thought \"yes this is funny, I am funny, I should share this with the world\" and then clicked post.",
            "There are only two nodes.",
            "That's actually [true](https://www.reddit.com/r/askscience/comments/1wntrq/do_trees_have_genders/?utm_source=share&utm_medium=web2x&context=3). Plants have both \"male\" and \"female\" reproductive organisms, it just depends on the condition(s) they're in.",
            "Yeah, too far.",
            "I mean, it matters what they identify as....",
            "I feel like OP made this up for the controversy.",
            "#YES",
            "stfu pussy",
            "so what do you use non-binary trees for?",
            "That's so far, that humanity has to invent a new scale of measurement.",
            "This triggered me.",
            "Yes, it's true whether you read or don't read what they posted",
            "Come on, b+ trees have been a thing for decades."
        ]
    },
    {
        "post_id": "1bw9vuq",
        "author": "NWq325",
        "title": "Economy so bad no one got the job 💀",
        "url": "https://i.redd.it/5w51gguqglsc1.jpeg",
        "score": 1343,
        "num_comments": 123,
        "created_utc": 1712293852.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bw9vuq/economy_so_bad_no_one_got_the_job/",
        "comments": [
            "Damm my future is already bleak before even starting",
            "I thought the US government was planning to grant them money for semiconductor production?",
            "Atleast they emailed you",
            "Or they are just full of crap.",
            "Friend of mine works at Samsung KR and I can tell you it's not true lol the template rejection email that they send is \"oh we closed the role\", they rejected you and simply sent you the same template. ",
            "we are in deep recession",
            "Weird thing i have been monitoring some jobs that i am interested in. The posts have not been filled for almost 4-5 months. But then again the company could be too toxic or they are looking for someone beyond the described requirement.",
            "Well my thing is just get your foot in the door ANYWHERE until your preferred field opens up. I always have a job from experience in warehouse/manufacturing (management/lead/associate) levels. At the moment, I’m a delivery driver making decent money until I finished up my studies. If you’re a hustler you never stop. 🤷‍♀️ You have to use street smarts with books smarts.",
            "They opened the position as a tool to collect resume? Or helping the government pushed out “good number”",
            "I'm begging at this point like trust me I know how to code I promise. I will work minimum wage",
            "Same thing happened to me with a data science intern role at McDonald’s, after 3 rounds of interviews, including an interview with 3 different people in the final round, they emailed saying the position has been cancelled and no one got the role. Luckily I had other offers so I wasn’t too bothered, but imagine how you’d feel if you were desperate for a job.",
            "same here, so frustrated",
            "That's the least offensive euphemistic rejection email. Got similar one from another company. Not as offensive as, yeay we will go ahead with someone whose skills are more aligned. Skills which they didn't list on JD and I always wonder and ask to inform.",
            "AKA: \"We're malding over the lack of overqualified candidates that might ask only for peanuts in salary, so we closed out lmao.\" Watch them repost the role and try again.",
            "Same in Poland, they closed multiple positions without hiring anyone",
            "Dayum they created competition and then killed them",
            "Guys I applied to Tesla as a freshman for the funsies, but I didn't expect Elon to hate me that much",
            "This happened to me when I was interviewing for a job at IBM. I prepared and my did my best. The interviewers were assholes and treated me like I’m not important. I was devastated and miserable when I got the news.",
            "lol yeah this happened for two different jobs I was in the final round for at the end of summer",
            "Damn",
            "I applied to the same role..",
            "Until section 174 is repealed, this is how things will be.",
            "i got that same email",
            "I think recent months in 2024 has been better than 2022 and 2023?",
            "[deleted]",
            "Now apply on apple.",
            "Thanks Joe!",
            "![gif](giphy|FH5ObLGX3Twzo20xsh)",
            "YES everyone leave cs as a major. A cs degree is so useless and you’re guaranteed to not get a job there are so many better alternative stem majors just leave",
            "This year is so hard for college students. 😔",
            "Nope they just want to hire someone else and need to change up the position description to fit their intended candidate, find you another job",
            "Its not that no one got the job. Its that someone else outside the pool of candidates got the job. Orherwise why would they advertise a job opening? Surely it wasnt a mistake",
            "Good for you that the economy is doing awful then",
            "samsung, hmm they recently quite desperate and have phone marketing and ask want to upgrade to s24 or not. well green line phone, no thank."
        ]
    },
    {
        "post_id": "13sx60d",
        "author": "ParedesAndre",
        "title": "5 months and 1,250 applications later",
        "url": "https://www.reddit.com/r/csMajors/comments/13sx60d/5_months_and_1250_applications_later/",
        "score": 1337,
        "num_comments": 163,
        "created_utc": 1685159329.0,
        "selftext": "I finally recieved an offer, gents. \n\n28 years old and landed my dream job after completing a web developer boot camp, grinding DS&A, system design, database design, microservices, network architecture, and operating systems.\n\n&#x200B;\n\nI came from serving restaurant tables to manipulating SQL tables. Thank you, everyone, for the inspiration and my only advice is to believe in yourself and never give up. Cheers boys, you got yourself a back-end developer joining the ranks. \n\n&#x200B;\n\nAll the best, \n\nYour fellow Redditor",
        "permalink": "/r/csMajors/comments/13sx60d/5_months_and_1250_applications_later/",
        "comments": [
            "So you went from being a server to building servers, nice!",
            "Congrats. Will be taking an extra shot tonight in honor of your accomplishment",
            "Congrats! That’s like 8-9 applications a day 🤯",
            "congratulations!!",
            "How do people keep track of how many applications they've sent?",
            "Any tips of landing that backend role? Congrats!",
            "good work and congrats! take some time to destress and not think about coding for a week",
            "Congrats dude! \n\nI’m in exactly the same position - worked in hospitality for years, then finally made a change and went to University. Now I’m graduating next month at 29 years old and starting my new grad job in August - can’t believe it.",
            "Holy 1250 applications???? That is crazy. I'm glad to hear your persistence paid off!",
            "1200+ application. If thats what it takes, so be it. Congrats",
            "I'm very interested in knowing the details of your journey. Congrats on the offer btw!",
            "Congratulations, and thank you for sharing. We all can use some good news!",
            "PHP?",
            "[deleted]",
            "Congrats. I’m finishing college soon, and I’ve tried to apply to a lot of internships this summer but didn’t get any 😞.",
            "Congrats OP! May I ask which resources did you use to learn system design, db design and all that?",
            "I was intern-ing at this place and my coworker, who was 30 at the time, used to work as a chef at Applebee's. \n\nHe resumed coursework and graduated around the same time I graduated and now works at the same company we both interned at. \n\nYou both are a great source of inspiration for many, congratulations.",
            "Congrats! You worked really hard and you got what you wanted. You’re awesome.",
            "nice! congrats!",
            "Congratulations!",
            "Hell yeah 👑 now celebrate 🥂",
            "Congrats!!",
            "Persistence at its finest, very inspirational! CONGRATS!",
            "Congrats!\n\nHope it's smooth-sailing for you from here on out.",
            "Congrats! Proud of you",
            "Great job girl!",
            "Congrats bro!! Hard work always pays off !!",
            "How do you even find 1250 places to apply to",
            "You worked your ass off. I’m proud of you. Never stop learning, keep going. You’ll be at the stars soon.",
            "congratz brother you deserve it",
            "Remember to watch everything Master Brent Ozar has put out there. The man is too good to us \n\nA few Eldritch bits of advice. (Invoking the fear or as my data bros call it, the \"Warm neck moment\" where you feel the burning on the back of your neck while \"the fear\" sinks in)\n\nD-SQL with @Date Param in Stored Procs... have a plan guide or kiss good bye to your memory. As D-SQL writes new plans and will fill up your plan cache and, as a result, overwrite your database optimising processes and indexing tasks.\n\nStored Proc Deadlocking - SP_BlitzCache and SP_BlitzWho is your friend, also learning how to handle queues for locking issues.\n\nAdmin vs. users do not give everyone DBO access . That's a paddling. I have seen it. Don't do it.  DBO is a database owner. If you grant the front end this level of access, you open your UI to SQL injection attacks.\n\nAlways be paranoid about transactions, ensure you close them, have you closed it, IDK check 3 times if you leave one open with no declared close, you may force a deadlock Begin always write end JIC\n\nSpeaking of transactions always use them, being able to roll back an accidentally dropped production table is relieving.\n\nFinally and arguably, most importantly, if you ever see (With NoLock) in any of your databases, core queries look for a new job. \nIt's too far gone. There is no salvaging this without a serious backend overhaul.\n\nCase in point, With NoLock = Read Uncommitted, which means that the Data read is in a super state like Schrodingers Cat.\n\nIf Bob from HR changes Sally Jane to Sally Smith at the same time, someone else is trying to read the table (with Nolock)...\n\nSally Jane  exists in a committed state, but so does Sally Smi in an uncommitted state, and you get both so you have a phantom in your results... what do they call this ghost read well somewhat unironically... a... ghost read...  If that is part of a stored Proc to update a table, you just got yourself duplicated ID corruption as a feature! \n\nThat's right, they did this accidentally on purpose. The reason they did this was because Concurrency locking was increasing latency for the User, so instead of partitioning locking or heaven forbid adding a queuing task with a loading bar, they thought (with NoLock) has no locks and used that instead... *(even though it does get a schema lock, which means... It will deadlock a server when activated concurrently clashing with itself in a stored proc)* and also it reads via a dirty read, which means, roll your D100 folks and see if the data god Primus is about to corrupt your tables.\n\nIf by now you are feeling like maybe you are a little under prepared or out of your depth, remember plausible deniability means diddly squat to a business who pays you for the sole purpose of knowing this sort of thing and it's easier to just move on and leave someone else more knowledagble to clean up your mess for 5x the salary as a consultant. \n\nHappy trails, my guy.",
            "This is amazing. I made a change last year from supply chain to data analytics. Wasn’t a big transition from my role but my pay got doubled with just one switch and a promotion.",
            "Congrats bro!! May I ask for which bootcamp you went to?!?",
            "Happy for you.",
            "As someone who has worked tables and has went through a bootcamp. Mind sharing details on your journey?",
            "Nice, I’ve been programming for 5 years now I’m finishing my BS in computer science. I just started with Calculus. I hope the market gets better. I am on LinkedIn and live in San Diego.",
            "Concurrency was half of the interview. Thank you for the post, this is epic.\nPlease continue to share the wealth of knowledge.\n\nCheers.",
            "So boot camps still work to get people hired?",
            "Boys? Gents?\n\nSexist much?",
            "How can your 1250th application be your dream offer lol",
            "What boot camp?",
            "Which bootcamp did u join",
            "Do you have a college degree?",
            "Could you give us a description of your back-end developer job?  What language(s) and framework(s) will you be using?",
            "Bro just gave me hope! 🥺",
            "Hell yeah! Congrats. Man that’s serious work",
            "Congratulations!",
            "Amazing story proud of you",
            "would you please share resources for system design and  operating systems you used while studying?\n\nedit: congrats on landing your dream role!",
            "CONGRATULATIONS YAYYYY",
            "Congratulations!",
            "Do you have a degree?",
            "Congrats 🎉🍾",
            "Bro wild persistence. Congrats!",
            "Congrats, 6 months, lost count of how many applications but 80 in the last week.  I have 14 years experience 😂",
            "Aw man Im hoping for this right here too. About to wrap up my cs degree but just serving tables rn too. Congrats man! From one server to another (or ex)",
            "You sir, are an inspiration! I’m on track to get my CS degree after working in restaurants and the casino business for the last 14 years! I’m in my 30s and hope to graduate and have a tech job in the next 4 years (: hats off to you!",
            "Self taught?",
            "🎉🎉🎉🎉🎉🎉",
            "Congratulations 🎉",
            "Good job! Proud of you",
            "Congrats my man! I am a 2nd year student grinding DS and A, backend, databases, web servers. Feel free to share anything from your experience which might help us in our journey. Again, congrats man!",
            "Good for you! Congratulations!!!!",
            "I’m at 550 rn. Ig only 700 more to go lmao",
            "congrats 🎉",
            "Not everyone here is a male/boy..\n\nBut congrats",
            "CONGRATSSSSSS YESSSIRRR",
            "Congrats!",
            "CONGRATS!!! I’ve finished college almost close to 2 years now and still nothing yet. It’s really demotivating and I feel like giving up sometimes but it’s good to hear you found the light at the end of your tunnel!",
            "i’m starting to think about flooding internal apps of the company i work with :)",
            "Congratulations, I can't imagine how the feeling must be, to conquer your biggest challenge. Can you be my mentor, in the same boat. Finding it extremely difficult to follow a road-map. Could really use some of your guidance.",
            "What’s DSA? And congrats brother I’m proud of you. Almost made me shed a tear or 2.",
            "."
        ]
    },
    {
        "post_id": "15nx6de",
        "author": "buttimplant",
        "title": "I regret majoring in CS",
        "url": "https://www.reddit.com/r/csMajors/comments/15nx6de/i_regret_majoring_in_cs/",
        "score": 1341,
        "num_comments": 503,
        "created_utc": 1691723735.0,
        "selftext": "I did everything right. I grinded leetcode(614 questions completed). Multiple projects with web dev and Embedded systems. 2 internships during college. One as a data engineering intern and another web dev both at a Fortune 500. I graduated from a top 50 school with a 3.5 gpa. \n\nBut 8 months after graduating I still have not received an offer after applying to more than 800 openings. From those 800 applications I received 7 interviews. I passed every interview with flying colors have great conversations with recruiters about the company. Each time I think this is finally the one. But I either get ghosted or receive a rejection email shortly after. \n\nI come from an south Asian background and my family expected me to me to be working by now so they can get me married but I have failed myself and my family. \n\nMy soul can’t handle this anymore and I have fallen into a deep depression. I honestly don’t know what to do anymore and some very dark thoughts have passed through my head.  \n\nNow I’m applying to retail jobs near me just so I can get out of the house but even these jobs aren’t replying to me. It’s like I’m cursed with being unemployed.",
        "permalink": "/r/csMajors/comments/15nx6de/i_regret_majoring_in_cs/",
        "comments": [
            "I’m never going to get a job , one internship and 50 leetcode questions compared to this,  FML 😂😂",
            "Anyone know why there’s so many “doomsday” posts regarding CS lately?",
            "Market's shit right now, somewhat expected. Did barely any leetcode and no internships and got a full-time offer from AWS during my Senior fall. I could be entry level jobs are oversaturated, or just everyone looking as so they'd take the candidates which fit even more.",
            "[deleted]",
            "Yall scaring the shit out of me",
            "Keep trying to find any job you can. And for the temp jobs just dumb down your resume. You might be coming off as overqualified. \n\nYou’ve ran a marathon while sprinting. Know you tried your best and some things are out of your control. You can keep trying to find swe jobs, but the frenetic pace will only continue to do damage to your mental. Having income will help relieve some pressure and provide some sense of self worth. You simply have to shift to a more manageable mode now. 1% callback rate is pretty on par with my experience. I was the same and got into a swe role. You can too. Get your second wind.",
            "1. The market is bad now. It is not your fault. You are doing your best. Sometimes, all you need is luck.\n\n2. How do you evaluate your non-technical skills ( communication, likability, attitudes, etc...) ? \n\n3. Family pressure is hard; I have been there. But you are living in the U.S. now, you have more choices than you thought.\n\n4. If you cannot even find a retail job in your area, expand your search in other areas as well. You might need to relocate, but you want to move out of your parents' house anyway.",
            "I have 10+ years in the field, I can't even get an interview for shit I'm *way* qualified for.\n\nIt's not the field that sucks, it's the current job market/economy.",
            "&#x200B;\n\nhttps://preview.redd.it/tcr1x9yfafhb1.png?width=719&format=png&auto=webp&s=9933d8900a2cc9571a8407ce25d39025721ae5fd",
            "chill brother. this economy is fucked. you'd be in the same boat with a lot of degrees. start making app, do something on your own.",
            "This post shouts me. Everything from south asian to 2 internships to even nunber of keetcode questions. We soulmates brother",
            "Can someone explain to me what is going on with CS in USA (I'm assuming this is USA, that is..). I majored CS in EU without doing any leetcodes, internships, grinding for interviews and I had no issue landing full time coding job in first year of college and tons of people from college as well (it was so massive that school was frowning upon students who had jobs because often they neglected studies and tried to explain it by saying they had to be on the job). Come to EU dude",
            "Bro you haven’t failed yourself or your family. And anyone who says otherwise is an idiot. Get yourself a job in the meantime and keep at it. Serving jobs can easily make 30 bucks an hours with tips. \n\nThe job market sucks right now. \n\n. Everyone is having a hard time with applications, so for now you got to get creative. \n\nWhat skills do you think you have that are marketable in a freelance capacity?   Can you offer cs services to say real estate brokers around your city? Can you offer your leetcode experience tutoring high schoolers with rich parents? Use your free time to network in the real world. Go to professional mixers, volunteer at non-profits, meet business owners at chamber of commerce meetings. Surrounding yourself with in-person connections is a neglected skill now that you can send out 1000 applications at the click of a mouse.",
            "Do what I do and teach computer science abroad",
            "You were supposed to apply the fall of your senior year. Don’t worry, you can still apply. Keep applying to swe jobs and those new grad roles and even ones that you might feel under qualified for. Apply to those careers in the field of cs—cyber security, data analyst,  and etc. There’s a lot more to a cs degree beside swe. You’ll get a good swe or cs job. Do another internship.\n\nYou can’t apply to retail jobs because you’re overqualified for them.",
            ">I passed every interview with flying colors have great conversations with recruiters about the company. \n\nNot to sound pedantic, but getting rejected or ghosted means you didn't pass. Also only 7 interviews out of 800 applications means your resume is awful or you are applying to jobs way above your weight. Companies are hungry for qualified SWEs and many more are willing to take interns for much lower pay. You have to be willing to take the latter to build experience because right now you have none. Not everybody can just start at FAANG right out the gate. Most don't.",
            "International?",
            "You are at an amazing standing. Don’t think your efforts were for nothing. I recommend you read Atomic Habits. One of the analogies the author gives is this:\n\nImagine an ice cube at the temperature 25F. You want to melt it. Up until 31F, you don’t really see the ice cube react in any way. Once you get to 32F, that’s exactly when you see an actual visible result (ice cube melting). But this doesn’t mean that you have made no progress from 25F to 31F. Each degree increment has equal weight and part in the ice melting, it isn’t the 31F to 32F that did it. You had to go through that process to get to 32F. 26F… 27F… 28F… up until 31F before the melting starts.\n\nWhat the author is trying to say is that your progress is not meaningless. You are getting better and better everyday until you tip over the scale with that last push (although each push has equal weight, as mentioned in the analogy). You are so close, I mean, you check off every box. Don’t give up, just keep applying. I’m certain you will find a job VERY soon.",
            "I dont think you are passing with flying colors. It sounds like you have some gaps you are unaware of. Have you tried interview services that give you candid feedback? I do this for a few local colleges and it tends to help.",
            "Double check resume, make sure you use keywords because if you receive so little interviews it means that you need to improve your resume. Social skills are also important.",
            "[deleted]",
            "It's not your skills, it's you. When they say \"better suited to the position\" they mean socially. They don't want an incel for an employee.",
            "lmao with 2.6 gpa junior without an internship, literally got a C in human communications\n\nmight as well drop out now",
            "Literally me",
            "Which school did you go to?",
            "> my family expected me to me to be working by now **so they can get me married**  \n\nWait what? Take ownership of your life bro. \n\nAbout the job thing, just keep applying to tons of jobs, remember getting hired also involves social hurdles which you have to take seriously so be presentable and likeable, make a portfolio, you'll get there.",
            "You have to understand the job market is getting crushed by the Fed on purpose. This is our 2008 but worse moment, just have patience keep grinding and do what you love. I’m doing Comp Sci but doing certifications on my own for Cybersecurity and have never touched Leet Code because I value certs more than it. I’m grinding Python and SQL. The post pandemic job market is dead. I’m confident in my ability to land a job after I’m done because I’m 25 and live in NYC. Next year 2nd Quarter we’ll hopefully be in business again.",
            "Could you post your resume :) lets have a look.",
            "Is this sub just people complaining ? 😂",
            "It's not your fault. You just graduated at a bad time. The posts trying to link your success to your \"negativity\" are the same things I heard when I was trying to get rehired as an accountant after getting laid off in 2009. It wasn't true then, and it's not true now. The market is simply against you, and I do believe the best thing you can do is try to get a job of some kind and preferably somewhere that has the kinds of jobs you actually want to which you can apply internally as an employee of the company.",
            "Thanks for posting this, more people need to learn about what a bad life decision it is to major in Computer Science.",
            "I would regret majoring in counter strike too",
            "Me fr fr",
            "How is this the third regret post I'm reading in the last 24 hours? What's happening guys?",
            "If you can't find a job, go make a business(start up). Networking other jobless people and make something demanding",
            "You be alright buddy try to apply to government jobs they will take you in without any issue",
            "@OP: This will be a long one, but please read it all. It might be helpful and inspire you.\n\nPlease don't let yourself feel down. This economy is very very bad and nobody wants to acknowledge it. We are living in an economic crisis worse than '08 if you recall it. I have applied to almost 400 jobs and did like 8 interviews. I just got an offer last week (after being unemployed for 4 months). Note that I am a junior software engineer...not an entry-level one!\n\nForget about others' expectations (hard to do but is a must to remain sane through these tough times) and focus on your own timeline. In other times, you would have found a job way earlier. What I'm trying to say is that you have NOT failed...the economy failed YOU - and all of us!\n\nFrom what you say, if you can actually afford being unemployed at the moment (i.e. not having to go do Uber Eats or a classic retail job to survive) then invest most of your time in working on projects that are real life applications (not sure if you already have projects like that).\n\nDisregard all your family's negative comments or toxic expectations. Getting married while working a moot corporate job is not the definition of success. Getting married while you are in control of where you work and what you work on is way more representative of a successful individual.\n\nWhat I mean is find a few small businesses in your area (that already use some tech in their operations) and develop an application that could make their operations easier (completely for free). For example: find a barber and create a simple reservation app for them, or find a local pet care and create a simple CRM for them. In all cases, something that real-life users will be using.\n\nThis shows prospective employers that you can actually solve real-life problems and can communicate with users as well. Repeat this for another business or two. You would still be applying for job posts while you do that. You need to update your resume/portfolio as if you finished the applications - you wouldn't be lying if it comes up...but stop with the leetcodes (real life does not revolve around leetcode problems..they could be helpful but not core requirements).\n\nIf after you are done, and still have no improvement/conversion from job applications, then you can continue being a freelancer if you must or simply create apps and sell them.\n\nMore specifically, those retail jobs are only refusing to hire you because you are way overqualified for the jobs...yes that's a thing! They also are bootstrapping financially and don't want to hire you if you will quit soon. It doesn't mean you cannot do the job.\n\nI wish you the best of luck, OP, you got this!",
            "7 interviews without even one offer 🤷‍♀️？ something wrong…..",
            "Reality is... you're probably just a bad interviewer.   \n\n\nThere's more to getting a job than LC, GPA and projects. Team fit and culture fit is equally, if not more important. Some of the ppl in this sub are probably deeply unlikable and have troubles making/keeping friends",
            "Have you ever asked the interviewer why they didn‘t consider you further?",
            "you cannot be this unlucky, you are doing something very wrong. you need to find out what it is by asking anyone you know and who will be truthful with you. if any interviews were recent, ask your interviewer why you were rejected. you won’t get a response to all of these asks but definitely ask as you amy find out a huge red flag about yourself",
            "It’s not your fault the economy isn’t going well. Not to mention pre Covid entry level tech jobs were getting almost handed out. So don’t beat yourself up to much",
            "bruh wtf is this shit? Screw cs i’m going into electrician work 💀Atleast i’ll know i’ll have a job goddamn",
            "Don’t give up (on yourself). I imagine it’s really hard with your family pressuring you. You’ve worked so much harder than anyone I’ve ever heard of lol. My advice would be try to just hang out with friends or other SWE’s to get out of the house and make genuine connections. Someone will know someone. But ya.. I’m in the same boat as you and online applying sucks BAD right now. Hang in there",
            "Bite the bullet and start at a lower tier job. Even if salary is like 60-70k starting, just do it to get experience and put it on your resume. Then job hop for more opportunities as you gain workforce experience.",
            "I literally just did a CS degree to get a “good job” and make decent money. Now working for the last 5 years in tech, hate my job…absolute slave to the laptop. And the money I make is shit compared to what people make in America/Canada anyways. So I’m my view complete waste of time and effort. Should have done something I’d actually have enjoyed learning about and doing.",
            "This major is now way over saturated",
            "Apply to WITCH companies, they don't pay much, but getting in is easy. These consulting companies basically look for a job for you, but take a significant portion of the pay by playing intermediary.\n\nNow for retail companies, dumb down your resume. They ignore you because they think you won't last long with them. They believe you'll keep applying to other jobs and will only be a few weeks with them. Even retail jobs require a little training, and nobody wants to train somebody that'll only be there for a few weeks.\n\nSince you are about to enter the next new grad cycle, just remove the college dates from your resume and apply to new grad positions. That'll help you pass resume screens, and on the interviews you can tell them the truth, that you graduated last year and took some time off before working, plenty of people do that.",
            "Yo so this is kind of unrelated but how do I ask out someone who I know is a nursing major?",
            "You could get your CV reviewed, r/resumes and r/EngineeringResumes.\n\nYou could consider increasing the number of applications per day.\n\nHow far do you get in the interview process?\n\n>I passed every interview with flying colors have great conversations with recruiters about the company.\n\nIf this was true, you would have gotten further in that process. Some things could be in your blind spot. Try some mock interviews and get feedback.\n\n>my family expected me to me to be working by now so they can get me married but I have failed myself and my family. \n\nFinding a job, especially the first one, is demanding and full of rejections. Right now the market is very difficult to new grads, not like it has been for years earlier.\n\nYour family likely don't include many IT recruitment experts, so be careful with their expectations that might not be realistic. Their lack of support potentially makes your mental health worse. \n\nTake care of yourself: eat well, excercise, sleep enough. Get out of the house regularly. Be with friends and relax regularly. Reach out to a mental health professional if possible. Talk with your family and ask them to be more supportive or tone down communication frequency with them until you find a job, if possible.",
            "What the heck seems you have incredibly bad luck. I'm not of western background and graduated with like 2.5 gpa, not intership, no interesting projects. I might be just lucky but, i only did like 15-25 leetcode questions applied for \\~15-25 jobs got 2 offers and picked one. (that said they weren't great offers)\n\nI'm swear you're actually cursed. Who did you wrong? What did you do in your past life? Have you considered tutoring or teaching at your uni?",
            "I'm fucking done with this sub and the constant bitching, Jesus. Maybe I'll try again in a year or two.",
            "With 800 applications and only 7 interviews, it is very clearly a resume problem. You clearly have the skills and some work experience. I don’t mean to sound like an asshole but ALOT of people think they have a good resume when the reality is they don’t. Anonymize your resume and post it here and at r/jobs for advice. I mean damn son, you are getting ghosted at 99% of all your job applications, it is definitely a resume thing where you are getting filtered out/thrown in the bin immediately.",
            "> From those 800 applications I received 7 interviews \n\nMaybe you need to work on your CV if you're not getting interviews after so many applications. Make your CV as concise as possible, maximum 2 pages or even 1 page since you're a recent graduate. Also read the job description very well and make sure you have the required skills. Tailor your CV for the job description.\n\nAlso be open to a job far away from where you live. Even consider applying outside your country. You're still young and you can live out of the country for a few years.\n\nAlso remember that for each job, you're not the only one applying. CS is booming these past few years and for each job posting there are a lot of people competing against each other to get the job. Even if you did good during the interview, there might be someone better than you. Doesn't have to be better technically, but maybe better soft skills, communication skills. Don't take the rejection personally and work on yourself instead.\n\nFinally, don't let rejections disappoint you. It's part of the search process. Take it positively and work on your CV and skills.",
            "I can’t tell which doom post is satire and which is legit at this point\n\n\nHeck maybe they’re both",
            "First, your resume could be formatted bad... \nSecond which country do you live.. Do you have work authorization or need visa sponsorship?\nThird, your social skills might need improvement\n\nFind out what it is and work on it, instead of leet code",
            "Build a portfolio of real projects. Volunteer to work on developing something for a group you have an interest in. Reach out to people at companies you want to work for.",
            "you don't have depression. you have anxiety. or maybe this is a copypasta, in that case, pretty funny.",
            "So you didn't get a return offer? I didn't even know people didn't get those",
            "South asian? Just say ur indian lol",
            "Are you Malaysian?",
            "resume difference 💀💀",
            "Take any position you can. CS jobs are DIFFICULT at the moment but will come back again.",
            "Because everybody else in your shoes is doing the exact same thing?  They're memorizing the same questions, giving the same answers, with the same background/GPA.\n\nThey all want to get rich the same way, and pursue the same path to success.\n\nSo when everybody is in the same line, that reduces the chances of you getting into the same club when you're compared to the exact same folks as you.\n\nYou now are learning the first lesson in life, about opportunity and the need for networks/connections.\n\nYou need a different path in, something that will get you into the \"club\".  If no such door exists, you'll need to find a new \"club\" altogether.  That means different (much lower) salaries, (unpopular) sectors, (LCOL/rural) geographies, (less technical/IT/testing/etc) career tracks.\n\nYou're not getting into retail jobs because you're overqualified.  Nobody wants to hire a college grad with a sterling background who's going to bail the moment they get their first expected job.  If you truly want to get the retail job, you'll need to fudge your background and remove your college stuff wholesale from the application.",
            "This is for sure a shit post, you guys are gullible",
            "Create your own startup bro. If nobody is willing to hire you, fuck them all and make your own company.",
            "The hot topic on the street is UPS driver is making 170k a year it has much easier entry than coding. \n\nTo OP don’t give up if you rlly like coding, keep applying all it takes is one acceptance. Think of it like dating you can’t expect all girls to like you, you only need one girl to like you. Good luck!",
            "We all are feeling the pain right now. You aren't the only one. As cliche as it sounds, things are almost never as bad as they seem at the time. It's just one small chapter in your life you will look back eventually and think \"I am sure glad that shit is over with.\" \n\nAs for your family, it's tough disappointing them, but it's fine if they don't understand. Shitty time to graduate. Focus on what you can control.",
            "Persistence and consistency",
            "Maybe its a social skills issue? \nThe job market is brutal out there, fo’ sure, but you gotta have some charm to your persona along with the leetcode grinding.",
            "It might be an issue of how to are applying, I am way less qualified than this, and I just landed a job. Pretty much every job site has resulted in me getting ghosted. Only recently, I started getting calls about the jobs I applied to. However, one of my connections at a recruiting company (they weren't a process of what job I got) gave me an email to someone in a company's HR department and got and interview and a verbal offer in a week. Sure, I spent the entire weekend creating a project that familiarized myself with their organizations architecture, but I feel the fact I was a direct hire played a role.\n\nAnother thing is I found some groups on Meetup in my local area in my field. It didn't help since I pretty much had the role already, but it's good to know people in your area. The leader of one of these groups apparently knew a lot of people at my company and reached out unprompted to them about me. I already had the verbal offer, but if I didn't already have it, that would have solidified it. At worst, local organizations are just nice to put on your resume, and you hear from a lot of people in the industry. \n\nAlso fuck FANG if that's where you are looking. Look at companies that are not directly in software development. All companies have big software departments and are generally more stable. A lot of people in tech got fired due to a dip in post pandemic drop in internet usage. Look at companies  that said FANG companies use their services for.",
            " Apply to startups",
            "It’s a bad market right now for getting hired. The governments are pumping in immigrants for cheap labor. \n\nYou’re better off trying to start your own company while still looking for work for stability. Don’t give up, all it takes is one successful interview. If you aren’t getting many call backs check your resume. Is it generic garbage or did you put things you actually accomplished and made better (with metrics like I implemented this and it increased production by ___ %.",
            "There’s something missing here. Also you are not passing every interview with flying colors brother, are you okay? 🫠",
            "[deleted]",
            "Is the swe the only non research position in industry for cs grads?",
            "CS is not for everyone. I graduated from a top 10 university in CS globally . I've seen many of my classmates struggle in class and fail to secure SWE jobs, and they had to fall back to doing sales related jobs just because they are not good enough.",
            "Nobody owes you a job. Keep grinding or start your own company. No other country in the world affords such opportunity. USC who has live abroad in multiple countries",
            "Do u have any data to support your claims? I mean you are saying u passed interviews with flying colors then why would the companies not hire you? 614 easy medium or hard?",
            "Maybe your overqualified? Try to dumb yourself out and hide your achievements while still getting ok for the job. \n\nI can understand the problem with overqualified people. In my company we had some of those and they left in less than a year because they felt people are dragging them down.",
            "Impressive stats I am positive you have the skills to succeed.\n\nHowever.. how much time have you spent networking?",
            "This entire post sounds made up lmao or maybe international needing visa sponsorship?",
            "I think it’s because of the recent recession. A lot of my friends are facing this now, some went abroad for an MS after years of experience. It’s just that the current situation is not that favourable even if the recruiter wants to take you. Keep trying, apply through referrals instead, you can get more interviews. Apply to startups/ not too big but very agile companies, they have less turnaround time. No matter what keep working on your skills and keep applying. I went through this too.",
            "Why so many depressing posts lately.",
            "Reach out to your school career office. They usually are very open to helping alums find jobs and prep for interviews. Keep your head up, OP.",
            "Man and my regret is not majoring in CS\n\nReal talk: it could be a lot worse. This degree is going to have value presumably for at least the first half of your career.",
            "Dude is trolling I think",
            "Hang on. Reality check cause you need help. I appreciate the other comments but let’s actually analyze in case you missed it yourself\n\nTop 50 schools with previous exp. Those are easy minimal checks that will get a manager to take a chance to interview\n\nHere is the tricky part: you do claim you pass the technical portion of the test. How about the behavioural?\nGreat convo with recruiters means nothing\n\nIt depends what firms you are applying to, but seems like you did a super wide search\n\n\nThe truth? While you went to a top 50 school you are competing with the other 49 and I assume you have a STEM degree. \n\nTake this from me: I have been in 2 not counting this current “recession”. Nortel happened just before I went to school. Then 2008 crisis was worse\n\nThis is nothing. Y’all spending a few months look g for a job and complaining. At the time senior ppl got laid off. Pensions wiped. Family destroyed. They just didn’t have the internet back then",
            "Average cs major Reddit post",
            "But I'm curious then what major you think would give you more oppornities then",
            "The industry isn’t friendly right now. And I don’t mean to undermine your efforts but I have seen a difference in networking than just being what one considers the best candidate at the time. What does your professional circle look like? Is there anyone you can reach out to for support? A referral? Anything?",
            "I'm 30 doing my internship after immigrating as an old dude with 0 experience back home, never did leetcode but I'm confident enough in my problem solving skills and that's what I concentrate on, I got offered a job offer after my internship I think just know what you are good at and probably work on ur interactions with humans",
            "Should’ve went with CE",
            "Im in big four public accounting. Im a CPA. Had a 3.8 GPA dual degree in accounting/econ in uni. 8 years of experience. Recently laid off a few months ago from big four. KPMG and EY let go of thousands of people. The job market is trash for us as well. \n\nHave applied to 300 positions. About a dozen first round interviews with the CFO/Controller or hiring manager, and I get very positive feedback from them via the receuiters who continue to move me through the interview process. Something comes up and either the position is no longer available for hire or it moves to a different state and I have to relocate.",
            "Uhh, so a US citizien going through the most depressing of times, and here I am an international expecting that things will get better over time.\n\n😭😭😭😭😭",
            "It's better to get any job meanwhile. Congrats for applying to retail jobs.",
            "Expand your connections with people in the company, they might help when you get ghosted. That's what I heard from someone who has experienced the same situation as you.",
            "Same. It's so depressing but don't give up please 🙏",
            "Y’all need to learn how to network",
            "Post the resume",
            "maybe they did a quick background check and found your buttimplant Reddit account",
            "800 jobs in 8 months is rookie numbers, gotta aim lower imo",
            "Start your own company.",
            "Same dude. Even if you get a job it probably won’t pay that much. All of my friends that majored in bullshit and barely got a 3.0 have waaaay easier jobs than me and make way more.",
            "Too many regrets in this subreddit. I’m out of here",
            "U haven’t mentioned having any projects lol",
            "Lmfao",
            "Please share your github and linkedin \nLets get you a job",
            "cuz u r A international student？",
            "Do you have any friends from university already at jobs? Try asking them to submit your resume for an open position at their company. Usually they have an employee portal for referrals. That’s how I got a job. You immediately go to the front of the line with referrals. You still gotta be impressive and do well during the interviews, but they look at you a lot quicker and you’re all but guaranteed the initial interview.",
            "Try getting into cyber security..",
            "Same here. Are you an international student? I’m not, but I’m still having issues getting interviews.",
            "Eventually you'll find something. I managed to land at a fortune 10 company with 1 internship, doing maybe 2 leetcode questions, and I had I think a 3.1 or 3.2 GPA. I did 60-70 job applications, so maybe I just got lucky. There are definitely other skills outside of coding that may benefit you during interviews.",
            "There must be something wrong with your resume or interviews that just isn’t being resonated in this post or you’re applying to opportunities that are just way too competitive",
            "Same bro hahhaha. I am currently leetcoding rn. Been extremely depressed and my parents dont understand that the job market has crashed. Lowkey just wanna give up. I have no idea whats keeping me going rn.\n\n  \nFuck cs, should have studied something easier probably related to healthcare. Easier to get jobs and stability is ensured. Jobs in healthcare are already secured and no such thing as recession lol.  \n\n\nCS programme is already so difficult to get in, then the curriculum in it self is so challenging and you end up losing so much hair by the end of your four years.   \nThen getting a job is so whole different beast. Totally irrelevant to what you studied. It is so mentally draining with 5-6 rounds for each application (even shit companies are asking for leetcode, system design and everyone got 6 rounds lol) just for companies to reject you in the end. System design and leetcode hards being thrown in your face, expecting to be solved within 20 mins is just madness now.",
            "I wouldn't just jump straight into a retail job just because it isn't working out yet. It will. If you want a side hustle while you search, I'd go for a tutoring job. You can work from home and apply your knowledge of CS and set your own hours during this busy time.\n\nYou probably need to look at more essential jobs. You're probably mostly looking at tech, but have you thought about government, medical, or industrial jobs? Those aren't affected by the current job market trends. \n\nLastly, I'll say, the first job is always the hardest. Don't be discouraged. Once you get your foot in the door somewhere, you'll have a plethora of opportunities for the rest of your life.",
            "Sounds good",
            "feeling bad man... but im intrested in ur embedded system project, u willing to share?",
            "The cs job market is bad right now, especially for new grads. Keep applying.",
            "How do you even find 600 Leetcode problems to do",
            "Find a job in a good company then move up/over to where you want to be.  Easier to move from within vs coming in from outside.",
            "Hey, take heart, it took me a YEAR, with almost every conceivable advantage, (in 2019 pre-pandemic) to get a job. It fucking SUCKED, but there is hope. You just have to keep on keeping on. Something will turn up for you. ❤️",
            "LMAO!\n\nI can't even get an internship so you're already ahead of me.\n\nI don't even have a CS degree and I wish I did because I think it gives you an advantage.\n\nMy DSA and Leetcode solving abilities are absolute garbage. I still struggle with easy problems. \n\nI have 14 years of experience in Finance but my stupid ass wanted to be a software engineer. I paid 16k USD for a bootcamp and can't even get n internship.\n\nMaybe your issue is with your personality/social skills. This FAANG guy talks about it in his video: [https://www.youtube.com/watch?v=LQFsEwcCO1E](https://www.youtube.com/watch?v=LQFsEwcCO1E)\n\n&#x200B;\n\nMastering DSA and technical challenges is the hardest part. Maybe all you need now is to master social interactions and soft skills. You should be fine. Don't kill yourself.\n\n&#x200B;\n\nIf you need to get a crappy job in the meantime to survive, go ahead but make sure to keep practicing.  It's a tough market right now but it should start to get better soon.",
            "Why did you not get an offer with the internships? Those are lead in positions. Might want to check yourself for some red flags you are unaware of.",
            "Maybe my point of view is different as a mother of 4 in my mid 30’s. But in my experience, young adults still don’t have a lot of time or experiences under their belt, and every setback seems like the end of the world. I promise it’s not, and you will eventually make it. Just keep getting back up. It’s taken me 3 yrs to land a job. Take a deep look and try to think what it is that is setting you back. Maybe it’s soft skills, maybe it’s something else. Figure it out, work on it, and keep going.",
            "I'm sorry but you've got to be doing something wrong or I got extremely lucky.\n\nAbsolute dogshit GPA, 1 'internship' (unpaid) with the federal government where Tldr I did next to nothing of value, 9 months of experience as a student developer for my university's technology services dept, and maybe 200-300 applications. Probably got about the same number of first interviews. I just got hired immediately after graduation this year. Sure, onsite + not incredible pay but much much more than I was making previously so it's a great place to start.\n\nStep back, reassess your situation, talk to a carrer counselor. If you passed the first interview \"with flying colors\" but never heard back, you've made a large/several mistakes that resulted in immediately getting put into the no hire bucket. Next time you're getting interviewed, pay attention to the interviewers body language, and you'll notice at some point what it is you said that spooked them.\n\nEdit: better yet, also try and do mock interviews with your friends or if you happen to know anyone that hires people with them. Clearly something specific is happening here.",
            "Consider moving to a state with a better job market. Some smaller states have a lot more opportunities from my experience.",
            "What’s your portfolio website look like? What does your GitHub look like? What do you personal projects look like?\n\nI imagine those areas are lacking.",
            "damn im going to start college this fall as a CS major and this post just made me so scared lol. any advice/comments that would make me more excited now before going to college?",
            "If you ever want to talk dm me!! im quite literally in the same position but about a year out of being unemployed. South asian. Girl. Parents disappointed in me and confused how ill get married. Also contemplating doing a retail job just to feel something but that makes me almost feel like a failure even more (not about the job itself but the fact that i got a whole ass degree and making nothing of it) no matter how hard i try",
            "Job openings posted on Indeed specifically in CS are **below pre Covid**.\n\n[https://fred.stlouisfed.org/series/IHLIDXUSTPSOFTDEVE](https://fred.stlouisfed.org/series/IHLIDXUSTPSOFTDEVE)\n\n*Overall job posts* are far **above** Feb 2020.\n\n[https://fred.stlouisfed.org/series/IHLIDXUS](https://fred.stlouisfed.org/series/IHLIDXUS)",
            "Hey, I'm really sorry to hear that you're feeling discouraged about your job search. \n\nIt's frustrating when you've put in so much effort and haven't seen the results you were hoping for. Remember, this doesn't define your worth or abilities. It might be worth considering a few options: \n1. Reach out to your network: Connect with friends, alumni, or professionals in the industry who might be able to offer advice or potential job leads.\n2. Polish your resume and cover letter: Make sure they're tailored to each job application and highlight your relevant skills and experiences.\n3. Expand your search: Consider looking for opportunities in different locations or industries that might have a higher demand for your skills.\n4. Seek feedback: Reach out to the companies you interviewed with and politely ask for feedback on your interview performance. This can help you identify areas for improvement.\n5. Consider additional training or certifications: Look into online courses or certifications that can enhance your skills and make you stand out to potential employers.\nRemember to take care of your mental health during this challenging time. Surround yourself with supportive people and don't hesitate to seek professional help if needed. Stay positive and keep pushing forward. You've got this!",
            "The issue regarding retail jobs is that some won’t hire you if you are overqualified. Employers wants long term employees over short term.\n\nTry talking to a local hiring agency. Some local small companies or business may have extra work or overflows ask them for work and give them a cut of it.",
            "Firstly, I’m sorry you are going through a tough time. Not sure if you are looking for sympathy or advice, but I’ll go for the latter: I think it should be painfully obvious to you that something doesn’t add up here.\n\nYou mention all your qualifications and you have less than a 1% interview rate? Something’s not right. The first thing you need to fix things, is stop assuming you are “owed” a job. Jobs are not just awarded to the best students. The real world is much more complex than that.\n\nNow, you need to assume you are approaching things wrong. Either your CV sucks, or your contact strategy or something. Maybe get some professional advice on job applications? Applying for a Tech job is an art in itself.\n\nBest of luck.",
            "Top 50? Thats an interesting way of putting it. Is it ranked between 40 and 50?",
            "it honestly just feels like its really hard to get a job right now everywhere. at least in my state.",
            "In 9 years of working for different companies, I've never ever been asked for leetcode questions. Why is that so important?",
            "All I see is negativity in this sub, would y’all like me to create a little guide on how to secure a job in CS? I’m still in school but I can share some of the experience from my cousin. This would be free ofc",
            "This is not your fault. Market is so much smaller than last year around this time. Give it a few months to a year.",
            "I think you should at least knock out some bounties on Replit or github. That'll at least help you make some money.",
            "Hey, could you do any cs tutoring in your area? Some rich families pay very well for their kids, and you would be making money, explaining code, and still have enough time to keep applying. Ask your friends who have gotten a job in the industry to do mock interviews with you as if they were recruiting for their department. \n\nI've also been jobless for a long time before and was near suicide. I got a shitty gig in the meantime until I took the risk to quit in order to focus on my mental health. It sounds trite, but unemployment teaches a lot of things that you don't realize are valuable until years later. The memory of it all keeps you level headed when things get better, and they WILL. \n\nYou just graduated college right? Marriage should be the least of your family's worries right now, and anyone who thinks you're not marriage material for being unemployed as a fresh grad can fuck right off. As you get better jobs, the quality of the people around you and the people you can date also improves.\n\nBest of luck and a virtual hug!!",
            ">2 internships during college. One as a data engineering intern and another web dev both at a Fortune 500\n\nWhat happened with those? Did you ask your managers about continuing the internship into the fall? What about coming back the following summer?\n\nI was picked up as an intern at a company I could reach from my school. Worked the fall both remote and in-office. Was hired part-time day before spring semester. Started my 6th year there this past May.",
            "Are you not able to get return full time offers from your previous internships?",
            "Work on something else. The market is going to change eventually.\n\nHow and WHY did you sent 800 applications...? I'm in a similar situation as you. Only that I have not sent that many apps. After a while one realizes that it's like trying to make a rock bleed. Its not gonna happen. Instead of spending half your day sending apps, do something else: go to the gym, find a girlfriend, read non-technical books, read technical books, travel if you have the opportunity. Again, trying so hard under this market is pure stubbornness, once the market gets better, you will only need a handful of applications to land a job. I'm not saying you should stop trying, but don't try as hard, it makes no difference, send a few a week; try in latam, asia, africa, find a job in sales or an outdoorsy job and come back to your cs life once it is possible to earn a living with it.",
            "You did not fail yourself nor your family. You are doing everything which is under your control. Nothing to be ashamed of.",
            "Same I did computer engineering and I can barely get a interview. Also got to remember a bunch of people got laid off so the market is saturated for us with people with experience already. I’m a new grad and they want 3+ years of experience I can’t find any entry or new grad roles at all",
            "I’d recommend networking on LinkedIn. \n\ni.e. finding people that work in the field you want/the company you want and reaching out for a 15 minute phone call.\n\nI spent 5 months doing this and was lucky enough to get a referral for my first position. It was awkward at first, but after awhile I realized most people were happy to chat and share their knowledge and experience.",
            "Are you egyptian?",
            "Get resume reviewed if you haven't already. Your best bet is posting it here. Most of the time, when I see these posts it's usually because OP's resume is... Ass.",
            "I feel you about the retail work buddy. I’m always afraid I’ll get a job offer right when I start there but it’s not looking like it. Maybe I should just work retail because who knows when I’ll be hired",
            "My company let go a bunch of engineers but we definitely need engineers to meet their lofty goals so I think companies are just lean right now and want more engineers. Once the company feels they are in a better market they will probably hire 200 engineers again.",
            "I think that sometimes we have to take an alternative route. More and more companies nowadays open it jobs only internally, and only small pull of candidates is being recruited from the outside. Take a look into different positions within companies that have somewhat large it infrastructure (which a lot of companies have now), work for few years, make connections, and start applying for internal positions in it. Two-three years working for a large company in the it unrelated field is better then working in the retail store. At the end of the day, you have a degree, don’t sell yourself short.",
            "You have fang and can't get a job? Damn that makes me feel bad.",
            "Say fuck it and reinvent yourself. You will anyway and it will be less painful.",
            "Have you applied to defense industry positions? It’s pretty much only behavioral interviews so as long as you can do that you’ll get an offer.",
            ">I come from an south Asian background and my family expected me to me to be working by now so they can get me married but I have failed myself and my family. \n\n~~You bring dishonor to your people and your nation~~\n\nAnyways, chill out man. There may be expectations of you from your friends and family, but always remember that you are doing this all for the benefit of yourself. It’s alright to fail after all; to whom are you trying to please with such expectations? It’s your life to lead, after all.\n\n>My soul can’t handle this anymore and I have fallen into a deep depression.\n\nAnd no, whatever circumstances you are experiencing right now, there are people out there who are having it worse than you. People without family, without food, or hell, even without a formal education trying to break out from this vicious cycle of poverty. Consider yourself fortunate that you are blessed with these opportunities to begin with, and know that it is alright to fail and take your time in the job hunt. This is nothing akin to depression or the storms people are weathering in day to day.",
            "If you’re so amazing why didn’t you get a return offer at your internships?  You had internships at great companies but never state why you don’t get a return.  Was it the quality of your work?  Did you \nhave no business acumen?  Was it your attitude? If I were a hiring manager I would think this was a red flag.",
            "I'm sorry but if you applied to *800* openings and didn't land anything after getting 7 interviews, you might be the problem. Maybe something personality related that the recruiters don't like? Maybe a lack of skills? You have to show enthusiasm and flexibility in interviews, that's really important.\n\nI've applied to maybe 5 companies throughout my career and got 3 jobs out of that. So it does seem like you're doing something wrong.",
            "The market is abysmal right now, even for experienced devs. I have 5 years of experience and am getting less traction than I would say I ever have in my career. But that being said I wouldn’t go for the “I’ve done everything right, why isn’t it working?” excuse. I assure you there are people in much worse positions, bootcamp grads with no CS degrees, people who didn’t go to recognisable schools, and don’t have good GPA’s, who are still landing jobs. There’s no such thing as doing everything right, it’s all about how you market yourself. You could have engineered a rocket ship for all I care, if you can’t properly market that to the right person, no one is going to hire you. \n\nIf you want the best shot, pick a niche, you say you did full stack web development for example, so focus on that. Look for roles seeking people with 1-2 years of experience in that niche, and tailor your resume to that role. Break down your personal projects and past experience in detail in your experience portion of your resume, and be sure you’re checking your resume for ATS compliance and notable keywords with the job posting. Continue doing personal projects in that niche, and if possible even build a portfolio website to better market yourself. Get your resume reviewed by at least 10 different people, preferably more experienced engineers. I could review it if you DM me. \n\nI’m not for sure on this, but based off your post I can assume you are essentially spamming out the same resume, which might not be very well written, or ATS compliant, to a ton of employers, and with little care to whether or not the job description is even tailored to the experience you outlined in your resume. This method of job hunting is essentially the equivalent of throwing a large net into the sea, and seeing what you catch, when what you really want to do is tailor your method of fishing to the exact fish you are looking for.",
            "Who says you have to get a job in CS? Go supermarket until u can find one!",
            "I think electrical engineering, mechanical engineering, and probably computer engineering are the big ones in terms of job market now. There is always an oversaturation of computer science and folks can very easily learn most of the stuff and get experience at home. Engineering with expensive equipment...not so much.",
            "Reach to your LinkedIn in connection, connect with your friends and ask for referral, referral always work buddy😊\n\nIf you are Indian try hirect app",
            "Network more in person\n\nedit: You probably suck at it. Git gud.",
            "Seems like a skill issue",
            "Where did u graduate from if u don't mind me asking OP?",
            "Light at the end of the tunnel, head high",
            "Hey, I'm sorry to hear that, despite doing well in interviews, you're not able to get a job, likely due to the current hiring climate. Please send me a DM so I can learn more about your situation and perhaps help.",
            "Dude you definitely work twice as harder than me but I managed to get a dev job just by networking with people. Network with people, that’s the only way to get a job nowadays.",
            "I don't knownwhats going on but if you cant find any luck, work for an insurance company for a lil bit until you find a cs job. Just a suggestion.",
            "Try networking with people and get referrals. I started my job search in the month of June through applications as well as asking referrals from people on LinkedIn. I got 0 interviews through application and 3 interviews through referral. I am currently employed in one of the company because of those 3 interviews. So considering the current market situation, reach out to the people for help.",
            "It’s the market right now. Try an apprenticeship until the market changes top of next year.",
            "You can’t just apply.  That’s like buying lottery tickets.  Join my coaching circle every Friday at 11:00 AM  PT and I’ll show you how to get what you want.  Hit me on LinkedIn.  I’ll give you a free pass.",
            "Sounds like you need to get away from your family.",
            "I'm fucked",
            ".",
            "First time hearing about leetcode. Will def look into it. Good luck, lad.",
            "Oh boy"
        ]
    },
    {
        "post_id": "1c7uzqf",
        "author": "Many_Butterscotch892",
        "title": "The backup/better plan for everyone ",
        "url": "https://i.redd.it/8huirjad9evc1.jpeg",
        "score": 1335,
        "num_comments": 115,
        "created_utc": 1713527694.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c7uzqf/the_backupbetter_plan_for_everyone/",
        "comments": [
            "How many different ways could they possibly explain what a linked list is?",
            "[deleted]",
            "Yep. CS is a pyramid scheme. Reminds me of all the coding bootcamp grads who couldn’t get a job and now teach at the bootcamps for $15 an hour💀",
            "I have seen this before , it was some Egyptian scheme",
            "In a gold rush, don't dig for gold, sell shovels. They are just selling the course",
            "Ironically these guys are probably earning more from their bootcamp, youtube etc. Than what they earned at their jobs",
            "Did they really resign or was it a layoff",
            "Tech Ed is saturated. They can pull it off because of their resume.\n\nMore power to them though. If you have google/microsoft under your belt, reap that shit.\n\nIt’s hard work though. You need to build your personal brand and constantly post on medium/substack/linkedin.",
            "and all of them get diffed by abdul bari 💀",
            "Glad i am away from this.",
            "Yet no one seems to be able to make a good for loop video smh lol",
            "if you went to hustlers university you would realize that this is the play",
            " I really hate how people even go and buy all these courses. LeetCode and CodeForces are available for FREE. You can learn on your own for free. A lot of people just think that if they get a course, they will be able to master the material without having to work as hard, but actually that doesn't happen. \n\nI also think it's really weird for people with 2-3 years of experience quitting a job and then teaching people how to get that job for another 10-15 years.",
            "And then there’s us who can’t even get rid while these idiots play around.",
            "These are the same people who say don’t major in CS because it’s impacted 🤣",
            "This is funny lol",
            "might as well be professor",
            "I love the view differences",
            "They can clearly work at top companies, at least for some time. It's probably just easier and less stressful to make courses.",
            "These guys understood that a 9-5 with a low salary is not worth it, and know that as a content creator they can make lakhs with minimum effort and also people would pay anything to get into FAANG. The same trend has been prevalent in the US for years now.",
            "Bunch of quitters.",
            "tan theta = sin theta / cos theta , but i dont know where to use it",
            "I will always laugh at these scam artists because the truly good educators on youtube aren’t charging for courses. They let their content speak for itself and rely on direct voluntary subscriber support and ad revenue and sponsorships. \n\nChannels like Mark Rober, Colin Furze, Computerphile, Folding Ideas, Jame Bruton, Maker’s Muse, Teaching Tech, Acerola, MirageC, No Boilerplate, PBS Space Time, Stand-up Maths, Stuff Made Here, Technology Connections, Tom Scott, Veritasium, Zack Freedman, People Make Games, jdh. \n\nI have no time for the hustlers and scammers who prey on peoples dreams of escaping wage slavery by promising a shortcut alternative to an actual education.",
            "I didn't resigned, I was part of a layoff 🥲",
            "shovels",
            "Shill baby shill!",
            "How do we know you actually worked at [insert company]?",
            "When there is a gold rush, sell gold digging courses is how you become rich…",
            "🤣",
            "There’s way better and free DSA courses than their garbage too 😭",
            "There are several free lectures on programming which teach a lot more than these guys on youtube itself.",
            "Lol even tech companies are selling their own courses and made up certs. \n\n#2 sell the tools for the dream: you are the product",
            "sell shovels instead of digging gold",
            "So many of those, but for some reason, I can't find the running time of the mod operation is and have to look in the academic literature",
            "Sell the shovels! Lol",
            "Yeah. Basically 🤣🤣 But I'll pass. I'm not that passionate about tech to do that",
            "How can you legit know they actually worked there?",
            "It’s a lot easier to scam desperate people on YouTube then move protos around all day."
        ]
    },
    {
        "post_id": "1c1uizv",
        "author": "Bugugan",
        "title": "Is this what being CS grad has come down to",
        "url": "https://i.redd.it/qg82k377vxtc1.jpeg",
        "score": 1340,
        "num_comments": 83,
        "created_utc": 1712879844.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c1uizv/is_this_what_being_cs_grad_has_come_down_to/",
        "comments": [
            "Get dancin lil bro",
            "You better accept it. 🤣",
            "I've gotten so many recruiter messages about teaching/tutoring opportunities.. it's wild",
            "Apply lol but be warned they might be moving forward with a better candidate",
            "This is me with Handshake",
            "Good for you, I am getting Janitor roles in my notifications from Handshake 😔",
            "Are these even real? I’ve received so many of these types of emails for dev positions.",
            "Get ready to learn salsa, buddy",
            "Is either that or being a hobo. Choose your weapon",
            "Arent these automated recommendations from indeed and not actually the employer ?",
            "Plot twist, the dance company has connections with the big 5 😩",
            "😭😭😭😭😂😂💀💀💀",
            "I’m in Sac and it’s brutal out here for us 🤣",
            "bust down",
            "Who says computer scientists don't have groove?",
            "Yea I got one today for customer service car wash technician whatever that means.",
            "Uh huh…. Tell me more about how you like the way the employment system we have works for CS majors.",
            "Dude as cs grad you should take anything at this point, faangmula is wet dream",
            "Code monkey to “dance, monkey!”",
            "I created a SDE profile on 'apna' app. They be wilding sending me jobs of \"Mazdoor/Labour\"💀",
            "Hey I’m that area, there tell me how to apply",
            "Handshake and Indeed have a dump job recommendation system.",
            "I never respond to those indeed emails... are those ever legit?",
            "LOLLLLLLLLL",
            "Probably a lot more fun career path, go for it it",
            "I would take this job. Anything is better than nothing. Might as well hook up with some female students that come to these classes.",
            "Time to teach interpretative dance to computer boot up sounds",
            "Damn, did you go to Sac State? I’m transferring there from community in the fall",
            "Indeed just spams out random things based on words in your resume.",
            "I kept getting one to be a chess instructor in NYC. I don’t think I’ve played chess since before I was an adult.",
            "Put your push and pop skills to the test!",
            "Interview rounds be like 1 2 3 4, 1 2 3 4",
            "Can you even dance? 😭",
            "I was a teaching assistant for two semesters and on occasion I'll get recommendations for teaching assistant positions at daycares.",
            "The computer science job market isn't as bad as it's made out to be.",
            "I'm a CS Grad student and received a similar message asking to coach a roller hockey team for a camp mentioning how I'll be a \"great fit\".",
            "**Work Experience:**\nCha-cha real smooth",
            "I wish I got offers like this",
            "Not uncommon for grass not to find work.  Colleges sell a false bill of good with the degree BS.  Entry level work is more certification driven and not degrees.  Get a couple certs.\n\nR/CompTIA_GingerSec",
            "These are automated",
            "Start bussin it down bro",
            "Just got offered a daycare position ‼️",
            "I was getting sales calls recently..",
            "I keep getting one for being a chess teacher in nyc for 50k 🤦‍♂️",
            "Dancing is better than bending over.",
            "Get dancing dude. Then while on the side do her website for 10 dollars",
            "How many dance recitals have you memorized? What kind of dance media do you consume? What dance would you do in front of a million people if you broke your leg and were dehydrated from not drinking water for three days? And what is the time complexity?",
            "It’s either tutoring or cold-call or pyramid scheme sales"
        ]
    },
    {
        "post_id": "yla8th",
        "author": "BeautyInUgly",
        "title": "What the fuck?",
        "url": "https://www.reddit.com/r/csMajors/comments/yla8th/what_the_fuck/",
        "score": 1325,
        "num_comments": 312,
        "created_utc": 1667499583.0,
        "selftext": "Lyft layoffs, Stripe Layoffs, Cloudkitchen layoffs, Twitter layoffs, Amazon freeze? Google PIP? what the fuck happened today and good luck to new grads and interns cuz holy fucking shit",
        "permalink": "/r/csMajors/comments/yla8th/what_the_fuck/",
        "comments": [
            "forgot about Apple freeze lol",
            "New grad here. I’ve an offer, I signed it. I’m joining in January, but still scared asf. Like what if they cancel my offer and say hiring freeze?",
            "Literally didn’t get my offer from AWS yesterday because of the hiring freeze, passed the interview and was inclined by the team but I guess I just have bad luck :(",
            "You just gonna sneak Cloudkitchen in there and think we wouldn’t notice?",
            "Every year the Phillies win the World Series the economy goes to shit (fuck don’t make me root for Houston)",
            "How the fuck does AWS freeze wtf?!\n\nThis short term's screwed",
            "brb fucking off to grad school to ride this one out",
            "What happened was the interest rate rise yesterday. Liquidity for tech companies is a concern right now.",
            "Economy bad, buy puts.",
            "Recession bells are chiming",
            "What are international students graduating in 2023 planning to do? (Asking for a friend 😒)",
            "Also what is up with all the job listings lately! Everyone is asking for +3-5 years of experience for a frontend dev. It’s gonna be a bloodbath for anyone trying to start their career in tech",
            "Bruh I just had internship final rounds and am shitting myself lol",
            "Tough road ahead ladies and gents, keep hustlin!",
            "Different industry but coworker graduated in '08 and couldn't get a job so went for his MBA. He still has school debt and was forced to take random roles throughout the recovery. Prepare for the worst folks",
            "new grad here with 2 FAANG internship experiences and can't land interviews. I think I'm just going to take a gap year and try something else! time to quit cs!",
            "Well this has been priced in for the new grad market for the most part at least. Don’t be afraid to sign multiple offers y’all; nothing worse than getting your shit rescinded weeks before your start date.",
            "I’m graduating next summer. Fuck me :(",
            ">what happened\n\nAs a response to COVID, the world shut their economies down, printed a bunch of money, fired a bunch of people, kept interest rates low (there is an inverse relationship between inflation and interest rates) etc. This was always going to happen. Remember how “money printer go brrrrrrrrr” used to be a meme? These are the consequences of shutting the world down for 2-3 years while keeping it afloat with moratoriums and money printing.",
            "[deleted]",
            "Good luck everyone 🥲 it’s going to be bumpy ride",
            "2023 grads should be picking up labour skills on the side or going to grad school.\n\nShits gonna be fucked",
            "Lost my swe offer because if the freeze. I want to cry lol",
            "The good news is that computer science is very extensible. New grads just have to go towards the industry that is doing well. Tech sector sucks right now, no problem, let me try finance, or healthcare, or whatever, because computers are everywhere and Twitter can go to hell.",
            "I’m a new grad, and I’m just going to apply to startups honestly. Guys, let’s not focus only on FANG. You will get much more interviews, and your impact as a swe will be much more important.\nWe can apply for FANG next year.",
            "whaaaat,",
            "It’s rough out here.",
            "It’s because is Winter 🥶",
            "I graduated into the Great Recession, it ruined my life for a decade.  After the Covid shutdown it took less than two years for the country to return to full employment.  After the global economic collapse of '08 the country didn't return to full employment for 8 years.  Good luck everyone, and welcome to the club.",
            "It's the end of the year.  Don't a lot of companies usually freeze hiring at this time?",
            "[deleted]",
            "yall thought 2018-21 was the norm for hiring? Hop on board in 3-4 years once we have low interest rates again and all you needed to do to get a job is leetcode.",
            "At least my local company internship has been asking me to come back and stick around 🥲 I might just have to",
            "This wouldn’t be happening if Jobs was still here 😓",
            "Google PIP?",
            "Im glad that i graduate in 3 years. Hopefully things will be better.",
            "Big opendoor layoffs today too",
            "bear market things. It's 2000-2003 all over again.",
            "Good thing I'm just applying to start ups and small places. No way my indistinguishable unaccomplished ass is getting into any of the big companies anytime soon especially with all the layoffs and shit. Looks like maybe tech field is gonna implode with supply outpacing demand.",
            "Just accepted an offer at a F500… Good luck to everyone working hard and applying everywhere.",
            "Plenty of opportunities at stable defense contractors",
            "I graduated with a bachelors in 2009. I couldn’t find anything so I went back to school for a masters while working at a Best Buy in a trendy area.\n\nA year later I was working in a staff position at a university who paid the last two years of my masters. There are many other worse path than doing  what I did.",
            "Amazon layoffs as well apparently. I’m just a freshman but still it’s very unsettling",
            "I got laid off last friday",
            "Defense seems to always be hiring (I work at one rn as a SWE) and usually don’t have hiring freezes. I know most of you are looking for a big tech role but look into this area if you’re wanting something pretty chill and secure during the freezes. Bonus is that if they pay for your clearance you’re sitting at home atleast 5 months+ so you can go get a free masters on them lol",
            "Calm down a bit.  it does suck for those in these companies, but this is more of an issue with the economy than with the tech industry. Economy level employment is cyclical and this pattern has come before and will pass.  even so, there are still so many tech jobs that need to be filled by talented people.",
            "you are fine, you have 100 jobs out there thats available and pay normal money",
            "> what the fuck happened \n\nBiden happened",
            "Surprised POTUS would allow this with less than a week before the election.  He’s losing his grip on that “not a recession” talk.",
            "Everyone of you who voted for Biden and his profligate spending: here's your sign.",
            "GL!\n\nI graduated 4 years ago and still haven't gotten a job.\n\nSilicon Valley, who does your daddy work for?",
            "Snapdocs just announced a 15% layoff today",
            "New grad here, i have a verbal offer from a non-profit government contractor. They said I can ask for the official offer whenever im ready to accept it, so I'm still interviewing at other places. My plan was to accept it in January, do yall think that verbal offer is safe since its a nonprofit government contractor?",
            "[deleted]",
            "Yep just heard about 2 guys from my batch in college getting laid off. Crazy shit. I'd better listen to my manager and change locations soon I guess.",
            "The Fed is admitting inflation",
            "Inflation is causing the fed to raise rates, which impacts capital markets and increases the chances of a recession.",
            "just curious as to why these \"freeze\" happen in these tech companies? Can one judge the scope of future jobs through this - if so, what would it be?",
            "Tech recession",
            "Do these apply to internship roles as well?",
            "Tech and real estate are the first to fall in this time of rising fed rates. Still a lot more pain to come in these two areas until the rest of the economy starts to react.",
            "We all fucked up",
            "Healthcare meme worked",
            "Anyone waiting on team matching for Google new grad ? Or has anyone received the offer yet in these last weeks?",
            "The big players just outgrew the market a bit. Throw in a little economic uncertainty and they start deflating a bit, but it'll turn around soon enough. I don't see any shortage of dev positions happening, but you might need to cast a wider net to get hired as a fresh grad.",
            "But UX is still going strong right?",
            "The healthcare sector is hiring… at least till oral arguments next week in the supreme court. Case is Health and Hospital Corporation of Marion County v. Talevski. \n\nAlso military is hiring. Um see, the war in Ukraine Has basically become an exhibition for US arms…",
            "the fed signaled the continued increase of interest rates.  \n\n\ntech companies,  don't really make money,  so they operate on leverage/debt more often than not.   When it's more expensive to borrow.  these sorts of companies get fucked pretty hard.  \n\n\nbut instead of cutting top line pay to execs,  or ...just saying.  yeah, we're gonna eat shit for awhile but we're still strong.      If you axe 10%  20%   or whatever percent of staff.  it shows a massive savings on the balance sheet.   and bingo bango.... ceo gets their bonus.",
            "I got a call from my recruiter earlier this week about onboarding and I'm just crossing my fingers that doesn't change come January lmao.",
            "It’s normal in this season, it mostly happens every year this time around. Hiring may start again after new year, but let’s see how it goes",
            "Recession",
            "Try the next best thing gov contractors are always hiring",
            "will i be affected as a 2024 spring grad? i cant land interviews rn but ive had 2 internships :/",
            "Yeah this sucks I just committed to quitting my postdoctoral position (not a CS major, lul). But I am still hopefully as many local companies are hiring and I honestly want to work in a chill office not Amazon Netflix etc.\n\nBut the big market correction seems scary for sure. It’s already tough as balls for juniors in this field compared to others. Maybe time to apply to the junior positions at consulting companies..",
            "Feds we're talking about a hold on corporations hiring people to make people desperate enough to work pre pandemic wages to try to straighten out the economy.  Basically starve em till they break.",
            "where can I find information like this?",
            "is this for EU as well????? i passed the OA for Amazon and was waiting for an interview call bruhhhhh!!!!!!",
            "Interest rates go up\n\nStock market goes down\n\nVC’s / banks / institutional investors can’t borrow money for free anymore\n\nCompanies try to push up stock price by laying “redundant” people off / downsizing\n\nNext step is mergers, with the same result",
            "Just take a look at the tech stocks, last couple of months.",
            "Fed raised rates again and are hinting at policy shift. Companies are being tighter with their money knowing getting more capital isn't going to be free like it has been. Battening the hatches for rough economic conditions.",
            "I graduated back in may and still can’t find anything. Haven’t had an interview in a month",
            "Patagonia vest recession",
            "Graduating in may 2023, y‘all think this affects me aswell? Europe btw",
            "Put in for municipal jobs, no fear of layoffs and the benefits are \\*Chefs Kiss\\*.",
            "Twitter layoffs make sense, those weren't real jobs",
            " grind leetcode harder",
            "I’m so glad I didn’t have my heart set on FAANG work when I graduate. Like this is legitimately so scary. What if other companies besides huge corporations and FAANG follow suit?",
            "They're trying to convince you to take less money elsewhere, bringing down the market rate, then they hire you later for less than you'd take now (inflation / time in career adjusted).",
            "the people wanted communism. this is it.",
            "As someone graduating next May, I’m really not looking forward to it. Fuck this shit",
            "more people work for not-the-megacorps as work for them.\n\nOf course, it's almost as impossible to tell a high school grad that most of the jobs they could probably get hired doing they've never even heard of yet are right nearby, as it is to tell a new CS grad that the megacorps aren't actually that much of the job market - there are lots and lots of small, medium, and large company possibilities that aren't mega.",
            "Significant margin compression forecasts means cutting out the fat. After months of rate hikes increasing costs of business, this is only natural",
            "I was just sent a Amazon assessment for a Junior SWE position. I’m assuming that’s off the table now?",
            "We might have a huge crash and recession right after New Year. Once the retailers' sales are posted (presumably, pessimistic). All companies are slowly preparing. Another hint has already happened - transportation got much slower. Those guys see everything because all market activity depends on supply and if supply in general for all kinds of companies get slower... you figure out.",
            "Stop trying to only go for tech companies only.",
            "Go to smaller companies… the pay may not be as much but you get health insurance, great company culture and you become friends with everyone you work with. You feel like a person, not a number and your individual thoughts are heard. The entire computer science umbrella isn’t held up by these big companies that take advantage of their employees",
            "Mellinnials giving an evil smile, because now GenZ can suffer a \"once in a lifetime\" job shortage...\n\n\nJoking of course, because this sucks regardless of generation. Profits over all else will give us this.",
            "What's \"Google PIP\" mean?",
            "New grad here starting in January, coming from across the border. All we can do is drink some hopium Kool aid boys",
            "Posturing for incoming recession (yes it's still coming and we're starting to see the droplets of that incoming storm). Your best bet if you're job hunting is to find places that are \"recession proof\" which are unfortunately boring jobs in companies that provide essentials to the public (e.g. food and other supplies including pet supply, etc.). \n\nI'd probably also recommend against any job that is mass hiring with a product focused on business efficiency (e.g. collaboration software). They're likely just hiring for you to push an initiative that has a strict get to market deadline at which point they'll lay you off and replace you with offshore Indian contractors. Basically, they're just using you as a high-quality contractor by disguising you as an FTE. A kind of pump and dump.",
            "."
        ]
    },
    {
        "post_id": "xwhz0f",
        "author": "loggggerrrr_22",
        "title": "Woke up to three rejection emails and then decided to sleep in",
        "url": "https://www.reddit.com/r/csMajors/comments/xwhz0f/woke_up_to_three_rejection_emails_and_then/",
        "score": 1324,
        "num_comments": 121,
        "created_utc": 1664993660.0,
        "selftext": "Life is good",
        "permalink": "/r/csMajors/comments/xwhz0f/woke_up_to_three_rejection_emails_and_then/",
        "comments": [
            "I’ve been super numb lately but I felt this 🥲",
            "Rookie numbers",
            "57 rejections and counting so far",
            "The worst feeling ever. But remember, we only need one.",
            "At least you’re getting responses …",
            "I feel for you op!\n\nIt's wierd, but I kinda turned it into a game. \nI see it as \"oooo, how many can I get before I actually land a job?\"\n\nIt's actually enthralling because you will be able to say \"I went through 1000 rejections, but I never gave up!\"\n\nI know nothing beats getting a job, but hang in there. I know you will get one!",
            "I feel very lethargic lately getting rejects everyday.",
            "Lately its been like if I don't see at least 1 rejection email on a daily basis then I know, I have been applying to less positions.\nYes, an international student here. 😵‍💫",
            "I remember getting rejected for a target cashier position two years before a full time position at Google. Don’t give up!",
            "“Every strike brings me closer to the next home run.” - Babe Ruth",
            "BRO I GOT 8 REJECTIONS BACK TO BACK, SAME HOUR, TF YOU TELLING ME !!",
            "2 rejections so far Jane street and Microsoft",
            "I can’t count the number of rejections prior to my current offer. It is true that every rejection is a redirection! Keep your momentum and never let anything bring you down!",
            "In five months over 200 rejections and I am defeated",
            "When it starts with “thank you”",
            "Pro tip: if you don’t fill out very many applications, you won’t get very many rejections.",
            "I’ve lost count  at this point",
            "Congratulations on all your hard work. Resting is essential in order to be energized and do a good job building your future career.",
            "Are any of you guys working with reputable recruiting firms at all? \nI am working for one now at a role that I was hired for and started the following Monday, after background stuff, in Network and Operations Support for Insight Global at X company.\n\nThey always find overtime paying roles  and benefits and a package. I have signed a minimum of a year each time  with the OT, and have been brought on FT everytime. They literally have another role immediately anytime I feel like looking.\n\nNo affiliation or finders fee. Just saying,  once I started working with Aerotek and Insight they take care of everything. I had one phone call on this role with my now Manager for the interview.\nThe most I've ever done through them is 2.\n\nLook into editing your resume using whitespace.\nApplicant Tracking Systems scan keywords.\nI just type the role key words at the bottom of my resume, then just change text color to white. \nThe ATS picks them up, but they aren't visible to the eye.\nTry it and and see how many roles call you.\n\nGood luck everyone and God Bless!",
            "Those are rookie numbers in this racket",
            "I just got my first one yesterday! Do I get a prize?",
            "Not sure what type of careers/internships everyone is looking for. But I came onto reddit specifically to help students with the challenges they are facing in the market today, so feel free to reach out to me, you or anyone that is interested in a quant finance role / and looking for ways to get your resume to stand out. ( Literally not selling anything, not asking for any money, or really anything, just an entrepreneur that went through so many challenges, and its network and support that get you through. I have had amazing mentors and advisors and no I make sure to give back more than I took)",
            "[deleted]",
            "Got rejected from Walmart. Like bruh, your stores are either super ghetto or super white trash (sometimes both). What kind of standards y'all have?",
            "... you know what I mean? Hundred thousand on the cheapest ring on the *****'s little finger lil bitch!",
            "No return offer, sad. Need to go back and grind questions T.T",
            "I got 5 rejections from IBM in the same email today 💀",
            "Have you graduated? If so do you have experience like internships? Show us your resume that's probably the issue",
            "Rejections don’t surprise me",
            "Constant retooling is your friend. Sometimes it’s your resume, projects, whatever it is keep trying eventually I hope you get something my friend.",
            "I'd rather receive a rejection than be ghosted. Perfect mood to sleep in",
            "Don’t give up … don’t turn on yourself .. i know it’s demoralizing but push through !! All you need is one ! Good luck",
            "Mood",
            "It's not like fishing, You don't just throw out a big net and expect to catch something.",
            "As one does",
            "Rejection speaks for itself",
            "bro woke up feeling dangerous",
            "LinkedIn is even worse if you apply for jobs through there. They send rejections in the batches. 😭",
            "Damn, I don’t even finish reading their email and hop on LinkedIn to apply some more",
            "Blanketing the market in the same area with blind resumes is a bad idea. I personally have regretted doing it as it came up in an interview.\n\nThey offered a very low $$ rate for the position. They had already heard of me through the job hunting wind I guess.",
            "I like to see how many I can get within the same hour. \n\nCurrently my high score is 3.",
            "Doesn't feel much, iam habitual.",
            "At least you're getting a response..",
            "I feel this, trying to stay positive and do what I can but it is a bit discouraging. I had 1 great internship and thought it would help open more doors, but I feel like I'm back to square one with sending out my resume and getting constant denial emails back.",
            "I did this today! Woke up to Microsoft reject email and slept for 2 more hours",
            "I got like 2 rejections, bruh can't stoping.",
            "At least you heard back, keep trying",
            "Damn, I just got rejected in roles at a company while my friends are all getting accepted. Life is sad, but well opportunities are always there I guess no need to be down from a little rejection.",
            "Only 3?",
            "mood",
            "sucks when u have final round then final cus u put so much emotional and mental weight into it",
            "Based",
            "Haha, same story here.",
            "workin on the weekend like usual",
            "My life",
            "Woke up to 1 and continued to receive 1 every few hours. Now the current total is 4 and I will be on airplane mode for the rest of the day.",
            "felt heavily",
            "Mood right here",
            "I am not even receiving any rejection mail from the internship interview it has been 2 weeks",
            "Ahhh rejection 9,855 and I still have an ice cold beer after working 10 hours at the airport warehouse every night",
            "Shit I get like 20 a day for the past 5 months",
            "Same",
            "Getting rejection letters are pretty good. Most don't bother",
            "At least you got a response. When I was job hunting I wouldn’t hear back from them at all",
            "Damn. I have a question. When you say “rejection” do you mean your resume was rejected, or interview went bad?",
            "Three thousands rejections and 30k debt I need a got dam job",
            "I've applied to about 500 software developer positions, and have been rejected outright before even getting an interview by 480 of them, got interviews for 20, and landed 0.\n\nThe whole \"wE'rE sUfFeRiNG a ShOrTaGE\" is a fucking lie. The tech industry is just trying to get more and more people to graduate with a CS degrees to drive down wages. Why do you think software development bootcamps have taken off nowadays? It's to increase the competition so we have to settle for less and less. This entire shit is a fucking scam",
            "I think I applied to 150-200 job roles. \n\nI received Interview request for 5.\nOut of those 5\n1 cancelled because of hiring slowdown\n2 Ghosted \n1 rejected\n1 waiting for an update but I think I'm probably gonna get ghosted again. \n\nI have a Bachelors in something completely irrelevant and a Master in Data Science. I did a summer internship over the summer for a major company but didn't receive a return offer because of slow downs. \n\nI am finishing up my Masters this semester but my anxiety is getting the best of me....",
            "Lmfaoooo",
            ":(",
            "Surprised you decided to wake up.",
            "."
        ]
    },
    {
        "post_id": "1ci0mi9",
        "author": "Wise-Okra-5654",
        "title": "Gentlemen",
        "url": "https://i.redd.it/7ewjwt1ifwxc1.jpeg",
        "score": 1322,
        "num_comments": 66,
        "created_utc": 1714605850.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ci0mi9/gentlemen/",
        "comments": [
            "Congratulations!",
            "Congrats!\n\nOFF TO JIMMY JOHNS WITH YOU",
            "EDIT: I can’t figure out how to edit my post, but I honestly posted this as a joke since I used to see these all the time the past couple of years and I saved it down thinking I’m gonna post this one day.\n\nand I just remembered today on my graduation day!\n\nso I really appreciate the love from yall, I wish all of you the best in this career as well!! 😃",
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)",
            "Congrats",
            "congrats!\n\nme Too!",
            "Congrats! Now give me a referral 😡",
            "LETS GOO!! Hope your future with this major goes well",
            "Let a = \"Congratulations\";\nConsole.log(a)",
            "what are your key takeaways throughout your cs journey",
            "Congrats. Mind writing me a letter of rec?",
            "Got a few more classes to go til I’m out, I’ll report back soon. Congratulations!",
            "https://i.redd.it/q9mvqx9r90yc1.gif",
            "Congratulations!",
            "Ayyyyy nice",
            "Well Done!",
            "Congrats! Wishing u well brother",
            "Good job and congrats",
            "W and congratulations. 🥂",
            "😂😂😂😆",
            "Let's goooooooo!!!! Congratulations on graduating, my fellow!",
            "I'm sorry to hear about your unemployment! \n\nKidding aside, congratulations!",
            "Congrats on getting into McDonald’s you’ll have a long career of flipping burgers",
            "Are you working at Starbucks or McDonald’s ?",
            "Congrats!",
            "Somebody alert a Starbucks recruiter",
            "The entire comment section looks like that one nge scene\n\n![gif](giphy|i157x7wHuLJvtTslX6|downsized)",
            "https://preview.redd.it/143jilsga1yc1.jpeg?width=750&format=pjpg&auto=webp&s=96264dd190d27499c38129c35f4239075dde68e0",
            "Congo bro 🇨🇩",
            "Congrats!\nAlso, good meme choice.\n\nMay your harvest be bountiful.",
            "Congratulations 🎉🎉🎉 mate!",
            "Congratulations",
            "Me too!! Happy job hunting",
            "Congrats man. I just bombed my math trig test :D",
            "Congratulations same here. Which school?",
            "Congrats bro !  🎉  Also congratulations on having an offer lined up right away. Like you said this market is horrible lol. I still have 2 more years before I graduate 😞",
            "response_a = “Good luck when you get replaced by a computer.”\n\nresponse_b = “Good luck when you get replaced by a computer.”\n\n\ndef graduated(major):\n\n     if major != “CS”:\n\n         return response_a\n     else:\n\n         return response_b\n\nmajor = “CS”\n\ngraduated(major)\n\nNo but seriously congratulations!",
            "You left the unemployed part",
            "Congrats!! Hope your career goes exactly how you envisioned it",
            "Congratulations. Now, login back to pornhub.",
            "Trade you it for a hot pocket",
            "Congrats brother! Where’d you go to school at?",
            "🥳 congrats!!!",
            "Congratzzzzz",
            "Congrats broski. Was it worth it?",
            "Rest in peace homie not getting a job soon 😔🙏🙏"
        ]
    },
    {
        "post_id": "18hudqu",
        "author": "studyduddy",
        "title": "4 months of intern search (international student)",
        "url": "https://i.redd.it/layrxebkb56c1.png",
        "score": 1316,
        "num_comments": 108,
        "created_utc": 1702509862.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18hudqu/4_months_of_intern_search_international_student/",
        "comments": [
            "I think this one wins",
            "51 OAs💀",
            "how did you even find 1.2k internship listings, damn.",
            "Wild to see the amount of persistence but congrats !!",
            "Honestly I'm more amazed you found 1.2k places to apply to. Well done though and gl!",
            "Same bro like fr",
            "I thought my 843 applications last year were crazy enough. Bro you sure are over achiever",
            "Finally, something that looks realistic",
            "Which country?",
            "https://preview.redd.it/glxndeq4o66c1.jpeg?width=941&format=pjpg&auto=webp&s=d65505a0d3c97167f4b38da5f146d5f940f6e171",
            "How the hell do you find 1200 job postings?",
            "Holy shit",
            "1300 applications for 4 offers? I'm gonna die on the streets 😮‍💨",
            "What software made that graph",
            "GG fellow international",
            "Jesus I would’ve quit long ago. 1.2 k is insanity",
            "Finally a Sankey diagram that reflects my job search experience",
            "Was your offer in Canada?",
            "Are you also in school while doing this??",
            "That's amazing 👏 \nCongratulations!!\nI'm an international student too \nDid not yet get an internship, Applied around 300\nDo you have any advice regarding the right time for applications??",
            "This is why it’s so hard to get jobs, cos mfers out here applying to 1200 jobs",
            "Have seen many posts with these images , just wanted to ask what app is this?",
            "How many did you apply to every day?",
            "Where did you end up choosing the internship for now? Which country, I mean CA/US or the EU?",
            "can you pm what sites you used to apply?",
            "I don't know how much quality there is in the single application...",
            "How do u guys do this chart thing?",
            "This would be the realistic experience of international students in US, But I doubt we be getting 4 offers,\nMost would only be having 1-2 offers.",
            "this is why OAs are a waste of time",
            "Average international student experience",
            "Congrats on the offer! What does OA stand for?",
            "Wtf broski do you are you based in the north pole or antarctica??",
            "Whoa",
            "How much time it took you to apply on average .",
            "Hot damn",
            "And here I thought I had it worse until social network got me one...",
            "Which college are you from ? And what companies did you get an offer from ? And what country are you from ?",
            "Assuming that you are not a US citizen / lawful permanent resident, how does visa sponsorship work when you apply for internships in the US? I'm guessing you are a citizen of an EU country studying in Canada on a student permit.",
            "Dude as an international sophomore, I don't know what the fuck to do. Like I genuinely have no idea how many I should apply to seeing the number of applications some of you are doing. I have applied to like 100+ atp i got one interview. but because i am a sophomore, it's getting hard. Also got rejected from the competitive places",
            "Wham wham wham",
            "Of course it's going to take a fuck ton of applications, when you are just spamming a basic template. In four months, you've applied to 1259 places, that's roughly 10 applications every single day for four months. That's not realistic at all, if you're doing any work at all actually making a good application.\n\nSo yeah, of course it takes that many. Next time, don't spam them like that? Just make a few applications that are tailor made for a specific company.",
            "I feel like it should be a rule for post like these to also show the resume he was using during the search so we can compare.",
            "If this is true, I'd severely question the quality of each application. Let's just assume 1200 applications, 10 minutes spent on each (which is extremely short) and 4 months of applying - that's almost 2h each and every day for 4 months straight! And this does not even include researching the position. I also doubt that 10 minutes would be enough to tailor your application for the position.\n\nAs someone receiving quite a lot of applications, I'd recommend to spend more time on each one and prioritise quality over quantity. Generic mass applications typically go to the bin directly.",
            "Funny",
            "Me fr",
            "Congratulations on the offers🎉",
            "Im an international student too! Can I please DM you?",
            "Congras! Lucky to you!",
            "What's your profile like? How many years of work experience do you have?",
            "How does one find so many roles to apply for?",
            "damn..",
            "This is insane OP. Congratulations !\n\nBut also, what sources are you using for finding internships? I mostly use Linkedin, Handshake, and simplify github and I have only applied to half the number of places that you have. (including multiple roles at the same company)",
            "Welcome to Canada 🇨🇦 where your salary will only cover your rent",
            "Bigger question is, did you accept an offer?",
            "what‘s ur major？",
            "What’re your skills?",
            "How did you record your applications? Did you enter them manually or something? If yes, kindly share how you did it?"
        ]
    }
]