[
    {
        "post_id": "15q72rp",
        "author": "formerlypreviousday2",
        "title": "Told interviewers to go fuck themselves, how screwed am I?",
        "url": "https://www.reddit.com/r/csMajors/comments/15q72rp/told_interviewers_to_go_fuck_themselves_how/",
        "score": 1316,
        "num_comments": 183,
        "created_utc": 1691953179.0,
        "selftext": "They said my solution to the LC problem only passed 32% of the tests and asked if I know where I went wrong and I told them to go fuck themselves and that they don't know anything about real programming. I don't think I did anything bad but they said they've seen enough and ended the interview early. So yeah am I screwed or is there still a chance of getting hired? Thanks",
        "permalink": "/r/csMajors/comments/15q72rp/told_interviewers_to_go_fuck_themselves_how/",
        "comments": [
            "No you’re good keep doing that 👍\n\nEdit: How in the world did this get so many upvotes lol",
            "Dont even bother solving problems. Just tell them to go fuck themselves as an opening statement. “Interviewer: Hello”. “You: Why dint you go fuck yourself”",
            "r/csMajors lore intensifying day by day\n\nwhat a great time to join this vibrant community of socially adept, confident individuals",
            "You still have a chance to get hired....send a mail reminding them about your conversation",
            "Least socially inept CS major:",
            "[deleted]",
            "If you work in finance they would probably give you an offer asap. Big swing dick is one of their hire signals. Gg OP.",
            "yeah they're just finalizing your offer letter. no worries.",
            "I think you got this in the bag",
            "Ah yes it’s Sunday. The only time this sub makes sense.",
            "[deleted]",
            "Nah your good move on to the next one. No one has time to think twice the days are blue",
            "What was the test case?",
            "You'll make a good product manager.",
            "I have 3 ideas to get you this job.\n\n1. Get engaged to an executives son or daughter.\n2. Buy the building the office is in so you are their landlord.\n3. Get a majority of shares of the company if it is traded publicly.\n\nAll these options have worked great for me in the past. #1 is least advised as it is difficult to take back or repeat if you want to change jobs.",
            "Why would you be screwed? You've established yourself as the [alpha](https://www.youtube.com/watch?v=N6Zz-Nkkaxc). \n\nIf they haven't got back to you yet, it's because they're still trying to calculate/negotiate how many RSUs they can offer you without violating their VC contracts.",
            "That’s the test you had to pass, now your score will be 120%, you’ll be hired Monday morning.",
            "Surprised they havent gave you an offer yet tbh.",
            "Nah, employers love when you play hard to get. They're probably putting an offer together right now.",
            "Average chigma male",
            "You don’t see anything wrong with your erratic response? Come on man this has to be bait, OP, and if it isn’t, you have a long way before getting a job.",
            "You really showed them who's the boss, do that more often and you'll find a job in no time 😎",
            "U should’ve told them to suck my dick u mediocre engineers",
            "You should follow up with a 20$ Starbucks gift card. I read on LinkedIn that it does wonders.",
            "On the contrary, this level of assertivness might earn you an uplevel",
            "We once interviewed a guy who interrupted us during the interview telling us we were asking the wrong questions. My boss inquired what the right questions were then? His answer was, unfortunately for him, not very convincing. We ended up not hiring him.",
            "It is telling of where this sub has gone that I'm not positive that this is satire. \n\nI mean, I'm pretty sure it's a joke, but I can't say that I'm 100% certain of it.",
            "He let his intrusive thoughts win",
            "Nah they just assumed you’d come in the next day to start immediately. They wouldn’t demean you with a formal offer",
            "Why did you say that..",
            "Soft skills, smoff skills! Amirite!",
            "You were supposed to go in there and say,\n\n&#x200B;\n\n\"Show me one commit in your GitHub that uses this leetcode problem.....I'll wait\"  And then maintain direct eye-contact to assert dominance",
            "K.O Fatality",
            "[deleted]",
            "Interviewers like candidates that exert dominance. The job is as good as yours.",
            "Post interview huddle: \"He's a straight shooter with upper management written all over him.\"",
            "So you told them to fuck off when they asked you a valid question? You guys  just thinks that whatever you  do is correct and cool and also funny",
            "Post your code",
            "This guy is a straight shooter with upper management written all over him!",
            "Lol. You were screwed when you only passed 32%.  You’re definitely not getting hired.",
            "Nah bruh you're good as long as you don't punch them in the face.",
            "Is this subreddit a meme?",
            "You lost your job in O(1) time.",
            "I’m in medical and non do those tests comments make any sense to become a usps delivery worker. Lol such an easy job find the route, make time frame done speed and be polite to any customer upon their own property… my question is when you open your door and if you said to the delivery guy who rejects the package drop off,” Go fuck yourself” lol 😂 no consequence lol 😂 only the time you can say it and get away it seems is to a ignorant rude delivery driver who does damage on property…. If u worked with them then yes a backfired but until I would never ever work for a penniless job like that I will support the GFU statement with others lol 😂",
            "OMG, this never happened",
            "The answer was\n  \nprint(“LIGMA”);",
            "love this sub",
            "What really happened\n\n\"Umm I.. I....\"\n\n\"I.... I... don't know...\"\n\n\"thank you....\"",
            "Has this become a troll and karma farming sub ?",
            ">I don't think I did anything bad\n\nMost well-adjusted CS major.",
            "Why do so many people take the time to shitpost?",
            "You probably did not pass the pressure test.😂 but if they have any sympathy they would understand that people can react to stressful situations. \n\nYour response was hilarious but yeah not ideal. So dont do it next time maybe? Your choice",
            "honestly if someone gave me a LC hard i would probably tell them to go fuck themselves before even attempting it.",
            "i came reading this",
            "You'll get an offer most likely.",
            "Bro what? Did you even reread before you posted this? The answer is clear in your face .",
            "Power move",
            "This is fake news.",
            "You are the hero we need but do not deserve",
            "What a good way to fuck yourself",
            "Next time slap them on the face with your cock as you say it.",
            "NTA. Win games, play stupid prizes.",
            "That's a rookie performance. You have to show commitment. Go back tomorrow and piss on their desk. Look them in the eyes the whole time to display confidence. Its an encouraged trait in business. They will 100% hire you then.  Right now you are only at 85% probability of being hired.",
            "Wait, this isn’t the csMajorsCirclejerk subreddit",
            "[Attitude is everything](https://youtu.be/XUhsNIeIgpY). Now that I'm older, I realize that I should have told more people to fuck off if they were irritating, including interviewers and bosses.",
            "Just don’t participate in these dumb ass brain teaser assessments",
            "=IF(response=“Go fuck yourself, interviewer”, “fucked”, “not fucked”)",
            "this thread gave me more laugh than this entire subreddit ever.\n\nKeep me informed.",
            "this is the way",
            "oh wow",
            "This can't be real",
            "Skill diff tbh",
            "This is the appropriate response to a LC question",
            "Why are you even asking. This is a dumb question with an obvious answer.",
            "Is this an honest, real question?",
            "haha, yeaa",
            "If the company was Pornhub then congrats on your new job",
            "GIGACHAD",
            "Hell yeah, This is the kind of energy we need in the job market right now, Employers are getting too comfortable. \nEvery time they ask you to do the code monkey ask them kindly if they want to suck your dick instead.",
            "Hiding your incompetence by insulting your interviewers only reinforces your lack of competence and professionalism. You will not only be a shitty employee but also a shitty entrepreneur if you ever decide to start up. However, you have all the qualities of becoming a politician, so wish you all the best in that regard.",
            "I only stay part of this sub purely for the comedy aspect",
            "Sounds like Ricky from Trailer Park Boys went to a CS interview",
            "Is r/csmajors turning into a creative writing sub?",
            "Serious question, why would you say this in an interview😭😂",
            "Ur funny 🤣🤣",
            "Don’t work for a non tech place if you have degree. You’ll hate your choices.",
            "The probability of an interviewer hiring you after you told them to go fuck themselves is low, but never 0.\nKeep doing it, I want to see how far you get",
            "My first interview the hiring server admin was a total ego dick loser. He asked me on a scale of 1-10 how well to you know virtualization I said 9, then he asked how well do you know Linux, I replied 8. He said oh really then drilled me with like 6ish command questions. I didn’t know any commands he mentioned as I was straight out of college. \n\nHe told me some B.S crap on how I shouldn’t answer questions I don’t know the answer too, when in reality that question was kinda personal based IMO. \n\nI gave a really good in-depth answer for virtualization as I’m good at it but Linux/Ubuntu he got pissed at with my answer for some reason. \n\n\n\nI feel like any CS job where they ask specific random questions relating to random crap instead of your experience or determination can go FUCK themselves. They are most likely ego hungry dicks.",
            "You’re definitely getting hired keep up the good work",
            "Most socially adept CS major:",
            "you have zero chance to be hired there; if they stopped the interview mid way through.\n\nif you where on a date, and the other party got up and left, would you be getting laid? Obviously no. \n\nInterviews are dates - and you fucked it up so badly they left...",
            "A no bullshit solution to a hard problem, you're hired!",
            "So much positivity 😄",
            "Thanks to you and to all the commentators, I needed a good laugh.\n\nI literally have tears running down my face.",
            "They're probably drafting an offer as we speak!",
            "hey guys, should we hire the guy for told us to go fuck ourselves or you know, any other guy?",
            "We used to have bonfire parties when I was a teenager and the highlight after everyone got shit faced was \"jessai theater\" We even had a theme song (sung with British accent) \"it's theatre, theatre, jessai mother fuckin theatre\"\n\nJessai would then act out a scene by himself, playing all characters.\n\nMan at interview \"I'd like a job\"\nInterviewer \"that's great, you're hired\"\nMan \"fuck that!\"\nInterviewer \"you're fired\"\n\nThat amazing play was performed 30 years ago and I'll never forget it.",
            "This is the best way to make sure you get the job for sure",
            "Probably they're thinking to give share in company",
            "as long as you do it in O(1), you'll be fine.",
            "I think you have a 32% chance of getting the job.",
            "You will get the call OP, once they called me directly at police station. Fun times",
            "Which LC problem?",
            "Rough around the edges, but you've got the spirit, so they'll probably hire you just to fire you the next day.",
            "Just wait, they’re redirecting you to their “BASED” org where they handle real programmers",
            ".",
            "Plus they looking for cheap sheep cause the German shepherd is a sleep and the Australian shepherd is too fat and lazy to catch a predator or a Frisbee or free country",
            "lmao ive done it plenty. still get jobs"
        ]
    },
    {
        "post_id": "m945k4",
        "author": "gtthrowawayacc",
        "title": "Stop Asian Hate 👊",
        "url": "https://www.reddit.com/r/csMajors/comments/m945k4/stop_asian_hate/",
        "score": 1311,
        "num_comments": 394,
        "created_utc": 1616235214.0,
        "selftext": "It is not ok to discriminate Asians in the workplace. It is not ok to discriminate Asians in the hiring process. It is not ok to discriminate Asians in the admission process.\n\nThis is why I will only support Republican candidates.\n\nEdit: All affirmative action is bad including the sexism towards men in hiring/admission process.",
        "permalink": "/r/csMajors/comments/m945k4/stop_asian_hate/",
        "comments": [
            "Lol you had me until you mentioned voting republican.",
            "I can't believe that racism toward Asians is finally being recognized on a large scale. I truly thought it would never happen.",
            "Nice Karma crop, hope the karma farm is yielding well. \n\nState some obvious shit relevant to recent events to tickle some feel good self-righteous ball sacks",
            "As an Asian live in the US, I feel everything is harder for us. We need to get not good but perfect gpa to go go top school. we need to face racism from all other skill colors. we need to work so hard to get a ok job with bad pay. \nI feel like no matter how hard you work and how much money you make some people just want to discriminate on you. Now you start killing us. \nEnough is enough. we are human.",
            "Asians are great. I have been fortunate enough to have a lot of exposure to a lot of highly-educated Chinese and Indians, in particular, and it is very positive for America that they chose to play their craft here, making us stronger in tech than we would otherwise be. Approximately 50% of the world's people (probably more) are born in Asia, which explains why we see some many smart ones here. There are just a lot of people, and the top 5% intellectually of such a large groups are going to be really smart. \n\nI have also worked with and taught Koreans, Pakistani, Vietnamese and more. I appreciate their attitude and culture, much of which is refined and spiritual side. Buddhism, Hinduism and Taoism are all philosophies which have enhanced my life. \n\nDitto the food: sushi, Americanized \"Chinese\" food, Indian food, etc. \n\nBy and large, a lovely experience to encounter anything Asian.\n\n\nEdit: as the lawyers like to say, \"for avoidance of doubt\":  Other continents, races, peoples are quite cool too. Black, brown, white, whatever. All wonderful. Just wanted to take a moment here to celebrate Asians on account of this week's tragedy and the rise in anti-Asian sentiment that occurred in 2020.",
            "Vote, for anti AA Asian politicians. They’re a rare breed in politics.",
            "Honestly this post has made me realize that racism against Asians is way more prevalent than I like to believe. Some of the comments on here, yikes",
            "I’ll take the downvotes but I agree with all of this, especially your last point.  Affirmative action is racist.",
            "And just like that, this post has solved the Asian hate issue.",
            "Question, how is affirmative action racist? My understanding has been that affirmative action is in place to give minorities in America a chance at having a well paying job. For instance considering an Asian candidate over a similarly qualified white candidate in a predominantly white workplace. I thought this was to increase diversity which in turn decreases prejudice. Or is my viewpoint wrong on the subject?",
            "Yep, affirmative action is blatant racism and is contributing to the dumbing down of the population",
            "Facts",
            "At all my workspaces, my coworkers have been mostly asian. So not sure where you're getting asian discrimination in workplace/hiring process. The only valid point is \"not ok to discriminate Asian in the admission process\" ... There you have a point! 100% agree.",
            "It is a sad thing indeed. \n\nAsians have to score much higher compared to other races in order to get admitted to US universities. Their extracurricular activities and other things must also be better.\n\nSadly the majority of US universities treat Asian applicants and students as if they are not human being. Meanwhile, blacks, whites, and Latinos are far more likely to get admitted for the same portfolio. Just because we are the more accomplished race doesn't mean that we should be excluded and face a higher bar - it is simply racism and it is what makes American education a complete shithole.\n\nAlso before any bigots saying that Asian have higher income and all that - let me tell you this. We work twice as hard as other people, our culture does not permit failure or slacking off, we avoid politics and spend much more time to work and study than any other race. And still we are discriminated upon by college admission and workplace hiring. The statistics you see arent a representation of how many talented Asians are there. A study shows that if Affirmative action was not included, 43% of Harvard would be Asian rather than a merely 24%. Let this be known that our culture of hardwork and diligence is being undermine and punished.",
            "Also stop discriminating the poor",
            "Violence against Asians aside which has always been there even before the COVID, I'm pretty sure a lot of people think Asians are over represented in the tech industry.\n\nAppreciate your kind gesture as an Asian guy.\n\nThat said, I would not necessarily take this as hate, a very strong word. It's more of a matter of resource distribution between different interest groups. The best solution is yet to be discussed but I don't think identity politics is the answer (which people like to play, sadly)",
            "This post made my day. So simple but so true!",
            "Asians are so heavily discriminated against that they're one of the highest earning ethnic groups in America, making on average %73k per house hold when compared to the American average of $53k. They make up up to 20% of top university classes despite being 6% of the US population. And are disproportionately represented in high paying jobs like tech.\n\nI'm not saying that Asians don't face their own issues as a block, but admissions and hiring are not some of them.\n\nHarvard's 2021 class is 24% Asian: [https://features.thecrimson.com/2017/freshman-survey/makeup/](https://features.thecrimson.com/2017/freshman-survey/makeup/)\n\nGeneral demographics about Asians in the US: [https://www.pewresearch.org/fact-tank/2017/09/08/key-facts-about-asian-americans/](https://www.pewresearch.org/fact-tank/2017/09/08/key-facts-about-asian-americans/)\n\nedit: there is sweet irony in being down voted for presenting statistics in a sub dedicated to cs students.\n\nedit 2: For the record, most of the people going to top schools are rich immigrants anyway. If you want to make the case that American born Asians shouldn't have to compete with the more wealthy immigrants, I can see where you're coming from. But as it is right now, you guys are advocating for a system that rewards students for being born into wealth immigrant families.\n\nPew research study on the wealth gab between Asian immigrants and second/third generation Asian Americans: [https://www.pewresearch.org/social-trends/2018/07/12/income-inequality-in-the-u-s-is-rising-most-rapidly-among-asians/](https://www.pewresearch.org/social-trends/2018/07/12/income-inequality-in-the-u-s-is-rising-most-rapidly-among-asians/)",
            "[deleted]",
            "it is very much okay And I challenge you to a kumite",
            "[why](https://www.ajc.com/news/last-year-gop-assailed-bill-condemning-violence-against-asians/2YB75WY4QVEEFBTVMIO6EJSTOQ/) [don't](https://www.washingtonpost.com/politics/2021/03/19/republicans-who-dont-want-reexamine-anti-asian-rhetoric/) [you](https://www.texastribune.org/2021/03/18/chip-roy-asian-americans-texas-republicans/) [google](https://www.google.com/search?q=are+republicans+racist+towards+asians&oq=are+republicans+racist+towards+asians)",
            "Being against affirmative action makes you a bigot. Checkmate OP\n\nIirc Asians are like the capitalist sibling of white people according to critical race theory? Lmao I honestly wish people would chose more interesting pseudosciences to accept as gospel",
            "[deleted]",
            "Never heard of this",
            "[removed]",
            "[deleted]",
            "[removed]",
            "J74h 4 hx4b h have x t have d1. H n h  h. he h 5",
            "the edit lol kys"
        ]
    },
    {
        "post_id": "17igfi1",
        "author": "None",
        "title": "Too many mediocre bootcamp and self taught devs in this field",
        "url": "https://www.reddit.com/r/csMajors/comments/17igfi1/too_many_mediocre_bootcamp_and_self_taught_devs/",
        "score": 1305,
        "num_comments": 756,
        "created_utc": 1698507743.0,
        "selftext": "Getting tired of it. The word “engineer” is being thrown around like crazy. Literally has lost all value. 60% of applicants are people that went to a bootcamp in the slums of Alabama or went self taught and have a to-do list website on their resume thinking they’re software engineers now. These people have pre algebra level mathematical skills and middle school physics skills. Some of them don’t even have a highschool diploma. \n\nI told my cousin he needs to start calling himself a shopping cart engineer at Costco. He has better math and science skills than most of these mediocre elementary developers.",
        "permalink": "/r/csMajors/comments/17igfi1/too_many_mediocre_bootcamp_and_self_taught_devs/",
        "comments": [
            "Slums of Alabama is crazy 💀",
            "tbf I’ve seen plenty of mediocre comp sci degree holders as well (I’m one of them)",
            "You would not believe how many to-do apps, I see on portfolios, its fucking nuts, and they don't call it a todo app, but you can just look at it and see it is a todo app just dressed up nicely.",
            "I agree, but there’s also too many “I have a CS degree that should be enough where is my 200k job?” people.\n\nIf someone is willing to work hard, it shouldn’t matter if they have a degree or not. The mediocre devs will be filtered out through interview process and/or first 6 months at work.",
            "Shit Bro, I have a college degree from University of Washington and I think half the people I graduated with didn't even realize they graduated \n\nYou know, I learned more in the field in 6 months then all 4 plus years of college... I have a lot of friends who are self-taught, we both work at the big G, he's in the AI program here, working on highly advanced systems.\n\nRight now, it sucks but tomorrow will be a new day for you to make a big difference so you never know",
            "You’re not wrong.",
            "I interview plenty of comp sci grads who really are very mediocre, and I've interviewed quite a few self-taught people who are pretty great.\n\nInstead, what his field has is a surplus of people who think \"I've learned the basics, I must be a SW Engineer now\" without realizing that most of their growth is out in front of them.",
            "This sub is like always, a bucket of crabs. Dog eat dog.",
            "Send us your github let us evaluate your code?",
            "To be fair someone more experienced has probably thought the same thing about you.",
            "It's not just boot campers and the self-taught. Getting a degree, doing well in a bunch of math classes, etc, doesn't make you an engineer either. And neither does being a 10x-er who only codes even if it's on complex systems. \n\nUnfortunately, SE doesn't have a formal process to become a professional, and there seems to be no appetite for making it happen. ACM doesn't support licensing SEs despite their take on the meaning and responsibilities of being a professional SE. They want to eat their cake and have it too.\n\nIt doesn't help that companies use the title internally and hire new grads with no real experience as \"engineers.\" They feed into the ego of their candidates to attract the \"best\" talent. MS has Customer Support Engineers and Escalation Engineers. Wtf is that? There is literally nothing even remotely engineering related to those positions. \n\nIt's stupid af.",
            "Self-taught here. Not all of us are bozos with unrealistic expectations. Got my BS and MS in a STEM field and am a published author. \n\nAnd I am a software engineer working for a large bank you’ve heard of. Some of us just realized too late we should have done CS all along and have an aptitude for programming.",
            "who gives a flying fuck",
            "To be fair... many cs graduates I've hired are complete garbage and can't code their way out of a paper bag.",
            "getting a lot of traction here for a low effort troll post, grats.",
            "One of the smartest devs I ever worked with was self taught. He works at Amazon now and has been very successful",
            "Someone is salty",
            "We shouldn’t gate-keep the word engineer, but I do find that calling yourself an engineer with no related education is disrespectful. \n\nIt doesn’t feel right calling people with no education “engineers” but it’s how things are now I guess.",
            "Without these folks, where would we get the “I have submitted 500 applications and don’t have a senior dev role yet” posts?",
            "Eduction system elitism? It's only natural given how much one must spend on university to justify one costs with this belief I guess. Not sure how it serves you tho,",
            "This thread reeks of “I’m insecure about myself and my skills so I’m going to shit on others”. A good swe can come from anywhere, regardless of whether they realized that when they were 20 or had the financial means to go through college.",
            "As a self taught dev, I agree the engineer title should be for those that have a degree behind it but as well as people that have real world experience to back it up. So if I am self taught and have extensive real world experience on developing software architecture then I’ll take that engineering title.",
            "God I fucking hate this sub. You all bitch too much.",
            "You mad you cant find a job, bro?",
            "Weird classism in this post. Stop being mad at people who want to escape poverty?",
            "Why do you care so much? Why are people with degrees so angry at those without degrees? If they are not good enough they will still be eliminated. It doesn't matter how they call themselves.  \nIf they are good enough; instead of being angry at those who were able to reach this point without school and all the opportunities it provides, you should learn from them.",
            "Instead of thrashing people that entered through the nontraditional route, we should be uniting towards the goal of labor rights in tech. This crabs in a bucket mentality is terrible.",
            "Agreed, but also too many mediocre computer science graduates too",
            "This is exactly why I don’t understand the hate that asking algo problems in interviews get. Easiest way to tell if someone knows their head from their ass. \n\nI’m also tired of the clueless people who somehow make it through the hiring process. Once had a coworker say “we’re a team of 4 masquerading as a team of 7”… and man it was so true",
            "I have a CS degree from a top uni, where I focused on Kernel programming and ML. Now I'm at my first job out of college, Swe at Faang. Just started a month back, and am spending this weekend creatng a Java todo list app. Never did Web dev in college and these bootcamp grads you chastise might actually have more relevant experience than mw. So idk about this take.",
            "Lol what a bitter loser",
            "If I had to guess: OP feels they have devoted more than anyone else and should be praised and hired anywhere they want, but has recently found out some self taught individuals they’re aware of got a job and they’re struggling. \n\nGrind harder homie, before another self taught developers outshines you.",
            "I studied computer engineering at a top school in my country for 4 years and completed almost everything but my capstone. I've been programming too since HS and I've been working as a front end developer now for over a year. I don't myself an engineer because I never finished my degree and I see people every day who've never even stepped foot on a campus call themselves software engineers. Trust me it probably drives allot of the self taught devs insane too .",
            "let's see your github chupapi",
            "How delusional are they if they actually thought a bootcamp would be enough for themselves to be called swe.",
            "Boot campers are one side of the spectrum but I’m more surprised by how many CS “engineers” are in the field with no hardware experience, some don’t even know what hand tools are. \n\nGet off your high horse, you’re someone else’s pain in the ass.",
            "Coding bootcamp grad and self-taught dev and admittedly, you’re right. It’s a perfect storm-people stuck in shitty dead end jobs see some influencer on social media telling them how they quit their job at Walmart and make six figures. But they don’t tell you the back end of that tale. \n\n\nThat being said, some have the privilege of coming from that background and getting the right people to get them to where they needed to. Sadly, I’m not one of those. Which is why I’m STILL grinding at it.",
            "Bro woke up and chose to violate the slums of Alabama.",
            "That’s why when people tell me not to get a degree in Computer Science or Software Engineering, I look at them crazy. \n\nYou need these fundamental skills to be a subject matter expert. period!",
            "Too many mediocre college educated devs in this field",
            "The only people that should be called an engineer are people that have legitimate engineering degrees. If you have a degree in computer science you are not an engineer nor should you be referred to as one.",
            "You got a degree in Metallurgy and you're mad that people with certificates in welding are getting jobs as welders.\n\nNot every job requires creating a new alloy, or calculating the difference in physical characteristics of two alloys in compression, or understanding the effect of bimetallic contact.\n\nSometimes you just need someone that can stick two pieces of metal together cleanly, and give a nice clean weld.",
            "Too many mediocre devs in this field, period. Most of you college grads aren't any better either.",
            "As a bootcamp guy you wouldn't believe how many CS majors I've interviewed who completely don't know how to program",
            "Your logic is weak for such a well qualified computer genius.",
            "That's why I'm so sick of web dev. It's highly competitive, over saturated with engineer wannabes, and full of non CS peeps. Go with embedded/firmware or C++ roles (compiler, hpc, and the like). At least in these you can't just watch 4 hour video building a Todo list in particular stack and claim you have knowledge similar to a four year degree.",
            "soon you’ll have engineers who are skilled at prompting chatgpt for answers",
            "what a miserable post full of miserable comments. why are you punching down on people trying their best to do better for themselves? these people are employees for a reason, and it sounds likely they may at least have better soft skills than you lot.",
            "Guy you're talking about here... I got hired after a year studying because I can do the job well. Oh, it also probably helped that I'm likeable. Good luck out there!",
            "you should see what actual engineers (EE/ME/IE/etc) think on the overuse of the word engineer lol",
            "If this sub wasn't for CS Majors, I'd feel compelled to stick up for the self taught and bootcampers here. I've hired about 20 programmers in my life and I've found no correlation between having formal education in CS and good output. My heuristic for how good a programmer someone will be is how much they \\*enjoy coding\\*. If you like to code you will eventually surpass someone with more education who doesn't enjoy it as far as I'm concerned.",
            "Exactly. It's very annoying. I have a college degree, and am spending like 4 years on it, and these bums think they can compete with some random bootcamp? And they just send so many applications, and drown out the good applicants.",
            "funny. in comments you regularly get downvoted for this even though it's true. i've also seen bachelor+masters who were not capable of shit compared to some who did an apprenticeship for 3 years",
            "You sound insecure as f*ck.",
            "Keep coping, nerd. 200K TC, 7 YOE on a high school diploma :)",
            "Who made you this mad to throw your care with BS stats and wordings?",
            ">went self taught and have a to-do list website on their resume thinking they’re software engineers now\n\nhey, that's me and happily employed for the past 3 years now! thank you for the shoutout bro <3",
            "Salty CS graduate spotted",
            "I'll go even more hardcore: no Dev (CS or not) should be called an engineer. Engineers build shit that stands for centuries, we just hump code that's depreciated in 5 years time.",
            "CS is nothing in comparison to actual engineering like say mechanical, nuclear, aerospace, etc. CS is just a fancy applied math major and I say this as someone doing CS with a math/cybersecurity minors. Some of the best interns I worked with were self taught and one of the full-time devs never went to school but landed a junior role at 19. Chill out with the education elitism, not everyone is lucky with opportunities.",
            "You sound quite bitter. Plenty of people coming out of university who are in the same boat.",
            "Tell me, what do you need middle school physics for as a dev? There’s absolutely nothing wrong with being self taught or bootcamps. You’re just salty that other ppl didn’t have to go through a 4 year degree to get to where you are",
            "I guarantee that 99% of all software engineers don't use calculus in their day to day work. Not a good measure of weather someone is or can be a softeware engineer.",
            "Boiler engineers in the UK come and repair your heating. They probably don't know much 'bout biology... Uhm.. analysis.. Sorry, couldn't resist. And now the song is stuck in your head.\n\nYou're barking up the wrong tree. They are software engineers. Mainly because they are doing the work of software engineers and they are being hired at this position.\n\nWhat you want is to protect the term \"engineer.\" So if it isn't yet protected in your legislature, go ahead and draft a referendum. I think protecting the term engineer is a great idea and I'd sign it. Until then, I'll encourage those boot camp graduates to use \"software engineer,\" simply because it is the best strategy for them. That's game theory, and that's also advanced math, isn't it?\n\nBut hey, is someone with a bachelor of science allowed to call themselves software engineer? Or do you need at least a bachelor of engineering? Because in my experience, computer science leads more often, but not exclusively,  to bachelors of science and computer engineering leads most of the times to bachelors of engineering, yet the computer scientist has probably the better starting point to become a software engineer than the computer engineer. And if \"of science\" is okay, what about \"of arts?\"",
            "A lot of people trying to get out of poor life and software engineering is a good social elevator for them. If you have more than one mouth to feed it’s ok to try your best and have a willing to be engineer. \nThat’s my story in short and now I’m working as SRE in big-tech company and still working on my skills especially on math and computer science basics to have at least bachelor degree level of skills. If you had a good family which gave you a chance to study in university and kept you away from real life problems, you’re lucky. But don’t blame others if you don’t understand how life could be hard.",
            "There are too many people in the field. Too many educational and training programs of varying quality producing IT professionals, which makes it harder for everyone. I see it in management too - especially at big companies, lots of clueless managers with mediocre credentials hiring mediocre professionals. \n\nFor a long time, IT was the ticket to a good career making decent money. But that just incentivized more boot camps, watered down night programs, and feeders from other STEM programs. Then there is offshoring, H1bs, and student work visas too. Lots of competition. \n\nTo make matters worse, HR has turned into another gatekeeper stressing particulars over general. Thus someone with  10 years of software engineering in C# is passed over for a job requiring 5 years of Java and Spring boot. It’s making it very difficult to move around and do new things when there are so many applicants with exactly the right credentials, even if there training or education is suspect. \n\nIn short, I think it’s tougher out there because there are so many candidates to choose from so companies can be very picky, even when they are selecting on arguably the wrong criteria.",
            "Too many comp sci majors that know theory and can’t code or get anything done",
            "Self taught here. 20 YOE. Barely got my high school diploma (after being literally homeless during parts of high school). Currently at a city college getting my units together to transfer to a comp sci program at a uni. Not all self-taughts think a todo app makes them an engineer. Some of us have a deep interest in math and theory. I literally didn’t even call myself “engineer” before the place I got a job at two years ago gave me that title.",
            "Tell me you are a sad sad CS major without telling me you are a CS major. Your statement works for CS majors equally. I've seen CS major taking bootcamps right after graduation because they didn't have basically skills to build a simple app on their own while I with just an Associates in Business Intelligence can build amd deploy an app to the Android and Ios stores. So there's that. CS majors that think they are better than everyone else are annoying as fuck. \nYou fail to miss that some self taught and bootcamp folks bring a lot more to the table than a graduate straight out of a school that have never worked a day in their lives. \nYou are the one that give CS majors a bad rap. I can definitely tell you that our Software Dev/Engineering students have way more impressive resumes than our CS majors from our college. Not just projects, but hackathons, makerspaces and mentoring. When I tell them they'll all be working side by side the CS majors laugh because they think they are so much better. Until they land in the same company and on the same teams, making the same money. \nMath is a barrier for some to be CS majors. It not that they can't do it, it's the pace and time needed to practice.",
            "Don’t hire people from bootcamps. It will take less than 2 minutes of googling to figure out if the candidate is a bootcamps/college mill graduate.",
            "Not everyone had the time or resources to go to a 4 year college. Shitting on people who are doing their best to get a better job and provide for their family is ridiculous.",
            "[deleted]",
            "I'm on the other side of the fence, being self taught myself and now an architect. The self taught ones are usually hungrier, try harder, and put in more work. And often times the (successful ones) are far more \"educated\", albeit without traditional means. I can't tell you how many times I've interviewed a college grad for a junior role who doesn't know up from down and clearly slept their way through a cs degree hoping to cash in on a \"smart degree\". The world is shifting and I'm here for it. Most of the engineers on my team don't have cs degrees and they did a hell of a lot more than just showing up to class sometimes, then grinding leetode to get where they are.",
            "You're likely to become too generic when you lack a good crowd. I myself am very interested to pursue an engineering career in CS, but it's very evident that not coming from an ivy League doesn't give you that exposure or environment.",
            "is this why in Canada its called software developers and not engineers",
            "This is what happens when there are no firm barriers to entry. I don't recall seeing any architecture bootcamps or self thought lawyers.",
            "Lol salty? I’m one of those “ self-taught “ you’re talking about right now. I’m also self taught in math and currently working on real analysis but that’s my hobby.\n\nI’m a freshman but already has 3 years experience of being professionally employed because I worked before I started college, and my portfolios are all in production and they’re giant web apps for Japanese companies and colleges. \n\nI admit I’m not that skilled in low level programming but just because of that doesn’t make undeserving of my title as a developer. And since you’re “ academically educated “ and better than us self taught and you’re tired of us, how about giving us a link to one of your public GitHub repo so we can analyze your code.",
            "Bootcamp grad, $140k after 2.5 years of being in the field, math degree. I too can pass my algebra tests. OP sounds salty and given he can't seem to give a cogent argument and relies solely on ad-homonym attacks toward bootcamp grads as a whole, I'd wager he probably doesn't think much like a programmer.",
            "So because someone is self-taught or went to a boot camp to gain knowledge in the field they’re less than someone with a college diploma? I fail to see the logic in that. Going to college is a leg up on the competition, but in what way does that determine how capable, intelligent, or knowledgeable someone is?",
            "Imo, who cares. If they are that mediocre, they surely won’t compete for your job. I also think it goes both ways, I’ve met so many cs grads that don’t know shit but the degree gives them inflated confidence.",
            "Bootcamp grad here who got my diploma in 3 months. I nvr said i was a great coder or leetcoder solver. Im just here for the money lol",
            "u thinking degrees make better engineers is hilarious",
            "I had to work 4 years in my old field and pass an 8 hour exam after getting my accredited degree to call myself an engineer. Some might argue that the \"word\" lost all meaning when there were no universal standards in the first place lol.\n\nGatekeeping is also stupid and counterproductive. I know plenty of CS grads who would struggle to make the same to-do app. What does it gain you putting down people trying to improve their lives? I know plenty of self taught successful people in this field",
            "The word engineer literally means nothing now 😂, everyone is an engineer, if you didn't realize by now",
            "Next up OP will spin the wheel and choose minority hires or women to hate on lol. There’s gotta be better stuff to do than type this and all the replies bruh💀",
            "This post screams “I’m still in school and have a B in discrete math”.",
            "I once had to help a \"software engineer\" that has a degree , write a for loop to output a bunch of json data .. and I'm just an \"artist\"🫠 , anyway we missed the deadline and i had to build the majority of the software myself because he couldn't do it, after that I lost my respect for that engineer title he had.",
            "Ahhh someones mad they wasted 4 years on a degree when they could’ve learned all of it online for free in less than 6 months.",
            "It's not like an actual engineering is any better you know",
            "Getting a degree for jobs where a degree isn't needed. Who's the clown now, lol?\n\nThere's virtually nothing a motivated person can't learn under CS on their own for free.",
            "Hater",
            "Bunch of elitists in the comments. I'm sorry our precious is reducing the requirements to get in since the past 4 years. This phenomenon akin to many other technical fields of the past.",
            "i mean engineers are people who design and build stuff. software engineers design and build software its not that deep bro",
            "As a dual-degreed engineer, I say we aggressively gatekeep the term so we can feel better about ourselves when we brag about our occupations, which we should also do all the time",
            "The only reason webdev is a complete shitshow nowadays.",
            "I routinely come across work from PhDs. To say their code sucks is putting it lightly.",
            "Since we are on the subject, what would be something reasonable to have on a resume for a solo project? I have several examples but they all feel relatively \"elementary\". What would be a good project to show competitence but is still manageable for a lone programmer?",
            "Counterpoint: most people are mediocre.",
            "Maybe you are doing a job where their skills are valuable. Go to a 'better' company if it is too low for you.",
            "Just wait till you realize a lot of the people you’re referring to are graduates with cs degrees. Turns out not everyone that gets a job as a swe is a great developer.",
            "Sounds like you're pissed that you are not just being handed a high paying job after graduation. Maybe loosing the pretentious attitude will help.",
            "You don't need math to design a web app.",
            "I had a professor lectured that the title software engineer was created by companies to make people feel special. He explained that when you look at the role in detail, it only resembles other engineering disciplines slightly at best.",
            "There’s a lot of mediocrity in the field period. I think a lot of it comes from those without a lot of skin/experience in the field. But being mediocre and having poor programming skills won’t save you in the long run. At some point, you either have to do better or you get the boot. I’ve worked with some fantastic self taught devs and I’ve also worked with terrible devs who have a degree. It’s more about the individual, not always their education path. But rest assured that the mediocre folks always hit a wall. I do think there needs to be more gatekeeping (i.e shutting down these lying tech influencers), but I would never say gatekeep the candidate who learned on their own.",
            "The same thing can be said for some with degrees, unfortunately. The system really needs to shift their focus towards people who actually worked hard and out in the effort, degree or bootcamp, and not just hand out jobs to those who slept and cheated through college or who just did a 6-month bootcamp to create a simple web app. This job market is over saturated with people who are serious and people who are doing it just because.",
            "This is unfair to the great state of Alabama.",
            "Instead of writing software, let’s write melodramas about what people studied in school, what they’re called, and why I’m better.\n\nNOW THATS SOFTWARE ENGINEERING!\n\nJokes aside, imo it’s just very difficult to evaluate the skills needed to be a good SWE in the “normal” time you have to interview someone. You do it long enough you’ve seen the most prestigious people suck, and the most unlikely people home run shit. \n\nPlenty of elitist pricks in software though. Not anything special there. I’ve laughed at plenty of coworkers with views like this, unsurprisingly a lot of these views are also held by interns. Wonder why.",
            "Ok what's the problem? As a csMajor, since you're so clearly better than them, why do you feel the need to complain and belittle them if you're so much better?   \nThey'll never truly be competition for you then right? So why do you care?\n\nAre you really that elitist where you're whole identity revolves around being a \"true engineer\"? It's just a title bro.",
            "If you, the CS degree holder, lost out on a job opportunity to a self-taught/bootcamp dev then I’d say you only got yourself to blame.\n\nYou spent 4/5 years getting that prestigious degree only to get beat out by someone who learned via YouTube and Udemy.\n\nThat said, maybe I’m just salty because I’m self taught lol \n\nBut hey, I work on a team with other developers that have CS degrees and at the end of the day our paychecks are not that different.",
            "My company hired a bunch of boot campers during 2022. Most of them are absolutely terrible devs and coworkers in general. They were trying to live the life that tech tik tok promised them - 2-3 hours of mediocre work a day. However, there was one motivated dev from the boot camp. I feel like we got lucky with him. Otherwise would not recommend",
            "I’m self taught and cringe at calling myself any kind of “engineer” even if I’m applying to junior positions or apprenticeships right now. I’m really passionate about the field and after doing tedious and mediocre tasks at my job following graduation (BA from top public university) I just grew tired knowing that automation could do everything instead. I started automating and teaching myself and making tools to speed up processes and realized I love doing this. Now I’m trying to pick up the slack and teach myself computer science in general (algorithms, data structures, etc) and honestly? Had you taught me this in school without the background I now have, I probably would’ve not cared nearly as much. But now I’m fully engaged because I see the real world applications first hand. I guess it comes down to personality too: there’s people who will know print(“hello world!”) and think they’re suddenly some engineer 🤦🏼‍♀️ and then there’s people whose life paths have led them to what they feel most passionate about and they’re humbly teaching themselves as much as possible to catch up.\n\nTLDR: You’re going to get douches with or without degrees and you’re going to get sincere people with or without degrees as well.",
            "Problem with bootcamps is lack of serious fundamentals in algorithm, math and systems \n\nIt's mostly for churning out web devs who wanna color a button on a website",
            "All labels are stupid. Who cares if someone is an engineer when you know the \"chief\" is just the son of the former boss most of the time.",
            "Lots of this came with covid.  People had to stay home so they did some boot camps etc.\n\nIt's great that they want to learn but I'm not hiring anybody with only that on their resume.",
            "People just want a job that pays well. You come here with your arrogant gatekeeper post. Let’s see your GitHub or anything you’ve built",
            "It’s like this in any field that has a relatively low barrier of entry with high pay. I’m in construction management and kids straight out of school come in running job sites when they’ve never handled a damn tape measure in their life.\n\nTakes a few months to become a licensed real estate agent. About 5 weeks to become a home inspector. Supposed “professionals” in the field but realistically have no hard skills and little working knowledge of the industry.\n\nIt’s inevitable in high demand, high margin industries. The low supply of skilled labor drives up wages which in turn draws people to the field of work. Employers are forced to lower expectations with new hires which allows less than qualified people to find themselves in high paying jobs, which perpetuates the recruitment of other unqualified workers.",
            "I'm yet to meet a person who makes a point about calling themselves a Software Engineer rather than a Developer, especially if they don't have formal education. Heck, I don't call myself that even though I have a Master's and technically could",
            "I recall the only other post on your profile where you posted some uninformed bs. Something tells me you are a very green college student feeling self-conscious",
            "I definitely wouldn’t be able to get a job as a software engineer. Bootcamps regularly shut down, rebrand, lose money, etc. I don’t even think most end up getting a job in the field.",
            "What’s wrong with a todo list app from a self-taught dev? You can’t build Facebook right off the back. Gotta start somewhere right.",
            "idrc, want all the homies to eat",
            "Next up OP will spin the wheel and choose minority hires or women to hate on lol. There’s gotta be better stuff to do than type this and all the replies bruh💀",
            "I'm self-taught, have done some CS papers part-time since, so I'm open to self-taught candidates. \n\nBroadly generalising, self-taught devs are either great or terrible, there's no mediocre ones. \n\nNow, people with degrees...",
            "No, did you all already saw the Netflix clone app too? It's crazy the amount of \"portfolio\" that has always a Netflix clone app. Is insane hahahahaha.",
            "Agreed",
            "What are you building, OP? That requires a ‘real’ engineer",
            "Shiny paper mindset is a weird way to look at the industry. There are shit Devs with cs degrees and great Devs that don't have any degree.\n\nAdmittedly tho self taught with no work experience are likely to be shittier than someone fresh out of uni with no work experience, but once there's experience working under someone who knows their shit and has the time to mentor either can flourish imo",
            "That's what happens in countries where the engineer title isnt kept in check by an pro association. Anyone with a bachelor degree can call themselves an engineer in the US, those who don't have a degree just piggy back on it because they completed some bullshit bootcamp. Like give me a break, dammit. I get there are exceptions and that's fine but I feel the pandemic has given birth to a whole generation of fizz buzz failing \"engineers\".",
            "Unless you’re a PE, or an EIT working towards PE, sit the fuck down.",
            "This is one of those “yikes” posts",
            "Least obvious troll",
            "It’s not even just in software my parent is an Engineering manager are a big construction company and he complains all the time how every employee now seems to have the title engineer somehow even like a concrete pourer",
            "Alabama isn't that bad chill",
            "Be careful if anyone is sensitive in this website is self taught and bootcampers. You cannot say a thing about either without a wave of downvotes and hate",
            "Something I like about the degree holders is that they can at least talk to people because they were in school and had group projects or something. The ones that are self taught are usually harder to hold a conversation with. But I mean everyone’s going to be mediocre in terms of skill. You don’t actually learn how to code until you work.",
            ">Getting tired of it. The word “engineer” is being thrown around like crazy. Literally has lost all value. 60 \n\nWell there you go. When I said not everyone is an engineer I got attacked by this community. Everyone wants the prestige but no one wants to put in the work",
            "A degree gives you the opportunity to become a great engineers. Most, degree or otherwise, don't put in the effort.",
            "Why are you so salty. I imagine youre far worse in person. It's as if you're purposely trying to you play into the snobby elitist CS stereotypes.",
            "so what bro its a free market. bootcamp guys have a lesser chance of landing a good starting job but with enough grit meritocracy should prevail. saying this as a computer engineering student interning with a place full of BootCamp guys.",
            "Then Unionize and make it a protected title numb nuts.\n\n\nYou build their software you have the companies by the balls if you work together.",
            "Is this just a salty dude that can’t find employment and is getting outdone by self-taught?\n\nI ask because we don’t have the funds to send my ass back to college for a degree but I have to make a career change out of law enforcement for my mental health. I spend my nights on these to-do sites learning the material they offer( code camp and Odin project right now)\n\nI am aware that I will need to branch out of tutorial hell once I have the basics. The way some people are talking is like this way is lesser in comparison to a degree I can learn the same curriculum online.",
            "Give me someone with passion, understanding of design patterns and software architecture any day over someone who is amazing at mathematics.",
            "Low tier bootcamp developers create monolithic monstrosities without tests that high skill software engineers like us can be paid the big bucks to fix.\n\nWhat’s the problem?",
            "Don’t see what wrong with teaching yourself over spending 6 figures for a shiny piece of paper",
            "you shouldn’t base your self worth on what other people call themselves :)",
            "CS degree holder and currently employed as a dev. Some of the best devs on my team are self taught, this is some bitter posting.",
            "bootcamp graduates thinking they can get job easily (THEY WILL NOT)",
            "This is why I tell people to major in something that gets you license like med school or engineering. People can't just flood in those fields because they are hard. The problem in this field is that there are a lot of overlaps in targeted jobs for degree holders and non-degree holders. Do you really want to major in something just to compete with those people? I don't mean those people have advantage over people with degrees, but them having any chance is a loss to degree holders. And to be honest a lot of those jobs can be done only with bootcamp skills, which is why they are still getting hired. This is one of the primary reasons why cs was bottom-tier degree before the cs hype.\n\nDon't get blinded by those 6 figure software jobs. Imagine a field that is so easy to enter just with bootcamp certs but has crazy high compensation. There ought to be over-saturation, followed by paycut, layoffs, offshoring and automation, which are already happening. People who got lucky won't stay lucky forever.",
            "![gif](giphy|G4ZNYMQVMH6us)"
        ]
    },
    {
        "post_id": "1c6e13t",
        "author": "StrayyLight",
        "title": "Several Google employees were detained at Google's Sunnyvale Campus in California, after staging a sit-in protesting the company's military contract with Israel",
        "url": "https://v.redd.it/n3i08tcbn1vc1",
        "score": 1304,
        "num_comments": 688,
        "created_utc": 1713370691.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c6e13t/several_google_employees_were_detained_at_googles/",
        "comments": [
            "Locked - this is getting too political. The crossposted subreddit is better for this.",
            "i feel like half the people commenting in this thread aren’t even cs majors lol",
            "Waiting for the follow-up post where they're fired and reddit is surprised.\n\nEdit: [Here it is](https://www.reddit.com/r/technology/comments/1c6san0/google_fires_28_employees_involved_in_sitin/)",
            "I am too broke for putting my livelihood on line.",
            "so.... are there any openings @ Google now?",
            "They put their livelihood at risk and are potentially blacklisted from other companies to do this, they knew better than anyone what Project Nimbus was going to do. Nothing but respect for these guys, true CS people",
            "Great respective to those employees that protested. They are living version textbook of Ethics in Computer Science and Engineering. \n\nI literally learnt ethics in AI weeks ago and this is exactly what my lecturers said about exploitation and greeds in major wealthy companies.",
            "Context: The protesting employees said Google's project Nimbus  helps the Israeli state to surveil and subjugate Palestinians and maintain an Apartheid.",
            "Respect to them. Too many people let their morals slip just because they're desperate for a job.",
            "I'm confused. Is this a sit-in in the sense that they passive aggressively didn't leave a meeting room even though it was previously booked and the next team politely knocked? Because it looks that way, lmao.",
            "Are their jobs available? I promise to never protest on google campus!!!!",
            "holy 1984",
            "Respect",
            "Respect",
            "Heroes",
            "Legends. Respect ✊",
            "So we will have new positions in Google? They gonna start hiring.",
            "Brave guys ❤️",
            "I aspire to one day have this level of privilege.",
            "Good, next thing you know theyre gonna be sitting on the road protesting oil",
            "On the bright side, they will keep their sit in protesting going (now with free meals and clothes)",
            "![gif](giphy|WrNfErHio7ZAc)",
            "A private enterprise has a right to its properties. If a US company supports (of course, not financially as per US law) Palestinian Islamic Resistance (hamas), and some pro israeli employees trespass its properties against their hiring contract or local laws, the company also has a right to call the police. Not a surprise",
            "Good. Shouldn’t take more than 5 minutes to fire these entitled and probs insufferable folks.",
            "“Employees” they were interns",
            "FREE PALESTINE 🇵🇸🍉!!",
            "classic google, the “don’t be evil” company",
            "Dumbasses.",
            "What does this have to do with CS?",
            "This is nuts, fuck Google. I'm completely stopping supporting them.",
            "I somehow doubt that they were just sitting at work—their only form or protest being just sitting somewhere and not doing work—and then the police just walked in and arrested them.",
            "These are heroes! It takes a lot of courage to do this!",
            "They 100% knew they are going to be detained and fired before doing this. Nothing surprising, the news coverage is exactly the goal.",
            "If they're so against surveillance and AI tech, don't you think working at Google was a bad choice? Obviously a data-driven and money seeking company.\n\nAs another example, if you think social media is terrible for the world, why would you go work at Meta?\n\nIf you think gig economy is terrible you probably shouldn't work at Doordash, Lyft, or Uber.\n\nYou're not going to change the basic economics of these massive companies from the inside and while this may seem \"brave\", it's simply a fast and performative way to lose your job. This is not going to change Google in literally any way except they may crack down even more on employee speech and organizing. \n\nThere are plenty of mission driven tech companies you can work for. They just probably won't pay you Google RSUs to do so.",
            "[removed]",
            "They knew what they signed up for, this is just meaningless virtue signaling.",
            "[deleted]",
            "Nothing cool or “legendary” about this. Just a bunch of dorks who think they can claim moral superiority while tanking their career opportunities.",
            "Great , a couple of new positions created , they probably should not work any company , work as the individual developer would better suit their interest",
            "Play stupid games, get stupid prizes",
            "But they're OK with Google providing such services to Saudi Arabia so they can catch blasphemers and execute them in the public square:  \n[https://www.intelligentbuild.tech/2024/02/17/google-cloud-and-haboob-partner-to-strengthen-saudi-arabias-nationwide-cyberdefence/](https://www.intelligentbuild.tech/2024/02/17/google-cloud-and-haboob-partner-to-strengthen-saudi-arabias-nationwide-cyberdefence/)  \nand Qatar so they can better assist Hamas: [https://www.al-monitor.com/originals/2022/10/qatar-signs-deal-google-cloud](https://www.al-monitor.com/originals/2022/10/qatar-signs-deal-google-cloud)",
            "Bunch of idiots, goodluck burning all the bridges",
            "[removed]",
            "it's futile to fight them, unless the next generation establish a different power base. if you wanna make money now, you're gonna have to bow down.",
            "Take them to Palestine",
            "Should have shipped them to Gaza",
            "Bye bye!!! If you don’t want your job, thousands of others would gladly take it!",
            "Good luck. The job market is awful right now in tech.",
            "L employees. Google should fire all of them",
            "Finally Google got some backbone and fired them.",
            "Just a bunch of useful idiots brain washed by tik tok videos who no nothing about anything they're protesting, hopefully google fires them quickly",
            "Just quit and find a new job.",
            "Only Google employees would out their career on the line like this 😂. They probably already have their luxury suv and 2 million dollar house.",
            "What’s a csmajor?",
            "Well Israel is the only larger country in the region where my queer friends could work and live properly, so I don’t know if backing the Palestinian Side (Or let’s be honest here, the Iranian Side) would be the right move. And if your project was hurting people before, but you are just protesting now that you have the spotlight, you are maybe not such a moral upright person after all. Taking the dirty dollars is fine, just don’t act in such a pretentious way. If you care, quit. Put your money where your mouth is.",
            "Respect!",
            "Bye, bozos! Hope the rest of them are in the 9000",
            "Ah yes, more propaganda videos on reddit nice",
            "Can you please get your agenda out of here?\n\nRespectfully, both side is committing atrocities, hamas and Israel both. But most of us need a paycheck and can’t afford to risk such a thing for a belief.\n\nPower to them for putting their money where their mouth is, but they’re google engineers and will be able to find another job easily.",
            "Pretty sure Hamas (who was voted in by Palestinians) and Google's work place environment would not go together well.\n\nBut hey, it is amazing with all the tech we have at our hands we can still remain so ignorant.",
            "[deleted]",
            "[removed]",
            "From the river to the sea, Israeli sovereignty!",
            "All of you saying respect to them are just funny 🤣🤣. We all know  that most of you wouldn't do the same stupid thing IRL. But if you  like being unemployed like them, good for them tho, more jobs for us that actually want it 😂😌",
            "Hope it was worth it I suppose. \n\nChanges nothing though, Israel won't take having 1400 of its citizens raped and butchered on the chin.",
            "[deleted]",
            "Suckers",
            "Where is ' dont be evil' logo now?",
            "Nuisance",
            "[removed]",
            "Anti Israeli propaganda, has no place in this sub",
            "That's wild",
            "piperkitty is that u?"
        ]
    },
    {
        "post_id": "uy7gg3",
        "author": "yangshunz",
        "title": "LeetCode Tips from author of Blind 75",
        "url": "https://www.reddit.com/r/csMajors/comments/uy7gg3/leetcode_tips_from_author_of_blind_75/",
        "score": 1302,
        "num_comments": 78,
        "created_utc": 1653571127.0,
        "selftext": "Did 500+ LeetCode questions, created Blind 75, and interviewed hundreds of candidates. Frankly speaking, I dislike LeetCode, but the rules aren't set by us and the best we can do is to be better at this stupid game together.\n\nHence here are some tips for you.\n\n1. Revise your CS fundamentals before your start LeetCoding. You don't have to spend that much time studying, but you need to know the advantages of each data structure and when to use which for the question.\n\n2. The average question difficulty you'll get is Medium. Start with Easy questions, do more of them, move on to Medium questions. You probably won't be asked Hard questions in real interviews but you should do some famous Hard questions like Word ladder, serialize/deserialize Binary tree and trapping rain water. You should not be practicing only Easy questions.\n\n3. LeetCode is not fully representative of real interviews. In real interviews, you don't get long descriptions nor do you get so many test cases. Questions in interviews are intentionally vague and underspecified, you have to clarify the requirements. You will also not be given input ranges during interviews.\n\n4. To better simulate interview conditions, come up with a solution in your mind and be sure of the time and space complexity before you start to code. Trial and error-ing during the interview is not seen as a positive signal. As a good habit I write the time and space complexity of my solution as a comment above my solution.\n\n5. If you find yourself stuck after half an hour on a question. Determine if you are close enough to cracking it. If you're close, try for a while longer. Otherwise read the solutions and move on. Learn the technique that was crucial to solving the question and internalize it. Revisit in a few day's time and try to solve it without referring to the answer this time. LeetCode also shows you similar questions for a problem. To test if you have understood the concepts, try the similar questions and see if you can solve them.\n\n6. You might not get to run your code during interviews. Interviewers aren't just evaluating how correct your code is, the signals you exhibit during the process matters as well. You can end up failing even though you wrote correct code but it's messy and not readable. You can also end up passing even if your code had a minor mistake but your code is super clean and well-structured. Getting an Accepted doesn't mean you did well if you only got it on your tenth attempt. Before hitting the submit button, scrutinize your solution hard. Come up with test cases, standard ones, edge cases, think whether your code will pass those cases. You can run your code against your own test cases, it's still better than hitting the submit button. Just note that you might not get to do that during interviews.\n\n7. Some topics are more important than the others. DFS, BFS, binary search, trees, graphs are the most important and common ones. If you're going for Google, practice DP. If you suck at DP like me, at least be good at backtracking with memoization.\n\n8. The chosen language doesn't matter as much as your mastery of the language. You don't have to pick up Python just because it's the best language for interviews. But if you have enough time (more than two months), it might be worth doing so.\n\n\n9. You don't need to practice too many questions. 100-200 is sufficient for most. After a while, the questions are variations of previous questions and are based off the same patterns. The returns on practicing above 300 questions is marginal at best. The full list of 169 questions in Grind 75 (https://grind75.com) is 90% of what you need.\n\n10. LeetCoding is a marathon, not a sprint. If you start too early, you run out of steam. Start too late and there's not enough time for spaced repetition to take effect. Recommend starting a few months in advance and spending 1hr a day doing a few questions per day. You should be in top shape when it's time for interviews. If you've completed all recommended practice questions, do the weekly contests. If you can solve at least 3 of them, you should be ready for interviews.\n\n11. You might never feel ready for interviews and that's perfectly normal. Interviewing is a numbers game. Interview performance is a function of luck and preparation. The more you prepare, the \"luckier\" you get. You will fail some and you will pass some. You just need to pass one.\n\nAll the best and lemme know in the comments if you have any questions!",
        "permalink": "/r/csMajors/comments/uy7gg3/leetcode_tips_from_author_of_blind_75/",
        "comments": [
            "I went over all of Grind 75 and Neetcode 150, and then revised top 50 tagged questions for respective company(only briefly). Had 0 issues with leetcode problems so far in 5 interviews I've done.",
            "Great advice. I’ve been using your site and Neetcode to practice Leetcode and I have definitely seen progress in my Leetcoding ability.\n\nI saw you ask above how your site compares to Neetcode. For me personally, I liked how Neetcode’s 150 was sorted by pattern and popularity. The fact that he also provides a youtube explanation along with a solution for EVERY question is a huge help as well. \n\nGrind 75 is a fantastic site though! Just wish there was more “help” along with the questions listed. It feels like Grind 75 already assumes you understand how to do the questions while Neetcode is more focused on actually *teaching* the questions (which is more helpful for me). Really appreciate again what you’re providing to everyone!",
            "This is really helpful, thanks",
            ">If you start too early, you run out of steam\n\nI do not agree, with one caveat. Starting LeetCode without having taken a data structures and algorithms module could possibly be frustrating as the foundation would be missing.\n\nOtherwise, I don't think there is a \"too early\" time if you do, say, a question a day (like doing the daily challenges). As someone might say: \"a LeetCode a day keeps rejections away\". The key point is that time is a double-edged sword - you can choose it to be an ally or a foe.",
            "Why you so cool?",
            "First off, thank you for coming up with the list. I recently got a couple of offers and the blind75 def played a huge role. \n\nTo add on, a thing I find useful during interviews is documenting assumptions, approach, complexities as a comment. Helps me keep things clear and the interviewer is also free to read it in case they get lost/miss something. \n\nAnother thing I'd say is that most often questions have some insight that you need to figure out to solve it in an optimal way. First principles is a great mental model to arrive at this, it's also a mental model that helps you become a great problem solver in the long run.\n\nI love the blind75 list cause it helps nail down the basic building blocks eg. BFS/DFS for graphs etc. Once you got these under your belt everything else just starts to fall into place.",
            "Great tips. Can anyone recommend a good resource to learn data structures? I wasn’t a CS major so unfortunately that part of my education has mostly been self taught.",
            "Would you say Python > C++ for coding interviews? Also, is there any DSA course you'd recommend for someone with no CS background?",
            "> spending 1hr a day doing a few questions per day.\n\nI can't do 2-3 questions in an hour. can other people??",
            "Finally some good content",
            "[deleted]",
            "🤝",
            "Thank you! Do you have any tips for OAs in general?",
            "Good advices",
            "Do you have any tips for phone screens?",
            "Just wanted to say thanks for all you do man! It’s really helpful and much appreciated",
            "[deleted]",
            "[deleted]",
            "AMAZING tips! This will help so many people. Thank you!",
            "Great advice. Thanks.",
            "This is spot on. 👏👏👏👏",
            "What do you suggest for a sde1 who's lost touch with leetcode style problems and looking for sde2 roles.\n\nI see a combined of leetcode style questions and system design questions being asked. Any goto reading material for system design like grind75",
            "🙌",
            "What makes code messy and not readable? \nWhat makes people fail interviews with passing code?",
            "Cracked Amazon SDE 2 by preparing 160 LCs.",
            "1. Idk if its just because I’m on mobile but everything is numbered 1, 1, 1,…\n\n1 This is great thank you!",
            "Is 3 months enough to learn DS&A and do the list to pass big tech interviews?",
            "How do you improve your fundamental?\nFor example I'm having trouble with double for loop(ie when i have to do some Operations in two array)\n\nWhere and how can i improve it?",
            "Great advice!",
            "Hey! I really appreciate all the resources you put out for free. I'm currently in the process of prepping for next summer internships which happen in the fall. I've never taken a DSA course before, and I can solve leetcode easies but it's almost never the \"optimal\" solution. Can you please recommend a resource where I can learn practical DSA for tech interviews? Including teaching concepts like algorithm analysis and how to classify the big-O level of the specific algorithm?",
            "Should i see solution to question i am stuck or leave it and try again later...Someone please help??",
            "."
        ]
    },
    {
        "post_id": "1b0r69r",
        "author": "DefinitionOfTakingL",
        "title": "Who can relate?",
        "url": "https://i.redd.it/5xsxzv1nkzkc1.jpeg",
        "score": 1290,
        "num_comments": 40,
        "created_utc": 1708977874.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b0r69r/who_can_relate/",
        "comments": [
            "Welcome to adulthood",
            "unemployed vs underemployed",
            "Idk, at least with a job you can pursue more difficult and challenging roles for a sense of growth. Don’t think the same applies to unemployment.",
            "I'd rather be depressed and have money to meet my basic needs tbh. Employed >>>>>>> unemployed.",
            "For me personally its, having a \"Software Engineer 2\" job title but I write such few lines of code its ridiculous, I am worried about career stagnation, I don't see any growth at this job. There is no equity, bonus, just a typical 3-4% a year raise. Heck even the 401k match has 3 year vesting period and is given in publicly traded company stock rather than investable cash. Stock has done worse than SP500, which also sucks.",
            "People on the right:\n\n![gif](giphy|XOys8CeUrElIk)",
            "I rather be financially well and mentally poor than being financially and mentally poor",
            "I’ve never seen a more depressing sub.",
            "Don’t allow a career to become an anchor to your limited life, you could always go to school again part time learning different fields, accumulating knowledge like some living lich could be your goal in life",
            "I really enjoyed ALL of my jobs. I love coding, I love talking to clients, I love problem solving. What I don’t love is filing countless job applications and reading rejection emails. What I don’t love is financial insecurity and instability and not knowing how you’re going to arrange next month’s rent. I will take a job over joblessness any day.",
            "You can then get a remote job and love life",
            "🙋‍♂️",
            "22 w/.no work experience asking for 60 grand a year EL EM AY OH",
            "Simple answer. Become a millionaire by building your own platform or service. Don't work for someone else. Become a free man.",
            "This is me right now",
            "And heaven knows I’m miserable now.",
            "My life rn"
        ]
    },
    {
        "post_id": "16gpj01",
        "author": "Deflator_Mouse7",
        "title": "To everyone who wants to ignore theory and math",
        "url": "https://www.reddit.com/r/csMajors/comments/16gpj01/to_everyone_who_wants_to_ignore_theory_and_math/",
        "score": 1283,
        "num_comments": 246,
        "created_utc": 1694520100.0,
        "selftext": " CS PhD here, was a professor for many years, now 15 years in industry including a few startups and two FAANGs. \n\nAt my second FAANG job, a major component of the system I was hired to design and deliver  required consuming user submitted source code and allowing it to run on a very popular public facing website. As you might imagine, security was a top concern.  My manager was pushing hard for a static code analysis solution that I knew was not solvable.  I described approximations that would probably work in practice (and their tradeoffs), but my manager insisted that we couldn't approximate the analysis step and that it was crucial. \n\nOnly after I PROVED (in the theory of computation sense) that what he was asking me to do was equivalent to the halting problem did we settle on another approach (a combination of simpler static analysis and a dedicated human review team who would reject submitted code that wasn't clear). \n\nWithout solid theoretical CS fundamentals, another engineer (principal or otherwise) might have spent months going down a rathole trying to solve a theoretically unsolvable problem, and created a huge security hole on a VERY popular website. \n\nThis stuff happens more than you think, and not just to principal engineers building whole new systems from scratch. It really matters. There are people in high up positions of authority at the best companies who will ask you to do things that are inefficient or impossible. It's not a circle jerk for nerds who can't code, and it's not punishment.",
        "permalink": "/r/csMajors/comments/16gpj01/to_everyone_who_wants_to_ignore_theory_and_math/",
        "comments": [
            "-🤓\n\nNo, but seriously, good post.\n\nWay too many people think they won't need theory anyways and skip out on it, but there are many cases where you can apply that exact theory",
            "Theory of computation is present in most computer science courses. However 10-15 years after leaving college you will hardly remember anything unless you brush things up occasionally. You are a PhD so it must be possible for you, but it's not easy for the rest of us for whom even solving leetcode is enough of a challenge.",
            "Disclaimer:  I'm also an excessively over-educated theoretical CS person turned regular developer.\n\nOP's story sounds like a once-in-a-lifetime thing to me. (I think I might even have heard it before.) Especially if one doesn't work at a DARPA research lab or a hyperscaler making up new datastructures, just in regular software development, which is 99% of the jobs out there.\n\nEven less abstract math or CS theory crops up only a few times a year in my experience, and I specifically seek out such problems and jump at them.\n\nOne time we had a performance degradation, so I took measurements and plotted them, and  saw a clear \"hockey stick\" graph, and immediately knew I had to look for a saturating hashtable. We found the bug based on that insight and everybody clapped. No, seriously (not the clapping part, but theoretical CS knowledge saving the day), it happened, it was great, it made it feel worthwhile to pursue my interest in CS. However it happened half a decade ago and it's still the one story I can trot out.\n\nIn my experience this kind of thing happens way less often to the average developer than you'd think.\n\nWe are way, way, waaaaay overteaching CS theory to people who have no use for it and could have make a great developer without it, but we successfully gatekept them out by flunking them in school or made them give up because \"programming is hard\".\n\nCS the science is hard. It's a hard science, after all :-)\n\nProgramming the trade is just tedious, and rarely if ever needs more than an introductory level familiarity with CS.",
            "You CS people need to know stats too if you want to do ML",
            "Okay, that makes sense. Now tell us recommended math courses for a decent foundation. Not every math course is useful. Please list important ones",
            "Hello! I'm a junior software developer without a formal CS education, do you have any recommendations for online courses and or books that delve into this? Would love to build robust systems in the space I'm in!",
            "> This stuff happens more than you think\n\nIt really doesnt",
            "You literally worked on a theoretical problem around programming languages. That’s the niche of the niche.",
            "In my opinion, if you wanna go into grad school then yes theory is important because grad school is where you really start to see what really shaped CS. But for most fields in SWE data structures algos, and discrete math is enough. It is also not a software development, or SWE degree. I am doing a software development concentration at a certain school, and we don’t take as much theory except maybe discrete math, and ds&a, calculus, and oop.",
            "There's a whole lotta comments in here coping on the reasons why they never need theory so that's why they continue to ignore it 😄\n\nI think your post was a great reminder to keep fresh on key skills and have an avenue for how to freshen up on others.",
            "TC or gtfo",
            "Don’t disagree that theory is important but c’mon this is such an edge case that 99% of engineers will never encounter.\n\nEdit: for whoever wants to continue this thread first have a look at that other comment pointing out OP’s implausible (and possibly entirely made-up) history and decide for yourself if this is worth your time.",
            "A SQUARED + B SQUARED = C SQUARED. UR WELCOME PPL.",
            "You will encounter TOC problems rarely when you’re building software. At least, I haven’t and people I work with don’t seem to use it.",
            "Yeah, sounds like a communication/people problem.\n\nFor you, the theoretical proof was what you needed to effectively communicate, and that’s great that it worked for you.\n\nIt’s tunnel vision to say that a theoretical proof was the only solution to this problem.\n\nAlso, the fact that the manager accepted the proof as proof is quite fortunate. What would you have done if the manager didn’t get it and still insisted on static code analysis?",
            "The problem is a lot of CS majors just wanna get a job and make money. They’re not trying to be a good engineer, but an engineer that makes lots of money. I do think this is a problem with the US higher education system, billing students insane tuition fees and not providing strict rigorous curriculum like their counterpart institutions in Europe where tuition is free. It’s kinda understandable that if you’ve taken loans to study CS, chances are that you wanna pay back your loan asap. When money is the talk, your vision is limited to what makes money unfortunately. US education needs change.",
            "I agree that theory is important but you can’t make me enjoy learning it lol",
            "Got a few books you’d recommend to brush up on? I’m a few months out, still job hunting, and want to stay sharp.",
            "I needed this for motivation for my Algorithm Theory class. Its basically a discrete math class, with only 15% of the grade being from actual programming assignments. \n\nI practiced a lot of programming questions over the summer in prep for interviews and chuckled thinking this class would be, \"easy\" because I had covered the patterns. \n\nNope. Its a discrete math class, with my summer working barely helping me with the actual course. I guess I will actually fully 'understand' the theory behind it now instead of just memorizing patterns so I'm not particularly upset, just annoyed at my arrogance.",
            "Kind of motivational, but very niche.",
            "So many businesses make decisions that are inefficient or backwards because they never approached the problem scientifically. It’s fine to make mistakes and put band-aids on things but if the theory is wrong they’ll be stuck treading water forever.",
            "As someone who’s recently switching over to CS I genuinely enjoy studying theory and feel that I’d get bored of my job very quickly if I’m not being forced to think as much as I am while studying grad school material",
            "Side question, I'm considering getting a PhD. I really enjoy the research part, and I feel it would be very interesting. From your perspective, is it worth investing more time in education rather than just getting a job in the industry?",
            "javascript bros won't like this\n\nhAvE yOu TrIeD tHiS nEw BlAzInGlY fAsT™ fRaMeWoRk To SoLvE tHaT iSsUe?",
            "[deleted]",
            "That’s why you have diverse teams, you don’t need everyone that knows the theory, you just need one in your team and ask your teams input 🤷",
            "Your anecdote is interesting.\n\nYou invested a lot in your skills. They paid off in a big way. That’s fantastic and a great lesson to approach engineering with an open mind. I hope you’re proud.\n\nBut what exactly is the goal of your post? Do you want to make sure people take a theory of computation class? Do you want people to become experts in proving theoretical problems? Do you want people to refresh their proofing abilities regularly? Your intention is really unclear and my current conclusion is that somebody triggered you by saying math / theory is bs and useless for the career (assumption based off some of your..less than graceful replies)\n\nI have bad news. Often-times, they’re right. These things appear in useful crumbs throughout people’s careers, but rarely (and i mean very rarely) will someone come across problems that require as rigorous formal analysis as what you went through. Lots of the time, it’s enough to have experience / intuition for when more careful approaches / learning is needed. The “theoretical cs fundamentals” aren’t always necessary to know and convince others that something isn’t fitting. It’s a huge leap to assume that other engineers without that formal education would have wasted their time on an unsolvable problem. \n\nWill the people who neglect that foundation create groundbreaking tech and patents that do the impossible or save millions/billions of dollars in a “hero” moment that required an intense proof (or disproof)? Maybe not, but honestly, that’s a-okay with most engineers.\n\nI also don’t think I should need to say this, but learning something once isn’t enough. You have a PhD. You did a lot of research-oriented work over a long period of time, and likely wrote several proofs as part of your program / research. You may recognize problems requiring a more formal approach easier than someone who just took a couple of classes in their undergrad and then never needed to use it until 15 years later. So i guess this brings me back to the first questions — what is your point, and what is your motivation? Your anecdote is an outlier in the grand scheme of things and can’t really be generalized in modern software engineering. Most people don’t need to know that stuff / will never need to know that stuff and even if they could (not commenting on whether they should), they probably don’t think it’s worth the effort to save an engineering team one month of work one time in their lifetime career as opposed to an elective that will give them an edge in the currently terrible market, or a niche field (robotics, security etc)",
            "Building a rapport with your management is important, I don't think I would work for anyone who acted like your manager.\n\nI would convince him without those skills though. I would lean more towards sandboxing, code analysis, or limiting allowed libraries, etc. (Practical solutions). \n\nYour skills are very valuable as they make you a better learner and critical thinker - that's what's most important.\n\nAs for direct applicability, formal theory has very little in traditional SWE roles, but probably more in certain disciplines like AI/ML.",
            "Management skills + Business insights + Coding experience >>>>>> Math theories",
            "The halting problem assumes that there are embedded bugs that prevent the program from halting, and therefore it can’t be solved. The solution is confirming that the source code provided is a finite state automaton, a Turing machine with static memory; else it’s a bug.",
            "Thanks for this! Validates all this theory stuff I'm learning (but I love it!)",
            "I really like the theory so it's good to know that practical applications exist",
            "Honestly you could say this about any STEM field. Theory is important, but I don’t know any bench chemists that remember orgo mechanisms off the top of their heads.",
            "Why did I cut classes in my second year of college.",
            "Theory will only take you so far",
            "This post is so accurate. I used graph theory to help secure series B funding for my startup by demonstrating network growth and showing how our growth strategy targeted new power users. A literal mathematical proof in the investor meeting, and we left with 5x what we were looking for in funding. It’s worth it, y’all.",
            "Give this OP a bells,",
            "Yeah fuck that shit i dont want to kill my gpa again\n\nI just wanna code funny website 🤪",
            "What would you recommend a CS student do if their degree program does not require Calculus 1 and 2? My major does require Discrete Structures/Math, but outside of that not much else.",
            "In your case, you have manager who understands and comprehends the halting problem and karp reductions . Most of the teams do not have good cs and math fundamentals . They are hired just based on leetcode abilities.",
            "I'm glad you were able to solve that\n\nAs for me, I'm gonna keep ignoring theory and just look it up if I have to 😂",
            "Google Colab is my guess",
            "A good story. What does halting problem have to do with security?",
            "Thank you for offering insight into the ways theory ends up still being the foundation in software engineering jobs in terms of developing new solutions and communicating to management when the demands will not work.\n\nI have a question though: if a student is really burnt out and frustrated from always needing to study theory for a grade without that much accomodation for understanding and if they're called \"slow, not a math person, incapable\"  even if they are passionate about the theory should they consider keeping CS a hobby?\nThroughout highschool I ignored this and considered it discouragement and that once I finally finished all my education I wouldn't feel as rushed and neglected while learning, but while reading anecdotes of burnt out software engineers I've been wondering whether the stress and 'preformance shaming' ever really goes away because I don't know if I'll be able to manage if it doesn't. Lately I sometimes just  dream of studying my textbooks but without a class to worry about and anyone telling me maybe I'm too slow or am not cut out for CS when I even slightly go over the expected one on one teaching time for a student. \n\nMainly it's been my realization that the preformance pressure despite the complexity of the theory never ends has made me even consider that maybe I'm happier with mathematics and CS  theory being my hobby, but I haven't had anyone to talk to about this. \n\nI find myself enjoying the theory but I often do not enjoy navigating theory within an institution, I can get frustrated to tears when the assigned textbook doesn't come with an answer key, the professor says they won't help me with the HW problems fully yet they are different than the lectures yet the textbook is not being followed in the lecture, basically I've just been facing burnout since when dealing with good professors at best I feel like a hamster on a wheel just working towards a good grade without the time to understand the material, just \"preform well\", and in the worse case scenario with a professor who has a reputation I am completely floundering. \n\nI realized that working as a professional, I'll always be forced into a mold and will never really be accommodated. If I'm slow, I'm told I should consider quitting, and maybe at work that will transfer into getting marked up or fired.\n\nWhat would you say to a student in this situation?",
            "Thank you. I’m trying to pay extra attention in my theory class, but I royally fucked up in Discrete math so the content is not getting to me as fast as I’d like.",
            "Sounds pretty niche… but cool anyway.",
            "[deleted]",
            "If you don’t know Rice’s Theorem, you’ll run into this situation uncomfortably often.",
            "Too many people join CS just cuz it pays well and wanna get just enough functional coding skills to skirt by at a job. The theoretical mathematical foundations are super important to being good at CS and anyone who doesn’t wanna learn these thing and just wants a good job should try to find something else",
            "I like math and theory and all that stuff. Its fun and interesting, but I doubt even 10% of engineers in the world will ever use this type of math or work at the level of abstraction that some other engineers do.",
            "Yeah. Math is important. Those that say it's not do not need it, though, due of their self-fulfilling prophecy. Nobody is hiring one that knows no math for doing things needing advanced mathematics stuff.",
            "What have been the most useful areas of math for you?",
            "Nah, imma build it first, have someone like you tell me this and blow them off, then look like a jackass 6 months later .",
            "Nice prank. Reply to the comments.",
            "Let me tell you, at my full stack job I use literally 0 theory.",
            "is it important in artificial intelligence and machine learining?",
            "This post proves nothing.",
            "On the one hand, I have never had the need to prove anything like I would in a math or cs course. On the other, I use algorithms and optimizations all the time, at our scale even small optimizations that don't change overall time complexity can translate into significant savings.\n\nIn practice, it's literally: Hey, with these operations I could do this thing in a single pass instead of 2, same time complexity, but good savings.",
            "best cs advice to early cs students: pick up a physics textbook, look at pi, question your own intellect."
        ]
    },
    {
        "post_id": "16c0wn4",
        "author": "GroundbreakingPay707",
        "title": "I was the guy who needed to become a leetcode god within a week...",
        "url": "https://www.reddit.com/r/csMajors/comments/16c0wn4/i_was_the_guy_who_needed_to_become_a_leetcode_god/",
        "score": 1287,
        "num_comments": 78,
        "created_utc": 1694045820.0,
        "selftext": "What I did: I went through neetcode's 150 problems like my very life depended on it and got through around 90(?) problems. Made sure I actually actually understood them. It was really, really, painful as I was a) doing this for hours each day and b) panicked about my interview and c) I'd get scared whenever I saw a problem that I didn't have a clue how to approach. It did help that I had reasonably strong foundations from my school's data structures course so I wasn't learning anything from scratch. \n\nI watched the videos, wrote out stuff on paper, and made sure I could explain the solution to myself from scratch and justify each and every line of code. ChatGPT was so, so helpful in this regard. If I ever didn't understand something, I could paste that chunk of the solution (with some context) and ask it all the dumb questions I wanted to ask, and it worked like a charm.\n\nThat said, I had my tech screen today, and *I killed it*. I got a leetcode medium (dp problem) and I got so lucky - it was something that I'd gone through 4 days ago, and repeated yesterday night to make sure I didn't just memorize the solution. The interviewer basically said I'll be moving onto the next round(s) today itself. \n\nThis was a huge wake up call, guys. I'm aware that if I hadn't been this lucky, I could have had an extremely mediocre interview. I've started to practice things more consistently, and pushing past my tiredness at the end of the day after schoolwork is done. Thank you to those who were encouraging and positive - *and* those who shat on me. I deserved all of it, the good and bad. \n\nOn that note - for system design, do people think neetcode is better or grokking? Or something else? \n\n^(In unrelated news, I'm 10 days behind on schoolwork and have a shit ton to catch up on. You live, you learn.)",
        "permalink": "/r/csMajors/comments/16c0wn4/i_was_the_guy_who_needed_to_become_a_leetcode_god/",
        "comments": [
            "That’s insane! Congrats fr",
            "You’re doing medium DP problems and systems design for entry level position? 😭(I just assumed that cause u said you’re behind on schoolwork)",
            "How much time, if any at all, would you spend trying to figure out the problems on your own before looking at the solution videos?",
            ">I'm aware that if I hadn't been this lucky, I could have had an extremely mediocre interview.\n\nIt's not luck, it's hard work. Congrats.",
            "Go through the system design primer, watch a few videos of designing Twitter, TikTok, WhatsApp and after watching videos, go through and spend time to see if you are able to do it yourself.\n\nAlways remember to format your interviews into 4 parts:\n\n1. Ask questions, get functional & non functional requirements. What consistency will be important for us (weak, strong, eventual)? Talk about keeping latency low, # of users, availability.\n\n2. Ask to do back of the envelope calculations, sometimes they don't care for this at early levels but it usually will just tell you is this a read heavy system or a writes heavy? How much data are you using per day/per month? Might help with decision making later.\n\n3. Draw a basic design. Key word: *basic*. Client, Server, APIs, DB. After listing out what services you might have, talk about the APIs and what they might look like and then the DB choice you would make based on situation (SQL vs NOSQL, MySQL vs PostgreSQL, etc). You should spend time building a schema of sorts, to explain how you will tackle the functional requirements in tandem with your APIs to utilize your new schema.\n\n4. Identify bottlenecks and start to scale your design - add caching, a load balancer, CDN, talk about how read replicas or master-slave could help your particular situation. Simple stuff that doesn't require a lot of studying to explain why it's good will be huge for entry-level. Highly recommend being able to explain what the above listed are, and why the tradeoffs make it worth implementing. \n\nRemember to keep an open mind about the problem - at the end of the day you want to treat it like a paired exercise and you can always bounce ideas off of your interviewer. Try not to bring up something that you don't know just because you saw it in a video or something. Be prepared to get grilled about any choice you make. The biggest key about these interviews is being able to discuss pros and cons of approaches. Good luck!",
            "you go to berkeley dude which means throughout high school you were extremely smart and above average- makes sense how you were able to do this in a week.\n\nyes, i know, school doesn’t matter in CS. but kids in top schools will obviously learn stuff at a quicker/easier pace because, well, they were able to get into the top school in the first place which means they are more likely to have a good work ethic",
            "vegetable adjoining lock sulky hurry memorize wistful makeshift wine frighten\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I'm in a bit of similar spot LMAO. Did you just completey abandon schoolwork for LC or were you able to balance the two somewhat?",
            "I will also start leetcode a week before my interview now. Wait no that’s tough, I’ll start 8 days before my interview.",
            "Keep crushing it, bro 😎",
            "w",
            "\\>go to med school for 4-8 years for 6 figures\n\n\\>take the bar exam, law school 4 years for 6 figures\n\n\\>study leetcode for a week for 6 figures\n\n&#x200B;\n\nand people complain lmfaooooooo hahahahah",
            "good shit broski",
            "wow! thats great man! congrats ! \n\nCan you tell me how to use ChatGPT to understand code ? I've never done that before.",
            "Good shit bro keep up the great work!",
            "i'm tryna get like you. congrats!",
            "Which dp problem?",
            "congrats",
            "Godlike",
            "King",
            "Probably Grokking is better for system design than neetcode. Keep up the great work.",
            "I love DP",
            "Congrats dude!",
            "Was this interview for new grad or internship?",
            "Bro, how are you getting interviews as a new grad?",
            "90 in one week ?? u r truly geniusss. Once i try to do leetcode for 3 straight hrs and ended up in anxiety. DMeeed you , please guide me.",
            "This is motivation",
            "coolest thing I've seen all day",
            "design gurus/alex xu are great for sys design. Top it with neetcode for freshers",
            "Love this! Congratulations!",
            "u got this dude",
            "Very nice, what problem was it if you dont mind sharing, juat curious.",
            "I'm trying to get like you OP, congrats! Gonna try to replicate this myself, already in my full-time role but haven't grinded leetcode like that.",
            "Hey I'm a freshman in college (an ivy) rn and I really want an internship for next summer. However, I have like no DS&A knowledge, but I will be taking that class in my school during the spring semester. I am taking discrete math rn.\n\nWhat do I do? I can't just grind leetcode yet because I dont even have the basic DS&A (except for arrays) knowledge.\n\nAny tips would be greatly appreciated because I really wanna have a good internship this summer so that I can be occupied for those 4 months.\n\nI have also interned at NASA already btw so my resume is kinda decent",
            "I have a code signal assessment in a week. Saving this post for motivation! Thanks for posting this!!",
            "That’s something… good shit broski",
            "I am going through the same thing except I never majored in Computer Science and am a beginner at coding. I hope I can make it. I only have two weeks.",
            "Has it ever happened that you know how to solve the question but you struggle to code it. For example there is a car fleet question to which I was able to come up with the idea that cars having the same value for n will be on one fleet with formula being target - position // s. But I struggled to code it. This has happened a lot to me with other questions.\nHow do you get past this. I know solving more questions will help but let me know if you went through the same and what helped you",
            "Where are you today?"
        ]
    },
    {
        "post_id": "159x0ez",
        "author": "Macaburn3",
        "title": "I'm done with the elitism",
        "url": "https://www.reddit.com/r/csMajors/comments/159x0ez/im_done_with_the_elitism/",
        "score": 1284,
        "num_comments": 179,
        "created_utc": 1690350733.0,
        "selftext": "I'm in the bay area for an internship at big tech this summer and I'm surrounded by people who are overpaid. \n\nYou're earning how many dozens of dollars per HOUR and you don't want to pay $2.50 for the bus to get to work?\n\nYour company provides lunch for the 200+ interns every week or so but you're annoyed that it's not \"good food\"? You could go buy your $20 bay-area sandwich for lunch and still have ended up making money during your lunch hour. \n\nYou heard my neighborhood has a reputation for having homeless people and you're asking if I have \"talked to my 'neighbors'\" yet and asked them \"what's the going rate for a strip of sidewalk on my block\"? Seriously? These are human beings. \n\nToday I found a covered inside-outaide mall with many restaurants going/gone out of business. \"I'm surprised this isn't overrun by homeless people yet.\"\n\nDoes everyone come from gentrified cookie-cutter suburban neighborhoods??\n\nHoly cow.",
        "permalink": "/r/csMajors/comments/159x0ez/im_done_with_the_elitism/",
        "comments": [
            "Welcome to tech!\n\nThat’s mild lol. Wait until you meet the CEO of a startup that just got VC funding.\n\nThere’s a lot of elitism in tech, both toward our own ranks as well as toward outsiders. Software Engineers are honestly getting a bad name to the point I’m reluctant to say it’s what I do.\n\nAnd the reason is there’s too many new money Software Engineers that are quick to tell everyone they’re a moron for not going into tech. Or even if you work as a Software Engineer, “Oh it’s not FAANG that sucks” like there’s only 5 decent companies to work for. \n\nMotherfuckers start making 6 figures and buy into their own hype and start thinking they’re geniuses.\n\nBut other than that, the homelessness problem is FUCKED out there. I’ve never seen anything like it. It’s absolutely wild to watch a dude take a shit on the sidewalk while openly hitting a Meth pipe right in front of a $200k car. I’m not surprised people are talking about it.",
            "Unfortunately, emotional intelligence isn't the strongest suite and I've noticed that a lot. Now I'm no better by any mean, but I'm trying to practice some tactics like meditation, critical thinking, empathy, etc. and trying to read more philosophy as well as listen to my co-workers stories. \n\nIt's not that much, but unfortunately I can't change how people respond to me or how people respond in general, but what I can say is that you can try to implement the same thing as I am currently doing.",
            "This is also my least favorite part of working in the field. Lots of really un-self-aware people. Tons of privilege. Ungodly amount of ego. And kind of a dumb and bland culture to top it all off.\n\nSometimes you’re lucky enough to find someone else who was just a poor kid that was blessed enough to make it this far and kept their humility. Hold onto them so, so tight.",
            "Assholes will always be assholes, 20 years prior they were in finance, now they're in tech.\n\nIt used to be that tech nerds were the outcasts. All we wanted to do after work was go home and play with Linux server configuration settings and geek out over IRC. Then we change the world and a whole bunch of gold diggers come in and started giving us a bad name.",
            "This is one of my fears as an intern. Becoming an out of touch corporate worker in a bubble who complains about crap like waiting 10 minutes in a line.\n\nPeople like that honestly grind my gears - you look ridiculous acting like a celebrity for making 6 figures. It's the reason why I keep my customer service job on the side. Getting cussed out by someone keeps me on touch honestly. Talking to REAL people with REAL problems, I ask them for life advice. These people are wiser than I am, despite my going to college. There's people out here deciding between rent and groceries and here's these tech NPCs acting like they're hot shxt for being a SWE.\n\nI really don't want to turn out this way",
            "You’re so right. I know someone who says their looks like a hobo when their outfit is not perfectly polished. Meanwhile, their pants cost $100, and shoes are designer.\n\nI’ve just started responding and saying “yes, you look like shit” because the elitism is so weird, and I don’t like that you feel comfortable making comments like that around me.\n\nThe coworker is also pretty rude to/about the receptionist. They once told me that the receptionist is lazy, and I just couldn’t understand why they would say something like that. They also dismiss them and never say hi, unless I say it first. It’s so weird bc they are only polite to the staff that is the same race as them.\n\nAnd I know what they are saying isn’t necessarily “bad”, it’s just the coded language and implications of what they say that aggravates me",
            "Yeah I've had the same experience in NYC. I used to be in a circle with people from an elite engineering program and it just blew my mind how arrogant they all were. Not to mention that everybody came from a well-off background. I really hated meeting friends of friends in those engineering circles. I'm sitting there like, y'all didn't have mice in your house growing up?",
            "Don’t forget that most of them claim to be liberal and champions of diversity and the underprivileged.",
            "It’s very weird, lots of people act like literal NPCs and it’s kinda sad. Lots of tech people lack a bunch of empathy, since a lot of them come from wealthy backgrounds, and if they didn’t, well now they’re making 6-figures and they forget that not everyone is as privileged like them. Just my thoughts after interning in the Bay and Seattle, coming from a low-income background",
            "My pet peeve is people who can’t admit they’re a tad bit privileged and make others feel bad for what company/industry they’re working in within CS/DS. I currently work in tech for finance and I feel like it gets a bad rep in CS/DS, but I personally love the work I do and the people I work with. I’ve learned to distance myself with snobs at this point (I can deal w/ someone elitist, but snobs are just a diff vibe I don’t want to put my energy into lol).",
            "I do not think it was always this way.\n\nWhen I hear older tech professionals, they actually seem passionate about what they do.\n\nI think we have skewed motives to be the best leetcoder, job hopper, and well connected person, but there are not enough incentives to be good at creating great applications and learning in general.\n\n&#x200B;\n\nEdit: Also, I never understood the appeal of American Psycho until joining the corporate world.  Too many Patrick Batemans.",
            "Yeah dude. I'm Swedish and did a few interviews in SF. Sure in Scandinavia we have some unspoken modesty rules but I was taken aback on the elitism. I noticed that a lot of startups say: \"We only hire really smart people\"! Like yeah I get it, you are really smart (I mean which they are but sure)",
            "[deleted]",
            "It has been like this for years.  You make a good point.\n\n1)  I recall a meeting I went to at the Ritz in NYC.  There were about 500 people who attended dinner.\n\n2)  Everyone was served AT THE SAME TIME by a massive wait staff.\n\n3)  For dinner, the big thing that year, was chocolate lava cake.  If you know anything about baking, it is fairly difficult, to serve ONE.  They did 500 individual cakes all served at one time.\n\n4)  The rich a-holes complained about the food relentlessly.  What do they eat on a daily basis?\n\nPeople are just fake.  (I love to tell this story).  Still unbelievable to this day.",
            "Classic west coast tech trash. \n\nI have interacted with people working in tech in various parts of the world. The bay area has a special level and type of toxicity.",
            "They don't have enough money to buy a house, so they have enough enough to bitch about everything else.",
            "Yeah, California has a bunch of stuck up and snobby assholes. Most will bitch about being poor and how America sucks, but own a whole arcade in their apartment and pay $600 for car insurance.\n\nThank god I live in Texas.",
            "I mean most land in the us is gentrified suburban cookie cutter neighborhoods, so statistically, the answer to your last question is yes. Sounds like urbanism is the movement for you. Welcome",
            "Literally my experience as well. I’m a pretty social person and I’ve found nearly all my co-workers super uninteresting and elitist, and they’ve all made similar comments to your own. \n\n\n\nIt’s really sad how much perspective people here in the bay lack - everytime I mention I’m living in Berkeley for the summer or visit SF, they say things like “wow!! it’s SO dangerous there…” with nothing interesting to add. I’m so sick of nearly all the other interns being from multi-million dollar suburban neighborhoods from around the area and hating on anything that’s not that, and not having the social skills to talk about anything that’s not work\n\n\n\nTbh if this is full time is like at most companies, I can see myself switching industries. I already know working in the bay isn’t for me.",
            "You put a spy cam on me? Literally my Bay Area SWE experience",
            "I think everyone should learn some humbleness. Unfortunately, tech culture drives towards either bragging or humble bragging. Mfs dont even realize how awful they sound when they complain about 150k salary to people from other disciplines. Like man, come on!!!!!!!!!!!",
            "As a girl and a non-tech person in the bay for an internship. I relate to a lot of things you say. Money comes too easy for the software engineers here. Many of them take all the privilege for granted and don’t have empathy for other people. I’ve met many people here who are self-centered and cocky. It’s honestly kind of a toxic environment here, so I might not come back for a full time.",
            "It’s usually not a problem when someone is legitimately passionate about tech. But these people are passionate about what the tech field entails. Not tech itself. Big difference.",
            "Is it tech people or is it just the bay area?",
            "Im moving to europe with pay downgrade with extra tax . Homless  right at ur fancy condo reflects how society dosnt give a shit. Its disgusting",
            "A lot of tech people in the Bay Area are from suburbs back east where they never walk more than a few minutes, let alone see homeless people",
            "Behaving like this is choice, either as part of your new identity or to fit in. A lot of people in tech have never worked somewhere else and think their jobs validate how smart they are. Most is due to immaturity, lack of experience outside of this bubble, and social pressure.\n\nTo be honest, I dont care about it if it only does self-inflicting harm or none BUT it is a huge problem when it affects others in meaningful ways. For example, there is a lot of gatekeeping others into joining the industry or judging how they did it. Why?!  These people need huge reality checks and honestly I hope this time of layoffs has been for many. Revolving your identity around a job, especially in a specific company, is a terrible idea. Who are you when you lose it?",
            "Thats why i avoid the bay area like the plague",
            "Even outside of interning, at the university I go to people act like this and we aren’t even graduated yet. It’s really annoying. Regardless of the “get used to it because it won’t change” it’s genuinely just irritating to listen to well off people complain about having to see a homeless person, or about money, or or or. Like… give it a rest.",
            "It’s always these people making YT videos like “Life of a software engineer at <Insert some FAANG name>”. Absolutely cringe.",
            "Goddamn this is beyond elitism this is complete narcissism and assholery.  I'd report it to a manager or a higher up and he their asses fired.  This is one of the problems with people that get into high paying jobs like software engineering straight out of college/bootcamp who are just money chasers and think everyone below them is a peasent or is lazy.  Its really fucking annoying and I've death with it, people overlooking how good I am at cs because of background or just making fun of me.  It happens even in my own family outside of SWE, literally being betrayed by extended family for being homeless at one point.  Its really stupid and I hate everyone like this.",
            "Coming from a blue collar family and not working an internship this summer, this really is disappointing. Some people in this field are quite literally robots",
            "The complaints about the homeless stuff I get.  The weird lack of empathy of some programmers is terrible.\n\nThe rest of it though, get as much out of your employer as you can...They are making multiple times that off your work.  With the lack of a union, attitudes like that are the only way to make sure you get a fair share of what you are doing.  I don't have the energy for it but I don't begrudge the people who do.\n\nAlso, with the rush of people into the major you gotta enjoy the good working conditions while they last.",
            "Fuck those people. I would’ve live or work in the Bay Area whatsoever. No amount of money would make living around unbearable people bearable.",
            "I worked in San Jose for about a year, and it was by far the worse place I've ever lived. And I was in the Army for a decade. I would happily go back to living in a shipping container in Afghanistan before going back to your shithole county.",
            "I work in telecom as a software dev. I don’t really talk to my coworkers on a personal level because I have my personal life for that. I honestly haven’t seen this, most people I work with are foreigners who are just so happy to be in the states and have a chance at building a life here.\n\nI see much more humility than anything in my work, but maybe I just don’t know everyone well enough?\n\nAs for me, I think I’m an absolute moron who has somehow wiggled his was into this stuff. I’ve been doing it for 3 years, live in a really rough part of town, spend a lot of time volunteering and trying to be part of the community (just to give you a small picture of who I am). I think deep down I’m a horrible person and I try to compensate by being kind to everyone I meet.",
            "That's not elitism. I'm from the Bay and even I'm tired of the homeless problem. Fuck most of them",
            "Real. I was an intern at one of the bigger tech companies in SV.\n\nThe only reason I kept going after a week was because it gave me credits and the fact that I work at an animal shelter kept me sane.",
            "What are you actually bitching about? Busses are miserable, why eat bad food, who wants homeless people around. What the fuck? Grow up.",
            ">You're earning how many dozens of dollars per HOUR and you don't want to pay $2.50 for the bus to get to work?\n\nI don't understand this statement. \n\n>You heard my neighborhood has a reputation for having homeless people and you're asking if I have \"talked to my 'neighbors'\" yet and asked them \"what's the going rate for a strip of sidewalk on my block\"? Seriously? These are human beings.\n\nSimilarly confused. \n\n>Today I found a covered inside-outaide mall with many restaurants going/gone out of business. \"I'm surprised this isn't overrun by homeless people yet.\"\n\nIs your point that \"I'm surprised this isn't overrun by homeless people yet.\" is inappropriate?\n\nSorry, I'm just confused (not from the US) - can you simplify this (i.e, ELI5)? Thanks in advance.",
            "First world problems are good to have.",
            "What you describe doesn't sound like elitism.\n\nIt is just people having good jobs",
            "Get the hell out of silicon valley.",
            "You have to remember these people who work at big tech companies have one silly job like maintaining a chat bot or a few buttons that display data they'll do this as long as Google or whichever company needs them too. . Then just fire them when Google needs to make cuts.",
            "you should remain in the ghettos forever",
            "San Francisco sucks. Blame your politicians not the tech companies who are bound to leave your city soon",
            "> Seriously? These are human beings. \n\nmost are drug addicts or just lazy                              \nthey do NOT want to work               \nwhy should they ?            \nSan Francisco gives them free needles, there are plenty of places to get free food, the weather is nice, they get money from the government, the cops are told not to bother them, they can shoplift without worrying about getting arrested          \n\nthe only ones I feel sorry for are the mentally ill           \nbut you can't force them into a hospital, you can't force them to take medication",
            "Lynbrook High School",
            "[deleted]",
            "I mean sf looks like a 3rd world country",
            "West Coast garbage",
            "Are you excited for Barbie tomorrow?",
            "[deleted]",
            "You're free to go back to college and study art.",
            "This is Wendys, may i take your order",
            "[deleted]",
            "You couldn't pay me enough to live in that commie crime ridden, shit hole called Commieformia",
            "Lmao, get used to it if you're gonna be in this field. I get it. It's extremely annoying and obnoxious, but it ain't going anywhere.",
            "bRUH? Being rich makes you a better person!",
            "You paying them?",
            "i grew up in the bay and no one is like this…",
            "Experienced this in a tech start up in the SF city. I always had good opinions on SF because somehow I thought left-leaning=good because some left leaning ideologies are based on empathy. But I found zero empathy in the actual people in the company. No one would even respond with a proper hi when you enter a room if they think you are not useful to them or you dont belong to their little elite club - even if you are the ones actually solving problems on the ground. They are so indulged in their elite talk that if someone asks what they are talking about to get a context, they make poker faces like “how can you not know this”and just respond with more jargon only to make you feel like fool for asking a question in the first place. I am so glad I am out of there!!",
            "The complaints about free lunches and transportation is almost exclusively the coasters at the large tech companies. They flooded into tech only for the money and came in droves over the last decade. You can't really avoid them so you just have to ignore them.\n\nThe complaints about the city is a real thing though. I've lived in SF for a while and it does get annoying to pay insanely high prices for rent in your \"nice\" neighborhood, yet have to step over people passed on out drugs or to hose human shit away from your front door.",
            "It's because you're young. You think making $200,000 a year is cool until you wake up in the real world and realize that you can't afford a house near your job. Then you start thinking you need to make $600,000 a year to be cool.",
            "Tech is bigger than FAANG. Keep that in mind and work for companies with good cultures.",
            "I left that area, aka SFC lol 9 years ago.",
            "Hot take but a lot of people don't know what the average poor person looks like, nor have they ever seen a homeless person. This goes way beyond just tech, it just isn't in most people's lives and in my particular case, people are good at hiding how much they may be struggling. \n\nThey ask dumb shit like this because they wee fortunate enough to have a good background to never have to worry about this stuff. Which is a generally good thing, we should strive for people to not know what that's like. But its ignorant of them to refuse to educate themselves on the matter especially in silicon valley which is home to a lot of homeless people and people who cannot afford to live there serving as the chefs they grab food from.",
            "Here's a funny thing about the tech crowd. Elitism has always been a thing. During the early 1990s and 2000s when we still used big CRT for monitor, and everything related to computers were hard, cold, boring machine. Software UI was all ash-gray. Build tools were terrible. A lot of thing had to be done manually. Boilerplate was more than actual code.  It was not cool and hip. The people working in this sector were often looked down (especially by women) because they often don't make that much money (they make good money, but not as much as today), they don't know how to dress, often they are bullied by their coworkers, and looked down by other department, and taken advantages of by others.\n\nAnd I tell you they harbor a lot of resentment toward society. Like a lot. And resentment took on another form called ... \"elitism\". In their eyes, the rest of the worlds is idiots because the rest of the world don't understand their \"magic\" of their code. They are wizards and shit. They even get together, forming forums, and jerk each other off. Damn gross, the early tech crowd was despicable I tell you.\n\nThen BOOM, the new tech wave came, we now have services like aws, google cloud, azure, no one touch the hardware no more. The screen is LCD, flat, thin and slick. Software UI is all colorful with animation blinking here and there. An office of a tech worker is reduced to just a table and a slicky laptop. Often that's a macbook, because macs are a status symbol, and the tech workers after decades of resentment want to show the world that they are the shit, can afford the most expensive shit, although mac OS is not the best for software development, linux is better, but you're free to pick your poison.\n\nSo the IT crowd is hip and cool now and they are also rich, and just get richer by the day. Not only that, all the big boy famous billionaires are from the IT crow. Combine a mentality of a spoiled child + a adult child + a bullied child + pathetic mindset and often pathetic bodies + a lot money. You get what you called \"elitism\". In truth, it's just weak people swinging their mental problem from one extreme to another.\n\nSource: I am a software developer.",
            "\\> You're earning how many dozens of dollars per HOUR and you don't want to pay $2.50 for the bus to get to work?\n\n&#x200B;\n\nI never saw such people. I saw many people who don't wanna commute purely because don't wanna spend time for commuting though. And companies I know, gave a free Orca card to engineers.",
            "."
        ]
    },
    {
        "post_id": "1bbdiin",
        "author": "slick110",
        "title": "Google Fired No Tech Apartheid",
        "url": "https://i.redd.it/n5thgl7l3jnc1.jpeg",
        "score": 1268,
        "num_comments": 456,
        "created_utc": 1710085974.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bbdiin/google_fired_no_tech_apartheid/",
        "comments": [
            "They should all quit in protest. Especially the ones with a similar skill set to mine.",
            "Remember when they removed their motto of do no evil? ",
            "People are surprised this dude got fired lol",
            "Corporations don't care about anything but making the line go up. They would support nazis if it was profitable. That's capitalism",
            "Any job will fire you for screaming at a director and sabotaging a public facing conference to the press. How else would they even respond to this?",
            "Google is trash because on one hand they will release the most woke tech product ever and then also do shit like this. Failed leadership top down tbh",
            "bro is gonna enter this job market abyss and wish he just went to a protest or something instead",
            "Now Google’s firing people who don’t do their job and break shit? Truly insane, the industry is screwed",
            "DEI falls apart here",
            "Its pretty valid to fire someone for screaming i wont work on this in a internal meeting at their coworkers. \n\nOne of alphabets major missteps was early on refusing to work with the pentagon because some employees didn't want to. Amazon and Msft won those contracts and it greatly helped expand their cloud business. \n\nThey built this culture of coddling employees and now whenever they dont its news. At any other tech company this would be a non event. \n\nIf the employee didn't want to work for on the project, great don't, find a new role or quit.",
            "I'm confused. This is what the dude asked for?",
            "that’s sad honestly, but i don’t think he even wanted to work there in the first place because of the genocide. may God bless him",
            "Not surprising so why is this \"breaking\" news?",
            "What do these people think a business does? Why are they entitled to do all these activism and collecting the salaries?",
            "Google has proved in under a year it's one of the worst tech companies to work for. Nothing close to Amazon but it's getting there.",
            "I mean they did fire Timnit Gebru, who they hired initially to do anti-racism and algorithmic justice work. So, ya know, as long as their bottom line goes up, they dgaf.",
            "super brave and commendable of him, considering how coveted his position is, I think it makes his stance much more powerful",
            "We need more people like this, developers should pay attention to moral consequences of their work. There are people who try to separate themselves from the end product and take no responsibility. But the fact is: immoral tech could not exist without so many developers working on it.",
            "[deleted]",
            "Google hire me, I have no morals and I'll sell my soul for 90- no, 70k/y",
            "[deleted]",
            "Time for me to run into a Google conference and scream “Hitler sucks! Hitler sucks!” until I get arrested.\n\nAnd then I’ll get the world fired up on how Google “loves Hitler”",
            "Any company would fire him for what he did, you can’t disrupt a public company presentation and scream insults at your bosses and expect to go back to work the next day.",
            "Good 👍",
            "I'm fully in favor of these self righteous schmucks quitting in mass. Some people here are eyeing a senior position, and it'll be great help if a lot of the annoying competition removed themselves voluntarily. So yes, quit your jobs to show google!!!",
            "He was protesting the speech of the Director for Googles office IN Israel. Not some government official, literally a co worker FROM Israel. Anyone who treats their coworker that way should be fired.",
            "Good news guys, a few jobs were just made available!",
            "GeNoCiDaL rEgImE!!1111 ignoring the charter of Hamas lol",
            "Google are the best👌",
            "They did the right thing.\n\nImagine if evey employee gets to \"diruspt\" public presentations to push their own agendas?\n\nAlso, isn't kinda weird that we don't see anyone protesting at the same intensity for similar matters, such as the +400k women and children murdered by Assad in Syria or the opressive regime in Iran that killed a girl for not wearing that weird piece of cloth covering her head?",
            "good. fight back against this idiotic libelous agenda to call this war a \"genocide\". protest all you want, but stop spreading false information",
            "Nobody cares lmao",
            "Good.",
            "Makes sense... common sense even.  The guy identified himself as a Google engineer and Google doesn't want to be associated with that and didn't give him permission to drag their company into it.  Most companies will fire anyone if they drag the company into negative press like this guy did.  Regardless of what you're protesting, don't bring your employer/company into it unless you already have their permission and full support behind what you're protesting.  It's absurd that he mentioned Google at all.  He was trying to leverage the company's clout for his own political aspirations without permission, not ok behavior.",
            "I stopped using Google long time ago. I bookmark my favourite websites and block google trackers. It was hard at first, because Googling was like 2nd nature to me, I and we all used it for 20+ years, so it was hard indeed.",
            "The campaign openly exists within the company with petitions demonstrations and the rest - that doesn’t mean an employee gets to disrupt meetings with impunity",
            "Yeah, they fired James Demore for sharing data, you think they give a shit about activists?\n\nIf you don’t like what your company is doing, then quit, you’re some of the most privileged people on the planet to work at Google.",
            "Remember, regardless of the pay… if you support or help build such technology, someday it will be used against you or your descendants to control and enslave you.",
            "L bozo",
            "Fair enough that this individual got sacked. Hopefully, he saw that coming by shaming his company publicly like that.",
            "I’m out of the loop, what’s going on here?",
            "My brother told me he spoke to the account manager for all of Israel and I guess Israel is the 3rd largest consumer of Google in all of Europe and Asia or something",
            "I am struggling to understand what's written here. Could someone please explain in simple terms. Google did what?",
            "Little does that guy know there are tens of thousands of applicants ready to take the position starting immediately",
            "They should quit their job in unity so I can get hired. Btw, they’re so annoying",
            "I work/worked at Google. Google is totally in the right on this stuff, lmao. I think it's cool that there are engineers willing to put it all on the line (even though I disagree with it politically), and Google has a unique but dying culture around that, but eat the consequences.",
            "The lack of empathy in this sub, probably motivated by racial and religious classism is appalling.",
            "If Google signed that deal with Russia, every sub would be hailing these protesters as absolute heroes.",
            "Hey Google, my daughter is graduating in 2 weeks. Goal.",
            "When you feel fear when expressing your opinion. It means the freedom of speech is over.",
            "He deserves to be fired",
            "[removed]",
            "Yay, a job opening at Google. I don’t care what’s happening thousands of kilometers away from me.",
            "Everyone in this thread using mask words like \"professionalism\" and \"decorum\" is just dogwhistling that they support firing someone for making a principled leftist humanist stance.",
            "I should apply for his job lol",
            "So, there’s a position open up at google!!!  Awesome!",
            "Google does what any company would do and fires unprofessional employees but of course some people will be angry about a company firing unprofessional people because muh GeNoCiDe",
            "Now he's unemployed, probably never gonna work in big tech again and nothing has changed with Israel. Genius",
            "you’re all showing your ignorance and hideous colors in here….stand the HELL up, these companies DONT care about you. work on those morals of yours that companies like this one clearly don’t have.",
            "Join us at r/NoTechForApartheid \n\nhttps://www.reddit.com/r/NoTechForApartheid/s/oyTOwuycmO\n\nhttps://www.reddit.com/r/NoTechForApartheid/s/sVpFQFCg0J",
            "That is what terrorist supporters deserve, if they want to support a group that would happily murder other google employees then there is no place for them in the workplace.",
            "This is also influencer outrage horseshit? Dude who got fired gets big audience etc",
            "Good. Israel is not an apartheid lmao, fuck this trend man",
            "This should work well as a lawsuit, firing someone over a constitutionally protected right, it’s about time we act as a Americans",
            "To make things clear, why are a lot of people here denying, that HAMAS, on OCTOBER 7 specifically went to Isreal and invaded...to kill? Civilians??? they could've avoided every civilian and go to the military bases???? Instead they bragged over the phone how they killed civilians, how can one ever support that?? This is insane, I'm not excusing Isreals killing, but you know damn well what hamas did, and they actually could've avoided civilian damage .",
            "On top of his professional misconduct, Brin and Page are both Jews\n\nIdk what this dude was expecting tbh, a promotion?",
            "People don't know what an Apartheid is. A war is not a genocide.",
            "Oh noes, I thought he was going to be made the next CEO after they give the boot to Pichai.",
            "Yet both google and our progressive tech employees did nothing to a Chinese spy called Linwei Ding, who stole AI tech in support of a country that executes tech apartheid for decades, until he got arrested.",
            "Gaza is tiny compared to the destroyed part of Ukraine.\nIf someone mute on Ukraine but vocal on Gaza, you know who is their backer",
            "company fires worker who thinks doing his job is immoral\n\nthat's the whole point of standing up to evil, that its supposed to have consequences, usually negative, but you still stand up against it"
        ]
    }
]