[
    {
        "post_id": "jbwxgu",
        "author": "Loud_Fee9573",
        "title": "Anyone just want to drop out, get off the grid and be a mountain person?",
        "url": "https://www.reddit.com/r/csMajors/comments/jbwxgu/anyone_just_want_to_drop_out_get_off_the_grid_and/",
        "score": 1261,
        "num_comments": 147,
        "created_utc": 1602798036.0,
        "selftext": "I am doing really well in my classes and am helping other students out, but I am just tired of the constant grind. In addition I work outside of school as well. It seems like there is such a drive to be competitive and everyone acts like CS is supposed to be the hardest degree program. Some professors seem to go out of their way to trick students and make things harder than they have to be. Even though I am doing well, it seems to be mentally exhausting me just having to deal with all the BS. Sometimes I feel like I picked the wrong field, but I genuinely enjoy Computer Science. \n\nI consider myself a laid back person, so the constant studying, trying to get internships or building a ton of projects seems excessive to me. The only project I built outside of class so far is a website for my brother's farm, which I am slowly expanding upon. I haven't had an internship yet, but I don't feel super compelled to go out of my way to get one. I just want a career where I put at most 40 hours in, go home and enjoy myself. I don't want to be engrossed in my work, I want to enjoy my life.",
        "permalink": "/r/csMajors/comments/jbwxgu/anyone_just_want_to_drop_out_get_off_the_grid_and/",
        "comments": [
            "One of my goals in studying CS is eventually getting to a place where I can afford to own some mountain property, perhaps WFH. So I am viewing my time in school as a sacrifice I am making right now, in the name of having a better future with more work-life balance, and plenty of room to spend time in nature. \n\n&#x200B;\n\nThe grind is definitely unhealthy and there is a culture here is not aligned with reality. TBH I just ignore much of it - the emphasis on leetcode, applying for internships 8 months ahead of time, grinding code in ALL of your spare time - it's just not how the real world works for the majority of people. Reddit is not reality. I think that most people land jobs eventually without doing all that stuff. A lot of these people who have crazy ambitions to work for faang never stop to question their true motivation - I mean, does working for google really even matter that much? Who's to say you'll be happier there, versus a smaller company that hires you because you were a better cultural fit, or just more personable? Does prestige mean anything at all? It's a huge industry with lots of room for mobility in many directions. Don't let the pressure to be an over-achiever get to you. \n\nAs for professors making things harder than it has to be, there is a bit of an element of gatekeeping within CS degrees. Theres usually a \"washout\" class. But for the most part, the professors should be a resource for you to learn, and if you feel you're being \"tricked\" and not uplifted, thats something you should be bringing up to the professor.",
            "I think about this literally every single day.",
            "Same here.  Except unlike you, I'm doing really bad because I have no motivation and I'm shit at everything",
            "Me",
            "buying a van, shoving my mattress in there, and eat canned food until I run out and starve.",
            "[deleted]",
            "i kinda wanna become a monk and detach myself from everything rn",
            "[deleted]",
            "This is why I am going into test automation. Salary isn't far off a dev's salary, no interview grinding, no leetcode. Do your job and go home mostly.   \n\n\nLet the devs have the prestige and stress.",
            "Dude. Me. I’ve been seriously thinking about van life for so long now.",
            "Internships are great opportunities to learn about software development and how companies work in general. You don't have to build a ton a projects; you can just focus on a project or two that you are really passionate about, that way you are motivated to learn more and complete them.\n\nI agree that this intense grind is not healthy, and I believe that at the end of the day, you should love what you do.\n\nAlthough, becoming a mountain person does seem compelling.",
            "This is quite literally exactly how I feel; all my peers are so focused on the grind and even tho I do well in most of my classes and go to a prestigious university, I just don’t care as much about my professional life as most of those around me. I just wanna make friends with the people I work with and just have a good life outside of work and enjoy nature and friends and family most of all :)",
            "I feel you man..sometimes I forget that I am a human.",
            "I have a nice little place on an acre and it's amazing. Not too stressful of a job either.",
            "OP, thank you so much for posting this. Graduating next semester, never had any internships, college has been stressful enough so far and I've barely been able to stay on top of things. I was at a virtual university recruiting event with a big company earlier today and it just felt so disheartening to feel so far behind other people.\n\nIt's hard to realize this system of competitive grinding is actually really unhealthy when everyone around you seems to be doing 100x more and you just feel like you couldn't possibly ever catch up.",
            "Wow its actually really refreshing to see so many people on the same page in this thread",
            "I might just got get another degree in Forestry and be a park ranger somewhere far the fuck away from everyone. At least I’ll have a government retirement and my medical I’ll be covered by the government too 🤷‍♂️",
            "This is the most amazing post i have ever seen on this sub that's full of nerds that are just trying to show off their shit all day!!!",
            "Ya me too bro. I just want a peaceful life.",
            "I think about this 5 times a day everyday",
            "Same here. Also i’ve been watching a lot of youtube videos about people who started living in isolated mountains :)",
            "I’m reading this from my cs class rn :/ but same",
            "Man I recently switched to computer science major from business because of its challenging and will give me a competitive advantage to become self employed. Coding hurts my head so much, I just end up sleeping. If you think about it life is not all about getting a good paying job. Life is about exploring, enchancing the mind, and do things that you enjoy. Code is fun and rewarding, yet it is detrimental to mental health especially when you consume it so much",
            "All the damn time dude. Holy shit.",
            "15 years in the job, thinking about raising goats or farming since the beginning even though I liked engineering.\nStudied in France, so maybe different, but the worst grind was actually school. Then still a bit some in my early career and now it's easier.\n\nEventually the problem becomes the golden handcuffs.",
            "ive never related to a post this much",
            "Think long term. I'm at a spot where I make bank and work 4 days per week. I can go to the mountains any time I want, stay in a nice rental, have money for good gear. It's a grind starting out but you have a lot of years. Five or ten years down the line it makes a lot of sense.",
            "I agree everyone else seems so into it and I just want to have a good career and good life. I don't want my work to be my life",
            "Every day I consider dropping out and making furniture for a living, but that just won’t pay the bills. Just gotta work for 10-15 years and save up some money then you’re free to do whatever you want.",
            "yep",
            "Lol, literally told that my roommate last week",
            "I have thought about this quite a bit myself. computer science is just a lot, maybe I should just give up and live a more peaceful life.",
            "My dream would be to make some kind of game, app, etc. that does really well financially and just be able to retire, build a nice moderately-sized home in the mountains, and travel the world for a large portion of the year. I hate the idea of being a slave to a desk or a corporation for most of my life. From now until I graduate, I'm doing everything I can to avoid having to take on a real job. I'm still on the internship hunt because the unfortunate reality is that I will likely need to get a real job when I graduate, but I absolutely loathe the idea.",
            "dude i was talking with my friends about this last night lol",
            "I just want an office job. That’s all I ask",
            "This resonates with me a lot. There’s not the ridiculous competition attitude where I go to school, but I constantly read about it online. I also don’t want to work 60-80 hours a week, live in Silicon Valley and practice Leet Code during downtime to gain the acceptance of my peers. \n\nI want a career where I enjoy what I do, work no more than ~40 hours per week, am not pressured by my peers to live my life through my work, and live in a place that I genuinely like. I really like CS a lot, and I definitely am studying my favorite subject, but man. I just want a 9 to 5 that’s fulfilling, not draining. The field generally does pay well, but I’m not willing to change my entire lifestyle to make a little more and work a little more.",
            "I got my cs degree in 2017, so I’ve pretty much had the same feelings you are having. I remember during midterms for my Architecture class the average was 85%. Everyone was happy Except for the professor, she said she will have to make the final much harder... just to give you a little insight to what’s ahead, you’ll probably never stop learning technologies and constantly study and read code and documentation, most tech companies will make you work more than 40+ hours a week, and the stress feels even harder than it is in university.",
            "The way I look at it is if I’m not going to be a monk, live in the mountains, or that lifestyle, I might as well do what I actually enjoy with CS. So I’m pretty much planning on only applying to shit that I find interesting as long as I make a livable wage. \n\nIdk, there are so many jobs in this field that pay well but just seem boring as fuuuuck to me. Just grinding out random problems in cubicle for a machine that probably has a net negative effect on humanity. Maybe I’ll get paid well but as you said what’s the point. \n\nThat’s my solution though, to just do shit I like and stay outta the culture of it",
            "S ame",
            "It gets easier when you get a job. I've never been less stressed in my life since I graduated from college",
            "I would love to move to the mountains and just snowboard and code and shoot my bow and brew beer. Alas, my life is in the East Bay.",
            "this is the biggest mood today after a crappy internship interview",
            "Wait till you have to use Agile",
            "All the time",
            "bro literally all I’ve wanted since the age of 18 is to get an RV and travel the US while getting whatever jobs are locally in demand, my love for computer science died a long time ago but I still need it to collect money to pay for my dream, it’s not even much probably costs less than 100k but I been working the last 6 years for it and I’m still in debt :/",
            "i already gave up haha, fuck me",
            "Tbh the grind continues when you go into the field too.",
            "Same, with my degree I could probably actually find a job in a mountainous region but unfortunately I got graced with living in the Midwest",
            "Kind of seems like you’re stressing yourself out. Just take a deep breath and enjoy the ride. If you want to work on a side project, make it something you actually want to work on, not something you feel compelled to work on. If you want to get an internship, get an internship somewhere you actually want to intern at, not a place you feel compelled to intern at. Mind over matter. 🙂",
            "You would be a fool to \"abandon everything for a better, simpler life\" and you would likely regret it a few years down the road once you're stuck in a bad position and wonder to yourself, \"what if I'd taken the shit for about a couple years more?\" And then you will be a \"mature student.\"",
            "Hey I feel the exact same way! I'm doing my masters at the moment. I just got so fed up with the constant grind that now I don't even feel like picking up my books or my laptop. Since everything is online now, the professors make the tests extra hard with very less time to complete any of the questions. Their reasoning being 'We don't want any malpractice'. Who are the tests even for!?\n\nFamily, friends and hobbies. If I can have the perfect balance of all these along with the professional side, I know I can be way more productive. My ideal get a way would be moving to the country side. Be a part of a small town. Work at a local shop. You know the works. \n\nAnyway, let's get back into it, yeah? Let's finish what we've started. Give it everything we've got. Make the money and then poof! \n\nHere's to being in it together.\n\nCheers",
            "I am watching kitty vidoes and memes all day long, while doing a full time job.\n\nGrind it, even if you hate it. The real world is cruel and crazy, everyone is running behind TC to get financial independence sacrificing their present!",
            "I feel you. I am a laidback person too. The grind gets to me as well. I am ready to put my 40 hours in and then just enjoy the rest of the day. But the industry simply demands more.",
            "This has been running through my head all day",
            "Man I'm JUST getting into computer science, just started taking courses for my major this year, and this semester my professors are just piling on ludicrous amounts of work. I mean programming is super new to me, and trying to wrap my head around how everything works in java is a bit of a challenge right now. So short answer; yes.",
            "Yes. And jump off the mountain.",
            "Being a SWE is not for everyone. There is always tradeoff.",
            "Wow man, you are stealing thoughts out of my mind, that is precisely what I want to achieve. Feel free to dm me if u wanna talk about this shit, i would like to know someone who isn’t all abput the “Grind”",
            "the masculine urge to move to rural montana and live off the land",
            "I have a coworker who works fully remotely and lives on acreage in a remote part of Kauai. I thought about RVing around the us while working remotely. Probably couldn't do it in my current role though. I'd have to go back to being an IC. Being a mountain person though? No thanks...",
            ".",
            "Who are you? Where are you? Let’s go…."
        ]
    },
    {
        "post_id": "1aira1d",
        "author": "liquidInkRocks",
        "title": "I have an offer! Finally! but...",
        "url": "https://www.reddit.com/r/csMajors/comments/1aira1d/i_have_an_offer_finally_but/",
        "score": 1260,
        "num_comments": 111,
        "created_utc": 1707062827.0,
        "selftext": "NASA has also accepted me into the Aretmis Program. I could become an astronaut. They like my extra-curriculars, my GPA, and my medical history.  On the other hand, I have an offer from a MAANG-adjacent company: $165K to start, fully remote, and they will buy me a Golden Lab after 90 days on the job. I just have to live in a time zone where they have an in-person office, but I don't have to go there. \n\nNASA says I can't do both. They are pretty strict about these things, from what I've heard from some friends who tried to do both. I can't decide if astronaut will be better than full-stack developer. ",
        "permalink": "/r/csMajors/comments/1aira1d/i_have_an_offer_finally_but/",
        "comments": [
            "Lol the last sentence killed me",
            "Bro I actually got so excited by the Golden Lab benefit, you totally got me",
            "Can you work from home as an astronaut tho?",
            "I'm leaving this sub",
            "Being an astronaut will hinder your future chances of becoming a developer. Personally, I’d take the full stack gig to add relevant and valuable experience to my resume.",
            "https://preview.redd.it/14capjopqngc1.jpeg?width=1442&format=pjpg&auto=webp&s=05ddda7d86e70098bc114acf5e34a9af5303b305",
            "sh\\*t poster lmao, got me",
            "If ur actually being serious i'd choose being an astronaut like 10x over dgaf bout the pay you'd be making history",
            "Both opportunities sound really cool. Congrats!",
            "Real. OP is my disciple",
            "May I ask, what is a 'Golden Lab'? I've searched for it, only cute labradors showed up haha",
            "This dudes post history is constantly saying “I have an offer finally” in this subreddit. People are so annoying",
            "When will the shitposts end 🥲",
            "Is NASA in the room with us right now?",
            "It costs USD50 million + to go into orbit as a space tourist. I would take the astronaut option then once you get a spot to an orbital flight sell your seat for 50 million on eBay and then retire.",
            "You should get them into a bidding war.  I would demand a personal space craft from Nasa.  And maybe an ergonomic desk from your MAANG so you can sit stand lay and and that new apple vision pro thingie.",
            "Bro is suffering from success😂",
            "*A Million Miles Away* helped me make my decision",
            "Is this a joke LOL",
            "Go with your gut",
            "![gif](giphy|l44QzsOLXxcrigdgI|downsized)",
            "Lmfao be an astronaut homie",
            "Love thus sub fr😍",
            "Tbh its hella disrespectful for you to consider either. Hard working people at the unemployment office will be bored not having to process your application now is that really worth pressing your light up squares in a special order or fucking up scuba diving so bad you forget the damn water?",
            "The amount of people not understanding this is a joke explains why so many people can't get a job here",
            "This may be a shit post, but astronaut 100%! I’ve never been to space, but maximizing shareholder value can’t be as fulfilling as seeing the earth from space.",
            "NASA ofc, you don't have to bother with low iq tards on the earth. You might even get a date with some hot alien.",
            "![gif](giphy|ylyUQkGsUNoJLlVOyk)",
            "accept both and work remotely from the space as a full-stack",
            "https://preview.redd.it/oxjd8ntxivgc1.jpeg?width=1024&format=pjpg&auto=webp&s=5205be0cf128e4c2c32203ada1e9429838142098\n\nI asked GPT-4 to capture your dilemma and oh well.",
            "What weee your skills and internship experiences ?",
            "Choose the Artemis program any day lol, let me know what it’s like on the Starship, cool ass rocket",
            "I would ask Yi Lon Ma what he would do.",
            "Choose NASA bro so we have 1 less person to compete with",
            "[deleted]",
            "Helping fake moon landings to look more realistic will be a fun job, I say go for it!",
            "I’m not a fortune teller but I’d bet any amount of money that you would 100% regret passing up the opportunity to be an astronaut. Like the type of regret that keeps you up at night.",
            "Remember you can develop a lot of lucrative side gigs with your reputation as an astronaut and this can potentially give you a way better income compared to our code monkey friends.",
            "Honestly, I think if you are physically strong and want to go through all the tough trainings, NASA it is. Personally I would pick an easier job that makes money.",
            "Both are my dream😤",
            "😐",
            "You can also make a world better place by making a API and microservice✨",
            "Ragebait almost got me",
            "Amazing",
            "They’re gonna buy you a Labrador ? What is a golden lab",
            "The only thing that made me doubt this post was the golden lab lol otherwise it seemed legit to me",
            "Golden lab?  As in golden Labrador?",
            "Fuck this sub bruh. What??!",
            "okay very funny",
            "The pupppppy",
            "I knew a MAANG Eng that dropped a good paying job for JPL.",
            "nice!",
            "NASA. You have many more chances for the other choice later.",
            "Yo go be an astraunot. MAANG companies are using people and tossing them to a corner when they’re done with them. Paypal let go of 9% of their workforce and they’re all 10+ year experienced team leads. \nYou can always be a full-stack developer later on in life, it’s no where near as cool as being an astronaut wtf"
        ]
    },
    {
        "post_id": "17a4ih3",
        "author": "JumpStartP",
        "title": "Think I’m done with this season",
        "url": "https://i.redd.it/cbekppcsysub1.jpg",
        "score": 1262,
        "num_comments": 180,
        "created_utc": 1697565836.0,
        "selftext": "Finished recruiting I believe with offers from: Stripe, Figma, LinkedIn etc.\n\nT500+ Uni and International student so pretty happy with results. Feel free to ask anything.",
        "permalink": "/r/csMajors/comments/17a4ih3/think_im_done_with_this_season/",
        "comments": [
            "Those are some nice ratios. What does your experience look like?",
            "500, 5 interviews, 0 offer",
            "[deleted]",
            "Look at u/JumpStartP man, so inspirational. Congrats on Jump Trading excited to see you there with our pal **Goku**!",
            "it hits different that you’re international. congrats !",
            "Bro is HIM.",
            "Achievements from olympiads in informatics?",
            "Holy shit, congrats man! Is this for an internship or graduate position? I go to a T500 as well, with 4 internships, but I'm struggling on new graduate positions",
            "Could you post an anonymized version of your resume? I think it’d be super helpful for everyone :)\n \nAlso, did you do a lot of networking for those roles or did you cold apply?",
            "Lol I almost believed this was NG",
            "Advice for getting first internship?",
            "Welp time to kms",
            "[deleted]",
            "did you say you required sponsorship ?",
            "Hey can I dm you with questions? I’m a sophomore looking for my first internship rn",
            "Does anybody else here think these numbers are exxagerated? The current market is crazy for tech, no offense to you OP, I’m sure you are very talented but only 35 applications and so many responses?",
            "Damn congrats. Do you mind if I dm you with some questions regarding the process?",
            "He's him bruh",
            "When you 🧢 about your grad year and the internship extends a FT offer , do you just outright reject it ? Or do you inform them you intend to extend your education?",
            "I don't know if a junior from stanford cs with 4 gpa and multiple faang internships could get this kind of prospects in this market.",
            "how did u get these offers from a t500 uni??",
            "Something seems odd. This ratio is very unlikely.   6 offers out of 9 final rounds lmao! #bullshit",
            "What internships did u do? What roles/tech stacks did you work in? Also, what country are u from?",
            "Approach to prepping for leetcode questions?",
            "Just a quick reminder for a lot of people lurking on the sub: there are plenty of people who have the same experience as OP, they just don't post. The 129301293+ applications, no interviews, no offers, T1 university doomer post people are NOT the norm.",
            "@jumpStartP what role ? Swe?",
            "What year are you and what year did you apply as?\n\nEx. Sophomore but listed junior on application",
            "Hi, can I please share my resume with you for a review? It would be really helpful",
            "are you intern or new grad?",
            "wow, nice congrats. What is \\`\\`'T500+'??",
            "Hey how long did it take to hear back from figma after applying on ripplematch? Like how many days",
            "Congrats I wish I had your luck can’t find anything hopefully I get a job before my unemployment runs out",
            "Beast mode 😮‍💨",
            "Holy damn",
            "What are y’all using to make these I’m seeing them everywhere",
            "Congrats! but just.. how? I have two amazon internships and got no interviews so far. Was it mostly through networking/referrals?",
            "How did you answer the sponsorship question in application since freshman year?\nRequire sponsorship or Do not require sponsorship?",
            "What did u do in preparation for technical interviews",
            "So no TOP500 uni means no job?\ngg for me then",
            "Congrats! This is amazing!",
            "Yooooo wth",
            "Beautiful work brother",
            "Random question:  How old are you\n\nJust to give myself more stress",
            "Figma balls",
            "35 applications 😭",
            " any competitive programming experience? or special projects that may have helped?",
            "Impressive. Congrats",
            "Went 43 -> 0 interviews last summer🤭",
            "Can I pm u, need help real bad😭",
            "heyy can you please share what your resume looks like?",
            "Leetcode/ interview tips?",
            "[removed]",
            "Who are you?? What is it?? Explain in detail pls",
            "Congrats man \n\nMine 70+ applications, 40+ OA,  only 1 interview, 1 offer (from Amazon)  :)",
            "6 offers on 35 applications? I would like to speak for everyone here. Congrats and fuck you",
            "Damn what the fuck? And I can’t even get a single interview…",
            "hi i can’t dm you but is it okay if i share my resume with you to ask for some advice? im an international sophomore too but havent got any interview",
            "In which country are you ?",
            "Can you share your resume? It would be really helpful for us",
            "How do you make this chart?"
        ]
    },
    {
        "post_id": "1c7ubjz",
        "author": "deja_vu_999",
        "title": "ALL I WAMT IS MONEY!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/1c7ubjz/all_i_wamt_is_money/",
        "score": 1260,
        "num_comments": 336,
        "created_utc": 1713525464.0,
        "selftext": "I don't get the way you guys think. I want MONEY. 6 figures right out of college. 200k a year entry level. I'm in this for MONEY. I don't care about whether I'm \"fulfilled\" I want MONEY. Whatever gets me the most MONEY. What do I need on my resume to get the most MONEY. What technology gets me PAID THE BEST. All I care about in this major is MONEY. That's why I'm in college, I don't wanna laugh and play with y'all. I don't wanna be buddy buddy with y'all. I'm here for MONEY.\n\n\n>!source : r slash csmajors, shtpst!<",
        "permalink": "/r/csMajors/comments/1c7ubjz/all_i_wamt_is_money/",
        "comments": [
            "I’ve never seen a line of code in this sub, but guarantee I see the term “money” or a synonym or a related term",
            "https://preview.redd.it/xe48n6kdafvc1.jpeg?width=943&format=pjpg&auto=webp&s=23189894fb056cc651093407d6abd0837b130299",
            "Easy just gotta spend all your time learning and building projects. Focus on learning how to build/design based on the bigger picture. Do everything you can to get into design and decision maker meetings. \n\nTake on extra stuff like scrum work and TL responsibilities. Get a PM cert abandon the computers and become a manager",
            "Has anyone not heard of the tragedy of the commons? We need fewer people in CS to maintain the high salaries. If you want money, you need to tell people there's no money in the field, especially your competition in your same college year.",
            "Work for my company, do some sales, if you make me $1,000,000 profit, on top of your $85k, ill give you a pizza party",
            "assembly",
            "Switch to nursing , get a job , and get money",
            "I know this post is satire, but then again here's my story: I didn't choose CS because I was the \"passion over money\" kind of girl.\n\nWhich was stupid, because I ended up liking CS a lot more after a few months of working than my own major that I learned for 4 years in college. \n\nAfter graduation, I couldn't get a job in my own field after applying to 100+ applications for half a year. Then I learned coding by myself and got hired almost immediately in the IT department. Which is ironic, because my own field doesn't even pay that well. My current job pays a lot more than any job I'd get in my own field.\n\nAnyhow, I think people can be passionate about *anything* if they just put their mind into it, so just GO CHASE THAT MONEY!",
            "We all are in it for the money. But some of us do love the art of it.",
            "I dont know if this is shitpost, but actually I am in this for the money. I don't even like computers lmfao let's gooo. Gimme that backend SWE salary boy. Gonna delete this comment soon or later tho. Gate keepers gonna gate keep.",
            "Keyword: MONEY",
            "You want money? Fucking focus on skills that pay off big.\n\nLearn cloud computing (AWS, Google Cloud), machine learning, AI, and blockchain. These areas are fucking goldmines right now.\n\nGet damn good at Python, Java, or JavaScript. They're essential for high-paying tech jobs.\n\nLand internships at top tech companies. They're your ticket to securing a high salary post-graduation.\n\nHate to break it to you, but who you know matters just as much as what you know. Start connecting with people in high places.\n\nConsider certifications like AWS Certified Solutions Architect or Certified Information Systems Security Professional (CISSP) to boost your marketability.\n\nObsessed with making 200k straight out of college? Target roles in software engineering at top firms or get into specialized fields like cybersecurity or data science at companies that are known for high starting salaries.\n\nBut remember, chasing money with no passion or interest in what you're doing can burn you out fucking fast. Are you ready to handle that, or are you just chasing fantasies? What’s your plan if your high-salary job turns out to be a soul-sucking nightmare?",
            "Can you do the work well and punctually, can you explain it to a non-CS person, are you likeable and able to work with others. It's not that difficult, people just don't want to put in the real work and companies see that.",
            "This sub needs mods",
            "Trust me, if MONEY is your motivation. You're in the wrong boat.\nVery soon it will get depressing, no matter the field of study.",
            "Work to live not live to work",
            "People like you have ruined this field. \n\nI have an accounting degree but I absolutely love CS & DSA. I took lesser pay just to get the right kind of work. Hell even my favourite movie is “Traveling Salesman”.\n\nNow, everyone mfer on LinkedIn wants me to tell them the quick and fast way to get into this field so they can brag about it. Screw you all.",
            "Not sure if /s or real . I would assume it’s real cause I’m doing it for the same reasons and can feel for you . \n\nIn all honesty the reason we think about money in this industry is because there are a fuck ton of money and you can really get 6 figures and live comfortably",
            "OP clearly has never worked a toxic job that paid well. All the money means nothing when it gets invested into drugs, alcohol, more appointments for your mental and physical health, and useless impulse purchases that you think will make you happy.",
            "How is this incorrect? People work for money, not for fun",
            "I'm unironically in it for money and because I was an addict with 130IQ. One of the only careers gated by intelligence rather than credentials, connections, time/training/money, nepotism, etc. So you can take a guy who'd otherwise be struggling or homeless/dead and get him interview ready lmao. \n\nThat is what makes it a low \"power\" role, though. Prepare for no respect, thankless nature, and so on. Doesn't really matter your level. \n\nAge 31\n1.2M net worth\nTC 250k USD remote from Japan\n\nI don't touch a keyboard without payment",
            "Preach! 🤣",
            "lmaooo sooo réal.",
            "You think this is bad check out any of the writing subs",
            "Don't get me wrong, I enjoy this major, but the money was the motivation. Amen.",
            "You’re so real for this 😂😂",
            "If you want money you don’t have to get into tech. Go be a streamer, content creator, start an online business, start a OF, etc 🤷‍♀️. Depends on where you at selling drugs is still making money.",
            "I just wanna support my family :(",
            "As you learn more about the field you realize those six-figure entry level roles are truly quite difficult (usually), insanely hard to get positions for, and have a high rate of turnover & burnout (again, for entry level).\n\nIf you want MONEY, you need EXCELLENT skills in a very marketable area. Networking helps. Internships at big companies help.\n\nI’m in it for the passion tbh.",
            "Seeing a notification screaming “ALL I WAMT IS MONEY!!!” Is quite funny. This is a part of the reason why I joined this subreddit.",
            "Then why aren't you on wallstreetbets?",
            "Go to wsb or work for hedgies",
            "Open an onlyfans account then.",
            "I wamp that too..",
            "Cool, good luck with learning!",
            "Good hone this and understand this doesn’t come easy. In my ugrad, I took advanced maths, more AI courses than I can count, and stats courses where I wanted to quit every day. \n\nAnd in that siege, you will probably want a “buddy-buddy” so you don’t go mentally insane.",
            "Guys I think he wants this thing called money, I’m not sure though",
            "Nice repost/copy paste. Saw this a year or so ago. Pretty funny nonetheless.",
            "Definitely. I went to architecture first. Mistake. Go for the fucking money FIRST my friend. THEN once you’re at a good economic place, start pivoting your work demands for balance and spiritual fulfillment.",
            "What do you want money for? You need a lot less money than you think to be happy. I think if you hate cs you're going to have a bad time doing cs for the rest of your life.",
            "Bruh at least make an original troll post this is literally repost of one of the top posts of this sub smh are mods dead?",
            "I’m very surprised no one recognizes the repost. Still funny though.",
            "Lol true😂😂",
            "Get to work. There is no specific “tech” that’s guaranteeing you 6 figures out of school. If ur worth 6 figures in a respected tech you’ll get the 6 figures. Make urself valuable because there is millions of people in each subset of technology that are 100x what you are that aren’t getting paid 6 figures. Distinguish yourself and the money will come.",
            "Fuck yea OP got their priorities right",
            "TC or gtfo",
            "TC or gtfo",
            "Enjoy the misery then.",
            "India + general + male + engineering aspirant = deadly combination",
            "Bleh, getting trolled here too. Guess I'll unsub to this like I did with the other cs subreddit.",
            "bhai mil gaya karma ?",
            "Perhaps the real money is the friends we made along the way",
            "I have a question: Is a typical cs job, or a typical finance job more soul sucking?",
            "Where do you live that 200k/yr is even a possible starting salary for CS?",
            "If you are so obsessed with making money, there are much better ways to do so than CS. \n\nIf you’re obsessed with money are you really going to be happy with your measly $200k a year (if you’re lucky) when there are finance people, influencers, CEOs, athletes, musicians etc making tens of millions per year?",
            "Do pre med lol (unless you are working to become a CEO). At least that is not as saturated as CS.\n\nOr even better you can become a Civil Engineer; they have a hiring shortage.",
            "I mean do you want to be poor or something? Go write code for free then. Go make some open source software",
            "I am confused as to what you want in life. Next time be specific.",
            "Same man. I’m in it for the money too. My motivation is strong though. I’m in top 1% of lc contest leaderboards globally and same on Codeforces globally. Also got one year of exp as a swe while I’m still in school. The thing is it doesnt matter what drives u as long as that drive is real and you want something really bad. For me it’s buying a damn corvette. Stupid, perhaps but gets me going.",
            "I mean honestly yeah. If waste management paid 500k I'd be diving in the trash",
            "Waaa cry me a river. I was in my 40s before I got 6 figs. Welcome to the club and now go sit back in line behind everyone else. No one owes you free money or a job. What makes you so special? The marketplace and experience determines how much you can get in return for your work. The workload and politics are required for higher salaries",
            "If all I wanted was money I’d be going into law. But I actually have morals and enjoy coding so I think I’ll study computer science.\n\nI read a comment a while back that was something like this: I had a high paying job that I hated once, then realised I was spending all my money to distract me from hoe terrible my job is.",
            "What and who is this post for?",
            "[levels.fyi](http://levels.fyi), teamblind probably more, I dont think that any other job sector has so many tools, so much focus on money. all tech ppl talk investing/fire etc. we are all on this for money.",
            "Real",
            "See how long you last in your career looking only for money! Would be curious to know if you start getting depressed when the sole purpose is money.",
            "When company HR interviews you and you are absolutely telling the truth:",
            "I will never understand why this mindset is looked down on. People will do absolutely *atrocious* things for money, going into a field of work because you it pays very well is beyond trivial compared to what we’ve seen people do for money.",
            "My bottom dollar for genocide is 500k",
            "Yum yum yum delicious pasta.",
            "Why are you doing CS then?  Petroleum engineers make more money on average.",
            "Only fans",
            "Good for you pal",
            "I went into this for the money, I love computers in general a lot, but no particular part specifically, I’m good at computers and it pays a lot so I picked this, turns out I like it and I’m good enough at it\n\nIf I wanted to follow my passion I’d be a park ranger lol",
            "Bro said honesty is the best policy",
            "Man it kinda sucks when you chose something for money, spent all of your mental health to be qualified for it and then get fucked and work at mcdonalds.",
            "If the only reason you're in college is for money, you'd have been better off as a sparky",
            "Gonna tell a story you guys might not like. Friend graduated from top 10 CS program. First year out of college he made 200k+ in medium cost of living area. The kicker? He didn’t work in tech, he worked in technical sales. Knowing how the tech works to sell to engineers gives you an insane advantage.\n\nNot saying you could do this, most ppl in this sub have no social skills.",
            "Yeah, that’s the truth. If I were a trust fund baby, I’d spend most of my time reading papers, writing, and finding optimal solutions to the weirdest questions in the world.\n\nBecause life would be rich, but sometimes boring without doing these things.\n\nBut now I need to survive.",
            "Its like you’re asking your mcdonalds manager for 156% raise wen he’s only making $2 more than you, catch the drift? You’re in the sewers bro, back of the line",
            "This was me in college.\nCurrent TC: 264k. Happiness: 0",
            "The funny thing this might be satirical but at the end of the day the \"I want money\" doesn't understand that the more of us there are the more competition the more people willing to take less for the same job and the only people that benefit are corporations that pay less for the same labor. They benefit off greed of the masses and without knowing it they destroy the very thing they wanted and end up getting layed off. Then out of the corporations own greed report record profits because of cheap labor and lay off their most senior staff as their biggest overhead is labor. We are kinda at that point now.",
            "Another one bites the dust",
            "I am into data analysis right now for money not for pride. I need to graduate and ran shot of money",
            "Learn how to spell and you might get some one day",
            "Fun fact: being buddies with people in this field will actually on average increase your salary, so maybe just change that one thing in the name of MONEY",
            "HFT quant",
            "Lmao good luck in this job market",
            "![gif](giphy|9tXw3xlI8koaR0TrnJ|downsized)",
            "MONEYYYYY!!!!",
            "Sounds like you’re from a third world country, on top of that, with room temperature level IQ.. so good luck with that.",
            "Ur a weirdo if money isn’t what you’re after in this biz",
            "Love the sarcasm/metaphor, that's why most of these pity farming shtposters continue to bark on Reddit for years with no career growth lol.\n\nAlways fun to watch them suffer lol.",
            "Matlab pays awesome, you should learn it.",
            "People who work for their passion are being scammed.",
            "Well, this dude won't last long.",
            "jajajaj you are in the wrong career path if so...  You should be a politician so...",
            "Leetcode, networking, and networking.",
            "You’re not going to have a very good and fulfilling life. You definitely won’t get 6 figures out of college either.",
            "IT is oversaturated with people applying for jobs lol"
        ]
    },
    {
        "post_id": "1cc6weg",
        "author": "Ok_Acanthisitta_6688",
        "title": "None of this would have been possible without all the hardwork and dedication... Oh yea and my dad too",
        "url": "https://i.redd.it/p1ttpkvu8hwc1.png",
        "score": 1259,
        "num_comments": 58,
        "created_utc": 1713986176.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cc6weg/none_of_this_would_have_been_possible_without_all/",
        "comments": [
            "Did you get rejected from the guy your dad knew?",
            "The boomer path actually worked📈",
            "P.S. Fuck Amazon",
            "I shit you not, some of the comments on posts in this sub are still saying CS jobs are booming and folks should have no problem getting hired.\n\nMeanwhile, if you stroll over to r/recruitinghell it is 95% IT and CS folks who have been out of work for months to a year, pumping out 100 applications a month with nothing to show for it.",
            "dad knew someone -> interview -> rejected",
            "So far I've seen is without connection it's virtually impossible",
            "At this rate I'm gonna switch to a double major to extend my degree and then go into a master's just to extend my time getting student loans and maybemaybemaybe getting an internship while I hope that the market stops being so shit",
            "Internship or new grad?",
            "what was the timeline of your connection-based one?",
            "Fucking nepo baby lmaooo\n\nJk, it's rough out there, shout out to your dad for looking out!",
            "I completed my amazon onsite on 12th, still waiting for a response",
            "Which app can do that chart?",
            "Sometimes you need someone to open the door for you",
            "This is literally every job I’ve ever had. I mean … not my dad my dad’s a jerk but people referring me to someone hiring.",
            "You guys need to start a business",
            "How much do you want to bet the offer was by the same company that your dad knew someone of",
            "I like the honesty about getting the job offer from a place your dad knew someone. It shows that networking is extremely valuable. If I had parents that knew people I’d 100% take advantage of that. If someone didn’t in this market, they are fools.",
            "nepotism rocks",
            "Usually in IT fields people most often get the job by knowing someone in that company who can recommend them to the others.",
            "Usually in IT fields people most often get the job by knowing someone in that company who can recommend them to the others.",
            "He got waitlisted and said fuck them lol 😂 with a 3.24 gpa you can’t be out here acting like anyone else is the problem."
        ]
    },
    {
        "post_id": "18c7uzn",
        "author": "Dazzling-Rooster2103",
        "title": "My 2024 New Grad Application Stats. 1 Previous internship, T400 School, US Citizen.",
        "url": "https://i.redd.it/3vl3fbg1cp4c1.png",
        "score": 1259,
        "num_comments": 87,
        "created_utc": 1701880389.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18c7uzn/my_2024_new_grad_application_stats_1_previous/",
        "comments": [
            "My school is ranked 401 guess I’m fucked 😢",
            "The exclusive t400. Congrats 🎉",
            "T400 is crazy",
            "Almost T1000, which is a bioweapon developed by Umbrella",
            "dawg said T400 like it’s a F500 company 💀",
            "I'm curious to what schools are **not** T400",
            "Is T400 still T?",
            "T400 💀💀",
            "100% efficiency on interview. Congrats!",
            "What is T400",
            "Nice man one company gave you a chance and you killed it!",
            "What’s your GPA if you don’t mind",
            "Congratulations!",
            "Getting an offer after your first interview is really lucky, good for you",
            "What’s your tc peasant",
            "Hey, OP didn't say what kind of job, for all we know, could be dishwasher at McDonald's",
            "Is the school on mars?",
            "What’s T400, top 400?",
            "T500 non US   \napplied 1  \nInterview 1  \nOffer 1  \nAccepted 1",
            "what company",
            "This is basically my online dating experience",
            "How do you create a chart like this?",
            "can we ban these posts. this is like the millionth one ive seen",
            "what the fuck are these shitty ass graphs? why does anyone use them?",
            "How to make a chart like this :0",
            "How you made this application tracking diagram?",
            "How do you create these?",
            "My school is probably under  t400",
            "that one company is a real G lol",
            "Congrats! TC?",
            "OH MY LORD BRO ……..",
            "How do you know what rank your school is???\nIs there an actual respectable list somewhere?",
            "Damn it’s cuz you aren’t T389",
            "Nice",
            "hahaha what the hell t400 so ranked 400?",
            "There is something uncanny in 1 interview leading to 1 offer leading to 1 job acceptance that I can’t describe with words",
            "What do you mean by T400? T400 in the world or T400 in US?",
            "Look into dialysis. They are always short on RN. May not be your dream job, but it gets you into a specialty for a couple of years. That will open other doors.",
            "bro finally made it, W",
            "congrats fellow 400T",
            "How much did you spend on your application fee\n\nEdit: mb I thought he was applying to the T400 grad schools 💀",
            "Please tell me you meant T40 and not T400……"
        ]
    },
    {
        "post_id": "1ash6wg",
        "author": "Forward_Opinion6038",
        "title": "The grind",
        "url": "https://i.redd.it/1agmj14n00jc1.jpeg",
        "score": 1254,
        "num_comments": 34,
        "created_utc": 1708111561.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ash6wg/the_grind/",
        "comments": [
            "Fr so many ppl on this sub need to chill out. Read a book. Talk to another human. Touch grass. There is more to life than CS i promise",
            "I mean - this is just the stupidest thing, isn’t it? They told us to choose this path, grind and that good things await once we are on the other side. Now, we are on the other side. I wake up and see that some dude is encouraging everyone to apply to 4.5k jobs to land one. We accept and start grinding again. The weirdest thing is - it doesn’t feel like grinding anymore. Grinding is basically what we only know at this point.\n\nEDIT: So, I just realized that the other side was never supposed to be the promised land. There really is no other side. It’s the same side. All it did was teach how to live this hell of a life. \n\nTo the dude, applying to 4.5k jobs - *are you fcuking crazy?* Do you realize that you could just skill up in that time and either have a better shot at the first 100 you applied to or have only 50 applications to send because you picked up a skill that’s in demand?",
            "Cat here :)  Love cuddles <3  Like normalizing whatever this is.  Been in the industry since 2000.\n\nSerious advice:\n\nYou're not a \"CS Major\" or a \"programmer\".  These are just skills.\n\nYou solve problems.",
            "That mouse is grinding algorithms i bet.",
            "almost like a new normal to just grind and keep pushing yourself through the \"I finally got the job\" posts with every single one of them having the graphic",
            "Ok but what if I make a game about cats sleeping",
            "The only grass I’ll be touching is THAT MF PAPER💸💸💸💸",
            "I concur.",
            "Implying that getting a job isn't a D20 dice roll, seriously, most if it is due to luck.\nMaybe the guy was in a good mood, maybe he liked you're resume better.\n\nThe problems isn't about grind, it's about 30k people with good amount of experience suddenly popping on the market, we went from a market with high demand to a market where HR can bow get someone with 5 or 10 years at a FAANG.\nIt's going to settle down, but right now it's a mess, HR are way more stressed about finding the \"right\" one than \"anyone\".",
            "Where can I find the original image?",
            "Fuck your opinion",
            "Dude when you start working you will realize how pointless all this is, get a good enough TC and start living life!",
            "Hell yeah",
            "There are 3 cats, so obviously this is a pro-concurrency post?"
        ]
    },
    {
        "post_id": "184i04q",
        "author": "iNyxu",
        "title": "summer 2024 got me fucked up",
        "url": "https://i.redd.it/2pza4jy1qq2c1.png",
        "score": 1237,
        "num_comments": 21,
        "created_utc": 1701025482.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/184i04q/summer_2024_got_me_fucked_up/",
        "comments": [
            "you: \"its hard to find a good one\"\n\nme: \"its hard to find one\"\n\n&#x200B;\n\nwe are not the same",
            "What’s hilarious about this guy is that he gets a job but leaves it because of “fate”",
            "You got this, I didn’t get my internship last year till February, you’ll find one ⭐️",
            "My name is James Cage white . James is from James Bond , Cage is from Nicolas cage. White is from white women . I combine them together and made it my name . Very cool very swag I like it , I’m good at naming, thanks so much for support 😀",
            "The job market didn't have any sales for Black Friday?",
            "James White... the bummest of bums",
            "Unionize my children\n\n![gif](giphy|jj9yreK7SxC18bkoRC)\n\nJava is made from coffee, it is the way.\n\n\\-old Linux grey beard",
            "isn’t this the same guy who wanted a white attractive woman ?",
            "I graduated in may and haven’t found a cs job yet",
            "The market is already slowly recovering. Take a “not good” job if you have to pay bills for a few months, recruiters will be kissing your ass so much soon enough it’ll get annoying."
        ]
    },
    {
        "post_id": "18f5xj1",
        "author": "TuaHaveMyChildren",
        "title": "I never thought I'd see this day",
        "url": "https://i.redd.it/amh7zffsjh5c1.jpg",
        "score": 1225,
        "num_comments": 72,
        "created_utc": 1702221944.0,
        "selftext": "Nothing fancy but I'm so glad to be able to learn and see how production software is made. I can't wait for next summer.",
        "permalink": "/r/csMajors/comments/18f5xj1/i_never_thought_id_see_this_day/",
        "comments": [
            "So you essentially have a 100% interview success rate",
            "You did well. This is actually what it looks like for most people. Sick of these diagrams that show a 10% success rate.",
            "Congratulations!",
            "On a side note, how did anyone make this diagram?  (Have been wondering for sometime)",
            "Congratulations!",
            "Remember yall; all it takes is one!",
            "Did u get no OAs?",
            "Question, did you do a different cover letter for each one? Or just one general one?",
            "Congrats! Is this for intern or full-time?",
            "Nice job ❤️",
            "Congrats!! You deserve the offer!",
            "“How’s your father”?",
            "People are actually taking this serious 💀. It’s a meme",
            "Good shit bro",
            "Way to go!",
            "beautiful",
            "Great!! Congratulations Hope all works out!",
            "Congratulations! How was the interview?",
            "Are you a US citizen or an international student?",
            "The ~400 mark seems pretty common among these posts",
            "which company?",
            "![gif](giphy|28NaxS5MgzmYnGrs9V)",
            "Are you international student?",
            "Congratulations!\n\nMy hunt will look just like this if I get the offer from the only interview that I got after 420+ applications.\n\nThe manager said he is going to send my recommendations is that a good sign or do they say this to all candidates.",
            "Congrats, it’s tough right now",
            "Good job 🫡",
            "Congrats!",
            "How do you guys make this visual stats?",
            "What is this type of diagram called?"
        ]
    },
    {
        "post_id": "16ovtxv",
        "author": "None",
        "title": "Stop sending emails to recruiters, and start sending an email to Thanos.",
        "url": "https://i.redd.it/v1iigmhh8ppb1.jpg",
        "score": 1229,
        "num_comments": 114,
        "created_utc": 1695341431.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/16ovtxv/stop_sending_emails_to_recruiters_and_start/",
        "comments": [
            "I’ve gotten reached out to by a few recruiters. And every-time I’ve asked how many applications they’ve received just cuz I’m curious. It’s been in the thousands every time. Idk how I’m ever gonna make it in this field",
            "Damn I didn't know home Depot was so popular for cs majors",
            "It’s finalized. Switching my major to human sexuality",
            "As someone on the other side these numbers are misleading. For one they are just counting clicks not full applications. And two unfortunately remote positions are also filled with people abroad because they think we will happily pay them a US salary in their country",
            "We need another covid wave. We need a volunteer, who wanna be patient zero this time",
            "I once sent a CV for a trainee position. The owner of the company responded by thanking me because of 150 CV's, only 3/4 had met the most basic requirements they asked for.\n\nSince that happened to me, and since it was not on LinkedIn but in a more serious place, I no longer worry as much about the applicants. The bad thing is that maybe you are filtered because they don't have time to read you.\n\nEdit: 3-4, no 3/4. My bad",
            "Try refreshing the page, this linkedIn number is garbage and changes weirdly on every page refresh",
            "I finally understood Thanos.",
            "Don't get me wrong, you should try as hard as possible to get an internship - but you can still get a job without an internship. Don't feel hopeless and don't kill yourself by making applying to jobs a full-time job. Take it slow and you'll get there eventually. The trick is not to burn out",
            "you have to realize 4900 of those guys don’t even have quality resumes. Another 50 don’t have compelling projects or experience, another 25 aren’t junior+. When you separate yourself, you’ll get results.",
            "2900 applicants is still too much. Gonna need him to snap them fingers a lot more.",
            "7 different recruiters from 7 different companies contacted about the exact same job before it finally closed without me even getting an interview.\n\nI'm now up to 2 on a new one.",
            "If it’s even actually real applications, 98 percent of them is going to be people who do not qualify. Going to be a lot of nonsense apps.",
            "SHEEEEEEEEEEESH",
            "I am inevitable..",
            "Y’all trying to get internships online, I just like knew a guy.",
            "It's like the lottery.... you have to be really lucky to get this job. If they're only taking 1, be hopeful you're the one of 5800 applicants to get the job.",
            "bros what the fuck",
            "Most of those applicants aren’t serious contenders, dome are just bots. don’t even look at those numbers",
            "It's a remote internship... yeah you're gonna have a lot of competition. Find something local.",
            "Haha, I applied to this one when it was first posted. Hadn’t checked back at the numbers. Kind of apply and leave it kind of world for me.",
            "You have a good shot though",
            "Hey I was going to apply to that at some point too.",
            "Indians. I am willing to bet lol. Gunning hard for that visa sponsorship",
            "😂😂"
        ]
    }
]