[
    {
        "post_id": "18o1u1r",
        "author": "Fabulous_Year_2787",
        "title": "Has anyone been feeling like this lately?",
        "url": "https://i.redd.it/p900vvclqq7c1.jpeg",
        "score": 1225,
        "num_comments": 119,
        "created_utc": 1703204889.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18o1u1r/has_anyone_been_feeling_like_this_lately/",
        "comments": [
            "Bro why is there a picture of me up there?",
            "Failed my 2 prequesties this semester so yeah been feelin like this for a while.",
            "In what way? Feeling lonely or bad at coding?\n\nI feel both",
            "Just reported this post for using my picture without my permission.",
            "yea",
            "Ever since i started university. I like the course, but everything else in my life has sucked.",
            "college is fucking tuff\n\nhttps://preview.redd.it/rcrleatwcr7c1.jpeg?width=1179&format=pjpg&auto=webp&s=6d3b997463d38846c049fb8d0189dcdf5d781040",
            "Minus the cigar",
            "Its been like this for an year now, my whole masters has been thinking daily whether i will get a job",
            "what did you expect taking the major known for no girls? Seriously tho, hmu if you ever need someone to talk to",
            "seasonal depression hitting rn",
            "I took discrete math this quarter so yea",
            "This was me a few days ago before I received my grades. I just narrowly passed my discrete mathematics class. Now I feel at peace. Knowing the feeling of fear from missing a prerequisite, I'm really on edge here.\n\nI want to spread hope tho, it's possible to go from completely clueless to somewhat competent at a subject in a span of three days.",
            "I'll have a beer to make things better",
            "Lately? Boy, I have some bad news for you…",
            "Yeah but not a cs major. Or a major at all. Shit I dont even know cs or this subreddit",
            "my brother in christ you have seasonal affective disorder",
            "Yeah I never really had to study before in school and it's backfiring hard.",
            "Yes until the last 2 weeks",
            "I just ended a semester after having a job, 2-hour commute, and 18 credits. I feel destroyed. I prepared for all my classes during the summer and booked tutoring for the entire semester and still got straight C's because I overbooked myself. I'm finally free to end my last final, but I am disappointed with my performance. I attached a lot of my esteem to my grades and STEM, and to do badly in it with the effort I've put in has me feeling empty. Although I'm exhausted, without the stress of school keeping me focused I don't know what to really do with myself for this time except keeping working as if it's still going.",
            "Guys go climb an abandoned building, or a construction site, or take lsd or go socialize. Just anything to get you out of your room and head.",
            "Woke up this morning to 658 karma, and I went to bed with 58 so thanks guys!",
            "Cope",
            "Yes because I procrastinate for far too long but now I study what I like and take notes.",
            "Yes but fat eating hamburgers 😭",
            "I can relate, so it get worse after college?",
            "Yes, I have been in IT for 10 years now and this is exactly what I look and feel like. I really need to find something else. It is so depressing.",
            "That's exactly how I look rn fr",
            "I relate to the headphones. But I’m pretty happy with my life",
            "How tf did you get my picture......... Ohhh I see. Me too, bro, me too.",
            "My god yeah. Way too many mf cigs",
            "![gif](giphy|LHPRtWU6eIFDG)",
            "not just lately",
            "I kinda wanna kms half the time, so yea.",
            "Tomorrow's Friday, go out and have some fun even if you have no plans:)",
            "Just lately?",
            "I am not feeling very cash money at the moment",
            "Yeah",
            "Literally",
            "Dont worry. It will pass.. just grind another 20 to 50 years.",
            "Yes",
            "Hey look, that’s me learning for my Java 17 certified professional exam",
            "Yeah I’ve been feeling like an older man with headphones who smokes lately…",
            "Yup. CS as a major did nothing for me. No work experience or projects, no jobs. Not even IT Helpdesk jobs for low pay will hire me.\n\nI basically wasted 5 years of my life. Now, I am working at a warehouse, concerned if the matter is even sustinable. I work 9 hours each day then sleep 10-14 hours each day.",
            "In don’t smoke but yeah.",
            "Lately yes...",
            "Have I ever not felt like this before?",
            "Same man",
            "Russian doomer moment",
            "Yeah… I’m have a girlfriend but I’ve been thinking of breaking up with her, idk if I’ll be able to finish my career, idk how long it’ll take, I made a mistake and I’ve been missing a friendship of mine for alrd 2 years, although I’m young I feel the time passing too fast I wished it slowed down a bit",
            "Yeah. Wish I had enough money to finish my major before the pandemic. Then again I probably wouldn't land a job locally.",
            "Longer than lately that is for sure",
            "Me",
            "Got college placement but none of them giving me joining date keeps delaying \n\nApplying offcampus not getting response whole 1 year fucked up and still 0 experience level and other my colleagues and friends will gain experience.......\n\nNow I am not able to think what to do",
            "me. i really like my courses but i feel like i havent changed since i started. im starting internship next year, too",
            "Screw it, we ball",
            "Barely passed 2 of my CS classes and got a D- in my class this semester… on my last try before they kick me out of the major😔",
            "the things i see in this sub is trying to make me avoid going cs, but i guess this just applies for every major....or not",
            "No, because whilst everything is difficult at the moment. Failure and difficulties are expected hurdles in life and only get worse as the years go on. So, I make the most of the positives now, and enjoy life.",
            "Moye moye",
            "Been me all year and the year before that.",
            "Yea",
            "yes bro after the past couple years of tech bros brain rot ive finally found my love for programming.\n\nI ESCAPED TUTORIAL HELL, what is the best language and programming bootcamp ads\n\nThe future is looking bright tech bros itll be okay maybe when we build up again after svb but itll be okay",
            "It's how I feel rn after graduating and before starting a job. Mostly because I've treated my body kinda badly in the rat race to get here, including being hit by a car",
            "I’ve been feeling like this since I started studying cs",
            "Since about 2007"
        ]
    },
    {
        "post_id": "10fhkw4",
        "author": "its_kiddos",
        "title": "Sup fellas. The post grad life is amazing and I cant wait til yall get here.",
        "url": "https://www.reddit.com/r/csMajors/comments/10fhkw4/sup_fellas_the_post_grad_life_is_amazing_and_i/",
        "score": 1221,
        "num_comments": 131,
        "created_utc": 1674073245.0,
        "selftext": "After landing a role post grad, life just gets much better. \n\nHere are some quick pros that I came up with:\n\n* No more tight deadlines unlike assignments from school\n* No more pressure and stress of failing your assignments (your team will teach and guide you to success unless your company sucks)\n* You can finally afford to eat the food and buy things you like\n* No more commuting and staying on campus for hours\n* No more pulling all-nighters or staying up late just to study or catch up on assignments\n* Actual teamwork and teambuilding activities with team\n* Get paid while learning\n* Get paid while on vacation\n* Can use PTO/Vacation days for a mental break. You couldn't really do this in school!",
        "permalink": "/r/csMajors/comments/10fhkw4/sup_fellas_the_post_grad_life_is_amazing_and_i/",
        "comments": [
            "I cannot wait to buy some new clothes, I’m still walking around in the same dusty sandals and underwear I’ve had since 2016",
            "Congrats bro! Do you mind sharing what company or TC?",
            "Finally something more optimistic that isn’t a subtle flex lol. \n\nBut as a post grad myself, you’re on point with everything. This life is great, and can’t wait for my master’s student roommates to get through with their degree",
            "Thanks op! Breath of fresh air in this sub lol",
            "Can’t wait. \n\nEveryone not a CS major: I don’t wanna graduate and get a job it’ll be so much harder \n\nMost CS majors: I can’t wait to graduate and live the easy life",
            "> No more tight deadlines unlike assignments from school\n\nI agree with everything else, but this isn’t always the case. I’ve been an engineer for a few years and I’ve encountered a lot of deadlines. They’re kind of made-up sometimes, but there can be pressure to meet a date for legit reasons like legal/regulatory compliance and breaking changes in external systems.",
            "I’m actually looking forward to it. My one question, how’s making new friends and meeting new people?",
            "Hybrid, no stressful exams, no homework, oh and more $$$$",
            "I’m most excited about the promise to use a smaller set of messaging apps and tools. I am sick of having to monitor slack, discord, teams, Facebook messenger, and 3 different emails. Also the potential to actually learn a framework and language more in depth then 4 month projects allow.",
            "There are definitely assignments and deadlines. They just don’t feel like the assignments and deadlines from school. If you work for a company that is allowing you to work on whatever you want whenever you want with no timeline then that’s awesome for you, but that’s not the reality.",
            "* No more getting molested by the janitor Ernesto at 3pm every wednesday behind the snack machine",
            "Honestly, the biggest thing that I look forward to is food. Being able to order something I really want to eat and actually having the right amount of calories and nutrition that a human should consume to be healthy. Everything else I could really care less for. I love food and if I can afford all the things I want to eat I’ll be the happiest man alive.",
            "School stress is the worst type of stress I ever had in my life. It's actually put me in the hospital before. I can't wait till it's over",
            "Not to rain on your parade but an actual job can be so much more stressful\n\n\n\n >No more tight deadlines unlike assignments from school\n\n\n\nInstead you can have tight deadlines with a manager and a bunch of PMs constantly yelling at you to get it done faster\n\n\n\n > No more pressure and stress of failing your assignments (your team will teach and guide you to success unless your company sucks)\n\n\n\nIf you fail to deliver you'll be managed out. Nothing more stressful than having bills to pay or a family to feed then losing your job. \n\n\n\n > No more pulling all-nighters or staying up late just to study or catch up on assignments\n\n\n\nYou will stay up late for crunch sprints and also will work at night or on the weekends from being paged for oncall",
            "Thank you man. There's life outside of school afterall 😭",
            "Less than 4 months and I'm done. Just gotta find that job and I'm on easy street 😭😭😭",
            "My favorite thing when I first graduated was getting to enjoy weekends again. During school weekends were basically homework and study time. Especially for bigger projects that had a longer deadline.",
            "I think post grad life is a lot worse in some ways tho.",
            "Lol..",
            "Mind sharing how many PTO days you got.",
            "bros living my dream",
            "Congratulations sweetie. I'm glad you made it. And thank you for the encouragement.",
            "Thanks for sharing, I was so happy during my internship now I'm back in school and full of pain... hoping to get another internship this summer praying for all of us in this tough economy. Glad you're doing well OP.",
            "My university has a co-op, so I did co-op for like 12 months straight. What a good life it was, getting paid, no assignment, no failing stress. Even no higher expectations from managers, lol. Now I am back to university to complete my courses, I feel like I forgot to study, lol. Doing assignment, staying up late is stressing me out.\n\nCan't wait to survive and graduate.",
            "Wow thank you for the encouragement!! I graduate December 2023 and I’m working full time! I dream about post grad life",
            "All of that is true, and the only thing I want to add is that I miss the simplicity of coursework sometimes. In my professional career the average project is like 100x harder than the average project I had in school, and the absolute most difficult semester-long project or assignment I ever worked on in school would be like a run-of-the-mill 4-day task in the real world.\n\nI'm talking about how fast things move, not deadlines. In general project deadlines are negotiable and determined by the requirements of the task, which change *all the time*. It wouldn't be unusual to be assigned something on Monday and be told they need it by Friday, but then it gets backlogged and isn't finished until 2 years later.",
            "My favorite thing about post grad life was my workday ending at 5PM no homework no studying - and I got paid! I got paid to just do my job everyday. It was so insane - living expenses are a bitch if you’re not living at home; but honestly otherwise. You couldn’t convince me to ever go back to school.\n\nAnd if I could tell my college self what I was doing now, where I was working, how much I was making - I honestly don’t think I would’ve believed it.",
            "I think it depends on where you work and how fast you work. There definitely are deadlines in the corporate world. They’re not super firm like in school, but if you constantly need help and your projects are constantly running late it’s not a good look. \n\nI don’t really find my job stressful on a day-to-day, but I didn’t think school was super stressful either.",
            "But no more winter/spring/summer break :(",
            "Is this a shitpost or serious?",
            "Good for u",
            "[deleted]",
            "That’s awesome, but chances are you could have done it and been making twice as much by now if you skipped school entirely.\n\nTech is all in experience and certifications these days",
            "1. There are tight deadlines more so than school and its called meeting.\n2. There are every pressure and stress for failing, your product is literally you company revenue, YOUR SALARY MAN.\n3. If you don't need to pay rent and tax, lets not talk about girld friend present, dinner.\n4. Instead you stay in office for more hours.\n5. Hi Joe would you like to talk about this pull request you just did?\n6. MERGE HELL\n7. More like paid for what you can do, will not get paid if you learn.\n8. Summer holiday, new years, any holiday is shorter than school. Sick leave is more strict than school because you get paid.\n\nAll and all this must be satire or sarcasm.",
            "congrats op! hoping to get here someday :,)",
            "I need a new car",
            "Depends on company but generally true",
            "Thanks",
            "[The user has removed all potential PII from submissions.]",
            "I completely agree. I’m not a CS major either. Honestly my mental health became the best it ever was after college and it’s only gotten better since",
            "Amazing. Can't wait to feel this heavy stone drop.",
            "Finally I can’t wait. One of the big things I’m tired of is the lack of teamwork skills a lot of my asshole classmates have.",
            "\"no more commute\"\n\nAbout that...",
            "Yes I'm starting my job next week from a returned summer internship.\n\nInternship was really nice. It was nice to be on a consistent schedule and be brining in money lol.",
            "Well I graduated, two weeks went by, had a mental break down, broke my brain, fell into an uncontrollable state, went to the hospital, got meds to reinstate control, now I think differently, I want to study other stuff and then change the world! If I can break my brain, I can rebuild it better. Let's gooooo",
            "this is a much needed reality check",
            "Looking forward",
            "It’s the dream fr fr juss programming and peace 😔",
            "this kinda stuff makes me so happy. such a good feeling to work at something and then have it pay off. i’m in school still and honestly just starting but i know i’ll stick with cs until im done",
            "Love it, good reminder on how we really took it for granted sometimes.",
            "Every time I stress out about my CS classes I have to remind myself it’ll all be worth it soon-it’s all for this.",
            "I think about dropping out from time to time-not like I’d ever do it but the thought of not worrying about school again is amazing. I think I’ll print this post and put it on my wall for motivation.",
            "Thanks for the motivation friend."
        ]
    },
    {
        "post_id": "1azq1uw",
        "author": "Menmyhair",
        "title": "Most People do Zero Projects Outside of Class",
        "url": "https://www.reddit.com/r/csMajors/comments/1azq1uw/most_people_do_zero_projects_outside_of_class/",
        "score": 1215,
        "num_comments": 119,
        "created_utc": 1708873661.0,
        "selftext": "This sub is largely populated by overachievers who I think don’t realize this. The average CS student (at least at my top 50 school) is barely getting their class assignments in on time, not doing meaningful personal projects, and has  a close to empty GitHub commit history. Even people with internships often don’t really do projects. I see a huge number of resumes with classwork or maybe shady hackathon projects filling out the projects section.\n\nIdk, just a pet peeve of mine. I often see comments that act like it’s standard to have a strong portfolio of full stack web apps by junior year, but it is *not*. And it is very possible - though perhaps not optimal - to get internships and jobs without putting hours every week into personal projects.",
        "permalink": "/r/csMajors/comments/1azq1uw/most_people_do_zero_projects_outside_of_class/",
        "comments": [
            "I feel that after having one or more internships under your belt, the value of having personal projects on your resume drops off significantly. Unless your projects turned into published apps with actual users, they would otherwise be overshadowed by work experience.",
            "+1 to this. Despite the impression from this sub, most average developers and cs students will do the bare minimum involved to get the degree with a decent enough GPA, then go on to lead a fulfilling career earning an above average salary in their local market. This isn’t inherently bad and should give many people in this sub some confidence in their ability to land a job and be a top performer.",
            "Also a lot of \"I can't get a job\" posts come from international students trying to get their first job in the US market, which is 10x harder than getting a job in your town/city.",
            "Going into my second internship without a portfolio",
            "This is true, from all my past interviews for internships i have never been asked about my projects. Even interviewed for a FAANG company and got the offer and wasn’t asked. You’re better off focusing on work experience and including projects if they actually have users. If your projects are just purely personal I say you can include it but keep the section concise and focus on work experience",
            "I've found from interviewing 100ish software engineers for my previous company, that the strongest candidates weren't necessarily the ones with side projects or that were coding 24/7 (especially on more senior levels).\nIt also wasn't something we'd consider too much (open source contributions being an exception because imo they showed more relevant skills).\n\nActually usually what made candidates stand out given they had performed equally on technical rounds were other things not always tech related that just showed some general curiosity or intellectual ability, or even just general soundness.\n\nTech is quite dominated by fairly introverted and sometimes slightly awkward people, so social skills will often get you further in interviews than portfolios. I realise that now even though I had made a portfolio and some projects when I was applying for my first role 😂",
            "I think most people know. But you’ve said it yourself, the sub is mostly populated by overachievers. They aim for highly competitive positions where personal projects can make a difference.",
            "I have a year around internship and I'm taking 2 math upper div's and 2 CS upper div's every semester until I graduate from here on out. I don't have the energy to do personal projects, especially considering how much more beneficial Leetcode is at this point. That being said, because of this I don't have even a projects section on my resume. Just experience and education with a \"skills\" section sometimes if a recruiter says I need to put stuff on there to get pass the resume filter.",
            "swe internships at a reputable tech firm are way way more important than projects. unless the project is making money/has active users.",
            "At undergrad I'd actually suggest not focusing on building web apps, but instead understand the curriculum material well and build more technical projects",
            "Unpopular opinion. People focus too much on github portfolio when most recruiters don't have the technical know how to understand it  or time to read it.",
            "Anyone can recommend some side projects we could do ? Thank you in advance",
            "For people who say instead of focusing on projects, focus on work experience, how can you get the work experience without doing the projects?",
            "If that’s the case, then why is it so hard for people that go above and beyond in everything CS job related + DSA to get one?",
            "Word class projects into sounding like your own, sell them in an interview, get your first internship and you’re golden",
            "Most people also are poor. Most people don't make a lot of money. Most people aren't successful. It's entirely useless to compare yourself to \"most people\". you can if you want to be \"most people\"",
            "This is true, I get drunk almost every day with my CS friends, they have 0 personal projects and only lists the ones from school and they all have big tech internships",
            "I think that's true, most people aren't doing tons of practice and things of that nature. But at the end of the day this is the reality of the industry right now. I'm not saying it's okay, but if we can't get jobs without an internship or projects and it's hard to get an internship, the only thing we can do is work on projects. It's pretty much our only way into getting a job.",
            ">  I often see comments that act like it’s standard to have a strong portfolio of full stack web apps by junior year, but it is *not*.  \n\nThanks for saying this. Not only by junior years, many developers with years of industry experience don't have this.",
            "Personal projects are good for learning but very rarely move the needle for you in an interview. I have a github with a triple digit number of repositories going back over ten years and I keep nearly all of them private. Almost everyone I've worked with in my career so far had zero substantial projects on their GitHub. \n\n\nI occasionally give out code samples if a company asks; the vast majority don't.",
            "It's not required, but some people just have a passion for this. They don't do it because they feel like they have to do it. They legitimately want to make this thing and have enough confidence or curiosity to try.\n\nSomeone looking to hire people are going to hire up all these guys first. If you fake it and do hobby projects because you think it will look good, you might get accidentally hired up first too. But none of this is required.",
            "I got my first C job because I did a project developing a toy relational database from scratch. Essentially inserts, deletes, updates and two pass join etc . \nIt was a 200K job and mind you I am pretty sure that was the highest anyone in my uni must have got. Heck it's big even now ??",
            "For every 10 people who don’t do projects they’ll definitely be someone who did do a project. With how many CS graduates there are that’s still thousands every year who make pretty similar projects all applying to the same jobs.",
            "most people wont get jobs as SWES in this market.",
            "Yeah, I’m unfortunately one of those people. I’ve been trying to ask around for what kind of projects a cybersecurity major could add to their resume, but the only real suggestion I’ve gotten is to make a ducky script.",
            "Tough to have a portfolio if you work full-time outside of class as well. For those that don't work while in school, I don't know what they do all day.",
            "This, I stopped doing personal projects after I got my first internship.",
            "i kinda refuse to do any projects outside of school & internships whilst in college bc why?",
            "I’m gonna have to disagree with the part about this sub being filled with overachievers chief. Some quote about the vocal few and silent many seems like it’d fit. \n\nThis sub is much like the real world. Very few people have the combination of passion, time and funds to take part in open source projects. Same thing applies while in school with personal projects. You just think it’s a lot people over achieving. But it’s not. Some psychological bs with perception based on what your biases are when looking at stuff. \n\nIt’s all about as unrealistic as everyone in this sub thinking they are going to be employed by some major tech firm. \n\nThat being said, the way hiring is now, you almost have to be in that group of over achievers to get a job. Gotta do something to stand out. Standard works for standard economies. Unfortunately, this economy is anything but standard.",
            "I don't understand the point out grinding personal projects just for putting them on your resume. I am very busy with school and work, and I don't have time to do random crap that I'm not getting paid for or graded. Everything impressive or long-term that I've worked on has been during school or an internship.",
            "If you don’t have personal projects, you can instead list some of the more unique school projects in their place.\n\nSometimes they look better as they incorporate more class concepts than lots of personal projects.",
            "It genuinely baffles me how the supposed \"overachievers\" that populate this sub are incapable of understanding a concept as basic as bias. \n\nAccording to them, this sub is an accurate representation of all CS majors. It's sad to see people who look at the people here getting jobs at big tech companies and feel worthless in comparison, to the point of wanting to give up and quit.",
            "working 40 hours+ school+ doing projects is really pushing it, like i’m not sure I physically could",
            "That’s cause personal projects are generally pretty worthless for getting a job",
            "I graduated from a top school in Canada (UWaterloo) last year with 4 SWE internships and still don’t have a FT job. Is it even worth doing additional side projects in my case?",
            "The market is over saturated with job seekers. Not talent. \n\nAlthough in Canada it’s over saturated with people who have low self worth but even then it shouldn’t be too hard for actual talent to stand out",
            "Because the stupid companies who employ the most moron interviewers encourage people to spend their time on solving nonsense leetcode problems instead of building something meaningful.\n\nI have personal projects in my github account and a couple of years of working experience as a Data Scientist.\n\nBut nobody asked me about those personal projects. And all of them preferred to spend half of the interview for the leetcode questions. 3 weeks ago, I made an interview for a Deep Learning Internship position and they only asked 2 questions about the Deep Learning. And it was not FAANG but quite large and well known company.\n\nAnd I was rejected because I couldn't write a code that counts the number of horses in a farm using the weird sounds they created.",
            "TLDR:I think internships are a way to work smarter not harder. Never had side projects and still got into FAANG multiple times\n\nTbh I hate doing side projects. So I don’t. Instead I did internships, ended up doing 4+, and was still able to get FAANG level opportunities( both internships and now new grad). My GitHub is empty. I have no side projects on my resume-other than a certification if that counts- and have never gotten complaints. \n\nA lot of people say that you should only go into CS if you truly enjoy it and love spending your own time on it. But at the end of the day, it’s just another job. You don’t have to be in love with your job to do it well. Most people who love their jobs, still wouldn’t do it in their free time. \n\nI like CS enough for it to be a job but not a hobby. So why would I be spending my free time building projects that might not even have relevant skills to the job? I cut the time needed by getting internships and get paid to learn.",
            "I've hired lots of people of all experience levels, and their personal side projects **very** rarely come up in interviews. And most of the time when they do, they just move past it and don't talk about it.\n\nYou're right. The % of students and graduates with side projects is very low, and the % that is willing to put them on their resume or discuss them is even lower.\n\nThe mantra here about working on projects to help start or boost your career is very rare. It's not the norm. It's one of the reasons you shouldn't believe most of what is posted here.",
            "What’s also funny about this is that every C student with no internship or personal project I’ve EVER met in the major got a job easily after graduation, but this sub would have you believe this is impossible.",
            "Yeah:  me and my friends talk about this all the time.  I’m in computer engineering, doing 21 hours, and I still a lot at least 1 hour a night to programming something or working on a project.\n\nHowever, I seriously cant name anyone else in my cs class that does anything outside of class, much less even does their homework, and some of these people are taking only 12 hours of class.  It’s actually fucking r ridiculous",
            "I have a published app on the App Store (7000+ downloads). Speak for yourselves ✋🏻",
            "This isn’t true in my experience. Nearly everyone in my school had portfolio project. It’s just not that hard to make a website when you have the skill set, so why wouldn’t you?",
            "I have done quite a few of decent full stack projects outside and from classwork both, but still failing to even get an internship. Imagining if it was only classwork and nothing else, I’m not sure I would have gotten atleast somewhat confident even in applying. \n\nJust my thoughts tho, surely there are a lot of factors that contribute to that. I have seen many of my friends on both the extremes and still the result is always unpredictable",
            "That’s me 🙋‍♂️. I got in.",
            "You have X amount of time. Do you choose to invest that towards moving your assignments from a B to an A\\* or do you choose to put the time towards practicing and going for interviews?",
            "And you know what, I don't feel like CS students should have to burn the candle on both ends throughout their whole college tenure just to get a job that pays enough to live comfortably and start saving up for moving into their own place. Obviosly if you want those super sexy FAANG positons paying buku bucks, then obviously you'll need to grind and hustle to have a chance, but loks folks just seek to work to live, rather than vice versa.",
            "i have been using this conjecture to cope with",
            "I’ve gotten into programs that were mostly interested in the projects I had on my resume (with a certain company name) and had an internship interview I got reached out for by a well known company that was mostly talking about that project so I guess YMMV. \n\nOfc the hiring managers/senior devs here know more than me as a student so I’d listen more to what they say but that’s just my experience.",
            "Thx for the input. I did about five side projects and grinded 500 leetcodes and not landing anything not even a internship. 500+ applications in...\n\nSo yeah, idk how peep in the comment section has this rizz for big techs. Im getting ghosted by everyone. Had only one interview this pretty good company made it to final round but got rejected...",
            "Projects are helpful to get the first job, but doing projects just for doing something is pretty sad, we should do projects because we have fun doing them!",
            "I can see this, but I still see so many people with projects outside of their class. Like no one wants me 😭",
            "It’s like dating. The first gf is the hardest to get. You don’t really need side projects after you have internship experience. It can help if you want to switch domains. For example you want to do IOS dev but don’t have relevant IOS experience."
        ]
    },
    {
        "post_id": "y7fzgv",
        "author": "domcantreed",
        "title": "No one actually talks about Computer Science in this subreddit.",
        "url": "https://www.reddit.com/r/csMajors/comments/y7fzgv/no_one_actually_talks_about_computer_science_in/",
        "score": 1210,
        "num_comments": 157,
        "created_utc": 1666120445.0,
        "selftext": "I can barely find a single post that is actually about computer science. It is only jobs.  \n\n\nIf you look at highest in the top post in the last month, all you see is Rejection Emails, Leetcode, Jobs, Internships, and how this sub sucks basically.  \n\n\nI just wish people would actually talk about Computer Science within my major. I genuinely love computer science but its actually impossible to talk to people in this reddit about computer science. It would be cool if people kept the computer science career stuff in the cs career subreddit.   \n\n\nIt would be interesting to see more topics about things like good resources people use to learn Operating Systems. Or good resources to become a better programmer for college students. But these things are rare in this subreddit.",
        "permalink": "/r/csMajors/comments/y7fzgv/no_one_actually_talks_about_computer_science_in/",
        "comments": [
            "I'm a sociology major and I approve this message",
            "go on the r/csmajors discord and its even worse lmao",
            "/r/compsci/  \n/r/computerscience/  \n\n\nhere",
            "I don't think that a many CS majors (myself) have a passion for everything CS related, from compilers to automata to operating systems and much more. Don't get me wrong, I like the material, but I worry more about securing a job and putting food on the table at the end of the day, and that's primarily through software engineering. CS is an *incredibly* wide field with many niches. And honestly, I don't think many folks going into this major actually plan on going into academia, which is where more of this domain knowledge would be useful (perhaps there's a subreddit for that? Not sure.).\n\nIf you're looking for resources on improving your programming, I think that /r/cscareerquestions is a great resource with more seasoned industry veterans.",
            "You can make a post related to those topics. I am sure you will get a decent amount of responses. It’s just that most people use this sub for job information but if you ask, people would be more than happy to help you",
            "The point of CS is TC, to reach TC you must LC, to LC you must understand CS. It is a beautiful circle.",
            "Yeah bc people only do this to get a nice paying job. No one gives a shit. Would be cool to see more post about CS but they’ll probably never be seen.",
            "[deleted]",
            "I've noticed the same exact thing at my (fairly serious) school. I've met maybe 5 people in my major who actually wanted to be in class. It's a bummer because one of the reasons I came to this school was because I was hoping to find people who loved the field.\n\nBeen kicking it with the aerospace bros instead, they're so much more fun than leetcode. And we get to blow stuff up.",
            "This is basically cscareerquestions2",
            "Yeah this is just cscareerquestions jr. It’s kind of a shame cause it’d be nice to have a corner for college students and recent grads to talk about CS. Tbh half the people here would be applying to McKinsey if they were doing this 10 years ago. Just read any thread asking why people are doing CS as a career. It’s all people who don’t actually like programming. Which, in fairness, it’s not their fault CS is such a lucrative career. Just disappointing if you actually want to talk about programming.",
            "Yep. I joined thinking there are people sharing homeworks here…",
            "Let me throw out some resources to become a better C++ programmer then:\n\n\\- Cline's C++ FAQ (ancient book, somewhat theoretical)\n\n\\- Josutis' The C++ Standard Library (Part reference book, part introduction)\n\n\\- Meyer's Effective Modern C++ (all the gotchas you learn over the years distilled in a small book)",
            "I see you saw the post on data science blow up.\n\nThis is a community of people searching for jobs in/from college. I think it's actually very helpful when we ignore the blatant lying and score inflating.\n\nI honestly don't know what you were expecting from a college level subreddit about a highly popular career area. You should go to an actual school club for what you're looking for.",
            "Why don't you post about computer science in computer science related subs. This is a job shitposting forum.",
            "umm make posts about it and ask if you need them? If no one talks about it, they probably don't need it. Also, for learning programming, there are specific subreddits :)",
            "You should start by making a post yourself.",
            "what is computer science if not dickriding",
            "What did you expect? We’re all college students who need jobs why tf would be be discussing operating systems or compilers lmfao most people do not give a shit and only want a job. Go to r/computerscience or your university’s cs club if you care this much.",
            "That's true but it's also because right now is like the internship application season",
            "You need to go on r/computerscience or subreddits in specific programming languages/fields in order to see more computer science posts.\n\nr/python r/coding r/compsci r/webdev r/reactjs r/netsecstudents r/cybersecurity r/cpp etc.",
            "Go to hackernews",
            "Go to r/compsci much more true to the name",
            "Tbf csmajors is a subset of people who study computer science. It makes sense that this would be job focused since getting your first job is the biggest source of anxiety for any college student imo. There are plenty of self taught programmers out there that love computer science subjects but you won't find them here very often (shout out to the math majors that learn a bit of programming and swoop up jobs like it's nothing). Also talking about computer science topics other that what you see here shouldn't be limited to just this group, you'll find better quality convos on those subreddits anyways. \n\nAlso cs theory isn't prestigious enough for this sub.",
            "this sub is r/cscareerquestions but focused on internships/new grad. if we all just posted in the regular cs career subreddit then im sure the vast majority of redditors in that sub (people who are actually already in the field) would tell us to kick rocks",
            "bc we dont like computer science we like money",
            "/r/programming and /r/learnprogramming are great places to talk. Alternatively, you can go to the website that starts with \"hacker\" if you want more tech-related news.",
            "When I was in college this sub was actually a valuable source of information that helped me get an internship. It’s definitely changed a lot. You guys are screwed, at least I don’t have to compete with you for jobs now. Keep making memes lol",
            "I’m a freshman and rarely post here because it seems everyone is past the parts I’m struggling on lol. \n\nIntro to python if anybody has any study/ test taking tips.",
            "Instead of whining make a post asking your question or discussion or whatever",
            "Its not meant for that.",
            "Because no one on this sub knows anything about computer science. They just know how to leetcode, and obsess about getting into a few small subset of companies. It’s just like all the fuckers from here who went to r/quant. No one actually talks about quant topics, because everyone whose over there is just a person whose quant quant quant I wanna be a quant how do I become a quant but doesn’t actually know fuck all about what quants to or the topics involved with being a quant",
            "You are in the right field. As someone in a working computer science field I completely agree with what you are saying. I think a lot of people come on here to brag about positions and offers, but for the most part if you stick the subreddit out you will learn a great amount.",
            "r/computerscience",
            "Start a conversation then?",
            "grind leetcode",
            "Be the change you want to see in this world. \n\n\nIf you want comp sci posts here, post about comp sci, not meta posts about the sub.",
            "this subreddit has been one of the most helpful and funny subreddits for cs majors",
            "The funny thing is as a CS major I did not learn to code at all. I think I took a total of 2 or 3 classes where I had to code. The only languages I learned was python and java. I'm glad though because learning how to code is something you can do on the job, no need to waste time in school doing it.",
            "Because the majority of people in computer science couldn't care less about it.\n\nThey want money.  To get money they need a job.  To get a job, they only need to appear like they care (to employers and recruiters).\n\nThankfully this is a great thing for those of us who do care.  Less competition :)",
            "I guess it is the same with almost all the developer groups as well. The only thing that comes up is jobs and related nonsense",
            "we need more memes!",
            "The sub is for csMajors, what do we care about? Jobs",
            "I love computer science too my dude but I’d be lying if I said that I wasn’t also in it for the money.",
            "I’m not a CS Major and I approve this message too.",
            "I would probably attribute this to the fact that cs is a super broad field. Not everyone is interested in the same things in cs so it’s hard to post about a niche topic when you could just post about something career-related that will be probably understood more.",
            "Unfortunately it's very expensive as a hobby.",
            "Why is OP getting downvoted lol they are right",
            "This is just a subreddit for people to lie about their “grind”.",
            "show me the MONEY!!! SHOOOW ME the MONEY!!!!",
            "There are very few ner ds and geeks in computer science, more like finance bros who in CS so they want the bag. In my university, the CS classes doesn’t smell bad and most of them are pretty muscular. I don’t know if it’s a good thing or bad",
            "Most of people chose CS for money",
            "I understand where you’re coming from but I think when subs become posts about CS in general it kind of disengages those who have no input, interest, or opinion on the matter. I would suggest looking for local events you can participate in with others that would have shared interests, try YouTube too. The comments aren’t always as bad as you’d think.",
            "people active in this sub are unemployed and hungry for the title of a big name tech company. Once you actually start working all that hype and toxicity goes away.",
            "Only /r/programming and technology specific subs talk about it. Rest all of cs subs are about politicking your way to a  job.",
            "Saar, what computer should I buy? I'm studying CS.",
            "Did y’all have to take a course on functional programming too?",
            "Turns out landlords don't accept proofs of time complexity as payment",
            "I agree with you and i was thinking about leaving this sub as well. I also have the feeling that this sub is too US centered. Is there a sub for CS students from europe?",
            "perfect. who can explain to me how to traverse a tree and also why loops of logn inside of n loops somehow turn both loops into 2n instead of nlogn? \n\nthanks really appreciate it :)",
            "Sounds perfectly logical that people talk about jobs, interview, and pay on this subreddit.\n\nFor many people college is just a milestone before getting a job, why wouldn’t you be concerned about details regarding a job?\n\nMany people simply can’t afford to work on passion projects if it doesn’t help make money. Going to college is a net negative for most until landing a job, even years after.",
            "If you have a question about computer science, why don't you ask it? No one is stopping you.",
            "Beleave it or not I own the MB computer science and memory and I don't know what to do with it the MB is even copy written to my initials MB I did that .",
            "Waite you left out the direction left or right",
            "Is there or a tutor or pencil and ink",
            "The main reason we study computer science or study in general is to get a job so isn’t obvious that we only talk about jobs?",
            "Why don't you browse stack overflow or Quora?",
            "."
        ]
    },
    {
        "post_id": "181jpqm",
        "author": "Severe-Particular166",
        "title": "My Summer Internship Journey",
        "url": "https://i.redd.it/dsxpoau3sy1c1.jpg",
        "score": 1202,
        "num_comments": 39,
        "created_utc": 1700687166.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/181jpqm/my_summer_internship_journey/",
        "comments": [
            "My summer internship journey  \n\n\nhttps://preview.redd.it/e3atzcsi0z1c1.png?width=768&format=png&auto=webp&s=fd10b6d68e08975c65556268db84927e899a826e",
            "The grind never starts 🗣🗣‼️‼️🔥",
            "fuck you\n\n/sarcastic",
            "how is it a journey? it's a short story.",
            "One shot, one kill",
            "that's my new grad offer chart",
            "Loool this is a huge flex ngl, congrats!! It took me over 75 (probably more) applications to get an offer",
            "At some point, finding a cs related the job was really like this.",
            "2 yoe in Canada, 11 months laid off, still looking 😢",
            "Foaming at the mouth rn",
            "thought i’d leave some extra info for anyone who else as struggling to find an internship!\n\n- the company is no where near a FAANG one or anything but it comprises of around 400 employees and is decently known in my area! (and is a government company)\n\n- my grades average around 65-70 and i didn’t have any personal projects \n\n- I have no connections to the company and applied by directly emailing them\n\n- I only emailed them because they were close to where i live but I didn’t bother to apply for any big city internships after seeing some of the posts on this sub 😂\n\n- it’s paid and is going to some uni credits too! \n\nhopefully this information is useful to you guys, not sure if anyone is still applying to summer internships but good luck ❤️\n\nedit: feel free to dm me if you have questions that won’t dox me xx",
            "Damn, I should just stop applying",
            "360 no scope",
            "POV your dad is a VP",
            "[deleted]",
            "Must be nice",
            "These flowcharts are made on what application?",
            "Haiku version of applying for jobs",
            "How’s your father?",
            "Y’all doing it wrong.  \nYou guys chose tech because it interests you.  \nI chose tech bc I have family/friend connections in the industry.  \n\nWe are not the same.",
            "Aight imma go kms then :)",
            "A lot of this comes down to where you live and what you're applying to. Like if you're applying to 100 remote work internships at companies paying interns $50 an hour no shit its hard. If you apply at a local insurance software firm that pays like $18 chances are you're gonna get an interview. Same reason why people apply to \"hundreds\" of offers with no interview...",
            "What is this type of diagram called?"
        ]
    },
    {
        "post_id": "q5jbhk",
        "author": "ktang343",
        "title": "Invited to a 6 round interview with Netflix!",
        "url": "https://www.reddit.com/r/csMajors/comments/q5jbhk/invited_to_a_6_round_interview_with_netflix/",
        "score": 1205,
        "num_comments": 48,
        "created_utc": 1633908482.0,
        "selftext": "After my internship at Melvin Capital left me in severe debt, Netflix reached out to me about an amazing interview opportunity. I will be playing children's games! The first round involves testing their new computer vision program. Tbh, it sounds too good to be true but I got nothing to lose. I'll let you guys know if I make it through.",
        "permalink": "/r/csMajors/comments/q5jbhk/invited_to_a_6_round_interview_with_netflix/",
        "comments": [
            "i heard tc is $38mil, pretty decent imo",
            "Heard there’s at least 456 people interviewing so good luck!",
            "This went over my head till it didn’t",
            "How many licks does it take to get to the middle of a CPU?",
            "Make sure to study Leetkid for an edge on the competition",
            "In case you guys don’t understand the joke he’s referring to squid games lol it’s a tv show on Netflix",
            "This post is viciously meta",
            "I hope your front man treats you well. My front man has just been ghosting me. Reached out to him multiple times on LinkedIn too :/",
            "You lost money in an internship?",
            "You are only allowed to type when the CV is not running otherwise you get eliminated.",
            "How did you get the invited interview from Netflix? Could I take a look your resume?",
            "I can’t tell if this is satire or not",
            "Cliff notes 101 , well done OP !",
            "Imo we should start to not allow these posts",
            "Good luck!!🤞",
            "Congrats man!! that’s so good to hear",
            "Woah dude i’m so happy for you! Let us know how it goes (or not) 😊",
            "Congrats. I had a six round interview with eBay back in 2004. At the very end they told me that they were having a problem with the 2gb limit in excel. Back before the 1m row limit (when things were limited to 65535 rows) you could take a pivot table that was hooked up to like thirty or forty different sheets. \n\nFucking morons should have used a datamart with SQL Server Analysis Services. I didn't get the job I was over qualified for their drama.",
            "For a moment I thought it was true, then I realize you are just making a Squid Game Reference lol",
            "Cool!! Let us know how it goes!!",
            "Is this for the ML intern role?",
            "\\#1 traverse a Red-green trees",
            "What happened at Melvin Capital?",
            "🦑🦑🦑🦑",
            "."
        ]
    },
    {
        "post_id": "16984u8",
        "author": "alanisturingcomplete",
        "title": "I’m sick of the grind culture in my college",
        "url": "https://www.reddit.com/r/csMajors/comments/16984u8/im_sick_of_the_grind_culture_in_my_college/",
        "score": 1196,
        "num_comments": 216,
        "created_utc": 1693774718.0,
        "selftext": "“But just grind LC”. The response I got when I told someone I’m taking a computer organization and assembly course.  “Assembly? Why? Ew.” \n\n“Huh, Quantum Computing? You don’t need to do that, just focus on DSA, and keep grinding lc”\n\nIt’s so hard finding people that share my appreciation for CS. I’ve seen people fantasize working at FAANG “I’d die to be a janitor there”.  No one seems to appreciate the raw mathematical beauty I see in CS. I almost feel like I’m in the wrong major.",
        "permalink": "/r/csMajors/comments/16984u8/im_sick_of_the_grind_culture_in_my_college/",
        "comments": [
            "Bro goes to Waterloo 💀",
            "Has a literal human said to you they'd die to be janitor at a FAANG company? Or are you aggrandizing?  \n\nSomeone can be passionate and truly interested in math, CS, problem solving without writing poetry about assembly FTR.",
            "CS is full of socially inept people whose only goal is to simp for FAANG.",
            "[deleted]",
            "yeah subcultures are dead. this applies to a lot of things but i mainly mean the hacker / programmer culture of self-learning, tinkering and joy of engineering. to be fair this is like a weird version of the Goodhart’s Law and has been happening in a lot of other places too. average software engineer (especially when looking at CS programs) is truly akin to a modern day construction worker (with no disrespect to blue collar jobs, in fact, i have huge amounts of respect for them)",
            "It's the stupid tiktok trend making unqualified people go into CS for money not passion",
            "ah, this thread again. get in line, i think you're poster # 34,325.",
            "Is this what people are talking about now? When I was in high school, legit no one gave a fuck lmao. We were just playing RuneScape and WoW all day and made it somehow.",
            "It’s obvious that people just want a high paying job after graduating. You’re the rare few that actually love what they do. For most people, it’s a step in the right direction for a good paycheck.",
            "Yeah it’s always important to be passionate about what your studying and such, but the sad reality is, if you do want to work at these Quantum Computing companies or get paid the big bucks, LC is a heavy determining factor. You can have all the passion and knowledge about your field in the world but if you can’t pass their techincal interview it’s … 😅",
            "You don’t have to do what they do. End of the day it’s your future you’re working towards, not theirs. \n\nStay in your own lane, focus on your own goals, go on with life. You’ll likely never see these people again in your life.",
            "There’s nothing wrong with doing computer science solely for the money and aiming for big tech companies like so many people here seem to disagree with. But yeah, students at your school shouldn’t be rude to you about you being genuinely interested in CS topics. And I agree, it can be hard to find people in college to talk about CS topics with who are genuinely interested in it, which can be kinda frustrating or make you really crave for those types of conversations.\n\nBut at least from my experience from interning and working part time at both big and small tech companies, you’ll find a lot of really smart senior engineers who would be more than happy to get to chat about CS topics with you. So even if it sucks now, at least you’ll have that to look forward to once you graduate.",
            "I'd stay away from the leetcode grinders as much as possible.",
            "surround yourself with people who've actually worked before. 'i'd die to be a janitor at faang' - faang isn't special in any way outside of senior-level compensation which most people will not be getting. it's good for if you like having no life outside the office and a culture of shared values of billionaire sociopaths.",
            "It is all about that Grind, baby 😎. Shit on or get shit on 💯 (I have no idea what I'm saying; I just want an internship).",
            "What \"raw mathematical beauty\" is there in assembly or computer organization? Algorithms/data structures is way more theoretical and close to pure math than programming in assembly.",
            "When you get out into the workforce, get some experience, and can have a wide array of jobs you can apply to, you'll find plenty of people like yourself that love programming.\n\nAda Lovelace once said \"The Analytical Engine weaves algebraic patterns, just as the Jacquard loom weaves flowers and leaves.\" It is a beautiful field.",
            "This post comes across as “I’m only 14 but I love old music. My generation doesn’t know anything about good music”\n\nSerious pick me vibes",
            "Lol dude 98% of computers is writing crud applications, this isnt a movie.",
            "Dawg you need to be a firmware dev, will get you out of the CS dumpster fire.",
            "What's surprised me throughout my major is that programming is probably my least favorite part of computer science. I don't dislike it, I just prefer the other parts.\n\nSome of my favorite classes were Linear Algebra, Statistics, Discrete Math, Analysis of Algorithms, Theory of Computing, General Physics with Calculus II (mainly about electricity and magnetism).",
            "I’m a biochemistry major with a CS minor and this semester I’m taking Digital Systems and Architecture (same thing as computer organization) and honestly this class alone is making me regret that I didn’t major in CS. We just started learning about Karnaugh maps and in like a week or two we’re gonna start the initial steps of designing our own simple circuit boards. I believe we’ll be focusing more on designing the logic gates but I’m not to sure about the details of the project yet. I’m really excited to see how the abstract math we’ve been doing will translate into actual physical signals. Some of my classmates who are CS majors don’t seem to care much about it based on the way they speak about the class and how “useless” it is.",
            "Yeah that’s unfortunate. Well keep trying OP I’m sure you’ll find a group of passionate people somewhere",
            "Most people are in cs for money. Most won't last or get their foot in the door because dsa is not an interest they have but a feeling of how to land good job. Interviewers prefer hearing you talk about a less common cs stuff with enthusiasm. I'm pretty sure I got my job because my project was building a drone which is just lots of less than typical cs learning. But it all applies in the end and they see you enjoy cs not for just money",
            "***In the layoff's shadow, I'm found,***\n\n***With inflation's grip, my world's unbound.***\n\n***LeetCode, my muse, my endless delight,***\n\n***In algorithms, I'll code through the night.***\n\n&#x200B;\n\n***\"Job search?\" they ask, eyes so keen,***\n\n***But in LeetCode's realm, I reign supreme.***\n\n***Hobbies forgotten, a love so discreet,***\n\n***For interviews, it's LeetCode I'll sweetly greet.***",
            "Hey, less competitors for you if you're planning to eventually apply to a theoretical CS graduate program!",
            "I feel that. I'm here for the rigorous math, theory (logic, automata theory, formal language theory, formal methods, model checking, complexity, etc.) and algorithms - but mostly the part where you actually prove stuff like complexity or correctness, and **not** blind memorization & regurgitation as needed.\n\nA lot of outsiders seem to think CS = Tech Support, which I can live with. But I every so often meet fellow students who think CS = SWE + heaps of money, and it always makes me die ever so slightly on the inside.\n\n&#x200B;\n\n>No one seems to appreciate the raw mathematical beauty I see in CS. I almost feel like I’m in the wrong major.\n\nI feel like that too sometimes, like I should have just gone with pure math and gotten CS electives - but there are people out there who do CS for the love of CS and not because they got on some misguided hype train to find the end of the rainbow. You just gotta filter the latter out for the time being.",
            "Yeah bro you’re the only one who sees the beauty in CS, you’re special, everyone else is just in it for money. Is that what you wanted to hear?",
            "r/theoreticalcs",
            "Do ppl actually get hired from using coding challenge sites? Or is it just data structure and algo questions that doubles as interview prep?",
            "I work at a FAANG. I switched to CS in college cus it was the only thing I was good at + interested it. I took a bunch of hard courses just b/c I wanted to learn those topics. Networks, compilers, advance algo, etc. I had a lot of people ask me why I was taking these harder electives and not just focusing on grinding LC. To clarify I wasn’t some brilliant student; I often got less than stellar grades on these courses. But I wanted to learn and to understand and in retrospect I think I actually did that! \n\nI didn’t start at FAANG, I worked at a b tier tech company and then a startup. But I can confidently say that my passion and desire to learn were the most important things I fostered in college. At these jobs I kept my focus on learning and followed my interests. Working hard was easy; I was just doing what I wanted. \n\nWhen it came time to grind LC for this job, I did that. But I did it on a foundation of technical knowledge and more importantly w a base of confidence and curiosity. \n\nWalking the “easy” path may have immediate results but chasing what you are passionate about will give you a fulfilling career.",
            "What school do you go to that doesn't make assembly language an underdivision course that's required? Every single college and university in my state has it as a requirement.",
            "Why does it bother you?\n\nMost of those people don't want to code, much less appreciate the underlying CS concepts. The ones that do graduate will enter the workforce and then realize they are unhappy. They will do whatever they can to get into management or sales or project/business analyst roles... And while they might be really smart people who can ace an interview, most of them will be awful engineers because they don't want to be doing that job.\n\nYou will either be in academia doing research or get a job where you pretty effortlessly outshine those people.",
            "You think you’re cooler then you really are",
            "I never grinded anything. Got an internship based on well-articulated, correct, answers about Java. Internship turned into part-time job less than a year later. Been there since, so 5 years. Now I wear multiple hats, have plenty of responsibilities, and am well-respected. I broke 6 figures this year in base pay, but I've broken it before with OT and fat bonuses.\n\nI had and have a passion for CS/programming. I ended up in an engineering position, not a researcher.",
            "op get over yourself. a few years in the industry will crush any enthusiasm you have for the topic anyway",
            "Don't worry about others. Focus on your own stuff, when you meet people who's goals and passions align with yours, make a concerted effort to keep in contact with them and keep doing your thing",
            "Appreciation for CS? It’s not 1970s anymore. People do CS for money and residency sponsorship desperately. You don’t see many rich people’s kids major in CS, do you? The fact that children of Bill Gates, Steve Jobs, and Larry Page not majoring in CS has said it all.",
            "Lol you must be making up people. Leetcode monkeys aren't gonna make it",
            "why does their culture bother you? Why do you need them to validate what you like? I don't understand your thinking, if you have an intrinsic love for something, then just do it.",
            "If you like the math just enjoy your classes - you'll probably enjoy proof based algorithms and advanced algorithms classes. If you do well and understand the algorithms they pretty much cover everything you need to solve leetcode questions (and far harder algos tbh). Easy to get a faang job, no grinding required and just fun.\n\nOther than those two classes take whatever you want. There are many fun classes like theory of computation, artificial intelligence, security, distributed systems, probibalistic algorithms, computer vision, computational photography, computational game theory, etc.",
            "I mean I understand but tbh assembly/comp org and qc are more computer engineering than cs.",
            "Baby it’s all about six figure baby",
            "Screw the \"raw mathematical beauty\" lol",
            "\"Someone telling you to not [take difficult upper-level courses] is like someone who has never tried pizza before telling you it's not tasty\" - quoted from Dr. Florian Leitner-Fischer",
            "Mate. Please",
            "Consider graduate school and find people more interested in research and application.",
            "Lynbrook High School",
            "GT student",
            "You would rather people obsess about robotics deep learning and computer vision like at my school? Pros and cons",
            "none of this matters when you get a job",
            "You have problems now? Call me at 38",
            "People have mouth to feed",
            "MachOrg and Assembly is the shit, loved that class.",
            "Well if your goal is to get a high paying job then those kids have the right mindset tbh. Doesn’t matter if you like cs or not. \n\nIf you truly love the math behind CS and the abstraction then you should consider a phd. Because in a job as a dev at a tech company you will be doing easy stuff not even using any math.",
            "Why to go uni if people just want to grind LC?",
            "Go into cs research then",
            "I would recommend studying physics if you want to have the right way of looking at things. Math and CS people have no idea what's going on, zero understanding of the fundamentals, they just blindly go at their work their whole life with 0 real understanding and then just die.\n\nEven in Quantum computing, I see physics people taking a totally wrong approach. Zero real understanding. Most people are like this. There is no position or role that you're looking for. You need to create it.\n\nIf you want to do good work, it doesn't matter what you study or what you know. It matters that you think differently. At a certain point you need to realize that courses can only take you so far, and you really gain understanding by thinking about things in your free time. Block out the BS going on around you. Leetcode will be dead in 100 years and so will you. Use a set of ideas you know to be true to expand your knowledge and focus on what's important, you don't have to be in awe of every new detail that comes your way and waste your life on things that don't matter.",
            "Touch grass",
            "OP I 100% feel ya here — the best solution imo is just to find others who truly care about CS and spend time with them more",
            "Switch to math, join the rebellion 🫡",
            "Why do you care what they think?",
            "If you’re passionate about computer science then why would it be the wrong major? I think with the huge growth in the internet and smartphones in the past decade you have a lot more people who see this field as a means to a high salary and less about a passion. For me it was always a passion, I’m just incredibly lucky that it also pays really well.\n\n\nBut the honest truth is that work will still be work and hobbies will still be hobbies. The “practical” skills that the job market wants may not be the things you want to work in. You’ll have to explore the side of CS you find fun in your spare time. Most of the job is implementing some business requirement that you couldn’t care much less about. With a lot of meetings to clarify and define things. Welcome to the grind 🫠",
            "I am a data scientist and I truly enjoy every single aspect of data science. I spend my time understanding the theory behind Machine Learning and Artificial Intelligence. I get very passionate when I get to talk about the subject. And then I meet “so-called” data scientists who would try to guild me for spending my time understanding the theory and the math. They would say “Python has everything implemented, you don’t need to understand that crap”. That honestly annoys the hell out of me. So yeah, I definitely can relate. There are many people out who appreciate rote learning more.",
            "You probably want to go for PhD you want to keep appreciating the \"beauty.\" O/w most jobs after a Bachelors won't be so intellectually engaging.",
            "Are the janitors directly employed by FAANG or they are just 3rd party contracted out to another company or any of their subsidiaries?",
            "Why does it matter if you're passionate or not? If you're here just for money, and you still manage to be competent and valuable during employment, what the fuck is the issue?\n\nLike excuse some of us for only wanting this to be a job.",
            "I feel you bro. Even algorithms I liked to learn about proofs of correctness or niches but if its not on leetcode no one cared.",
            "Damn finally someone else appreciating the raw nuances of this field and how things came to be! I’m beginning to hate CS coz the culture you describe makes me sick and I’m surrounded by it…",
            "holy shit what type of loser contest is this",
            "Don't be disappointed just follow your interests and grind it......",
            "You're in the wrong major bro!"
        ]
    },
    {
        "post_id": "swe27f",
        "author": "Stunning-Tower-9175",
        "title": "A talk I wish I could have with myself 6 years ago, for those who are blowing off their career and grades",
        "url": "https://www.reddit.com/r/csMajors/comments/swe27f/a_talk_i_wish_i_could_have_with_myself_6_years/",
        "score": 1192,
        "num_comments": 123,
        "created_utc": 1645288715.0,
        "selftext": "I’m writing this because I wish I someone would’ve sat me down and told me this 6 years ago when I was a college freshman and I think this might help some people in the same position. \n\nI’m now 2 years into my career as a software developer at a decent no-name software company. I make a decent comfortable salary, I work with decently interesting tech, decently competent coworkers. I feel very privileged to be where I am, but simultaneously I know I could do much greater if I had applied myself in college.\n\n1.\t**CS theory does matter. It’s not useless**, and you will eventually enjoy it once you get enough of an understanding to not be intimidated by it. Theory knowledge will form the basis of your ability to find a job and solve interview problems to prove your knowledge. \n2.\t**You are good enough and smart enough**. You may not know it yet, but you will build your confidence in your abilities and come to see you are much more capable than you think you are.\n3.\tStop wasting so much time on video games and Reddit (both fine in moderation) and trying to save a doomed relationship. Every week dedicate a bit of time, even if it’s just an hour (but ideally a few hours) to working on side projects, an hour or two practicing Leetcode, etc. **Consistent habitual practice will go so much farther than last minute motivation and cramming before an exam or interview..**\n4.\t**Grades do matter, but not in the way you think**. The vast majority of companies do not care about your GPA, but they care about your knowledge and abilities. People with vast knowledge and strong abilities in CS tend to have good grades, because after all, if you know your material then you’ll be able to pass your exams.\n5.\tGet over your shyness. Nobody is going to think you’re weird or a loser. **Go mingle with classmates that are interesting and fun to be around**. You’ll have great conversations, maybe you’ll work on projects together, maybe they’ll end up referring you to a job, maybe you’ll learn about an interesting new Framework, or maybe you’ll just make a cool friend. Don’t be afraid to put yourself out there. If you don’t take the first step and try, you’ll never succeed. \n6.\t**Talk to your professors outside of class.** They’re really knowledgeable, they’re often friendly and cool people despite how intimidating they may seem at a distance. Go to office hours and ask a clarifying question about a homework problem. You’re paying for these resources, so use them.\n7.\t**Apply to internships early.** Apply during your freshman year. Who cares if you look like an idiot who knows nothing, most people do at this point. By making yourself be that idiot who is underprepared freshman year, you learn about the process and now you won’t be that idiot sophomore or junior year. \n8.\t**Go to career fairs**. It doesn’t matter that your resume sucks. It doesn’t matter that you aren’t good enough. Get over your shyness and go. This will teach you how to speak like a professional with a recruiter, and you might make a contact at a large company who can help you out. You might become friends with the nice person in like next to you. \n9.\t**Go to hackathons**. No you don’t have to pull an all nighter. No you don’t have to abuse caffeine and eat greasy food. Go to a hackathon because you will make friends. You will build a cool project that you can put on your resume, and you’ll have a lot of fun. You might win a prize and you’ll almost certainly get some free swag.\n10. **Join student clubs**. You’ll become good friends with these peers. The club might work on cool projects together or bring interesting speakers from companies, or help each other with mock interviews. \n\n\n\n**All of this mostly sums up to put yourself out there, don’t be afraid to fail, because if you don’t try and fail a few times you will definitely fail, and long term. You are capable of way more than you think you are.**\n\nI’m two years into my career and I’ve learned a lot of important lessons and I’m now for the first time getting on the Leetcode grind, fixing up my resume, and trying to get into the FAANG companies. \n\nBut even if I get into a FAANG company this year, there’s a few things I’ll never be able to go back and do. I’ll never be able to go back and have an internship. And I don’t regret it because I missed out on money and clout, I regret it because I missed on friendship and fun / interesting experiences. But I’ll find them in other ways.\n\n_ A 2020 grad who wishes he could go back to freshman year with his current knowledge.\n\n\nQuick edit: If you’re a freshman / sophomore and feel like you’re not on the right track, watch [this video ](https://youtu.be/YJZCUhxNCv8). It’s a classic, it’s a few years old, but it is still VERY relevant and he also made a 10 minute long update video in 2020 for the little that has changed. I wish I watched this video as a freshman.",
        "permalink": "/r/csMajors/comments/swe27f/a_talk_i_wish_i_could_have_with_myself_6_years/",
        "comments": [
            "Man, this is some real shit.",
            "I'm a post-bacc student who started my CS degree at 32 years old. All of this, to me, seems like obvious no-brainers. \n\nAnd I don't say that to downplay this post - rather, to support it! \n\nAlmost all of the motivated non-traditional students I know (myself included), do all of these things naturally. And I see younger students who are intimated to talk to professors, who wait until the last minute to apply to internships, who isolate themselves from others, who refuse to see the value of theory, etc. Then they come to me and ask how I've managed to get good grades, to have good relationships with professors, to receive opportunities for internship and mentorship, to do well in interviews and get job offers. It's not because I'm smarter or more deserving - much it has to do with being honest and outgoing, simply asking for help and for putting into the world that you have a genuine desire to *learn* and will appreciate support from others (both peers, and superiors). \n\nI'd also like to add to this list: do things that make you happy! Stay motivated, but don't let academics control your life. Don't chase prestige and money exclusively - those things come naturally. Be well-rounded: exercise, pursue hobbies, take extra elective classes that sound interesting just for fun (drawing, music, world history, whatever). It will absolutely make you a better programmer and a better job candidate, and (more importantly) enrich your life and make you happier. I promise you will look back on this time in your life and wish you had capitalized on your youth and not just grinded leetcode obsessively to land a faang job.",
            "Thanks for the advice OP!😃",
            "Bless you my guy.\nI hope and pray that every wish you have comes true.\nStay consistent.",
            "As someone who is graduating this semester, 7 and 8 are essential, and my two greatest regrets. Honestly, IMO it is worth taking  a hit to your grades (as long as you still learn the material) to make them happen. I have a FAANG internship this summer, but if I'd worked harder at getting internships in previous years, I'd probably be sliding into a full time position (not necessarily FAANG) instead. Optimizing your resume and practicing basic interview skills + some leetcode is more important that they GPA imo. \n\nAlso, did 9 and 10, highly recommend. Chances are you'll learn lots of useful skills. A club is how I became proficient with git for example.",
            "I've never understood how to do #5. Do people literally just go up to someone in class and start talking to them? I literally don't know a damn thing about these people. I just don't get it. The only other people I know in CS and talk to outside of class are people I met either through a randomly chosen group for a project or through means outside of classes.",
            "Adding to that, definitely try for internships your freshman year! While you still have to get lucky I got an internship for example, it was a great experience to \"work\" for real and to be surrounded by seniors that would answer all your questions. It really helped with my future in cs\n\nIt's never to early to apply for internships!",
            "My biggest regret in life is not getting over my social awkwardness. I never made any friends or meaningful connections and still struggle with holding down a co versation with people.",
            "I feel attacked\n\n(curse you ADHD)\n\nI've even gone thru this before. In my engineering program I joined FSAE and made some incredibly cool stuff along with tons of friends and job connections. I got an internship and worked in aerospace for 4 years. I got burnt out and hated making someone else millions while I couldn't afford an apartment.\n\nAfter getting laid off (pandemic, my old employer was quick to liquidate their workforce) I'm back in school for CS but all I want to do is play games and not think about school/working ever again lol",
            "this all makes sense in theory.. but im one of the guys that didnt put all the extra effort in either. I just got by with decent grades and yes i dont even work in software yet. I landed an IT job pays decent and i plan to work my way up. i feel blessed to have the opportunity regardless. but my point is. I had so much fucking fun in college while not studying and doing the extras etc. I went to a lot of parties. played sports. made friends etc. I did all my schoolwork and got good grades but I didnt really study much. I can say tho im happy with how my college experience went. It was a fucking blast and I didnt do any of this shit.",
            "Why didn't I see this 2 years ago dammit",
            "Damn bro this feels like something my parents would tell me. Good post",
            "Dude this honestly hit home. I’m a freshmen with no notable skills, and I recently skipped a career fair because I kept telling myself my resume wasn’t good enough. Even the CIA was at the fair looking for computer science majors and I skipped out. I’ve been beating myself up over it but this honestly really opened up my eyes. Thank you",
            "I graduated in Dec 2021, and started looking for work a month ago. I'm realizing now, I should of done all the things you say here. Though, I did get good grades.",
            "As a senior engineer at a company that forms part of many acronyms, I concur with everything this man is selling.",
            "[removed]",
            "[deleted]",
            "I am freshman and I have been following all these points except for maybe the internship part but I was planning to apply to some places after a few months. Thanks. I hope you land that job at FAANG.",
            "I'm only a senior but this looks like sound advice. Bookmarking.",
            "As a current freshman I really thank you for putting this out. This month I just had the epiphany that I'm in college and I have nothing to show for it so i'm just going everywhere I can applying to as many internships, doing a little bit of Leetcode every day. I still have a lot left to do but I appreciate your advice!",
            "This is good advice.  I am 100% on board with students hopping in feet first on every opportunity college has both academically and socially.  But life is a journey and your first job is not your last job.  Had you done different things in college you may have missed out on other things.  And you may get that faang job and realize something else is where you want to be in a few more years.  Enjoy the process where you are and try to avoid the grass is greener syndrome.  To me you sound super successful and lots of young SEs are ready to try something else 1-3 years into their first job, even if that first job was at some highly regarded company.",
            "Graduated in Dec 2020 and everything you said is totally spot on. I especially wish I had taken the internship search and leet code grind more seriously. I know I’d be in a better place in life right now If I had done it. I see some classmates and even juniors who followed all these principles get juicy offers at big tech and while I’m happy for them I feel bad about myself. \n\nI just get comfort from the fact that I went from  graduating without an internship, minimal leetcode ability, and multiple rejections to a decent job. It’s all about grinding, seeing your progress and grinding some more till all the goals are achieved",
            "Freshman here. Minoring in CS. Thanks for linking the video. The big 4 are nice companies but I am not the type of person going into a depression for not working for them. That being said I have to build CS skills outside the classroom. \n\nQuantity over Quality. That is the gospel that I need. A python script is better than feeling overwhelmed in android studio. A stupid app that you can get done in an hour is better than trying to break down some large project that you don't fully know how to do, especially when you have nothing.",
            "[deleted]",
            "I want to pursue a career in cs but the math is very difficult to understand. I wouldn’t mind studying Econ or finance while learning how to code in boot camps but I just don’t know if that will land me at a FAANG company. Thanks for this post!",
            "Also 2 years in and I'm so pretty comfortable. But everyone around me who \"climbed\" up the ladder did so because of corporate connections that I can't stand to maintain anymore. And I'm fine with that. \n\nNot shitting on your advice, it's pretty decent for anyone new-er to the field. I was referring to your first few lines, don't beat yourself up if you feel you haven't \"applied\" yourself enough.",
            "What do you mean by theory? What theoretical subjects are you referring to??",
            "Welcome to r/csmajors, where all of this is common practice!",
            "I'll keep in mind what you said.",
            "so so true",
            "I only did #7 when i was a student",
            "I am an incoming freshman this fall (2022). Thank you for the advice!",
            "That video you sent is gold. I watch the last 10 minutes a lot because it's very inspiring.",
            "Is it hard to get internships while not knowing too much? I'm now on my 2nd year, pretty much everything valuable that i learned, cs related, did it by myself, i was considering trying to apply for something but i really doubt i can do something useful really... Currently i know python basics enough to be comfortable, oop amd stuff, not that many algorithms/data structures but at leadt something. I would like to try and seek an internship primarily for knowing what can i improve and what to do next, but idk if there could really be somewhere that welcomes me",
            "Im a freshman and I watched this video before I started. I did not give a shit about when I did poorly on a test or got a bad grade on an assignment (as long as I pass) . I go to the same school as this guy so that also proved to me I can make it as far.",
            "!remindme 1 year",
            ">but simultaneously I know I could do much greater if I had applied myself in college.\n\nThis is fr bro. I want to die for this reason.",
            "It’s a bit gauche that you’re suggesting to meet people primarily for the sake of networking. Good relationships cannot be built out of someone wanting something from the other person. In fact, people who tend to make friends for personal gain are usually quite manipulative, which can be counterproductive for networking anyway because then your relationships are less genuine and your social skills are worse. \n\nOther than that minor nitpick, I think it’s a great list.",
            "That vid is goated",
            "Thank you so much for sharing this! \nI want to add another one ;). \n\n\n11. **Networking is important** Talk to the recruiters at the career fairs, keep in touch with your lab mates, reach out the Engineering Manager / University Recruiter on LinkedIn, or just invite someone interesting for a Zoom coffee chat, including anyone at the company during your internship. Eventually, there’ll be time that if you know someone, it will help you out a lot. This could be changing teams, opportunities at other companies, mentorship, or just people to invite over so you feel less lonely ;) also start reaching out using LinkedIn; it could be cliché at first but it doesn’t hurt to try.",
            "I kinda disagree about the relationship part. It is more important to develop relationship than just develop connection. Don’t get me wrong connection is important, but not the most important in life. Life will be meaningless without meaningful purpose if your goal is only to get your dream job. If you keep thinking work is the only thing you need in life and get the dream job is the only thing matter, you’ll later ask yourself what’s next at some point and nothing will make you happy once you get that dream job.",
            "Yea when I was graduating I asked the other students at the ceremony what projects they had been working on outside of class, and not one of them (of the 10-15 near me) was working on anything.  I couldn’t believe it.  I’m about 10 years into my career, work a job I love (most of the time), and make almost $200k a year.  Can’t complain. \n\nEverything this post is pretty accurate.  I’d also add that you should absolutely try to get a part time job programming during school.  During school you can afford to get paid $10-20 an hour (more easily than you can as an adult with expenses).  My friends made sandwiches, don’t waste your time on that shit.  No one expects a $10/hr programmer to be THAT good (it’s relatively low pressure) and it’s such a different experience than class projects.  I had had 2 software jobs by the time I left school (turned my $10/hr job into a 2nd $20/hr job) and it was pretty easy to turn that into a $60k+ salary.  I was coming from a low-pay state and they actually chuckled when I said I wanted to make over $50k a year (that was my personal goal).  It’s been constant raises and promotions since then. \n\nWhat is super important IMO:\n-\tlearn Linux and especially bash, as much as possible.  Insanely valuable\n-\tget a low paying job to build skills.  Maybe not even needed nowadays since programmers are in such high demand\n-\tSIDE PROJECTS - those got me over the hump and get WAY easier over time as you build more skills\n\nI also read everything on the r/Programming subreddit mostly every day whether I understood it or not.  \n\nThis is a lifelong subject and skill, you just need to put in the time.  That’s far easier when you are young and have energy.  Don’t neglect it!  “Success is not mystery, success is the continuous application of the fundamentals”",
            "hope this helps you in your leetcode grind and resume updates ->\n\n  \n[https://github.com/antariksh17/Reddit-wiki-programming](https://github.com/antariksh17/Reddit-wiki-programming)  \n\n\n[https://www.overleaf.com/latex/templates/deedy-cv/bjryvfsjdyxz](https://www.overleaf.com/latex/templates/deedy-cv/bjryvfsjdyxz)  \n\n\n[https://drive.google.com/file/d/1PkNoBOOyp3sdsLzzk2bQdUJhrjFn-yvh/view?usp=sharing](https://drive.google.com/file/d/1PkNoBOOyp3sdsLzzk2bQdUJhrjFn-yvh/view?usp=sharing)  \n\n\n[https://www.linkedin.com/posts/jonathan-wonsulting\\_resume-jobsearch-jwow-activity-6848632858454695936-CFjV](https://www.linkedin.com/posts/jonathan-wonsulting_resume-jobsearch-jwow-activity-6848632858454695936-CFjV)\n\n[https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs](https://www.overleaf.com/latex/templates/jakes-resume/syzfjbzwjncs)\n\n[https://resumake.io/](https://resumake.io/)\n\n[https://resumeworded.com/](https://resumeworded.com/)\n\n[https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers?utm\\_source=podia&utm\\_medium=broadcast&utm\\_campaign=741478](https://www.indeed.com/career-advice/interviewing/most-common-behavioral-interview-questions-and-answers?utm_source=podia&utm_medium=broadcast&utm_campaign=741478)\n\n[https://github.com/viraptor/reverse-interview](https://github.com/viraptor/reverse-interview)\n\n[https://leetcode.com/discuss/interview-question/437082/Amazon-Behavioral-questions-or-Leadership-Principles-or-LP](https://leetcode.com/discuss/interview-question/437082/Amazon-Behavioral-questions-or-Leadership-Principles-or-LP)\n\n&#x200B;\n\nGood Luck!",
            "CS major freshman here - thanks for this post, very insightful!",
            "Agreed with some, but not all",
            "Covid ruined most the \"friends\" aspect for me... \n\nBut yeah, this is solid advice. \n\nAlso, if I can add:  \n* Get a hobby. It doesn't have to be coding. Get something that will help you de-stress in the longrun. Cuz it's gonna be a really long run.",
            "I agree that \"grade does not matter, in the way you think\". I am not in the US, but I am having a job at the largest company in my country. Grades help me pass the CV round, and after that everything the company asks is \"will you be available full-time after your internship\".\n\nIt also matters if you apply to grad school, but grad school has a lot of other factors that are out of the scope here. So at least, don't ignore your grade completely. Get a decent one.",
            "THIS. Just THIS.",
            "How to swing side projects while CS FT and working PT ? Assuming side projects are actually challenging.",
            "All I want is a job outside of college that pays well and has good work/life balance. Seems you have the mindset of “Faang or nothing.”\n\nCollege is pretty much taking up all my free time, and I value having a life outside of this sh*t.",
            "Is it too late to change if I wasted my freshman year (going into sophomore in the fall) ? Always felt and still feel too intimidated to try these things.",
            "This hits different.",
            "I don’t understand how you can have time for hackathons or student clubs as a cs major. At least for me there’s no way. I don’t have time for anything. I have to work until by brain is no longer working for the day every day, and by that point I only have 6 hours until I have to go back to class so I need to use that time to sleep"
        ]
    },
    {
        "post_id": "14al1do",
        "author": "PM_ME_UR_API_KEY",
        "title": "Leetcode destroyed my life",
        "url": "https://www.reddit.com/r/csMajors/comments/14al1do/leetcode_destroyed_my_life/",
        "score": 1182,
        "num_comments": 63,
        "created_utc": 1686883657.0,
        "selftext": "I have destroyed my life for leetcode. I once had a loving family, girlfriend and a vibrant social life but it wasn't until my tiktok for-you page got flooded with day in the life videos that I finally saw the light. No more would I let these people get in the way with talk of their mediocre life plans, for I have bigger goals. Unlike the weak minded finance bro who identifies with Jordan Belfort, I identify with Mark Zuckaburg and watch the social network as part of my morning ritual of cold showers and 30mg of Adderall. Working a corporate desk job will surely fill the empty void I feel having missed out on so much of my social development. Women will surly flock to me once I make the median income of an coastal city urbanite. While you were in the gym and at frat parties I studied the ~~sword~~ Leetcode. You people have no idea how big I'm gonna be during my company's mandatory social events. Just wait.",
        "permalink": "/r/csMajors/comments/14al1do/leetcode_destroyed_my_life/",
        "comments": [
            "You got this OP!! Make sure to add Zoloft to your morning ritual too🙏",
            "Finally, a shitpost to bring this sub back to its roots",
            "Very sigma of you",
            "It’s funny bc this is probably the inner dialogue of at least half of this sub🤣",
            "I have sent you the key my fellow friend",
            "csMajor shitpost? Maybe the market is going back to the good ole days",
            "I’m a woman, and I am so proud of you!! Keep grinding King🤴💻💰. Don’t let anything stop you! Not even death!! Grind4lyfe 😘",
            "Ipo over subscribe fr",
            "A life spent doing arbitrary algorithm puzzles to apply to a series of jobs that only accept .1% of applicants is a life well lived.",
            "Giga chad has been born again",
            "touch grass",
            "Is it possible to learn this power….?",
            "I need that Adderall too how does it feel ur focus out of 10 if u need to rate it",
            "Got lots of fucking giggles out of me. Good shit",
            "> my morning ritual of cold showers and 30mg of Adderall. Working a corporate desk job will surely fill the empty void I feel having missed out on so much of my social development. Women will surly flock to me once I make the median income of an coastal city urbanite. While you were in the gym and at frat parties I studied the ~~sword~~ Leetcode. You people have no idea how big I'm gonna be during my company's mandatory social events. Just wait. \n\nHow the fuck did you get my 2020 diary!? RETURN IT NOW!",
            "You mean Mark Suckerberg?",
            "Never stop the leet 🙌",
            "same with chatgpt",
            "This sounds like the Neetcode creator having a breakdown after quitting Google",
            "I would love to be your apprentice sensei",
            "Shit like this is why I come to this sub",
            "YO I AM DEFINITELY ROOTING FOR YOU!",
            "Is this a copypasta",
            "What's this guy talking about? Huhh I never knew leetcoders could do all that 😂😂",
            "this post is attention seeking in the lamest and cringiest way ever",
            "Stay on that sigma grind set OP",
            "I think this subreddit has officially lost it",
            "I don't understand the title of this post. Destroyed? More like GAVE you life!",
            "How do I invest",
            "OF?",
            "🅱️ 🅰️ S E D",
            "genius",
            "me every post nut clarity",
            "Leetcode is life",
            "Never stop beating your leet",
            "Imao this type of guy/girl are attractive af /s",
            "Cs majors is finally healing",
            "thou art a servant of the secret fire, weilder of the flame of anul",
            "I hope you find happiness",
            "While you were studying Leetcode, I was at the gym and partying.\n\nIt didn't take long before I wished I were you, it didn't take much longer before I decided to become like you.",
            "Ultimate shitpost. Sign me up",
            "same",
            ".",
            "Alpha male"
        ]
    },
    {
        "post_id": "1be56wt",
        "author": "DowvoteMeThenBitch",
        "title": "0 leetcode",
        "url": "https://i.redd.it/711u42yzi6oc1.jpeg",
        "score": 1174,
        "num_comments": 96,
        "created_utc": 1710369616.0,
        "selftext": "I did it",
        "permalink": "/r/csMajors/comments/1be56wt/0_leetcode/",
        "comments": [
            "https://preview.redd.it/p5j5kqbxl7oc1.png?width=498&format=pjpg&auto=webp&s=48485a0caadbcd0edfcfd91f408f8a03cab83e02",
            "Bro is the candidate they moved forward with",
            "Yo fuck you bro (congrats)",
            "How’s you get a job with just 18 apps 😭",
            "Man what the fuck",
            "It only takes one yes.\n\nCongratulations OP!",
            "You can't just dump this and go. How did you do it? Do you mean you didn't need to leetcode but they still made you do a coding assessment or there was no coding assessment?",
            "Bro can you share some luck with me",
            "Man I went into CS so I wouldn't have to talk to people lol. Now you're telling me I have to hand in my resume? I guess it might be time to become a trucker.",
            "Do you ever notice that once someone gets to the interview part, the chances of getting the job go way up.",
            "Based. Good job OP 🙏",
            "This place must have really needed you",
            "Fuck yeah! Congrats!",
            "You never did any leetcode till now? What tech stack you got offer for?!",
            "Eminem wrote a song ab this",
            "same bro handed resume to recuriter at career fair --> interview ---> full time offer with 1 application",
            "Good job. This is is similar to me. I did a couple of applications and a handful of interviews and got a job a few weeks after graduation. 0 internships and 0 leetcode. Leetcode is something to test a very particular skill set. Its about the worst way to become a better programmer",
            "Congrats bro",
            "Based job search",
            "It is possible. There’s hope. Congrats! 🥳",
            "Good work",
            "Congrats",
            "Amazing... 18 is too less! Congratulations.",
            "How do you hand resume to recruiter?",
            "How long from round 3 to offer? I’m currently finished with round 3, waiting on a decision",
            "May I ask what company?",
            "Congrats! Similar to me last year where I applied to one internship and got it. It was a pretty big company but an industry one. Just a conversational interview and got the offer a month later. No leetcode or anything.",
            "Are you international ?",
            "When do you second degree? What are you studying and where?",
            "Rizz > leet",
            "Jealous but congrats dude",
            "What did you use to create this infographic",
            "Congrats",
            "Just curious, what company is it?",
            "looking at ur username - is this a troll post?",
            "Hey",
            "Now this is the type of motivation we need",
            "what's the tool that you used to generate this?",
            "Before i forget to ask someone again. What's that kind of diagram called?",
            "Definition of luck lol"
        ]
    }
]