[
    {
        "post_id": "18esxyd",
        "author": "None",
        "title": "Name and Shame: IBM",
        "url": "https://www.reddit.com/r/csMajors/comments/18esxyd/name_and_shame_ibm/",
        "score": 1174,
        "num_comments": 95,
        "created_utc": 1702173657.0,
        "selftext": "Jesus Christ, what a fucking shitshow of a company. So I apply for their DevOps internship - I aced the Hackerrank OA and don't hear back for another 2 months. Then, I get an interview request. The recruiter for some reason wouldn't reply to my emails unless it was a brand new thread which I found really strange (had to follow up multiple times because of this) - and they were based in Hungary (classic IBM outsourcing) and would only reply in this specific 1 hour timeframe every day.\n\nThe time for the interview finally rolls around and let me just say this - fuck IBM for using Webex and not Zoom or Google Meet like any other normal company would. For some reason, Webex stopped recognizing my camera and it would just randomly shut off for several minutes at a time throughout the whole thing; the second interviewer showed up like 15 minutes late (mind you at this point the interview was like half over at this point) The interviewers seemed really uninterested (like they didn't even want to interview me) and when I asked them questions about IBM they seemed to trash talk the company at any chance they could.\n\nAlso, for those still considering this pathetic joke of a company, IBM is getting rid of their 401k plan for all employees. Don't bother.",
        "permalink": "/r/csMajors/comments/18esxyd/name_and_shame_ibm/",
        "comments": [
            "Well to be fair, some of the blame should be on Cisco because they wrote the code for Webex, so this name and shame title should be IBM + Cisco",
            "Apple also uses webex.",
            "I am loving these name and shames.  Thank you for sharing!",
            "I took the hackerrank. Missed one test case. I got an email saying they will go forward and got a behavioral. Got an email a few weeks later saying congrats we are moving forward with a presentation. Attended the presentation and got rejected two months later",
            "ibm has a mega back door roth ira though which imo is a much better benefit than some 3% match",
            "I tell this story about IBM\n\nIn 2016 at a college career fair, I showed up in shorts and a tshirt as I had just gone to the gym and went straight to the fair since it was hosted in the gym.\n\nI went around booth to booth and everyone was dressed up in a suit or nice polo.  No one cared or said anything, until I got to IBMs booth.\n\nI stood in line for 20 minutes, got to the front, and was disrespected.  The woman took my resume and threw it in the trash in front of everyone and said she would never hire an unprofessional person (due to my dress).  2 other IBM recruiters there laughed when she said it, so I just left the fair.  Was humiliating.\n\nWould never work for them after that experience, but sounds like they didnt want me anyway.",
            "I had an interview for IBM Research for an internship position and I faced some of the issues you did, mainly the no updates/hearing back for long periods of time (1-2 months) and HR not replying at all (in a new mailing thread or old one) and one of the senior managers showing 10-15 minutes late in one of the interviews (I did 3 interviews in total and in the rest everyone was on time). Other than that the interviewers were pretty professional and even though I couldn’t get updates for the interview results from HR, one of the interviewers connected with me on linkedin and provided me updates regarding the result announcement date when I asked them.",
            "Webex Linux feature parity issues have hindered a couple of my interviews. I probably should have known better.",
            " I’ve found them difficult to deal with too. They sent me a HackerRank and ofc I wait until the day before it was set to close to do it. That said, I had the closing day on my calendar. So I leave my thanksgiving early to do this OA and then I find out it closed 24 hours early. It has now taken me FOUR different people…that I reached out to solely on LinkedIn (because ofc using these OA’s as filter means you aren’t even assigned a recruiter until you pass it)…to get them to open my assessment again and it’s STILL not open. I will have to reach out again Monday…damn near three weeks of following up.",
            "I interviewed at IBM twice. Took the HackerRank and did kinda bad honestly. But still got interviews. Both interviewers went on about how much they loved me and they can’t wait to work with me. After my first interview I got a second HackerRank test from the recruiter. Told the recruiter I already took one. They responded back with incredibly broken English telling me that they didn’t have it on file. Got the second interview after that without doing the second HackerRank. Like I said, that interview went well too. But I was never contacted again after that. I don’t really care because I ended up finding a better opportunity, but I agree that this company is a shitshow",
            "[deleted]",
            "This might be a bit tangential to the post and I'm pretty sure I'm going to be roasted alive but I work at Cisco (Not on WebEx). If you could mention what the issue is along with the camera model and driver details, I can probably pass it on internally to someone in the WebEx team.",
            "Did you get the job?",
            "IBM is a shit company, it laid few of my relatives off, especially after one of my relative had done training like 3 other teams on how to use the Internal tool his team had built, that is some snake shit",
            "My company uses Webex for every official meeting and I don't think there has ever been a meeting where nobody had technical problems with Webex, lol.",
            "Wait wtf? They are getting rid of employee 401ks???? That is absurd for such a large company",
            "This is the way^ The more we can name and shame companies like the OP did the harder they will fall!",
            "Well ey that's why it ain't in the tier of a FAANG.",
            "I had a smooth process with them. WebEx bugs aren’t their fault, probably ur laptop tbh. This isn’t really worthy of a name and shame",
            "Yeah well 401k is a scam anyways, they get fucking owned every recession. We need regular old pension plans back.",
            "Chime enjoyer",
            "IBM should be considered WITCH tbh",
            "join the club",
            "Had the same issue with webex during my DE Shaw interview. needless to say that didn’t pan out lol",
            "Ngl dude from your post history, you just sound like a extremely whiny person. The interview process is tough. All of us are dealing with this stuff, I’ve had several interviews cancelled day of. Grow up and get back to the grind.",
            "I applied for a software developer job at IBM when I was in my last CS semester. Here's what they offered me:\n\n\\-40k starting salary\n\n\\-no sign on bonus\n\n\\-no relocation assistance to the state they wanted me to work in\n\nI just hung up",
            "Applied in sep. Gave the OA, cleared it. Got an email for a hire Vue interview and haven't heard back since.\nChecked the status on candidate home(IBM careers), said reviewed and application in consideration - Nov 1 2023.\nHaven't heard back yet,  applied for the data science internship. Anyone got heard back? Should I just consider it over? 🥲",
            "LoL...zoom.\n\nIf IBM cares for anything then that is that their name isn't mentioned alongside a big ass data leak.",
            "I agree. Any other departments at IBM are shit. The only exception is IBM Research (which is literally what is keeping the company relevant).\n\nIf you're recruiting for research roles, IBM Research is probably like a tier 1\\~1.5 option, whereas the other roles IBM is like tier 2\\~2.5\n\nBut to share a positive point of view, IBM is a big company, unlike some more well-known and seemingly trendy companies. There are really good divisions like IBM Research, but there are also really bad divisions like consulting. Anyways, the perk of working at a big company is that they at least have a system of doing things: no random offer rescind, and etc.",
            "I have no reason to hate Cisco but ibm has done nothing but sleep like a dragon on its gold mountain for 40 years"
        ]
    },
    {
        "post_id": "xi6knk",
        "author": "user10893432823432",
        "title": "There Is Nothing Better Than Grinding Leetcode",
        "url": "https://www.reddit.com/r/csMajors/comments/xi6knk/there_is_nothing_better_than_grinding_leetcode/",
        "score": 1164,
        "num_comments": 115,
        "created_utc": 1663578007.0,
        "selftext": "Back when I was starting out, I used to think that grinding leetcode was tedious and that I was wasting my life doing boring problems. Not anymore. Now leetcode is the best part of my life and I have come to accept the fact that there is nothing in this life that is better than grinding leetcode, all day and everyday.\n\nLeetcode has endless interesting problems to offer me. I love occupying my brain with interesting things and solving interesting problems. Leetcode offers me exactly that. It has endless interesting problems which I would never have been able to experience had I not been a Leetcode addict. Because of Leetcode, I have been able to solve more problems than 99.99% of people who have ever lived on this earth. Isn't that worth something?\n\nI barely even feel human anymore. I feel like an omniscient, all-knowing AI that has matured and transcended beyond the human experience and lived a thousand lifetimes already.  I even dream in code now: Yesterday morning, I snoozed my alarm so I could finish the solution to the problem I was solving in my sleep. I know that there is so much more that Leetcode can offer me. I don't even want a job anymore. Google could offer me 500k a year for all I care, and I will still reject them, because Leetcode is all I want to do. I will not be satisfied ever, I exist only to read more interesting problems, to think through more creative solutions, to consume every problem Leetcode has to offer, through my blue light screen in the safety and comfort of my own room.\n\nAt this point, I have become Leetcode incarnate. I exist only to scroll through Leetcode, consuming every little piece of an interesting problem I can get my hands on. And as my blue-light stricken, blood-shot eyes flick over hundreds of thousands of characters of code, my dopamine receptors work overtime to keep up (and that's a good thing).\n\nWhy would I ever be interested in growing my own personal mundane, generic, stereotypical cliche life experiences? Boring! When I grind Leetcode, I am experiencing the best of the best the world has to offer, given to me on a silver platter for easy and limitless consumption. How could real life boring experiences and hobbies ever hold a candle to the the sheer dopamine surge I get from designing complex algorithms in a matter of minutes after reading a Leetcode problem?\n\nAnd vacation? Forget it. We all know that vacations always end eventually, and when you're back it feels as if you never went at all. I just want to grind Leetcode. That's all I want and that's all I need.\n\nI have read plenty of books (fiction and nonfiction) earlier in my life, but why would I read books now? It takes so much time, I'd rather just grind Leetcode. You see, reading books, though better for your attention span and less dopamine-frying, is actually just another form of consumption, that doesn't actually get you anywhere in the long run. It's less effective; for me, the opportunity cost of reading a book is consuming a vast variety of tons of different interesting problems on Leetcodet truly broaden my perspective. And the broader my perspective gets, the more I realize that there is nothing better than grinding Leetcode.",
        "permalink": "/r/csMajors/comments/xi6knk/there_is_nothing_better_than_grinding_leetcode/",
        "comments": [
            "bro did you write all this at like 4 in the morning?",
            "He's lost it.",
            "Also, once you solve them all in your strongest language you can solve them all again in another language. The gift that keeps giving.",
            "Bro has conditioned himself to like Leetcode, props to you",
            "We’ve officially reached the depths of the 2023 season boys, this is what peak performance looks like",
            "Leetcode wrote this",
            "This recruiting season is really getting to you all huh",
            "\n“Beware that, when fighting monsters, you yourself do not become a monster... for when you gaze long into the abyss. The abyss gazes also into you.”\n\n― Friedrich W. Nietzsche",
            "Thought I’m on r/CsCareerJerk",
            "I’m saving this as my cover letter",
            "Consider quitting your job to become a full time leetcoder",
            "10/10 shit post",
            "The first time you become good at a thing be like:",
            "I am starting the journey and I want to reach this level within the next 3 months. Wish me luck",
            "now THIS is last stage capitalism I FUCKING LOVE IT",
            ":hugs:",
            "leetcode is hiring. i think you’d be a good fit.",
            "I thought this was going to be a serious post at first. Very nicely written.",
            "Bro's experiencing segmentation fault in real life",
            "The \"f\" in Leetcode stands for \"fun\"",
            "Hang in there. It’ll be okay. Consider some form of therapy, or get out there and socialize more often, or exercise often.. it helps reduce burnout and it’ll make it easier to continue in the process. It never hurts to seek out help and support if it’s close by.",
            "Touching grass > leetcode",
            "He’s lost, we have to let him go",
            "Tbh, I got into CS due to Leetcode.",
            "Is this https://leetcode.com/votrubac/?",
            "A soldier is down, give him a respect boys.",
            "honestly i found leetcode super enjoyable when i got a  good job and can do one problem a day for fun to maintain my skills instead of having to grind it for interviews. it’s like a daily crossword or brain teaser.",
            "This is what stage 3 of no bitches looks like",
            "you have obviously never crushed your enemies, seen them driven before you, and heard the lamentations of their women.",
            "Some of us should really consider quitting CS to become English majors",
            "Its recruiting season boys",
            "Can you paste your leetcode profile?",
            "Op got high?",
            "Leetcode gave my man Stockholm Syndrome",
            "Monta Vista High School",
            "OP, you wrote this after taking adderall right?",
            "OP has officially transcended to the Super Saiyan mode.",
            "Bro you went off on a tangent about how you dont like reading books, when your post is a damn book",
            "You need a hug dude",
            "Fuck leetcode, give me a real job any day.",
            "A leetcode wrote this.",
            "This is going in copypasta",
            "Then a real world problem came your way, and it was all over.",
            "honestly at some point in our careers we'll have to self talk like this, it isn't always sunshine and rainbows and you still gotta go to work.  Though like someone used to say here, it beats pushing carts at Target.",
            "You ok bro",
            "This is going on r/CopyPasta",
            "I dont know, but it feels like techlead is talking (in a sacrastic way)",
            "Find god",
            "Leetcoding Syndrome RIP.",
            "Leetcode will get boring eventually",
            "Went Cyberpsycho from all that Leetcode-Chrome.\n\nNever use much chrome ,  that  you cant handle, kids.",
            "I can't wrap my head around whether they intended it to be sarcasm or they are absolutely seriously about this post.",
            "How much Adderall have you been taking lately?",
            "I like leetcode. I should do more leetcode or HackerRank.",
            "This gave me an existential crisis and I genuinely cannot find meaning in life any longer. What do I do now?",
            "Leetcode makes me cum so hard",
            "Meanwhile, I haven't done any Leetcode. I feel danger lol",
            "This but unironically",
            "you’re sick. that’s so pointless. better learn some framework or idk lol",
            "Classic case of Stockholm syndrome. All the best fellow leetcoder.",
            "Meanwhile I just solved two-sum after 2hrs. Very proud of myself",
            "dude did all this and admits to losing to 700,000 people 💀",
            "Reading through this thread, I am reminded that my field is filled with neckbearded, autistic basement-dwellers with no concept of jokes or knowledge of what grass feels like.",
            "This is the best post I’ve ever read.",
            "Kid named Leetcode",
            "One night I said some things like this after injecting 4 whole leetcodes. Next time, you should try boofing it.",
            "my dude woke up, and chose sarcastic violence",
            "Ok",
            "This has to be satire right if not someone please help this brother or sister :(",
            "Another cs major with a god complex 🥱",
            "Sounds like a sad life lol",
            "[deleted]",
            "you sire are delusional. Get help.",
            "Intervention time",
            "Make a use out of it rather than just aimlessly solving problems…idk maybe like… a tutor or something",
            "op fell from height",
            "Lol clear big Gs interviews then comeback.",
            "I can't seem ever to love it than producing more meaningful projects.  I always seem to daydream to think that I would code a popular web app like wordle or anything and it motivates me to learn more. Lol",
            "Like Abyss Watchers this dude has turned hollow",
            "This is a joke,????",
            "Leetcode can get u high but wait till you feel exhausted.\nA bit exhausted but will root for you .\nYup ,it’s fun.",
            "For all those on the fence asking if this guy is off his rocker…. I think it’s likely more a commentary on the most basic dev jobs expecting you to know every common algorithm on the spot when all you will be doing is writing CRUD APIs. Like Google isn’t a thing on the off chance you actually need to employ any actual algorithms.",
            "Wish I could relate.",
            "If leetcode was a woman, she would definitely be flattered",
            "Midlife crisis of a programmer \n\nA short story by Throwaway User",
            "Can I ask a question? How on earth you solve this problems and at which speed? I oftend find myself not even understanding what should I do and what should I go for first and each day I'm spending I feel like more and more like Impostor. So yeah feelsbadman",
            "Ugh, I cannot concur.",
            "This could be a great SAT reading passage in the future. Perfect blend of irony, satire, and emotional rhetoric",
            "at this rate this sub is going to put r/cscareerjerk out of business",
            "Wait until 2 years after your first big tech job and you want to hop and you realize you have to do this everytime you want to switch companies",
            "This guy is just Super Saiyan Blue. Leave him alone.",
            "Bro lost his mind for sure",
            "."
        ]
    },
    {
        "post_id": "18ogs2r",
        "author": "Informal_Original404",
        "title": "Name and Shame: MongoDB",
        "url": "https://www.reddit.com/r/csMajors/comments/18ogs2r/name_and_shame_mongodb/",
        "score": 1157,
        "num_comments": 121,
        "created_utc": 1703257047.0,
        "selftext": "Position: Tech Writer \nIm a double major in CS and English so tech writing is exactly what I wanted to do.\nI studied for 3 months on leetcode literally nonstop grinding. I was told I could pick whatever language I wanted to code in. My interviewer said he only wanted to read javascript A LANGUAGE IM NOT THAT FAMILIAR WITH. So I try and keep it cool and I get myself familiar with the code he wants me to debug. This guy is a D1 YAPPER. Will not let me talk through my process, nothing. He keeps on mansplaing a linked list… like sir I KNOW. And I tell him im familiar and he tells me he doesn’t believe I am(?). I tell him I know what it is and that im a JR whose ahead in the CS major so I do know what it is. He then says okay and continues to explain what a tail and head is and so I sit and listen because maybe hes just trying to get me prepared. Finally 25 mins into a 35 minute interview he tells me to begin debugging so I do. He tells me after I deleted a node from the LL i need to adjust the length. Im confused because the code does it already. So i mentioned it but he tells me not to talk back and just do it. So i do it. He tells me to delete it and that I need to trust myself more… Anyways at the end he asks me what I needed to improve so I said learn JS and trust my gut… i blew the other interviews out of the water they were mainly tech writing questions and those interviewers were very kind. I just felt like I was extremely mistreated during that tech interview. I just got my anticipated rejection today where they said it was bc of my tech interview. Im extremely heartbroken but I know there was nothing I could’ve done or had done to make that interview go smoothly.",
        "permalink": "/r/csMajors/comments/18ogs2r/name_and_shame_mongodb/",
        "comments": [
            "He asked you to write a linked list..... in javascript? 💀",
            "d1 yapper is crazy",
            "So yourself a favor please and report him. The guy deserves the sack.",
            "[deleted]",
            "sounds like more of a interviewer problem than a company one. make sure to share that feedback with your recruiter. still, the dude sounds like a total dickhead",
            "MongoDB has one of the worst recruiting processes and most aggressive interviewers. I’ve had a couple friends experience this on the PM and SWE side too (one of them was forced to leetcode in rust!). Sorry this happened OP and I’m\nGlad you’re getting the word out there",
            "This is ridiculous. report him to the recruiter, and if you can escalate it further, please do. That’s a very rude and disrespectful behavior that shouldn’t be tolerated anywhere in this industry",
            "I've talked to recruiters from MongoDB they're very sweet and helpful. I would definitely encourage you to reach out to them and share your experience. That person deprived you of a chance to showcase your technical skills to the company. You'll be doing them a favor, and that person will get a reality check and learn how to conduct a proper interview.",
            "Curious question but during interviews do you guys talk through your process as you code ? I did this yesterday for like every line as I coded but I’m not sure if my interviewer wanted me to just code and not talk. I always thought I should communicate",
            "I’m so sorry that you had such a terrible experience. I really hope you have a better experience with other companies!",
            "sorry to hear that, OP. This is not common, fortunately. I had a very similar experience with one interviewer at Hubspot and Bloomberg.",
            "Surprised hearing this about Mongo, I had an incredible process with them and all my interviewers and recruiter were amazing. I didn’t get the job tho, lacked experience and blew a coding interview:(",
            "Looks like that is an interviewer-specific issue. I was in the recruiting process for MongoDB recently and it was nothing but smooth. Sorry about this!",
            "D1 yapper😭😭",
            "100% the interviewer's fault you did nothing wrong. It's a huge reason why I hate this industry and am trying to avoid it at all costs",
            "The quality of their people is reflected in the quality of their product. You dodged a bullet there, chalk it up to experience.",
            "[deleted]",
            "i interviewed for them and didn't have fun",
            "If I was told I can interview in any language and then asked to use a specific language that isn’t on my resume, I’d hang up the phone on them",
            "Fuck Mongodb tbh, they’ve done some shady shit around how they’ve marketed their DB (look up the Jepsen tests) and NoSQL is a fad that took too long to die.",
            "why does the interviewer sound like how an indian mass recruiter would lmao (3600$ a year)",
            "Sounds like someone with no social skills suddenly has to interview people to keep making money lol",
            "MongoDB SWE here.\n\nI'm sorry this happened to you. FWIW I think most places that hire from college just have a crappy process and I don't think MongoDB is any different. I personally don't know the interview process for technical writer as I'm on the SWE track but you clearly went through a terrible SWE interview. Have you tried reaching out to your recruiter and telling them about that interview?\n\n>!D1 yapper was gold btw.!<",
            "This is totally the interviewer, not the company. If you feel up to it I would send the recruiter a message",
            "Use paragraph breaks ffs",
            "The interviewer sounds like a *oron!!!",
            "Which round was this? I went through the MongoDB interview process and when I went through the karat interview portion (3/5 round) I got a really unprofessional dude who kept cutting me off every 5 seconds while I was trying to walk him through my ideas and code. He kept rushing me like he had somewhere to be. I know that’s not mongodb’s fault since the karat interviewers are chosen at random, but it was still annoying and discouraging to go through that.",
            "Mongodb is dead tech anyways. Never using them again.\n\nEdit: See I'm getting downvoted by the mongo shills rofl",
            "This reminds me of my experience with Facebook. I chose to write code in python. My first interview didn't know python, and he kept questioning the syntax. He made me feel like I was lying that python didn't require specifying data types for variables.\n\nA later interviewer told me he wanted me to code my solution in C++. I told him I don't know C++ and I don't have it listed as a language I know anywhere like on my resume. He just said \"oh, ok\". I ended up doing it in python.\n\nOf course, they end up rejecting me.",
            "Tech writer will be extinct soon due to AI",
            "Do they teach you about paragraphs in your English major, or is that an advanced topic?",
            "[deleted]",
            "You majored in English but didn't use a single comma in this post...",
            "I can't imagine arriving at an interview and being told I'd have to code in a language I have no familiarity with AFTER being told I could choose any language. \n\n\nYou said you were a woman, I honestly wonder if you have a discrimination case here. You might get a free consultation with a lawyer and see. They might be able to get a subpoena and find out if anyone else was treated the same way in interviews, you might have a case. \n\n\nI am not a lawyer, but I watch a lot of YouTube shorts from some guy who is an attorney who specializes in wrongful termination and stuff like that. So I am *pretty much* a legal expert at this point.",
            "If you’re a CS major you should definitely be familiar with JavaScript",
            "Grow up a little. Move on. We all get mistreated during interviews.",
            "The biggest lesson I hope you got from this is that you spent 3 months grinding away on Leetcode problems much harder than the one you saw in the interview, which you \"failed\" on.\n\nWhatever reason they had for you failing that technical interview likely has nothing to do with the technical details that you spent 3 months obsessing over.\n\nI have no idea if you could have passed this technical interviewer, but you are making a mistake by just blowing this off as you being somehow perfect but still failing. There is clearly something you are missing here that probably has nothing to do with technical details.",
            "I recently had to write a linked list in JavaScript because the interviewer wasn't satisfied with me using a hash table with TTL values for setting up a cache.",
            "They give you coding tests for a writer position? Tf?",
            "Yeah… ur interviewer is just terrible."
        ]
    },
    {
        "post_id": "15ggraw",
        "author": "Apprehensive-Let3181",
        "title": "I secured an internship at NASA!",
        "url": "https://www.reddit.com/r/csMajors/comments/15ggraw/i_secured_an_internship_at_nasa/",
        "score": 1155,
        "num_comments": 149,
        "created_utc": 1691001064.0,
        "selftext": "Hello fellow CS majors. I am a non-traditional student (took a multi-year break), and this year has been the toughest job search I have ever had. I was losing hope, but it happened, I got an offer from NASA! This is seriously one of the most awesome moments of my life, and I kind of want to share it with everyone.\n\nEdit: Thank you, everyone! If I don't respond, sorry. Them DM's be poppin as the youth say these days.",
        "permalink": "/r/csMajors/comments/15ggraw/i_secured_an_internship_at_nasa/",
        "comments": [
            "Don't boast on twitter about it with poor language, that doesn't end well. :)",
            "You should tweet about it in a very affirmative way!",
            "Hell yea! That’s so sweet, that’s one of my dream jobs 🚀\n\nPs. Sent you a DM would love to hear about how landed this",
            "Can you tell the process of application?",
            "Congrats!! That’s amazing!!",
            "Congrats! For which term?",
            "OMG congratulations!!!! NASA is my dream but I haven't been able to secure an internship. Was there anything specific that helped you stand out?",
            "Also a nontraditional student interning with NASA",
            "It requires citizenship correct?",
            "NASA is the one company I will always trust to ghost me",
            "Grats! Everyone I know that interned at NASA went on to be successful",
            "Congrats good job!!",
            "I wish to be at NASA someday!\n\nWhich location did you go for, and the position?",
            "Do you know what software engineers generally do at NASA?\n\nWorking at NASA sounds like one of the most awesome things. If I ever become a US citizen I'd probably try and get in, even if there's a slight pay cut.",
            "How long after interview did you hear back?",
            "As someone finishing up my internship at NASA — you are going to have such an incredible time! Make the most of being on a campus full of the some of the most talented people in the country.",
            "[deleted]",
            "As a returning student this gives me hope haha. Mind if I ask how long your break was?",
            "W",
            "Congrats! Is it for fall or spring ?",
            "Congratulationsssssssss! Make the most of it!",
            "Big time. Congrats",
            "congratulations!!!(:",
            "[deleted]",
            "Do they hire entry level/new grad",
            "Hell yea! Great job 👏",
            "[deleted]",
            "Yay! Congrats!",
            "🥳 That’s what’s up!",
            "Congrats! All the best!",
            "HAPPY AND PROUD OF YOU BRO!",
            "Congrats",
            "Congrats!\n\nFucking nerd I’m gonna shove you in a locker!",
            "Hey guys, we found the intern who fucked up Voyager 2's antenna!",
            "Congratulations! Make sure to celebrate :)",
            "Congratulations!!! That’s so awesome, I hope you excel in this path! ☺️👏",
            "Congratulations space boy 💜",
            "Congrats",
            "congrats!!",
            "Congrats! I'm in the same situation as you. Graduated in December and recently accepted my dream job at Lockheed Martin. \n\nWish you nothing but the best.",
            "Hello I am also a Non-Traditional student and this provided me a lot of joy seeing another Non-Traditional Student achieving such a high achievement!! Congratulations",
            "Congrats, I’m very happy for you yayyy",
            "Congrats. What an achievement!",
            "For what center buddy? I’m an intern too at JSC 🚀",
            "I see that the number of upvotes goes up and down, i mean who are those sore losers who downvote someone else’s success.. wtf",
            "Awesome that exciting .. now get yourself a seat inside",
            "Congratz",
            "Wow, that's great... slide me a referral please",
            "Congrats!! Don't forget share you experience after you're done!",
            "Stop posting about it on social media. Be private, don’t risk losing everything by accidentally violating policy, Ambien posting, getting hacked, getting stalkers, haters, etc.",
            "You mean space X? What's NASA?",
            "TC or GTFO",
            "What internships/projects/etc did you have",
            "Congrats man! Pathways?",
            "n o t   s k i l l   i s s u e",
            "Oh wow amazing! How did you do it? What experience did you have?",
            "Would love to know as well!",
            "Pathways?",
            "So which topics and technologies did you learn for the internship?\n\nIg it won't be the regular html, css. \nCan you explain OP?",
            "How'd you do it?",
            "."
        ]
    },
    {
        "post_id": "szol6f",
        "author": "INTCINTCINTC",
        "title": "My Prestigious Girlfriend is Breaking Up With Me because My Internship isn't Prestigious Enough",
        "url": "https://www.reddit.com/r/csMajors/comments/szol6f/my_prestigious_girlfriend_is_breaking_up_with_me/",
        "score": 1146,
        "num_comments": 126,
        "created_utc": 1645641709.0,
        "selftext": "I'm currently having a mental breakdown. Six months ago I finally found the perfect girl whose internships' prestige matches mine (Hudson River Trading, Two Sigma). Obviously, my internships are just slightly more prestigious (Jane Street, Citadel), but close enough. However, this internship season, my girlfriend got into Jane Street while I didn't get a return offer. Obviously, my supervisor was threatened by me and afraid I'd take his job. I've had to settle for interning at Google Brain (eww) and now my prestigious girlfriend wants to break up with me. She says she's found another guy who has interned at every single trading firm every summer since middle school. How do I win her back?",
        "permalink": "/r/csMajors/comments/szol6f/my_prestigious_girlfriend_is_breaking_up_with_me/",
        "comments": [
            "Try to get a reservation at Dorsia, that should be enough for her to come back",
            "Grind LeetCode",
            "Dw about her king, she's for the Jane streets",
            "Well, there is nothing you can do - you are just not good enough",
            "Apply to be a janitor at Jane Street. She’ll take you back.",
            "Buy the company",
            "Do the plot of Wolf of Wall Street but automated with machine learning.",
            "Get an offer from Rentech or Radix.",
            "This is a great shit post",
            "To be prestigious it takes, strength, cunningness, patience, and the will to do whatever it takes to come out on top. \nIf someone dares to try to replace you, you don't back down. \nYou make sure they won't ever make such a foolish mistake again. \nFind that other guy, study his interests, his friends, what he holds dearest to his heart. Then ,slowly, methodically, destroy his pitiful life from the inside out, bit by bit, insignificant piece by piece, till he is but a shell of his former self. \nTo do so secure an internship at the same company as him, keep tabs on his every move, his every interaction,  befriend him, meet his friends, gain his trust. Then start small, gain access to his computer, leave invisible characters in his code, delete his documentation, leave style errors in his code, turn off dark mode in his ide. Then move on to bigger things, scramble his files, uninstall his libraries, push buggy code on his git repositories, give dumbass advice on his Stackexchange accounts. Then finally after putting him through all that: delete his linux distro with his custom desktop, his VMs and reinstall windows.\n\nOnce he is  without meaning, without hope, without love, watch him crumble into dust with a cold, calculated smile on your face.\n\nNo one will ever replace you,\nand if they try they'll regret it.\n(and probably end up using windows)",
            "just apply for your jane street supervisor's job",
            "She belongs to the streets🥵",
            "I think you never touched a woman before",
            "Focus on yourself King 👑",
            "Try crushing on her best friend and take her to the exact same places and activities you went with your ex, but kicked up slightly up a notch to stoke her jealousy circuit.  Rinse and repeat with her entire female Facebook friend list 😎",
            "Go find God \n\nCome back when you find God",
            "go gay bro",
            "She had every reason to do so! Google Brain? Seriously? Are you mentally challenged or something?!",
            "DISREGARD FEMALES. GRIND LEETCODE. 200K+ TC OR DIE. FAANGS GET TO BANG. LOW TC = VIRGIN OP",
            "Leave her. Focus on yourself young king 👑",
            "In my personal experience, the best way to win a girl back is to grind leetcode. You can do it, chump(champ)!",
            "You need to go the nuclear option and make an onlyfans account for your feet. Prestigious bitches love men who take pics of their feet for money",
            "Forget her bro. If she’s with you for the money or prestige you’ll have a terrible life because you’ll constantly have to keep up with her expectations and if you didn’t then she’d leave you for someone else. She sounds boring and not worth your time. There are women out there who’d just be thankful you have a job not to mention a great one and they’d treat you like the king you deserve to be treated as. While it seems like your ex is your whole world, she’s not. I’ve gone through a number of heartbreaks and every time I felt that there wasn’t anyone left, someone would show up out of no where and be far better than the last girl I went out with. Keep your head up, work hard, and the right woman will find you. Congrats on your internship and be proud of your accomplishments.",
            "nice try",
            "These aren't funny any more. Get a new joke.",
            "Nerd",
            "based gf",
            "Dude just give me her number, let me help you get her",
            "Do yourself a favor and don't",
            "Get an offer at Burger King, king.",
            "Head up and know your worth king 👑",
            "You will someday look back at this day and know that this was one of best thing that happened to you\n\n**True love is unconditional**",
            "Stop this BS . What's prestigious working for a corporate as a slave?",
            "[deleted]",
            "\"Perfect\" but she doesn't care about you, just how prestigious your internship is?\n\nSounds the opposite of perfect to me tbh",
            "Damn fr, she wilding lol cause not many people are in cs majors, she a little pretentious",
            "There is no perfect girl. There are plenty of hotties chilling everywhere, especially in miami. \n\nGet laid more and you’ll realize that women arent that special, and they have flaws just like everybody else",
            "[deleted]",
            "Google Brain > Two Sigma\n\n/s",
            "She sounds super shallow and only seems to like you for your money and status. Why do you even want to be with her?",
            "I don't think your life is worth living now. You just lost the only two things that matter in life - a job at Jane Street and a girlfriend with a job at Jane Street. Just end it all bro.",
            "This has to be a troll or meme post, but if not, anyone who leaves you over prestige never loved you to begin with. Sorry Champ, you cant win back love that never existed in the first place.",
            "Just my opinion, but this relationship sounds toxic.",
            "you sound like such a loser, struggling to believe this isn’t a troll post",
            "> I'm currently having a mental breakdown. \n\nSoz, bro.\n\n> Obviously, my supervisor was threatened by me and afraid I'd take his job.\n\nO…kay. If I was your supervisor, I would not be threatened by someone who will have a mental breakdown over his gf or his oops I didn't get the job.\n\nAlso can't help noticing your repeated use of 'obviously'. No, it isn't obvious at all. I hereby grant you an internet diagnosis of \"paranoid with delusions\". Grandiosity, feelings of persecution- it's all there.",
            "Sorry that happened.\n\nBut she’s not worth it. Breaking up with you because she got x internship and you didn’t is stupid, elitist, and smells of golddigging. You just saved yourself from paying in divorce court.\n\nA real lady will stick with you through thick and thin.",
            "Get the fuck over the stuck up cunt\n\nShe'll leave you for him now, she'll leave for him in 15 years and take half your money \n\nFind a good woman and quit fucking with evil stuck up bitches",
            "You don't want to be with her, it's good this happened sooner rather than later",
            "You cannot. It’s kind of like how two negative charges repel one another. Two sociopaths do not a pair make. 🤵‍♀️🤵‍♂️",
            "Um if someone breaks up with you over that, then move tf on. Why kill yourself trying to figure out how to get them back? And did I read correctly it's been 6 months? Take your blessing and RUN.",
            "Dude what kind of advice do you expect here? Not to be disrespectful, but obviously people will tell you that she's not worth your time or some kind shit like that, which seems pretty true",
            "why are you both having a competition on who is going to get the better internship? Relationships are meant to be a team effort, it shouldn't matter who gets the better internship. If your girlfriend wants to break up with you because of this then there can only be two possible options. Either you talk to her face to face and tell her that your relationship is not going to a place where you like it to go, or you break up with her. It is a huge red flag when either one in the relationship has to be based on career competition.",
            "Y’all worried about labels too much",
            "You don’t.",
            "Lol, this feels like a joke with no punchline.\n\nMove on bud, live your life king.",
            "Show up to her place in all Patagonia",
            "An internship at MindGeeks would do ... It is the biggest company out there",
            "I have never heard of these firms. Why are they prestigious?",
            "1 leetcode a day keep the Google Brain away.",
            "I briefly thought this was CrusaderKingsMajors and clicked on it bc it was the greatest shitpost ever.\n\nHoly Jeevus. What the actual fuck.",
            "Computers were a mistake",
            "Well that’s elitist and shitty.",
            "I’m ded did you just say you ‘settled’ for Google I’m screaming",
            "Jesus: is this real life, or a computer game?\n\nEither way, dump the golddigger.",
            "Someone told this to me in my hard times and I'm gonna just pass it on to you, \"Fuck her dad.\"",
            "Master Compression; become the Pied Piper.",
            "Be rich. Buy the bank",
            "Pretty lame shitpost",
            "Dump her. \n\nShe belongs on Jane streets",
            "Wake up",
            "Get a PhD in a few months and apply to Albertsons. If you are lucky you might get an intern position.",
            "You don't. Or I should say you shouldn't. She seems to care more about your status than you as a person.",
            "Is this a joke?",
            "I think I'm finally done with this sub",
            "This a joke right?",
            "damn women amirite",
            "Tell her she got in as a diversity hire. Instant trigger.",
            "MOVE ON!  It seems like y'all would have marital problems.  Those kinds of people are folks you don't want to be in a relationship with.  Appearances ultimately don't matter.",
            "You don’t. Might not be able to see it now but you’re better off ditching her now instead of waiting 10 years so she can do it to you again for some obscure, pointless reason.",
            "You don’t, you grow up and move on.",
            "Seduce her mom and  fuck her mom and whisper to her mom her daughter s a bitch. Then leave that bitch and go live life.",
            "."
        ]
    },
    {
        "post_id": "1ayx8fz",
        "author": "darthrector",
        "title": "2023 grad. I'm leaving CS",
        "url": "https://www.reddit.com/r/csMajors/comments/1ayx8fz/2023_grad_im_leaving_cs/",
        "score": 1140,
        "num_comments": 382,
        "created_utc": 1708788679.0,
        "selftext": "I did what I was told to do. I got a CS degree from a top 20 school. I worked hard in classes. I regularly attended office hours and company events. I was decently passionate about the field and never entered it \"just for the money\". I didn't have a stellar 3.6+ GPA but I was comfortably in the top 25% of my CS cohort. Literally the only thing I didn't have was an internship as I chose to pursue a double major. And yet after ~1000 apps sent over 22/23, I got 4 interviews (all only through uni partners) and 0 offers. I've read the posts here about getting your resume checked, writing cover letters and cold calling recruiters on LinkedIn. I did that too. But I was an international student so no one wanted me. \n\nAfter graduating I decided to take a gap year and return to my country. All my international friends who delayed their spring '23 grad to December or this May because \"hiring should have started by then\" are in as bad a state as I was in. I gave this CS degree all I had but evidently it wasn't enough. I just paid my enrollment deposit to business school and I'm not gonna look back. I'm obviously gonna use the CS degree as a platform for my career and I'm not gonna disregard it entirely but I'm likely never gonna work in a traditional CS entry-level role ever when I spent the last 4 years of my life grinding for it. Sorry for the rant, I know I have the talent to have a great career regardless but my CS dream is dead.",
        "permalink": "/r/csMajors/comments/1ayx8fz/2023_grad_im_leaving_cs/",
        "comments": [
            "As an international CS major right now, you have to be extremely lucky to have a career in the US right out of school. It really doesn’t have anything to do with your school performance. A couple of my friends who literally have 4.0s had to go back home (couldn’t even do internships). The job market is dogshit and even when there’s job openings companies have a plethora of more than qualified us citizens to choose from. So don’t let that be of any indication of any incompetence or anything like that. We are more than good but just in a shit situation. \n\nGood luck <3 hope it works out",
            "Sorry but I don't understand, why US? Aren't there any good opportunities in EU? I'm also a foreigner and I want to know the reason.",
            "\" I did what I was told to do. \"\n\n\" Literally the only thing I didn't have was an internship as I chose to pursue a double major. I didn't have a stellar 3.6+ GPA but I was comfortably in the top 25% of my CS cohort. \"\n\nWho told you that? It's pretty well known that GPA, Class ranking and degree barely matter in CS. A internship is the most important thing by far, and a double major is damn near useless for job searching. CS is all about experience, if you don't have it then you need to be applying to internships not full time jobs.",
            "Not doing an internship as a CS major is a crime. Who the hell gave you the advice that doing so is a good idea. Most companies in today's environment don't want to spend 6 months training someone new while paying them full time salaries. Someone with a couple of internships under their belt would be productive much much sooner.",
            "I was an international student too, and frankly I don't get how you thought that you would ever stand a chance getting a job in your foster country without even having an internship. \n\n\nMost countries have labour laws that make it extremely difficult for a company to hire a person who doesn't already have the right to work in the country. Companies will typically only make that effort if you prove yourself to be invaluable to them... and how will you do that when you have zero work experience and zero professional references? \n\n\nI'm sorry that the career fairs that you attended didn't inform you that an internship is worth a lot more than a double degree in the tech world, but you really should have thought that through. ",
            "I can’t really feel bad for you internationals when you are so well off to not only pay out of state tuition and out of country living expenses to attend a top 25 school, but also have enough wealth to go into business school right after getting two majors.",
            "Go to the MBA sub, and most people think it's a waste of time and money unless you're going to HBS, GSB, Wharton, or like 6 other schools. Since you couldn't find a job, I'm assuming you're going to a shitty business school where the outcome for MBAs or a finance degree are worse than for CS undergrad degrees from the exact same school.",
            "Can you give me your degree since ur not gonna use it thanks",
            "Man, I remember when 2.5 years ago I decided to study programming through free youtube turorials, started picking up then went abroad in top tier uni as well to study computer science, I though this is the best thing you can study and you can never go wrong with that because everyone will always need technical people. I am now graduating in 1.5 months and I had 1 interview (unsuccessful) after ~500 applications and counting. So yeah I guess I am going back to my country too, because apparently IT market in third world country is booming and thriving, unlike developed countries",
            "> Literally the only thing I didn't have was an internship...\n\nThis is not some minor detail someone can overlook. Even people with internships are struggling. Being international + no internships is a double whammy. It just means you would've had to go even farther to set yourself apart. I still wouldn't say its impossible.\n\nA big part of internships isn't just the work experience, its also the experience you gain in going through the job-hunting process, along with the network you build along the way. Having missed out on all that means you have to start from scratch in the worst job market in a generation.\n\nSo learn from your mistake and make sure you do an internship in business school, and hopefully things will be easier next time around.",
            "You are only 23 and alive",
            "Looks like it’s an informed decision, I think you made a smart choice, an even longer gap on your resume would make things even harder down the line. There are quite a few people I know who do night-time MBA while being a SWE, honestly I don’t how much it helped them, last time I checked all these people are still just IC",
            "The \"CS dream\", as it were, is dead for just about everyone in the market right now. CS has effectively been a series of overlapping gold rushes: the personal computer, video gaming (arcades, then home consoles), the internet, mobile computing, adtech (also known as social media or web 2.0), and now AI. Entrepreneurs made so much money in the previous gold rushes that they wanted to participate in the next one, and hoarded smart kids who could code like lottery tickets.\n\nThat'll probably come back, but, much like the dotcom crash, there's a big market correction to work through first.\n\nYou're making the right bet here, by trying to be the entrepreneur that makes it big in the next wave, not someone who's looking to ride the rising tide. The business knowhow and interest will give you an advantage regardless of what part of the software industry you end up in. You're angling to be more like Bezos, Jobs, and Gates, and that's a good angle. Best of luck!",
            "I’m sorry but you bought into the hype. International student, CS major, top university. Literally the play book of the last few years. You got a LOT of competition",
            "Don’t listen to the naysayers. A combination of CS bachelors and MBA is a potent one that will land you wonderful jobs at the end. Congratulations on finishing your degree in a top CS school with respectable GPA! I’m glad that you realize that under a different circumstance (if you weren’t international, or if the market is better) you would be snatched up like a hot commodity. This is the kind of stories I like to read: You: Worked hard > Applied to many jobs > No luck > Change course. Instead of putting all your eggs in one basket, you took charge of your fate and give yourself other options through MBA. Your CS will always come in handy. I know lots of consultants with a CS background. And if you want, you can always go back to coding once you’re in a company (through internal transfer). I know a guy who did that too. Thank you for the great post!",
            "Mate, you do realize.... the h1b is a lottery, yeah? Even if you do get offered a job after your business degree, there's still a >70% chance you won't get offered a visa because of sheer luck.\n\nDoing another degree right now seems like financial suicide. I'd just go back home, get any CS job whatsoever and keep applying for US jobs until you land a visa.",
            "You are an international student. Unfortunately almost no one wants an international new grad as a worker in a company in the US, you might fare better in your country with a US degree",
            "Sucks to hear that but you shouldn’t give up just because you can’t find a job here. You have your home country to go back to. Don’t know why everyone is so insistent on finding a job here ; I guess it’s cus of the higher salaries \n \nMost of us here couldn’t even afford to go study abroad so either you’re well off or you have some scholarships somehow. You say you didn’t enter the field for money yet you’re insisting on getting a job here. Why ? \n\nAt least you can find jobs in your home country. What about us citizens who can’t even find anything ?",
            "My situation is just the opposite. I’m coming from a business school but I’m now a CS degree. Not discarding the Business Degree entirely but using it as a leverage for my new CS work life.",
            "Have you considered pursuing a masters? I really doubt pursuing an under grad business degree at this age will help you. Even if you’re talking about an MBA I don’t think that’ll help either as you have no experience.",
            "Yeah as we should prioritize US citizens.",
            "I'm getting my degree in Software Engineering so when I graduate I'll go right into being a plumber. I don't want to be fighting 10,000 candidates for a job that pays just ok.",
            "Dude please don’t. It’s gonna be worse for you. Business is VERY over saturated",
            "I think you're making the best decision you can make for yourself right now. Your CS degree won't go away and it will bolster you when you apply for other jobs. People respect a CS degree from a top school whether you're applying to be a business manager or an art director. You will get respect and it will open doors for you.\n\nIf you genuinely enjoy CS, then keep making projects for your own enjoyment and maybe one day you'll make a connection and get back into it.",
            "And this is why I harp on about getting an internship. Anecdotal story coming up but it’s not uncommon, so here it is: \n\nThe diploma is nice and will elevate you for consideration, but the value of the experience is way more important. I’m a recent CS graduate and have been interning with the same company for about 8-9 months, and have recently been confirmed to be receiving a full-time offer from them mid-March (though it is always a bad idea to stop looking around for other opportunities without the actual offer in hand, mind you), and I feel I have improved so much in the time I have worked for them, which will reflect on my resume if I choose to not accept their offer (I will, but I’m being hyperbolic). The software world and the college world are only aligned in the fact that you know something about coding, but they require different levels of understanding of it. This is all to say that OP messed up not trying to get an internship, which connects you to so many people who can give you opportunities. OP placed too much emphasis on the schooling and not the practical elements of getting a real world job. Also, as a side note, many of the other interns that I have worked with were international, so it’s not the only thing limiting OP. I also work with many other full-time internationals as well, and have shook their hands on U.S. soil. Every “No” you get is one closer to that “Yes”, OP.",
            "Homie I’m not even gonna lie but if you could afford to pay out of state tuition for top 20 school, living expenses AND just give up on CS to go to business school (after looking for a job for like what, 6-7 months? In the market with high interest rates) you’re pretty loaded and I’d wager you’ll be alright.",
            "Feels bad for you bro, hopefully you can get a great job out of CS.",
            "Omg that’s literally me besides I’m not an international. 1000 applications with only 4 interviews",
            "Anybody that think CS degree will get a tech job, I am very sorry but thats not true. CS degree does not prepare any one for a CS job. If you have the money and time then get the degree theres no harm but rmr you will get hired for what you taught yourself outside of college. Learn 2 good languages, few frameworks, do some homelabs, get a certification or two. Learn fundamentals of networking, cybersecurity, DSA, understanding of Linux, windows server. \n\nIf you’re interested in development, make sure have few of your own robust projects and not just tutorial dummy projects, learn SQL, NoSQL, data processing. \n\nAfter a CS degree if you are struggling to get a job, get the CompTIA A+ and look for a help desk position. \n\nPlease don’t think getting a degree will get you job. I quit college cuz of how ridiculous their teaching system is and how outdated their syllabus is",
            "The job market is bad and when I read these posts about education and gpa and stuff no one ever mentions their soft skills and outside of technical interviews, that is what will get an employer to want to move forward with you.",
            "Sorry but I have no sympathy. I’ve seen time and time again of thousands of American SWEs getting laid off and replaced with overseas SWEs all for cutting cost and it’s absolutely unfair. Apply in your own country, it’s already costly to get a cs degree and being unemployed is a death sentence.",
            "I was going to leave a comment but after reading through a few I'm glad to see that other U.S. citizens feel the same way I do.... so I won't go into detail about it but in short, sorry to hear about your struggles but I'm glad to hear that US companies aren't COMPLETELY outsourcing everything to international students. Between AI and overseas labor, U.S. citizens are really getting fucked while the big corporations cut costs. Why pay an international student in the U.S. and have to sponsor them when you could pay an international student a third of what they would make in the U.S. if you just hire them in their home country? International students come here for the quality of education and for the opportunities this country provides with ZERO allegiance to the U.S. To be fair, if international students want to live, work, and become a citizen here legally... I'm all for that, and I'm all for them reaping the benefits of the U.S. economy. But don't come here and EXPECT anything beyond what you paid for if your intention isn't to be an American citizen and contribute to the country you benefited from.",
            "At this point cs degree doesn’t compete with experience. It’s pretty much any other science degree and only useful if you plan on getting a phd",
            "Yea no joke you only got 4, and that’s generous of them to give those to someone thats in it for the money and because he did what he was told to do instead of what he actually wants. CS is not just about the degree or the money, it’s about passion that includes side projects, diverse knowledge, and true at heart problem solving",
            "Doing MBA or Ms Management will make it worse, especially without job experience.",
            "“I did everything except focus on CS. My GPA was unimpressive. I double majored instead of looking for an internship and I also took a gap year”\n\nYou’re not very passionate about the field if you didn’t realize that experience trumps a piece of paper. You talked 0 about what you’ve built, things you learned. You went to school and that’s about it. In a tough job market it makes sense to pass your resume since you don’t bring much to the table.",
            "You took a gamble with CS, now you are taking a gamble with Business Education, nothing is promised in the future, if you are not putting in time and moves to get a CS job, it will happen with Business Job,",
            "I feel so bad for the international students who have enough money to study in another country for 4 years and then can’t find a job to sponsor them here and have to go back to their home 🥺",
            "CS is jus not for international students rn.",
            "Enrollment deposit into business??? Lmao",
            "Going to business school with 0 work experience seems like a dumb idea but you do you.",
            "I’m a junior in HS, and this subreddit is making me reconsider my major and dream to get into a healthcare tech job. Anyone else know any majors in demand for an introvert that still pays at least 70-80k out of college?",
            "I'm more inclined to think the op just sucked at CS. Go through 4 years and not to attempt an internship and then feel entitled that some company should hire him because he has an average GPA with no relevant work experience. I'm glad he's going to business school. It's one shitty dev I don't have to waste my time interviewing to find out all they were ever good at was test taking. Schools in other countries train students to be good test takers. People come to the US because we teach people to be thinkers and use their imagination. Bye",
            "I’m really interested in how your leetcode profile looks like. Somehow makes me feel like you never were passionate about it",
            "Bro I know what you’ve been through but you should try to place yourself for example take a boot camp in data science or your can learn cloud engineering maybe try to get into cybersecurity as a pen tester or cloud security engineer you would find some opportunities for sure even in USA and EU as Japan and Germany have declining populations they are asking for skilled IT workers you can even check New Zealand as well.\n\nDon’t ever lose hope.",
            "Literally the most important factor to landing a job is having an internship experience, and that’s the one thing you neglected.",
            "Double major instead of internships sums it up",
            "I personally dont know any top 20 schools where top 25% is not 3.6+… Mine is also a top 20 school, and I know 3.87 was where the cutoff was for top 25% because that was exactly what it took for a cum laude. With that said, GPA doesnt matter in the field indeed…",
            "No internship no job. It’s that simple",
            "ctrl-f \"international\"",
            "Skill issue",
            "I have no sympathy for international students. “I have enough money to pay for a full ride, and am only coming to the US to take the jobs of real Americans” \n\nGo back home",
            "![gif](giphy|xT9DPuMFeilLak0VAA|downsized)",
            "Why do you not have any side projects? I assume this has to do with the double major taking up your time but besides personal side projects weren’t there projects in your classes you could mention?",
            "CS in the US currently reminds me of when i graduated and wanted to get into copy writing and technical writing around 2010. if you don't have a portfolio to display work, its gonna be tough. the ironic thing is i slowly worked my way up the ladder and landed in IT eventually anyway (wish i got an IT undegrad instead of english lit) but now i'm getting my masters. \n\nIt's a bad job market, i'd try and do what others said, focus on a stack section, get a jr dev job even if its in EU, and maybe make a github to show your work. in general though the field got saturated, so don't be afraid to pivot. even if you no longer code you might land a role working with those who do and your backend knowledge will at least help you coordinate with them.",
            "Are u going to b school in India or us?",
            "Never skip internship bro. That's literally your future job",
            "Life sucks, but we need to keep our head up. Just keep coding for yourself. Side project somehow will make you succeed.",
            "> I didn’t have an internship as I chose to pursue a double major\n\nso sorry lol but this is why",
            "It sounds like you did what you were told to do instead of what you want to do. That is always a mistake and has always been a mistake.",
            "Which b-school did you go for?",
            "Womp womp",
            "Business schools are not looking very good for internationals right now",
            "This is the 5th post like this I've seen on this thread today\n\nBut sadly, this is reality rn, hope you land a job somewhere else though",
            "I’m in the same situation except I’m not even international and for me it was around 2500 applications with about 10 interviews and those were just for internships. I really don’t know what to do now I’m just living at home I’ve heard there are other jobs that will hire you with a cs degree but I can’t find any specific information on what to apply for and which ones will allow for the best career growth",
            "Yah no internship is kind of a death null at this point and not. Even with internships it feels nearly impossible. Me personally I got two internships under my belt and degree at a top 20 school and I've had 10 final round interviews but no offers. The competition for the handful of roles out there is just insane. Also US citizen btw.",
            "Not getting that internship might have been a strategic mistake. Hard to get a job by cold calling with no inside connections and no experience , even in the best of times, and these aren’t. And if you need visa sponsorship that also makes you less competitive. You also had really bad timing. The market is cyclical and goes through these corrections every ten years or so. Staying in school to wait this out might not be a bad option for you.",
            "Literally feeling shitty about my cs major and I'm only 2 years in, wish I could drop it to learn sales or summ'n",
            "I'm sorry but most other industries are in a similar point.\n\nI'm in mech engineering and all the recent grads are having the same complaints. Some apply to internships just to get experience. I started at well below market just to get experience.\n\nBeing international makes it twice as hard since you'll need to be sponsored.\n\nYou've been looking for a year when thousands have been laid off? I wouldn't expect anything to fall in your lap.\n\nNo one owes you a job. You either go out and make your opportunities happen or wait for someone else to tell you how your life is going to go.",
            "This is legit why I changed from CS to Pre-med. Well, partly anyways. \n\nIt’s just too fuckin risky. The tech industry is too boom or bust for me. Plus, I started to develop poor people habits.",
            "Wait but you do have to have a better second option.  I did a ton of apps too but it's not like I had a better choice; starting a business was and all the other jobs paid worse or required specialized training that I wasn't gonna go pay a few more thousands of dollars to get \n\nI'm sorry you're discouraged, but I would keep at it",
            "Trust me it’s not your fault. Everyone wants senior devs that can hit the ground running and especially grads that have impressive side projects that 100% completes a companies vision.",
            "Sorry if I sound shitty but that little \" but No internships \" is gigantic in getting a job. Even more than a master's degree or multiple majors would ever be. Sorry for you man",
            "First mistake was being in an international in the states lol.\n\nI’m not in the states but i’m double majoring and i’m doing just fine, the absolute lack of self awareness for a post like this to complain, when you have enough money to attend a top 25 school with out of state tuition and THEN go into business school after double majoring lmfao.\n\nSuch entitlement, the major is fine and the field is healthy overall, you can jobs if you just don’t rush for fucking fang bullshit. The problem is people like you expecting 200k offers right out of college after doing mediocre in school.",
            "You know that an internship or work placement is one of the most important differentiators between graduate CVs right?\n\n\nIt is the easiest way onto their graduate schemes and the best way to get relevant experience at your level.\n\n\nIt sounds like you already decided, but for other people struggling: all relevant experience is valuable and even if the pay isn't amazing it will help you hugely.",
            "Well that’s your problem you only join the CS club for the money not because you was passionate about learning and keeping yourself updated on new tech. I’ve read alot of ppl trying to jump into IT just for the money and sometimes that’s very passionate and apply themselves to gain hands on skills will get more opportunities.",
            "I graduated in 2022, worked other odd jobs for 2 years while studying my ass off in my free time. \n\nIn the end I got a job only recently (jan) after i had given up on ever getting a job. So just keep trying and stop looking at reddit it's only gonna make u more demoralized.\n\nIt does suck, but it's still possible",
            "You're supposed to get proff exp during your degree, lol. Job or internship. I don't know who told you school matters for industry, beyond starting it to get access to school/student resources.",
            "internships get you hired … i have family members that are devs that said so themselves. and obviously in the software sector, employers are using software to screen out ppl who are unqualified (or ppl who haven’t done internships) so 1000 applications doesn’t mean jack sh*t if you don’t have an internship on resume. \n\nget degree \nDO INTERNSHIP \nget job\n\nit’s simple… don’t go against the logic lol",
            "Keep Your heads up, go for higher studies and become something like Alan Turing or Edsger Dijkstra!!!  \nThere is so much in CS other than sitting in front of screen 24\\*7 and coding in black screens with 69 coffee breaks (lol kidding). I bet we all at one point or other in our degree wished to be an actual scientist in the field of computers, It is gonna be so amazing !!!",
            "Start your own business or app. Move fast and don’t look back.",
            "do you want to open a fun website/company with me?",
            "If your finances can, go hiking for 6 months, do some volunteering. Join the army reserves or national guard. As long as you do something enjoyable and beneficial with your time, you're winning at life. If it looks good on a resume, even better.",
            "> Literally the only thing I didn't have was an internship as I chose to pursue a double major. \n\nSadly, having internships is becoming the standard and shifts from an advantage to being a hard requirement. Actual experience working the job is the most useful thing you can currently bring to the table, even if \"only\" in the form of internships.",
            "You didn’t do an internship. That’s literally the number 1 priority. What was your other major?",
            "You take a few shit and undesirable jobs, you fight for them and showcase your skills to the people that matter and demonstrate your worth.\nYou get a bonus of 200 dollars for your hard work.\nYou move up to a higher paid job, 30,000 a year. You do that and build up your skills more to get that next higher paying job. \nKeep going.",
            "If you’re done with the degree i could use it",
            "\"Literally the only thing I didn't have was an internship\" which is the most important by far. Go for an internship.",
            "What country are you from?",
            "Purdue is not top 20 in CS",
            "A MBA straight after undergrad? That's a massive mistake."
        ]
    },
    {
        "post_id": "noimg1",
        "author": "benchodechode",
        "title": "Hey all, need help finding an internship for Summer 2039",
        "url": "https://www.reddit.com/r/csMajors/comments/noimg1/hey_all_need_help_finding_an_internship_for/",
        "score": 1136,
        "num_comments": 57,
        "created_utc": 1622403161.0,
        "selftext": "Just plopped out of my moms belly and want to get on the Summer 2039 INTERNSHIP GRIND asap. I started doing LEETCODE and making PERSONAL PROJECTS with Javascript/MongoDB/React/Flutter/AWS/CRUD/FART/FAANG tech stack.\n\nI plan to attend one of harvard/MIT/stanford/cmu/berkley as well majoring in Computer science/math/physics and doing machine learning/deep learning/ computer vision/blockchain/ bio tech research.\n\nWhat else can I do to prepare?\n\nok ciao.",
        "permalink": "/r/csMajors/comments/noimg1/hey_all_need_help_finding_an_internship_for/",
        "comments": [
            "No offense but you should've started leetcoding when you were a fertilized egg",
            "Most of the larger companies have already found interns for 2039. However, you might be able to find opportunities at smaller companies. I suggest to apply to as many places as possible and hope for the  best.\n\nI personally applied to Fourteen million, six hundred and five and got 1 offer.",
            "It's to late you have to take a non paid internship at a shitty startup.",
            "[deleted]",
            "Still considering Harvard after birth? You’re probably screwed. If you don’t end up at a Big 4 there’s no point.",
            "I'm afraid but it's already too late for you. Although you can make a LinkedIn account and connect with the top engineers to discuss the possibility of getting a referral.. but I think their quota of giving referral would have been filled till 2070. \nYou better start emailing Pichai and Nadella.",
            "I recommend learning the programming language Whitespace. Otherwise you’re just a lost cause...",
            "Try your luck at unpaid internships. You’ll be really luck if they give you an offer for $7/hr and unpaid OT. Don’t let these opportunities slip away!",
            "You should have started grinding leetcode as a sperm cell.",
            "this is the dystopian future of r/cs-majors",
            "You're already behind. Literally the moment I was conceived, I began studying Leetcode Easy and by the time my hands and feet were fully developed, I was grinding Leetcode Hards. Because of this, I was able to get an internship at Amazon (3 return offers), Facebook, Netflix, Google, AND Tesla -- all before I was in middle school. Sorry, kid, you're gonna have to do better -- A LOT BETTER.",
            "Dude all thse computer science grad want to graduate at the top univisserity and apply to FAANG. but there are like 100x more people that just want a coding job, and it doesn't have to be a prestigious company, nor graduate from a prestigious university. I'm one of those people.",
            "Yall are too much 😂",
            "How many times will the same joke be made on this subreddit?",
            "Nah apply for Summer 3000. I know they opened and currently interviewing candidates.",
            "Im all for this kind of shitposting but this has been so overdone. Bring back quality shit posts.",
            "It's better , just try to make time machine",
            "Props man, the tech stack part made me LOL 😂",
            "Amazon",
            "If you’re in the midwest just walk in the door and they’ll throw internships at you (assuming you can walk)",
            "Create a startup now.",
            "Man you're late... should've grind leet code when you were a sperm, else you've missed the train",
            "It's too late, you should've been solving LeetCode hards and should've already finished with 3 major projects when you were being conceived.",
            "FART",
            "Ngl man it's gonna be tough. You should've started as soon as you were a zygote. Why'd you wait till being born to start grinding. You're 9 months behind already",
            "Too late, journey is going to be horrific."
        ]
    },
    {
        "post_id": "16ilg2s",
        "author": "Davidlikesboys",
        "title": "Got my bag",
        "url": "https://www.reddit.com/r/csMajors/comments/16ilg2s/got_my_bag/",
        "score": 1140,
        "num_comments": 167,
        "created_utc": 1694705437.0,
        "selftext": "Spring 2024 grad from a barely top 100 college. Just got my Google new grad return offer. Been on this subreddit for 5 years now and my best advice is don’t listen to all the people complaining, start leetcoding, work on being able to speak and explain yourself well, and apply to a fuck ton of places. also i’m first gen college, my family’s poor, i got no internal references and i’m not a diversity hire so don’t cope lol.",
        "permalink": "/r/csMajors/comments/16ilg2s/got_my_bag/",
        "comments": [
            "\\> best advice is don’t listen to all the people complaining \n\nYep.",
            "Goat 🐐! Good luck man.",
            "Ur post history reflects it. Very very cool. We up",
            "Has google internships tells everyone not to cope. It's also a 2024 return offer. Like congrats dude but you getting a return offer for next year after already having two google internships doesn't mean people complaining about not having jobs this year is invalid. *Just try harder* is a no shit take. That's the problem people are complaining about.\n\nEdit: OP isn't even matched yet",
            "RemindMe! 1 year to see if this guy actually team matched lmao",
            "congrats!! is this PA-based offer? I'm in in the pipeline myself but still waiting for next steps :(",
            "AAAAAAAAAHHHHHHHHJHJ",
            "Congrats! How did you prioritize the different things? Like did you ever do more focus on leetcode, or at first made sure you were able to speak on your resume very well with star? And then for projects what was the priority level for that, considering that you had previous internships? For me I’m struggling a bit for applications since a lot of positions aren’t for juniors so I kind of ruminate on whether I should customize an application for those or only target juniors, and then I’m split between working on my personal website/CRUD project practice and leet coding. I have 2 4 month internships, would appreciate any advice",
            "Congratulations!! May I ask when your internship ended and where(NA, EMEA)?",
            "No one’s a diversity hire lol. We all deserve it. Congrats Champ!",
            "Sigma energy",
            "OP you were a sophomore last year, so you're a junior this year, how did you get a full time offer?",
            "Congrats and Good luck!!",
            "Good on you mate. For real congratulations:)",
            "damn swe offer at google is legendary. not alot of people are making 150k+",
            "https://en.m.wikipedia.org/wiki/Survivorship_bias",
            "What's your starting salary?",
            "> return offer\n\nThere you go. You probably have 5 faang tier internships. It’s not bc you can leetcode and we can’t, it’s not bc you can “explain yourself” and we can’t. It’s all momentum.",
            "Did you get PA matched? Or you just passed HC?",
            "Hells yeah, congrats!!",
            "Congrats to you my man! Awesome stuff!",
            "Congrats! I was in your shoes a couple years ago (my Noogler hat is right beside my desk right now) and was incredibly excited too 😂. But this is likely only a small milestone in your longer journey - things can go even better from here if you work on the right problems with the right attitude!",
            "Projects?",
            "You killed the vibe with the dumb “diversity hire” comment but other than that good job. \n\nNo company is going to spend the considerable resources required to hire someone who can’t carry out the job responsibilities, so this term “diversity hire” is not only fundamentally sexist/racist but also just flat out ignorant. Time for y’all to grow up and retire this one.",
            "the diversity hire comment was supposed to be more satirical then anything. I don’t believe in diversity hires, I was trying to say that people just use the term diversity hire to cope, sorry for the confusion. Also, i know HC pass isn’t guaranteed hire, if i thought this would blow up i would of dove deeper into my situation. I’m just tryna say i’m lit asf and proud of myself and all of u guys can achieve ur dreams! Never give up!",
            "Which location",
            "I’m not first gen college but I’m first gen college and actually using my degree for a relevant job in my family and I’m in FAANG out-earning all but 1 relative amongst 20 people or so at age 27. Life is good",
            "> \"... so don't cope lol\"\n\nBloke said, \"git good\" 😂😂. \nCongrats on the opportunity, godspeed as you begin.",
            "Sounds like you’re still a minority.",
            "diversity hire is still an employment regardless.",
            "I will ignore this post if you are an Indian or Asian",
            "grats homie!",
            "Eyy congrats! 🎉",
            "What kind of internships did u have?",
            "Congratulations man!",
            "Did a recruiter talk to you on campus? Im 4 yoe and i’m afraid my cv will get filtered forever before I even get a chance to interview once i’m done preparing",
            "Great work! Happy for you :D",
            "really needed this. congrats brother!",
            "Yo duder I'm hella proud of you, get shit done!",
            "AHHHHHHHHHHH",
            "What’s a diversity hire? Is that like a CS definition or inside terminology? This is a genuine question with confusion by the way",
            "Good shit bro congrats and thanks for posting this.",
            "Huge",
            "What does top 100 mean in this context? People here say it a fair bit but I'm never sure. Is it just the US or globally? Just based on cs or the school in general? Just based on general prestige, or something more specific?",
            "It’s amazing what some average soft skills can do in this industry lol",
            "yo can you decline it tho? i’m recruiting for new grad and i could use an extra spot when they open up. thanks.",
            "If you don’t mind saying, what was the offer?",
            "grats king, well deserved W",
            "Good shit",
            "mad respect brother, Hopefully I get a job at maang too!!",
            "Can I see your resume?",
            "You are not free and clear yet. These days the rule for new grad offers is two is one and one is none. Rescinded offers, delayed start dates, and lack of headcount are all too common these days and there is no way to predict which company will be the next one to pull the rug.\n\n\nSource: I signed a return intern offer that was later rescinded from one of the top 4 upvoted companies in this thread (https://old.reddit.com/r/csMajors/comments/16e9xli/list_of_companies_that_have_rescinded_offers/).",
            "Congrats, I'm really close to graduating and just hunkering down and trying to get one more internship before then."
        ]
    },
    {
        "post_id": "15rjrhx",
        "author": "mr_streebs",
        "title": "I did it",
        "url": "https://i.redd.it/9fpvsdflq7ib1.jpg",
        "score": 1128,
        "num_comments": 64,
        "created_utc": 1692078677.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/15rjrhx/i_did_it/",
        "comments": [
            "Nice, what area will you be driving in for UPS?",
            "congrats - May your code be simple to read and easy to fix.",
            "I suggest not putting off the job hunting for too long, its a tough market out there for new grad/entry level workers. Doesn’t hurt to put in a few applications between commercial breaks or match making. Congrats and hope you find career success soon bro!!",
            "Congratulations 🎊.\n\nWhat’s next for you ?",
            "W",
            "HARD WORK PAYING OFF LETS GOOOO CONGRATS",
            "[removed]",
            "HUZZAH MY OLD CHAP! WHAT EXCELLENT NEWS",
            "Congratulations be reeealy careful when interacting with corporations they can screw you over",
            "Well enjoy working at walmart.",
            "Congratulations friend",
            "Congratulations!",
            "POG!!!",
            "We take those",
            "Good job now send your resume to 500 employers lol",
            "Wow congratulations! 🍾🎉",
            "Kudos my friend, may I ask you politely if you are holding any FTE role? If yes then what role, how did you get it?\n\nWhat are your plans for the future?",
            "So like another 45 years until retirement. Welcome to the workforce! 😂",
            "Hey congrats!! It’s one of the hardest degrees to complete, up there with Math, Physics and Chemistry! You are going to do great!",
            ".",
            "PM for McDonald's referral. I'll get you $15/hr.",
            "My boy! Im tryna be like you mayng! 🙏🙌🙌",
            "I’m either happy for your success or sad for your loss",
            "Toadally brilliant",
            "Congratulations 🎊.",
            "So happy for you. How was your experience?",
            "congrats!",
            "Saving this lol, next year😭😭",
            " Congrats. Don’t listen to the haters. Good luck on your journey 🥳",
            "Congratulations! CS degree is very demanding and many students switch majors at around the 1-2 year mark of college!",
            "Congratulations!! Make sure you spam your resume, practice leet code, and email employers!",
            "Fuck yeah congrats my guy!",
            "But do you have a job?",
            "Nice,  now apply for UPS and Fedex.",
            "Congratulations. \nSo .. Whats next door dash or uber eats ?",
            "It really isn't that hard.  LMFAO",
            "L",
            "Bs or Ms?"
        ]
    },
    {
        "post_id": "1cltimi",
        "author": "NajdorfGrunfeld",
        "title": "These goddamn mathematicians",
        "url": "https://i.redd.it/ny0hmkyuavyc1.png",
        "score": 1129,
        "num_comments": 57,
        "created_utc": 1715028037.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cltimi/these_goddamn_mathematicians/",
        "comments": [
            "thats only the tip of the iceberg, brace yourself",
            "https://preview.redd.it/cpyb2d446wyc1.jpeg?width=4000&format=pjpg&auto=webp&s=63e71d0aedc96c6c051291ad136f7b23732cf31d\n\nMy decision tree",
            "They act like computer scientists aren't also mathematicians we are the application form\n\nJust like physicist versus engineer",
            "you can pick which way is up within the sheet",
            "What book is this? Sounds fun",
            "It’s a tree because it has branches (I think)",
            "The tree structure is typically read starting from the root node, and text is typically read from top to bottom. Therefore, visualizing the tree upside down is most logical way to go",
            "are they stupid?\n\nThese are obviously australian mathematicians",
            "To this day, red/black trees make no sense, but apparently are all the craze.",
            "discrete is wicked yo",
            "Root!",
            "Why do I feel like this chart is so unnecessary. You can simply explain the concept of the symbol by saying “such symbol ask if an element exists in S”",
            "You know our major is algorithms, right?",
            "I thought it grew down because that’s the direction we process information. (and we often process a tree at the root first) Like imagine if books had sentences starting at the bottom and going up.",
            "Probably because we write top to bottom so it was easier to draw a tree of unknown length top to bottom instead of starting from the bottom up where you’d have to guess how much space the tree will take up before drawing it",
            "roots",
            "What’s so hard in this?",
            "If you suck at this right now , it’s still time to switch to business."
        ]
    }
]