[
    {
        "post_id": "1bri7qo",
        "author": "roguethrowaway0999",
        "title": "It be like this sometimes..",
        "url": "https://i.redd.it/s40hwsdu6hrc1.jpeg",
        "score": 4169,
        "num_comments": 66,
        "created_utc": 1711806247.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bri7qo/it_be_like_this_sometimes/",
        "comments": [
            "I’m extremely humbled to announce that while all of y’all are fighting like dogs for a job, I just landed a 6 figure position at a fortune 100 company. I got this position simply because hard work pays off. You peasants haven’t landed anything simply because skill issue. \n\nAnyway, I’ll be working remotely, with a robust benefits package and 401k triple matching. Did I also forget to mention that we work 30 hour work weeks? Anyway, I can’t imagine having a green “open to work” banner on my page 😭. Imagine being broke. Good luck to everyone regardless. Thank you for the support\n\n— Most humble LinkedIn announcement",
            "“NEVER GIVE UP HOPE I GOT AN OFFER AFTER 5000 APPS GUYS” it’s kinda turning me into hater. I’m sorry guys",
            "With how difficult it is to get one I totally understand",
            "\"After weeks of hard work, I am proud to announce I will be interning at company xyz this upcoming summer ! I would like to thank all my friends, classmates, and especially @recruiter x and @recruiter y for the process!\"\n\n\\#success \\#internship",
            "Being cheesy on LinkedIn is like the least thing I'd do for a good internship. It's brutal out there.",
            "am I the only one who find linkedin cringe sometimes? it's just over the top social media posting",
            "They always tag the company to start their long career in corporate bootlicking.\n\nHell someone I knew in elementary school just posted her acceptance into a residency program and tagged the hospital. Like it's just the type of stuff you have to do I guess.",
            "I’m hating but the day I get an internship I’m doing the same damn thing",
            "When all your friends are doing it idk it just feels like an initiation into the cool kids club ig lol but I mainly just post it for my family and friends to see and be proud\n\nI do agree it is cringe tho haha",
            "Agree? /s",
            "I only post after I finish my internships so I get cool rocket pics to post 😎",
            "I mean its cool, i get the advice sucks rn but it is the same cliche advice going on for centuries. I personally do feel sad for myself but im happy and cheering on for that person!",
            "My internship commitment post a Football D1 post.  My friend did the same for a basketball contract post and photoshop his face",
            "![gif](giphy|nZdxiTdqks9gsqAnGe|downsized)",
            "Bro be eating peanut butter and JELLY every day.",
            "you hating from outside of the club & can't even get in hahaha",
            "I mean you’d be giving a speech too for a 900k-2m offer lol"
        ]
    },
    {
        "post_id": "199zcnh",
        "author": "SudoCheckHooman",
        "title": "Got My First Internship",
        "url": "https://i.redd.it/hhq9exd999dc1.jpeg",
        "score": 3841,
        "num_comments": 171,
        "created_utc": 1705608334.0,
        "selftext": "After a grueling search for internship and rejections after rejections, today I got my internship offer from PayPal (Sophomore SWE). I can’t describe how happy I am. Throughout the holiday season I had a roller coaster of emotions. Getting rejections and sometimes not even getting reply. Always keep you head high up guys and never lose hope because\n“At the end of a storm there’s a golden light”\nI don’t know why I’m getting this emotional 😭 🤣🤣",
        "permalink": "/r/csMajors/comments/199zcnh/got_my_first_internship/",
        "comments": [
            "no offer attached? ...\n\n\"kindly\" 😭",
            "One day to accept? That’s fucked lol",
            "Hm idk why i feel like that email is a scam",
            "Grats man",
            "\"Kindly\" that word always just comes accross like it's a scam. Congrats though",
            "So that’s what acceptance letters look like …",
            "Wow. That's awesome man... Reminds me of the time they rescinded my offer...",
            "Congrats man, just got my rejection so this gives me hope 🙏🏼",
            "Congrats",
            " Congrats. May this be the beginning of a happy life for you.",
            "Watch out. There’s a lot of PayPal email scams going around.",
            "Well done. \n\nBe careful about anything you post / comment from this account from now on. PayPal wouldn't appreciate anything edgy or unprofessional from any of their employees.",
            "Congrats! Only upward from this moment on",
            "“Request you to confirm..”\n\nThe incorrect English is giving me massive red flags here. Are you 100% certain this is not a scam?",
            "Congrats Buddy!",
            "Sophomore internship is a major key 🔑. Congrats!",
            "Congrats!",
            "Nice",
            "Congratulations this is awesome. Good Luck!",
            "Congrats Man !!! keep shining",
            "congrats 👏",
            "Congratulations!!",
            "WOOT WOOT! Congrats!!",
            "As much you will give, as much you will receive \n\nCongratulation bro wish you all the best",
            "That’s so cool man , make the most of it!",
            "Good job! Congratulations !!",
            "Congratulations!!! That's awesome!!!",
            "Great work buddy! Virtual high-fives :)",
            "W",
            "Damn dude! Congrats!",
            "Kudos to you!",
            "Congrats!",
            "hell yeah brother",
            "Congrats!",
            "Good luck and congratulations",
            "Congrats!",
            "Congrats!! 🥳🎉👏",
            "Got a scam offer that looked very similar to this. Be careful",
            "Congratulations!!",
            "Is this the sophomore SWE internship? (For batch 2026)",
            "can you tell me how you were selected? The whole process",
            "Congratulations!!",
            "what is your tech stack?",
            "Am I reading this right, you have the day to decide?",
            "congrats!",
            "congrats homie!!!!!!",
            "Congratulations! I interned at paypal few years ago . Great experience. Hope you have a great time too.",
            "Congrats!",
            "Congrats and fuck you.",
            "That's awesome. You must be stoked. Congrats!",
            "Hi",
            "Still accepting?",
            "https://github.com/Coder-World04/Complete-System-Design",
            ":) even I got selected , but I'm 3rd yr",
            "If u don’t mind me asking, are u at a T20 regarded CS uni?",
            "What was your technical question?",
            "can you refer me",
            "Can you make a program that adds money to my PayPal account",
            "Heavy this message will self-destruct in 5 seconds after you finish it vibes 💀",
            "What os the timeline of your application? When did you apply? When you were you called for the interview?",
            "Looks scammy to me",
            "Did they only give you one day to accept?",
            "How does one get internships in sophomore year, what are the skill sets? I heard you can only get internships in junior/senior year.",
            "What’s the pay?",
            "Please share your resume. 🙏",
            "Please share your Resume ... 🙏",
            "Congratulations. What programming language are you great at?",
            "I thought this was a scam until someone pointed out that OP is attending a school in India and the position is in India. The wording of the email sounds so scammy 😂",
            "I am also a Sophomore student. Can You Guide Me About How You Applied For Internships and What Prerequisite Skills Needed To Get Accepted In Internships ?",
            "Can you describe how you got this opportunity? How and where can students in the final year of their engineering find opportunities like these?",
            "What in the YouTube tutorial?!?",
            "I too gave the OA but didn't recieve any such mail🥲\nNot even for rejection \nam I ghosted/rejected? xD",
            "Congratulations",
            "Hey man, congrats, could you brief us about the hiring process and your skill sets and stuff etc",
            "Can u dm me ur CV 🥺 ?",
            " Can you give us an update on if the offer turned out to be legit?",
            "How?",
            "omg congrats! \n\nI've been looking for a job for 20 days now and no luck D: 8 months of experiance.",
            "How many int. Rounds?"
        ]
    },
    {
        "post_id": "1am8qfa",
        "author": "finiteloop72",
        "title": "Most people in this sub:",
        "url": "https://i.redd.it/wgq0wtizxfhc1.jpeg",
        "score": 3722,
        "num_comments": 108,
        "created_utc": 1707432681.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1am8qfa/most_people_in_this_sub/",
        "comments": [
            "CS majors when they LeetCode for 30 minutes and don’t get 600k total comp like TikTok said they would",
            "“I stared leetcoding at age 10, have 20 internships at MAANG, and go to MIT, am I doomed?”",
            "https://preview.redd.it/wsdq6yv20ghc1.jpeg?width=600&format=pjpg&auto=webp&s=7acc5a05e8aac115d51e383bd5508123d94ced9b\n\naverage r/csmajor redditor when they haven’t submitted their daily doom post",
            "“Is it too late to apply to internships” - Yet another freshman student who can’t read",
            "I'm just waiting out the CS craze and gonna stay with it.",
            "People laugh and make jokes but I know plenty of people who never use their degree and do get stuck in dead end jobs because they couldn’t land a role soon enough after they graduate. I had this happen with me in my previous degree and I completely sympathize with these people.",
            "“I only got an internship at a fortune 500 company, not FAANG, is my career ruined forever?”",
            "Those of us with 20 years or more of experience have seen this before, and will probably see it again. Hiring people that could barely build hello world to deliver products with no credible business case at doctor salaries lasted a lot longer than I thought it would. If you want to work in digital systems because you like it, you should absolutely stick with it. If you want to make a quick buck then there's better ways to do that (sales).",
            "“We’re poor” \n\nAdvice: Study hard, you’ll get a nice job\n\n“I got a job, working 11 hours a day, not enough money to provide to my family\n\nAdvice: Switch jobs. Work hard.\n\n“I hate this life. Even if I earn life long, I can’t make a living in this country. I don’t wanna live”\n\nAdvice: Don’t do that, go to other country. \n\n“Other countries are denying entry to work. Crossing borders is illegal”\n\nAdvice: Go for education. You can easily pay off once you get a job\n\n“Education is costly for out of state students. I don’t have much savings\n\nAdvice: Take a loan, with part time you can do it\n\n“Took loan, worked part time. Didn’t spend a penny on useless things. Not getting internships/jobs”\n\nAdvice: LeetCode, Do more projects, Network\n\n“Worked on 500 problems. Done some projects. Did a few Open Source contributions. Networked at local events & LinkedIn but still no job”\n\nAdvice: it’s okay, market is bad. Just wait it out\n\n“Can’t do that. International student, have to get a job. Currently working 30 hours as volunteer at a non profit company. When does it get better”\n\nAdvice: You’re 22(or 26). Your life is still ahead. You made all these choices. This is always risky. Why should we give jobs to outsiders. You don’t know anything.\n\n“I hate this life. Can’t live anymore”\n\nAdvice: Don’t do that. Go to another country.",
            "Hey, buy the rumor, sell the news. Let the doomers doom while we wait out the storm and see it through.",
            "Im about to be 32 and back in school for a CS degree. When I talk to younger students in my class and they have these concerns, I just laugh and reassure them about how much time they have ahead of them. We’re all gonna make it",
            "Fr though… I feel like computer engineering / science, ages me like fucking crazy…",
            "I’m 26. I have wasted my life by studying CS. That’s a fact",
            "He looks good for 22",
            "Me, 22, who has no other option than to wait it out and hope that it clears up",
            "16 years is too old to apply for a job in cs",
            "Biggest group of doomers I’ve ever met.",
            "Literally me",
            "It's because tech is dead. I'm 47 and two years unemployed and literally no one is hiring anyone with experience (too expensive). Couldn't even get a job at 80% less money.",
            "Im 37 and i realized how quick career is passing by. Dont ever think 'i still have huge amount of time'. People who think like that end up like me - no career achievements in life. Except big pile of money.",
            "Washed",
            "Lol true",
            "I saw myself in this pic",
            "Damn, I thought the replies would be more hopeful here, but nope. I'm 31 and working to get into school this year... So that'll be fun if I get in.",
            "Where did you find this photo of me??",
            "I'm almost 40, I've wasted my life, it's been pretty fun to do so far...",
            "BRUH I’m turning 22 in like 1 month I didn’t wanna see this but honestly I be feeling like this I wasted so much time..",
            "That's hilarious, i'm a 28YO CS Major in my third semester and I genuinely feel this way, but only because of all the age demographic around me 😏",
            "I graduated several years ago with a second bachelor's in computer science. It took me 7 years to get a software engineering job (I kept working at my prior job this whole time), but I was able to get one!\n\nFrom what I've heard, the piece that really sold the interview team was a personal project I worked on in assembly language, as that demonstrated that I had passion for this field, even if my prior career experience wasn't in computer science.\n\nSo even if there's time where you're waiting to get a job, I think you want to find a job doing something so you're able to eat, and then work on interesting personal projects, using that as leverage to get the job you want. You want something to make your resume stand out, and if it's not standing out because of internships or prior jobs, make it stand out because of personal projects.",
            "LOL\n\nBe thankful that you're only 22. What would a 40 year old engineer who developed his skills over 2 decades say? :-D"
        ]
    },
    {
        "post_id": "18loy1e",
        "author": "juzen5",
        "title": "The comeback!!!",
        "url": "https://i.redd.it/h6b7bixgh57c1.jpeg",
        "score": 3508,
        "num_comments": 76,
        "created_utc": 1702947577.0,
        "selftext": "Passed algorithms :)",
        "permalink": "/r/csMajors/comments/18loy1e/the_comeback/",
        "comments": [
            "Amazing. Tell us about your story. How did you turn this around?",
            "bro I hate how unequal these courses are.. some you’re able to get extra credit on finals and some don’t even curve it even if it’s wayyy too difficult and their students do poorly. What professor you get shouldn’t have a huge effect on what determines your grade. I’m so jealous but happy for you.",
            "https://preview.redd.it/tukh3josx57c1.jpeg?width=1179&format=pjpg&auto=webp&s=aec6c3c6198d15f89bcbc82ed3555986a47fdabc\n\nthe dopamine i got when i seen this in my discrete class inbox",
            "Started with an F average and ended with a B average 🔥🔥",
            "But the final exam says ‘Not Submitted’\n\nDid you inspect element this?",
            "Lmao why the extra 6",
            "Which algorithms class was this?",
            "Lol that happened to me once. I was in a Programing language theory class and I bombed the midterm. But then our teacher said if we did better on the final, it’d replace our midterm grade as well. I got like a 98 on the final lol. So I ended up with a 99 or so in the class haha.",
            "OMG CONGRATULATIONS! This was me during this past semester too, literally worked my ass. Went from a F to a B-. Never again though, learned my lesson.😅",
            "REVERSAL OF FORTUNE!",
            "Always a good feeling. Congrats!",
            "AYYYYEEEE",
            "![gif](giphy|ooCrwgRHsplNPYyoKv)",
            "W",
            "AAAAAYYYYYYYYYYEEEEEEEEE",
            "YEAAAAAA LET’S GOOOOOOO!",
            "Literally my Probability Models class sophomore year. \n\nThe third exam and the final were a week apart. Figured out what I fucked up on the third exam and boom.",
            "Gave me hope, I have a 65 on a minor course not even related to cs",
            "Well done 👏🏻",
            "Man psychology is whoopin me. Some of the most uninteresting information I have ever been told.",
            "WooHoo!!! 🎉 Congratulations!!",
            "Nice! Hopefully this is one of those god-tier professors who drops the lowest scored assignment / exam",
            "Good job, I'm happy for you.",
            "CONGRATS BOSS!!!!",
            "OP got 10.6 but computer failed to register decimals",
            "The curve is real",
            "Lol is this real? Canvas has a feature that let’s you test hypothetical grades. Is that why it says “Not Submitted”? 😂",
            "106 though lol",
            "umm how do u get a 106/100?!!",
            "What exactly is curve in the exam how it works? \nBefore enrolling in classes should we ask advisors if the professor gives extra credit and stuff?",
            "Congrats! trust me I know how happy you must be right now. I got a 68/100 on the first exam for my ML class and a 105/100 on the final and i was over the moon"
        ]
    },
    {
        "post_id": "1c8vzo9",
        "author": "Flimsy_Parsley579",
        "title": "ALL I WANT IS ASS!!!!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/1c8vzo9/all_i_want_is_ass/",
        "score": 3473,
        "num_comments": 213,
        "created_utc": 1713635536.0,
        "selftext": "I don't get the way you guys think.I want to have a woman's ass and just have my face buried under it. I don't want \"money\" and I dont care about lines of \"code\" I just want ass. Whatever lets me get the most ass.All I care about in this major is ass which I have not seen a many get as they lie in their virgin lives blaming fate to be the reason of their lack of asses. That's why I'll be going to an ass party specifically for cs majors. I don't wanna play and laugh with y'all. I am here for ass\n\nThis is an original shitpost ",
        "permalink": "/r/csMajors/comments/1c8vzo9/all_i_want_is_ass/",
        "comments": [
            "https://preview.redd.it/81gttwgwsovc1.jpeg?width=948&format=pjpg&auto=webp&s=f061751b236b8a8babe89f751a6aa4ddd64b5e4a",
            "man where did we go wrong",
            "you had a bad time with a bug, huh?",
            "Its okay bro you will be able to run the program soon ita probably just a semi colon",
            "https://preview.redd.it/5dgc3o7ntqvc1.jpeg?width=498&format=pjpg&auto=webp&s=c5102f8d49bf03cde35c2ac5b1d31ddf64658554\n\nOP when they meet their first gold-digger after they get their FAANG internship",
            "CS is the best profession if you want to get ass.\n\nYou'll be competing with socially inept weirdos that don't stand a chance.",
            "Yeah we’re definitely cooked.",
            "Dude just jerk off in the bathroom like everyone else and do your work.",
            "![gif](giphy|JUIYjVeZPHxjWR7rmX|downsized)",
            "just polish your snake and you're healed",
            "Look in the mirror dude. You’ll see a huge one staring right back at you.  Enjoy",
            "Specifically, big booty Latinas!!!",
            "![gif](giphy|uBy5vilZfzkly)",
            "Man I’m gonna keep it 100. A man wants success for one of 3 things… parents, children, or women, and you wanting ass is no exception. Getting a CS degree means you get bread, which increases the chances of you getting laid. So in conclusion, there is nothing wrong with getting the degree for ass.\nGetting a cs degree cause you like cs ❌\nGetting a cs degree cause you like ass ✅",
            "This sunreddit is becoming r/BatmanArkham levels of insane",
            "Same. I got into this because I want my face buried in algorithmic selection sorting all day, every day.",
            "Code ->Money -> Ass.",
            "I feel you bro, it’s gonna be almost two months in this bih since I drowned into some heavenly fresh warm sweet smelling buns from the oven",
            "[here you are](https://youtu.be/mQTEgWRi7FU?si=hVpy4D2p0MDmDaBC)",
            "Gimme me money and some referrals . I'll help you out with some ass",
            "Let me eat a piece of",
            "I need that ass… I want them to stuff their ass into my face",
            "I get a lot of ass with the money I make from coding lol. FYI, there are places very near where you can get ass for as cheap as $30-40.",
            "If you want ass, you've come to the wrong place in a CS subreddit and major...\n\nDamn, I even had a prof making incel jokes about us...\n\nJust a warning, that CS party you're going to, mostly dude ass...Your best bet is to change your preferences by gaymaxxing or transmaxxing.",
            "This was funny until the second or third time, now it's getting old.",
            "Im starting to think doing porn is worth it vs a 4 year degree...",
            "[this you?](https://youtu.be/UHmFbT8DPX8?si=AS9VyU0KTBOwPWZO)",
            "If you want ass I think the job you want is executive producer or director for movies, or a business degree",
            "Can it be man ass?",
            "This is somehow better than all you mfs complaining all the time",
            "Paas, Saas, or ass.",
            "Easy just focus all your effort on networking and get into tech sales. \n\nThen apparently get on Love Is Blind",
            "You can definitely get ass pretty easily at the later stages of computer careers. By later I mean like late 20s. You can even have an easy time earlier if you stop being a pussy.",
            "the job market has finally broken gen z",
            "work at pornhub/onlyfans..... You can have both!!!",
            "idk about ass but you will be meeting a lot of assholes! Hope that keeps you motivated!",
            "The only ass you're gonna be getting are ones attached to women who look like Priscilla Chan.",
            "he's a fed",
            "You are a nerd",
            "Only women's? Weak.",
            "https://preview.redd.it/o6frczhzyqvc1.png?width=452&format=png&auto=webp&s=f61734f977c4cf25e644a94ee337d339cc4824de",
            "Buncha virgin weirdos on here",
            "If ya want ass you got into the wrong profession bud",
            "You’re in the wrong field bro 💀",
            "[deleted]",
            "Hahaha good one 😶‍🌫️ 10/10 shit post\n\nOP totally doesn't have a problem \n\n😅😅😅",
            "I love eating ass too",
            "Can you do dp (double penetration) hard",
            "s/ass/css/",
            "You are looking for ass?\n\nGo, talk to project Management.",
            "Sorry you need to be attractive or funny for that, and we know you're not the latter, and can assume not the former 😉",
            "ass lovers unite",
            "This is getting out of hand",
            "Graduated with CS in 2008. \n\n...I see not much has changed. :P",
            "😂😭💀",
            "Oh yeah the booty warrior would love you 😂. He loved taking men’s asses when he was I’m prison.",
            "Most people in this sub would be significantly happier if they actually felt like this.",
            "Same. Mine got a P. In front of the ASS",
            "1.Join FAANGMULA\n2. Strip clubs >>>> stocks",
            "Real.",
            "STD awaits you.",
            "Amén brother",
            "I was wondering if this was going to end up being a programmer socks lesbian joke lol",
            "Ass is overkill. I want all the money I can get to just feed my future cats and eat lovely food and video game the hell outta my life.",
            "This sub has been filled with horny posts lately, what’s going on bruh? Lmao",
            "It's joever.",
            "Wait for that post nut clarity to hit",
            "Man code to make money just to get woman ass anyway 😜, maybe better code —> more money —> bigger ass 🤪",
            "Lot of ass in CS programs these days . \n\nEnjoy",
            "Spread the cheeks and you'll see a reflection of the hole in your soul. And that's why you keep searching to bang some FAANG.",
            "You need dick!!!",
            "But all you get is CSS",
            "ASS MAN",
            "Go to gym and build yourself an ass",
            "This is an understandable desire",
            "You were supposed to major in Counterstrike.",
            "[https://www.youtube.com/watch?v=jvTpEoi0tzE](https://www.youtube.com/watch?v=jvTpEoi0tzE)",
            "Take me to the party brother",
            "Ass > shitpost \n\nNice",
            "An ass party for cs major:\n\n![gif](giphy|iGpkO05xWTl17Vhq6Y)",
            "![gif](giphy|bHTDTL1pmlp1PtIVvt)",
            "The post and the comments are top tier comedy",
            "Looks like someone's code has a little attitude to it. lol",
            "Use your CS money to go to a brothel",
            "Real",
            "Pro Tip: Name all your button variables 'butt'. \n\nOh, and start out as frontend dev.",
            "Trust me, you will eventually get all the assess from men, women, trans, human, animal, bipedal, till you get tired of it.",
            "I am that type as well and got a girlfriend equipped with a real good one. Blessed.",
            "You misspelled SAAS",
            "Average cs major orangutan",
            "https://preview.redd.it/tyf3oi1iztvc1.jpeg?width=1170&format=pjpg&auto=webp&s=0263c2de62a8139a8bb82210d8094301102dc6c5",
            "I'm confused because I want at ASS degree and my gf's ASS, so which are you referring to? Either way, I feel you on a deep level.",
            "Change your major to business or marketing",
            "This shit got me crying 🤣🤣🤣🤣",
            "Squat and hip thrusts.",
            "PREACH BROTHER!!",
            "**Accomplish Something Significant:** Maybe you're driven and want to achieve great things in computer science. You could be saying, \"I want to build something truly impressive!\n\n**Awesome Skills:** Perhaps you're passionate about developing your coding skills. You could be expressing, \"I want to become an amazing programmer!\"\n\n**Algorithms and Structures:** These are fundamental concepts in CS. You might be emphasizing, \"I'm here to learn the core principles of computer science!\"",
            "My dude knows what he wants. I don't see a problem here.",
            "Bro gets it",
            "But Beautiful, naked, big-ass women just don't fall out of the sky, you know?",
            "Search for carrers on pr0m sites..hope this fulfilled yur a$$ dream",
            "Nooo! You're betraying us!! Why go for females when you have good guys?!?!?! Stick together bro, and you'll get our sticks for sure.",
            "LOL\nStatistically married people have sex more often than their single counterparts in every age group.",
            "I agree with OP . \n\nCS->high paying Job $$-> womnan's ass , circle of life complete .",
            "This is what happens when engineer majors  breathe and live off of coffee, solitary confinement, and a deprecating sense of imposter syndrome when the market for software engineers has become competitive and shitty.",
            "I have a woman’s ass. Even better it’s the ass I want to spend my life with. It’s glorious. It’s really something that I can’t get enough of. Good luck in your pursuit of a woman’s ass.",
            "Ops got glass in his ass",
            "Boy are you down bad",
            "Real af",
            "This won't look good at the pearly gates bro",
            "thats what the moneys for",
            "Found the See Ass major",
            "Dude you’re high. As all the ass eating cravings commence once one gets high , at least in my case.",
            "Same here y'all I got scammed ffs",
            "Most sane cs major",
            "Over 50% of CS majors at my college were female. 95% of them were Chinese though and only really hung out with other Chinese students.",
            "https://i.redd.it/8oopw6k9b8wc1.gif",
            "When I did some contracting for the US Space Alliance in Houston we had been tasked with creating an online calendar and reservation system for astronauts. So, of course we all referred to it as the Astronaut Scheduling System. Working on that ass was pretty fun back then.",
            "I’ve never related to a shitpost as hard as I did this one Man I NEED SUM ASS TOO WTF",
            "This is disgusting !",
            "In the end, I guess we’re all here for ass.",
            "may need to touch some (gr)ass first",
            "engineering major subs be like",
            "Wrong sub dude",
            "Bro u r really desperate. Go and grab bitch ASAP. or get into a relationship.",
            "What the hell is wrong with you",
            "Pause, Diddler",
            "Hah go buy an escort and take a cold shower dork"
        ]
    },
    {
        "post_id": "1c1wlgm",
        "author": "roguethrowaway0999",
        "title": "we are just doing it wrong",
        "url": "https://i.redd.it/m9sx10prbytc1.jpeg",
        "score": 3410,
        "num_comments": 205,
        "created_utc": 1712885417.0,
        "selftext": "I too love sugondese studies",
        "permalink": "/r/csMajors/comments/1c1wlgm/we_are_just_doing_it_wrong/",
        "comments": [
            "“Successfully launched a new feature on Google Photos that utilized visual similarity and machine learning of, reducing photo grouping time of my anus from hours to seconds for 61M users.”\n\nI can’t compete with this",
            "lol trained a team of 5 while on LSD & shrooms 🔥🔥",
            "https://preview.redd.it/qf4lsocfcytc1.jpeg?width=943&format=pjpg&auto=webp&s=e83cb51b9afc9ee7250598f75b66d27b1660e244\n\nIn a follow up tweet, he showed these are the places he got interviews from wtf 😭",
            "Well yeah, nobody reads resumes. They skim them. So they skimmed and saw instagram, amazon, google and Stanford",
            "Bro is the other candidate",
            "Sugondese Studies degree from Standford 💀😭",
            "Mia Khalifa as a skill. This is the way",
            "I’ve said this before on here that recruiter/hiring manager is a fake job and they’re some of the dumbest people in the world.",
            "Holy shit it really shows how recklessly recruiters check our resumes 💀😭",
            "Very clean resume though..",
            "Wtf is Mia Khalifa doing in the skills section?",
            "hosting orgies on fridays",
            "HR as a whole department is a joke 😂",
            "Arson is a scalable skill ngl. And kudos to increasing coffee breaks by crying.",
            "All this is telling me is to just lie on my resume  and hope nobody notices.",
            "You know i never understood the advice to put “numbers” on your resume. This is exactly what it looks like to me.\n\n“Did X that increased Y by 69.69%”\n\nYeah, according to who? You? Like anyone couldn’t just pull a stat like that out of their ass. Why is that so often advised.",
            "Lol Amazon Dating Team",
            "expert in arson 🔥🔥🔥",
            "☠️",
            "I know what to do now… just put big name companies on the resume..ez right???",
            "They copied [this](https://www.reddit.com/r/recruitinghell/comments/qhg5jo/this_resume_got_me_an_interview/) post from years ago. Lame.",
            "So what I really lack is expertise in drugs, mia khalifa and onlyfans",
            "Expert in Mia Khalifa, ofc you have a degree in sugondese studies.",
            "But Jonathan from wonsulting is doing the same experiment, albeit a normal sounding name and the big tech companies and his shows that he's getting ghosted and rejected left right center.",
            "Mia Khalifa under Skills 😭☠️",
            "Lmfao recruiters are so fucking stupid",
            "The second point of his experience at Google is unhinged 💀",
            "Ai fails here.",
            "This is genius level of trolling. Well fucking done",
            "Skills in: Arson, Mia Khalifa 🤣🤣\nDamn, guess I've been getting the wrong certifications. Anyone know where I can get *these?* \n...... (/s before my inbox fills up with porn links)",
            "Is this for real or sarcasm? What are those achievements 💀💀💀\"dogs\",\"anus\",'LSD\" lol. This is crazy.",
            "\"Experienced Product Manager with a background of building scalable systems in the blockchain, fintech & adult entertainment industries. Expert in Java Script, TypeScript, Node js, Arson, Mia Khalifa, C++, Python\"",
            "Jerry your parents played the game first by naming you Jerry",
            "Yeah by doing it wrong you mean haven’t worked at Instagram, Google, and Amazon. \n\nRecruiters see this and cum immediately.",
            "Sugondese Studies. \n\nBro has won",
            "This is incredibly interesting. \n\nI wanted to add my two cents.\n\nI have a friend that works in HR and hiring. She told me she hates when resumes look plain like this and pretty much will discard them. This baffled me because working in technical fields I was always told making an aesthetically pleasing resume is useless because simply put it is a technical/practical field and does not care for aesthetics. But the technical/practical people aren’t doing the hiring side of a company that’s always done by someone working in a HR position. Those people (including my friend) are nothing close to practical or technical they are completely abstract and creative individuals. \n\nI think we ought to remember that being a technically skilled individual is only half of it. You also have to have high social-able skills. I also would like to add that I disagree with people who claim you can only be one or the other as I believe we’re all capable of obtaining a well balanced personality.",
            "Ah yes, the sugondese region...",
            "What did you expect? You are using big name in job applications that we all know use ai to filter, ai does not care if your name is kissma nuts or suck my dick. Ofcourse you‘ll be invited, those are all without a single human being interaction, they will read your information just before you login to the call or be accompanied to the conference room.",
            "Maybe they used ChatGPT to determine which applicants move forward with an interview.",
            "Damn, expert in Mia Khalifa",
            "Who wrote this masterpiece? No way AI did something this funny. And I wouldn’t send it out to a recruiter or HR department in the off chance a human reads it.",
            "Kiss me da nuts…that’s all I read",
            "I love how he noted Mia Khalifa as a skill.",
            "So is my resume not good? Bc bc there is no way that a recruiter gave interviews to him with Mia Khalifa as a skill and all those other bulletpoints",
            "someone already did this with every single bulletpoint sounding like BS already ages ago (ie. increased rate of STDs by 72% among interns)",
            "Has a s kill in Mia Khalifa? Lol. 🤣🤣",
            "Just Stanford did that",
            "If nobody bothers to read the whole CV what’s stopping me from making such a list and adding at the bottom in small print „The following information is purely for entertainment purposes and does not accurately represent real events”?",
            "Goes to show why leetcoding and big tech is worth it even if work life balance can be shitty. Just stick it out for a year and start job hopping and you won’t worry about unemployment as much",
            "Where does the LinkedIn url take you?",
            "Bro got a referral from Don Keedic",
            "The tyranny of algorithms",
            "😗",
            "Ahhh so I too should become an expert in Mia Khalifa. It all makes sense now.",
            "This is like my resume. I put education on top instead of Work exp",
            "I mean it’s hard to blame a recruiter. If you have to read 200 resumes in a day how much attention to detail would you give to a resume this long.",
            "Proof that AI can replace hiring managers because they are all bots already ",
            "So I’m busting my ass for a Computer Science Degree and being very honest on my resume and not landing any job or even an internship when there’s a Kissma D’s Nhutz out here getting calls back ? Lol what’s the point in this other than the feeling I get of accomplishment when obtaining a piece of paper.",
            "What we learned is that people with the will of D get interviews. Talk about privilege.",
            "Expert in Mia Khalifa",
            "Google, amazon ,Instagram and sanford 4.0 student of course you are going have such a high success rate.",
            "Not \"Mia Khalifa\" in skills😭",
            "The sad thing is, I actually know a guy who did fake his resume and got the job. He got caught doing it in finance then did a complete pivot to tech and still in it.",
            "Donot follow this jerry lee bro…..he will be writing google instagram in his resume and will say see this resume got interviews…..of. It got interviews 🤣🤣🤣🤣\nIts a scam to get people to involve in his business of resume review. Resume is important but his experiment is biased as fuck.",
            "I'd bring you in just to talk to you for sheer audacity.",
            "he's him 😭😭",
            "Basically, they read the first experience, last experience, the school and eyed the technologies at the bottom",
            "I would love to see if he goes through with the interviews with HR and see their reactions when they ACTUALLY read the resumes",
            "Legend",
            "I need to see this tweet lmfaoo",
            "https://www.reddit.com/r/recruitinghell/s/ATrVfUkKV3",
            "What I’m hearing is that we should get certifications from Instagram, Google, Amazon, and Stanford to push our way to the top when pushing out our resumes. What a fucking joke the recruiting process is 😂",
            "I bet he couldn't wait for recruiters to say his name.",
            "Expert in Mia Khalifa XD 🤣💀",
            "The name sounds slightly African. Sugondese sounds like Sudanese (people of Sudan)",
            "Mia Khalifa??skills??",
            "The boring truth about the name itself is that across languages it's not uncommon for people to have unfortunate souding names, and it doesn't make sense nor is it even legal to discriminate on this basis.\n\nThe rest of the contents just shows that there is no negative keyword matching.",
            "Experienced in arson, Mia khalifa 😹",
            "Template name ?",
            "\"Expert on JavaScript, TypeScript... Mia Khalifa, C++...\" \n\nlmfao got his porn preference in there damn man",
            "I mean if somebody who worked at Google, Instagram, and Amazon isn't getting an interview we are all cooked. They probably read the bullet points for the latest job which was actually legitimate stuff, then glanced and saw leadership positions at other big tech, read their first bullet points, and said \"yeah let's interview\". The first level of screening is more about filtering out garbage and selecting some of the most promising candidates. Once you've read enough to be sure a candidate is promising, there's no reason to read the rest of the resume, finding the best candidate is the next stage.",
            "I am pretty sure they learned a lot about you as well",
            "I work at aws and havent heard shit from recruiters lmao I hate this shit lmao",
            "god im applying for a job that’s gonna pay so well, should i try this? anymore tips?",
            "That's because Jerry sounds white\n\n\nksissma sounds African "
        ]
    },
    {
        "post_id": "mpjn5v",
        "author": "Flatts_the_Flounder",
        "title": "Summer 2041 internships",
        "url": "https://www.reddit.com/r/csMajors/comments/mpjn5v/summer_2041_internships/",
        "score": 3402,
        "num_comments": 93,
        "created_utc": 1618250979.0,
        "selftext": "For those who were just born, how is your internship search going? I currently can only complete leetcode hards in 5 min, trying to cut that down. \n\nHopefully by the time I get to college I can have multiple offers. Who knows what FAANG will look like, might as well try and get an offer from every single tech company on earth in order to maximize my clout",
        "permalink": "/r/csMajors/comments/mpjn5v/summer_2041_internships/",
        "comments": [
            "Lol good luck, GPT-14 can do any LC Hard in 12.18 milliseconds or less",
            "My future child is preparing in my balls. I can feel it",
            "Schedule all the interviews on the same day. That will maximize your chance of getting multiple offers simultaneously.",
            "Your first words weren’t “reverse linked list”? I wouldn’t even bother applying to FAANG. If your goo goo gaa gaa isn’t O(n), literally just stop trying.",
            "I love and hate this sub at the same time haha",
            "Just give up. You’re already behind and the competition is tough. Hopefully you get some pity points during interviews with a 5min LC hard time. /s",
            "5 min for a lc hard? damn thats awful, but no probs, although you did start a bit late, if you could put 161 hour weeks doing LC, while having an hour of sleep a day for 18 to 20 years, you might be able to get into WITCH companies , shouldve started earlier mate",
            "U should have sold 10 startups and started 5 VCs by the time you are entering college to maximize your clout.",
            "You've already been born? I'm still in utero.",
            "I’m already preparing my hypothetical grandchildren for summer 2061 internships. I’ve been preparing the sperm in my ballsacks by slapping them across the LC hard questions on screen. \n\nBy then half the world population can do LC hard questions like 1 + 1 and every middle schooler can use tensorflow perfectly, so the ASS companies and fortune 420 are raising the bar for hires. Positive Genetic testing, Ivy League/MIT/Stanford/Caltech PhD, satisfactory brain scans, and bench pressing 1000lb without body mods are the bare minimum requirements.",
            "Jokes on you for thinking FAANG will be a thing in 2041.\n\nSome big tech yes, but I don't expect most of these companies to be the biggest ones around.\n\n\nThey'll be like the IBM of today.",
            "2041? You're asking for the wrong dates, you should be shooting for internships next year, do LC in between changing diapers",
            "The best candidates are born as the doctor plays an MIT Open Courseware algorithms lecture.",
            "> For those who were just born, how is your internship search going? \n\nHold up, this is not looking good. For those who were just born? It is already looking very bad.\n\nThe interviewers are already asking what did the candidate to for 9 months?. \n\nIf a candidate waited until they were born to start their career they are way behind compared to others. \n\nNowadays almost everyone is born with 9 months of experience.",
            "r/cscareerjerk",
            "give job pls",
            "inb4 leetcode decides to introduce \"super hard\" problems",
            "Commenting to be a part of history lol.",
            "If you aren't already the CEO of every FLAMINGASS company then I'd say it's time to enroll in Google's IT support, I heard it changed lives.",
            "If your mom didn’t give birth to you in O(n) it’s already a lost cause.",
            "FAANG will have their own dedicated cities by then.",
            "Amazon",
            "Maybe Amazon will take u",
            "You’re already behind most people are already WORKING at google when they’re in the womb. It’s hopeless, just give up. Also you can solve a LC hard in 5 minutes? LOL try 5 seconds. Sucks to suck.",
            "This post is so funny lmao christ",
            "By summer 2041 it might actually be like this. We are already having to apply in July and August for the next summer, and in April and may for quant internships.",
            "That's not even a real year",
            "LMAOO these memes are killing me 😂😂😂🤡🤡🤡",
            "I literally pwned my birth against the jerk who tried to hack my labour room.",
            "Interviews will no longer be just LC",
            "Tesla has open positions in their local in Mars",
            "sort an array in constant time",
            "if you can’t solve p = np literally just drop out and pursue marketing",
            "ironic considering i just watched Tomorrow War",
            "I hope they’ve been grinding leetcode the last 10 months.",
            "Clearly it’s worth it. Projecting salary growth from what we’ve seen over the last 20 years, they will be competing for $1BB TC annual.",
            "Ha \nI have no college degree,\nI have no certificates.\n\nI failed junior year but found loop hole and\nTransferred into the states top private school senior year. \n\nPaid my teachers off for passing grades.\nand got a high school diploma.\n\nI got $80,000 year job 1 year after high schools at a Fortune 500 company.\nNo paper to prove I knew anything.\n\nGood old fashion con man smile,some social engineering and lots of charm and charisma.\n\nWorked with many people with all kinds of credentials. Most of them did not know where they are standing.\n\nFuture builders and destroyer of worlds.\n- your 1st interview starts from freshman year in high school. Don’t mess that up.\n- you need to have solid projects under your belt. Show proof over time before your last year in high school.\n- college, Find the quickest way to get out\n   And start earning and contributing.\n- Go back to school after 1 or 2 years and specialize on one thing so you can be the master of the universe in that subject.\n\nThere are a lot of bullshit artist hold some top and important positions. \n\nDo not fall under the employment spell of “ Oh, I work at or I work for”\n\nDo your thang and value your ideas and work.",
            "Is this subreddit satire now",
            "Maybe Larry Ellison dies and Oracle undergoes the same sort of revitalization when Ballmer got replaced by Nadella\n\nEdit: don't get your hopes up btw, Larry has his own genetic research nonprofit dedicated to extending human life",
            "Totally thought this was a typo till I read the post. 😂😂 it really feels like this though.",
            "Make sure you don’t double book your microgigs around lunch time. There was a bug in Overemployed.diffusion v34.7 that they haven’t fixed.",
            "Can you center a div though ?",
            ".",
            "😂😂😂😂"
        ]
    },
    {
        "post_id": "180ojcp",
        "author": "DataWizard_",
        "title": "Insanity",
        "url": "https://i.redd.it/zvqv0dr31r1c1.jpg",
        "score": 3372,
        "num_comments": 241,
        "created_utc": 1700593337.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/180ojcp/insanity/",
        "comments": [
            "Yeah I’m not applying y’all got it 😭😭",
            "[deleted]",
            "How do you see the exact amount? For me it says 200+ candidates",
            "I mean it's discord\n\nFamous popular company\n\nAnything famous is going to get a ton of applicants",
            "its Discord. what kind of numbers do you expect?",
            "Tbf like 7k are probably from Hyderabad and have 0% chance of getting an offer (companies don't pay for visas for interns).",
            "in 2018 twitter got 69k applicants across all its internship positions and 200 total positions. It’s just the way it is",
            "👀 I’m curious as to how many applications they received in the previous years",
            "Sorry, forgot to tell my script to iterate to the next post before submitting.",
            "How do recruiters even go through that many applications",
            "That just means ppl that clicked it.",
            "It’s like winning the lottery at this point. And all I heard during my undergrad was how “tHeRe’s nOT eNOuGh dEVEloPeRS!!!”",
            "And they're going to interview like 100 people",
            "Makes me happy I pivoted back to Network stuff",
            "Don't cold apply to things. It's never been that way. A bunch of people coming out of university are convinced that it's that way for some reason.\n\nYou need to go to a conference and talk to the people that work there. Be cool. Don't talk out of your ass. Be someone that they want to be around.\n\nGetting a good tech job has \\*always\\* been a social endeavor.",
            "Apply. The moment you get into a habit of giving up on things that seem too hard, everything will get even harder. \n\nYou are the best, duck all the rest. Apply for it, get it and show them how it is done.",
            "To be fair a lot of them are gonna be from India and Pakistan.",
            "Yeah, don't even bother.",
            "First time I’ve seen this many.",
            "submit your resume into the void too!   \ndo it, might as well :)",
            "Just for context, the actual number of applicants is definitely A LOT higher than 10k. It’s just the first time I’ve seen 5 digit applicant numbers on LinkedIn on any job.",
            "Lordie I’m so sorry for you guys",
            "just a heads up, its best just to ignore the applicant numbers, over 99% will be written off before they are even looked at.\n\nmy summer student job had 1300 applicants on linkedin and i still applied and got the job. i later asked why they chose me over 1300 people and found out that only 4 applicants lived in the country, and of those 4, i was the only one with a relevant degree and experience.\n\nif you have ever looked at the # of applications and didnt apply because of that, you are the problem and not the job market",
            "based on their glassdoor, i dont think you want to work there rn anyway",
            "Discord requires a neckbeard to apply too",
            "I heard it’s not correct, it also means the amount of people that viewed the application",
            "I mean it’s a big company in silicon valley with an intern level job posted for a week… honestly I expected more applicants",
            "Everyone says “99% of those are international who will get auto rejected or people who can’t even pass OA’s”\n\nIs this really the case? There is no way that many are unqualified right?",
            "At that point i’d rather buy lottery tickets at the gas station 😂",
            "how many are thirsty Indian dudes on H1B/student visa though",
            "Im pretty sure 5k people are applying there from india lmao",
            "That's mad! Just makes me think about what jobs people are getting once they complete their degree! So much competition, few jobs on the market! \n\nMaybe there will be a large rise in new businesses!",
            "Do they even sponsor international interns?",
            "What app is that? I mean the application app",
            "People be like “why does everyone want these remote jobs, I should be the only applicant for this accessible position”",
            "Those are just views. LinkedIn is known for listing every view as an “applicant”.",
            "I wanted to apply but I don't think they sponsor :( I'm Canadian",
            "I was just speaking with a recruiter and he said that they had to take down all their postings for right now because they’d get thousands of applications from people who have nowhere near what they were asking for. May or may not be the case everywhere, you still need some way to stand out from the thousands too.",
            "I live on an island about 10000 miles away should i apply and work remotely?",
            "The company I work for (much smaller than Discord!) is at over 15k newgrad applications",
            "Hope these people applying can add date and time formats that don't depend on language setting",
            "Holy shit 10k applicants for an internships that’s insane lol. If it was full time job it be a different story but internship holy cow",
            "how else am I supposed to know what my ekitten is doing?",
            "It is Discord. What did you expect?",
            "indo china quota",
            "What do you expect? It's a big company.",
            "So... y'all want applying to be easy but you don't want anyone else to apply. Gotcha.",
            "I imagine a lot of people applied just for shits and giggles and don’t even have a CS background lol",
            "So many people in comments going \"Oh nooo it's impossible to get an entry level job in 2023 as a CS grad\"\n\nHave you considered that your first job does not necessarily have to be in a company that makes a product you and half of your generation uses?",
            "A lot of bootcamp calculators and todo list",
            "They pay crazy well, tho 💀",
            "Lmfaoooooooooooooo 10k IS CRAZY oh my dayz",
            "average internship from the “pitt csc/simplicity” internship board",
            "Anyone know how the filtering process here would work to narrow applicants down. What would a top 10% applicant have asides from YOE",
            "[deleted]",
            "It doesn't mean all those applicants are qualified. I bet minimum 80% of them are just graduated from some mediocre bootcamp",
            "It's fucking Discord. Of course it's flooded with applicants. \n\nPeople want excellent opportunities to work at companies they admire so they can change the trajectory of their lives. No shit.\n\nBut keep chasing those dream companies. Keep it up.\n\nDummies.",
            "FYI \n\nThat number represents all the people that have clicked on the \"apply\" button, not the total number of applicants!\n\nAlso, who's to say how many of those clickers actually applied ?\n\nAlso, there's probably more people that applied directly through the website, rehires, referral applicants, internal applicants, or applicants that applies through special referral links from different events (yes this is a thing) or through someone like a recruiter pipelining their application etc....\n\nAnd of ALL those things combined with stuff mentioned in earlier comments such as proximity to location, school name, grades maybe, cool projects, internet presence maybe, previous famous internships, and also (how many internal discord employees have kids or know people that are interns)may also play a big role. not exactly nepotism, but more about taking a chance on  someone reccomended to you by someone you trust and have worked with for years",
            "*circus music intensifies* \n\nThe sad thing is that people will spend 300+ hours grinding through Leetcode problems for companies like this who’ll bin your CV without even looking at it",
            "10k is smaller than I expected to be fair.\n\nWhat other major social media has internship programs?",
            "Been seeing this across the board for any decent job posting. Easily 1k+ applicants in under a week. Don't let it discourage you. Try your best to network with colleagues and friends to get your foot in the door at places. Shoot your shot, no use in feeling bad, that won't get you a job.",
            "What did you expect it’s a massively popular company that pays out the ass",
            "they want that H1B"
        ]
    },
    {
        "post_id": "17o54da",
        "author": "Icy_Bluebird3355",
        "title": "My Summer 2024 Internship Hunt",
        "url": "https://i.redd.it/3zqswn0lsgyb1.png",
        "score": 3271,
        "num_comments": 91,
        "created_utc": 1699161862.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17o54da/my_summer_2024_internship_hunt/",
        "comments": [
            "Was this how your application and interview went?\n\nhttps://preview.redd.it/krfwqpuqtiyb1.jpeg?width=1125&format=pjpg&auto=webp&s=ee02ccac1d06c9f896ec897e60b82339d55be96d",
            "Soon, someone will post: 0 Applications, 1 interview, 1 offer, 1 accepted atp",
            "The grind never stops",
            "I swear to god this is every other post I keep seeing 😂",
            "hot honesty",
            "This is *not* a shitpost?",
            "I found a loop hole in the system, first you open an LLC, then you intern for yourself doing leet code or fun projects. \nIf you don’t like the pay you can say my internship paid way more than than. \n\nYou can open a business fixing mom and pop business websites because we all hate getting directed to Facebook. \n\n(This a joke but may work)",
            "congrats 😭😭😭😭😭😭😭😭",
            "what's the company",
            "Are you from 1990 or something lol",
            "His dad simply bred an intern",
            "I wish it was this easy",
            "Nepotism go brrrrr",
            "Bro used all his luck in a single month.",
            "that one germ",
            "🪦",
            "Congrats and fuck you",
            "Nepotism rocks",
            "I have hatred for anyone who gets an internship within 10 applications\n\n![gif](giphy|wloGlwOXKijy8)",
            "Everyone trying to say it’s nepotism is coping so hard 😭",
            "con the f grats\n\n\nHhhhh",
            "Thats my 2021 internship hunt.",
            "Wow! So brave!",
            "based",
            "As someone currently in the process of applying and interviewing - fuck you and congrats, best of luck.",
            "Me too man haha, wouldve been screwed otherwise",
            "I'm jealous",
            "My experience exactly, except that I sent two applications and got an answer for the second one only after I was already done with an interview for the first one.",
            "Fwiw, my mom’s friend’s son got salesforce swe cuz his CS classmate friend was the son of salesforce’s founder and yes the son definitely went back to work at salesforce.",
            "Wait am I late for applying 🥲",
            "guys please help me out. I have applied/interviewed to so many companies but 0 offers till now 😭. My insti has mandatory intern exp for credit. If i don't get intern I may fail my degree 😢.",
            "fuck you",
            "I received one only after I stopped applying 💀",
            "bruh"
        ]
    },
    {
        "post_id": "1c7mcly",
        "author": "Altruistic-Bill9834",
        "title": "They’re giving out deodorant samples at my school’s CS building 😭😭",
        "url": "https://i.redd.it/c4m3ezinpcvc1.jpeg",
        "score": 3060,
        "num_comments": 118,
        "created_utc": 1713495430.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c7mcly/theyre_giving_out_deodorant_samples_at_my_schools/",
        "comments": [
            "Where this at, I might need some",
            "The meme has come to life 💀💀",
            "This is an awesome marketing trick to reach a new market for personal hygiene companies.",
            "the side of me that loves free shit is ecstatic.",
            "Going from BO to Axe smell is like the barest of upgrades. Just use regular stick deodorant people 🙏",
            "People in my college stink so bad, they smell of the local trains, sweat , and worst of it, smell of shoes and feet.\n\nMost people in my batch need it😭",
            "We had an email last week about an invitation to a workshop titled \"the recipe for succesful dating\"... Same energy 😂",
            "Supply and demand",
            "They did this at my school's gym lmfao. With the exact same kind, too!",
            "Ffs it takes 10 min max to take a shower",
            "In my school there were different courses. My IT classroom was so stinky that people in the corridors will complain about it. We had to open doors and windows all the time. I wish my classmates had a hygiene class and free samples too. It has become so bad that other courses didnt want to use same classroom as IT.",
            "As an Indian, we def need this..",
            "I'd donate to this if it was a charity",
            "Does it stink that bad? Jesus",
            "\"Sweet. Now I don't have to shower.\"",
            "Arguably worse. Now it'll smell like BO and excessive use of Axe.",
            "Seriously. The BO and absolute flab amongst CS majors is mind blowing. I started programming many years into my career. Best to be a person first with distinct interests and then programming is either a tool to further one’s interest. Many CS majors now days are nothing more than NPCs on the code scene.",
            "And yet the box is still half full",
            "After much time had passed since undergraduate CS, I decided to go to grad school for CS/Engineering. The first time I walked into the CS/Engineering building was during mid-term exam week to drop off my transcripts to Admissions. When I opened the door to the lobby full of students studying I got immediately punched in the face by that familiar sour foul stench of BO. I quietly exclaimed, “I’m back baby!!!”",
            "Indians in shambles rn",
            "Some of my fellow students would have definitely need some…",
            "I smell myself to check if I stink multiple times per day and own maybe 5 different cans of deodorant.\n\nHow can anyone just ignore their own disgusting smells.",
            "What school",
            "they should've given a manual on how to use it",
            "Id take some BO over axe bodyspray all week long",
            "If they were the white cans I’d take 5 lol; they are the black cans so the aluminum will give me a rash though",
            "Why are they wishing you to have a great dog?",
            "thank god it was circled or I might have missed it",
            "guys where are you from? in Italy adults usually do frequent showers. Even CS majors (actually, I'm in engineering but... I hope it's the same)",
            "Ga tech?",
            "Why’s it always AXE though?",
            "I wish the guys in my lectures had this handy!!",
            "Lol imagine the whole department will now have a signature smell (I mean they already did, but now it will be more distinct than ever💀)",
            "Good research marketing interns",
            "They tried this in my high school and Axe bombs fucking sucked.\n\nThere was always someone who would tape the thing down to spray and fling it into the locker room making you smell like ass the rest of the day.",
            "Take, the hint",
            "Product market fit",
            "Man axe body spray smells foul though..",
            "💀🤣",
            "😂 I don’t use. CS Major.",
            "The bad programmers need those aha, but fr stock up on them because they're free aha",
            "Cs ladies, take 3 please",
            "Walking into my first CS class was like opening the door to a sauna. Except instead of steam billowing out, it was a cloud of stink.",
            "Only those who have turly suffered know this will make the stench worse. There is no solution but to bath like a decent human!",
            "I legit don't get how people don't show down and just out on deodorant. I'm not the pinnacle of self grooming. I let my beard and hair get longer than needed, but I God dam shower daily. I don't understand how people tolerate themselves.",
            "my school has a univ class that all freshmen take their first semester, specifically only students in the cs college have to take it again in the spring and it’s literally just a class on how to socialize",
            "they know whats up",
            "They the same at my uni",
            "I had to take a few CS classes for EE and I could not help buy laugh when i sat in one of my first lectures and the room stank. like it was disgusting. I thought that it was just a meme, but I guess like any stereotype there is some truth",
            "I’d always say, you know if you’re in an upper level class by the amount of BO that you sneak when you enter the room.",
            "That’s body spray. They should be giving out antiperspirant.",
            "That's the rapper, Lil Baby's Axe deodorant scent. Guess it didn't sell like they thought it would🤷🏾‍♀️",
            "Fuckkkk yeah"
        ]
    }
]