[
    {
        "post_id": "1b6n4t3",
        "author": "Potential_Turn8645",
        "title": "New Grad 2024 Job Hunt",
        "url": "https://i.redd.it/8n39fkin0emc1.png",
        "score": 1087,
        "num_comments": 151,
        "created_utc": 1709588655.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b6n4t3/new_grad_2024_job_hunt/",
        "comments": [
            "For context I'm studying CS at UC Berkeley and have had four SWE internships. Recently signed a FAANG offer after a long job search starting last summer. I had a very low response rate until pretty recently so there are definitely still jobs out there!",
            "Got hopeful until \"uc berkely\"",
            "Where do you find 800 applications to apply to ? And do you apply to all even if they don’t fit your criteria ?",
            "That’s hurt. I don’t even have a internship experience",
            "[removed]",
            "Damn uc Berkeley and faang internship .. I’m fcked",
            "are you international?",
            "Which company at faang? I also signed a faang offer and am looking to make new friends!",
            "Mad respect for continuing to fight on! That takes determination and grit to do! Congrats!",
            " The theme I am getting here is that even people from Top Tier Colleges, with past internships still have to send in at least close to 1000 applications to get offers🥹😭🥹 That’s slightly comforting, yet also close to overwhelming, but it’s comforting at the very least. It’s a target number",
            "You have a 1.2% response rate as UCB CS major with FOUR internships. This is beyond fucked.",
            "Were you part-time for a year of highschool then all of uni? ",
            "are all of those application same location? or u cast a wide net",
            "What made you want to search for other jobs having your previous internship give you a FTO? How’d you go about telling them youre working somewhere else because I have a feeling I’m going to be in the same boat you were in next year if I want to work at a big company post-grad.\n\nAlso congrats on the faang offer you made it to the top man",
            "Knew had to have been an Amazon intern 😭 Every company resume rejecting all previous Amazon interns stg",
            "What a shit show",
            "Congratulations OP! Glad you made it 👏🏻",
            "I just got an idea and maybe someone can respond to it. If people in comments are freaking out if they dont have internship during studies, how people without CS degree land a job then?",
            "900 applications is insane.",
            "I think I've applied to 1k+ positions by now as a non intl, but so far < 10 interviews. Is this normal or should I have a diff strategy?",
            "What’s the compensation if you don’t mind sharing",
            "I’ve read somewhere that 40% of job postings are fake.\n\nI wonder how much time fake job postings waste? Wasted time is wasted opportunity and thus money.\n\nFake job postings might be one of the biggest scams of our time.",
            "Is there a software that can be used to track this stuff like this?",
            "The fact this chart could applies to me 10 years ago is insane.",
            "It’s funny how much that looks like a 20 year exp senior swe job hunt.",
            "Man this is depressing. I graduated with my CS degree 12 years ago. Applied to 2 job and got 2 offers. Stayed at that company for 8 years and then applied to my next job and got an offer. Then 2 years after that applied to my current job and got an offer. \n\nFeel so bad for the people trying to start not because it seems absolutely brutal.\n\nCongrats on the W and way to keep your head up.  Hopefully things improve because this is a great field.",
            "Congratulations! When did you start applying? What sources you used to find job opportunities? Thanks",
            "Quick tip- Start documenting your work.  \nThis is what I use- [https://bragyourwork.com/](https://bragyourwork.com/)",
            "There are a lot of things wrong with this.\n1. There simply aren't 800+ jobs that you are fit for. This is clearly a spray and pray approach. It is like someone wants to be in a sports team and applying for volleyball/swimming/cricket/tennis ....teams hoping that some team would hire him. \nFootball teams are looking for football players. Swimming team for swimmers and likewise.\n\nIt is important to know your strengths, interests and also what kind of employee that the company is looking for.\n\nThen the discovery process for the fit becomes easier.",
            "This has to be a resume issue. I go to a normal state school, no internships, no crazy projects, and got a OA from Amazon (which was one of like 5-6 internship applications I’ve done before) \n\nYou may want to check your formatting or something",
            "international?",
            "Hats off to your patience level dude. \n\nNowadays grad applies for like 5-10 and cry saying no jobs out there lmao. They must see this.",
            "Learned on the job at 17. Same industry since. 11 years later on over £100k p/a. Never had to deal with this dystopian bullshit."
        ]
    },
    {
        "post_id": "1botk1g",
        "author": "Pretend_Mushroom3830",
        "title": "just wanted to post my sankey (ended with a faang offer)",
        "url": "https://i.redd.it/pjuct5r44tqc1.jpeg",
        "score": 1087,
        "num_comments": 326,
        "created_utc": 1711514770.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1botk1g/just_wanted_to_post_my_sankey_ended_with_a_faang/",
        "comments": [
            "15 interviews for 33 apps, bro is the other candidate",
            "That's a high success rate of interview to application. You must have some qualifications",
            "Should be required to post anonymized schooling/experience/qualifications/international status(or at least explicitly decline to post) along with these diagrams.",
            "Why your stats so good? What is so special about you? (not being rude, just very curious). Also what is your stack?",
            "Based on reddit history, this person was 18F 6 months ago. This could be a complete lie.",
            "https://preview.redd.it/p67pjt6vsvqc1.png?width=498&format=pjpg&auto=webp&s=4bd1e96d8a6e03cb236d386e04fd275d821298d2",
            "Obligatory fu",
            "How was technical? Just LC?",
            "[deleted]",
            "Downvote me all you want but I really think posting stats should be normalized with this stuff",
            "okay what the fuck\n\nhow the fuck did you just send 33 applications and immediately got 15 interviews \n\nare you born with some HR/recruiter attracting superpower or some shit \n\nmeanwhile most of us are sending 500+ every month and cant even get an email back",
            "fake",
            "Hey Sundar pichai, is this you?",
            "# \"I cancelled Interview\"\n\n&#x200B;\n\nbruh how can u afford the luxury of doing so....",
            "Bro chose OAs, cancelled interviews, and declined offers. \n\nthat’s impressive tbh, top tier",
            "Nice job (not jealous)",
            "Online applications or at a career fair?",
            "Bro flexed on me",
            "Drop the fuckin resume",
            "Congrats and don't listen to the sexist idiots trying to drag you down. They'll never understand what it's like making it through school and work in a totally male dominated field. They'll never ask themselves \\*why\\* there's hardly any women studying/working alongside them, just get pissed when they see one succeeding. Clearly you're highly qualified, and I'd be willing to bet it's a product of hard work. It's also refreshing to see someone who didn't send out 500 applications and then ask themselves after the fact why they didn't get hired anywhere. Some people don't seem to understand the concept of being applying for positions they're actually qualified for.",
            "To add a little context. I'm a junior in college, My freshman and sophomore year my sankey diagrams were insanely skewed. for perspective my sophomore year I applied to 80+ places. i got 3 interviews. 1 offer. my freshman year: around 50 places, 1 offer at a no name.\n\nIts truly not about diversity, or whatever excuse u wanna make, sometimes its just about learning what worked, what didnt, researching, and a whole bunch of luck :)\n\nEdit: I also do go to a good school which really helped me with networking with companies because they host events at our school and recruiters will send coffee chat invites schedules through linkedin\n\nAlso I will not share my resume anonymized",
            "You started college at 15? Lmao.",
            "The cope from some of these bitter weirdos in the comments is crazy lol. Whining about other people's success when they probably get negative scores on behaviourals 💀 I promise y'all, it's not that difficult to get a life!\n\nCongratulations OP!",
            "What degrees do you have? Past experience?",
            "For people saying this isn't realistic, I know a guy who got a FAANG job at 18 after doing an internship at the company for 2 years during highschool, and then doing college studies while working part time at said company. They then got a full-time job at a different FAANG company at 21. \n\nThese people do exist. Congrats on being one of them, OP!\n\nIt was the dream pathway. I was super jealous haha. That guy really was the other candidate.",
            "OP is 18 years old, but is already a 3rd year student in uni with 2 previous internships. Either this post is a completely fake story, or OP is a child prodigy. Their profile is also suspiciously empty with this being their second ever post.",
            "Huge congratulations! As a fellow woman in stem, unfortunately you may meet unhinged bigots like a certain user harassing you in this post. Know your worth and stand your ground, you are not ‘just a woman’.",
            "Can I DM?",
            "Hi what apps/platform is this tracker? i need my own reference as well",
            "I know it’s not super relevant, but what do people use to make these charts?",
            "Stats????",
            "How did you prepare for OA?",
            "OP what’s ur resume?? im a sophomore uni student so i wanna know what it takes to get a FAANG job",
            "for 50% interview rate ??? dam what some serious numbers",
            "Can we see ur resume damn",
            "Can you please send me your resume?😅",
            "Which company did you get it from?",
            "What University did u attend? What’s ur resume like?  A 50% Interview rate is excellent.",
            "lowkey flexing lol",
            "aella has ruined sankey graphs forever",
            "i don't think the school ranking or age would have mattered much to these companies......were your past internships very impressive? Any referrals or connections that helped?",
            "Congrats on Amazon",
            "What app do you guys use to post these?",
            "You had me till, I cancelled interview 💀\nPl get a job",
            "woman that's why",
            "OP is 18F. Explain why. Most CS companies are craving for female to meet ESG score, you like or not, it's true.",
            "Which Faang?",
            "i just posted for fun feel free to pm me with any questions",
            "I'm calling bullshit if she's 18",
            "As another STEM woman, fuck all these haters. Congratulations, I wish you all the best",
            "This is bait, just look at her profile, move on",
            "Why don’t you just say Amazon instead of Faang?",
            "Unless you're some God damn genius of a cs major, this isn't real.",
            "-_- ... I do 33 in 1 day...",
            "Definitely fake… ML requires at least a graduate degree to be even be considered for any ML/AI role. They definitely aren’t taking juniors lol. Get better at lying. They’ll take graduate student interns for sure but not undergrad.",
            "Damn, the amount of gullible people on reddit is crazy",
            "Fake"
        ]
    },
    {
        "post_id": "18bhken",
        "author": "Awelawi",
        "title": "We did it guys",
        "url": "https://www.reddit.com/gallery/18bhken",
        "score": 1084,
        "num_comments": 97,
        "created_utc": 1701798139.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18bhken/we_did_it_guys/",
        "comments": [
            "Congrats!! Also, I can't believe you're using Reddit in light mode.",
            "Lets go bud! Proud of you :)",
            "Can you share your resume?",
            "We? Who's we?",
            "Hey everyone, wow this post blew up! Thanks for all the well wishes. As I have gotten a lot of dms, here's some additional info about me without identifying myself.\n\n&#x200B;\n\n**Stats**\n\n* 3.9 GPA(might drop with this semester haha) but GPA as most of you know, doesn't really matter for internships\n* 2 FAANG Internships(same company)\n* Built a VR experience for my college(campus job)\n* Leadership experience in some clubs\n* Go to a small school so not super popular\n* TA for a cs and a stats class\n* Other non major-related jobs\n* Research experience in an unrelated field(my second major)\n* Building an app that I hope to launch next semester. Talked about this a lot in my interviews\n\n&#x200B;\n\n**Resume screen**\n\nI would say I was very blessed in this regard. I passed the screening for most companies I applied to and either got rejected from some because a. international student(roblox, southwest etc) or skills(janestreet, Meta(as I have not heard back), Lyft, Discord(haven't heard back). So I had a really good screening rate, and I think it's due to GOD and ofc, the name brand on my resume.\n\nI failed several, several OAs and still struggle with OAs, but fortunately I passed some. The companies I went to the final round were Google, Msft, Twitch, Netflix, Linkedin.\n\n**Rejections from final round**\n\nGoogle, Linkedin\n\n**Offers from final round**\n\nTwitch, Netflix\n\n**Pending**\n\nMSFT\n\nSo I am definitely not a leetcode king or whatever. But I have definitely improved since I started my recruiting in august. Here's how: \n\nMy study strategy was not specific to Netflix. But after cramming and forgetting solutions, I took a different approach. I started solving lc by algorithms used, checkout grokking the coding interview: 16 algo patterns.\n\nThen I have an iPad and use notability. So I have a Leetcode book. For every question, I will write down the constraints I put, output and anything that’s helpful to solve the problem. Then I will write down my approach for solving this problem. Once I do both, I come up with a complexity analysis. Then I code it up on Leetcode.\n\nEvery weekend, I look at all the questions I solved for the week. Write what I learned from them, how I solved them and quickly resolve it.\n\nThis might be a tedious process but it’s what has helped me improve with lc. I’m still not great at it, but I’ve definitely gotten better\n\n**Technical Interview**\n\nI have done several mocks on pramp, [interview.io](https://interview.io) and karat. The most important thing is communicating with your interviewer during the whole process. It's ok to be silent once In a while to think, but don't keep mum all through the interview. It's also ok if you don't know how to solve a problem, even If I didn't get the offer it was nice just discussing with the interviewer my thought process. Be very mindful of hints, interviewers drop them a lot and they want to see how you use them. This is where U struggle a lot and ofc sometimes, understanding the problem itself. My practice for interviews is leetcode, CTCI, and grokking the coding interviews. I think that is enough. If you want to get better at OAs, then practice on hackerrank and codesignal\n\n**Behavioral Interview**\n\nThis is the part where I shine. I find it easy to talk about myself so I don't prep so hard for this besides reading up on the company. I maintain eye contact, smile, and just engage with the interviewer. Your body language matters a lot. Ironically, for the two offers I got, I spoke about the app I was building instead of my internships and they really liked it. Initially, I felt it was a gamble to speak about an app that doesn't even exist but it's something I am passionate about. And I guess looking back, the interviewers could tell.\n\nThis is the part where I shine. I find it easy to talk about myself so I don't prep so hard for this besides reading up on the company. I maintain eye contact, smile, and just engage with the interviewer. Your body language matters a lot. Ironically, for the two offers I got I spoke about the app I was building instead of my internships and they really liked it. Initially, I felt it was a gamble to speak about an app that doesn't even exist but it's something I am passionate about. And I guess looking back, the interviewers could tell.\n\n**Reflection**\n\nReflection done with recruiting and hope I don't have to experience this next year. I think in total, I applied to around 60 places. I got a return offer from the previous internship so I was a bit picky in where I applied. I don't consider myself good at leetcode but my approach above has helped me improve. All this to say, I won't be hear without God and favor and luck. There really isn't anything exceptional mentioned here, but I hope someone finds this helpful. \n\n***Please post questions here and I'll answer, I won't be monitoring my inbox. Also, the questions might be helpful for others.***",
            "That's amazing, congratulations!! 🎊 What was your study/prep process like?",
            "![gif](giphy|yBwgX64KAPrHW2ltZ2|downsized)",
            "[deleted]",
            "This is a HUGE flex 🔥🔥",
            "My goal is to be able to crack interviews.Oh and  secure Google , Zurich for next summer:)\n\nCan someone say \"you got this\"",
            "What are your stats ?",
            "Congrats!",
            "Congrats 🎉",
            "Congratulations ! So proud of you 👏👏",
            "Ayooooo",
            "CONGRATS!!! Well deserved",
            "Congratulations 🥂",
            "Awesome, keep strong and be yourself buddy",
            "Congrats!",
            "❤️",
            "Well done!!! Netflix is one of the toughest faangs to get into, congratulations!",
            "Hell yeah brother",
            "Congrats!!!",
            "Congratulations for working through it!",
            "Can someone explain what is this post about? Why are ppl congratulating op?",
            "[deleted]",
            "Congrats man!",
            "Congratulations!",
            "How many leetcode questions did you complete in today?",
            "How was the interview process?",
            "Congratulations! How long after the final did you hear back?",
            "Congratulations! I hope this can be me, but with my dream company :)",
            "Congrats!!",
            "Nice! What was your study strategy - neetcode 150?\n\nAnd did you get a referral or just interviewed after applying through their site?"
        ]
    },
    {
        "post_id": "prj8zc",
        "author": "None",
        "title": "Some of you guys are idiots",
        "url": "https://www.reddit.com/r/csMajors/comments/prj8zc/some_of_you_guys_are_idiots/",
        "score": 1083,
        "num_comments": 132,
        "created_utc": 1632095084.0,
        "selftext": "I just read some kid say he’s gonna decline his Amazon offer because it’s not that prestigious. Another kid was complaining about having the privilege to work at Microsoft. Anybody who thinks like that is an idiot in every sense of the word. You guys need to stop browsing this sub and blind and levels.fyi all the time because you are losing touch with reality. Stop being pretentious, stop being ungrateful, STOP BEING AN IDIOT.",
        "permalink": "/r/csMajors/comments/prj8zc/some_of_you_guys_are_idiots/",
        "comments": [
            "What I wouldn't give to have an offer from any of those two...",
            "Wait, who's shitting on Microsoft? It has a fantastic internship program, amazing return rate, benefits, and pay. Why would anyone not want that?",
            "I think these guys just lick the interviewer’s ass when asked why they want to work at Amazon/Microsoft then brag in this sub how they have offer but don’t really think it is in their level. Deep down they are desperate lol.",
            "[deleted]",
            "Amazon",
            "I thought they were being ironic",
            "It’s cause all of you think you have perceived high value just because you won a hackathon and did a create react app 4 times on your resume. Y’all who think like this are fucking NOBODIES. Your STUDENTS. With NO EXPERIENCE. So to have those opinions and sit on offers and collect them like infinity stones makes you look like an idiot more than “high value”. Yeah you think that company is tier 3? I guarantee their junior dev could run CIRCLES around your bitchass. Sick and tired of these KIDS thinking they’re goated when they can be replaced at the drop of a hat by any of these companies.",
            "If they are not so prestigious then please explain why Amazon rejected me from final round and Microsoft isn’t giving me an interview.",
            "This sub is just a bunch of FAANG-Sexuals who think if you don’t get into FAANG then you’re gonna fail at being a programmer and have to revert back to being a carrot farmer.\n\nThere are plenty of amazing companies to work at that aren’t FAANG that still pay amazing and honestly probably have less stress. FAANG is a bit overrated",
            "If you had a more prestigious offer or company you viewed as having more interesting work it would make sense. If they had no other offers then it would be dumb.",
            "I fucking hate the culture that surrounds this career path so much",
            "Bruh some people don’t deserve to be in this field",
            "half the posts on here are high schoolers or college freshman larping i would not take this sub serious at all",
            "Bro are you serious??? Amazon has no prestige at all. Its only one of the biggest companies in the world? Dont even get me started on how ancient microsoft is and their revenue was only 168 billion dollars(not enough)!!! Also these companies pay a shitty amount for new grads. Who would ever want to graduate and only make 150k a year. I cant believe this sub sometimes.",
            "Lol y’all need to calm down it’s just a job lol",
            "I feel like I’m the only one happy with my Amazon offer lol",
            "There’s nothing wrong with declining amazon since they had multiple unicorn interviews coming up\n\nAlso everything is relative, a person may mess up Amazon final and have to go work for xyz local software company, but technically their job is still better than most jobs out there, they can still vent that  they don’t like their job",
            "People like that don't know what they want, they're going to be unhappy no matter what.",
            ">I just read some kid say he’s gonna decline his Amazon offer because it’s not that prestigious.\n\nI think most people would decline an Amazon offer for Google, FB, Apple, Microsoft, Snap, etc. I don't see what's wrong with that.",
            "1000% agree. Also you gonna learn a lot more working at a smaller/medium sized company then you ever will at a large place like that",
            "I would have fucking loved to have moved on beyond the OA for Amazon. I wasn't able to answer either problem in Amazon's hacker rank. One of them was the most convoluted and confusing question I had ever seen and the other I just flat out couldn't figure out. I haven't gotten anything from Microsoft or any other FAANG yet. Fuck you if you are one of those assholes who thinks Amazon or whatever is a no biggie.",
            "I want the kid who said he was gonna decline the amazon offer because he had interviews at other unicorns lined up get declined from all those places and realize he ended up jobless because of his own hubris and rethink his mindset",
            "All of these things are subjective. I wouldn't let it bother you.",
            "I can't help but agree. Once I graduate, I'll feel extremely blessed to land a job in software development (my dream is to be a developer). That's what I want. Whether I'm stuck at $35k or I make $100k I'll be happy. It isn't about pay or prestige for me. I want to do something that interests me and makes me happy. I can focus on earning more money after I have some experience.",
            "Don’t bother . They are either trying to flex or are completely out of sync with the world",
            "To be honest, all those posts are ironic, and you're taking this too seriously. I'm not even sure if this post is ironic, to be frank. You see posts like that all the time -- \"I just finished middle school, should I start grinding LeetCode?\" or \"The interviewer did not say \"You too have a great day\", how fucked am I?\"\n\nLike, seriously, who the fuck would decline an offer from Amazon or Microsoft when they have no other offers? Nobody. Nobody would do that because they would not have interviewed with them in the first place. These college kids who grind LeetCode 24/7 are fucking desperate for an offer from a top company. Bragging is just an unfortunate side effect.",
            "Had a buddy reject Google because he ultimately wanted to do HFT, and Google isn't the most prestigious enough of a place for HFT firms to hire from. For example, say you come from optiver or Jane street, it's probably a lot easier to make it into Citadel than from Google.\n\nWhile I agree rejecting FAANG for the sake of flexing is pretty stupid and cocky, rejecting them ultimately should depend on your long term goals. It's definitely not stupid to reject FAANG to do what you want to do, and I don't feel this post touches upon that aspect.\n\nOP is assuming that everyone views working Google as the ultimate form of self actualization, and doesn't mention the context in which those people rejected those offers.",
            "Amazon has a horrible workplace culture. He was smart for declining.",
            "I hate this thread. These are companies we are talking about not people. Many of us joined this field to get paid. We will complain and haggle as we see fit. I do not feel bad for trying to get more money out of a company that makes billions.",
            "I would reject amazon personally",
            "Nothing wrong with declining offers. Glad to see someone who can think for themselves unlike most you bootlickers.",
            "I mean no one's gonna reject Amazon unless they have a way better offer.",
            "Why are you straight up calling people idiots? Everyone has a different view of prestige and success. Some people might be happy with a minimum wage job and might consider your standard to be too \"tryhard\". Why are you hating on other people's standards? No maturity at all.",
            "People high here 😂",
            "Okay.",
            "[deleted]",
            "I don't think I've ever seen a post like that ever here.",
            "I think it goes both ways. Idealizing companies is such a weird thing to do. The people bragging about refusing companies are cringey, but why would you take it personally.",
            "Can you elaborate What’s wrong with declining Amazon because you have better offers from other places?",
            "Cringe whwn they complain about too many recruiters reaching out. How annoying it must be to always have potential job offers and change jobs with a higher salary any time you want.",
            "I would think anonymity makes people less like this but somehow it seems to make them more like this.",
            "AMZN",
            "."
        ]
    },
    {
        "post_id": "1cbd6z2",
        "author": "Boredom_fighter12",
        "title": "Taking CS is the biggest mistake I've ever done in my life",
        "url": "https://www.reddit.com/r/csMajors/comments/1cbd6z2/taking_cs_is_the_biggest_mistake_ive_ever_done_in/",
        "score": 1082,
        "num_comments": 502,
        "created_utc": 1713899800.0,
        "selftext": "I am now in my fourth year last semester of Software Engineering and realized too late in my third year that this is bullshit for me and I am miserable it's too late to change courses at this point. Took this without guidance and never in it for the money I just thought it could be useful for me to use. Turns out it bores me to hell and burned me out I think my brain is fried at this point I even genuinely forgot how to do “Hello world”. \n\nI learned too late that I have no interest in this thing I tried so hard to like it but nothing at all works, the more I code the more I tried making stuff the more furious I become, I don't find enjoyment in solving any coding problems and when my code works all I feel is I wanna smash my computer to pieces. My only hope is that I can pass this last semester with straight C so I can get the hell out of here which at this point is more of a wishful thinking since I can't get myself to do any of these assignment, the environment also sucks ass all these people ever talk about is keyboard, money, and whatever tech bullshit I don't give a crap about and when I talk about the outdoors they replied to me \"Have you tried coding outdoors? Maybe you'll like it\". \n\nI think it’s just a me problem, what’s clear is I wasted 4 years of my life and a huge sum of my parents money to pay for my college so far to be miserable for 1460 days all I gotta do is to just stay alive for another 150 days and hope I got all C or they pity me and bump up my grades to C (wishful thinking) I can't do this shit anymore. \n\nIn short I am fucked and I don’t know what to do next since my resume looks so pathetic I don’t even want to hire myself anywhere if I see this resume. On the bright side I found my true interests lies in nature and animals, got me thinking to start over taking maybe agriculture or earth science but I can’t afford to spend another 4 years doing bachelor’s degree all over due to time, financial, and personal reason. I'm not entirely lost just ran out of gas, I  can't go to trade since they pay you with literal cigarettes and rice for that in my country and the military only accepts supermodel with perfect vision and teeth. My goal is to go back to US (I'm from Indonesia) since I used to live there before and I like the state due to the nature and its weather I lived in but it seems fading away at this point looking at my situation. Maybe I should've tried harder but the more I tried the sicker I become it's like a disease. I can see how this thing is useful and I can see how people find enjoyment out of it, it's just not for me. Should've pick another major, I am an idiot don't be like me.",
        "permalink": "/r/csMajors/comments/1cbd6z2/taking_cs_is_the_biggest_mistake_ive_ever_done_in/",
        "comments": [
            "i’ve always had a passion for nature and animal and i took up cs and cyber security for a better future, i’m literally in my first year and i already want to kms",
            "Just cus you majored in CS doesn’t mean you have to be a SWE (this applies to all majors tbh). Explore other opportunities",
            "I feel you man. Research ways to apply CS to your true interests.",
            "I'm sure it feels like a waste of time, but it really wasn't.  While degrees aren't the be-all-and-end-all they used to be, as an employer, I can promise you we still look at them favorably.\n\nI did exactly what you did. Got a 4-year CS degree 30 years ago. Learned I fucking hate coding and have never used it since, other than occasionally recreationally.\n\nWhatever industry you do go into, you'll be starting from scratch,  but the good news is you'll maybe need 1-2 years to catch up, but your career will be 40+ years, so it's really nothing in the grand scheme of things.\n\nTake some time to figure out you DO want to do. Finish the degree and then get your foot in the door of that industry and learn as you go.\n\nYou're not alone. People do this all the time.",
            "Dude. Calm down.\n\nFirst of all, getting a degree is a success, period. And that is because you proved you are disciplined enough to get through it all and this is something BIG.\nYou also have a STEM degree and one of those where you can do whatever you want to. You can play in the garden of everything you like with CS. Heck you could even become a Sales Engineer if you like it more.\n\nAll of these doesn't sound good to you? Do what you like more then, you still have a STEM degree, have fun with it!",
            "switch to bioinformatics, thats what I try to do now",
            "Same I’m depressed…",
            "This happens. I studied chemistry then found a job in CS. It's a technical degree, and the fact that you made it through shows employers that you're at least smart. Find something you give a shit about, and go fo that instead. ",
            "Finish your degree and become a park ranger in the US",
            "gg go next",
            "cs is probably one of the most applicable majors you can take. you can literally do anything you want with it. just stop crying and decide what you actually want",
            "Hey! I was in your boat and I dropped out and regretted it.\n\nBut there's other fields you can pivot into that having the programming knowledge is good, but not necessarily the main point of your job.\n\nI'm a QA engineer and mostly do team lead activities. But it would have been way easier for me to get into the field had I had the degree and found the internship to make the connections.",
            "I'd say try to apply SE to Agriculture?",
            "You can still change your major. Do it if you seriously don’t like CS",
            "A degree is a degree. I am sure many other fields will consider you with a STEM degree, there are some transferable skills. \n\nYou can also do a master in something you’re interested in and then try to get a job in that industry. \n\nUnless it’s something completely unrelated that you want to do, such as medicine, then you’d need to start from scratch.",
            "<3",
            "How tf are u a senior just now realizing u don’t enjoy cs 😂",
            "How do you go for years without realizing “hm yeah this shit is not for me” that should have happened in the first or second year, if you don’t like something don’t force yourself to like it, it’s not gonna happen",
            "Not a CS major in any way, but I graduated with a degree in Criminal Justice and I didn’t want anything in the field after interviewing around so I went into a general banking assistant job and now I do luxury real estate marketing and am pretty happy with it, so you aren’t sentenced into doing stuff that only has to do with your degree.",
            "Kids shouldn't be pressured to figure out the rest of their life right out of high school. I think everyone could use a year off to figure that out tbh",
            "OP, I am a Tech Recruiter in a FAANGish company. I’ve been doing it for 5+ years. I’ve also worked with Graduates for a long time so I know the feeling.\n\nYou’re just passing through shit, we all do. Life is about surpassing it. CS is never a bad choice, you can easily work in Business or Tech when you graduate. It’s up to you. \n\nCS knowledge will give you a different point of view that none of your friends will have if you are working in a sales team, for example. What if you become a good sales man exactly because your company sells software and you know more about the stuff you are selling than your colleagues? This is just the most basic example, there are so many options.\n\nIf I can give my 2 cents, finish CS. In the meantime, try to understand the job market and what you’d like to do. \n\nAs soon as you decide, more time you will have to slowly transit to this field by doing extracurricular activities, courses, networking, applying for jobs, etc.\n\nDon’t worry in “deciding my whole life and career feeling”. Reality is most of us will eventually switch again at some point after 5-8 years if we feel bored which is completely normal and should be considered as it’s. \n\nI’m doing a career transition myself at this exact moment and I thought for years I would retire doing recruitment. Take it easy and enjoy the process.",
            "I'd say, finish the course, then take time to think about what you really enjoy & can form into a career (might take months), then pursue that (won't be easy). A finished CS degree won't harm your chances in whatever you pursue, even if it isn't tech-related.",
            "Just do graduate studies in some type of bio/agricultural technology concentration. Like 60% of people don’t get a job in their major after college so dw you’ll move past this",
            "This was me too a few years ago. Graduated anyways with a CS degree and ended up being a wedding photographer lmao",
            "Hey if it makes you feel better, at least you figured out before wasting your whole life",
            "Just as a slight glimmer of hope, my actual job is like 10% what I learned in school, and 90% dealing with other people.\n\nLook for jobs that are not programming, but are technical adjacent. If you get your foot in the door at most companies you can move to an adjacent role that will be more to your liking (hopefully).\n\nSo don't beat yourself up too bad.\n\nAlso any degree can get you into some jobs. So don't think you HAVE to go into technology or computers, especially entry level jobs on something like gov jobs (if you go back to the US) just having a degree will get you in the door, and you can build up experience in a field you might enjoy more. \n\nGood luck",
            "I quit university 1 semester shy of completing my undergraduate. I was in computer science with a history minor. \n\nGot a job and skied for 2 years, then went back to university and got a degree in economics and poli sci. \n\nSo what do I do now. I built a career starting in finance, moved to IT doing BI and analytics. Now I am doing consulting in those fields. \n\nIt’s not the end of the world. Take a break. Get focused. So what you like and try a bunch of different things. You’re what, 22/23. Trust me… life isn’t over, it’s just beginning.",
            "It’s probably still not too late to change your major. You could leverage the math classes you had to take for CS if you go into another science major too. Also if you make it through the 150 days, grad school might actually make more sense because there might be more ways to pay for your tuition like working as a TA or a research assistant for example.",
            "Just get the degree and apply for random shit.\nGood luck brother. Life is confusing, but stay positive. You’re young and smart and you’ll find something enjoyable.",
            "Is there any way you can pivot to computer engineering even if u have to stay another year?",
            "Go into cyber security?",
            "Finish the degree and get the piece of paper.  Once you get your first job, it doesn’t really matter ",
            "You can be a project manager instead of SWE. They dont code and are just involved in design.",
            "I am deeply confused. How do you not know how to do hello world?",
            "Just apply to other roles, I went to teach CS and Game design, still hate CS but it is easier because I love game design and teaching it is not as demanding as doing it",
            "Im just going into my final exams now and trust me, im the same, i hate CS so much. But the thing is, having a degree is worth it no matter much, and you are not limited to that for the rest of your life. Many good jobs will just want a degree. For me, Im going to hopefully teach english somewhere for a bit while i think about what i want to do",
            "What about product management roles? Scrum master roles? Product analyst? There are lots of jobs that you can do with a CS major that don’t involve coding. \nYou picked a degree which you don’t love and you feel like you made a mistake. That is life. \nYou’re not always going to make the right decision the first time around. That’s part of the journey and the learning curve. I would focus on reframing your mentality",
            "Me too except I like it I just suck at it and I already graduated and was never able to get an internship or any kind of offer with almost 3,700 applications now. I don’t know what to do does anyone know any generic jobs or career paths that have an accessible entry level with a CS bachelors, that could allow room to grow over time and increase my pay?",
            "Oh man. It feels like I wrote this post. On top of it now I got a job and I feel like I am slowly dying 😭 I hate it so much but I spent so much money and time, I can't switch now",
            "Have you considered becoming a business analyst? A cs background is very beneficial, but you are not coding.",
            "Can you combine it? Having a CS degree and then do IT work in a company which does nature and animals?\n\nAlso there is stuff like 'low code' (Microsoft Power Platform, OutSystems) and 'no code' and automation (RPA, UIPath). You dont have to be a 100% code monkey who is doing leetcode stuff all day.",
            "real. i realized decently early in that i was more interested in the business side of tech rather than the software side, but i put off changing my major because i was afraid of disappointing my parents, losing opportunities, and graduating late. i tried to push through but i am now just miserable and losing motivation for school completely. i will now be meeting with an advisor as soon as possible to change my major to something i'm actually passionate about. it's never worth it. kudos to you for making it so far though",
            "at least u spent ur parents money on a cs degree and not a communications degree",
            "After getting a bachelor’s in Liberal Arts, I spent 10 years as a teacher before joining a coding bootcamp and becoming a software developer. Trust me “wasting” 4 years is nothing.",
            "I recommend the book Design Your Life! Recently read it and it was so helpful in really thinking about what I want out of my career and life",
            "You don’t need another bachelor degree, you’ll be fine. Finish this degree and apply for what you really want. A cs degree is impressive and shows grit. The world is not as gloom as it seems when getting a job, you’ll be fine",
            "if you come to the u.s , in california, i think in the central valley where theres a lot of agriculture , there a lot of discussion and programs on using artificial intelligence to improve agriculture 🧑‍🌾. im saying this since its a possible path you can take where you can use your CS knowledge for something that involves nature.",
            "My cousin graduated in Biology and now he works in the cruise because he dreamt becoming a pirate since he was a kid (yes pirate)",
            "when i was in community college i HATED doing CS. I was a CS major back then and realized i was doing it for the money. 1) I sucked at coding and 2) I had no passion and hated it. \n\nI told myself why am i even doing this. Still wanted a career in tech though so I researched different majors and paths ways. Currently at UCSD rn and majoring in cogsci with a specialization in UI/UX. Way more happier but still not sure if it’s a great career… so still uncertainty in that department.",
            "CS is very versatile.  Hey, check out tech agriculture.  And maybe you will find purpose and passion in CS.",
            "I’ll tell you why you hate it. It’s not the SWE or coding that suck, it’s the way school teach that is suck. I’ll be dropping out second years to self taught instead because it’s more enjoyable and useful",
            "How do you forget to do hello world tho..?",
            "\nIdk if this'll help, but since you said you are interested in nature and animals (completely opposite to me), maybe give this project a try. It's called Bird-CLEF on kaggle site. It's focused towards birds (obv). It's interesting and going through the data, kinda made me feel nice cause you go through tons of data of bird sounds and nature. It's peaceful. Your interest can be applied towards research in wildlife and nature. \n\nBecause, see just because you got into CS doesn't mean it is your career. It's just a tool to do stuff. Only see it as a tool, and move into things that interest you. \n\nIn terms of making money, if you are actually interested, move into research and eventually you'll be able to make a good living too.",
            "CS is not for everyone!!! Also there are other well paying jobs other than CS that we need people in!",
            "The vast majority of college grads land jobs outside of the field they majored in.  You can apply for jobs in business or in the nonprofit sector… whatever else interests you.  Your degree will signal to potential employers outside of CS that your are smart and disciplined and that you can rise to a challenge.  You are NOT fucked.  Your whole life is ahead of you.  Get a job in a different field.  Now get out there and impress people.  You earned it.  You will do fine.",
            "Least traumatized cs student",
            "for this exact reason i'm double majoring in enviro with an emphasis on marine biology lol i dont think i can stomach doing this forever and ever- gotta find a niche somewhere",
            "See my previous post \"There are too many people taking CS as a major\"\n\n[https://www.reddit.com/r/csMajors/comments/1btchwf/there\\_are\\_too\\_many\\_people\\_taking\\_cs\\_as\\_a\\_major/](https://www.reddit.com/r/csMajors/comments/1btchwf/there_are_too_many_people_taking_cs_as_a_major/)\n\nDo not take this major if you are not actually interested in the subject!\n\n#",
            "same 😭i'm going to law school",
            "Why are people out here going to school (and into debt) for a topic they don’t have a mild interest in? Makes zero sense.",
            "I kinda am in the same boat. I choose CS bc it was one of my three options to study, I am now in my 6 semester going into 7th, I kinda like coding, but I have had a really hard time learning it, mostly bc I have to work 50+ hours a week and the little time i have left i spend it working out, doing hw, I hate the fact that to get a job in 90% of the CS field you have to pay for a degree where you have to self teach your self 99% of the things. But every day I am still networking trying to get a entry level job for whatever amount of money in this field or something related to it. I just hope everything works out. Even though I have a 3.0 gpa it just sucks seeing other people that have been coding since they are kids just brag about how much shit they know, meanwhile here I am trying to study hackerrank and leetcode easy so i can one day just get the bare minimum.",
            "Maybe you should change majors.\n\nYou will have a hard time getting a well paying job (read: not retail) with a CS degree if you don't go into SWE. \n\nAnd if you double down and finish the CS degree, if you can't do a hello world program you are in for a rude awakening.",
            "You may be burnt out. Take some time off after you graduate; rest and reevaluate. Towards the end of my CS studies, I was so done with it. I even wanted to switch my degree from a BS to a BA so it could be over sooner. I went from loving it to hating it and was burnt out. After graduating, I took some time off before starting full-time and it was one of the best moves I’ve ever done. I went back into it loving it again but you’ll never catch me touching it outside of work. Now it’s just a job that I enjoy and even then I make sure to take vacations regularly throughout the year, especially when I start to feel myself get burnt out again (it happens). I’ve learned to listen to myself more and edit along the way. \n\nGive yourself some time for you and try again if you feel you can, otherwise move on and that’s okay :)",
            "I went to school for 9 years of my life. I wasted time and money when I most needed them. Now with a MSc in CS degree I know for fucking sure that one can learn all of the actually useful stuff in 90-120 days and dodge dealing with arrogant professors trying teach from text-books from 1980s.  \n\n\nI came up with [https://corelayer.pro](https://corelayer.pro) ! I'm building this first for myself. I want to build a computer from first principles. I want that trophy. At the same time why not document it and help other people escape the stupidity of \"What programming language is best?\" kinda stuff.",
            "I am a CS major and a Senior/Lead Software Developer with over six years of experience. I also live in the US. I was laid off three months ago, and despite my efforts, finding a new job has been incredibly difficult. I've barely received any phone screenings, and I can assure you it's not due to my resume. The job market is currently very poor, and I don't foresee an improvement anytime soon.\n\nYou're right in your observations, but let me add that the situation worsens as one gets older and takes on more responsibilities, such as bills and homeownership. The competitive market and evolving technologies have made it increasingly tough for experienced professionals and also new devs to break-in. AI makes it worse.\n\nMoreover, computer science is proving to be challenging when it comes to job searches and interview processes; there seems to be a lack of standardization. Many senior developers are realizing the new difficulties in the field, changing their earlier perceptions about job security and how 'great' this shitty major they thought it was.",
            "I have a CS degree. Hated as well. Too late to switch. I have a tech job but it’s not SWE. Idk how much better it’ll get, it’s not like I’m actively ecstatic about life. There’s some really bad days, but I think you’ll survive. Especially when you get paid. If you can only get a CS based job, just use the money you get to really do what you enjoy on your time off at least. Im not sure what half these comments issue is to tell you to stop crying/whining, when it’s from your life being fucking miserable. “Man up” doesn’t need to be the answer. I get it sucks. It really does. But now you have to aim for alternatives, and they do exist. Hope it gets better & you get to experience more enjoyment.",
            "I’m in the same boat :/ spent three years pursuing cs and I decided to switch to mis and business instead all those classes I took, money spent, time spent just down the drain. Im currently taking classes to switch my major and I’m already feeling so behind compared to my peers my self esteem and ambition is just depleting.",
            "I have a masters degree in pure maths, absolutely loved it, but I knew academia would make me feel stressed. So I choose the easy path and am know a \"Data Scientist\" aka writing sql scripts for a living. It is not very exciting, but it pays well is easy and I get to work from home a couple of days per week. \n\nIm not excited about my job as I was excited about my studies, but now I have other hobbies outside of work I can pay for and that I enjoy. \nAlso if you graduate with a swe degree it doesnt mean you have to code for the rest of your live. Plenty of product development roles if you are more into the softer roles. You can do standard IT work. I know a guy who has a cs masters he is currently doing compliance work for one of the big fours he's earning 2-3 times salary of a swe and he is not doing a lot of coding I think.",
            "This is exactly why i tell people who are considering going into CS to learn on their own, try to build something before they enroll in the degree. This is one of the few fields where you can *somewhat* get a taste for what youre in for before you enroll in college and get a job. I see too many people go in blind and end up hating it",
            "if you’re interested in the more earth sciences & environmental sciences, ecology, geography, biology or nature sciences, etc., **highly recommend looking into r/GIS with your CS background**",
            "Thats what Ive been telling all my friends who are thinking of taking CS. I knew since I was like 8 i was probably gonna major in CS because my dad was a computer programmer (he'd give me programming books since i was a kid), but i see so many people just getting into newly without any prior expierence. It's not even that it's difficult, tbh a monkey could do CS but learning it in college along with the facrt its incredibly boring is what weeds out so many people",
            "Accounting Major here who switched to CS. Love CS, hated accounting. Worked in audit for 3 years, got a Masters in Accounting, and a CPA for nothing lol\n\nIt's never too late to try something different. Better to learn and recognize it sooner rather than later so that you set yourself up for happiness later down the road :)",
            "Same situation. In my last year. Have one more semester to go but no life in me to even do that. \n\nI am focusing on getting into operations kinda role. CS background will help. \n\nYou did MORE THAN ENOUGH. \n\nHard work is overrated coz it blinds us to the possibility that the path is not right for us. If the path is right for you, there is this strange sweetness in hard work too. \n\nSo just drop it. Companies hire you with 100 credits too. Be upfront. 2024 is all about skill. Find a decent HR role or Operations role, keep your cost of living as low as possible. Allow yourself to explore your true interests. And find internship or shadowing or entry role in that field eventually and switch.",
            "I would look into GIS, remote sensing, and regulatory compliance. Not as lucrative as a CS role, but fulfilling and a good stepping stone.",
            "I feel u bro...\n\nI completed my degree and selected cs because of my laziness and it's perfect at that time.\n\nEverything was fine and I got a job and worked for a year.\nI quit the job due to stress and I hate that job very much and I have no interest at all.\n\nEveryday I do the same task and I don't find any purpose in it. I find no meaning in writing codes to a stupid company that solves problems for another company 🥲.\nComputer science is a great field but most of the jobs are pathetic🎳.\n\nNow I am trying to switch careers into maths or physics as I am better at those , so try something that works. \n\nIt's not like we die tomorrow,so chill out.",
            "You're not alone, man. I'm feeling the same way. I honestly had an interest in criminology/law enforcement before I even started CS. I now realize I don't have a true passion for software engineering or other CS subjects. However, I think I'll just finish the degree and find a way to use it for law enforcement, especially since a lot of 3 letter agencies actually like CS degrees.",
            "Genuinely curious, how did you not realize this after your freshman year?",
            "Semangat bang. Been in your position once, but the important key is it is okay to take things slowly instead of comparing yourself to your peers.",
            "I've been in a similar position to you, though I didn't get very far in my CS degree. I think you would be surprised how many of your credits could transfer over- it took me about 2 years to get my current degree in environmental science since all the engineering specific classes I took just counted as electives, and I could have gotten it even faster if I took summer classes.\n\nTalk to your advisor about how unhappy you are, or maybe talk to different advisors for more outdoors oriented majors. I think they would be willing to work with you to design a track that can get you doing what you want to do as soon as possible. Whatever happens, I feel confident that it won't take you another 4 whole years.\n\nEdit: a lot of people in my field use R and sometimes python. there's a lot of statistics needed to. the skills you have now should help you, if you do decide to switch",
            "Could be worse. It could've been your own money you wasted",
            "I did my first degree in Geology(Earth science), and worked in the field for a while before going back to school for CS, in which I work now as a SWE.\n\nAll I'll say, as somebody who LOVES the outdoors, is that field work sucks major ass. It's one thing to be outside for pleasure, being in cool places and doing fun things.  \nIt's a complete other thing to be slaving away in shit weather day after day in the middle of nowhere, having to stay in tiny towns/Man-Camps(You won't be doing any of the cool stuff you do in classes either, I promise you) making absolute shit wages. To move into any job worth a damn, you're also going to need a master's degree at minimum. After a while it wears you down completely, by the end, a lot of my days off, I didn't want to do any of the outdoor recreation that had brought me joy beforehand(Mountain biking, hiking, etc.), I barely even wanted to do anything at all!\n\nIn the end, it's better to make decent money in a (relatively) easy job then use your free time and money to do the stuff you enjoy doing on weekends or vacations, like going outdoors. That's what I do and I'm way happier than I was doing field work.\n\nAs for future prospects, IMO, your best best is to use the CS degree for something adjacent, but still applicable. Data analysis, GIS, etc. Nothing says you HAVE to be a SWE with a CS degree.",
            "Almost there, find the strength to get your graduation degree. \n\nThere could be jobs in departments and remote locations where you could be in nature and also shine with your CS background.",
            "So are you majoring in Software Engineering or CS. It’s two different degrees right there",
            "As a CS major I can tell you it sucked based on what school and professors you get but I guess what were you looking for from CS?",
            "How old are you? Because you can literally even at 50 or up get into anything else. Is up to you.",
            "You don't need to know much to get into agriculture, aince you're from the US, work, make money, invest in an agricultural project, buy a land and fill it with trees, this is what I myself intend to do.\n\nEdit: another thing, you might not need bachelors, tey taking a 2 years online course in agriculture if that's available to you as you work maybe that can help you.",
            "Have you considered that the field wouldn't be nearly as bad if you weren't stuck working on shit you had no interest in? College fucking sucks. It's not fun to do shitty busy work when you can't find the value in it. \n\n\n\nBut the career isn't the same.",
            "Most people don't work in the field they got their major in.  Chill out.  You are young.  Things will be fine.  Have some perspective.",
            "Weirdly I'm a bit opposite, this is exactly how I felt after I completed Mechanical Engineering and my solution was to take Computer Science - which I ended up loving.\n\nThere were so many overlapping courses between Engineering and CS that I only had to take half the number of courses to get my CS degree and finished in 2 years.\n\nMaybe (after staying alive for the next 150 days) you should look into other degrees that might overlap with your CS degree, these will likely be other STEM majors. I booked an appointment with someone from the Registrar's office at my school to figure this out and it was extremely helpful.",
            "A cs degree has prestige, people believe you're smart when you have one which opens doors to other careers too.",
            "man I feel you!  I have never experienced anything similar in my life , but I could relate so much. It bleeds from every single word you’ve chosen. \n\nI would advise you to take a break for a week and reflect on how you feel. Make a choice after that and stick to it! Trust your guts. But also don’t forget that there is a lot of validity to what other guys lightly touched upon in other comments - we live in a society where ppl think that you are substantially more clever if you have a technical degree rather than any other. ( I would argue with the assumption, tho it’s a widespread one in corporate setting)\n\ndon’t forget- the world is your oyster and you are young ,even too young (hence the uncertainty about life decisions). You sound intelligent human and will succeed in life. Trust me",
            "Try Data Science",
            "You could try and get a job in consulting or something else on the business side. I do that now after I realized that I didn't like programming during my bachelor's in computer science as well lol. I went and got my MS in IT/Cybersecurity directly after my BS and enjoyed it a lot more than Computer Science. I was able to get an internship in cybersecurity consulting based on my MS degree without having any experience or internships before that. I really enjoy doing consulting since it's basically being on the business side of the tech world.",
            "You can literally apply CS to everything. You're a lucky binch who decided to major in CS. Some of us studied GENETICS and now have to suffer and beg to get into any technical role.\n\n\nYou can work in ANYTHING now. You can be a bioinformatician. A data scientist. A software developer. A tech consultant. An analyst (in literally anything). A salesperson. A solution architect. A government worker. You can apply for a masters in something specific or just pursue it. You can be  healthcare analyst, a front end designer, a computational linguist, AI developer, bitcoin scammer \n\n\nBruh just grind. Every job needs technical skills. It's always amazing to market yourself as technically competent for ANY job",
            "Just because you studied CS, it doesn't mean you must work at something related with what you studied. \n\nYou could do 'green consulting', environmental analysis, work at any company that deals with sustainability, B Corp, circular economy, renewable energy, hell, pretty much whatever, my dude.\n\nA CS degree actually shows you have been able to develop great problem-solving abilities, abstract analysis, you are tolerant to frustration (if you were able to make it this far) and many more amazing skills.\n\nA lot of people who study CS end up getting roles in Operations Research, Management, Chain Supply, Consulting, Customer Success, Data Analytics,  Marketing, Sales, User Experience, Finance.... I could go on forever....\n\nJust open up your mind, apply A LOT and do your research in the fields you are interested in. Reach out to people, take advantage of your last semester and go to meetings, do networking, talk to your professors, go to events, attend talks and conferences, go out and try to meet people outside of the CS and STEM field. Your possibilities are literally endless if you want them to be.\n\nStay strong buddy, keep your head up, best of luck!",
            "I did 7 years of mechanical engineering before realizing it wasn't for me. I thought I was fucked. It turned out okay. \n\nYou're not fucked either. You'll be fine.",
            "Same. Of course I joined when the market went to shit so I essentially fell for a scam. I was in this major way too long and its boring as fuck. I find flying helecopters and planes for a living and putting out fires more interesting than sitting on my ass in front of a computer all day. Genuinely dont know what to do I'm 23 now this fucking sucks. Wish I had more guidance growing up.",
            "I was like this in school. Then I graduated and got a job. Now I love coding.",
            "Hey OP, if it makes you feel better, there are other tech jobs that aren't Software Engineering. You can do Cybersecurity, DevOps, SysAdmin, Data Analyst, Data Science, Project Management, AI/ML, etc.",
            "I’d suggest taking a look into project management. Many organizations look to hire pms with technical knowledge/degrees and it may give you an opportunity to transition into what you want to do in the future.",
            "Same just took on a janitor position now at Whole Foods paying 16 hour. Better than than 0 with cs",
            "Hey OP, consider these posts/comments based off your comments I’ve read:\n\n[Agriculture + CS](https://www.reddit.com/r/cscareerquestions/comments/8zl4c6/are_there_any_careers_that_involve_a_mix_or_merge/) + [Additional Fields in Agriculture](https://www.reddit.com/r/findapath/comments/ycqw3m/comment/itos0km/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)\n\n[Mass Collection of “outdoor” jobs if you look deep enough](https://www.reddit.com/r/cscareerquestions/comments/13jp3ud/tech_jobs_that_have_to_do_with_nature/)\n\nIf you find it appealing, computational biology (bioinformatics) could help, or something along the lines of data (engineering, analyst). You can apply cs to practically any domain, find your niche :)",
            "Don’t worry bachelors is like the test pancake",
            "I felt that way for a bit while I was in college. I was so frusterated but I stuck with it. I slowly started getting better though. You have to have something inspire you to motivate you, like a goal that being able code will help achieve. Any disiclipline will require alot of focus and patience.",
            "I was like this to some degree, do you like making stuff? School is not like the real world. If you like making stuff you may find yourself back in love with cs after college. College was total bs (I did undergrad and ms in cs, and was miserable every day of it). If not- it’s not too late to change to another job. you have to explore what you like after college and be honest with yourself. Super hard when getting pressure from parents and family friends etc. but it’s the single most important thing to do. Do not feel bad about the money your parents spent. Whether it’s scuba diving or whatever just find an industry you love and live below your means. You’re not in a bad spot but have to get involved in something that’s challenging and rewarding and don’t give up until you find something. Meeting people will help you. Buckle down and finish your degree. Then take a long break after college to sleep and let your brain reset. If you can’t afford a place don’t be scared to sleep in your car.",
            "![gif](giphy|sJMjSALtWe8NtR6kv4)",
            "I'm not a CS major so I won't pretend I know the grind. But as a working professional in tech, CS major is still one of the most valuable. You can apply it to many things–Data Science, UX Design, product manageement. The problem probably lies if you want to do something completely different than that. But I wouldn't stress too much about your major.",
            "try game dev",
            "Another crybaby on /r/csMajors is anyone surprised. “I spent 4 years of my life and my parents paid for college”\n\nJesus, entitled much? Just take the degree and do with it what you will",
            "You could be me who switched to economics to do jobs on the computer that are more boring but at half the pay",
            "Its never too late you already have most of your credits completed…\n\nYou can literally pivot to anything. You have a narrow perspective. Many older students in their 30s, 40s, etc are just starting out.\n\nYou can probably pivot to stem majors easily and if you really wanted to you could do nursing in 2 years lol  \n\n Try to think outside of your experience…  Switching majors will at most set you back a year or so.",
            "A CS degree qualifies you for any business job you’d like… you don’t need to be a SWE",
            "Feel like I’m taking years off my life in stress and dissatisfaction only to find I can’t get a job anyway. How fucking cares anymore.",
            "Do healthcare/trades?",
            "Me:\n\n\nBored - Code something \n\nLazy - Code something \n\nHorny, no porn - Code something \n\nDrunk - Code something AWESOME",
            "It’s a job bro don’t give it any more thought than that",
            "You can pretty easily change careers. You're likely quite young based on your description",
            "“Of my parents’ money”",
            "I have CS friends that didn’t like coding, but now work in product/project management at large tech companies. Your background would be valued for roles where you work adjacent to SWE",
            "If you interested you can try check out some online courses at Caltech - the California Institute of Technology in partnership with Simplilearn . Link [https://ctme.caltech.edu/individuals.html?program\\_type=3](https://ctme.caltech.edu/individuals.html?program_type=3) For more info Reach out to     [rakshith.gaikwad@simplilearn.net](mailto:rakshith.gaikwad@simplilearn.net)    Mention referral code “SSA”",
            "Mix computer science with an interest then you stand to be more unique and hate your self less",
            "You can go anywhere with a CS degree if you’re from a top university \n\nIt’s a very powerful STEM major, period\n\nYou can even get into PE like my friends",
            "Try to make it work for a few years and move into management.",
            "That’s so sad because my passion is on cs but my major is not it",
            "It’s not too late to change course. I went through economics BA and MS and ended up as a Software Developer at 29. You can always change course.",
            "I used to feel like this in college and I even carried this mindset into my first job. However, a little over a year in I began to settle into the rhythm and grew an appreciation for computing outside of work.\n\nOnce I got into building a PC and learning about different operating systems I actually started enjoying engineering. I think this is important to know because in general software engineering is a good profession and it might be worth sticking out.",
            "you have to discover something you like, then pursue it. Simple as that",
            "> never in it for the money\n\nAh famous last words.",
            "ok, the things people always forget is that it's an engineering degree : that means you're fit to solve problems, hard ones.\n\nYou didn't take a 6 months youtube course and claim to be a software engineer.\n\nI've seen friends of mine going through mechanical engineering and then MBA and CFA certifications : obviously, at the beginning they took small jobs as a SE. But fast enough (like 2 to 3 years), they became director etc... And I know one of them own his own business that sure does things related to his degree. But he has people to do that, he just run the company.",
            "What about get a master degree in what you truly passion in?",
            "Go into the product and agile side, so that you can avoid the code itself.",
            "people change careers at 40 its never too late, try to fet a job and make some money while you learn something else you are actually interested in, also make sure you arent just bored of whatever ur working on and not cs in general",
            "You are not “fucked” and you didn’t waste your time.  If you left your degree program knowing what you what your passion is then you succeeded.  That’s a big part of going to university.",
            "You probably are experiencing clinical depression and should try to deal with that and reassess your feelings about your life, career and study when you have it under some degree of control. ",
            "Hey I spent 6 years on an undergrad and a masters only to realise I don’t actually want to work in that field. I am now in the process of doing another degree in something I enjoy more. I am lucky that I have ‘free’ university though. Don’t forget you can always retrain and do something you’re truely interested in",
            "You could do IT for a wildlife focused company anywhere in the world",
            "Hey, learn GIS, closest thing for IT people to connect with nature 😂 Im a SQL dev/DBA, and at some point in my career, I experienced GIS. You might be interested,  we used it to map flood-prone areas. Its not programming, mostly sql scripts, and the logic you learned from the CS degree and the \"degree\" will help you get in the door.",
            "honestly CS Major subjects suck, are boring but they also have not much truth in the real world as to how things work. The real word is better. Learn Fibonacci. You'll use it twice a month. Instead of sitting down and talking in class, stand up and talk. Stand up and listen. Just stand up and be prepared to stand and deliver.",
            "So far…",
            "Then switch your major.  It won't take another 4 years but it might take another 2.  This is because there are university core requirements that all majors must take.  These would be the basic English, Math, humanities, etc. courses that make up most of your first two years of courses.  You'd only need to take courses in your new degree.  Speak to your academic advisor.\n\nOr take a different master's degree.  I have a CS degree and an MBA.",
            "What you do in school is often far different from what you will do in your career. CS also offers like 10 plus different career paths all mentioned in the chat that are not swe. Try to get a job in the field and see if you actually hate it when you are paid to do it. If you still do, work towards a new field but atleast you will have a job to support yourself. Plus remote work if you can find it, allows more freedom than most other careers in this income range. Best of luck, no need to panic, just come up with a plan and stick to it. \n\nSide note, most likely you have several credits that could be used for an electrical or computer engineering degree. If you can stomach the one to two extra years, pursue another degree as a post bachelor. Cheaper and less time than COMPLETELY shifting to a new field .",
            "![gif](giphy|XOys8CeUrElIk)",
            "Just get ur degree. Don’t leave that behind. Next thing u do is get certification, for example, Solution Architect in any of the cloud providers: AWS/Azure/GCP. Whenever u want to learn something new, see if u can get certification in it. Most ppl are lazy and they won’t get certified. U will have an advantage over them.\n\nJust fight through and get ur degree. My friend couldn’t write a hello world program upon graduation from CompSci degree. Now, she is professor of CompSci dept and has PhD. You have already come this far.",
            "Why must it be one or the other, nature or technology? Why can't they live in harmony? Bioinformatics may interest you.",
            "Fly to the US and learn to trade Forex",
            "I'm going with the tough love response.\n\nYou're almost done; just put in the hard work to graduate and move on. You have a skill that's high-value, a high value skill is never a waste. And, often you can take advantage of intersectional knowledge. So, if you have passion elsewhere you can study that and may find that you're able to excel in that field due to your computer science intersection.\n\nAdditionally, you're wrapping up school during a truly revolutionary time in human history; for the first time in human history, we're on the brink of human brains being deprecated in favor of machines in the form of AI. This is profound.\n\nAbove all else, one day you are likely to find that having the skills to survive and perhaps support a family are the most important things you can have, and frankly a privilege most humans never have and most living humans in 2024 still will never get.\n\nYou may not love it, but these past four years are a foundation for a more secure future and that's nothing to take for granted. They also do not stop you from moving forward and doing something you love. Your attitude, on the other hand, is self-sabotaging.",
            "A BA/Bsc in the bag can allow you to read postgeade in an acceptable subject. One that leads to a job where you don't need to do the coding, but managing businesses/people who do the actual work. \n\nThere's also thinking that there are 'haves' and 'have nots' simply designated by having undergrad, or not. Be glad to be in the group with more chances in life in 150 days from now.",
            "[deleted]",
            "I on the other hand, followed my dreams and went into the culinary field. Took me 10 years of long hours, shit pay, and resulting depression to dig myself out of that hole and into software development, and I constantly regret not having jumped sooner. \n\nMuch better pay, endless possibilities, the ability to work from home and spend time with the kids.\n\nThe point is that what’s valuable to you when you’re young, unencumbered, and still at school, will change as you grow older and you have others to care and provide for.\n\nBest of luck with whichever path you choose.",
            "Do what you want. It’s your life and it’s important to carve your journey intentionally. Learn those other studies even if it’s just for interest. \n\nBut if you remotely understand code even if you do it poorly it’ll be a fairly easy career with good money. Imo I hate it and in college didn’t like actual coding but was semi interested and liked the theory. I’m not a passionate software engineer but it’s an amazing career when compared to others. The lifestyle you get for really basically doing ez and more interesting CS homework is nuts.",
            "Maybe data science careers that have to do with nature? Like a conservation or environmental agency",
            "Your major and your career are two different things. You went to college to learn how to learn, and think critically. Your focus was CS, which it sounds like you don't want to do for a living. That's totally fine.\n\nI'm guessing your school has counseling services, as well as career counseling. Go to them. You have a chance to plan out the future you want, and the best path to try it. I think the statistic was that more than 80% of students change their major at least once, so you're in perfectly good company. Heck, Bill Gates went the other way, dropping out of Harvard to start his company.\n\nI think the bright side is that this may feel like a big mistake, but you'll make bigger mistakes in the future.",
            "Just finish the program no matter what , get your degree and then pursue whatever you want",
            "Maybe try data science applied to biology, like combine whatever skills you acquired during those 4 years with your passion for nature, here for an example is a competition for whale identification : [https://www.kaggle.com/competitions/humpback-whale-identification](https://www.kaggle.com/competitions/humpback-whale-identification)",
            "No its not. Are you single by any chance ? If you are that my be the reason your not following through with the program. Get youtself a wife/husband and you ll be the most motivated effer ever.",
            "I have a similar experience like yours, but in a different course. I have a deep interest, in CS. I have started from an early age, 12, learning the LOGO language with Apple ][e. I have computer language lessons every year from at point until 17. \n\nWhen I was doing a preparation course, somebody made me the wrong choice, choosing a Mechanical Engineering course instead. I was like having no mind at all, choosing it. Maybe some special gaslighting method, I am not sure. I found out about it, recently. Maybe some people made me do it, by persecution or maybe by some righteous cause.\n\nI have wasted 6 semesters or three years, to have gone through the ME course. I am fortunate to be able to enroll in an IT course at a different education institution after getting kicked out of the university.\n\nI forgive all that was involved in the incident, if the religion permits it. I have some good experiences and a good network of friends during my tertiary education. It teaches me about hardship and stoicism.\n\nPlease read my [comments](https://www.reddit.com/search/?q=author%3Abackground-intern-56&type=comment) in other threads,  [educational](https://www.reddit.com/search/?q=author%3Abackground-intern-56+Mechanical+Engineering&type=comment) experience in university and my [work related](https://www.reddit.com/search/?q=author%3Abackground-intern-56+employment&type=comment) experience. Only if you have the time and if you have any interest.",
            "Brother your life is not fucked at ALL. You have your CS degree and maybe after your graduate you can excel in the field drastically without the academic pressure. Just calm down. You might get into many interesting jobs with that degree in your resume. (Related or unrelated).",
            "Finish it and at least you'll have the paper that says you graduated. Don't give up since you're already at the end of the degree, so your parents will feel proud and won't feel like you wasted the money.\n\nYou can definitely apply all you know to nature and animals, CS is not just coding in consulting and it's totally normal to feel lost.\n\nBut I may say, even if you don't do it for the money, these careers give you a lot of financial freedom. For me I want to use the money for helping my family when in need, hobbies and traveling ñ.\n\nHopefully build an app or something to hit the fan and gain some financial freedom.\n\nI don't think that if I would take something different I could do everything I do now.\n\nI do like the idea of nature more and traveling, but I try to separate work from the stuff I like because most of the time you can't really make a living from combining both.\n\nBut there's always a balance to find there.\n\nTake care.",
            "Here’s my take - if you still want to be in STEM, something where you’re going to make a lot of money like in some kind of medical program will be harder, but at least you will have a community of people in your field. Friendships will dissipate some of these depressed feelings. There is not any sense of in-person community (discord doesn’t count) in this major. Before someone says that’s just my experience, I've seen all my professors try their hardest to match make their students with each other - ice breaker over ice breaker, and not much comes from it.\n\nThere are no fun late night study groups because there’s not much to “study”, no camaraderie, no building each other up or career help, yet you don’t have time to talk to people outside of school because the projects take up so much time. Coding alone is just better imo, but it leaves you feeling empty.",
            "I took animal science major for undergrad ( got my degree in the US) because of the passion towards animals. But the career prospect is so bleak that I had to switched my major in grad school.",
            "My advice is, take as many credits as you can from this study and it is never too late to change as you will be miserable working in something that you don't enjoy.",
            "I went the opposite route, Masters of Music performance. \"Do what you love and the money will follow.\" It's the biggest sham sold by the boomers. \n\n\nDo what no one else wants. People have high salaries not because what they do is hard or because they have a ton of skills; they have high salaries because they're hard to replace.",
            "I’m sorry you’re feeling like this. I’ve been there and what helps me is to first take a break and then try to pull the problem apart. For right now, try to focus on the things that make you happy. You probably feel like your life is fucked and doing anything else is just distracting yourself. Allow yourself to be distracted. Spend some time doing something you love. Are there hiking options nearby? Does your college have a vet clinic that needs volunteers? An animal shelter that will let you go play with a dog or cat? As ridiculous as it sounds, is there a petting zoo nearby? Just go be happy first.\n\nWhen you have a clearer mind, you can approach this again in a gentler manner. Finishing your degree will at least be proof that you have intelligence, diligence, and problem solving skills. If you don’t want to work in tech at all, you’ll need to be a bit more convincing in interviews for other jobs but this is not hopeless at all. If you do end up in a job you hate, it won’t kill you but it will make you hate yourself and then others. In that situation, use the job to live but try to give yourself an end goal or date to get out. It’s easier said than done, but I’ve been in a job I hate for 15 years and I wish I had listened to myself and everyone around me at any point along the way (finally starting a second degree now for CS, 15 years after graduating college).",
            "I hear this a lot from my peers who cheated or did just the bare minimum go get by, usually failing but then getting saved by the curve. Maybe that's you or maybe you were just too scared to change majors.\n\nEither way, if you hate coding, you can look for jobs doing other things. Data science, business or systems analysis, product management, IT, DBA, etc. They're all no or low code jobs that value a CS degree. \n\nOther jobs value any degree and offer decent career paths, like sales, customer service, or food service. You'll make less at the start, but your degree should make you more promotable.",
            "Suck it up and finish your degree and then do whatever you want. It’s so worth finishing the degree. You HAVE to finish it even if you never work as a coder.",
            "I think I’d still like to do something in a CS related job. Nowadays every newcomer hears about software engineering when there is so much more that you can apply your degree to. Though I won’t lie, I am also at that point in my academics where I’m questioning if I should stay in the program or drop/switch out. 99% of it comes from lack of skills to apply. I realized I’m slacking off a lot and not fully spending my time digesting the information. I also have used AI before to do my homework cause I was too lazy to even try for myself (or just didn’t even know in the first place because of this domino effect leading to this chain reaction of cheating). I also noticed that my peers in my CS course are always doing some sort of coding, even if it’s not for the class. This one guy in my maths course takes notes in LaTeX which impressed me. I just never do stuff like that. Kinda mad at myself for not doing it tho. I think I would like to do stuff like that though (I’m just lazy). I noticed that in my maths courses I spend more time there than my CS and I actually try to learn stuff. Funny enough I’ve had thoughts of becoming a teacher for maths or just a tutor. I think I would like to help people in that regard. But I also like tech, so I don’t know what job would be good for me. I like tech in the role of the consumer. I was never fully like my dad, wanting to know how everything worked (the engineer mind). Yes, some things I think would be cool to know, but not in a way so much that I would become a mechanical engineering major or something. Today the majority of people do CS for the financial aspect. I mean I am too in that sense. Who wouldn’t want the choice to work from home (specific jobs)? Recently, one of my teachers told me that in my years of college, I would know what I would want to do by the end of it. That’s true. I think I do belong in an academic setting in the STEM field. I chose CS for an interest in tech, but also because I need the money as anyone else does too. I mean sure I have hobbies outside of stem. For example, I like to play piano, but I couldn’t make a career out of it if I wanted to. I had to be realistic.",
            "Ironically I took biology(premed) and regret it. I wish I took CS. What you CAN do is do product management which has 0 coding and pays well tbh.",
            "what is a good alternative?",
            "I didn't like it as well. But I haven't been jobless since I graduated.",
            "Just tough out the degree, it’s a valuable degree you can use in other industries",
            "A degree is a degree. When applying to jobs, you will get to the top of the pile of resumes with a CompSci degree. Utilize that to find another industry to work in and you’ll be just fine.",
            "[deleted]",
            "yo try scientific computing/bioinformatics. good way to give coding a purpose for the biology stuff you want to enjoy. There’s so many applications of compsci to ecology and biology! Look for any Marine bio research opportunities that have you code/create pipelines for analyzing data!",
            "Same boat here! I knew i was never a CS person right after highschool graduation but picked up CS because i saw it as a foundation for literally anything. \n\nWouldn't say i hated it as much as you did, or did as bad as you did but certainly discouraged after constantly hanging around people getting near 100 in this degree, HOW? \n\nBut the things i've come to terms is that:   \n1. The degree is like a tutorial to your CS related job, i realised i know NOTHING about anything when i started my internships.   \n2. There's no such thing as a bad coder, but only someone that doesn't want to learn.  Sometimes all it takes is a different mindset, easier said than done. This point will definitely trigger the OP. \n\n3. I HATED backend development, trying to grind leetcode and i just can't solve shit. There are so many different fields in CS, management, scrum master, forntend, security, UX/UI design, Mobile, AI. Why not switch around these different fields to give yourself some hope? I was fortunately enough to realise that though i'm not that good at coding, i really like doing frontend.   \n4. I am also a very young person, but what's wrong with taking a few years off to find what you like? If nothing anyone says about how to fix your career in CS is getting to your head, try a different profession! My sister just graduated her second degree and she's about 29. Getting her first job and all. But everyone's circumstances are different. \n\n  \nAnyways don't think too lightly of yourself, i would say majority of people doing CS is in your shoes, and comparatively no one can reach those that get nearly 100 WAM in CS. But what can the rest of us do? All that matters is to capitalise on your 4years worth of effort, and try to pivot to things you are interested once you have a foot path. No one is successful off the start, there's no telling if you will eventually hate agriculture and science once you start your degree in it. Keep hobbies as hobbies, imagine if you started hating the only thing you are interested in... \n\nAgain, capitalise on your effort, and then try to pivot out! As long as you keep trying good things will come, just don't get weird ideas and try to",
            "Most of wha you will learn in computer science is about ten years out of date.",
            "i completed a four year chemistry degree before I switched to computer science. im 27 and i make 240K as a software developer now, havent used my chem degree for anything. why tf is it “too late”. just do some other shit if you dont like CS",
            "Suck it up and work hard and complete the degree. You could be blind or dying of cancer. Don’t be such an idiot- things aren’t actually bad you are just afraid of failure and depressed. Realize that after this is over you can get a job as a bartender or waiter or whatever - it’s not the end of the world. You will find happiness even without money. You probably just need to live a little. But don’t waste the three years of effort for a couple of months - it won’t make you happier!",
            "So many of our junior coders are absolute dogshit because they thought they'd make bank by studying CS but have zero passion or curiousity or creativity. RIP.",
            "You are young you will make more mistakes. cheers. 🍻",
            "I ain't reading allat. Happy for you or sorry that it happened",
            "Naw man. Thats just school. Finish and get a job. You’ll be fine. Stop crying and man up."
        ]
    },
    {
        "post_id": "1clcmnp",
        "author": "Doctor-Real",
        "title": "You’re fucking fine, technology will always be there",
        "url": "https://www.reddit.com/r/csMajors/comments/1clcmnp/youre_fucking_fine_technology_will_always_be_there/",
        "score": 1082,
        "num_comments": 200,
        "created_utc": 1714978216.0,
        "selftext": "If you’re a CS major there’s pretty much a 99% chance you’re more well versed in technology than most people. And given that, there’s no point in fretting about the “future of CS” and how it’s all over. \n\nNo, it’s not. Just because AI is “taking over”, doesn’t mean anything. There’s going to have to be someone to verify that what AI does is actually quality and not trash like it is now. There’s always going to be new technologies coming out and pretty much the only people that can produce these things are engineers, computer scientists, IT etc. \n\nSo, even if the job market right now is hard think about how your careers are going to be decades long. A year or two of a shitty job or unemployment is a drop in the bucket compared to a multi-decade long career.\n\nEven aside from that, we are still ahead of many of our peers pursuing higher education or things  more specialized like medical school. \n\nAnd even aside from that, our jobs are cushy compared to many other professions that are overworked or underpaid.\n\nIn other words, CS majors have it bad right now but in the long run we’ll be fine. Sure, it’s not the big tech dreams we all hoped for except for a select few that were either extremely talented, lucky, or hard working, but we are still in a very good major that at the bare minimum will afford us pretty comfortable lifestyles. \n",
        "permalink": "/r/csMajors/comments/1clcmnp/youre_fucking_fine_technology_will_always_be_there/",
        "comments": [
            "I guarantee that anyone smart enough to code can find other gainful white collar employment. Not everyone who gets the degree will end up getting that cushy tech job and be able to travel the world and retire at 45, but I think we will do alright if we take the time to develop social skills and connections.",
            "Two years of hard times and unemployment is enough to put someone on the street.",
            "Thank you. I'm about to unsubscribe from this sub bc of all the negativity. I'm getting my degree at 40 and I'm pretty sure that having a CS degree will be better than working at a gas station the rest of my life.",
            "It’s just sometimes it’s hard to see any goal posts when there’s such much ahead of you and most of it in shambles you know?",
            "sure the doomsaying is silly, but it's undoing the gold rush, which was equally silly. \n\nPeople are entering this field for easy money, and I don't mean easily earning 50-100% more than the median household, which is quite doable, I mean cs majors seem to think FAANG salaries are the norm. Not the norm for if you're super creative or entrepreneurial or if you're leadership material, just the norm. \n\nLet the doomsaying run its course, the people it scares off should be majoring in something else.",
            "most of the negativity here are from people joining CS because of tik tok and think CS only revolves around software engineering since the SWE industry is in the mud atm. But CS is more that SWE and it ain't the end of the world even if u didn't find a SWE job if thats all that matters to you😂😂",
            "I think people miss that AI is a performance enhancing tool, not a replacement. Sure, you can do more with less people with AI, but in the end what that means is the cost of CS services goes down, which means more work because projects that previously would’ve been economically unviable all of the sudden are profitable. \n\nPeople have argued since spinning Jenny that “tech X will replace all the workers” and, while many times people get fired at individual companies, the industry as a whole is usually just fine in the long run…",
            "As embarrassing as this is to admit, I often talk to GPT-4 when my thoughts are keeping me awake at night (I'd rather not bother my friends at 3am). Ironically, AI is most objective about AI.\n\nI shared with it my feelings about AI essentially taking over the world (*Pinky and the Brain*, anyone?), and not only did it help to alleviate my nerves, but I came out of the conversation with the idea it was possible to be a \"machine learning front-end developer\" (how niche).\n\nFor what it's worth, I have zero experience in tech. College is my first exposure to programming beyond tutorials, and I am trying to transition, not stepping into the workforce for the very first time. I even asked on the \"learn programming\" sub some time ago where beginners will start if AI is used for entry-level work.\n\nThe point of my ramble is I understand people's anxiety. When you keep hearing you'll be replaced, it's hard not to believe it. There is actual psychology that proves people will believe something they continuously hear, regardless of its truthfulness (or lack thereof).",
            "If people are blaming AI, then they don’t know what they’re talking about.\n\nSection 174 is doing more damage than AI is. There are predictions of more layoffs due to that bill, but no worries google is fighting it in court to overturn this.",
            "Needed this reality check. If I'm putting in the effort, I might as well stick with this degree.",
            "Yes, I agree there will be someone to oversee AI. But that someone might be in India though, jk jk… 👀\n\nOn a serious note, no one thinks AI is going to completely replace SWEs, it’s more so less SWEs will be needed for such a task.\n\nEdit: “At the bare minimum should afford you a comfortable lifestyle” —says who? Even the smartest folks working on this stuff can’t predict what it will look like 1 -2 years from now…",
            "What can cause the job market for Computer Science to be better in the upcoming years?",
            "Just embrace that life is unpredictable and move on. Nobody knows what’ll happen. If anyone did, they’d be incredibly rich.\n\nMaybe low interest rates come back, tech jobs come back and boom again as ai becomes integrated everywhere and people who are smart and can make decisions for others about it go into high demand.\n\nMaybe ai kinda stays how it is rn and for the past few years, and everything kinda just chugs along.\n\nOr maybe we are on the brink of an ai revolution and white collar jobs are gone in a few years as society embraces ai making all the decisions for them.\n\nMaybe we are about to enter the singularity and nothing matters.\n\nOr maybe some completely unpredictable event or discovery changes everything.\n\nNo matter what. Have a backup plan. Be flexible. And convince yourself that your backup plan can still lead to a happy and fulfilling life.\n\nAlso, keep in mind people have a bias to exaggerate the chance of bad scenarios while not thinking as much about positive or bullish scenarios.",
            "Finally a worthy non-doomer post in a sea of doom posts.",
            ">Just because AI is “taking over”, doesn’t mean anything.\n\nAgreed. When compilers started becoming more popular, folks thought it would make programmers obsolete .. in reality, it had the opposite effect",
            "My gf works as a tutor at college and says that she’s shocked at how many literal adults barely know how to work their email accounts…\n\n…while also thinking they can just create their essays with ChatGPT, turn them in and still pass without even proofreading them to make sure it actually makes sense or is completely false.\n\nI don’t know what’s happening but it seems like younger people are somehow becoming less literate/computer literate despite being raised with it. The public education system just pushing through kids even if they don’t learn  basic things I would assume has a lot to do with it. \n\nThe expectations that Ai can just replace a lot of learning and critical thinking for us is certainly not going to make this any better going forward.",
            "don't know why but thanks op. Made me feel better 😇",
            "\"If everyone has a computer at home, everyone will be a programmer and studying Computer Science will be useless!!!\" - r/csMajors circa 1980",
            "Yes and no\n\nAI means that everything gets interconnected and automated, including code writing and software design...\n\nSo there will be less use for strictly digital profiles than in the past,\n\nBut more use for the top layer ( 1 procent, 10 procent? Who knows) that can design AI features\n\nMost people that aren't in that top layer will have to find other jobs offcourse",
            "CS was hot for years, so it got oversaturated. The tech companies stopped hiring and started doing layoffs before the AI hype. AI just made it slightly worse. \n\nMy prediction is that most of the doom and gloomers will leave CS. Less people will major in it because they are scared. Then after a cycle of college students, next thing you know, we do not have enough CS people, and the ones that stuck it out are in a good position.",
            "I’m currently trying to code with GenAI for an LLM project and still struggle in trying to understand the concepts and what I actually need to do. No way this shit can be operated by anybody to the point that we need to get rid most people who don’t understand tech",
            "All will not go away but MOST might.   \nPeople are still underestimating how much AI can improve given time. \n\nCS is a new field and if we go by Lindy's law at max its gonna stay relavant for 40 years. It might be more but since its such new field no one can really say.",
            "My dad has worked 20 years to earn 70k a year and I could earn that right out the gate at a small company. I think I’ll be fine",
            "Well said",
            "❤️‍🩹",
            "It depends. If you have graduated only as javascript code monkey then you might have difficult time to adjust and adapt. But if you understand technology and application of it (ie. actual Engineering) itself then you should be fine adapting.",
            "I thought cs majors is counter strike majors tournament 😆",
            "Thank you for this. I just finished my masters and have been in a fucking panic the last few months",
            "Refreshing post to see",
            "You forget that CS and tech have over half the people being such lazy turds who just want a ezpz job with great pay. Half the losers will drop out and do nothing comp sci related at all",
            "It doesn't help that most CS majors consider anything that isn't six figs for 30 hours a week an utter fail-state.",
            "Thanks I needed to hear this. Was wondering if suffering to get this CS degree was worth it but I think it can only get better by being better!",
            "When you get a cs degree you dont HAVE to be a software developer. You can get alot of engineering jobs with a cs degree",
            "Ai today is data science 5 yeara ago is statistics 10 years ago. The only difference is we can do shit with google search and get a human-like response. Llms are ok at subjective statements as well. Some analysts might be in trouble. More worried about jobs whose entry level is a lot of summarization. Think lawyers combing through lexus nexus. For many associates, that is their job. The lack of free money is freaking people out and also giving leeway for the rich to act on behalf of \"productivity\"",
            "I think most people on this subreddit are likely at least top 40% of CS students. I've met a surprising amount of \"Computer Scientists\" in my career who's entire work experience revolves around working on antiquated frameworks, and instead of building new things, they are focused on maintenance. These are the people that are going to be impacted by AI...have a passion for the work you do and you will be fine.",
            "thanks for this . that’s really helpful",
            "Literally thank you! I hate the “we’re cooked” mindset. If the job is for you, it’s for you. If not you will get your chance. Everybody calm down. No jobs have been eradicated damn.",
            "When people say cs majors have it bad rn, they just mean they don’t get $200k jobs where they don’t do anything super easily out of college anymore. It’s still better than most other industries!",
            "People are not worried because AI will takeover but because it will drastically reduce the number of openings",
            "Why is this sub so fucking insecure?",
            "Exactly.  Just like people are always going to travel, so being a travel agent is a secure job.",
            "I also think that a lot of the doomsday attitude comes from people who want a 150k+ grad offer from a major tech company. \n\nAt least thats the vibe I get but I'm not on here too often. \n\nI actually enjoy coding and problem solving, I like math and all that other shit, I make 60k a year in my non-tech job at 21 while I do full time school at nights with my goal of making the exact same money just doing something I enjoy. \n\n🤷‍♂️",
            "also cs is just fucking incredibly overpowered when you apply it to things in your immediate surroundings. imo all this ai panic only applies  if you wanted to work for companies like google, but you can still make bank selling your skills to small businesses in your area",
            "There was a massive crash in cs jobs after the tech boom in 2000, it was very bleak.  Also a massive crash after the boom in the early 80s.  There are cycles.",
            "Yes you are indeed more well versed in technology than most people, but you are 1% as well versed as experienced tech people",
            "Bargaining",
            "I don’t think people realize how many problems there are that do exist that AI tech could help expeditiously address. Some problems we don’t even know exist yet but they aren’t our most pressing. But to say it will fully replace X in the next 10 years is quite frankly absurd. It is a tool that has changed the game entirely for better. Whether it be bad teachers having less of a negative impact, writing professional emails being easier, or providing insight on a particular coding problem, it is a force multiplier. The doom and gloom is overblown.",
            "Sure... the free money won't be though.",
            "CompSci has always been “prompt engineering”. It’s just been done with languages that force the specificity our LLMs…errr…compilers needed to understand what we were trying to ask for.",
            "there is no job on LinkedIn or Indeed(they are fake or too many applicants). where​ do we find a job?",
            "CS will always be in high demand, its not that theres not enough openings. It that experienced coders / seniors can take 2-3 jobs openings at the same time. Or they call it overemployed. And taking away oppurtunities for others.",
            "If you're banking on being a data cleaner you're going to get absolutely steamrolled by end of decade",
            "May be a little time for you. Im old and sick.",
            "CS is actually the best degree to get at this point. Just think about VR and its possible impact: redesign for all web pages, all streaming platforms, all mobile apps, industrial automation, medicine, gaming, etc.\n\nYes, the complexity of code will grow, there will be more things to know to be called \"software engineer\": AI, VR, more frameworks, tool know-how, etc.\n\nNo one could precisely predict what will happen over the next year, if the market will balance or not, but everybody could conclude that the demand of tech will grow over time and the natural language is way too imprecise to have a big impact in terms of job listing. \n\nIn the short term, because of the complicated economic context, the AI shrunk the demand of developers, because no one has money to increase software complexity to bring innovation and everyone wants a cost reduction.\n\nDon't give any trust to Nvidia's CEO. The coding will become much more complex, and there is a lot of space to improve. Stay focused on the most emergent technologies and try to use your unemployed time to become better in your field.\n\nThe pandemic scene, where the demand skyrocketed will happen again in the next few years.",
            "For someone who calls themselves “Mr.Fake”, how can we be sure you are not a LLM yourself who wrote this? 😅",
            "Even artists are fine, nowadays people cannot stand the same looking crappy AI generated images anymore. Everyone is fine.",
            "People prefer to have some kind of echo chamber that shapes their whole perspective instead of just doing their thing, keep working and gain experience.\n\n\"Why should I work or get this degree in CS if AI is taking over?\" \n\nStraight to jail until you get more experience and mature a bit, there's so much time in there to use and you just put it on reading crap on this sub.",
            "lol everyone’s so worried about AI while most industries arnt even done using iseries/as400, good luck getting most of your accounting off excel",
            "AI is a speculative bubble like NFTs were. It’s all bullshit. Eventually it may come true but we are so far from it. It’s just another grift.",
            "lol yeah true. My professor tried to show us how “good” of a job ai is at a multitude of things in programming and it failed miserably. So many bugs in the code and excess code that can be reduced from 50 lines to around 15 with attention. It’s not really there to take over jobs .",
            "Stop coping lol.\n\nThe industry is saturated, time for people to move on to the next big thing.",
            "if you're in tech you're not fucking fine. what are you talking about? steadily increasing supply of workforce while the field has been kinda contracting for a while since the svb thing",
            "AI will be perfectly capable of checking if AI did a good job. CS majors will be doing whatever needs doing beyond that, and that will probably change every 5 years. But that's always been the case. None of us do what they learned in school, regardless of when you graduated.",
            "80-90% of the population worked in agriculture pre industrial revolution\n\nyou don't know how this will go, if you're correct great, if you're wrong, you're misleading people",
            "The defence industry doesn’t use AI due to secrecy concerns is what I was told and all of us end up working their anyway let’s be honest",
            "The CS major will have a very hard time unless\n\n1. They can produce cutting edge research\n2. They have expertise in some industry \n\nIf you can’t look at a problem in the real world and architect, design, and deploy a scalable solution then your major is not valuable to companies.\n\nUnfortunately, school doesn’t teach you this. You’ve been bamboozled.",
            "DUDE IT'S FINE EVERYTHING'S OKAY\nTHE EVER-INCREASING GAP ISN'T A PROBLEM BRO. COMPANIES TOTALLY DON'T IMMEDIATELY TRASH YOUR RESUME WITH A YEAR GAP. JUST DO MORE PROJECTS AND WORK RETAIL BRO",
            "I actually argue the opposite. It will be fine in the short term (ie. 10 years). In the long term AI will be able to do much more than it already can. They already have AI that can solve coding problems and simply reiterate infinitely until it solves a problem and it can do this at very inhuman speeds if given enough GPU power. \n\nAs this technology gets better, the natural incentive for any company is to cut corners. Why make less money with more people on your team when you can take less risk by hiring less people for the same amount of profit. You don’t need to pay AI, nor pay their health insurance, and plus it can work 24 hours a day. \n\nThe reason why companies haven’t fully adopted it yet is because humans are currently better still. However, horses were replaced by cars within a few short years, and then no one ever went back to horses. \n\nIf AI progresses to the point it is better than a human, it will be game over. Currently there are several companies that have dedicated their life’s mission into making that a reality. And so far it is quite “promising” that this tech will be improving rapidly in a few years, maybe even at an exponential rate. \n\nSo… You might be safe for 5-10 years. But after, there’s really no predicting what can happen.",
            "There’s always going to be new technologies coming out and pretty much the only people that can produce these things are engineers, computer scientists, IT etc. \n\nUntil AI comes into the scene",
            "This post reminds me of all the boomers talking about how the internet won’t change anything. ",
            "Cope"
        ]
    },
    {
        "post_id": "1bpw8of",
        "author": "snack_overflo",
        "title": "I cheated for almost 2 years and now I can’t code. How can I bounce back?",
        "url": "https://www.reddit.com/r/csMajors/comments/1bpw8of/i_cheated_for_almost_2_years_and_now_i_cant_code/",
        "score": 1079,
        "num_comments": 243,
        "created_utc": 1711634216.0,
        "selftext": "I know I’m probably gonna get roasted for this, as I rightly deserve, but I have no idea who to turn to for help.\n\nI’m nearing the end of my Sophomore year and I’m feeling anxious about my future in CS. Up until ChatGPT came out, I feel like I was on a pretty good trajectory. For my first semester, I was self-motivated and I was able to pick up and retain information. I began using ChatGPT in the spring of my Freshman year as a crutch whenever I ran into some tough problems or errors in my code, but this snowballed into me not being able to even start an assignment without putting it into ChatGPT and copying its output. Fast forward to today, near the end of my Sophomore year, and I realize that I have no real coding skills. All of my projects were either written by ChatGPT or copied from a YouTube tutorial. I struggle to even write a program that determines whether or not a number is prime. I can’t solve Two Sum. I have no one to blame but myself.\n\nAs I approach my Junior year with no significant coding ability to speak of, and no internships under my belt, my anxiety levels are through the roof. I want to utilize the time I have this summer to reset and build the skills I need to be an independent and knowledgeable student/developer. I need to hear some harsh truths and some advice regarding the following:\n\n1. Building Coding and DSA Knowledge from Scratch: I want to rebuild my foundations in coding, data structures, and algorithms, ensuring I understand the concepts and can apply them without immediately turning to ChatGPT for answers. What are the most effective and efficient strategies for achieving this?\n\n2. Escaping Tutorial Hell: After building a solid coding foundation, how can I transition from following tutorials to building projects on my own?\n\nAny advice, resources, personal anecdotes, or strategies you could share would be immensely appreciated. How did you develop your skills, and what made the biggest difference for you in becoming an independent coder?\n\nThanks in advance for your help and guidance!",
        "permalink": "/r/csMajors/comments/1bpw8of/i_cheated_for_almost_2_years_and_now_i_cant_code/",
        "comments": [
            "1. You can just do leetcode. \"But I cant solve leetcode\". Just look up the answer in the discussion and then try a similar problem. For example with two sum, if you cannot solve it after like 30 mins of trying look up the answer and then walk through it line by line. Then delete it and rewrite it. After that is done go and solve a similiar problem.\n\n2. Look up specific things rather than general things. For example if I wanted to make a todo app with react, instead if searching \"how to make todo app in react\" search things for specific features you want. If you get an error copy and paste it into google, or read the documentation",
            "I'm a current uni student, a little bit older than you.\n\nTake a minute and imagine this: You graduate in a month. You can't code. Your peers are getting offers at Meta, Google, big NYC Banks. You've got nothing. No internship under your belt, you've only solved \\~8-10 leetcode problems by copying the solution, you wouldn't be able to complete a basic sophomore-level CS Project, and you can't even pass the phone screen at some small unknown company.\n\nNow good news—that's not you! Not yet, at least. You still have time to reverse course. You are NOT as far behind as you think you are.\n\nI would treat this like an addiction and tell you to quit cold turkey, but I think we both know you're not capable of that. Instead, from now on you should promise yourself that you'll only use AI to *explain* concepts to you, and NEVER copy-paste code from it.\n\nLeetcode is a whole different beast and I would honestly advise you to stay away from it for now--it doesn't matter how good you are at leetcode if you can't write some basic programs. Do a personal project, one that doesn't just follow an online tutorial, and you'll be able to learn more than you know.\n\nChatGPT is really good at making stuff make sense, you just have to have the discipline to use it for learning, rather than allowing it to do the heavy lifting for you.\n\n&#x200B;\n\n>I have this summer to reset\n\nThat mentality tells me everything I need to know about you because it's something I've told myself in the past.\n\nUnless your school schedule is way different from mine, we've still got half the semester left! Why are you waiting until the summer? You can't kick this can down the road forever. Don't say \"I'll do it tomorrow\" or \"I'll do it after this big test\" or \"I'll do it this summer.\" Do it TODAY. Start putting time into it—1 hour, maybe 30 minutes, hell even 15-20 minutes a day is better than *nothing*. If you tell yourself \"I'll just ChatGPT the rest of this semester and grind over the summer\" then I promise you, you won't, and you never will.\n\nGood luck!! I hope to hear an amazing update from you in August.",
            "You already know what you need to do, the question is whether or not you actually will.",
            "You gotta start somewhere. Pickup a personal project, work on it for an hour over the weekends if you’re too busy throughout the week. 30 min one day, 30 min another day. Or break it up over the weekdays for 10-15 min a day, I’m sure you can dedicate at least that. \n\nw3schools, use that to understand and learn concepts. test yourself by making small and simple programs. \n\nwhat’s your goal? what do you want to achieve? What’s your timeline with the goal? Ask yourself these questions and get started, you don’t need motivation to start, you need discipline. \n\nWishing you all the best!",
            "I might be a little biased but here goes.. I'm a professional software developer of 22 years. My latest job has me working on a prototype and I've been using [Codebuddy](https://codebuddy.ca) to code. I'd say at least 80% of the web app so far has been written by Codebuddy (this is a Java+React application). I used to be afraid to learn new technologies because I never had that technological curiosity my peers always seemed to have, so learning something new was always really hard for me. However AI has completely changed that. At this same job there was this Sketchup plugin that was written in Ruby and I had never seen sketchup NOR had I ever seen a line of code of Ruby. Emboldened by my experience with AI I offered to take it over. Within 2 days I had far surpassed what they had originally written and I still hadn't written a single line of code, it was all done through AI.\n\nI'm telling you this because, when used properly, AI can actually really accelerate your learning and productivity. I feel like I'm starting to get the hang of Ruby now and I've even started writing code myself from time to time. For anything but the simple stuff, you can't just rely on AI to do it for you, you have to read what it has proposed to do and follow the code to make sure it hasn't screwed it up. AI is also notoriously bad at debugging code. Even if it's able to write the code you still need to be following along enough so you can work through the bugs that come about once things start getting complicated.\n\nI say go ahead and use AI, just make sure you read what it's doing and try to understand it. Talk to it about why it did one thing over another. Just doing that every day will allow you to learn while also being productive. I've never had something explained to me so concisely and thoughtfully as when AI does it - learn from it and keep doing what you're doing.\n\nGood luck!",
            "Unfortunately I am actually in the exact same situation as you. First two years I grinded, but then I realized chatGPT could help solve these problems that were tricky for me. In my laziness I used it as a crutch and now am also freaking out about grad next year. It's time to lock in my man, Youtube tutorials and online courses. Relearn from the beginning and don't give up on yourself. I can't give much advice since I am trying to figure out the same thing for myself, but you've got time still. Keep learning from now until even after you graduate and over time it will be ingrained in your brain. Don't stop learning.",
            "You got a full year. Stop with the crutches and learn.\n\nYou did the classes, so maybe grab the curriculums and do only the programming exercises first.\n\nDSA, just pick your topics and watch videos or read articles - every topic in DSA/alg has a wealth of resources now in every format, for however you best learn (video, text, etc).\n\nI’ve met plenty of new grads who suck at all of this, so even if you screwed yourself, there’s plenty of room to fix it.",
            "Do the Odin Project. That’s it. Even if you just do half of it, you will know how to code, and especially, you will know how to get started on problems and build projects by yourself. You will also understand how a typical CRUD application works from front to back using a pretty modern stack. Do the JavaScript / Node path, not the Ruby on Rails one. This + remainder of your CS degree and you should be good, as long as you apply yourself to both.",
            "I am currently a CS sophomore as well, and to all the people asking in the comments about whether this is a common case or not, well yes, atleast in my cohort it is. The one positive thing for us I would say is during year 1 when these LLMs were not so widely popular unlike now, many of programming fundamentals were covered like intro to programming and  DSA. So we actually grilled that. But today, and this is a real anecdote I am sharing...whenever a group project comes up..the first natural instinct is to copy paste the entire thing into gpt 4 as if its a superpower...and I also sense a kind of consensus among us that \"what is the use of doing all these modules if gpt is going to replace us in the future\"..it seems that these LLMs are magical blackboxes that are self sustaining  \nHaving got some reality checks over this semester while applying for various internships..I have begun grinding leetcode and self learning ML/DL courses online as I want to specialise there...as for gpt use I confess I still use it but I am trying my best to try googling more unless its a totally clerical work...its like an addiction I must overcome somehow and I believe I will  \nAlso for projects right, one really good realisation (I dont know how relatable but still) i had was this semester I did a project for a hackathon using Gemini api and chatgpt could not answer a single question about its usage as its not updated w that info..(i have never tried any other official coding assistant and i m only talking abt gpt here)...so my teammate and I had to figure everything about that ourselves by skimming through docs and stackoverflow and modifying programs everything hands on ourselves..and trust me I am not lying this felt so wholesome..this one project was equal to 10 other so-called projects chatgpt wrote for me...so nowadays I have started teaming up with some friends to do more of such projects and try to come up with more innovative stuff and deliberately try reading docs instead of getting a narrow answer from gpt",
            "First 2 years you are taking bs classes. You will have opportunities to build projects that ChatGPT can’t write",
            "You don’t have the summer to reset. You have now to reset. Don’t put it off. You’ve already been putting it off.",
            "Grind leetcode and in a few days you’ll get into a rhythm lol but don’t look up answers lol only look up answers if you are truly stuck. I think leetcode will catch you up to speed if you truly can’t even solve what a prime is",
            "Alright, as a college student and a CS major, I understand. Taking these little shortcuts when doing homework and assignments is a no brainer when you’re stressed out and on a deadline.\n\nHowever, as the assignments get more complex, you are realizing these shortcuts are compounded, and you have no idea where to begin. There are major holes in your logic, and junior/senior level courses will be kicking your ass. (You can’t use Chatgpt in finals for example). \n\nGood news and bad news. Bad news: it will painful to catch up, as you are already aware of this. \n\nGood news: it won’t affect your employability. As a matter of fact, knowing how to utilize these LLM is a major benefit in your job (if you can get passed the interview)",
            "The level of coding required for college is pretty trivial.\n\nYou could catch up pretty easily. And you are far from the only student coming to the same realization. \n\nI am going to diverge from the below advice and actually recommend some more academic resources to get you caught back up with your peers. Really all you need is the intro to algorithms book.\n\nHere’s the book: https://www.amazon.com/Introduction-Algorithms-3rd-MIT-Press/dp/0262033844\n\nDo the first half of that book in C and you will be a super student.",
            "I find it difficult to believe that your programming skills are that bad if you did decently well on the tests and stuff. You just need to quit using AI to write code for you…..you still have another 2+ years to make up ground anywY",
            "Great news! I've been cheating for decades now and can't code. I google for syntax all the time, and ChatGPT has been even better. (I exaggerate, but I sell it as \"I can learn anything\" and not \"I am only truly versed in a version of Java that was popular during my undergrad education\".) The difference between a promising future dev and a student who may not convincingly outperform Devin (the upcoming LLM dev who will probably be a great AI junior dev) will be how well you can go beyond what ChatGPT offers by default.\n\nTo get there:\n\n1. Don't just copy paste answers, tinker with them. Break them, see if you can improve them, try to understand why and how they work, down to the data structures. You can ask GPT for these answers, so long as you learn from GPT.\n\n2. Work on being the future developer that leverages GPT to work faster. Try to build a project GPT can't and won't build for you. It will build parts as you ask for them, but it will struggle to help you assemble the parts, and it (at least currently) does pretty horribly at debugging or extending the code after generation. You can build really cool, big things that a dev without AI wouldn't, and in a fraction of the time!\n\nThat, in my opinion, is how to bounce back. Don't bounce back, double down!\n\nFor reference, I know lots of good programmers who don't know a lick of math or data structures. They're great at (1) knowing when to ask questions, and (2) what questions to ask. So you're not as boned as school might make you feel.",
            "The most important class I ever took, with regard to Computer Science, was a class called Structured Program Design, where we never wrote a single line of executable code. It was about three weeks of extremely terse pseudocode, followed by thirteen weeks of flowcharting. This class basically taught us most of what was covered in the DSA course, and it had the weirdest class-materials requirement I’ve ever seen: Two decks of playing cards with different colored backs.\n\nHere’s the thing about DSA: Most of what you learn can be simulated with playing cards. If you can simulate it with one deck, great, but if you need more than 52 elements, you add a second deck, and the different backs makes it easy to separate them from each other. Also, you can simulate duplicated data, because what do you do if you’re sorting a list (or whatever container), and you get identical values? Do you sort it before the previous one? After? Does the prompt tell you to discard the duplicate data? If you’re sorting a deck of cards, are aces high or low? Are you sorting the cards in ascending or descending order? Are the cards being sorted by value then suit or suit then value? In one case, the four aces would be array locations 0, 1, 2, 3, but in the other case, they would be 0, 13, 26, and 39. \n\nAnd, that’s how you structure a program. A really simple program, but it’s illustrative of how you can come up with things to practice. I have a printout in my office wall (yay two-bedroom apartment) of a flowchart for a prime-number generator, which I take down and use whenever I have to learn a new language, because it takes input, performs output, does calculations with a couple of data types, deals with reading from and writing to data structures, and then there’s the question of if the language lets me terminate a for loop with a value that’s not known until runtime or if the language permits resizing arrays. And yet the flowchart is this simplistic thing that just pumps a number through a loop and determines if it’s prime or not. You could do it with a pencil and paper and time.\n\nMy Yoda was this wizened old man who had been programming since a five-megabyte hard drive was the size of a dishwasher. For several years, he worked at either AT&T and/or Lucent thirty feet from Dennis Ritchie. I actually squealed when he told us this. I was the only one in class who knew who Dennis Ritchie was. One thing he hated was the word “coding,” because we weren’t learning to write code; we were learning to program, and he felt (as I do, because he was my Yoda) that writing code is secondary to coming up with the answer. Who’s the genius: The composer who hears the music in his head or the person who transcribes what the composer is humming on to a piece of paper? I believe languages are basically immaterial, because when did I write the program: When I drew the flowchart or when I write it as code in a given language? If I write it in C, C++, C#, Java, Python, or Swift, did I write it six times or only once?\n\nI have this tendency to wax philosophical about programming, because it’s my opinion that you have to have a philosophy about it. And, like all philosophies, none are right and none are wrong, but I have mine. But I’ll say this: If your immediate response to a prompt is to immediately start typing, I will materialize a ruler out of thin air and whap your knuckles with it and yell, “Stop it!” Part of my philosophy is that programming is like getting to the center of a hedge maze: If you start typing immediately, that’s like walking into the maze and just taking your chances. Eventually, that will work, but every hedge maze I’ve ever encountered (and I don’t know how I’ve been to so many) has a map right next to the entrance. So, you can either solve it from the inside and waste a bunch of time backtracking, or you can plan it out and then go, “Oh,” and then walk straight to the center. \n\nMost programmers seem to find what works for them; some never do, but most do. But I highly recommend considering not thinking about code until you have to; until you’ve figured out how to solve the problem. And if you can’t solve the problem, reduce it into smaller problems and integrate them. That’s why god invented functions, and functions that execute other functions. And, once you do that, you watch your code execute and sigh, having created something downright elegant.",
            "I'd suggest start slow. Jetbrains has a plug-in for their IDEs called JetBrain Academy ranging from easy to hard projects and you walk through them step by step. All the coding is your own, and each step there is check where it'll run unit tests to see if you got the right solution. There are hints if you get stuck. This seems like a nice solution until you get back on your feet, reorienting to code as it's not copying and pasting, but it does give you ideas of how to think about a problem. Then maybe move to independent projects and code on your own. Also go through and use the debugger on past code, you can learn a LOT just walking through code and seeing what it's doing!",
            "honestly this might sound like weird advice but i don’t think you need to stop using chatgpt, i think you need to learn how to use chatgpt **correctly**. \n\ni was the opposite - my first couple of years in undergrad for mechE i was down so bad when it came to matlab/python etc because it wasn’t a huge focus in mech. which sucks because it’s really useful in the industry so i wanted to get better at it. when i discovered how much chatgpt could help me with programming i was floored.\n\nin a few months, i skyrocketed in my most basic abilities to the point where eventually i was able to write an entire program that ran face recognition on an autonomous scale robot car to emulate a self driving uber for students at my school for a project. i used chatgpt to coach me thru the entire thing, but i also deeply and thoroughly learned wtf was going on each step of the way.\n\nyou have to treat your resources like a genuine tutor or teacher. don’t make chatgpt write the whole code, ask it how you start, or the basic layout, and then basically run the program and watch it fail a million times, checking the error output, fixing the little mistakes one by one. when you get a failed program ask chatgpt what the error message means, don’t ask it to write you a new code. ask the gpt what the possible **reasons** are that the code took a sh*t and then try to debug based on each possibility. for example i would ask the gpt to give me step by step explanations on how certain nodes worked in ROS2, and then i’d try it myself with the skeleton code, and just turn back to the gpt when something failed again that i couldn’t fix myself.\n\nand then once you get a running program, open a blank slate and try to write it again. really take the time to just follow it line by line and see what everything means. tbh i feel like chatgpt is the best resource to ever happen to me but that’s just because of the *way* i use it. does it have the potential to completely fck me over? yeah, if i treat it like an answer key instead of an interactive personal pocket professor. \n\nbut seriously, in my opinion, turning to chatgpt for advice was the best thing that ever happened to my coding abilities. ADVICE being the keyword - for core foundation building, not for an answer key",
            "I haven’t cheated and I still can’t code. Don’t even worry about it",
            "You are now a self taught programmer.",
            "I find in fascinating that you can actually pass through university by copy pasting whatever ChatGPT spits out. I also know a dude who basically delegates talking to his girlfriend to ChatGPT. What a time to be alive.",
            "Holy shit. I did not expect ChatGPT to have such a negative impact on CS major students. \n\n\nHope this is an isolated case and not representative of the whole generation of new CS students. \n\n\nOtherwise we need to rethink the whole AI coding assistant trend... ",
            "You've got an entire year to learn to code which is more than enough. You know most of the answers, discipline and consistency are really the most important things you need. There's tons of resources for learning and you already know them or they have been mentioned here. You need a change in mindset for them to work though.",
            "This is why I only cheat in classes I don’t give a fuck about lol.",
            "Well it seems you must code for real this time 😅 \n\nSo to learn how to code and DSA you’ll need to go back to your basics of coding and understanding how your preferred language is written. You CAN ask ChatGPT to instead teach you how to code instead of having it code for you. Prompt GPT to for example…\n\n “Teach me the basics of the programming language Java. I want you to explain each concept, give a corresponding example, and practice questions to help me apply the \nconcept. I need you to act as computer science professor with over 10 years of experience teaching the subject to students like me. Ask me how I feel about a concept to gauge my understanding and correct me if wrong to excel my learning. After teaching me the basics give me a small project to apply what I’ve learned for my portfolio.”\n\nJust swap out programming language Java for Data Structures and Algorithm and probably just go to LeetCode to practice. \n\nUse YouTube tutorials that explain concepts of programming languages instead of project tutorials. To get you out of this hell you essentially need to apply what you learned by coding it yourself and don’t beat yourself up it’ll be hard but you’ll progress quickly with ChatGPTs help it’ll be like your personal tutor this time. \n\nI’m thinking of making a GPT Bot that helps students learn a programming language of their choice with a similar prompt so let me know how it works out. I’ve used this prompt myself to help grasp a new language quickly like Python. \n\nAnd a solid way to make sure you get out of tutorial hell  ,listen this is important, I’m serious.\nDon’t \nCopy \nCode \nIF you don’t know how it works. It’s okay to copy code it saves you time but if you don’t understand what’s happening in that code snippet you just copied you’ll be slowly but surely going back down to hell it’s a SIN don’t do it LOL \n\nInstead ask ChatGPT how the code snippet works and break it down until you understand it if you really want to use that code snippet. You’ll learn something new at the same time. It’s a blurry line to walk just make sure ChatGPT supplements your learning process and does not do the work for you because this is something you want to be able to do on your own. \n\nGOOD LUCK 🍀",
            "Senior IT major here, in all honesty: it’s okay.\n\n1. ChatGPT is great at breaking down functions and explaining algorithms you don’t understand. I’ve found that large prompts make it bogus and lead to crappy output. Keep prompting and prompting, breaking down functions, reading, and eventually you’ll find you learned the data structure or algorithm you were breaking down by constantly simplifying the prompt for the AI.\n\n2. As long as you understand the concept you’re good. No one is expected to remember code off the top of their head and you’re going to have to look stuff up at some point in your career it’s just the truth, even some specializations aren’t all about constantly writing new code and just consists of code review.\n\n3. Be kind to yourself. Yeah you cheated but hey, the system cheated you. These days it’s all about how you game the system to your advantage to do something you want to do. \n\nTL:DR \nChatGPT better teacher than most things. Take advantage.",
            "like everyone already mentioned, grind leetcode. best way to get back in rhythm",
            "This appeared on my feed but I can code basic things and I am a Psych with Neuroscience graduate who really struggled with coding. I think you should just go back to square one. Yes, even print(hello world) because you don't know what knowledge you're missing until you actually code it. It sucks but I think you know deep down you can't keep up if you just plop yourself in your content right now.\n\nI always wished I had ChatGPT to design studies in Python and R but I guess those skills really stuck with me. So I guess thanks for making me realise that.",
            "Chill you probably already know syntax well from cheating, just pick a project in whatever language you know and implement it from scratch (a basic game like Snake or Tetris or implementing a web server backend or some good examples).",
            "The first thing that I would do is to break the habit of using ChatGPT. Everything else can wait. Start solving problems on Hackerrank or Leetcode. Everytime you feel the urge of using ChatGPT, you stop and take a breath to become aware of that habit, but don't use ChatGPT. Eventually you'll stop using ChatGPT and that's big progress.\n\nAgain, the goal is not to completely stop using ChatGPT. We have to be smart. We should be grateful for such tools. I use ChatGPT to create learning plans, summaries long documentation into short narrative containing all the important points, etc.\n\nFind a balance and you'll figure out the rest yourself.",
            "Cheating is not cool, but more importantly you are not using it to your long-term benefit. Whatever answers you get, you should examine thoroughly so you understand them to the point that if you got this question again you should be able to do it. Understanding the solution is arguably more important than knowing what code to write as that is actually preparing you for interviews and a job. ",
            "You should have access to your old assignments, redo them and improve them on your own. Maybe add additional features, or go back and try to comment on every line of a previous assignment and breakdown what’s being done at the lowest level. This way you actually will come to understand what the curriculum was attempting to teach you.",
            "I hope you read this OP, but you are not alone! I am currently stuck just like you and approaching Senior year fast. Your post really help give me a motivational boost just by how many advices there are! Dont wait until summer, start doing it now bits by bits, go at your own pace and grind it til you make it! And regarding ur questions, MOOC Python by university of Helsinki really help lay a good foundation for coding (and its completely free with exams and assignment for you to do like a real class). I am currently learning Python from there to familiarize myself with the syntaxes again.",
            "Change Major",
            "I hate how much I relate to this. I’ve been using replit’s ai recently for labs because my CS 211 professor is very vague. Plus the tutors in the stem center are mostly juniors who have forgotten a lot of C++ since moving on to python and java. Why they teach C++ as our first language is beyond me since I only had experience with python before entering the major. MIPS assembly is easy enough and I’m probably doing well because I can’t cheat and have to actually do the work. I’ll admit it. I’ll likely fail my C++ midterm exam bc we gotta write code on paper when I can hardly write a generate random password function without debugging it 200 times.",
            "Tbh there’s not much more I can add, all the advice you need has already been posted here. Now you just need the discipline and tenacity to apply it. Best of luck man!",
            "Dev’s just use stack overflow & now LLM’s anyway. Once good AI coding agents are out, it will just be sr devs/team leads/CTO. So hurry and become a sr dev before next year.",
            "Dude I don’t think you realize how many people are in the same exact position. Including me lmao. It was like the worst time for gpt to come out. Finished my intro course legitly then just bsed my way through the rest. Honestly it’s going to be hard but these comments are really helpful thank you for making this post 🙏.",
            "my advice: keep using chatgpt lol\n\nall you need is leetcode for interviews, and then use chatgpt on the job. i wanna see how far u make it !remindme 5 years",
            "First, good for you for recognizing it and wanting to do something about it. The other comments have good advice, so I have little to say on that point. TL;DR write code.\n\nSince there are a lot of people in this thread talking up ChatGPT's coding abilities, a word of caution for you all. ChatGPT is pretty good at providing small, self-contained code snippets for simple tasks and common problems that come up during an undergrad CS degree. It's a lot less useful in real day-to-day programming. Don't get me wrong, I use it every day and I like it, but real programming often involves solving weird problems in large codebases that you don't fully control. None of the AI tools are good at this. \n\nIn real programming jobs, you aren't going to be creating a new text file from scratch that just contains the solution to a leetcode problem. You're going to be figuring out what functions you need to call to accomplish your task inside of a large codebase whose source code is proprietary, so you can't search for it on the internet or ask ChatGPT. You're going to be writing temporary workarounds while your colleagues fix bugs that prevent you from directly doing things you need to do. You're going to be reading Jira tickets with vague descriptions of problems and trying to figure out what the hell they mean. You're going to be doing these things way more often than you're doing things that ChatGPT can help you with.",
            "i appreciate your honesty. Not just for honesty, but because it helps make sense of a few things.",
            "Hey man, i’m a sophomore too and I want you to realize that while a lot of people may not admit it in the comments, majority of the class of 2025+ has fallen to the chatgpt addiction hell. We’ve become so addicted to these ai’s that if one doesn’t work we immediately turn to another, and that’s the habit we gotta break out of. \n\nIt’s a good sign that you are willing to acknowledge your mistakes, but that’s only 1/4th of the solution. Now you have to break out of the ai addiction. Recently i’ve been straight googling things rather than using ai, because as you are shifting pages and turning to multiple sources, your eyes are picking up new information, and you start to get a little grasp of what you may be looking for. When we have ai at our disposal, it can be very difficult to not just cntrl c + cntrl v and that’s exactly what’s restricting us from learning. \n\nEven though in today’s world everything we do is digital, I think us humans are still wired so that we learn better when we write/type something ourselves. So in a way i’m writing this comment to hold myself accountable and give a little insight as to what i’ve been doing recently to “detox”. Good luck!",
            "You don't sound like you actually enjoy the content, are you sure CS is for you?",
            "You might want to hire a tutor or get a mentor of some kind to help guide you, maybe a therapist as well.",
            "I think you’re looking at this wrong. Sure you need to brush up on your basic coding fundamentals, but don’t look at chatGPT as cheating or a crutch. The future good developers are going to be those that can utilize AI as a tool to be far more productive and efficient than those not using it. You still need to know basic stuff and a little more, but after that you can use chatGPT to help you. For a small example, It’s great to get boiler plate code started then you can edit it to what you need… \n\nNot to mention you can literally use it as the best personal tutor in the world. It will teach you step by step what you need to learn to get to whatever level of coding proficiency you desire, and won’t get annoyed no matter how dumb the question you ask is. AI is the greatest tool we’ve ever been given. Now you just have to figure out how to utilize it correctly.",
            "Sure, but why?  \n\n\nYou obviously have enough knowledge to prompt GPT to get what you want, and you have enough knowledge to debug/assemble it's outputs.\n\nAre you afraid they won't let you use GPT at work? Or is it just interview thing?  \n\n\nI'm in the same boat, but mostly work with DS/ML. I forgot completely how to load in an csv, but that leaves me brain capacity to actually do the work on the more abstract level, and then just assemble GPT output as needed.",
            "Find something you are interested in and try to make it. The assignments are generally forced upon us and doing that you like is recommended as you can gain some knowledge and down the line be able to make personal projects.",
            "Make projects, you'll learn smt new every project and it'll be a little better than previous one.",
            "!remindme 2 days",
            "test - making a post comment here",
            "In college do yall think its bad to use ChatGPT to help you debug your code when you are really stuck.",
            "The next generation will be utterly unable to do anything without access to chatgpt. \n\nYou know what you gotta do to bounce back. There's no easy way out. You just have to put in the hard work and stop relying on chatgpt for anything and everything. \n\n\nYou can see ChatGpt more like your virtual private TA. You can always reach out for help, that's not an issue. But obviously don't blindly trust chatgpt to crap out solutions to all your problems either.",
            "I use chatgpt for error solutions not to create an entire app.\n\nYou're using gpt wrong.\n\nStart programming and ask it questions to help you understand, not to generate code for you. Generating code with GPT leads to really disjointed code because it's hard for the AI to understand what the goal is exactly.",
            "DSA, Discreet mathematics, blind75, neetcode 150 and leetcode mediums. \n\nDoubt you'll pull through though",
            "Do leetcode, apply to tons of internships.\n\nYou’re ahead of where I was junior year and it worked out for me.",
            "Shift your perspective. You actually gained prompt engineering skills in addition to low-code implementations. Take those skills and run with them.",
            "Do 100 leetocde questions form a roadmap (this means understanding every concept in each question and them implementing it on your own). This should take you a 30-45 days, 2-3 hours a day. It would be best if you use C++ but java and c are also fine. Now you know how to code :)",
            "Codepath",
            "You probably know more than you think. To be honest most if not all people in these comments used chat gpt from time to time so I wont worry too much. In my opinion if you understand the fundamentals of programming/ computer science (which more than likely you do) and understand the code that chatgpt is spewing then you can figure out if it is correct or not. Try and build something without chatgpt and you might surprise yourself how much you actually know from using chatgpt.",
            "Bro your title’s first 6 words took me somewhere else 😂",
            "You’ve learned how to prompt ChatGPT to accomplish your tasks. That’s a valuable skill. The ability to clearly describe your tasks and delegate them to others allows you to accomplish more with your time. This is called leverage, and it’s highly valuable in the world of business.\n\nChatGPT is an amazing educational tool. It can generate study plans for you, teach you about any subject, and will never tire of your questions. Use what you’ve learned about ChatGPT to develop your own prompting strategies for self study and filling in the knowledge gaps you described in your post. You seem to know what you don’t know, and that’s a great start, because you know what to ask ChatGPT about. You asked some questions about DSA and tutorial hell in your post. Try literally copy pasting those questions into Claude or ChatGPT and see what you can learn.\n\nYou can even make this an opportunity to make a project that you can add to your portfolio. Try developing your own code base to prompt ChatGPT using the API. You can accomplish a lot more with custom prompts than using the ChatGPT interface alone. Make your own library of prompts in code, then figure out how to build a user interface for it. You don’t have to make a web front end. You can use the terminal as your “front end” since you’re the end user and you are (hopefully) able to use the command line. Feel free to DM me if you want to follow up with more questions about how to do this.\n\nTLDR learn how to use ChatGPT to learn things instead of as a crutch to get your homework done as fast as possible.",
            "Everyone else already gave you good advice. Would just like to add, nothing is wrong with watching Youtube videos. It should be encouraged. You just need to try to understand the logic and actually listen when the person is explaining the code on the video.",
            "Build a simple project and break down how it it works also helps",
            "It’s good to find out the purpose of being in College is to learn. Seems like a rough lesson. \n\nMaybe take some courses online Udemy or something?",
            "You learn how to code lmao",
            "just start doing basic leetcode. once you get into the habit of trying your solve problems, you’ll be fine",
            "Get familiar with language of your choice, get accustomed to syntax. Then start coding just about anything, leetcode has many problems you can explore. I was in the same boat, I didn't cheat but I just couldn't digest the materials in class. It takes me 3 months to feel alright, 6 months to feel comfortable. But I was a slow learner, so you might be able to do it in 3 months, if you're a fast learner.",
            "Honestly just make it be fun. Try something like [https://play.battlesnake.com/](https://play.battlesnake.com/)  or [https://warriorjs.com/](https://warriorjs.com/) and see how far you can get. You can get into stupidly complicated cases with these two games alone, there's section where you start needing a Behavior Tree to pass the level / competition.",
            "Depending how much youve cheated is the real way to figure out how much you need to catch up. Ive used copilot since sophomore year and they started introducing it in the intro classes this year (Im a senior now so way past).\n\nThe best way I would approach it is you definitely already know the just coding pieces and intro programming pieces if youve made it this far. With that basis you just need to get good at breaking down solutions into pseudocode and you can start understanding the problems.\n\nIm in a bit of the same boat as you, Im in the advanced dsa class at my school right now and while I definitely need work on approaching the problems, using geeks4geeks and other solutions as starting points has helped a lot. Just make sure not to only copy/paste the code without understanding how the approach works",
            "You need to be honest with yourself about why you are struggling to put the time in. Our industry revolves around our time. Time spent with customers, on customer projects, and on learning. You will never get to coast, ever. People asking you to fast forward to graduation and picture not knowing how to code. Try fast forwarding 10 years, still feeling like there is a world you need to learn, and then continually having to put in the time. It’s ok if a life of always feeling like you need to be learning is not for you. Im not trying to scare you, just help provide honest questions that you will face.",
            "When you get stuck, don’t ask chat gpt to do it for you, ask it to explain it",
            "You remind me of people in my B2 German class doing writings with Google Translate. What a waste of time.",
            "You’re doing a lot better than me, at least you have some knowledge and are only halfway done with undergrad. I am 5 weeks away from graduating with my masters (I started the program right around the time chatgpt came out and I had it do all of my assignments for me). I am now starting a PhD in Artificial Intelligence in the Fall and can barely write basic html and css. Zero JavaScript",
            "Code a real program without copy pasting anything. Sit there with your compiler and terminal and make countless mistakes and failures. If you are 100% stuck, try to find someone else's solution and figure out why theirs works. It's the only way.",
            "\"That's the interesting part you don't\" - Omni-Man. Shouldn't have cheated all you did was cheat yourself.",
            "Yeah, this is why onsites for junior swe are going back to in person to stop cheating. Just learn to code or you might as well switch majors",
            "Leetcode is its own thing... go practice until you're good.   \n\n\nUsing an LLM to accelerate yourself isn't terrible - it's great for getting unstuck on syntax. You still need to put in the time to get GOOD at coding though.",
            "Bro I promise you 99% of swes are using online help and aren’t just coming up with stuff off the top of their head. AI, documentation, YouTube, websites, are all great resources and you shouldn’t feel bad about using them. You got this",
            "Your assignment, if you choose to accept it, is to do the first 20 problems of project euler.",
            "I finished my Bachelors in CS without knowing how to code well at all… most of my knowledge came after my degree. Start working on a personal project. I had to do this at a time without AI tech, you have an advantage\n\nFor context\nI started a tech company then left and now am a senior engineer at a corporate financial company",
            "The only way to learn is if someone gives u a real life problem solving project. Thank me later in Bitcoin.",
            "Change your career... To either plumber or sparky... seriously, work with your hands, you'd be good at it.",
            "Do you still have access to the projects you were assigned in the previous semesters? It doesn't sound like you understood the solutions that chatgpt generated for them. You could go back and do them yourself without the help of chatgpt",
            "Instead of asking ChatGPT to write the answer for you, ask it to help you search for resources. You could also ask it to explain code line by line. ChatGPT is a powerful tool that does not need to be limited to doing everything for you.",
            "Go into tech consulting if you hate coding",
            "I'm really curious...  From my experience chatgpt has been awful at producing actually well integrated code.  Like, it will give you the general shape of a piece of code that will solve your problem, but it will be full of logical inconsistencies and it won't compile because language XYZ changed their standards for function ABC in version 2.5.2 etc.  Maybe comp sci assignments aren't hard enough that you have to deal with those weird integration style problems?  Or have you just gotten really good at fixing moderately broken code without understanding how to generate code organically?",
            "[removed]",
            "You’re fine. I know a few people who can’t code at all. It’s just what you want out of it. If you don’t want much out of it then you’re fine. If you’re doing this to “cheat the system” you’re gonna get got sooner or later.",
            "You're a sophomore. You'll be fine. Just take on a large personal project, much longer than anything you'd get assigned in class. Something that requires multiple months to complete and requires making multiple codebases. It could be something that you can make money off of. That usually gets me motivated (although turning coding into a business is much harder than it seems but it's better to learn that the hard way). \n\nOnce you're done with that, you'll know more than many of your peers although you'll still need to catch up on fundamental CS knowledge for your assignments.",
            "I use chatgpt at work almost every day, and Ive been seeing less and less algorithm questions in interviews this past year. Build some large project that you're interested in and ask chat gpt to help you with design patterns, project structure, etc... and explain the algorithms/concepts you dont understand.  If you have several impressive projects on github youll be able to have a future in this industry.\n\nIf you cant get interested in building a project, maybe explore a different career path.  This industry isn't for everyone, the work is often stressful and boring, and youre judged by metrics that have no real reflection on your abilities.",
            "I was in this same situation at the end of my freshman year. \n\nI went on Udemy and got the c++ course and did an hour per day. I would also copy leet code problems and then hand write the solution with explanations to why/how. \n\nA year later I’m fairly competent and much more confident in my own skills. However you need to start today, not tomorrow and not this summer! \n\nI would view my Udemy catchup classes as my gateway to gaming/the gym. No fun activities til I put in my own work to better myself!",
            "Ask chatgpt dawg, if you don’t understand how to do something, ask chatgpt. This includes how to do things outside or chatgpt output. “How can i learn [x] so that I don’t need chatgpt anymore to do [y]?” If you’re going to use the help use it completely imo.",
            "Are you passing?",
            "Really trying to resist the overwhelming urge to say: lol karma\n\nJust go back to when you started using chatGPT and look through all your projects, if there’s anything you don’t understand. Understand it. Look it up, think about it, make sure you know all of your coding projects inside and out and go on sabbatical from chatGPT.\n\nAlso: lol karma",
            "Funnily enough, you may want to use chatgpt for this. But instead of having it spit out answers for you for assignments, have it explain how to do things like two sum or how to code. Try to learn how to build a web app, or how inheritance works, or why a tutorial is telling you to do something and just play around. And if you get stuck, ask chatgpt to help you understand rather than giving you the answer",
            "Ur goin 2 jail",
            "Try doing hackerrank to get a quick jumpstart. Choose the language that you want to learn, and there will be a lot of introduction level challenges that you can do. If you finish all of the introduction/easy challenges, you'll know all the fundamental things you'll need to complete any problem in coding.",
            "ChatGPT help much more at university than in real world settings. Yet once you are hired, it will come with XP.",
            "Im in my 40s and I’m shocked at how the new hires don’t know or care about theory. And how few of them train and practice coding. It takes over 10k hours of practice to become a pro.",
            "I mean at the very least it’s unwise to simply copy and paste code from chatGPT without trying to understand why it’s making the suggestion. I’d say that this is a decent first step. In addition, I’d suggest no copy/paste but you can follow what it suggests but writing each line yourself to make sure that you understand what’s going on. \n\nIf you do, you’re right there with the rest of us. If none of it makes sense, you can ask it to help you understand. It’s a tool like anything but you can definitely use an iPhone as a hammer if you want to…",
            "ChatGPT can explain what it is doing line by line. Rather than getting frustrated, I will use it to help me come up with something on my own. Instead of getting a whole block of code, I would ask for assistance with the line I am writing. Afterwards I would put in blocks and see of there was a better way to do things.",
            "Use ChatGPT",
            "Bounce back.  Ya got nothing to bounce to.  \n\nLooks good on ya.",
            "Mark Twain says he never let schooling interfere with my education.It's the same thing w college.You go to college to get a degree and educate yourself in the free time.Hardly  2-4 classes taught are actually useful and rest is not useful unless you plan to go into academia.Even then,I'd say you have to learn 90% of the required skills which will move forward your resume on your own.And even those 2-4 classes can condensed and the crux of it can be learnt in a month.But you will have to be smart about it.You can't just go jump in yt and watch random tutorials and lectures without following any chronology.Ditch the yt tutorials if you even have an iota of doubt that you'd be stuck in a tutorial hell.If you have very less time left,then you need to follow some highly structured courses to learn.They will teach you much better than any of the 99% of college courses and actually make you competent enough to work in the workforce(unlike colllege which is just a rich country club in today's world lol).If you do due dilligence and buy decent courses and consistently follow them even for 6 months,you'd be in the top 5%(if you are  an above average iq person and highly motivated)!Also don't forget to party your ass off in college!Because soft skills matter equally or sometimes even more.If you do this,you'd be set.",
            "I used alcohol and now I can’t code as well unless I’m tipsy or hammered 🥲🥲",
            "Go work on an oil rig buddy",
            "Check out this page! https://avikdas.com/ this is the guy I’d trust to teach me just about anything. I too use AI but so do all the people working in the industry. Depending on your school and your network I wouldn’t worry too much.\n\nEdit: totally forgot to mention for dsa section look at 2019",
            "Do easy problems first. Important is, that you are able to grasp the problem and have at least a rough Idea how to tacke it. Eg: sorting algorithms and start with bubble sort.\nThen take a pen and some papers and when you run into a wall start to draw the array and its contents and draw your algorithm step by step until you are able to translate it into code.\n\nMove on with the next sorting algorithm.\nOn passing, read about time complexity and understand, why the algorithms differ here.\n\nLearn the rough concept of classes, objects, member variables and methods, then go on:\n\nBuild a stack, then a list, then a simple binary tree. \nThen build a self balancing AVL Tree. Use your brain and pen and Paper, dont Google or use gpt/Code generation after you understood the problem.\n\nThis will get you back on track.",
            "All of my projects were either written by ChatGPT or copied from a YouTube tutorial.  Well done, boy.",
            "How do people even pass the exams when they cheat on their hw?? I would've never survived the exams if I cheated. Like aren't DSA classes exams pretty much like several easy leetcode questions? You can't solve them if you have no idea how.",
            "Hot take as Im not even a cs student, but what makes you so sure youre behind the curve?\n\n95% of students are the average human. We take the shortest, easiest path to our goals. Its probable all your classmates are in the same position, quietly, and the ones speaking up answering questions in class or the group chat are the 5% who put in exceptional work.\n\nIf you are able to complete your university's requirements using chatgpt, wouldnt that mean you'd be able to complete your requirements at a job place the same way?\n\nBesides, cut yourself some slack, you are definitely not without programming knowledge. Chatgpt is not a perfect coder. It gives you incomplete pieces and struggles with complex tasks. \n\nIs a chef not skilled if he doesnt grow his own tomatoes? There is skill and knowledge required in taking a base thats already there and making it work for your purpose.\n\nIm not saying you should not try to improve if youre unsatisfied with yourself. But do not treat the situation as worse than it is. Youre a student being lazy. That is 95% of students.",
            "You still have your old assingments? Read about the relevant parts in your textbooks and get grinding.",
            "Don't study. Don't do leetcode (yet). Build applications and enjoy the challenge. Start with e.g. that hacking game in fallout as a console application, do minesweeper, do simple web scraping, and so on. When you have a hang of syntax and structure, then go back and do leetcode to hone your Algo skills.",
            "Do what self-taught developers did. 🙄",
            "that's ok, just go to management",
            "If you passed using ChatGPT then you likely had to make significant changes. The code it outputs is usually garbage either way many parts broken and incorrect. You still need to know what you’re doing to work and assemble the crappy output from ChatGPT.",
            "I think you should not focus on coding rn, but rather it infrasturcture/devOps/cybersecurity/cloud. You can learn these skills much  faster and be hireable",
            "Your cooked bro. It’s over for you. 😭",
            "It’s fine buddy you already know your problems and what you need to do to solve them so just get off your phone and social media and jump in.",
            "I don’t get it, don’t you learn ANYTHING from copying. Even me after copying and copying ChatGPT, my friends homework, online solutions whatever I feel like I retain *something* even if it is a fraction of what I’d learn had I done it myself.",
            "Bro you are literally describing me line to line, I never thought I could get the same person as me that too using prime number example for not being able to code. Would you mind having a personal conversation with me.",
            "I also fear not being competent enough to make it in the real world, despite not cheating, because I worry I forget everything from classes the moment I take a new one. \n\nYou must have learned *something.* You have some foundation from the years you spent *before* cheating, and if you used Chat GPT as a debugging/tutoring tool at times and not always just to spit out code, you should have learned something from piecing together multiple prompts, even if you didn't max out your learning. You don't truly realize how *nothing* \"nothing\" is until you encounter someone who truly never learned coding and can't fully process how for-loops work. \n\nRefresh with Leetcode to boost your confidence, and then once you refreshed the basics, review the old assignments you cheated on",
            "Just do a leetcode question with the crutch day 1. \nDay 2, try it without until you can’t figure it out. Finish with the crutch. \nRepeat every day until you can finish it without the crutch and move on to another question.",
            "In the same boat as you my friend so you’re not alone😊",
            "Surely you learnt something from those projects you did with chatGPT? What projects have you been working on?\n\nA lot of progress in programming is just learning by doing ie, repetition. So you might not be as screwed as you think. \n\nTry building a simple project in a week just to show yourself you still got it! Use the documentation pages of the libraries you use most and you should be alright.\n\nWhile building skills you should also be looking for any way to apply these skills. Your good on this with the projects, but you should try doing work under any supervision, so that you can reference your supervisor on your resume with the work you did. One way to do this is with volunteering your skills if that is possible or joining your universities student teams. This will also allow you to include soft skills on your resume with the project you were involved in.\n\nDon't freelance, it's peanuts for hours of time you could be spending learning or looking for volunteering opportunities. You won't be getting a high paying freelancing role as you have no credentials, so maybe $5/hr. Grinding it for reviews is not worth it either.\n\nAnd don't stress too much man! Just remembered to be honest with yourself everyday and you'll improve faster and faster.\n\nI use chatGPT myself too but it's so slow so I use it most when I run into some random edge case. I don't think I'm as far gone as what you've described and I cant see how it could get that bad. I really feel you might be overreacting. Follow the steps I described and hopefully you can get some confidence back.",
            "You can focus on getting a cs job that doesn’t require coding",
            "Read a book",
            "Time to go into PM, that’s the usual route",
            "Does AI not help you learn faster? Ask it all the questions you want like what does this line do or I’m getting this error… building projects is much faster too the key to getting out of tutorial hell is AI bro",
            "are you able to write common sense code like an if else statement and a for loop?",
            "You bounce back by doing it the right way.",
            "Why shouldn't companies do that imstead of hire engineers?",
            "Project based learning is helpful, even though academia still has its checkboxes you have to check.\nYour a sophomore, I’d say relax a bit, and use chatGPT (google, et. al) to ask away your questions on what you feel less informed about (as detailed as you want). And pick a complete project you as a sophomore/junior can accomplish in the summer. The learning process and building projects is what you’ll be doing post graduation anyway (maybe you’re whole career?). I’ve personally learned a lot since graduation and constant learning is what is required of you in the professional life unfortunately. If you want a suggestion for a project, I’d say a finish a simple web app that gets your hands in database, frontend, and server side development as there are so many web dev jobs in real life anyway, and web dev is excellent well rounded experience. Maybe you could build a simple social media app. Haven’t tried leet code myself, maybe that’s healthy to do as well. But good luck! You can do it. \n\nFor web dev, I’d also recommend a react frontend to get familiar with react.  but not if you haven’t done any web dev yet because that is advanced. Any languages will do well for you though.",
            "Most people leaving college can't code for shit. Even if you can't, you're the norm. \n\nAlso, if using ChatGPT is cheating, there's a shitload of employed SWEs cheating every day right now.\n\nIt's true that you should not just blindly copy and paste things. Look through the code you get from AI, test it, make sure you understand what it's doing. Tweak it where necessary, improve it. \n\nYou're not boned at all.",
            "Lmao your heading into Junior year. That’s when everyone actually learns how to code in my college.\n\nEven before chat gpt, assignments weren’t hard enough to not find the answers up until that point. Then junior year hits, and questions become difficult. Solutions are no longer easy to come across. You learn.",
            "Lol this post is indicative of the problem, you want stuff handed out to you. Check what tech skills are hot right now come up with a plan to learn, make projects and stick to it. Stop ChatGPTings stop asking Reddit for advice. ",
            "Read up until you mentioned chatgpt then figured chatgpt probably wrote this post... It's a long, hard, grind and you've made it harder. Do it or don't it's a personal choice",
            "Drop out",
            "Once a cheater always a cheater. You're going to have to cheat the rest of your life. Your path was etched from the day you were born. Molded. Embrace your trueself. Learn how to hone your cheating powers.",
            "What's the point of doing CS if you don't even want to code...",
            "So pathetic",
            "What should you do? Stop using ChatGPT, dummy. You have the textbooks, go through all the exercises again with no ChatGPT.\n\nOnce you've done that, build and deploy a basic CRUD app from scratch, without ChatGPT\n\nIf you already cheated your way thru DS&A, go and grind some leetcode without ChatGPT.",
            "[deleted]",
            "[deleted]",
            "Leetcode is enough to pass interviews. Maybe do a full stack project like weather app so you can do some front end stuff and calling some API.",
            "Reposted from a couple months ago 🤨"
        ]
    },
    {
        "post_id": "r2f4s6",
        "author": "happyguydabdab",
        "title": "Can we collectively name and shame Airbnb?",
        "url": "https://www.reddit.com/r/csMajors/comments/r2f4s6/can_we_collectively_name_and_shame_airbnb/",
        "score": 1080,
        "num_comments": 85,
        "created_utc": 1637902203.0,
        "selftext": "For those of you who don’t know, they are rescinding all 2022 intern offers. \n\nThis could seriously affect some kids careers. There have definitely been some people who stopped the grind/rejected other companies to accept Airbnb. \n\nI feel incredibly bad for our fallen brothers/sisters. We won’t be able to get them their offers back but companies should know this is wrong. \n\nWhat would be the best way for us to publicly name and shame them?",
        "permalink": "/r/csMajors/comments/r2f4s6/can_we_collectively_name_and_shame_airbnb/",
        "comments": [
            "[deleted]",
            "Yeah, seems like they weren’t even sure about it with how fast the application went down. The recruiter also told me that it was only her for the entire internship applicant pool. Nuts. That is just so fucked up. I thought that it was messed up only because of some people stopped the grind, but I totally forgot that some people might have literally said no to other companies!!! That would make me so mad. \n\nThe best way is for everyone to make a LinkedIn post, and if a few go viral and one catches the news, they might, mayybeee, give out offers again.",
            "Swe from Airbnb tried to get me to join an mlm in Seattle lol",
            "i am unable to understand why they are still admitting people and waiting until after thanksgiving to rescind offers. are they trying to sabotage those students' future plans?????? as soon as that decision was made they should've just sent out a mass email to every applicant in the pool",
            "Why are they still rescinding offers tho? Wasn't that just 2020 thing? Tf",
            "Btw was this confirmed?",
            "I haven't seen any verifiable proof of this, let's all chill until there's some real evidence.",
            "it's a crap company",
            "I see this popping up a lot here w a lot of “happened to my friend” but very little proof. There is a group of ppl very dedicated to make it go viral tho",
            "wow thats pretty shitty. F's in the chat for the fallen. wtf airbnb",
            "yeah some stuff is happening in tech for sure, Zillow and Citrix had lay offs very recently",
            "Wait also in 2020 I heard they not only rescinded intern offers but new grad offers..",
            "I did the OA for Airbnb and passed it, but got rejected afterwards, I asked for the reason and the recruiter wouldn't say(company policy). Well guess what, I'm so glad I got rejected lol. An offer being rescinded is much worse than rejection at OA stage.",
            "i mean airbnb is literally responsible for the housing market crisis so idk why them being villains surprises anyone 😭",
            "This is exactly why I always encourage folks to take FA(Apple, not Amazon)NG offers over so-called hot startups or Post-IPO companies. I can’t remember when was the last time FANG has ever rescinded intern offers or implement mass layoffs of their tech forces. You never know what risks you are gonna face when joining those other places. Money will come.",
            "Can people sue them for this?",
            "Relax, if someone is good enough to get into airbnb their career will be fine",
            "yo that's crazy we don't care + ratio + L take + prolly CS transfer + uw better",
            "why should you shame them ?\n\nyou don't know anything about how their business is going \n\nwe do know that there are reports of covid cases increasing and even some places reinstituting lockdowns -- so travel (and the need for airbnb services) may become limited again \n\nmaybe they just decided it doesn't make sense for them to financially support new interns next year",
            "[deleted]",
            "Another Zillow?",
            "I wouldn’t touch AirBnB with a ten foot pole until I’m a senior engineer.",
            "Any update?",
            "."
        ]
    },
    {
        "post_id": "18xv4wj",
        "author": "HouseOfHoundss",
        "title": "Who else has been applying for months?",
        "url": "https://i.redd.it/w5gw75cxpaac1.jpeg",
        "score": 1077,
        "num_comments": 205,
        "created_utc": 1704318499.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18xv4wj/who_else_has_been_applying_for_months/",
        "comments": [
            ">6 hours ago\n3573 applicants \n\nLol, lmao even",
            "LMAO i applied to that too",
            "My good friend And has a bachelor’s in computer science and master’s degree and cannot even land an interview has been applying for over a year, I feel bad for him as he’s been hitting the bottle hard. Hopefully things turn around I think it’s due to the mass layoffs and economy coupled with over saturation and uncertainty of the future. Really bad time for jobs in computer science for entry level & intermediate :/",
            "[deleted]",
            "It’s a lot of todo calculators and bootcamp grads",
            "Depressing",
            "There's not way there is 3k applicants after a job that was posted 6 hours ago.",
            "Yeah I've been applying for months, and haven't gotten anything. The job keeps getting reposted.",
            "I have stopped applying to easy apply, I have never gotten any reply from these",
            "You're not gonna get any remote jobs at entry level. I have 3 years and been applying to remote exclusively bc I don't like going to the office. Its been months and no interviews so I'm still stuck here with like half motivation",
            "Don’t worry. The majority of these applicants dont even have a BS degree. They’re just clicking and applying to everything they see pays over 100K a year",
            "I'm pretty sure this company keeps reposting their applications over and over. \n\nI stopped tracking my easy applies because they feel like yeeting your resume into the void, and I think I accidentally applied to this one at least twice before realizing it",
            "Everyone wanted to study CS for the amazing salaries, even at entry level. Now, the market is super saturated and you’re left competing against thousands for every position :/",
            "I have been applying for a lot of job posts. Everyone just ghost out or send unfortunate mail. Applying on job portal is not helping at all. But recently I started mailing HRs & senior engineers of company with openings (not talking about big giants, they have a very strict process of recruitment, we cannot bypass it). \n\nI got calls from 4 companies with this trick. Got a internship+ PPO offer from a decent company without even applying on their workday portal.",
            "https://preview.redd.it/s7wnx1b60eac1.jpeg?width=1179&format=pjpg&auto=webp&s=8d7f1469ee35429f082c98ededb4af640f18103b\n\nNo kidding 🙄😲",
            "Times are weird, was layed off and went unemployed/underemployed for 18 months. This past month got offered 3 offers within a week, I was stressed, and angry with little room for what should have been happiness.",
            "Now watch that number go up after people here seeing it lol\n\nYeah it’s a clusterfuck of applications from new grads, soon to be grads, juniors, foreigners, self taught, bootcamp grads and so on lol",
            "Are you americans really out here getting 80k salaries for entry level postions. Im currently in my first software job and im getting £25,000 ($30,000) in the uk. God this is just depressing",
            "Fuck that I'm gonna do my masters degree in something else😭",
            "Lucky enough to land a job with no degree yet, still working towards it but I have many 1st place CTF wins under my belt and a lot of experience in leet code competition coding which I think helped a lot. Try expanding and doing competitive programming, getting certifications and other extra stuff that would set you apart from everyone else coming out of college applying.",
            "Hard pass... 11-50 employees and I'm expecting them to pay me in that salary range? No chance",
            "If i see over 20 applicants im not applying. It is waste of my time as i know im not even in top 20% with my lack of any preparation - last time i prepared for recruitment meeting was 10 years ago or more.",
            "Honestly I am tired at this stage. I have having less and less hopes of getting an internship. Being an international student only makes things worse.",
            "Its been 3 months and i am not even getting any replies.",
            "Months .... I have been applying from a year daily i applied atleast 10 and more most of them ghosted many get rejected some got and they are scammy and fake jobs just asking for money for joining\nRight now it's really hard to get a good or even a job",
            "Whenever I see some shit like this, 1000s applicants within hours I just don't even bother",
            "lol im cooked",
            "what option do we have though? i have a masters degree, i have spent 6 years of my life acquiring the craft, now leaving it would just be stupid in my mind. Though for your question, 8th month now.",
            "Computer science gotta be the weirdest field when looking up information online. It’s either everyone is making 6 figures right out of undergrad and you’d be stupid to pursue traditional engineering degrees, or the market is over saturated and it’s not as amazing as everyone claimed",
            "Tbh if you really want a job sooner than later you should stop applying for remote roles and stop using linkedin. I'm going to have to take a relocation (which I genuinely want in my case) but my results drastically changed when I focused on applying to company websites for in office/hybrid roles. No callbacks or responses from any of those remote or linkedin posted roles for 5~ months, and within the last month of switching up my strategy I'm finally having interviews :)\nGood luck",
            "Damn. Just graduated with a bachelors last year. Might be time to pivot",
            "For those struggling applying on LinkedIn. Don't do \"easy apply\". Even if you see one, go to the company's website and apply there. You are much more likely to be seen and get a response. \"Easy Apply\" is just the void for application because everyone, qualified or not, can click 3 buttons and be done so recruiters have to sift through 3k unqualified for just one semi valid candidate.",
            "Those are some rookie numbers lmao... In my country you'd get more applicants for an unpaid internship",
            "Has anyone ever actually heard back from this company? I'm seriously curious because I've seen their same jobs posted consistently for over a year now.",
            "[deleted]",
            "[deleted]",
            "Crazy competition",
            "Ongggg it keeps saying closing and and reopening the application!!",
            "This company is just straight spam, they do the same listing so often.",
            "Yall are lowkey dumb af for looking at the most generic remote jobs possible, and being surprised that there’s thousands of applicants. Find your niche.",
            "[removed]",
            "https://preview.redd.it/qkn2nj769hac1.jpeg?width=1170&format=pjpg&auto=webp&s=9afe93c4b62d418e3be1b22ff6dad380e167703d\n\n3k applications, kill me",
            "jesus",
            "I just got a software engineering job without a degree",
            "stop using easy apply.",
            "Are y'all just writing scripts to automate applying maybe?  That could be why it's so many applicants per position 🤔",
            "The cs major is being replaced by people without degrees",
            "Don’t be morons and apply to LinkedIn remote jobs. Look in your area or areas you are willing to move to. Filter by on-site and hybrid jobs, then filter by posted in last week, and then apply to those jobs I will promise you you will have a much higher callback rate",
            "if it makes you feel better, my boss straight up told me there were over 1,000 applicants for my current position, but only about 40 were actually living in the country, with about half of that being \"somewhat qualified enough to interview\"",
            "I thought after 100 it says \"Over 100 applicants\"",
            "Been applying for months, have had a handful of leads and interviews, but no offers :("
        ]
    },
    {
        "post_id": "q1cm3h",
        "author": "seco-nunesap",
        "title": "HELP! I've just screwed up my FAANG Internship. I pushed my code to prod and now everything is down.",
        "url": "https://www.reddit.com/r/csMajors/comments/q1cm3h/help_ive_just_screwed_up_my_faang_internship_i/",
        "score": 1078,
        "num_comments": 37,
        "created_utc": 1633374763.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/q1cm3h/help_ive_just_screwed_up_my_faang_internship_i/",
        "comments": [
            "Do you work for facebook or its sisters ?",
            "I heard hbo is looking for interns",
            "NTA, Facebook had it coming",
            "Well done!",
            "Man of the hour. 🙌🏻",
            "Lawyer up, delete faceb-- wait",
            "LEEEEROYYYYYYYY JEEEENNNKIIINNSSSS",
            "\\*whishpers\\* You... you wouldn't happen to work for Facebook, now, would you?",
            "Lol",
            "God damn it Frank!",
            "are you the one who cost $6 mil to MZ?",
            "Won’t do that again 👀",
            "Lmao good one.",
            "Tf was that u?",
            "Legend.\n\nWe all do this from time to time.  The senior devs can help you sort it all out.\n\nLive and learn 🙏",
            "so no return offer?\n\nupdate us please, just in case I mess up too",
            "Why do you have access to prod? Sounds like their problem.",
            "No way in hell this is real but it's fucking funny",
            "Fuck FAANG",
            "Is that why Facebook and Instagram were down?",
            "There should be checks that happen before anything is pushed. Not possible lol😂",
            "[deleted]",
            "lol",
            "Amazon"
        ]
    }
]