[
    {
        "post_id": "rdf2jh",
        "author": "SnooDonuts7261",
        "title": "Interview From Hell",
        "url": "https://www.reddit.com/r/csMajors/comments/rdf2jh/interview_from_hell/",
        "score": 1065,
        "num_comments": 129,
        "created_utc": 1639160828.0,
        "selftext": "I just went through my Microsoft onsite for new grad and literally just had the worst interview experience of my life. Interviewer showed up with his camera turned off and wanted to go straight to coding. He gave me a question and I explained my approach and then he wanted me to solve it using a stack DFS instead of recursion, which I had never done before so I struggled a bit. I usually have some scratch paper in hand so I can visualize things, but he told me that I wasn't allowed to do that  and to use the Codepair scratchpad. Later as I looked to the side to think for a second, he asked me \"why the fuck are you looking to the side\" (verbatim) and to focus on the screen, to which I apologized and kept going. He wasn't really angry, in fact he was laughing when he said it but at this point I was extremely uncomfortable and it was impossible to think through the problem. I was explaining my thought process and when I said something about popping a node from the stack he deadass replied \"Ayee pop it like it's hot\".\n\nHe then started getting impatient when I couldn't solve the problem and he started throwing out a lot of curse words in his hints (that weren't ever helpful) and then said \"C'mon you're a \\[T10 uni\\] student, show me some code\", which is probably one of the most demoralizing things I've been told. He ended it and asked me if I had any questions. I asked him how he liked Microsoft and he said you learn a lot but \"the pay is shit and the work is boring.\" I thanked him for his time and he said yeah and dc'ed (this was the first interview of the loop). Got rejected the next day.\n\n&#x200B;\n\nGG",
        "permalink": "/r/csMajors/comments/rdf2jh/interview_from_hell/",
        "comments": [
            "> Ayee pop it like it’s hot \n\nbruH lmfao",
            "Definitely email your recruiter and complain. They may give you another go with the interview. Do not stay silent, it is not ok that he acted like that during your interview",
            "[deleted]",
            ">I asked him how he liked Microsoft and he said you learn a lot but \"the pay is shit and the work is boring.\"\n\n😂💀",
            "I have a Goldman Sachs interview two days ago and the interviewer didn’t even bother to introduce himself. He then gave me a coding problem and said that I cannot use scratch paper but I need to use the drawing utility on coderpad which I was not comfortable with. then halfway while I was solving the problem he switched to a completely different one. And then he said “How did you even end up in the final round”. He was smirking all along. And then he said he’ll end the interview if I didn’t tell him how I passed the first round but I was not able to answer the final round questions. And then he ended the interview 20 minutes early. I was legit sobbing after that interview. Still thinking if I should email the recruiter about this experience.",
            "> Ayee, pop it like it's hot\n\nI'm sorry, but this made me laugh out loud. \n\nOn a serious note, sorry you had to go through that",
            "He probably works as one of those guys who answers questions about Windows on the forum. Those people get shat on by everybody,",
            "This doesn't sound like an interviewer from MS at all. The best possible explanation could be that he is either on a 2 weeks notice or is planning on leaving soon and doesn't care about the interview at all. I would highly suggest to contact HR and report this behavior. Such an unprofessional ass !",
            ">\"C'mon you're a \\[T10 uni\\] student, show me some code\"  \n>  \n>I asked him how he liked Microsoft and he said you learn a lot but \"the pay is shit and the work is boring.\"\n\nThis man gotta stay off Blind for a minute LMAO",
            "I'm sorry but reading this was fucking hilarious",
            "WTH! I am preparing for interviewing candidates and one of our first lessons is to make them comfortable and have a start up talk to warm them up. It is hard to believe he underwent any proper training to become an interviewer. You should totally mail the recruiter how unprofessional the interviewer was and tell them everything you posted here. Letting this guy to interview candidates is just a disaster waiting to happen.",
            "Okay kids, listen to me, and old dude who's been working in tech for decades...\n\nIT'S OKAY TO STAND UP FOR YOURSELVES! My first \"big boy\" job had a CEO who was a former military officer and used to get two feet from our face and curse at us for what felt like hours. You don't EVER have to put up with someone treating you like shit, or cursing at you.\n\nThis is a candidate's job market, and if you're all graduating with these great degrees from great schools, you'll find that first job that'll treat you like a human being like you deserve. And maybe it's not with something like a FAANG company right away, but maybe a smaller place that would kill to have a new employee with skills like yours would be infinitely better to grow you for a couple of years at the start.\n\nSo the next time someone curses at you during an interview, or asks \"how'd you even make it to this round?\", do me a favor. Look them dead in their self-righteous, beady lil eyes and tell them, \"I'm sorry, I won't be spoken to in such a manner. I'll be withdrawing my candidacy, ending this interview now, and I'll be emailing everyone I know at your company about your behavior.\"",
            "Lol what’s up with Microsoft and having the worst interviewers? I’ve heard literal interview horror stories from at least five separate people regarding an interviewer being condescending or just treating their candidates like shit.",
            "I asked my Meta interviewer why he joined meta and he said he joined for the high TC lmao",
            "You just interviewed with a dude on his last day.",
            "My first round Microsoft interviewer accused me of cheating (checked my computer's clipboard via Codility & asked me why I was looking to the side, I have dual monitors & my webcam is always at an angle, I explain this to every interviewer including him), and in my final Microsoft round one of the interviewers told me I'd gotten a problem wrong when I'd actually been assigned it for homework in one of my classes (so I hadn't coded it before, but I had a vague idea of the algorithm & when I ran it, I got the correct output. But nope, she said that my approach was wrong and didn't even explain why). \n\nUnfortunately, I know 4-5 other people who had similar experiences (especially being accused of cheating) so you're not alone. My interview experience with Microsoft was actually so bad that the moment it ended, I immediately signed one of the other 7 offers I had already without waiting to hear back (although I got a rejection from Msft as expected)",
            "This was hilarious to read, but yeah totally unprofessional. Definitely talk to your recruiter about your experience with this interviewer and see if you can do a do-over.",
            "Had a similar experience interviewing for Microsoft. My interviewer was super condescending and didn’t even sound like he wanted to be there in the slightest bit. I asked him a question, he stopped mid answer and said “Oh looks like time is up. Okay bye!” And closed the meeting. Awful",
            "I wanna believe this is satire",
            "complain to your recruiter",
            "Report this to your recruiter, please.",
            "Interviewer was a moron, I'm sorry to hear that. I hope you get another chance with a non-jerk. \n\nBut while you're in the interview prep mode, memorize this general pattern:\n\n    def dfs(root, item):\n        if root is None:\n            return False\n\n        stack = []\n        visited = set()\n\n        while stack:\n            x = stack.pop()\n            if x in visited:\n                continue\n            if x.value == item:\n                return True\n            set.update({x})\n            stack.push(x.left)\n            stack.push(x.right)\n        \n        return False\n\nThat's python, so wrangle it into your language of choice. It works for any graph, but the above assumes a tree-like data structure. Add the neighbor nodes to the stack in the appropriate way for whatever question you get. Backtracking and keeping track of the path adds complexity, think both of those cases through. Walk through that step by step until you get why it works. \n\nThe part I like the best is that you can change this into a BFS by changing the stack to a queue. Maybe even better, you can use a priority queue to change it into A*. \n\nAnyhow, memorize it and write it several times. Solve mazes, count islands, search trees, determine if some data structure is a tree, find an optimal path, level print a tree, etc and so forth. Really get it in your head solid so you can focus on the question you're asked and not the details of how to implement the DFS.",
            "Sounds a lot like my experience with Google earlier this fall. Entitled people that believe they are royalty.",
            "Sounds like a pasta",
            "Microsoft is the ONLY company I’ve interviewed with where my interviewers had their cameras off (2/4 did)",
            "?overwritten",
            "i would complain to your recruiter but then again microsoft recruiters are shit too",
            "This made me laugh lmao. Good luck on your other interviews! Sorry that you got him as your interviewer.",
            "lmao this reads like a satire",
            "I really do hope this is satire but knowing *some* interviewing experiences it also doesn't sound too far off from reality. Sorry you went through that OP.",
            "This HAS to be a shitpost lmfaooo",
            "The pay is shit and the work is boring. He is correct and most of my colleagues would agree. This is how life is here. Gave you a legit look inside. It's not for everyone.",
            "If this isn't satire, then definitely ask your recruiter for another chance because this sounds awful. I had a really good experience interviewing for Microsoft so this is definitely not the norm",
            "I had a similar experience. It’s like everyone at microsoft never made a mistake! Satya nadella talks about empathy, yet the employees are far from it.",
            "Oh my this is hilarious. I doubt the authenticity though, ngl.",
            "That dude should not be acting like that man, I never experienced anything like this but I’ve heard a few stories from my friends and people at school who have gone through an interview with a crappy interviewer. Those interviewers were on the other side of the table at one point and should know what it feels like. So instead of being an ass they should be kind and try their best to assist you through the interview to the best of the best of their abilities. I’m really sorry you had to go through that, definitely complain to your recruiter, that person should not do interviews ever again.",
            "True for Microsoft but also applies to MANGA. You won’t be changing the world at these companies; but you’ll definetly improve your odds to get to work at a ’disrupting’ (whatever the fuck that means) start-up.",
            "Ain’t no way",
            " Almost guarantee this didn’t happen",
            "Aye pop it like it’s hot",
            "Lmao. This is actually hilarious. Dw there’ll be more interviews. This makes for a hell of a story though.",
            "Had some similar experience interviewing there 8 years ago.  Third interviewer flat out ignored me the whole time so we just sat in his office without saying a word.\n\nTalk with the recruiter about your experience with this person.  But you probably learned something useful: this department is probably not great to work for.  If they do offer you a chance to redo the interview process, try asking for a different department.",
            "F",
            "I think better question you could ask him is to ask if he can imagine that he is kangaroo, so he can fk off in leaps. You are maybe newbie developer, but you have enough life experience to not let someone make you feel like a piece of s*it.",
            "Can you imagine actually working for him?",
            "Interviewer obvious very dissatisfied with his work. Probably already secured another offer and just enjoy trolling you before he can quit or get fired with benefits",
            "he was intoxicated and please report him. no one should. have to go through this experience.",
            "As prestigious as working in the USA for a big tech company sounds, it also sounds like I’d hate it.",
            "And I thought my interview with [not quite faang] company was bad because I got very little feedback throughout...",
            "Email your recruiter and get in contact with HR. Microsoft IN PARTICULAR takes a strong stance on its company culture and this person was rude, unhelpful, and unprofessional. You shouldn't lose out on a possible good job because he can't get his act together for a 45 minute interview.",
            "You need to report him. Talking someone down during an interview is unprofessional and disrespectful. As a matter of fact, he should get reprimanded for that kind of behavior. All these FANG companies seem like a great place to work; however, no matter how hard you work in these companies, they treat people like trash.\nYou're not trash and everyone here should know their worth.",
            "That’s the funniest Reddit post I ever read! « Ayee pop it like it’s hot » lmfao.",
            "it confuses me that you have never done dfs using a stack before (isn't that the most obvious way to perform dfs?)",
            "Forgot shitpost tag",
            "Yep, hiring and interviewing is totally f up @ MSFT. You’re lucky not knowing about D&I s show going on there, where hiring even a good candidate hits the HR wall with diversity hire quotas… So, forget about them, find a better place.",
            "Good copy paste",
            "[deleted]",
            "Most of my coworkers are chill but I know 1 or 2 who would do that type of shit of an interview. I’d be one of them because I thought it would make you feel more relaxed LMAO. Don’t worry about the T10 comment they are probably just fucking with you. No one I know of holds different standards because of the school we go to. If we like ya and we want ya, we coming for it. We can do it the easy way or hard way, the choice is yours. Team and sister teams hired from all spectrums T10, T100, international, etc.\n\nPS: I’m going to try to keep interviews professional in the interview. Lmao",
            "How did you get an interview with Microsoft? I’ve been applying but getting rejected.",
            "Pop it like its hott",
            "This has to be satire",
            "."
        ]
    },
    {
        "post_id": "mfx8oq",
        "author": "None",
        "title": "Women's experience in CS",
        "url": "https://www.reddit.com/r/csMajors/comments/mfx8oq/womens_experience_in_cs/",
        "score": 1071,
        "num_comments": 237,
        "created_utc": 1617045669.0,
        "selftext": "In lieu of the 'stop sexism in cs against men' post from last night, I wanted to provide some context to the other side. I'm not denying the existence of positive discrimination for women, I'm just saying thet it isn't as prevalent as a lot of yall like to make it out to be (20% of cs majors are women vs btwn 20-25% of swe's are women) and the crap women have to deal with is equally, if not more, important. It's very easy to 1. assume women only get jobs in this industry because they're women and 2. act like being a woman in this industry makes our lives easier when that is easily not the case.\n\nI could sit here and give anecdotal evidence on what it's like to be a woman in cs and I'm sure a lot of other women on this sub can, but I won't. Some people accused me of making baseless claims so I decided let's look at some stats\n\nAccording to [this article](https://www.cio.com/article/3516012/women-in-tech-statistics-the-hard-truths-of-an-uphill-battle.html) the amount of women who get cs degrees has dropped from 27% of total cs degrees to 18% in over 20 years. I want everyone to ask themselves: did women wake up one day and decide that they no longer wanted anything to do with computers? In fact, here we have a [NYT Article](https://www.nytimes.com/2019/02/13/magazine/women-coding-computer-programming.html?auth=login-google) that explains in depth the history of women in computing and how it started off predominantly female, as a lot of you know.\n\nI also saw someone say that the amount of jobs given to women in tech is disproportionate to the amount of degrees that women get which is also false as the retention rate for women is 38% versus 53% for men. [Here](https://www.isemag.com/2020/10/telecom-the-latest-stats-on-women-in-tech/) we can see that that the rate of women seen in higher level positions decreases as well.\n\nSo why is this? One could argue that it's purely women's problem that we as a whole often choose to not enter male dominated work spaces.\n\n/u/ilovechee3e pointed out very well in that previous post that [60% of women face unwanted sexual advances](https://www.elephantinthevalley.com/) when working in this industry. Maybe, as much as we attack positive discrimination, we should be holding our colleagues and classmates more accountable for how they treat women. It's also frustrating, as a woman who regularly frequents this sub, to see SOME of you act like being a URM (in this case being a woman), is the only reason we get anywhere. When I got my first offer last fall (after applying to 100+ positions and practicing JUST LIKE THE REST OF YOU) I was told by my recruiter that I was one of the top candidates they interviewed.\n\nMore reports:\n\n[3/4 women report discrimination in computing industry vs 3/20 men](https://www.vox.com/2018/1/9/16870120/women-discrimination-pew-research-computer-job-workplace-harassment-stem)\n\n[78% of female start up founders have been sexually harrassed](https://spectrum.ieee.org/view-from-the-valley/at-work/tech-careers/the-numbers-of-women-in-tech-rise-and-fall-but-sexual-harassment-is-ever-present)\n\nA lot of interesting stats by [pew research](https://www.pewresearch.org/social-trends/2018/01/09/women-in-stem-see-more-gender-disparities-at-work-especially-those-in-computer-jobs-majority-male-workplaces/) includiing 50% of women in stem report some kind of gender based discrimination, 1/5 being sexual harrassment (that's TWENTY PERCENT OF WOMEN). This number goes up to 30% for women in cs\n\nTL;DR:\n\nYes positive discrimination for women exists. Context is required. To paint it as just 'sexism' without ever addressing the amount and level of misogyny women face is wrong. To act like it severely hinders the ability of men to get jobs in this field is also just blatantly wrong.\n\n&#x200B;\n\nAlso wanted to clear something up before some inevitable comments I get:\n\nThis is mostly about the US. I can't comment on practices in other countries as I've seen a lot of people complain about India.\n\nI'm not a man hater. I literally love men.\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/mfx8oq/womens_experience_in_cs/",
        "comments": [
            "Thank you for putting this post together!",
            "I will say at least at my university, the woman are about 10% of the graduating class but make up 50% of the honors college and regularly are in the top 20 of the class. \n\nThat is not because it was handed to them. It’s because being a woman in CS is hard. The ones who stick around work their asses off to make up for negative stereotypes. They aren’t apathetic in the way some men are, because if they weren’t completely in love with the field, they would leave.\n\nI think it’s unfair for women to have to put up with that stuff to get the same degree. I can understand why some leave. I have immense respect for the ones who stay. Even with the few advantages women get in the hiring process, it’s still much easier to be a man and I recognize that. \n\nIf you’re a man complaining about sexism and saying that no company will hire you because you are a man, you’re kidding yourself. Look inward and fix your problems instead of blaming people who work harder than you.",
            "Thank fuck someone wrote this post. Ngl, a lot of the attitudes in CS are misogynistic af it’s insane. Borderline incel behaviour tbh",
            "I was in the top 5% of my class in university yet all my achievements and job offers were dismissed by my male classmates and they said I was only getting them because I was female. Being a woman in STEM is tiring.",
            "Yeah I don’t know why people were being dense and asking shit in bad faith when women say this shit. Definitely need to hold each other accountable of any harassment",
            "Yeah... I was kinda shocked to see that post get so much traction here...",
            "Thank you for this. I’ve had my fair share of bs whilst doing my diploma first at one institute and then again at my current University.\n\nI’m in NZ for reference. I’m also no man hater hahaha but it’s just what it is unfortunately!",
            "The 3 things this sub loves shitting on most are women, minorities, and amazon.",
            "I'm glad you posted this! \n\nI had made a similar response for the other post, but ultimately ended up deleting my comment in frustration for being so attacked lol. I'm glad this is getting such a positive response, I was as surprised as the other commenters here that the other one was getting upvotes and awards.",
            "UK here. Can confirm, I've gotten a few \"they only hired you because you're a woman\" remarks. You know what, no. I'm damn smart, I got a first at a good university, and some extra awards. The examiners didn't know I was a woman. It didn't matter.",
            "In a massive lecture hall at a big university, the number of women in each CS class I've had takes up like, at most a row of seats. \n\nI really doubt that's the source of anyone's employment troubles.",
            "This is one of those problems that’s really hard to solve bc you probably gotta rewire millions of brains. I remember once I asked a female project partner where she got a library from. However I worded it poorly and said something to the tune of “who wrote this?” (as if I were questioning her ability to code) and I said it in an accusatory tone. Like great, now I’ve made the environment slightly more hostile. And if someone were already insecure, questioning whether they belong, these kinds of things can compound and maybe make the environment unbearable. Also, I’m not very sociable, and I know CS got a lot of awk guys who prefer to keep with their own friends, and a newcomer’s perceived social isolation can also make the environment feel hostile. Nothing can be done there besides asking y’all to act normal (which itself is hostile towards people with Autism or Tourette’s).",
            "Where is this other post? Link? (Sexism against men)",
            "100%",
            "Thank you so much.\n\nWhen I was in school there was this one guy who said in the presence of like the 5 girls in our class, “It’s sooo much easier to get a co op as a girl!” I had a perfect GPA, a previous degree, and extracurriculars. I beat out A LOT of people for that co op. So did the other girls who had gotten one. And you know who didn’t say anything? The fifteen guys within earshot. One of the girls called him out though and bless her. Bless you Sue, you tell em! In my opinion, the guys who say our claims are baseless just prove that this shit doesn’t happen to them because they literally can’t even comprehend it’s real.",
            "Thank you. Seriously.",
            "lol India is next level misogynic, while most of the people getting a degree is in some kind of engineering. The computer science and engineering job market is saturated and on a daily basis women anyway receive sexual advances ,  even just while walking.",
            "You honestly shouldn't even need to make this post. There's not enough women here. It's a total dickfest. A class of 120 people has 25 women. How is that fine?\n\nPositive discrimination to have more woman may be argued to be ineffective at creating more women graduates but to complain that they're taking men's positions is utterly daft. \n\nThe level of discrimination and harassment women face is bullshit. In society and in this industry. I'm so saddened that this post needs to be made but it needs to be made.",
            "[deleted]",
            "The amount of misogynists in these comments is insane",
            "Men: women ratio is skewed in CS and IT industries.\nSexual harassment, lewd comments are common for women here since women are outnumbered. And women too face rejections if they are not fit for the job.",
            "[deleted]",
            "Thanks for saying this. \n\nI normally try to be sympathetic to the other side of the argument, because everyone has been having a hard time finding jobs for a while now. But I'm starting to get tired of the \"you only got in because you're a woman\" statement myself. \n\nThis is anecdotal evidence of course, but I've only heard it from people who didn't put as much effort into finding jobs as I have. I got a job because I tried harder, researched more, came up with more creative ways to apply to internships, applied to more positions, and contributed more during past jobs than anyone who has ever told me \"you only got in because you're female\".\n\nIf you haven't tried as hard as someone else yet, then its not really accurate to use you only got in because of x as an excuse.",
            "Guy developer in the US here. Yeah this is just an excuse invented by some bitter guys when they don’t get a job lol. In my company there are a lot of female developers, about 50% of our developers are female and they’re here because they’re good. \n\nI agree that there can be challenges to women due to unwanted sexual advances in the workplace. I feel that deep in a corner, some companies might be looking to hire more women to increase their gender diversity but I’ve not seen any so far. \n\nI’ve seen some of my female friends who are very attractive struggling to land jobs after interviews. By the logic of these guys, they should be landing jobs left and right. Also, the hiring process is pretty standard across most companies in the industry these days and it’s hard to slip a candidate based on looks through over other better performers.",
            "Girl here - degree in engineering, and now getting a higher degree in CS. \n\nNormally stay quiet on these things... but I just hate all this arguing. Why do we have such a problem with the idea that maybe, just maybe, more men are interested in CS than women? Scandinavian countries that have done everything to \"even the playing field\" between sexes have only seen the divide between what men and women want to pursue grow. While I've been lucky to never have been mistreated as a female in the field (yes there have been sexual advances, but that's not a STEM issue, it's a general issue that's related to a very very tiny fraction of men who can't respect our space), and I acknowledge that unfortunately, other women have certainly encountered sexism, given today's political climate I would argue that people are even more supportive and enthusiastic about cheering us on (look at the female-only bootcamps that exist, or support groups for women) than ever before. I don't see people freaking out about the fact that men outnumber women in manual labor jobs, or that we need to get women interested in more dangerous jobs (because hey, most work-related deaths are dominated by men).\n\nI don't agree with a lot of modern feminist narratives nowadays. Women have more freedoms and opportunities now than ever (here in the West at least), to decide what they want to do with their lives. I actually think the most UNempowering thing we can do to ourselves is to say that we are victims of discrimination, and that we are being pushed out unwillingly, and therefore need special programs or diversity-hiring to \"even things out\". I think it's empowering to think hey, sure, maybe there are fewer women in CS but lots of them want to pursue biology, or psychology, or go into teaching or nursing because that's what they WANT to do. I have no problems with exposing young girls AND boys to CS, to try and foster interest. But the fact is, women are graduating at higher rates than men, and have all the freedom in the world to pursue what they want. \n\nPersonally, I would argue that opportunities are dependent much more on your socioeconomic standing rather than your gender. And absolutely nobody \"wins\" when we start trying to tally which gender has it worse, which is what I see a lot of in the younger generations.\n\nEdit/side note - I appreciate that you aren't just attacking the boys btw.",
            "Tbh I’m not surprised considering how big the gender  ratio between men and women. Hopefully we do better bois",
            "Everything you say here is 100% true. Don't get me wrong I dislike affirmative action, I don't think it's fair to anyone and I think that thread is a pretty good example of why. You shouldn't have to worry that you didn't deserve a job you earned and no one else should either, you got your position because you were the best candidate for the role. I also think it's masking a much bigger problem.\n\nI'm a firm believer that the reason we don't have more women and other minorities in tech is because of pipeline issues. Either people aren't being offered the same opportunities, or blockers are getting in the way. And 100% guys being sexist is some of those blockers. The number of times I've had to call out classmates for being sexist or creepy towards women is just unreal. Like bro, ask her out and if she says no fuck off ok? Don't whine about it, don't bitch her out, and don't fucking complain about women in your field. The last thing she needs is you making her life more difficult.\n\nSome of women not getting promotions is women being less assertive, some of women getting paid less is them not asking for raises, but I guarantee you that at least some of it is sexism too. And people saying it's not are either sexist themselves and lying, or are completely unaware of how common sexism really is. Discrimination in all of it's forms hurts all of us.",
            "[deleted]",
            "Thanks for posting this, cheers!",
            "Yeah. Also, just because a big company or top college has affirmative action, that does not mean that the person who got into that high level company/college is not smart, the company/college would not take a large population of unqualified people in.",
            "Thank you so much for putting this together. I think many people (usually men in CS) tend to not truly understand this side of the argument. \n\nThere is little to no empirical evidence that “reverse sexism” exists in CS. If it does exist, then it does not affect men getting a job in CS by any considerable amount.",
            "Sing it, sis!",
            "Good on you for posting this, definitely used to hear a bunch of dudes spouting some of that BS about how people only got x opportunity cause they were women when I was in university.",
            "Uhm just to add my two cents. Where I’m from businesses and studios frequently do male-only dev listings. It’s not legal, but no one bothers to do anything about it.",
            "I thought there were less women in CS because women and men are predisposed to have interests in different things, but it never occurred to me that it was because they are afraid to join a field where they will get sexually harassed. Thanks for pointing this out as I learned something new :)",
            "Wait, it dropped over the last 20?  Crap. That’s not good.",
            "Something I notice a lot when people are referencing fair hiring initiatives. People always says \"why don't they just hire the best person for the job?\" 1. The best person for a job might never make it to the top of the stack without diversity hiring initiatives due to HR biases. 2. Are you assuming the best person for the job cannot be the diverse hire? And 3. Companies aren't trying to hire 100% women, just *more* women. If you still can't make it in that's kind of on you, I guess you just weren't the best candidate for the job 🤷‍♀️",
            "👏👏👏👏",
            "Thank you so much for putting this post together. I have personally seen my fellow male classmates, whining about 'All the jobs are for women now' and honestly it doesn't just create a sense of bias but is also impacting young women in Tech who are made to feel like, 'They're not worth it or They didn't deserve it'. It's cruel. \nNow although im all about closing the discrimination and all the heinous things women have to face. But we all have to agree on one thing, that is There is no more, the segregation between men and women but a segregation between \"people who have access to resources and who doesn't\" If you think harder about what i just said, it rightly sums up discriminated women, sexually assaulted women, and also men. There are women who have enough resources to clear out interviews without quota and there are women who doesn't have resources for which these quotas should be working towards. This is where I guess the anger of populous is.",
            ">According to [this article](https://www.cio.com/article/3516012/women-in-tech-statistics-the-hard-truths-of-an-uphill-battle.html) the amount of women who get cs degrees has dropped from 27% of total cs degrees to 18% in over 20 years.\n\nAs we push towards equity, we minimize the environmental factor so that the genetic factor maximizes its expression. If women are genetically predisposed to find things less interesting than people, and the opposite for men, then that means that equity will push women away from cs. It is not by luck that before years (less equity) there were more women in cs than now (more equity). It is not by chance that there is a higher percentage (compared to the women in western nations) of women in cs is in an African underdeveloped country (almost zero equity). It is not by chance that equity has increased the differences between man and women in Sweden. If you ever find a country in which there are more women in cs than men, then that means that women are miserable, and are there because they had no other choice.\n\nI suggest you to take look at [this interview](https://www.youtube.com/watch?v=aMcjxSThD54) (29M views by the way) if you are more interested in the equity means wider gap between women an man choices.\n\nIt will also answer to you why this:\n\n>[Here](https://www.isemag.com/2020/10/telecom-the-latest-stats-on-women-in-tech/) we can see that that the rate of women seen in higher level positions decreases as well.\n\nis happening.\n\nIn a nutshell some of the statistic you provide, under proper analysis of the problem, show exactly the opposite of what you are trying to frame. They show push towards everyone having more free choice than before, which leads to differences in women and man being increased.\n\nAnd yes oppression due to gender , skin color, or whatever else, exists. But the real question is how much of a role it plays on the multivariate problem you have posed?\n\n&#x200B;\n\n>URM\n\nwhat is this?",
            "Cool, now do nursing. Are men being discriminated in nursing because there are more women in that industry? Or is that NoT thE samE ThIng?",
            "[https://www.reddit.com/r/csMajors/comments/mg4t9z/stop\\_asian\\_hate\\_and\\_stop\\_sexism/](https://www.reddit.com/r/csMajors/comments/mg4t9z/stop_asian_hate_and_stop_sexism/)\n\n&#x200B;\n\nI am wondering as well",
            "Comlpletely wrong conclusion. These issues aren't mutually exclusive. Women shouldn't be disadvantaged because they are women, I agree. But conversely,  they shouldn't be favored because they are women. We're not playing tug of war here. The solution is to remove the bias, not counter-weight it.\n\n>Yes positive discrimination for women exists. Context is required. To paint it as just 'sexism' without ever addressing the amount and level of misogyny women face is wrong. To act like it severely hinders the ability of men to get jobs in this field is also just blatantly wrong.\n\nIt helps women precisely as much as it hurts men. It cant be any other way.",
            "The harrassment situation for women in tech is not surprising. If you are a male, and most of your team is male except for one female and you interact with them often it would not be a surprise if a woman gets unwanted attention. Especially CS males, who have a tendency to misunderstand social queues, and when you find a woman with similar career interests and intelligence, a man may develop feelings for their female coworkers. It is unfortunate to here that women are getting all this unwanted attention, maybe being a part of a women in tech support group may help. \n\nMost relationships start in the workplace so at the same time it is difficult to simply let go anybody just because they gave someone unwanted attention. As far as women in leadership roles go, thats a biology thing. If you hand 1000 random pairs of men and women, most of the time the man will be stronger and will sound more certain about choices, and women in return like being around strong men. No I am not saying women make bad leaders. But when you are in a field that is mostly men, and men have that biological advantage of strength and confidence with their words it would make sense if 90-95% of tech leaders are men. \n\nPlus who wants to work those longer hours and will speak out about those promotions. Men do, and women choose to have a much better WLB. This usually happens when a person is in their early thirties. Prior to their thirties, you can look up the data and see women do just as great in their careers as men do, but once those thirties hit, women are stopped by that biological clock. If a woman wants a family they will make one and work less to be at home more and thus hinders their career. Where as men choose to work more and be seen as providers to no longer just take care of themselves but their partners and children. Career driven women who dont want kids usually do much better in their careers then the average man or a woman who has kids. \n\nIf you ask me, you should question why men are willing to shorten their lifespan and WLB for a couple of extra bucks when they hit their 30s. Wereas women made a smart choice of a not intense career with plenty of time to have a family or hobbies.",
            ">positive discrimination\n\nThis is an oxymoron",
            "Just to point out, alot of people drop out of CS as it's a difficult degree. Do you have any evidence women do it for other reasons (ie harassment)? Would be good to compare to other STEM subjects that get drop outs",
            "SIMP ALERT 🚨🚨",
            "It's not about the fact that men are so much better at computer science that they can still succede DESPITE being oppressed. It's the fact that the evil liberals hate me so much they are willing to impose quotas to try to keep me down. Cs is just an interest for me, but certainly would never hire any woman or minority if i was in a hiring position as they are the privileged class and have spent my entire lifetime trying to oppress and humiliate white men in this way.\n\nIt doesn't matter that you are too incompetent to oppress me, the fact that you try is enough to warrant retribution."
        ]
    },
    {
        "post_id": "1boeng6",
        "author": "shiiiinn",
        "title": "god i wish 😫",
        "url": "https://i.redd.it/vaxcgkakypqc1.jpeg",
        "score": 1059,
        "num_comments": 22,
        "created_utc": 1711476607.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1boeng6/god_i_wish/",
        "comments": [
            "The good ending",
            "I’m dropping out and returning to monkey",
            "evolution is the root of all evil, let's devolve back",
            "I wish :((",
            "I wish it could happen tomorrow morning... Good night guys",
            "Why tf did my ancestors decide to evolve? 😭",
            "So you’re telling me I NOW have the chance to be the next Google correct?",
            "I’m still waiting to wake up.",
            "Inb4 you trip on a rock, get a huge gash, then promptly die of an infection cuz no modern medicine.",
            "Let the hijinks commence.",
            "It can be like that... You can go do that.",
            "reject humanity",
            "I mean tbh, who says u can’t do that lol"
        ]
    },
    {
        "post_id": "19ei1ps",
        "author": "Mediocre_Cucumber173",
        "title": "Took around 1000, applications to finally land my first software engineering job, then the offer was taken away…",
        "url": "https://www.reddit.com/r/csMajors/comments/19ei1ps/took_around_1000_applications_to_finally_land_my/",
        "score": 1049,
        "num_comments": 176,
        "created_utc": 1706105701.0,
        "selftext": "I guess I’m just writing this to cope, but my god I do not want to apply to more jobs. \n\nI interviewed and landed the job at a large defense contractor, and they rescinded my offer because my security clearance was apparently taking too long, (even though they said multiple times that they would wait for the full clearance to process) \n\nDon’t stop applying until y’all are getting paid, wish I knew that sooner.",
        "permalink": "/r/csMajors/comments/19ei1ps/took_around_1000_applications_to_finally_land_my/",
        "comments": [
            "[deleted]",
            "Damn thats bullshit dude",
            "That especially blows because it seems that clearances are taking a lot longer than usual right now for some reason. A few new members of my team have been waiting for months, only a handful have interim clearances but, fortunately, my employer does not \"require\" clearance. Best of luck out there, you got one offer you can definitely get another. Lockheed is a pretty good company so don't be discouraged.",
            "Oh thats sad man, Anyway keep applying and dont give up!",
            "Is that even legal? Do you have that in writing? That's so unbelievably shitty.",
            "Sorry to hear brother. Keep trying.",
            "My place it took me 8 months to get a clearance. I feel fortunate I was able to still develop without it now.",
            "How long is “taking too long”? \n\nDid you give them a reason to worry?",
            "Dang i wish you best of luck :/",
            "I love how the general vibe is, sucks, just apply harder bro. It is the literal equivalent to, bro you're not here yet but you're on waiting for the bus to arrive, just wait faster bro.",
            "Normally I don’t say give up but give up",
            "Exactly why I switched from CS to nursing lol.",
            "lol had the same thing happen to me, but ended up with a job im very happy with. good luck OP. never ended up getting that clearance, lol.",
            "Does your job start soon or something? Typically they hire for summer positions so you have 6 months or so to get cleared.",
            "You guys won't get a job. I am an Indian and I am competing with so many other Indians for a single job. You guys don't even stand a chance, I'm telling you. I'm also fed up with this. Stop immigration otherwise soon y'all will be fighting for food.",
            "Are you Asian? The same thing happened to a friend's child last year, even though he was born and raised in US.",
            "truck afterthought thumb intelligent lush punch beneficial noxious reminiscent enjoy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "[deleted]",
            "Why are companies just allowed to do this. No security or anything, god",
            "Lockheed Martin responded to you?\n\nBut I'm sorry to hear that man, that sucks fr",
            "I have been applying to jobs that require security clearance. Can I apply for SC now before actually getting an interview or job?",
            "They rescinded after you signed the offer??",
            "Damn, I'm at 1050 apps sent so far 🙃🙃",
            "Well, at least you won't be helping kill people for a living.",
            "its a blessing in disguise, working at lockheed martin immediately locks you out of heaven",
            "u can do better than lockheed martin, they build weapons that kill ppl",
            "Did you have any significant red flags on your SF-86?",
            "That's so shitty of them to rescind your application, sorry to hear about that. I currently work at LM too but I just wanna throw out that they had a virtual chat with executive VPs about the company in the last few days and they mentioned that there were layoffs happening in LM Space, so you honestly may have gotten unlucky and your program may have lost funding.",
            "Full support to you man. Hope you find one soon.",
            "I would only count final round interviews, who cares that you sent 1000 emails..\n\nSend 2000.. how many final round interviews did you have?",
            "Sounds like they did you a favor. Now you won’t have to wrestle with your conscience about the inhumane things you would be helping those murderers do. You’ll find something better, just give it time.",
            "Bruh I'm sorry to hear that. I'm a May 2023 grad and have applied to 20+ Lockheed roles, and got rejected from most of them and ghosted for the rest. How did you get an interview there? \n\nJob searching is so frustrating as a 23 grad.",
            "😂😂🤣🤣",
            "[deleted]",
            "If I may suggest, target  your resume and cover letter to the specific job you're applying for.  Lots of these are scanned into a system where software sifts through them to find applicable applicants, and weeds out those that it feels do not apply.  This is before a human sets eyes on your resume.\n\nYou may need to get your foot in the door by accepting a junior level job within that arena, then work your way up the ranks.\n\nLastly, be open to learning something new, or, more importantly, different ways of accomplishing a goal.  I've seen a lot of programmers in my time laid off because they've reached the top end of their potential, and the employer wants a new perspective on accomplishing the goal.",
            "I am just glad that Lockheed never picked me for an interview because I would have been in the same show. Now I am with Intuitive Surgical and I am just grateful for what was leading to this reality.",
            "What was your salary at LM?",
            "What’s your major if you don’t mind me asking",
            "Keep your head up, we will make it out of this🙌🏽",
            "That sucks sooo bad, do you have any idea what could’ve caused the delay?",
            "Quick question, I'm unfamiliar with how to get security clearance? Does the company need to get it themselves to supply to you or do you as the applier need to obtain it from the government?",
            "I legitimately thought this was r/twosentencehorror",
            "Fuck Lockheed Martin dude",
            "wait how do security clearances work at lockheed? i signed an offer from them too and i thought they handled all that stuff?",
            "is security clearance the same thing as a background check? is it just for full time jobs or internships as well? sorry to hear this is happening to you, OP, but I hope things start looking up for you again soon!",
            "where are you applying to get those kind of application numbers? What job boards do you find actually have a non zero chance of getting back to you?",
            "Hey,  \n\n\nI created a video on this post: [https://youtu.be/SjizAr5Q9fQ](https://youtu.be/SjizAr5Q9fQ)  \nPlease check out this video and let me know your views on it.\n\n&#x200B;\n\nThanks",
            "So our of curiosity... are you looking to be a SWE right out of college? Have you considered something parallel to get your foot in the door like devops, sys admin, help desk...\n\n\nI worked at geek squad after I graduated. Took a while, but eventually made it."
        ]
    },
    {
        "post_id": "12gfapx",
        "author": "overoveroversize",
        "title": "Winter 2042 internships",
        "url": "https://www.reddit.com/r/csMajors/comments/12gfapx/winter_2042_internships/",
        "score": 1051,
        "num_comments": 27,
        "created_utc": 1681035119.0,
        "selftext": "Hey fellow newborns, are you ready for the winter internship season? I've been practicing my quantum computing skills on Qiskit and I can now solve NP-hard problems in 3 min, but I feel like that's not enough.\n\n&#x200B;\n\nI'm aiming for the top companies in the multiverse, like ZAANG (Zuckerberg-Amazon-Apple-Netflix-Google) and MUSK (Microsoft-Uber-Spotify-Khan Academy). I hope to get at least 10 offers before I start kindergarten. Anyone else feeling the pressure?",
        "permalink": "/r/csMajors/comments/12gfapx/winter_2042_internships/",
        "comments": [
            "[deleted]",
            "Too late. Your parents should’ve modified your dna such that you are born with computing skills. At this point your best bet is to quit and become an artist",
            "ZAANG and MUSK companies died out over a decade ago. Wasn't your mother feeding you the latest news from the multiverse via your artificial umbilical cord? Get out of this sub, you uninformed heathen.",
            "2042.. hmm.. too late we have filled this position",
            "Before opening the post I thought you had a typo for 2024, 10/10 shit post",
            "Battlefield 2042",
            "sorry i heard they are outsourcing to pre conceived sperm. maybe try post modern art?",
            "Just checked LinkedIn and all the 2042 applications are filled or have over 2000000 applicants, better luck next cycle :/",
            "Hey my suggestion is you better your projects. Try developing the GPT-5 API (make sure it's 10x more accurate than GPT-4). Companies might find this a little too cliché so you might want to try to make sure that it's scalable too. Test your applications on Mars and Jupiter to ensure its reliable accross the universe first.  These are minimum project requirements to pass resume screening for an internship 😁. Atb!!",
            "Those rich kids have such an advantage in their quantum chronostasis pods that allow them to study in their sleep and be fully rested. Honestly rigged from the start to have an extra 8 hours to practice coding with their mindchips",
            "Lmao, internships will be requiring 80 years of work experience in technologies that'll be released in 2062 by then.",
            "In 2042 all such jobs would be done by AI",
            "i thought 2042 was a typo💀💀",
            "Yeah, my boss and mentor (ChatGPT-15) told me that you have to sign a 100-year employment contract to get anywhere in this field.",
            "gotta look more into qiskit",
            "r/cscareerjerk",
            "Too late, now your best bet is to become an app developer",
            "How about an unpaid internship for 80 hour work week and 2 hour commute? Gas not paid for.",
            "Qiskit?\n\nBro the world is at Q#, stop ruining your chances.",
            "You mean you didn't have genetic enhancements prior to your ivey league education at Khan Academy? \n\n\nGood luck bud, you'll probably be writing classical machine learning algorithms for McDonalds drive thru window",
            "Too late. Your—"
        ]
    },
    {
        "post_id": "jjrf9u",
        "author": "Infamous_Metal",
        "title": "I declined a 90k offer only to accept a 65k offer after a 10 month grind!!",
        "url": "https://www.reddit.com/r/csMajors/comments/jjrf9u/i_declined_a_90k_offer_only_to_accept_a_65k_offer/",
        "score": 1036,
        "num_comments": 115,
        "created_utc": 1603903791.0,
        "selftext": "I am a new grad and declined a 90k return offer  in a LCOL city from a respectable company where I was intern-ing, I wasn’t a big fan of the company and back then I was (over)confident that I could land a better position but after 10 month grind my soul is crushed and I ended up accepting a 65k position last week. I find some respite in thinking that it’s because of COVID but the reality is I was not good enough or prepared enough for technical interviews to decline a 90K offer in LCOL. When I was declining the offer the manager literally told me “you are up to learn some lessons son”. He was right.",
        "permalink": "/r/csMajors/comments/jjrf9u/i_declined_a_90k_offer_only_to_accept_a_65k_offer/",
        "comments": [
            "Bro...",
            "Dam that guy u rejected sippin a nice tall glass uv \"I told yo ass\"",
            "oh wow, that's sad but congrats on getting the offer.  Did you at least have some interviews lined up when you rejected the return offer?  You must really did not like the 90k company.",
            "That sucks, but now you know this is something you never do. Always accept your best offer, and if you wanna still grind for more simply just renege. Which is why this advice is touted in this sub all the time to avoid situations like yours.\n\nEither way a 65k job will put a roof over your head and food on the table which is important in these times.",
            "Hindsight's always 2020. If you got a FAANG position, you'd probably make a post talking shit about the manager. It's just the way it is man.",
            "Thank you for your honesty on this sub",
            "I’m sorry OP but you realistically should’ve accepted it and then started applying for new jobs in hopes you got a better offer. You could’ve even used your 90k job as a leverage for a better salary. Rule #1 : Don’t quit unless you have another job lined up!  \n\nOut of curiosity, why were you so confident? Do you have good projects, or are you good at leetcode? \n\nI know this may sound embarrassing, but if I were in your shoes I would be humble and ask, (maybe beg) for that offer back.",
            "Wow, that's really unfortunate man. You'll be able to get back there though, just be sure to work hard and be a sponge. It is what it is, so best to look to the future now and not regret the past. \n\nI hope some people read this and take it as a lesson though. You have many here in the sub who go to great schools, have connections within family and friends, or otherwise simply have opportunities that your average student won't have access to. The success of these individuals may push us average guys into the mindset that anything less than a really high salary at a prestigious company is a failure and that we should aim for more. \n\nHard work is the bare minimum and there's plenty who put in the work. It's the opportunities you have access to that determine the return on investment. If it's looking like you lack the luck (which you need to make sure you're 'creating your own luck' or at least preparing yourself to take advantage of any that comes your way), the privilege, or both, then be realistic and know you can always work your way up to that point.",
            "Wow. This is the best post I've seen in a while. This was a very humbling experience for me honestly. I'm going to be grateful for whatever offer I get. Potentially being unemployed for months by declining an offer because I don't want to renege just doesn't make sense. Even if I took the offer, I could always leave after a year and avoid a situation like this.  \n\nThis post is making me reconsider my reluctance to renege. Thanks for sharing this as I think it's important for us not to get too ahead of ourselves. I know that after interning at a big tech company, you sometimes \"start feeling you're the shit\". Although, once you realize your leetcode skills are \"shit\", reality kicks in and that nice offer in a LCOL area in a small company sounds like a dream. The grass isn't always greener and there's a significant gamble to declining an offer and hoping it works out later.",
            "Dude same. I declined a 77k offer cause it was my first ever offer and didn't know my exact value. Ended up accepting a 62k offer. Ffs",
            "People on this sub constantly talking about how 100k is nothing etc yet as a new grad I'd happily take a 45k CAD job at this point lmao.",
            "Sorry to hear that \nIt's ok , be brave and move-on",
            "[deleted]",
            "Hope you learned your lesson dude. Rather renege later than that but better than nothing",
            "If you didnt like the company that offered you 90k in the beginning then you wouldve probably started a thread here complaining about the job at some point, some things just arent meant to be.",
            "What area are you in btw, Toronto?",
            "Lmao SADKEK",
            "That is a PHAT oof. I guess just move on and learn from it.",
            "It sucks, but I can tell you from experience, that if the 65K position is at a company that will treat you better, and you weren't happy at the first job, it's okay. Plus, you're JUST starting your career. In no time you'll catch back up.\n\nLead Software Engineer with 10 years exp.",
            "Hindsight is 20/20",
            "Always better to accept the 90k offer, shop around for a better offer and then reject the 90k once you’ve accepted a better offer. But hey hindsight is 20/20",
            "Never decline an offer if you don't have others. You can always switch once you have more offers.",
            "Getcha couple years of experience and you'll be in the 90k range in no time.",
            "Not quite enough information to know for certain but I suspect you did the right thing.  \n$30k is peanuts in the long-haul and doesn't matter at the stage of life you are at.  \nThe critically vital thing you need to show on your resume over the next couple of years is ever increasing responsibilities and capabilities and that is **virtually impossible** to do at a large company because they pigeon-hole everyone into the smallest cog of work possible.  \nEvery year you work at a large company when you are young is year of life lost.  \n  \nThat said, not every small or medium sized company is all that great.",
            "L",
            "New grads thinking they’re worth a fortune until the market humbles you. Just learn and move on.",
            "Dw, I’m in a similar position as well. You have your whole life ahead of you to make a high figure salary, don’t be caught up with what could have been, focus on what you have now and you will succeed",
            "Rekt.",
            "...",
            "If it makes you feel any better. I’ve been coding since age 12, built few startups, help people learn to code with my newsletter https://thedailycoding.com). I’ve been ghosted by almost all major big companies despite completing their OAs. \n\nI had to settle with a 70k salary. Trust me when I say this, The market is really a mess right now. \n\nWait for few months and you will see offers pouring in.",
            "at the end of the day, youre worth 90k,thats all you need to know. \nKeep finding more jobs, keep the 65k job till you get a better paying ones. \nRandom people on reddit dont pay your bills, you do!",
            "Hey there! I'm gonna preface that I used to be an eng manager but recently stepped away back to eng (less meetings, more fun). I would say don't worry about it, keep learning every day and if you have a specific goal in mind, you can definitely reach it!\n\nAs far as your manager, I think what he said is a bit uncalled for. I only have experience working in Silicon Valley and Seattle, so maybe the culture is different here because you need to retain good relationships with former coworkers (people move jobs often).Personally, if someone told me that, I would be less inclined to refer or connect with them if they end up looking for a job at my company.",
            "Hope you learned your lesson dude. Rather renege later than that but better than nothing",
            "Sheessssshhhh. Thats tough.",
            "Hope you learned your lesson dude. Rather renege later than that but better than nothing",
            "Learn alot in your new company, and just keep leetcodeing and prepping for future interviews, then jump ship.",
            "The universe conspires to help you. You will get plenty of offers in the coming years and this decision will be nothing but a distant memory. A couple years back I declined to to join Rivian in favor of rejoining a company I had once worked for (shit company). Recently, I declined several high salary offers because I didn't want to deal with the workload. I told these folks I accepted a position at a different company, and now I work for a company where I am passionate about the product, team, and organization as a whole.",
            "Did you negotiate or just straight up decline?",
            "[deleted]",
            "Hope you learned your lesson dude. Rather renege later than that but better than nothing",
            "Well now you know.... Lol",
            "That's alright. You took that risk. It could've went either way. Really though, no company will ever pay your true value, no matter how skilled you are.",
            "Bruh...",
            "Ahh shit happens..\n\nNever know, might end up better this way.",
            "Dw man you'll get over it.\nJust wondering, what did you not like about the 90k company ?",
            "How good of an offer is 65k generally, though, where you live?\nAlso, what's LCOL?",
            "You should have accepted offer and kept applying",
            "It’s your first job, don’t sweat it or dwell. Move on, keep learning and try to be happy. It could be worse, so keep your head up and don’t doubt yourself. The market isn’t right ESPECIALLY for new grads. You’ll get that job you want after this is all over and have some experience.",
            "Dumbass",
            "F",
            "This was submitted to another subreddit correct? 🤔",
            "It sounds like you didn’t like the company and no money is going to make you happy there. I had a job that paid well, but I didn’t enjoy the product. I was unhappy and told myself to never apply to a job I wouldn’t enjoy. \n\nCOVID definitely made an impact on the job market. You are not alone there. Enjoy the 65k salary job and continue building the skills needed for the dream job you want. At least it’s less stress on your mind. You also have a team to work together. Impress the heck out of them and keep learning. Congratulations on the job and best of luck on your future endeavors 🚀",
            "Don’t worry, some recruiter said me something similar, i do not regret my choice.\n\nIt’s much better to learn in a company you appreciate than in the one you don’t like. Money after a certain amount does not mean anything.",
            "Lol here I would accept in a heartbeat",
            "technically lost a lot more than $25k. good job! way to be greedy. you must ve been smoking something",
            "I'd rather make 65k and enjoy my job rather than make 90k at a place that didn't make me happy. \nYou can always earn more money later. You'll never get more time.",
            "I wouldn’t pay a new grad 90k outside of the valley. I don’t turn down a job until I have signed the agreement on the next higher paying job.",
            "Keep learning, keep practicing and apply to a better job later. It's not the end of the world. The average tenure is 3-6 years in IT positions. For entry level jobs nobody is going to freakout if you find another job in 12 months. But use the time wisely and learn more along the way.\n\nABL - Always Be Learning\n\nThat is the most important thing to known in this field. If you aren't always learning, you are a technology evolution away from being unemployable.",
            "90k offer to a new grad is baller, hard earned lesson there my friend, sorry",
            "If OP more happy with 65k then stay with it. No problem, there are still a lot of opportunities around. I don't get why some ppl in this sub give the vibe \"You shouldn't have done it!! Or you should do this and that..\" Life is full of the unexpected things, at least OP has learned what he could be doing then next time he may find a similar or better offer and the job is fit in with what he wants. Cheers.",
            "Did you try reaching out to the original offer people and — with some humility — ask for the 90k job offer?\n\nI would probably still hire you if you owned up to learning your lesson.",
            "Grind it out for a year or a few if you like it and upgrade. I made an embarrassingly small amount for my first job (2 really) but am very happy with my compensation now. Most people get lowballed and will pay it forward.\n\nI guess this sub and taking courses/interviews more seriously helps there but you live and learn.",
            "Some mid level roles depending on company won’t even give you 90k.",
            "That's a hard learning experience, but if you learn the lesson now, hopefully it will pay dividends in the future.",
            "Dang",
            "."
        ]
    },
    {
        "post_id": "147fbwh",
        "author": "Kooky-Cut6196",
        "title": "Where is the light at the end of the tunnel.",
        "url": "https://www.reddit.com/r/csMajors/comments/147fbwh/where_is_the_light_at_the_end_of_the_tunnel/",
        "score": 1026,
        "num_comments": 365,
        "created_utc": 1686545778.0,
        "selftext": "I did everything I could. This past month I graduated uni with a 3.7. I held myself to a higher standard and took the most involved classes in CS, math and stats our program offered. I did cybersecurity research with one of my professors last semester, graded for data structures and algo, and did some peer tutoring on the side. I have my own website and a laundry list of meaningful projects in different languages all on github. I’ve done hackathons by myself, with a couple friends, with 16 year olds from Gibraltar who pronounce deque with three syllables. I’ve done about 300 leetcode questions but most of them were medium or hard, and that was after I switched from C to Python and had to start over. I let my resume undergo cycle after cycle of metamorphosis along with my very being. I even networked my introverted ass off at meaningless lunches if it meant a chance at an endorsement in HTML on LinkedIn. I can only truthfully say I gave it my everything because I know there isn’t an English word that means more than that.\n\nOver the past year I have applied to over 1100 different positions at over 500 different companies. FAANG, hedge funds, startups that make you do CTF, even the made up word salad job descriptions that keep escaping containment in South Carolina. Those numbers easily would’ve quadrupled if I let myself apply to jobs I was even remotely underqualified for. But I hold my head high, knowing I can succeed once I take my first step into the real world, and I cling onto my confidence and its cousin, naiveté.\n\nAll this time I’ve kept a color-coded spreadsheet with a list of companies, job titles, locations and apply dates. Red is an auto rejection, yellow means I got an OA. I’ve long forgotten what the other colors were going to be because I haven’t had to use any of them. The last two weeks of rejection emails have grinded my career to halt and my hopes down to a fine dust. The world seems to have decided I’m not fit to live the dream I’ve been working towards for the last five years and it’s tearing my mind and body apart. I’ve conditioned myself to have chronic migraines every time I wake up in preparation for the emails I’m about to read. I’ve lost so much weight from the stress that I can say good morning to each bone in my ribcage before stumbling over my computer desk. “Unfortunately”, “no close match”, “not retained”. I let the memory of what these words once meant to me guide my descent further into the abyss. “We regret”, “not the right fit”, “role has been closed”. If anyone was truly sorry for saying no, would they hide behind the facade of the same words of rejection time after time?\n\nHome has been hell on earth. My mother has become unbearable, constantly berating me for hibernating in my room as I scrounge the internet for any morsel of a job offer I haven’t yet discovered. When I finally heed her advice to join at the dinner table, she asks me which video games I’ve been playing all day and compares me to my psych major of an older brother until I crawl back into my real home to resume my fruitless search. My grandparents came out to visit this weekend and were absolutely livid that I was still at home without a job. My grandmother asked why I don’t just walk down to Best Buy and work on the computers there, threatening to bring me there on a leash. It would take more years off my life explaining to her what a software is than she has left on this dying earth, so I remain zen through their outrage as I let the anger caramelize into fortitude. But it was different when my father watched my struggle from the bedroom door without saying a word last night. When I turned around from my bloodstained spreadsheet and saw him, he didn’t need to say anything to shatter my existence into a thousand little splinters, the look on his face was painful enough to do that much alone. I’ve had some enemies over the years, but I wouldn’t wish upon any of them the profound sadness of watching your number one supporter lose faith in your efforts and turn their back to you without even saying goodbye.\n\nThe world has humbled me enough to ask if it even cares at this point. Was I wrong to keep trying after all this time? Would I have felt better had I given everything up earlier? Every day I think I’ve reached a new low the threat of tomorrow creeps under me like a quicksand. I’ve forgotten what it’s like to think I deserve the food on my plate or the air I breathe in. I would beg for someone to tell me everything’s okay, but I think it would be more comforting to know when it will all end. When the pain finally goes away, does it really vanish from your life, or do you just grow hardened enough to not feel it anymore?",
        "permalink": "/r/csMajors/comments/147fbwh/where_is_the_light_at_the_end_of_the_tunnel/",
        "comments": [
            "Bro has a way with ✨words✨",
            "Summary: op has aced every single thing during his degree: research, gpa, attending hackathons, etc etc. Op suffered through anything that helped him get a job. Op applied to a lot of jobs but got rejected at every single one. Op is feeling as if his home is hell and has been searching internet for any job that comes across meanwhile op's parents are not supportive. Op feels whatever he did was not worthwhile and doesn't know what to do.",
            "drop the resume",
            "(Top notch writing skills OP) \n\nThe job market is horrendous at the moment, and despite the harshness of some of these comments I really do think that dwelling in your rejections is not doing you any good. \n\nYou sound strong and determined, you did all you could during your years in uni but I think you've overestimated the value of a degree. I'm guessing your applying to jobs in the software engineering sector, a field that I understand is extremely competitive. \n\nYou're fresh out of uni. I get you think you're over qualified for some of the jobs you come across, but you need working experience or else no one is going to hire you. I get that there are several miracle stories of people \"making it\" straight out of graduation but that's extremely rare. \nWe've all got to shovel shit. Get an internship or a basic entry level job where you'll have hands on experience working with a team, and move on.  \n\nConfidence is a benefit but overconfidence won't get you anywhere. I'm sorry your expectations aren't being met, but that's life. I know the lack of parental support makes it all the more miserable, but hey, you've got us to vent to.\nTake the hits, get back up, fight back.",
            "Maybe try writing horror stories.\n\nOn a more serious note though, you aren't doing yourself any good by dwelling on your missed opportunities. You might have better luck freelancing for a while and building projects for local businesses so you can put that work experience on your resume. It also shows you're industrious. But if you're doing this you'll have to be really proactive because said businesses don't really know what they need.\n\nTLDR: If there are no opportunities, keep a positive mindset and create them for yourself.",
            "Drop CS and become an author bro, you got the writing talent",
            "Nothing is stopping you from working part-time while you search for a job. That’s what I’m doing.",
            "Bro dropped a romatic period novella on us and I like it\n\n\nGood luck man, youre not alone and will get there",
            "Im disgusted by the lack of empathy in this thread and the people with rotted attention spans who can’t even bother to skim the text. Honestly a good read OP can be a writer with the metaphors.\n\nAnyway - I’m sorry to hear what you’re going through. I hope writing things out at least made you feel a bit better and feel heard. I don’t know if any advice would be helpful at this point, since it seems like you did everything you were “supposed” to do.\n\nMaybe take a break. That sounds counterintuitive but your mental health is worth preserving - maintaining your mental and physical will help you continue the grind. Take care of your body more, eat some healthy stuff, touch grass.\n\nCommunicate with your parents about your struggles, it sounds like they don’t truly understand the magnitude of what you’re going through but you have plenty of evidence to show them that you are putting in the work, and their support and understanding would be appreciated. At least your house can be more of a home than just your room.\n\nLastly, other commenters have mentioned but I think it’s important - drop an anonymous resume for review. Did you have any internships at all? Did you make it through any face to face interviews (as in, how are your speaking and soft skills)?\n\nEdit: also, you are doing a great job, you’re not a failure, you worked very hard and it’s not your fault that things have yet worked out the way you’d imagined. Hold on to hopes of a better life, and trust the process, whatever the path may end up being.",
            "If your family situation is toxic, I would recommend getting a job (*any* job) that pays the bills and move out (possibly with roommates if you need to save on rent). Then continue networking/practicing etc. from there. Might do wonders for your mental health.\n\n\" I even networked my introverted ass off at meaningless lunches if it meant a chance at an endorsement in HTML on LinkedIn. \" -> what you need to network for is not endorsements in LinkedIn. You need to network for job referrals to the jobs you are applying for. That will significantly boost the probability of success.",
            "The Best Buy part of your post actually curdled my blood. The combination of \"give them a firm handshake\" baby boomer attitude and fundamentally misunderstanding what a CS major does is wrapped up in a perfect bow by telling you to get a job at Best Buy. \n\n&#x200B;\n\nI wish you the best of luck in your search and all I can suggest is that you need a major break from looking for a job. Take a week to relax, read a book, do something fun. As far as something more concrete, maybe reaching out to alumni from your college or emailing your school's career center would help. Godspeed.",
            "bro is poetic ✨",
            "[deleted]",
            "Post resume!!\n\nAlso hope you’re doing more then just applying everyday.",
            "You did everything and not a single summer intern or coop experience from past years when companies were hiring everyone and their dogs?",
            "I would say ur resume may be the #1 reason holding you back.\n\nI would get a temp job in literally anything to at least not be dependent on anyone else but damn man, reading through made me sad 😭.\n\nI had around a month couple years ago when I didn't have a job and parents were already pushing me to work whatever, not sure what I want with this but maybe parents are the same whenever you look, perhaps when u become one u will understand.\n\nI wish you get everything working for you and become very successful in your life.",
            "It's odd to see comments basically telling OP that they have no empathy or soft skills when you're literally some guy on the internet making judgements on someone's personality based off of a frustrated reddit post. Since when did expressing frustration come off as sociopathic? The lack of self-awareness in these posts is laughable.\n\nReal advice to OP: reflect on what industry interests you, attend an open convention where you can meet people, reach out to professors, and ask companies what projects they are currently working on and what you can do to help",
            "You have graduated 1 month ago. Relax dude it can take 6 months to find a job. Look at contracting position. Do some relaxing activities. Be patient. Millions have found jobs before you and so will you.",
            "If your parents are completely ignorant of your situation eventually you have to learn how to disregard their opinion and continue forwards with what you know is right. I know that they hold an important place in your heart, but you must be able to evaluate what they say on a separate level from that...and it seems none of their opinions are at all close in their prediction of your success.",
            "Sorry for what you are going through.                                                                                                  \n\n1) Try Revature, Cooks Systems, Ernst and Young and get a AWS certification like SAA (It will boost your resume.)                                                                                                                                   \n\n2) In the meantime, after that kind of preparation you had, you are more than ready, do not just stay at home preparing for the next interview. Your grand mother is right on this. Go get that job at Best Buy, Apple, Home depot in their IT or repair department. It will help you network inside of the company and see what they have for you there. The market is really bad now.                                                                                                                                                \n\n3) Another thing that I notice, you said you applied to 1100 jobs in 1 year ? That is low. Try to apply to 15 to 30 jobs per day. Use linkedIn easy application mode. It should not take you more than 10 min to do so.",
            "[deleted]",
            "rookie mistake focusing on grades instead of getting internship?",
            "You're in South Carolina? Look up the defense contractors around the Charleston area. Take a look at clearancejobs.com. Don't worry about not having a clearance, many companies will sponsor you.\n\nThere are jobs out there, they may not be what you're hoping for but they will give you a head start.",
            "Stop applying to FAANGs, Hedge Funds, and Start-ups.\n\nApply to smaller companies and see if the results change.",
            "There are a lot of similar comments so I’ll try to respond to everything here.\n\nI started applying in full force at the end of last summer (Palantir was first on 8/2, thank you spreadsheet!). I’m not sure where people read it had only been a month. It definitely wasn’t as many applications as I could’ve put out in a year but I thought I had a decent chance at something there. I also applied to internships last summer with depressingly similar results, although I had a lot less experience and knowledge back then so that much should’ve been expected.\n\nI’ve shared my resume with reddit before, but I got some conflicting advice with what my career center and professors had told me and mostly defaulted to their wisdom, especially since one professor connected me to a lot of people. I’m avoiding specifics so I don’t doxx myself, which is why I’d rather not share it again. More than that, I don’t think I have it in me to go through all the motions again.\n\nThank you to everyone who reached out with advice, referrals, and support. I responded to a couple people so far but I think I’m leaning towards taking a break from this vicious cycle to work on some other skills and touch some grass. A part time job may be in order to put some ramen on the table (no grandma, not fucking Best Buy).\n\nAlso, yes, I leetcoded in C when I started. That was a dark period in my life, and I would take my current predicament a thousand times over before going back there for a day.",
            "Get an IT job. Bridge that back into SE.",
            "try pivoting to creative nonfiction writing as a career !",
            "Stay strong buddy. I'm an International student and have been going through a similar phase. I'll have to start a MS to maintain my legal status even though I wanted to work and then get a MS. It's life. Keep options at your hand and your brain will thank you. Have you heard of Omdena? There are projects related to ML and Data Science. It's unpaid but I assure that you'll learn a lot in the process. Work on other skills such as Business, Marketing, Freelancing and writing. You have amazing writing skills. No work is small or big. You should also look for jobs in other states such as Nebraska, Kansas, Maine. Hopefully the market isn't bad for citizens compared to what it is for International students on F1 visa. \n\nAlways remember the purpose of life isn't to become a good software engineer or billionaire. Just try to be a good human who gave the best effort. You won't regret it. Life can be very mysterious but don't give up. There are a lot of people kn this world willing to sacrifice to live our life. Stay strong and hang in there, we are all here for you buddy. DM me if you want to share more.",
            "Hey man. I feel for you, I really do. That being said, life is a struggle and at many times it’s not fair. Don’t beat yourself up about it - keep grinding. Five years from now I am confident you will look back and see how temporary these feelings were.\n\nFind a job to pay the bills and get to the gym while you keep looking for your next career move. Also don’t neglect your social life, it’s important for overall wellbeing. You’ll feel better about yourself, be more healthy, and more confident. This will reflect in your upcoming interviews and life events.\n\nThese crazy stats will all mean nothing once you accept your first job offer - I recommend just forgetting about the stats. They don’t help you find a job.\n\nI have two degrees, soon to be three, and spent close to two years unemployed/making projects to keep myself busy. I was frustrated and felt like my dedication and work didn’t pay off. I’m now making mid-six figures in a job I truly enjoy. I couldn’t see this outcome back then, but it was there.\n\nHang in there!",
            "Yeah I feel you man. I don’t have any great advice other than keep applying, network lots, consider getting a part time job to shut your family up at the very least, and take care of yourself. Take advantage of being unemployed. Exercise, eat and sleep lots. It won’t help you find a job but it’s a shame to let your health slip because you can’t find a job. \n\nAlso fuck people being dismissive in this thread. Especially if you have a job. I’m going through the same thing right now and it sucks. New grads have a right to be frustrated at the fact that they all have been left by the wayside.",
            "1) fuck your family\n2) Drop the resume. Any prior internships/ec’s pre senior year ? Or just scrambling final year\n3) Get a temp job. Keep grinding",
            "It might sound mean.. but are you taking care of your appearance? Make sure you have a decent haircut, some well-fitting clothes, brush your teeth, shower and wear deodorant. I know it sounds strange but there are developers out there who look and smell horrible.\n\nAlso, instead of applying for jobs directly, I think it's better to work with an IT staffing company, especially for your first job. If you apply directly to a job the competition is just too much usually, they can get dozens if not hundreds of resumes. Another tip is to email companies directly, even if they don't say they're hiring, and ask if they have any intern positions or entry jobs.",
            "Couple things. \n\nIt’s tough man, it’s a bad time to be graduating. Many of us lived it much worse after the 08 recession. \n\nIt could get worse, maybe take an under qualified job. It’s pretty normal to take anything post graduation with the intent of learning on the job, getting a feel for the real world, getting your hands on software you might not normally have, etc.\n\nSimilarly there’s no shame in going and crushing a restaurant job for a month or two to just get some cash up, meet people, get out of the house, etc.  \n\nAs for your day to day. There’s no reason that applying to jobs should take you all day.  So your clearly gaming or wasting time when you could be living. \n\nCommit an hour to applying, then get your ass in the gym, or out on a run, anything to keep you’re body active and healthy. It’s more important than you think.",
            "I think you did great. You did everything you could and that could have easily got you a job in any other market.\n\nThe problem is your parents. Mental health is crucial at this time and your parents are not helping.\n\nMaybe distant yourself for a bit and keep applying and come back to them when you got an offer?\n\nAnd I feel you. I woke up receiving hundreds of turn downs in 3 months after lay off. There are consulting companies that will help new grads like you I recommend that.",
            "man, quit CS job searching and try to be a writer of love stories, chick flick scripts. You will be thriving!",
            "Nice bro. But I am not reading that",
            "fake, AI written or karma farm and self-mastubatory story lol, no in-betweens.\nSounds like a story of a unicorn that is abandoned",
            "I am telling you bro the light is there. The tunnel can be huge at times which might make us feel that there's no end. But it's there. Soon, you'll see a bright light. It'll keep growing you have to just keep your train moving.",
            "You should probably start some tech writing after you get a job. You have good writing skills",
            "You wrote this essay and didn’t respond to a single comment?",
            "Been in a similar boat and can help:\n1) Try reaching out to startups. Silicon Valley is filled with 10-100 person startups who would be happy to hire you with a lesser pay. After a few years, with the learnings and experience, you can get way better paying roles.\n2) Applying online usually runs your resume through an ATS system that pulls out keywords and filters -> hence the immediate reject. Run your resume through a few free available ATS and ensure it’s read properly as intended\n3) When applying for a role, ensure you add/remove relevant keywords and skills to your resume.\n4) Reach out to recruiters on LinkedIn, go to career fairs and try to find other ways to talk to recruiters than just applying online. Relying on applying online will only get you more depressed with the constant rejects\n5) It’s a tough market right now but things will change. Take some time and take it easy.\n6) Ensure you learn new things everyday than just leetcode and may be do a pet project or two. \n\nThe system is not ideal but once you get that one breakthrough, your engineering journey will begin! All the very best.\n\nEdit: Location is also a factor some companies look for. Either say open for relocation or change location to California",
            "I know this was serious, but you should be an author. This was beautifully written",
            "I have been applying for the last 7 months to more than 600 positions but didn't get a single interview call. I have also completed my B.Tech (4 years) and Masters (2 years) in CS major. I can totally relate what you're saying. My self-motivation is to keep going, no matter what happens. There's no person that knows stuff and doesn't have a job. We'll get it eventually. Also, this recession kind of thing is going on so the situation is hard.",
            "You just become hard enough.\nI had kind of similar experience but now I am trying to do it all for fun. \nI stopped tracking my applications a long back tbh XD",
            "too much writing bro",
            "I mean dude, the job market is extremely tight right now. This market is like 08 but uncertainty mixed in. There’s jobs being made but not in CS, they’re being made in anything other than CS. I’d just ride it out and continue trying to get a Masters Degree while the economy is in a better place which will be by mid 2024. I’m currently getting my BA at 25 and have shit grades and whatnot but I know I can fix them, but I do acknowledge that I need to start projects and doing other courses outside of school. There’s really nothing you can do because even in my job now where I’m PT, I used to work almost 40 hours a week and now we’re only limited to 20. That caused my paycheck to be from 1100 to go down to 750 BI weekly, and that’s after taxes and 401k etc. What I would do is seek a job in Finance for now, ride it out hone your skills and when the opportunities come again take them.",
            "I don't want to critique your stylistic choices in writing this post; I'll leave that to the wittier among us.  However, I do want to address your mental health.  You can't necessarily control how others will react to your \"situation\", but you do have some level of control over how you deal with it.  Holding your head high, with a stiff upper lip is all well and good, but you really need to remove yourself at least a little from the routine that grinds you down.  Go outside with friends on a cheap camping trip or a hike.  Do something that helps clear your mind and takes your focus away from things that you cannot control.  For the sake of your mental health, get help.  Look up some resources that will give you a sympathetic ear (not Reddit; definitely not this place since it seems to be filled with FAANG prodigies who do biting creative writing as a side hustle...).  Doing this may not shorten your suffering, but it will probably help you in dealing with it in a healthier way.  Please...I've read too many stories of people losing hope in this grinding economic hellscape.",
            "This sounds very tough and I'm sorry the people around you are not more supportive. I've been where you are and it sucks. \n\nIt sounds like there's something not working with your resume/CV and/or interviewing skills. While getting a job a Best Buy would suck, almost anything to get out out of that house and interacting with more positive people would help, imo. \n\nConsider that tech has taken a beating over the last 12 months. Most large tech companies have done layoffs. That means experienced people are out there looking for work making it more competitive. \n\nWhat kind of jobs are you applying for? I assume you want to write code for a living. Maybe you can't get there immediately. Consider applying for analyst jobs or indicator/business intelligence jobs. These won't use all your skill, but will use some of them and can be a stepping stone. Consider QA/testing/validation as well. If will get your foot in the door. \n\nLastly, consider find a place that needs CS/programming help from volunteers. It would suck not getting paid, but getting some professional experience will help with your resume and your interviewing skills. I'm sure you're thinking \"I worked too hard in school to have to work for free.\" I agree, and you did. But we are where we are, and we need to find the best opportunities we can to build our future. I can assure you thinks will get better in the future. You'll have more bump in the road ahead of you, but also some great experiences. You just need to get over or around this obstacle. \n\nI'm so sorry you're being treated so badly. Please find a way to keep your chin up.",
            "Feel this in my bones",
            "reach out to me if you need some mentorship.    \nIn general, be patient.  Tech is a bloodbath right now in the US.  Even in the best of times, finding a position is a numbers game and can take much longer than anyone would hope.  The only shit you got to do is apply to positions consistently.   I can help you with your resume and how to target positions if you want.",
            "One month after graduation?! Are you trolling? Give it some time dude, EXPERIENCED professionals complain like that after being on the job hunt for months.",
            "Damn. The job search turned this dude into a novelist.",
            "The vast majority of Americans get parental support well into adulthood. What you are doing is completely normal. You parents are naive and shallow people who sold you into a system that is full of false promises and that they don't understand themselves. You objectively more valuable than than 99% of people your age and probably 99% of college graduates. Your portfolio is better than the majority of CS graduates.   \n\n\nTaking a month, or a year, after graduation to find a job is completely normal. If your parents have expectations that are not realistic with the market they can go fuck themselves. Your worth is not how much money you make or a job this immediate moment, it's what you do today to be the best person you can be and I think you are doing fine.",
            "I'm really sorry to hear that you're going through such a challenging and disheartening time. It sounds like you've put in an immense amount of effort and dedication into your studies and job search. Receiving rejection after rejection can be incredibly discouraging, but it's important to remember that setbacks are a part of life, especially when it comes to job hunting.\n\nIt's understandable to feel overwhelmed and question the path you've taken. However, it's important to keep in mind that your worth and potential aren't determined solely by the job offers you receive. Success takes time, and the process can be unpredictable. Many successful individuals have faced rejection before finding their desired opportunities.\n\nDuring this difficult period, it may be helpful to seek support from friends, family, or mentors who can provide encouragement and guidance. It could also be beneficial to reach out to career services at your university or consider networking with professionals in your field who can offer advice or potential leads.\n\nRemember to take care of yourself both mentally and physically. Self-care, such as maintaining a balanced lifestyle, engaging in activities you enjoy, and seeking emotional support, can help you navigate this challenging phase.\n\nKeep believing in your abilities and stay persistent. The light at the end of the tunnel may not be visible right now, but it doesn't mean it's not there. You have already accomplished a great deal, and with time, determination, and a bit of luck, you will find the opportunity you deserve.",
            "this is amazing writing",
            "what is bro yappin about",
            "Well written! Hang in there. Pain has a way of bringing out the best in people; just never give up on yourself, the way your dad might have (although I bet he's just ignorantly trying to light a fire under your rear-end). Best of luck. Use those writing skills to script this experience into an empowering testament to your preserverence.",
            "You seem like you use writing as an outlet. Keep at it. Also get W’s in your life. Stay active and exercise so at the very least you will have your health. As for CS, just keep at it. It sucks, but if you’re in hell, you gotta keep on to get out of it.",
            "The one thing I learned during my undergraduate is that an internship can be the most valuable variable to you finding a job after college.  \n\nEven if you’re in your first year, landing an internship is huge. The more the merrier.",
            "Hey op. I'm really sorry to hear about what you're going through man. The problem with constant repetition like what you described, is it puts your mind in an unchanging feedback cycle that, without you even knowing, can act as a self fulfilling prophecy. Taking a break, maybe working a simple job just to have some income while you mull things over, and allowing yourself to breathe a little will allow you too see angles of this situation that you didn't think to before. It'll broaden our perspective and allow you to attach it again in different ways. Whatever you do, don't punish yourself. You're doing everything right, the world is just shit.",
            "[deleted]",
            "Writing so good, I went and read it twice. Maybe write some comics. Use your tech skill to make interactive comics.\n\nTry working as an intern or start small. If you have the skill, you'll get noticed and move up sooner than you realize.",
            "this is kind of fake and you clearly dropped it to get a reaction from people. props to your writing which will maybe not go underappreciated and forgotten. still, man do I wish this process could be more clear. unfortunately, it seems that even in this situation there is a lot more you could be doing, if you had better observation and awareness. at least to me, the answer is that you grow hardened enough to the pain that you no longer feel it.",
            "startups that make you do CTF - Ramp isn't a regular \"startup\"",
            "Fuck ur good at writing dude. That’s a skill that almost nobody has. Idk what to do with that information but just know it’s true",
            "DM me and we can chat job stuff.",
            "You should write a book, you have a way with words and are able to make us feel your emotions through pixels on a screen, which is a rare gift.",
            "In all those words, I failed to see the word \"internship\"",
            "Round of applause, this was a true masterpiece. That’s hella of a talent you got there. Keep your head high we all down bad, but a wise man once said tough times never last - only tough people last. God speed as you continue your journey warrior 🤝",
            "Dude....you can WRITE. Like omfg I would love to read this in a well published book. Sorry though. I hope you find something soon",
            "You should consider writing a blog OP, love your writing style! I would reach out to hire if we were hiring, lots of hiring freezes still in effect. Hang in there.",
            "I feel you, 80% of jobs come from connections. Please follow this guide https://www.linkedin.com/pulse/how-reach-out-recruiters-linkedin-message-examples-lee/ I have landed almost all my meagerly numbered interviews from messaging randos",
            "Have you ever thought about using LinkedIn?",
            "i ain’t reading all that\ni’m happy for u tho\nor sorry that happened",
            "The definition of insanity is doing the same thing over and over and expecting different results.\n\nThe first thing I'd say is for you to get a part time job there's basically no excuses for that. The second thing I'd advice is to get contact with your alumni services and try get your CV checked or have a meeting with a careers advisor.\n\nSorry but as much as I do sympathise with you, clearly you are doing something wrong if you are going 1000+ applications and getting nothing. So you need to re-evaluate this and make sure that you make some actual changes.",
            "Chat is this real",
            "Get a master’s in cs and get an internship",
            "Stay strong buddy. I'm an International student and have been going through a similar phase. I'll have to start a MS to maintain my legal status even though I wanted to work and then get a MS. It's life. Keep options at your hand and your brain will thank you. Have you heard of Omdena? There are projects related to ML and Data Science. It's unpaid but I assure that you'll learn a lot in the process. Work on other skills such as Business, Marketing, Freelancing and writing. You have amazing writing skills. No work is small or big. You should also look for jobs in other states such as Nebraska, Kansas, Maine. Hopefully the market isn't bad for citizens compared to what it is for International students on F1 visa. \n\nAlways remember the purpose of life isn't to become a good software engineer or billionaire. Just try to be a good human who gave the best effort. You won't regret it. Life can be very mysterious but don't give up. There are a lot of people kn this world willing to sacrifice to live our life. Stay strong and hang in there, we are all here for you buddy. DM me if you want to share more.",
            "You have only applied for a month. A job search is typically 3-6 months, even when the markets are favorable. In this environments, 6 months for a new grad is normal. \n\nIt is discouraging when your family is not supportive. But think of the bright side, you will move to a new apartment once you get a job. You will be there soon.",
            "Welcome to adulthood and life. It does not care for, nor will it coddle you. Everything you take out is because you were also able to put in. You've put in the inordinate amount of time and effort to get to the point where you're basically at the starting line after training for years. You're just waiting to hear the pistol. \n\nWhile folks are saying to share your resume (which, imo, you should), realize that your outlook is going to lead your way forward. It sounds like you lack world experience, and it only comes with time and exposure. \n\nYou 100% should get a part-time job while you search. It'll help shore up what I'm guessing is a weak point in your resume, and it'll help get your mind on the right track. Nobody wants to hire a cave dweller, and your attitude will reflect reality the longer you spend in that state. \n\nLastly, consider what jobs you're applying for. It's not terribly clear from your post whether or not you're just aiming super high and not getting it, or if you're applying to everything under the sun. Everybody on this sub likes to make it sound like everybody has a FAANG job with 200+ TC, but I'm going to tell you that shit is rare as hell. It takes a lot of time, patience, and outright luck to get into these types of positions. If you get there, it's cool, but it's not all it's cracked up to be.",
            "Bro I feel like you are too reactive to the surroundings. I would suggest to use [stoicism](https://youtu.be/R9OCA6UFE-0) against it. Also there is nothing wrong with doing a shit job and being undermined because you know you are doing your own shit. Market is garbage these days, people with tons of experience can’t get a job, so just wait this shit out until the next cycle. Keep applying and don’t fuck up that one  interview you will eventually get. Also change your resume",
            "You don't have any passion! *rolls eyes*\n\nTech has always been like this. A circle jerk and inbreeding. The only field I've ever seen that doesn't have entry level positions.\n\nIt's time to give it up. I don't recommend entrepreneurship if it's not something you want to do.\n\nGood luck with whatever career you transition to instead.",
            "It honestly sounds like your personality sucks. I know college dropouts/non cs degree holders with not even half your accomplishments that are doing well for themselves because they know how to sell themselves and can network on the fly.",
            "Join the military. People have this weird reflective reaction of envisioning launching missiles at destitute Iraqis when I say that, but you can do pretty much anything that exists in the civilian world in the military. Doctors, lawyers, teachers, scientists, engineers, cops, priests, and yes, IT/computer. \n\nGuaranteed job, you will never get fired unless you literally commit a crime, juicy benefits, and one of the last remaining industries whete you can get a pension (after 20 years of service).",
            "Would recommend reading the secret by Rhonda Byrne and I can do it by Louise Hay. Would both help you out with both your job and life. \n\nYou have to change your fundamental beliefs about progress and getting a job. Start seeing these failures as moving you closer to your perfect role, believing that you'll get a great offer soon! Try it!",
            "Do you have any previous internships? Research really only helps if you want to do research. Grades really don't matter. \n\nPost your resume",
            "Do you have any previous internships? Research really only helps if you want to do research. Grades really don't matter. \n\nPost your resume",
            "Nobody cares about GPA, a harsh reality for some students.\n\nPost resume\n\nClasses during the semester are not even a priority for me. I just LC and apply to internships.",
            "[deleted]",
            "bro i cant tell if ur being serious or if this is some plot to a movie",
            "The thing with employment in competitive fields is that you need to BE better than your competitors and show employers you are BETTER than everyone else.\n\nemployment is a game of social value. The people that provide the most utility, whether it be hard skills, soft skills, leadership, or something else will be selected.\n\nOnly you know best what you are doing but ask yourself, are you \"better\" and more \"valuable\" than other cs majors who apply to the same positions you apply? if not, figure out what your employers want and see how to overtake your competitors.\n\nBased on your post, it seems like you are a hard worker. But here is the thing. Everyone works hard in college, especially CS majors. But at the end of the day, your own subjective value you give yourself is irrelevant. Working hard and feeling accomplished subjectively doesn't matter and can not be use as justification that you \"deserve\" a job from the universe.\n\nWhere do you stand among your peers? What is your market value? This is what actually matters.",
            "Amazing short story ✨✨✨✨",
            "[deleted]",
            "Jesus christ u big fucking pussy. U must really have way too much fucking time on ur hands",
            "I am sorry for you, or I am happy for you, whichever is appropriate. \n\nTLDR please?",
            "Apply for other things other than big companies… that’s there all the turnover is",
            "My writing isn't as good as yours, but here's a list of things I'd think about/ consider. \n\n1. Resume/ CV. How is it? Is it visually appealing? Is it short and concise? You have a lot of qualifications, but if your resume is 3 pages long, no one is going to read all of that. Find a way to trim is down to be shorter, while still fitting in your qualifications.\n2. It's only been a month. It takes time to find jobs, and especially careers. Your grandmother does sort of have a point. Working at some random place till you can get a job in your field is a good idea. It sounds like your struggling with the pressure of parental influence and the burden of life. I was the same way, and a lot of it stemmed from sitting at home all day, playing video games and getting yelled at. Even if it sucks, look for a crappy job that will get you out of the house and get some extra money in your pocket. Things wont be okay unless you make them okay. \n3. Don't give up. Keep applying to anything you can find, and follow up with a phone call or email a week or 2 later. \n4. Apply for jobs you are \"underqualified\" for. I didn't even finish college, but I was able to get a job in the IT field out of sheer luck, resume quality and interview skills. \n5. Please seek some help. I mean this in a nice way, you're struggling. Find someone you can talk to. I'm not sure if therapy is easily accessible in your area, but even a close friend is more than enough.",
            "Did you not do any internships? Believe it or not, it’s still the best way to get your foot in the door.",
            "The past year that you applied really won't count. Companies are not that sure anymore about hiring someone that far in advance. Realistically you should pretend that you have only been applying for a month because that's when you graduated and are qualified to work. Apply to every entry position you see and you will land one eventually. Do it the whole summer and work on side projects to prove you can code outside of school assignments.",
            "I've seen too many made up posts in antiwork to believe it is *this* bad.",
            "Drop the resume",
            "BUILD 1 PROJECT THAT SPEAKS YOUR LOVE FOR THE FIELD. in current market thats the only thing you can do",
            "Maybe attach your resume and let's see what's wrong with that? Maybe also try an internship if you haven't already? It also depends on what positions you apply to can you give us your wanted role?",
            "Try posting your resume on r/cscareerquestions. Maybe try working on your soft skills, your communication, look up some interview questions, record yourself answering them and watch it. \n\nMaybe you need to lower your standards. Getting an unglamorous 50k job working on excel spreadsheets while you build your side projects up for a year or two isn't the worst thing. You just need some experience, any experience. This is the biggest washout period in the cs field, you just need to get something, anything, even if it's html monkey at Joe's computer repair",
            "I got out of the military and got a semi-CS job for $40k/year after graduating a coding bootcamp. No degree, aside from an Associate's in Logistics Management.\n\nWorked there for about 18 months before I got tired of it. Applied and interviewed for countless positions, and now I make $145k/year. \n\nThe trick is to keep pushing regardless of how you feel.  I was severely depressed with all of the rejections, but I learned and took notes from each interview.\n\n[Three Feet From Gold](https://salusnj.com/three-feet-from-gold/) is an excellent mindset to have. Keep pushing and you'll get there. You're probably closer than you think.",
            "wait so did you at least get a chance for interview or were you insta rejected",
            "Join the military as an officer and do CS for them? They will gladly take you.\n\nEdit: and companies love the PR of hiring a veteran.",
            "Work part-time for some cash. Look for opportunities in Europe and Asia as well.",
            "First of all, I know what you're going through.  I also fall into the trap of working ever harder on my technical skills, although I know ... \n\n... most good white-collar jobs are found through connections - people who know you and like you and trust you. Use your network / build your network. This is a skill you'll use throughout life.\n\nGood luck!",
            "are you an international student?",
            "There is absolutely no way you did all that and haven’t even received anything. At that point it has to be the resume. You’re like a 5x better candidate than I am.",
            "I graduated with a bs and a PhD. Both times my parents thought employers would be knocking down my door.  It took years after my PhD to find a job in my field. Actually I worked at Best Buy for a while, though it sort of hurt my resume.  In your case consider starting a company working towards building an app, big data analysis, or even a video game or something could help a lot. You don’t have to make money doing this.  Do a bit of research first, though.\n\nI initially dismissed Temp/contract work right out of my bs degree, but despite the time commitment of a temp job interfering with a job search, it still worked out.",
            "Make it happen is how it happens. Practically everyone is going through that, which is struggling to find the job you deserve versus the job available (in your case Best Buy). Offer your services online freelance, participate in public spaces like a GitHub project in a trending area, do freelance work to start generating income and changing your mindset (even as simple as Uber or Doordash or postmate’s gig job just to get out of that home environment and not be committed to a job less than what you want). Good luck! Don’t give up!",
            "Utterly brutal. The world of tech is more closed off like a old boy network. To get in you need to know someone. I initially believed that meritocracy is what reigns supreme in this industry but I am shocked by how wrong I am. \n\nIt is better to invest in a vast network to get that entry level role than on your raw skills.",
            "1100 applications sheesh, work on ur network and soft skills",
            "Go post on cscareers if you’re serious. You’re only going to get immature assholes on this sub.",
            "where is your location and what is the position you specialized in, front? back? cybersecurity? Do you have projects on the resume?  its been the tough year 2022, and 2023 since the down turning economy.",
            "I am sorry my friend \n\nYou read like a really smart individual\n\nPlease take care and keep at it is all I can say",
            "I’m a long long way out from my BS and I’m not even directly in the industry anymore but CS grads are a dime a dozen if you don’t come from a handful of elite programs. How are you setting yourself apart from everyone else out there? Why would a hiring manager with 100+ apps pick yours? \n\nI can tell you what really matters in a professional environment is not your technical ability (it’s a given that you can do the job) but how well you work in a team, prioritize your work, and take direction from above. \n\nWith that said, there’s a still ton of things you can do to strengthen your applications: find a mentor to advise you, seek professional feedback on your CV, specialize in highly employable niches via advanced degrees or contributing to major open source projects (quantitative finance, AI, analytics, etc), network and get informational interviews to get a better understanding of what companies you’re interested in actually want, etc.",
            "Honestly should have tried for am internship, hackathons, high GPA, and research/grading assistance is cool and all but most business want people with experience in the field and internships help get you hands on experience at X notable company and usually transitions into a full time job.\n\nIf you haven't already checked out the r/cscareers page and other pages and post your resume for some advice on how to tweak it.",
            "awesome read",
            "Sounds like you have the kind of family that creates a CS freak with no soft skills. Rough RNG on your character",
            "Well you should show us the resume for starters.  Where did you earn your degree from? Try doing mock interviews with interviewing.io or something similar so you can get feedback from actual employees of good companies. \n\nYou’re obviously missing something but we don’t know what just by reading some text.",
            "I suggest looking into large law firms.  PM me and I can help you.",
            "Try WordPress. After my coding bootcamp I always thought WordPress was beneath me because that really isn’t “software engineering”. However, after difficulties finding a job on the field, I learned it (via Udemy) and marketed myself as such. Started driving Uber. Then Got a boring job doing Wordpress. Kept doing Uber. Then used that WordPress experience to market myself as a now “experienced” software engineer (trust me: technical recruiters can’t tell the difference). Year later got my second job using jQuery, for about another year. Stopped doing Uber. Those 2 years of experience got me small contracts via technical recruiters… which led to 2 more years experience doing crappy contracts using HTML/CSS and vanilla JS with crappy old CMSes. On year 5, I finally got a fulltime role using React.js (my goal from the beginning) and loving it. \n\nDon’t be afraid to start small. All of y’all will be happy about it. \n\nAlso don’t be too hard on yourself: I am sure the recent massive layoffs of tech companies (+ ChatGPT) are making it super hard to find entry level roles right now",
            "OP, first of all, I am so sorry you had to endure this. Let me offer my 2 cents on this. Never be afraid to take risks. Things may work out or it might not but never ever stop trying. Start fresh and probably make a list of roles and companies you want to work at. Do research on what kind of work they actually do in the company. Make a good portfolio and extensively list down all the projects you have done in it. And most importantly, talk with recruiters and managers through LinkedIn. Meanwhile, do something which gives you some sort of calmness (not everything in this world revolves around money). It can be anything from cleaning your room, going on a bike ride to maintaining your lawn. And just remember that you are not at all alone in this. We are with you and we will definitely live through this.\n\nOf course, there is a lot of luck involved. But the only way you can maximize your chance is through hard work. Because Hard work cannot be denied forever and eventually the cream rises to the top.\n\nAll the best & sending virtual hugs :)",
            "Do you have any work history?\n\nHow are your soft skills and people skills?\n\nAre you only looking for advanced positions and avoiding entry level jobs?\n\nIt doesn’t matter how good your school career looks if you don’t have the soft skills to get through an interview. Our company goes through dozens of people who they turn down, because despite their backgrounds they get into the meeting and can’t make eye contact, talk over the interviewers, or try to sound too smart. \n\nAlso you really gotta open yourself up to more entry level roles. A year of job experience is worth more than an entire college education. For advanced positions employers aren’t looking for people they need to train in their systems, they want people with actual industry experience.\n\nNo matter how good you think you are the workplace is vastly different than schooling or extracurricular CS. Employers know that and want people verses in the industry. Having zero work history (even if it’s just high school or college jobs) hurts that even more.",
            "Do you have any project ideas that could even remotely theoretically be a business idea? Do you have any friends in a similar position who you could work with? Big companies aren't hiring right now, but they were all startups in 2008 the last time there was no work to be found. There's no vc funding right now, but there might be in a year? Best case scenario you're positioned to start something big when things start moving. Worst case you practice on something more valuable that fucking leetcode (I seriously hate how leetcode has become the be all end all of recruiting and training).",
            "It’s not you. Tech got rich off of low hanging fruit. It’s all picked and most of it will rot, it’s annoying to Saas every stupid human “need.” Every single hardcore please the parents believe in the “right way” to excel in a capitalist a system didn’t learn the first laws of capitalism. You are either on the supply side or the demand side. And the supply of coders far outweighs the demand at this junction. You all had a good run. Good luck out here it’s very difficult.",
            "The traditional answer to this is internships.\n\nIt's not the 1980s anymore -- internships pay, and for the big software companies they pay pretty well (the equivalent of 6 figures). Internships act as extended job interviews, and it's very common for companies to make offers to successful interns.\n\nThis is a bit of a hard time for internships (both the economy, and the pandemic leaving pretty empty offices make it a harder path) but this is the big opportunity that you didn't mention in your post.",
            "get our your room and go there in person. apply on their websites instead of linked in and follow up if they never call you back, call them back weeks later",
            "In the words of Zizek,\n\"The light at the end of the tunnel is a coming train\".",
            "Are you getting response and interviews? Best option is to ask an existing employee to refer you. If the job is posted on LinkedIn, a lot of times the recruiters profile is on the listing. Connect with them and submit your resume through them. They make sure it lands on the hiring manager desk. If you can't find a contact, join team blind app and ask for referral there. Employees of that company have anonymous profiles there but are happy to refer you. If you are not able to pass the interview then ask for feedback. Some are happy to help and give constructive feedback. Look for small companies. Right now times are tough in the IT industry, so it's not you but the times. Hang in there. Good luck.",
            "I created some internships where I worked for a small local business and did some automation and programming for them to improve their daily tasks. Maybe you can think outside of the box and get your foot in the door somewhere doing scripts, automation, a small web server to hold some events, scrape the web to find out pricing of the goods that they sell. Where are you located? PM me if you wanna chat more about it.",
            "OP please post resume I’m so damn curious lol. Your whole story sounds somewhat of a stretch. Im guessing your resume is much better now then before those 1100 apps. I have a feeling a weak starting resume is/was the bane of your problems",
            "Do you have internships?  Did you contribute to Github projects that aren't your own?  Are you any good at interviewing?",
            "When the Adderall hits",
            "Hey man, everything’s going to be okay :)",
            "Doesn't hurt to do something else part-time or full-time in the meantime. flipping burgers ain't pretty but it puts money on the table and food in your mouth. \n\nKeep up the search you'll find something",
            "There is absolutely no way this is real unless you’re the unluckiest man alive lol, from what you say you’re better than like 95% of students",
            "New account, no posts, no comments.\n\nThis shit reads like ChatGPT output",
            "Which country you applying?",
            "Many have mentioned this but you sound a little overstretched. If your spending all day in your room cave looking for jobs it is too much. Go do something you enjoy. Your application is probably bad and sounds frustrated by this point and that’s an easy way to scare employers away.\n\nWho cares if you get a part time job at Best Buy then leave in a few weeks if you find a full time job. People from competitive schools are struggling to find jobs right now as the market got tougher this year and every resume has your experience.\n\nThis isn’t to say your screwed but you have a ton of options that arn’t bad. Also you graduated a month ago. These things take time and I guarantee companies you applied to a year ago looked and hired somebody available immediately. This process has clearly given you anxiety and it sounds like you have practiced 0 self care mentally and physically. This shows up when you write cover letters, emails, interviews, and reddit posts. Take some time, leave your room, and go do something you like. The job you don’t apply for today will still be there tomorrow. \n\nAnd for others reading don’t start your job search a year before you graduate (in most cases, there are of course some companies and some exceptions). Starting in your spring semester is perfectly reasonable and helps you avoid burnout when it actually matters.",
            "You guys (cs majors) are so smart and hard working, but it seems like there are just too many of you.\n\nSome of you should seriously consider going to med school or dental school.  I’m a dentist, and I don’t work 1/10th as hard as you guys and I make just as much for working 30 hours a week with no job stress.\n\nYou can still code on the side for fun.  I read these horror stories and feel so badly for you guys.",
            "Lol",
            "u are not working smart enough. that's the problem",
            "this post is exactly why i’m a grad student lmao",
            "Dude just get a job at bestbuy until you find someone to hire you full time.",
            "sounds like you need to do another 1000 and hit the gym too.",
            "OP you should take grandma up on the offer. Like Yes grandma, let’s go to Best Buy right now. You can help me apply since I’m obviously too dumb to do it. Let’s see what happens shall we.\n\nIn all seriousness - I’m really sorry you’re going through this. You are really doing your best and more than most people in the same position. Maybe try to walk your parents and grandparents through a typical day. The fact that you’re doing this alone in your room is not helping them understand what’s going on. Just an idea, maybe that doesn’t help at all either. But anything to make your home situation a bit more bearable.",
            "I ain't reading all of that but if the tl;dr is that you applied to a billion jobs and can't land anything then don't feel bad, you're not alone. 8 years experience, 5 at a FAANG and i've got nothing after 3 months of searching. I know multiple other people who were at FAANG and are in the same boat after months of actively searching. Job postings/employment reports are a all lie. Economy is shit.",
            "Sound really poetic but I bet u being sarcastic. ur profile got nothing so it  also support my theory. funny post!",
            "TL:DR which might be your problem. Too many words on resume or during interview.",
            "What you need is a guidance councillor and a recruitment agent. Are you applying for VP roles fresh out of Uni? Having a good CV and a degree doesn’t give you access to anything other than entry level work - you have to work your way up the hierarchy.",
            "Kinda horrified at the amount of people cracking jokes at OP. \nThis person clearly is struggling with their mental health right now. Rejection is cruel and if you don’t have a good support system around you, (which OP doesn’t seem to have) it can feel even more isolating.\n\nOP keep your head up, I hope things turn around for you. Keep trying to land that role, it’ll happen. \nMaybe you can find a part time job to hold you over for now. I know it’s not ideal, but not every takes the same path to the destination.\nIt’ll also help you to get out of your room and build some other hireable skills.",
            "Take their advice and just take the shity job if it's available.\n\nIf that means you have to flip bugars or be an emotional punching bag for the general public for 8-12 hours a day, then it is what it is.  \n\n\nAt the very least it gets you some money and maybe some friends who are also embracing the suck.\n\nbeing able to program is dime a dozen these days; venture capitalist funding has disappeared and the dream is dead.",
            "My friend cold emailed the COO of OpenAI and got an interview. \n\nGet creative and if money isn’t an immediate issue, get experience that will be highly valued in 12 months.",
            "Curious. I talked to me academic advisor(s) and make use of the university/college job placement services starting first semester of my senior year, and had two job offers before I had finished my final semester. I even ended up with an incomplete (senior project unfinished due to health issues) and the place I chose to work still hired me at a slightly lower salary until I was officially degreed, which only took a couple months. \n\nBy the way, FAANG is obsolete... it's now referred to as MAMAA.",
            "I graduate in ~7 months, and I will take anything I can get for actual hands-on, professional setting work experience. I don't feel that I'm overqualified or too good for anything.",
            "Nice writing and venting. don’t worry u will do fine.",
            "OP do you have any friends that graduated and are now employed? Please reach out to them. One thing I have learned is applying online is really useless, no matter how skilled you are. \nSpeak to a friend, get them to put your resume in front of their manager, have an interview and a personality and hope for the best. Now if you don’t have any friends… that’s a different issue. You can try getting referrals from LinkedIn, but it’s better from people that actually know you.",
            "Unfortunately, a lot of companies won’t even look at your resume if it doesn’t match the job description well. So that means creating a unique resume for each job type your applying to or having a multi page monstrosity. Maybe narrow it down to 2-3 job titles you really want that are loosely related, copy paste the job descriptions from your top companies you’d like to work with for those positions into a blank document. Then copy/paste to your resume and reword into how you’ve accomplished/mastered that skill either through work or coursework or team projects. I’ve helped rewrite quite a few resumes this way and it makes the work easier to manage.",
            "  with 16 year olds from Gibraltar who pronounce deque with three syllables. \n\n&#x200B;\n\nim sorry, that is a native english speaking country. how the FUCK do they even find a third syllable?",
            "OP, we all are there for you, don't loose hope. Remember to tag me, I'm waiting for your success.  \n\n\nDon't stop to water your plants now, for sure there are no leaves/flowers. But don't stop.",
            "Bro apply for **content strategist** positions. They need someone who can understand the business very well(usually finance, banking industries) and have a lot of creativity and good with words. They also need someone usually with Python and SQL knowledge.\n\n&#x200B;\n\nHere are some other positions that kinda interject business, strategy with tech. Hopefully it helps:\n\n* Data Analyst\n* Data Engineer\n* Business Analyst\n* Data Scientist\n* Project Co-ordinator/  Program Manager\\[A CAPM certification helps\\]\n* Business Intelligence Analyst/Developer\n* Implementation Engineer\n* Solution Engineer\n* System Analyst\n* Actuary Analyst(Entry-level)\n* Quantitative Analyst \n* Marketing Data Analyst\n* Entry-Level front/middle office analyst\n* Content Strategist\n* Strategy Associate\n\n&#x200B;\n\nI am in the same boat and at this point I can't even keep track of the no of hiring managers that ghosted after one or two interviews. Keep trying, keep improving. We will succeed!",
            "I think a lot of it has to do with the current economic state as well as the current state of tech. It’s not open as much as the last few years. This is an externality that you can’t control. Unfortunately this leads to companies hiring experience over grades.",
            "You’re a wonderful writer OP, unfortunately you’re in a very rough market for job openings at the moment. The best advice I can give to you is to invest in yourself and not someone else, do what you want, make what you want and build something others want that makes them believe only you can provide. A resume can’t show that, so think outside these six walls.",
            "Imagine posting this when you look down on your brother for being a psych major\n\nTouch grass bro",
            "two things: \n\nthere are macro-economic factors at play here. it will be years and years until you have the experience required to become \"recession-proof\". you get to learn this lesson early on: use the down times to invest in yourself in other areas, so that you grow into a human being as well as a great engineer.\n\nyou need to get into a different environment. no one wants to hire someone with horrible mental health, and that is what you will be if you stay in that environment. plus work aside, your mental health is extremely important.",
            "Being lighthearted: I think dramatic writing is your calling, you have a clear talent for dramatic narrative. \n\nBut truly, I hope you do not narrate your life to yourself as it happens in the manner you've written the post. If so, dear Op, I say this with sadness but care: you need to reach out for some help, a mental health professional. Looking for work is hard and emotionally depleting, yes, but you are in a much darker place if you see things as you've explained.   \n\n\nI say this out of concern, you sound very much like I did years ago finishing a post doc, very isolated, looking desperately for a job, after many years of struggle and work for what I chose. Without further details, I fortunately came to realize that a finding a job was not my biggest problem, the state of depression  and chronic anxiety and stress I was in was.  Please reach out to someone. Maybe take a look here  \n[https://www.medicalnewstoday.com/articles/online-therapist-for-free#\\_noHeaderPrefixedContent](https://www.medicalnewstoday.com/articles/online-therapist-for-free#_noHeaderPrefixedContent)",
            "Don’t carpet bomb your resume. Investigate companies and craft your application to them. Also, try and see if you know someone who works there via LI, though since you are early in your career, this might not really work for you.\n\nApply for jobs you are overqualified for. Even if you reject then, the experience of interviewing will be good for you and getting offers will be good for your ego. Who knows, you might even take one!",
            "The part about not letting yourself apply to jobs you are \"remotely underqualified for\" was a huge red flag. The reality is that you are underqualified for every role (assuming the jobs you're talking about not applying for are in tech and not retail hourly or something), because school and industry are vastly different beasts. \n\nYes it seems like you should have earned the right to prove yourself, without more data it's hard to make more of an assessment, but I will say this: take something you think is beneath you at a large company and prove yourself. Or at least do that job better than anyone else around you while looking for the one you want. \n\nFinal point, having hired many fresh grads and in the last couple of years having a mandate to hire only from the top technical school in my country, a great student does not always make a great employee. In fact some of the biggest flameouts had the best resumes and pedigree, but didn't know how to think outside the box, work with others, recover quickly from mistakes etc, and generally had lower EQ. \n\nGood luck!",
            "You seem to have a very negative opinion on everyone else you speak of in this post. Reread what you said about anyone who isn't you, that should give you pause. I understand that things are not working out for you as you hoped, however, the \" It would take more years off my life explaining to her what a software is than she has left on this dying earth\" attitude is honestly taxing. Bro you are JOBLESS. You are in a position where any job would be better than where you are. Get out of the house, go get a job anywhere. You are keeping yourself in this position because you think you are above those sorts of positions, as well as the \"16 year olds who pronounce queue with 3 syllables\". It is time to face the music, get a part time/full time job in something that is \"below\" you, use that as an opportunity to develop your soft skills; It seems like one you really need to work on is seeing things from someone else's perspective.",
            "I also just graduated OP. It’s pretty rough out there. You are doing every right. The job market is really bad right now. We are in similar fields and I suggest you start looking at internship positions. You could be lucky if it turns into fulltime position. \n\nI also relate to your parents. My parents grilled me and made me do the coking cry after my graduation. I feel you OP. I was about to have an anxiety attack while I was crying and my parents yelled at me even more. I’m also under a lot of stress and to see them treat me that way was so paralyzing and shocking. I couldn’t believe my parents show an ounce of sympathy for their own child who just graduated and was emotionally suffering. \n\nI just finished a job interview and I never ever wanted to crawl into a hole so badly. I felt ashamed and stupid. I would say there is an end of the tunnel OP. I heard jobs are being added in a few months. Hang in there. Market is rough but you’ll get there",
            "You can start by not typing so much. You probably talk a lot then too. Just shut your mouth. Listen. And then formulate your next move(s). I don't understand why people need to talk so much...in public. WTF?",
            "Simple solution get off this fucking app and spend more time studying you idiot",
            "I teared up reading this :( \nI really hope you get what you deserve and more",
            "Based upon everything I've read here, I really doubt your education and hard skill are a problem here.\n\nI never excelled at my uni, one of which probably few people outside of my country have ever heard.\n\nDespite all that, I had zero problems getting a job, neither did my colleagues. I sent my resume for internship to a company I found my interest in, they accepted me after an interview and then I finished my studies and stayed there as a full-time employee, cause the managers had a good opinion about me. For the reference, that was about two years ago. In total, I sent only two applications.\n\nSo, unless you are completely delusional about your own skills, there must be something else at play here. I don't know much about working in USA. Maybe the job market for entry-level programmers is significantly worse there. In this case the solution might be to look for a job in another country. I've also heard that it's much harder to get a job there if you are not a US citizen, but I doubt that applies to you. Same with felonies and criminal records. Maybe you have poor social skills. In that case maybe that's something that needs improvement. Or maybe your resume sucks. Try rewriting it then and consulting others.\n\nRegardless of what it is, your CS skills are not an issue. I can't offer much advice besides just \"Take a break, rest for a while, then try to identify the actual problem and possible solutions.\". But I can offer my own experience to juxtapose against yours. Yours is not normal by the measure of anything I or my friends have experienced. It's either you are doing something completely wrong at some point, fucking up your otherwise good applications, or it's the part of the job market you are trying to get into that's wrong - then look somewhere else. There's a clear flaw somewhere in the process.",
            "Been in this industry my entire life, and I can tell you, almost everything you mentioned, while commendable, is not something any company cares about.  Nobody cares about your GPA or hackathons.  What actually matters is what you list as your technical proficiencies (this might end up just being key-word soup, but it is what it is), what projects you've worked on (and your SPECIFIC role in those projects), and how many years experience you have in said proficiencies.  It might be helpful to see your resume.  Soft skills, like others have mentioned, are a thing...but those are pretty impossible to judge online.",
            "Bro, I felt each and every word you said. I am going through this shit feeling too man, after doing it all and not seeing any results, its frustrating man.",
            "McDonald’s",
            "OP I can't fathom why this is happening but I do wish you the best of luck and hope that you can find strength through it",
            "I hate to break it to you but you are doing **something** wrong.  It's hard to say what it is but have you considered taking a breather?  Yes grinding is often the only way to push forward, but you need to set checkpoints for yourself to adjust course in such scenarios.  Change up your game.  Maybe literally just get really into running for a month, and come back to this shit.\n\nFor what it's worth - I'm not sure I've ever had a callback from a cold application in my professional career.  I would not bother applying to a job without a referral or some kind of connection that I can reference.",
            "Hate to tell you, but it doesn’t exist.",
            "Does OP have any internships? Honestly all the academic stuff is good but the number one thing companies look for are internships. If you don’t have any on ur app there’s a small chance ur getting a call back. Also blindly applying is a waste sometimes — have you taken advantage of career fairs/referrals?",
            "Damn, is it really that bad in the US? Idk how hard it is but maybe you can work remote in Germany? Companies literally apply to you here if you're a CS grad.",
            "Don't worry in afew more years we will be completely obsolete",
            "I'm sorry to hear about what you're going through, but I'd just like to welcome you to the real world.\n\nHere is some advice from someone who got PhD in Biomedical Sciences and now makes $150k+ in a completely different field (AI and affiliate marketing):\n\n-Don't just apply for good positions with good salaries in well established companies. I made this mistake when I was a fresh graduate and couldn't land a anything anywhere. Apply everywhere where your major might be of use, and a position is open. I worked as a Lab Assistant at $10 p/has my first \"real job\". I had a PhD.\n\n-Accept any job offer that seems reasonable and continue applying to other places. Having a source of income is better than not having one, plus you will gain experience while you work. My second job was a Research Assistant, and the previous experience helped me land it. I also landed it within the same company that offered me the first one. I was earning $35 p/h then. After that I worked as a Primary Researcher and Associate Professor. The experience I gained as a Research Assistant, again, helped me land this position.\n\nTL/DR;\nAccept whatever offer you get and keep searching while gaining experience. You will likely find what you are looking for down the line.",
            "."
        ]
    },
    {
        "post_id": "16qz3b8",
        "author": "Affectionate-Elk2066",
        "title": "I got extremely lucky",
        "url": "https://www.reddit.com/r/csMajors/comments/16qz3b8/i_got_extremely_lucky/",
        "score": 1029,
        "num_comments": 123,
        "created_utc": 1695565739.0,
        "selftext": "\nI occasionally pop on to Reddit to check out this sub maybe like twice a month and all I ever see is doom posts. I think I even saw a redditor with 500+ applications and still no job or any real prospects. Well I am graduating this semester and was honestly a bit freaked out by these type of posts. I kind of started to think that I was screwed. I started applying last month for a full time position and have applied at maybe 20 places. A few days ago I got my first offer to one of the big banks/investment firms as a SWE. I have one internship and I’m graduating from a top 50 school so maybe that helped? I just feel like I really lucked out based on the sentiment of this sub. I’ve also solved maybe 6 leetcode Qs in my life. Anyways, maybe this will be a small glimmer of hope for someone out there.",
        "permalink": "/r/csMajors/comments/16qz3b8/i_got_extremely_lucky/",
        "comments": [
            "This is such great news.  I wish more people would post their success stories in this sub.",
            "Idk why people are hating on this post. Better than the 20 depressing doomsday post",
            "I'm so glad I live in Norway where the demand is so high that 2nd year students can easily get summer internship and guaranteed job after graduating. Even at the largest tech companies in the country",
            "the jealousy emanating from these comments is worse then the smell emanating from my cs courses 💀💀",
            "I fucking hate you (Great job man, I hope it works out)",
            "What company? Would love to know who’s hiring",
            "I don’t think this is “extremely lucky”, there’s nothing you did wrong that would suggest you shouldn’t have gotten a job ukwim \n\nLuck might’ve played a factor but it seems like you’re just… not falling into the misery and doom circle jerk lmao",
            "fuck you (congrats)",
            "Must be nice",
            "You weren't lucky, you got an opportunity and you were prepared. Good job :)",
            "Congratulations! There are so many factors that go into getting a job. Keep being humble and grateful but also remember you did work hard to get where you are. The next step is to pay it forward- help out others when you have a chance. Again congrats!",
            "Same, though I got a much better job than you (FT Jane Street, one app)",
            "I think the majority of the posts on here are people seeking visas. While the market is tough if you're a US citizen you can get interviews.",
            "I think this is more normal than you’d think it’s just that nobody posts about their 20 applications -> success pipeline. People here like to hear about the 100+ hrs of leetcode and 500+ application -> success stories, and on the contrary the 500+ applications -> still unemployed stories. There’s plenty of people in the middle. \n\nI applied to maybe 20 internships last year and got one then return offer from that didn’t even apply to more than 10 other NG positions. It really really helps to try and target an area when picking a job. I believe I was hired a good part because I went to college in the area my company is headquartered in, and I made it clear I liked it here/wanted to stay. If you go to college far away with no connection to the area you’re applying to it’s going to be a bit harder to get a job.",
            "Would you be able to share an anonymized resume? Seems like me and a few other folks here could really benefit from it",
            "Shut up",
            "Schools (reputation). Internship (company and projects) all matter\n\nIt has mattered since the beginning of time for every profession in the world pretty much.",
            "From my experience people who go to high ranking schools and get internships rarely go more than a few months without finding a job",
            "Nah you're not lucky. Most if not all my CS friends are getting offers and internships left and right. Me included, I'm entering my 2nd internship as a junior. Throw a smile, have good people skills, and anyone can get a job.",
            "Congrats!",
            "Congrats. Would you mind mentioning the tc or range?",
            "Failed Citadel final. Still kicking myself",
            "Could you send me your anonymized resume. I am struggling to get interviews and I think yours would be really helpful to improve mine",
            "show your resume then",
            "what was the interview like if there was no leetcode style questions ?",
            "My school isn’t even top 100 and I got 140k tc. Graduating in December. Surely there are aspects of luck. Luck is apart of life, but I think the truth is that anyone can achieve anything with proper preparation and planning. The luck will find you if you do this.",
            "Congratulations! You are really a lucky guy.",
            "Is this a shit post",
            "Go away troll. This sub should ban new accounts. Let's stop with this rage bait.",
            "What company did you get into?",
            "Congrats : ^ )\n\nDo u mind if I ask u a couple questions about your process through dm?",
            "Congrats op ATB",
            "I put out two applications, got two interviews and one job out of it.\n\nI'm in the middle of my degree, both studying and working part time.",
            "Bruh, in Italy I got a job offer as Software Engineer when I still had to give my last exam and the thesis. Computer Science is one of the most wanted degree in the world, I dont know how these people can’t land a decent job.",
            "Congratulations man! This really inspires me to keep pushing. Best of luck 🔥",
            "Congratulations !! My story is also similar and I am glad I chose go stay from the doom and gloom of this sub. Even though my role is not swe, but it's a analyst role in tech and I am happy for myself.",
            "Seriously I think the people who post doom posts on here are just complete noobs, CS majors are in demand everywhere",
            "What stack you get hired for?",
            "Congrats man! Would you mind stating what area / state your located in?",
            "I only applied to 2 internships and got them both different summers 2 leet code questions ever and both gave me return offer for full time… it’s not “hard” it’s just lots of luck and being early. My thing was for both jobs I reached out to recruiters and they even set time aside from their work ours to chat with me about what to expect in my next round of interviews. I also applied to them as soon as the applications opened, from what I heard of my classmates they wait way to late into the school year because they are “stressed” and don’t have time. Which I get but like it’s your own fault.",
            "I randomly applied to STEP at google as a sophomore and did two summers there. The interview was literally just make a class and add functions to make sure I knew about OOP. Then I got an interview free return offer and hopefully I’ll get an interview free return full time offer too 🤞🏽. I also spent a 5 month co-op at Amazon robotics as an international. I originally got auto declined by amazon but a recruiter literally reached out on LinkedIn and gave me a separate application referral link that only prompted me two sum and basically got a free offer for that too. I’ve spent a lot of time on leetcode off of fear that I’ll need it but I have never really needed it and if it helps anyone none of these companies’ work was ever nearly as hard as leetcode questions I learnt everything on the job and no one had higher expectations than what I could naturally achieve. Good luck guys :)",
            "I don’t wanna hear it until i see your resume and found out you are NOT one of those cracked out cs majors",
            "It's been 3 years and I still don't have a job. Good for you that internship probably helped a lot"
        ]
    },
    {
        "post_id": "s9eym7",
        "author": "None",
        "title": "I got 0 on my first assignment because I submitted my resume instead...",
        "url": "https://www.reddit.com/r/csMajors/comments/s9eym7/i_got_0_on_my_first_assignment_because_i/",
        "score": 1028,
        "num_comments": 53,
        "created_utc": 1642783398.0,
        "selftext": "The TA wrote, \"We are not hiring\" 😂",
        "permalink": "/r/csMajors/comments/s9eym7/i_got_0_on_my_first_assignment_because_i/",
        "comments": [
            "This is the exact reason my schools CS department has us all ssh onto their server for coding, IDEs, software, and submitting assignments.",
            "always redownload and open the attachment you submit to double check",
            "I once failed a class because I misread a calendar and submitted every weekly assignment one week late... and only checked my grade after the first midterm, too late to recover. It's OK because now I can laugh about it. I'm laughing, not crying. You're crying! Shut up! Leave me alone!",
            "This has always been my worst fear. \"What if I accidently submitted my 'secret video collection' instead of the assignment\"!?!?",
            "How does this happen?",
            "It’s okay one time I dreamt I submitted a project but then when I woke up, I thought it was a memory and not a dream. I only thought to check my submission after the deadline lmao.",
            "How did you already have your first assignment due lol. Hasn't been a week since we started?",
            "Just send an email to the TA with the assignment. As a former TA, I can say that I would send a query email to the student if I saw their resume instead of the assignment. People do mistakes! It should be fine.",
            "if you did it on Google docs, and did not work on it after the deadline, then you can just show the course staff your document version history which Google docs keeps track of automatically",
            "😂lmfao",
            "I thought they’d at least be understanding.",
            "Lmao"
        ]
    },
    {
        "post_id": "1bbs834",
        "author": "alpha-kenny-body1",
        "title": "Giving up on CS for now",
        "url": "https://www.reddit.com/r/csMajors/comments/1bbs834/giving_up_on_cs_for_now/",
        "score": 1016,
        "num_comments": 226,
        "created_utc": 1710123757.0,
        "selftext": "This is mostly to get it off my chest, but I have to finally give up on CS. It's something I was really passionate about, and I still am, but just something I can't do anymore. I'm an international student studying CS in the US, but I have not been able to make a single cent back from my major. All my work experience has been in research labs where I obviously don't get paid. I am in my Junior year and was not able to find an internship last year, nor do I have anything coming up in the summer.\n\nDespite multiple personal projects, research experience, doing over 250+ LC questions (even getting LC premium and getting a 200 day streak), I have not seen any return from my major. This cycle I sent in about 1000 applications, but did not get ANY interviews. I attended career fairs, networking events, coffee chats, everything as well.\n\nNow my family has run out of savings and there is no way I can afford to pay tuition anymore. I will take out a loan and graduate early (next semester), but after that I am going back to my country. I don't see any way I can use my knowledge and passion in CS to make any sort of financial gain, so I had to make the hard decision to give up. I am probably going to end up working as a blue-collar worker. I feel awful because I was \"gifted\" in school and extremely \"smart\", at least according to my parents who made a lot of sacrifices to pay for my tuition. Even now, I won 2 hackathons last year. But alas, no money made there either.\n\nIt is probably going to take me at least 10 years to just make back the money I spent on my education. So I am giving up on CS for now. I don't see any way to make this a career for me at this point. Perhaps in the future I will get another chance because it really is something I am extremely passionate about.\n\nOne piece of advice for students who are considering CS is that you should really have a backup plan if you're not able to find a career. My mistake was coming in and just assuming that I would find a job after I graduate. That is not the case anymore. You need to have the financial freedom to try at it for a couple of years. Unfortunately, I don't have that luxury :/  \n\n\nEdit: People have been asking me to share my resumé, but I just don't feel comfortable sharing it publicly since a lot of my friends and family also follow this subreddit. They have seen my resume and would definitely recognize it if I posted it here. I am, however, willing to DM you a SS if you request me to. Thanks for understanding :)",
        "permalink": "/r/csMajors/comments/1bbs834/giving_up_on_cs_for_now/",
        "comments": [
            "Thank you for sharing your situation for this community to learn from. I hope your future is better.",
            "so a dude who won 2 hackathons and did numerous researches didn’t get a job, are we cooked?",
            "Post your resume bro. If you're not getting any interviews, that's prob the problem.",
            "19 days ago you said you won 3 hackathons but now it's only 2? ([HERE](https://ibb.co/64KZ3Xh) in case he deletes it later) You also said you applied to over 500 places and you tailored your cover letter for each sending only 3 a day for around 5 months. Okay first of all that is already \\~450 not over 500 but whatever it's just a small error in estimation but how has that increased to over a 1000 since then? You also said that you have had your resume reviewed by plenty of people and is on it's \"37th version\" (LOL sure) yet you refuse to post it anywhere. Interesting story mate.",
            "Can I see your resume",
            "would you mind sending me your anonymized resume?",
            "I was switching into CS in my 40s and now i need to change haha. It was already an uphill battle even when the market was hot. I love this shit though i'm gonna keep doing it as a hobby and find another alternative.",
            "Just cold dm the recruiters in linkedin. Don't give up now. Everything takes it's own time. Naybe you didn't get the job now, doesn't mean you will not your job in life. Maybe you are gonna be some millionaire after some years. Everything has its own time",
            "Good decision mate. The US is not what it’s made out to be and neither is tech. Wish you luck.",
            "Try UK or some other countries instead of only applying in USA . You will have more chance .",
            "You can still apply to jobs after graduating, you can apply to jobs while working other jobs. My first job wasn't a CS job. My first 3 jobs weren't CS jobs, but they sure as hell helped me get my cs job. I plan to apply to other jobs after graduating as well, I'm sure employers will care more once the degree is finished and all.",
            "Atleast ur not balding",
            "Never made any logical sense to take out loans to the tune of thousands to try and get a job here when there’s a risk it doesn’t work out. You basically played the lottery. I think international students need to stop viewing getting a degree here as a gateway to getting a job and residency but instead what it’s was originally for => a way for you to get educated and use that knowledge in your home country",
            "Whats your home country",
            "Isn't the point of international study that you go back to your home country with the knowledge you learned?",
            "You haven't even finished college and you're giving up. Give it a year of trying at least..",
            "You can’t do CS in your country?",
            "My advice is not to give up. I've been struggling with my decision to study CS for the last 4 years, finding it hard and daunting, and don't even know that the things that I learned might help me make money or not. \n\n\nToday, I got my internship as an AI Engineer. As well as making some money by developing Android Apps as a side hustle.",
            "Why not stay where you are and get any job that you can, and keep on applying? When I went to the UK, I worked as a Construction operative, delivery guy, events labourer, waiter, all sorts of things, and tried to grow. I am now (still) in Civil Engineering, but aiming to get in Cyber Security. Step by step.",
            "I don't recommend this often but I would look into consulting firms. There are some less shady ones that don't charge you anything and also help train and place you. At least this way you can recoup some of your cost back.",
            "You’re not a graduate, but expect a job?  With all the tech layoffs, visa-backed -ositions are really competitive, and you’re at a disadvantage.  It’s a tough situation.",
            "You went to study in the USA where people literally need trust funds to pay their school fees. I’m sorry to say, but what did you expect? It’s going to be extremely difficult to get any work while you are still studying and don’t have experience.",
            "Would it be possible to get a CS job in your home country?",
            "Why is not going back to your country to do CS there not an option?",
            "It really sounds like you are the reason you are not getting jobs. 1000 applications and no interviews? Highly unlikely that your putting your best foot forward.",
            "Unfortunately, merit means nothing. The number of internships, hackathons, research, and side projects absolute do nothing. You can have 6 internships at FAANG companies and still not have a job lined up. For post undergrad jobs what matters is networking. So join that professional frat, CS club, or go to a school with good alumni community. Cuz i guarantee you that after post grad it’s the ones who were involved on campus, not the ones in research labs, that will get jobs. It’s not your resume, it’s the referrals that gives you a chance at the interview.\n\nTheres a reason what “Top University”(What ever this means lol) CS majors with no internship experience are still getting hired. It’s literally cuz they know a guy(aka the recruiter). \n\nMy mentor/friend at a FAANG company and went to the best CS school in the country told me “everyone in CS is a personality hire until they are 28”. They are 26 years old working in one of the lucrative teams at the company. Genuinely your resume does not matter. Its literally can you talk your way into that job. Obviously with a good resume it makes talking easier, but you cant let ur resume talk for you.\n\nHope this inspires someone to try another way of getting a SWE job cuz leetcoding isn’t gunna get you there. If it wasn’t evident by the OG post. \n\nI have a SWE job and only did 4 leet code questions in my life before my job(Excluding the technical interviews). I was apart of a professional frat and half of people who got hired with me were also part of various/the same frat(s). FYI i hate frats but did it for my job and surprisingly made a couple of good friends too.\n\nIf anyone wants advice, happy to help.",
            "I helped run a startup for 2 years and still cannot even get an internship for this summer. It’s my 5th year and I was hoping by delaying my graduation, I could intern at a bigger company but have not even been able to get one internship for this summer even with years of experience working in the field. I’m getting hopeless too but I’m too close to graduating and in too much debt to back out now. I’m just gonna see it through and probably end up living with my mom and waitressing when I graduate for a while 🥲\n\nMy friend who graduated with a computer science and engineering degree last spring works at s grocery store and she’s also had plenty of experience and extra curriculars and it’s really freaked me out. \n\nI started college in 2019 and up until the last couple years, there was pretty much a solid guarantee a cs degree would pay off and that you would at least have job stability. It’s insane how much it has turned around in the last few years. And the places that are hiring are not going to go for the fresh grads when thousands of people are applying. \n \nI hope you find something that you like. There’s always pathways back to tech later in life. My sister graduated with an advertising degree and ended up working as a web developer from learning it at different jobs she had.",
            " CS jobs pay well in India as well. If you join a multinational company like microsoft or amazon or google and put in 5+ years of solid performance, with some luck and favorable job market in the future you might be able to get back into USA as L1. If not the pay in India should be really competitive that you’ll be able to pay back your student debts in those 5 years. \n\nIt’s not the result you were hoping for. But this is not the end. Don’t give up on CS especially if you have a knack for it. All the best. \n\nLastly the key to getting a job in current market is contacts more than knowledge. It’s not fair but that’s how it’ll always be. It’s hard being a junior engineer right now but few years will change that and your time will come",
            "Come to web3 it’s nicer over here! DM me",
            "Skill issue",
            "As a last resort I would try cold dm’ing builders on twitter, or freelancing. I know people who have gotten jobs through the former and I’ve floated by on the latter",
            "250 easy or medium?\n\nalso how are you doing them?\n\nyou could be spending time but doing things the wrong way",
            "Don’t give up…ever",
            "For future reference you don’t have to get an internship.. you can get a junior position and work it out with your company that you will be part time, and take less.",
            "What would you do that guarantees a job?",
            "Fix your resume",
            "Real question but why do you study abroad in the only country where you have to sell a kidney to study and then complain you don't have money anymore ?",
            "There are careers in CS outside the US. Don’t think of it as the only place you can work. Idk your home country but you’ll still find a job there. I bet there are CS graduates working in CS in your home country. It wouldn’t be easy and the pay won’t be astronomical but there are people who are doing it and surviving. \n\nGet rid of the thought that US is the only place that exists in the world. There are opportunities everywhere",
            "Absolutely right thing to do. Always have a backup plan. I studied abroad as well. Couldn't find a job there and in my home country either. I had worked in kitchens before so I got a job. I had to start my life with no money.",
            "With extensive lab experience, you should be reasonably well positioned to go into graduate school. In CS, grad school pays for you! And the opportunities improve a little. Grad programs are usually quite happy to take on international students too. You should also have teaching assistant opportunities at school, which will help you recuperate a few hundred bucks, most likely.\n\nYou just need to do well on the GRE and have a decent GPA. Best of luck!",
            "I don’t recommend giving up now. Based on the credentials you presented, you should be able to get at least something. Something is not adding up and you need to fix it. It’s not great market, but there are jobs - at least now.",
            "Create your own internship, if you're good at LC, it won't be hard for you to find a solid project to work on. \nYou have connections, make good use of it, ask your friends that have full-time to refer you, you can't tell me you know anyone that will graduate before you, you can't tell me you don't know anyone that will have a full-time after graduation either, if you're good and they know it, getting a referral won't be hard.\nIf you don't get a job right away, well that's fine, find a part-time job and focus on getting a full-time.\nIf you can even get a phone call or a 1 round, the problem comes from your resume, make it better, make use of your LinkedIn profile, make it good, market yourself, don't tell us that, post it on LinkedIn, if a recruiter sees that you did 200 LC question you'll get them in your inbox....",
            "Where are you from?",
            "Man, reading this was brutal, even more so because i'm going through the same situation. This world is honestly getting more and more fucked, people thought automation and globalisation would result in cheap goods which it did, but my stupid phone and $2 ramen doesn't make up for being priced out of basic necessities like housing and a job.\n\nMiddle class is going to be dead soon and we will all be modern serfs to the government and corpos just as planned. What a time to be alive!",
            "What does it say about our late stage capitalist society when going to college and getting employed in white collar work is seen as pipe dream, akin to being a rock star or NBA player, and in order to play it safe, you should have a backup plan in a job that destroys your body. \n\n20 something years ago, one of the most popular movies was American Beauty. In this movie, the protagonist is an average person, who due to the stability and income level his job provides, becomes extremely bored with life and looks for outlets to break him out of his boredom. This was seen as an extremely relatable film when it came out. In less than 25 years we went from \"oh boy, my life is so stable and great that I am bored\", to \"I went to school for a extremely in demand field. I did personal projects, leetcode, 3 internships, hackathons, and research, and I cant find a job. Guess I should turn to physical labor\".",
            "The real issue is prob that you’re international….sorry",
            "OP left out he’s on the FBI’s Top 10 most wanted list so that might be a factor",
            "As harsh as this sounds OP, employers doesn’t care about how many leetcodes you done. What they want to know is: how can this person make me money. Market yourself as such",
            "If you applied to 1000+ with your credentials and no interview somethings wrong with the resume. I understand not getting a job, or any offers, but a single interview there must be an issue with your resume",
            "I'm just gonna come here and say sorry and I wish you the best.",
            "well i have done over 1100 lc questions lots of development still don't have a job right now as many companies are becoming very toxic and are acting too inhumane towards freshers. I really hope market become better.",
            "The FUCK are these depression posts!!!!",
            "Why not apply for a PhD? you did plenty of research already so it should be possible for you to get in one. Also you get paid as a PhD student",
            "There are so many options still available for you:\n1. Get a job in your country (:?) \n2. You’re still in junior year ?\n3. Career placement companies exist, some with guarantee and pay options only after successful placement.\n4. Take up something else like data analyst/data visualization engineer/web developer roles vs software engineer - they are less competitive \n5. Startup!!! You have done hackathons and won right why not take it further?!!",
            "Does your home country not have IT/CS jobs?",
            "Have you tried doing freelance work? If you have the knowledge, and can actually write code maybe you should give Upwork a try. Build up a portfolio website with client work and work for yourself or use that when you apply for jobs. Any CS major can do personal projects but it’s the real world gigs from client that too will land you a position. It’ll take time but it’s possible.",
            "real",
            "Apply for a data science role at an insurance company!!",
            "Idk something’s sus here",
            "Hi. I feel you. I'm also an international student studying CS in the US. I'm a year behind you, a sophomore. I've applied to 350+ jobs for this recruiting cycle and still have nothing. Definitely not to your level, but I still know exactly how you feel. It really, really, sucks. I want to give up on CS as well. But, I want to share some things I've learned from other people during my process too. I've talked to many friends about this, and some things stuck with me and make the process a little less scary.\n\nFirstly,  you've applied to 1000+ jobs, done 250+ LC questions, gotten a 200-day streak, attended career fairs, coffee chats, and every single possible thing that I can think of, you have probably done. You are the most RESPECTABLE person I know (and there are some real hustlers at my school. But still, no one at your level). Your grind, hustle, and ability to just lock the fuck in to recruiting is insanely impressive. You got that fucking DOG in you and that goes an insanely long way. An uncomfortably large portion of recruiting is pure luck, and I'm sorry but I think you got unlucky this time. So many factors are out of your control, but simply the fact that you've come this far is so insanely impressive. People don't understand how much work, mental strain, and energy it takes to get to this point. You literally have so much ambition and motivation and everyone respects you so much for it. This is a testament to your character and how if you put your mind to something, you will put your 110% -- an extremely respectable trait. I know this might mean nothing, especially considering you're not getting internships, but I have faith in your future. I truly do. Internships are also way more competitive than full-time jobs, so be nice to yourself. Please!\n\nSecondly, the tech sector has gone to shit this year. Every big company is laying off huge percentages of their workforce. That comes with removing internship programs and cutting recruitment cycles. This year is truly a shitty year for tech recruiting and I'm really sorry it fell on your shoulders. I feel you, seriously. I tried so far to recruit for this summer too and I have nothing. But if you're blaming it all on yourself right now, please don't. There are more things we can't control than things we can. Be kind to yourself.\n\nI don't know how set you are on giving up. I'm not going to try and convince you to not, because it never helps. But, I just want you to know that I'm sorry you're going through this. We're young and we have a whole life ahead of us. I think we can be a little kinder to ourselves and realize that we are not fucked for life. We have a **whole entire life** ahead of us. It's okay if it takes a little longer to accomplish our goals. Hang in there.",
            "It’s tough right now, and even more tough for international students to land jobs in USA. It’s at the point where it’s not worth it to pursue a college/university education in USA or Canada if you are international student, the tuition and living fees are high and you may not see the returns on that investment. Better off studying in home country and try to land a job there.",
            "Honestly it seems like your resume isn’t any good. There is no shot with a half decent resume you get zero calls from a 1000+ applications. I wish you the best either way.",
            "Try to find the chance in it consultant companies",
            "If you're so smart then find a solution to your problem. Or was what your parents and everyone else telling you just hype?",
            "No freaking way 2 hackathons multiple research projects,250+ LC questions and a master’s in USA \nBro you’d get really high paying CS job back in your country (I’m guessing india) \nI know the market is bad but this bad damn",
            "Just go back to your country, sorry it has to be that way",
            "I’m probably in the same situation too… Very sad to hear.",
            "Don’t blame you. I am also giving up on CS. I did a bootcamp, took a few certs, and it took me 1600+ applications to finally find something. I’ll be going back for electrical engineering this fall. Way less saturation, tougher I think, but also a better long term option. \n\nAnd don’t beat yourself down for working a blue collar job- those people run the world and we need people who do that. But I do understand the frustration of years spent just to pivot. \n\nHead up man- brighter future ahead",
            "What's so bad about going back to India? It will benefit them to have smart people more than it will benefit us. ",
            "And CNN and other news outlets are writing articles of hundreds of thousands unfilled CS positions.",
            "Why would you not be paid in research labs? Most research experience would be paid",
            "Hey can you send your resume to me too",
            "You're Icarus who flew too close to the sun",
            "Some just don’t make it, it is what it is.",
            "Sorry it didn't work out for you. Hope you have better luck in your blue collar work",
            "Sent 1000 applications out.\n\nShow us your resume will you",
            "Why don’t you you switch careers?\nLook into other sectors?",
            "Do we have to be mark Zuckerbergs to land a job now?",
            "Do they not have software engineers in your country?",
            "This feels like a very egotistic person or a fear mongering post to clear out some competition. I don't believe for a second that you couldn't find a job with a resume like that. If for some case this was real this is basically a issue with him I seen some serial chatGPTers in my time. Do not fall for this while for international students it might be difficult it is not impossible, specially if youre an exceptional student.",
            "Please please don’t give up I am begging you continue your career even if it means to have debt even if it looks like there’s no light keep pushing forward if you can get a part time job start mass applying for internships but do not ever give up specially on your dreams you are smart you are gifted getting through 3 years of computer science is not an easy task please please please don’t give up",
            "You're applying for jobs in junior year? I don't really understand do you expect to get paid while you're still a fulltime uni student?",
            "You’re not international but you’re going back to your country?….. soooo, you’re not a U.S. citizen",
            "I was a big fan of the beta times. Already with CS 1 it went down for me... not to mention CS:Go and CS 2",
            "Hey man, don't give up. You literally are just one step closer to getting a job. Even going back home, you can probably get a cs related job near home maybe. \n\nIf you're not getting interviews, it may just be your resume. Go seek help from people cause it honestly sucks to have people who are genuinely passionate about CS giving up over people who are just here because of tiktoks and the trend of being a cs major.",
            "No u",
            "Don’t give up, you can still make a lot of money in cs",
            "Continue on, trust me. If you give up. It’ll be way harder. Instead of thinking “what if I fail.” Think about, “what if I succeed?” You won’t have a lot of free time to study the moment you get a job. Trust me. It’s harder the moment you get a job and your knowledge dissipates the moment you start a job. Keep on fighting. The moment you get your degree, you’ll notice a difference. Even if you don’t get a job in your field, you’ll have a major advantage over other workers by simply having a degree.",
            "Troll"
        ]
    }
]