[
    {
        "post_id": "1855tir",
        "author": "Free_Average9504",
        "title": "Guys...I fuckin did it",
        "url": "https://www.reddit.com/r/csMajors/comments/1855tir/guysi_fuckin_did_it/",
        "score": 1015,
        "num_comments": 82,
        "created_utc": 1701099646.0,
        "selftext": "Just got the call today, 85K starting, I've put out around 70 apps (I've been super busy with school, my dumbass decided 18 credits was a good idea; for internships I was doing 5000030202 apps a day lol) and have done maybe 50 leetcode problems total (rookie numbers compared to alot of you🥲).\n\n The interview process I had for my position  consisted of a hackerrank, and 2 behavioral interviews. No technical rounds other than the hackerrank, just a conversation about technical skills with some senior software engineer leads. I honestly prefer it that way.\n\nOverall, I think I've gotten invited to around...6ish interviews out of 70 ish apps? I have previous swe experience at a small IT company and also research experience (which I 100% recommend you to do research at least once if you have the time, interviewers are always asking about my research and think it's cool lol).\n\nI have two projects on my resume, and both are full stack. One was a class e-commerce project, the other was a passion project making use of APIs and Flask, nothing too wild. \n\nOh, and I go to a state school, started programming my freshman year with no prior experience at all, didn't even know what CS was until the end of hs lmao.\n\nAnyway, I really do wish those of you still looking the best of luck, i know how rough it can be and how desperate it can leave you. If you have any questions, or wanna vent, feel free to DM, I'm always lurking on here. \n\nCheers",
        "permalink": "/r/csMajors/comments/1855tir/guysi_fuckin_did_it/",
        "comments": [
            "cold apply? or referral/networking",
            "I only have 100 LC problems solved 😭😭 IM NOT HIM",
            "Now help me with referral bro in ur org.",
            "Hey, what is your gpa by chance?",
            "can u share about ur research? sounds cool",
            "Congrats!",
            "In the end, all it takes is just one 2 mins call!\n\n~Walt Whitman",
            "congrads bro, super-congrads.  you're on your way.  just buckle up and enjoy the ride.",
            "How did u start research if u don’t mind me asking? Cold emailing profs?",
            "How did you find research jobs?",
            "Congrats! Just out of curiosity, are you an international student?",
            "Congrats!",
            "Congratulations, may I ask in what location this is?",
            "85k??? how",
            "How do you get into SWE job my starting pay was 40k out of college its do demoralizing.  Im doing studying in beginning stages (CS50) but i hear all this doom and gloom of AI and SWE is dead.  Is there any hope congrats OP on the job.",
            "Congratulations!\nInternational student?",
            "congrats 🍾",
            "Congrats bro!",
            "Congratulations!!!!",
            "may i know which country you are from",
            "Congratulations!!!",
            "Congrats! bro do you mind sharing the company?",
            "Dude congrats that's awesome.",
            "Congrats! I’m envious!",
            "How far in are you into your degree?",
            "Just some old fashion hustle and bustle. Congrats!\n\nSwe gig?",
            "Congrats !",
            "Not too long ago I was targeted for suggesting the jobs still exist out there, but you needed to lower your starting expectations (location and pay).  That CS jobs in the future won't be too dissimilar to other engineering fields.  To start $70-80 is actually doing pretty good, and then after working for 15-20 years being closer to $200-$250k total comp is reasonable for the average engineer (ME, EE, Mfg., QA) so why would it be that different for CS?  With the rise of AI and assisted programing this is even more likely to be the case.  That seemed impossible to some with the idea that starting at $150-200k is normal, less is a huge disaster, and further out in your career it would be towards $500k.  I just don't see it working out that way unless you are a VP level or you are absolutely essential to the fundamental technical value of a company.  Everyone starts somewhere.",
            ">Passion project\n\nHow much of your interviews were spent expanding on/describing 1.) your projects and 2.) your research? What did the interviewers seem to latch onto about both?\n\nAlso, when you say \"Behavioral\" interview, what does that mean to you? I find that definition can range from \"this interview didn't have any whiteboarding, but i talked about complex technical topics\" to \"they had me talk to a bunch of teams to see which one I was most suited for, and asked me no technical questions.\"\n\nCongrats!",
            "Congrats!!! Happy for you 🎉",
            "My dumbass high school brain thought 70 apps meant you made 70 mobile Apps",
            "Just want to say congrats!!",
            "What did u research lol",
            "Can I see your resume?",
            "This is great, congratulations . Really happy for you",
            "Nice. Those are really good numbers with a very high conversion rate.",
            "Congrats!",
            "Congrats!",
            "Congrats bro!",
            "Good job man! Now remember, keep your head down, do your work, don't rock the boat, and get along with \\*EVERYONE\\* you meet.\n\nDon't share anything that can paint a target on your back.",
            "I’m about to finish my associates in cs you recommend anything?",
            "How do I find jobs that don’t require live coding interviews?",
            "Good on ya!!",
            "What kind of projects in your resume? Any prior experience?",
            "What state school do you goto?"
        ]
    },
    {
        "post_id": "1957w05",
        "author": "Wait_Why_Am_I_Here",
        "title": "Internships are going to get even harder to get",
        "url": "https://i.redd.it/5lhvxal863cc1.jpeg",
        "score": 1017,
        "num_comments": 77,
        "created_utc": 1705098826.0,
        "selftext": "Knew as soon as I heard about the layoffs that we would see something like this. I’m honestly shocked they bothered to send an email about it, lol.",
        "permalink": "/r/csMajors/comments/1957w05/internships_are_going_to_get_even_harder_to_get/",
        "comments": [
            "Story of my life since in live in the middle of nowhere anyways ",
            "They all will do the same. No interns this year.",
            "Do you think we'll be lucky enough to land unpaid internships working 100 hours per week with a cs degree or nah",
            "> The decision was not made as a result of business concerns\n\nTf is that some kinda flex 😂",
            "God. They were doing so well with the corpo speak up until the “we didnt do this out of business concerns” line. no fucking shit you guys did this out business concerns, what sane company lets go of nearly 1/5th of their workforce if theyre not in dire financials straits??? ",
            "LMAO looks like some tech companies are using the economic downturn as a chance to fire employees without as much public back lash.",
            "I just got that too, at least I applied to know what a rejection feels like",
            "Yeah... Like I'm not even sure how much of this is actually due to the market being poor ... I'm thinking this is all orchestrated on a massive scale.. to maybe hire new folks at cheaper prices... Everyone wants devs... But want them at like 20 bucks an hour..",
            "which discord internship was this?",
            "Got the same email :)",
            "We’re fucked",
            "not a result of business decision\" \n\nsounds like bs",
            "is this for all of their internship roles? i recently applied to one of their listings but haven't received this email",
            "How does Discord even make money? How many people actually subscribe to Nitro?",
            "that was kinda out of pocket of them lmao",
            "Awesome",
            "welcome to tech. should have gone to med school or CRNA school",
            "grind harder",
            "Isn't this just discord, I think fang is doing fine",
            "I don't get it. Aren't intern employed without pay ? Or discord pays their interns ?",
            "🧢",
            "I got that email as well",
            "Where are you even getting them from",
            "They are just following what Fkkfle etc are doing re layoffs. Discord didn't even have interns until like 2 summers ago.",
            "Hi guys, do you think referrals are important?"
        ]
    },
    {
        "post_id": "1c3jqxa",
        "author": "TheRealNexx",
        "title": "Devin Ai fake",
        "url": "https://v.redd.it/onb871jn4duc1",
        "score": 1011,
        "num_comments": 120,
        "created_utc": 1713064627.0,
        "selftext": "The company basically over exaggerating how capable the ai is when doing tasks. WE ARE SAVED BOYS ",
        "permalink": "/r/csMajors/comments/1c3jqxa/devin_ai_fake/",
        "comments": [
            "At this moment in time, It’s just a funding war. Attach yourself to the keyword AI , fuel out some propaganda on the social media and you get easy access to VC money",
            "Software when marketed and launched are 2 very different games, software when launched and actually tested in the industry are also 2 very different games. \n\nFor people to lose their minds because they saw one controlled and limited demo on Devin and suddenly start questioning their existence is beyond me.",
            "I called this shit a month ago, I want an apology for all the dms I got talking shit about me calling it a classic VC scam\n\nhttps://www.reddit.com/r/csMajors/s/U4HJ9Bh0lb",
            "Devin already mastering job security by breaking software and then implementing the fix",
            "It’s a wonderful day",
            "Another day, another win",
            "My friend got fired from a small tech company (like 7 people) because they decided to implement some AI software and only keep one SWE to check the code produced by the AI. My friend tried to speak to the boss that it’s bs (basically ChatGPT) and the boss wouldn’t hear of it. The one SWE they kept left after a week because the work load was too much. Told the boss that it’s easier to write new code than correct the ChatGPT one. They had another SWE do the same thing (I think they left after a couple of days). Now the company isn’t producing shit, behind on all of its projects and offering their past employees like 50% salary increases to come back. It’s so satisfying to see",
            "Why tf is the voice not syncing with his mouth?!?",
            "Voiceover of a guy talking to a mic. Reddit has peaked",
            "US: “AI is taking our jobs.”\n\nAI: Affordable Indians",
            "but but but those guys are super math geniuses...",
            "Whoever was dumb enough to think Devin would take our jobs from the start doesn’t deserve to get a job in this market",
            "IDK, Devin faking it til it makes it. Sounds like a normal software engineer.",
            "Literally just posted on r/cscareerquestions about how AI is probably a bubble over hyped by shit like this.\n\nTbh market might look much worse in a few years after the potential AI bubble bursting. Less investments + ex MLEs pivoting to other SWE roles will be interesting to see",
            "This guy is the least informed tech tuber I’ve ever seen.\n\nWhether you buy into the hype or not, you should use better quality information than this to justify your position.",
            "We staying employed",
            "Should've at least linked the original video [here](https://youtu.be/tNmgmwEtoWE?si=p_YWTvDFDA1H_lQM).",
            "No matter how many times you try to explain this to people who don't know a lot about the field, they will just go \"UR COPING.\" People who don't have much experience don't understand how little of the job is actually writing code.",
            "\"It just generated issues it could then fix itself later\".\n\nYeah, totally not like real SWEs.\n\nI knew AI developers were going to be like humans, but I had no idea they were going to be \\*\\*this\\*\\* much like humans.",
            "but but... the founder is a top LeetcODEr",
            "Called it out day 1 😂😂",
            "Why do even AI skeptics feel the need to always say \"despite all of that AI is groundbreaking teach that will change everything\". First of all, \"AI\" (ML) is old asf by now, its been grinding on for decades, the hype is new. So that is not how you define \"groundbreaking\". Second of all, we don't actually know what \"AI\" (ML) is going to revolutionize, but you can bet your ass it is not whatever is being hyped right now.\n\nWhy is everyone so scared to be skeptical of this \"AI\" hype bubble? This shit reminds me of covid (that debate of ANY kind was essentially taboo - full disclosure I was vaccinated several times. Too many people in this world are either dumb, spineless, or both.",
            "“or at least it’s capabilities were way over exaggerated”\n\nOkay, so this is the first iteration of it made in under a year. What happens when it’s capabilities aren’t exaggerated? And it doesn’t take a whole day for it’s tasks?",
            "it's all the next big buzzword. ai is sure to change a lot of things, yes. meanwhile, banks still run on cobol.",
            "I asked ChatGPT to help me fetch data with for a Pokémon and it told me that the pokemon (Tatsugiri) was a move 😭 and everyone thinks it’s gonna replace us",
            "Father baxate🤤",
            "If you think that Devin can't replace an average new grad SWE who doesn't even know like Docker you're already cooked",
            "Idk, i know a lot of swes that can’t even fix their own bugs in a week let alone a day, so that’s already a step up",
            "Just a matter of time",
            "I can't wait for the boomerang to swing back so I can shit on all the employers for what they did during this downturn.",
            "would a profit oriented company do that? lie about their product? /s",
            "even if devin is real and peform as expected as the demo, it is not going to replace any decent swes at all. I think they also claim their accuracy is below 20%. still don't see how AI can replace engineer in short term.",
            "Ze burbble",
            "Copium",
            "Creating foolish bugs just so you can spend a lot of time fixing them later? Sounds like Devin is closer to a real developer than I thought..",
            "It's less about the capabilities of AI today and more about its potential in the future. AI is one of those things that once it gets embedded into our infrastructure it won't go away. We have to get this right the first time or we will pay for it in the end.",
            "It's the same philosophy as Theranos and most other startups. Exaggerate capabilities, raise capital, and pray that the capital will be enough to build promised capabilities. Devin is on step 3... the outcome is TBD.",
            "Upvoted because Leb 👌🏼",
            "We are so back",
            "I think people are realizing AI is just a helpful tool and not replacing as many jobs as we think",
            "Yeah AI is a long way off but eventually it will take jobs... that's just the reality. Now in what time frame no one can guess at this point but it's much further off than people think. Right now we have a war for funding and the accomplishments of AI are being fabricated and praised by the media all for the sake of the investment community. It's not a problem today but it will be a tomorrow problem is truly the best anyone can say.",
            "hey i was making an ai ceo does someone want to invest 😂😂\n\n![gif](giphy|uFyxi4tV0NF7AKvysO|downsized)",
            "Surprise everyone! Another overhyping corpo saying their product is the next big thing. Go figure.",
            "I mean what did you expect. Cognition isn't a large company, to expect them to reach these feats while companies like google haven't wouldn't make sense. As smart as Scott Wu is it takes much more than few smart people to make something like this. I would assume the plan was to show Scott and the founders as really smart people which they def are like by showing the mathcounts clip and then show a bit of its capability so that it can make a name and get some funding and then when that was done they could actually start doing what it showed in the video.",
            "how to get access to VC funds: Slap \"AI\" in front of any existing job title",
            "@ I almost dropped out because of it 😂",
            "You are naive you don’t think the risk of ai replacement in swe is real in the near future",
            "I called this out many months ago about AI in general. I got downvoted to oblivion…",
            "Okay it hallucinates now and it takes over a day now. What happens when it’s fast and doesn’t take over a day anymore? And when it doesn’t hallucinate?",
            "This tiktok is almost as exaggerated and misleading as the Devin announcement itself.  \n  \nDevin did not \"hallucinate files\", it created files... 🤦🏻  \nThere is no \"mass hysteria\" around AI taking SWE jobs either. Here's the list of mass hysteria cases and AI is not on it. [https://en.wikipedia.org/wiki/List\\_of\\_mass\\_hysteria\\_cases](https://en.wikipedia.org/wiki/List_of_mass_hysteria_cases)",
            "This dude is delusional.\nIf company can profit from AI they will certainly use it and lay off people.\nDo you think your company care for you? Fuck no!\nThe entire picture is going to be different in 2-3 years.",
            "[deleted]",
            "why tf does his mouth move like that"
        ]
    },
    {
        "post_id": "1bn4hry",
        "author": "Antique-Raspberry551",
        "title": "Petition to change the “n” in FAANG to NVIDIA",
        "url": "https://www.reddit.com/r/csMajors/comments/1bn4hry/petition_to_change_the_n_in_faang_to_nvidia/",
        "score": 1014,
        "num_comments": 135,
        "created_utc": 1711339039.0,
        "selftext": "And no I won’t elaborate",
        "permalink": "/r/csMajors/comments/1bn4hry/petition_to_change_the_n_in_faang_to_nvidia/",
        "comments": [
            "yeah i know a guy, looking into this",
            "I been thinking about this",
            "Facebook is now Meta so it should be MAANG and yes, agree, why tf is Netflix still there. Also in a year or two might have to add another A for AMD if growth outlook for AMD is accurate. \n\nThe future is MAAANG",
            "Just a thought, why is Microsoft not included in this, even after being the biggest company by revenue.",
            "Petition to just rearrange ‘FAANG’ into ‘FAGMAN’",
            "Petition to replace the G with C??? Google is lowkey falling off (unrelated, Capital One gave an offer and Google ghosted me)",
            "Nah. We need to change the whole acronym. To MAGMA. There's no Microsoft in FAANG.",
            "Jenson Huang, CEO of NVIDIA, just said that AGI is 5 years away and that programming as a career will no longer exist.",
            "FAANG\n\nFigma Airbnb AMD Nintendo Gay",
            "MANGINA\n\nMicrosoft + Amazon + Netflix + Google + Intel + Nvidia + Apple",
            "FAANG, though originally coined as a term for growth tech stocks, is widely used in this sub as a group of high paying companies with great benefits. In that regard I don't think Nvidia should replace Netflix, which is known for having some of the best pay in the industry. A senior engineer at Netflix makes almost 2x what one does at Nvidia.\n\nThere's a lot of hype around Nvidia, AMD, etc - and they are certainly great places to be with good pay, but they are still a bit behind FAANG, especially Netflix, Meta, and Google, purely from a compensation and benefits perspective.",
            "Petition to have CS undergrads stop idolizing FAANG?",
            "FAANNG makes more sense.",
            "MANANA? Meta Amazon Nvidia Apple Netflix Alphabet.",
            "You want to change N to Nvidia, I want the N to be removed. We ain't the same.",
            "Where to put M.. Microsoft",
            "[deleted]",
            "What's wrong with Netflix? Get out Amazon.",
            "There are so many MAANG adjacent companies that fall under the same umbrella not just Nvidia. Plenty of good places to work for out there.",
            "also can we add OpenAI to this",
            "petition to pool all of r/csMajors money together and put a call on nvidia to hit 1000",
            "Or MAANNG",
            "I'm pretty sure now its MAANG",
            "FAANG doesn’t mean anything anymore most of those companies are trash especially the f and the n G is falling hard in their attempts to keep up while Amazon is just resting on the infrastructure laurels and Apple is a cult not a business model.",
            "Been a while since that. N will eat all the rest of the FANG for lunch I think.",
            "I mistakenly thought it was when people first started throwing around the term.",
            "FAANNG",
            "we can remove the N's. find a 3rd one to form NNN. Then we can have two acronyms. I won't elaborate either.",
            "Netflix pays almost double the base salary as Nvidia. Not sure that Nvidia will double in value again, but who knows?\n\nI support the other guy who mentioned changing the F to an M and adding OpenAI too.\n\nMAANNGO has a nice ring to it 😅",
            "make it MAANGO (meta, amazon, apple, Nvidia, google, openAI)",
            "Why isn’t Lockheed Martin int here somewhere?",
            "Should have been WHOCARES",
            "Granted",
            "Why not just FAANNG?",
            "Why no one consider Bytedance/Tiktok, just wondering",
            "How about FAANNG",
            "Yeah, I was thinking the same. Let me call my buddy Steve and see what he thinks.",
            "Should be Meta Apple Nvidia Google OpenAi : MANGO !!",
            "I feel Netflix should still stand. That company is too fire",
            "totally agree, nvidia is such a top tier place to be - heck better than most traditional FAANG atm",
            "No. Nvidia is a hardware company first, and an ai software company second ",
            "Nvidia pays literally shit in Europe compared to FAANG (e.g. 6 YoE salary at Nvidia = new grad salary at Meta/Google)"
        ]
    },
    {
        "post_id": "mxwspd",
        "author": "Conpen",
        "title": "You don't need to be passionate or excited about CS to succeed",
        "url": "https://www.reddit.com/r/csMajors/comments/mxwspd/you_dont_need_to_be_passionate_or_excited_about/",
        "score": 1011,
        "num_comments": 121,
        "created_utc": 1619310492.0,
        "selftext": "I wanted to share my personal experience as this is something that I had previously beaten myself up over. For some context, I'm a class of 2020 graduate currently working for a popular search engine.\n\nTo put it simply, outside of my courswork I've never given much of a crap about CS or anything going on in the software development scene. Unlike peers I've found myself jealous of, I never had the motivation to do anything dev-related in my free time. All of the projects listed on my resume were for class finals and I'm among the worst offenders when it comes to buying a project domain then never touching it. I have zero familiarity in anything modern and 'exciting' like React or app development or ML (or even github before I started work). \n\nMy senior year when I was still job-hunting I remember horrendously mispronouncing Kubernetes to a FAANG-bound classmate (who could talk to you for hours about Kubernetes and Docker and React, etc.) and thinking to myself that my disinterest in CS had killed my chances of achieving their level of success (that same classmate and I work together now).\n\nDespite my lack of motivation I found myself able to receive two solid offers due to the usual leetcode grind and having strong grades plus some years of mundane freelance Wordpress development. Looking back, I realize that my lack of passion never really held me back as much as I thought it did. I do fine in my job (which involves working on an in-house C++ framework) and I could learn something like Angular if I needed to. At this point I've pretty much accepted that I'm only going to touch code 9–5 for the rest of my life and I have plenty of other hobbies that capture my interest.\n\nIt goes without saying that passion for CS can go a loooong way for a new grad, especially if your interests and skills align with those a potential team or you have a knock-your-socks-off personal project to showcase. But for those of you who are in my boat, it's important to recognize that it's not a requirement.",
        "permalink": "/r/csMajors/comments/mxwspd/you_dont_need_to_be_passionate_or_excited_about/",
        "comments": [
            "Haha one of the best senior devs I’ve worked with couldn’t pronounce Kubernetes to save his life, it isn’t that big of a deal.",
            "This is the fucking way. Great job. Passion IS good, but this is completely fine as well. The industry should have a place for both.",
            "I'm doing CS later in age, currently in a post-bacc BS program, but I've learned over the years, that I don't want to monetize my passion and do it for a job. I would rather keep my passion as a personal hobby just for myself.",
            "As someone who’s increasingly felt this way as I’ve gone thru my degree, I’m glad I’m not alone",
            "[deleted]",
            "I never understood why people thought passion was a requirement for any job in the first place? It’s about work ethic and level of persistence first. Just do the work to get by and you’ll get a job, it really is as simple as that.",
            "Personally I don’t find software engineering interesting at all (stuff like APIs, frameworks, etc), but I find CS theory pretty interesting. I’d much rather learn something like data structures and algorithms in my spare time than learning how to make websites or whatever.",
            "I hear ya.  I'm good at my job, it keeps me interested, I make money that pays the bills and then some.  I have no desire to spend even a single minute outside of the 40 hours every week on it.  I'd rather spend my free time pursuing sports, acting, reading, etc.  And if it works for me or anybody else, so be it.  Your passion does not have to be your 8 hours in the office, and in many ways, it can be liberating when it isn't.",
            "Yep. Basically for any career. Sustainability varies depending on the person, company, and salary, but you can definitely get 120K+ TC while doing the bare minimum",
            "You give me hope",
            "This is very refreshing to read, I love CS and enjoy the field but I don’t have that “passion” some people do where they work for hours on code outside of classes and study everything about it. I don’t really have any of my own outside projects, I usually just practice on websites on hackerrank and learning new software like Angular in my free time. At first it makes you feel like you aren’t doing enough but I’ve realized that a lot of people are in the same boat. I may not have a bunch of side projects but I can talk about code and know what I’m doing. I was able to get an internship and job so I’d call that a win! I always think it’s important to have a good work life balance",
            "Of course. Un-passionate people can succeed in pretty much every field. Someone has to do all the boring work while the passionate ones innovate.\n\nNot a bad gig, especially when it pays so much.",
            "I'm personally getting in to CS because it's going to help me get in to med school and CS is definitely a great back up plan if I don't become a doctor (but I don't see the latter happening). Med schools just want to see different majors roll on their desks. I guess...whatever works for everyone. 😊",
            "Other hobbies are important!! :)",
            "I’ve never done coding outside of work, don’t know how to write a compiler, probably can’t do big-O anymore, don’t know any modern frameworks, etc. It’s never been a problem for me. Last time I got asked for big-O was a principal engineer screen at Amazon and said “I dunno, nlogn or something” (I passed).\n\nI just had an AMA for my org (gave notice this week) and was asked a lot about my career. Curiosity has probably served me better than anything else, also willingness to work on annoying things that nobody wants to touch and help out other teams with their problems. But I’ve never been a “hard” CS person (RIT isn’t the school for that anyways).\n\nSource: started at Microsoft in 2007, went to Google in 2011, now Senior Staff at Google, leaving soon to be a Staff engineer at Stripe.",
            "Bing?",
            "Let me guess... top school?",
            "I'm not sure where the expectation of passion even really came from, most jobs that people work aren't fueled by passion.",
            "How did you manage to get your resume recognized among the thousands of applicants with interesting side projects for your first CS job/internship? Do you feel that you got a low interview callback rate by applying online? Did career fairs/networking help you more in getting interviews, or did online applying help you get a lot of interviews? Also, how good would you say you are at Leetcode? Can you solve easies, mediums, or hards regularly? Sorry for asking you so many questions, but I'm curious to hear about your experience since I'm somewhat similar to you.",
            "Yeah software is just a generally good job. All you really need to do is solve the problems. Being dispassionate can actually make you a better engineer because you don't waste time over-engineering things to make them \"elegant\".",
            "Ngl your post made me feel better about this whole thing. I keep beating me about this when I'm basically in this situation you described and ig it made me feel a bit more relieved",
            "I’m not a CS person, but as a freshman who picked The ME program out of pure practicality and vague interest, this is very reassuring. Thank you.",
            "this needs to be talked about more cuz like i wish i had this mentality. i always felt my disinterest in CS   outside of a career setting would ruin my life lol. definitely has taken a toll on my mental state throughout my degree as well as the job search phase",
            "I don't intend to mock OP here but it is extremely disappointing to know that there are people in this industry who are not passionate about the work they do. Not saying that someone who is not passionate won't get ahead in the industry, it's just disappointing to say the least.\n\n&#x200B;\n\nI wish folks could work in the field/industry they truly care about.",
            "Hot take that I’ll probably get downvoted for, but  I dont believe you should go into a field that you’re not passionate about. I’m assuming you were pushed by your parents to pursue a degree that makes money, but I don’t believe this is the way.\n\nThis is how you end up bitter when you’re older and feel like you’re living a life unfulfilled. Sure the pay might be nice, but this job will now take up 1/3rd of your time for the rest of your life. And if it’s not something you really enjoy you should honestly take that into consideration.\n\nI know you already graduated, but I believe you should use these next couple years to determine if you should continue coding or instead follow your passions. You don’t want to be 40 years old working a job you hate and letting that bitterness and resentment affect your daily life.",
            "I really can’t bear leet code is the answer to jobs. Jobs should be based on projects you built and research you can do, not some canned answers on how to reverse a binary tree. But regardless, nicely done. (Hate the game not the player as they say)",
            "Gives me hope cause sometimes the thought of chasing a side project on top of school/work makes me want to commit unalive",
            "So what's the theory behind how you landed this job with no enthusiasm?  Why would a firm pick you over someone else? Were more motivated people already take by more \"prestigious\" firms?  Is there such demand that the market will take up any amount of supply that exists?\n\nAlso, what's the theory behind how you got good grades without an interest?  Did you take easy courses that gave out easy As?  How could someone with high motivation and interest not do as well or better?  \n\nConversely, I wonder if in some cases a lack of interest could actually be a boon because you don't come in with your own agenda and ideas.  You're totally willing to work without distraction on someone else's project, and just do as instructed.  A new employee who has particular interests, possibly even chasing the bleeding edge, might be too hard to make focus on daily tasks.",
            "This is fine. Just be careful that your skills don't go out of demand and you're still a competitive candidate for employment. You don't want to end up like on of those PHP guys today.",
            "ooh this is just soothing to read 😂 no need of being hard on oneself. Just live in peace ✌",
            "Give it another three years.",
            "90+ Free ML, Web Development, Data, Computer Science Books for All — Part 1 [https://naina0412.medium.com/90-free-ml-web-development-data-computer-science-books-for-all-part-1-a83ed888cef5?sk=2f143f5df943af0a8e086197fc16f59e](https://naina0412.medium.com/90-free-ml-web-development-data-computer-science-books-for-all-part-1-a83ed888cef5?sk=2f143f5df943af0a8e086197fc16f59e)",
            "[deleted]",
            "Thanks for the story, that's quite encouraging. What motivated you to get through your degree?",
            "Is freelance web development not dev related?",
            "hey OP. i’m a senior going into my freshman year of undergrad. i’m interested in CS, but i’m not sure if i just am bc of the salary. although i know solely chasing money is bad and unfulfilling, this gives me hope that if i don’t absolutely love the major, i can still go far and be content.",
            "How do you stand out applying to places with little to no outside stuff?\n\nI think I am in a similar boat, but just applying to internships and such I get so little response. I even have done 1 internship before for a reputable company, not famous or anything, and still I get ghosted time after time. I'm not sure what level of interviewee I am because I don't get very many.\n\nI went to university with absolutely no experience, but pull A's and B's in most of my classes, and in group projects I do more than my fair share objectively. I graduate in the winter so I'm starting to look for full time now but after failing to find an internship for two semesters I'm really worried. I see struggling peers that I help in classes and stuff landing internships and I can't help but feel cheated.",
            "."
        ]
    },
    {
        "post_id": "qz7tnj",
        "author": "None",
        "title": "How I Got Into Amazon as a 7th Grader",
        "url": "https://www.reddit.com/r/csMajors/comments/qz7tnj/how_i_got_into_amazon_as_a_7th_grader/",
        "score": 1001,
        "num_comments": 42,
        "created_utc": 1637538699.0,
        "selftext": "Hi guys! Last year I was looking for internships in 6^(th) grade and wanted to intern at Google. A lot of people told me that it was too late to get an internship in 6^(th) grade and I should have started earlier. I was very discouraged. However, someone told me to apply to Amazon. I applied to Amazon and was asked a few questions such as print \"hello world\" and what is a computer. After those two questions, I was given the internship! Even though Amazon is less prestigious than Google, I am excited to start my journey there and one day work for the big Google.",
        "permalink": "/r/csMajors/comments/qz7tnj/how_i_got_into_amazon_as_a_7th_grader/",
        "comments": [
            "Pfft, weak. I was born into Google and solving DP LeetCode hard with my eyes closed by the time I was 8 months",
            "I wanted to create a company called google, but I decided to create a company called Amazon.",
            "what a proper shitpost",
            "dude i wish i was in 5th grade so i could unironically do this",
            "Not too bad, unfortunately you’ll encounter those that already knew what you know through epigenetics passed onto them by their parents while they were still in the womb and got themselves a reputation/ made a name for themselves by going back in time to a year before they were born so theyd start out on top by the time their birth certificate is printed.\n\nBut I think you can do it OP. Google is just another stepping stone too, dont forget.",
            "Amazon",
            "Grind LC and shift to google",
            "That’s a bit late, but don’t get discouraged. You will catch up! \nJust focus on getting to a managerial position before having a beard. Once you hit 18 it’s tough to find someone wanting to invest in you for such a short time left.",
            "[removed]",
            "Good shitpost, keep it up makintg shit pots like this my man, very entertaining.",
            "[deleted]",
            ">and what is a computer.\n\nAre you sure that was Amazon and not Apple?",
            "Damn...it would be a nightmare to have our families be friends",
            "I’m dead 🤣",
            "Lol loser. Imagine getting into Amazon and not google\n\n*Btw I'm a struggling first year university stupid*",
            "Thank god I read it through. I was soo depressed after reading the title. Now I’m hella depressed!",
            "What a fucking warrior. Spare us already kid.",
            "7th grader already in faang down talking faang. im just gonna go die in the corner.\n\np.s you’re amazing and keep up the good work!",
            "My first words were fizzbuzz get on my leveel",
            "Do your self a favor and quit before you turn into SDEII and jump to Microsoft."
        ]
    },
    {
        "post_id": "1clmiqo",
        "author": "NFeruch",
        "title": "Holy shit get off reddit and go build something that will get you a job",
        "url": "https://www.reddit.com/r/csMajors/comments/1clmiqo/holy_shit_get_off_reddit_and_go_build_something/",
        "score": 997,
        "num_comments": 167,
        "created_utc": 1715010942.0,
        "selftext": "I’ve been working on my own “business” for the last 3 years now, that realistically isn’t going anywhere (I have 0 users), but I’ve learned so much just undertaking it.\n\nALSO for my 2 internships, I can confidently say that me talking about this business and all that I’ve learned, during the interviews, is literally what got me the job.\n\nYou all love to fucking complain but have just a calculator app as your only project. Or a shitty fullstack app that looks horrible. GO BUILD SOMETHING GOOD OR ELSE YOU DONT DESERVE TO GET HIRED",
        "permalink": "/r/csMajors/comments/1clmiqo/holy_shit_get_off_reddit_and_go_build_something/",
        "comments": [
            "why won’t recruiters talk to me about my suction auto blow device I made, explain this to me OP!",
            "No I will continue to ruin my life thank you very much",
            "Plot twist: OP is unemployed and probably just got done watching Primeagen. Lol",
            "Yea but i paid $16000+ for my 6 month bootcamp that should prove my calculator app is amazing but upon graduation I got no job. I deserve a 6 figure salary with no degree or experience!",
            "Somebody had to say it sooner or later. \n\nI’ve been doing everything from:\n- my own code projects (page replacement/scheduling algorithms. Google them. It sounds impressive on a resume. Plus it’s easy to understand)\n- writing risk analysis reports on random Wireshark packet captures (Wireshark has sample packet captures on GitHub)\n- also writing security audit reports on random websites like Microsoft, Tesla, and Coca Cola’s main site (themarkup.org/blacklight does all the work for you)\n\nWhat I haven’t been doing:\n- crying on reddit about how internships are hard to get\n- sobbing that my resume doesn’t have a lot of experience on it. \n\nMy GitHub is looking very nice. I show my ability to code as well as my ability to write coherent sentences in my reports. You guys can copy this easily. Stop crying on reddit.",
            "Yea I built a very detailed project in uni and everyone was like why are you doing that all you learn here is irrelevant.\n\nTruthfully I am a hard worker and I figured I could only learn stuff by putting myself under some stress\n\n\nFuck tkiner in python (the pack and grid are horrible) but I am happy I forced myself to learn them",
            "Couldn't agree more. \n\nI got my first job mostly because of a to do app but on steroids. \n\nFull authentication, email verification, a \"feed\" like TikTok or insta to see other people's to-do, deployed to azure with docker. \n\nI honestly don't even know what I would have talked about if I got an interview without doing that project.",
            "My first reach-in years and years ago was from building a game AI middleware as a personal project and putting a silly demo on ~~youtube~~ Google videos. It looked stupid, but the AI lead of a major game studio saw it, flew me in for a visit and offered me a job.\n\nedit: it wasnt youtube, it was google videos *before* google bought youtube. now get off my lawn you darn teenagers.",
            "But muh DSA",
            "I'm an hiring manager (small startup) and 100% this, if you went out of your way to build something cool on the side, I will try it out if it's on your github and it leaves a great first impression",
            "The problem with this sentiment is there are some of out there that have contributed to research fields, have active GitHubs with many stars, thousands of lines of code on our projects and still can't find a job. That's on top of having a college degree and some work experience.\n\nI'm not saying it's a lot of people but we do exist.",
            "DUDE JUST GRIND MORE SIDE PROJECTS BRO SOMEONE WILL NOTICE.\nYOU WON'T WORK AT SAVE MART FOREVER.",
            "Build something good, but OP built something with 0 users.\n\nMust be something really good you’ve built to attract 0 users.\n\nSike nah, on the upside OP is right being able to articulate the process of undergoing running live apps and what it takes to manage one.",
            "Many people here probably thought doing leetcode will make them software engineers.",
            "I’m trying man it’s hard. Figuring out what to do is a whole task of its own and then there is figuring out it It’s doable, figuring out if it’s worthwhile, figuring out where to start. With school at least I had a clear set of assignments to get done but now without that it’s really hard figuring out how to make the best use of my time and the hours go by so fast I’ll sit down at 9 and red am article and suddenly it’s 5 and I gotta go to the gym and go make DoorDash deliveries to survive",
            "I concur.",
            "SIR YES SIRR!!!!",
            "[https://github.com/Remiyyah](https://github.com/Remiyyah)\n\nSomeone rate my GitHub. Centered around web development. \n\nTell me what I’m doing well, and what I can improve on. \n\nAlso, full stack project ideas that I can dip my toes in.",
            "I can’t even get off bed to do my homework",
            "Currently building my of page right Now",
            "Last year we hired a junior dev with zero professional experience because he took the initiative to write an app to help him and his coworkers on a construction site - our team was notified, as we write software for the same company, and we were so impressed we hired him within the week to join our team, which he was happy to do. Such people are the best software engineers in my experience.",
            "🤕💀☠️",
            "Ok",
            "Yep",
            "https://github.com/Rishabhvrm\n\nCan someone provide feedback on my GitHub as well? \n\nWhat am I doing good? What can I do better? Any feedback is appreciated. \n\nThanks in advance, much appreciated\n\nEdit: while you’re at it. Could you please check out my resume and LinkedIn. Would really appreciate it. Been trying hard to get a full time job",
            "Go to hackathons? learn marketable skills? nah. I think i’ll moan",
            "As SWE with 11YOE listen to this guy.",
            "yea i think my project experience got me through all the behaviorals at least",
            "Stop helping them. Bring back gate keeping. \n\nIf they can't figure it out on their own, then less competition for us.",
            "> a calculator app as your only project\n\nHey, nothing wrong with a calculator app. Just give it an appearance.\n\nI'm working on a calculator app, but it's supposed to look like a heart. There is not a tutorial anywhere to make a functional heart-shaped calculator on a webpage, so I'm using StackOverflow, documentation, and ChatGPT (for advice).\n\nAnd then, there's making it look, you know, pretty rather than just a grid of buttons on top of a heart shape.\n\nTutorial projects can be fine. Just put a spin on them. Once I get the calculator figured out, my next project is a weather app with a Hello Kitty theme (or a floral theme if copyright is an issue). Granted, some people might still dismiss these kinds of projects, but eh. It makes me happy, and I'm learning something.",
            "This is what I was saying, this industry is getting filtered out... The people who are looking for the easy... Go to school, get a six figures job real quick.. those days are gone... Of those who want to hustle and grind... For whom this is What they love... They're willing to put in hundreds of hours in perfecting their craft... Those are the ones going to be patient enough...",
            "Any other career doesn’t require this bullshit OP is pushing. Engineers aren’t out building bridges to show off in interviews. Doctors aren’t performing surgeries in their free time. Aspiring accountants aren’t spending weekends doing free work for clients. \n\nThis bullshit of your life has to revolve around coding needs to stop. No, we shouldn’t have to spend hundreds/thousands of hours in our free time building a website just for the potential of landing a job.",
            "What is going on!",
            "I am not a cs major. Just an I.T Tech. \n\nI run a self hosted docket server with many containers. I wonder if I could perhaps fork an existing open source project, add on to it and then charge a subscription fee for it as a SaaS.\n\nIs that even legal?\n\n\n\nBut an",
            "Whats the tech stack?",
            "But muh I'll do DSA and I'll land a high paying job at FAANG 🤓🤓",
            "Absolutely this, went from being a real estate agent to my first developer job by building a software startup from scratch, best way to learn and best portfolio project",
            "it's over bro. im dead ",
            "just have mommy and pappy pay for 3 years fucking around. super easy",
            "Can you suggest something not so shitty",
            "any suggestions? from anyone in the thread because I really don't know where to start",
            "no. go build something that makes money.\n\nif you build a simple website based application, and can get clients to pay $1000 a month for it, then you only need to get 100 clients to be making $1 million a month.\n\nif you can do that in one to two years the majority of companies will not only consider you for entry level positions, but may even hire you full time; especially over people who built products which never were able to attract paying users.",
            "Can someone rate my Github and portfolio website? I'm focusing on web dev and game development (Roblox)\n\n[https://github.com/singharaj-usai](https://github.com/singharaj-usai) [https://www.singharaj.com/](https://www.singharaj.com/)\n\nThis is my Roblox game I'm working on long-term [(23) Build and Race (DEVELOPMENT SERVER) - Roblox](https://www.roblox.com/games/9055123338/Build-and-Race-DEVELOPMENT-SERVER)\n\nI need to update my portfolio website later haven't had time because of final exams and college classes but yeah I have time now to work on these stuff since class is over\n\nAre these projects entry-level ready? And what should I improve on? I have a live project old Roblox revival website I own called Vectra but I can't open source the code because of security reasons it has a bunch of propietary stuff mainly due to copyright and api keys  [https://www.vectra.lol/](https://www.vectra.lol/)",
            "Finally someone said it. \n\nUnderstanding how CRUD works != you getting a job.",
            "This would require passion for CS. Which most people in this sub seem to believe is negligible because money is cool. It’s honestly so insulting to those of us willing to work for our dreams.",
            "I dont think companies care about your business? Wouldnt they think of you as you may leave and start another business so wont be permanent? They only want engineers that make the job done and dont get sick of work they are thrown at? All that innovative teams is mostly shit. Though if you gained technical knowledge doing that work it for sure must help but this is also stupid because most of the time you will learn company specific tools and codebase and maintain it",
            "Op sounds so fucking insufferable",
            "True lol ask new grads to put the simplest project with a frontend, backend api and db on AWS or Azure with a CI/CD pipeline and watch 90% of them fail. Why a company would hire and spend time training someone who doesn't know how to do basic things like that is beyond me."
        ]
    },
    {
        "post_id": "16djxxm",
        "author": "Polarisin",
        "title": "I got humbled 💀",
        "url": "https://www.reddit.com/r/csMajors/comments/16djxxm/i_got_humbled/",
        "score": 991,
        "num_comments": 86,
        "created_utc": 1694201857.0,
        "selftext": "The way I went from wanting to only work at FAANG or big tech companies exclusively. To now just wanting any job at any decently paying company. This job market really humbled me.",
        "permalink": "/r/csMajors/comments/16djxxm/i_got_humbled/",
        "comments": [
            "It’s good to be ambitious, just try not to become an a-hole when you make your way into FAANG tier companies.",
            "Stay humble but stay motivated. It is not wrong to wanting to work at some top-tier company as long as you work arduously for the goal and don’t become a dick once you make it. Good luck!",
            "I'd work for spit and insults if it meant a great letter of recommendation for when I'm ready to move on and move up.",
            "> decently paying company\n\nNah, not humbled yet.",
            "Being humbled like this is never fun, but it is an important part of personal development. I actually look back at my past “humbling” experiences as those that changed me for the better.\n\nKeep applying. You’ll get something eventually and remember that you won’t have to stay there forever. The first job is usually the hardest to get.",
            "I keep saying FAANGS are basically like applying to Ivy League Schools in the 2020s. If you only have a certification from FreeBootCamp.com they arent interest. Nowadays you need your BS in CS or SWE, several relevant and well-made projects (not something like Tic Tac Toe on console), internships from smaller tech places.",
            "If you're only getting into programming to work in one or two companies, my recommendation would be don't get into it at all.",
            "At least you haven’t hit the point where you will settle for an unpaid internship yet.",
            "Never let anyone shame you for wanting the top. Just have the insight and skills to break up your goal, and alternate between execute and plan until you get it. Grateful but hungry.",
            "I honestly don’t understand the obsession with *only* wanting to work at MAANG companies. There are tons of great companies with great benefits. There’s nothing wrong with MAANG but if you’re not willing to try other companies then how do people expect to obtain such a role without prior experience? Unless you have a lot of experience/projects or come from top CS target schools then you’re in for a rough time. \n\nMy friend at Google wanted to refer me but I declined because 1) I know I do not have the skillset to pass the extensive interviews just yet so I don’t want my lack of ability to look badly on her 2) it seems really stressful and 3) I’d rather work at other companies beforehand. Heck, even with my first internship I was happy with whatever as long as it was somewhat relevant to cs (business analytics). Honestly, there’s nothing wrong with not working at a MAANG company.",
            "So true man! 2023 hit me hard.",
            "FAANG is over rated. Though the paychecks are not….",
            "Depending on what you mean by \"decently paying copmpany\" you havent been humbled yet.",
            "The more time that passes the more I \"Juat want a job\". Maybe I can try for FAANG after a couple years, but I've pretty much given up caring in terms of  new grad",
            "Get a job, get experience and work your way up.  Waiting for a company to court you or putting your eggs in one basket for a handful of companies is a quick way to end up living in your car.",
            "how to get the first job?",
            "Join the club. I come from an exceptionally rich family and I’ve done everything I can to get out of that shadow by starting a computer science career, but I give up. I was laid off, I looked for a new job for an entire three weeks and decided to just move back home. My parents will gladly finance my lifestyle, a trust is already in place.",
            "A decently playing job is humbling? Is this really the attitude of this sub? Is that why this sub is always complaining?",
            "I have honestly never understood why someone would want to work for a FAANG or anything adjacent.  What's so attractive about being a cog in a machine like that?  Is it just the money?  The idea that it automatically attaches some status to you because you made it through the interview process?",
            "Could you please share your profile? I am struggling to find an internship rn",
            "It’s good to be humbled because a lot of you CS mfs really need a wake up call.",
            "Thanks for this information don’t know how I could if lived without it",
            "Fr i agree",
            "So damn true",
            "Good. Lol",
            "Lol get reality checked. Don’t be expecting six figures",
            "honestly faang has gotta be the easiest to join as a junior engineer. They got the biggest pipelines in the nation, you got the intern pipeline and the interview is so much easier. I remember graduating and my only offers were a somewhat hot startup, google and facebook. Good old days.",
            "One of the more important skills for a dev is self awareness. \n\nRemember it isn’t just about the current market. This field can humble you at any turn",
            "Wow. Same here man. Ended up applying to over 300 places before finally got a job with an acceptable salary for me. Unless you had an internship set you up it’s really a war zone out here. Keep at it though. Best of luck.",
            "These are my words man. Same here."
        ]
    },
    {
        "post_id": "191mz1c",
        "author": "kristhed",
        "title": "Found in the wild",
        "url": "https://i.redd.it/3pq9sl4lc8bc1.jpeg",
        "score": 997,
        "num_comments": 165,
        "created_utc": 1704725648.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/191mz1c/found_in_the_wild/",
        "comments": [
            "Alternatives to leetcode:\n\n- Long takehome assignments\n- filtering by college\n- filtering by GPA\n- filtering by prestige of previous jobs/internships\n- Roblox-style games or brain teasers\n\nGiven that people hate all of that, what exactly would the ideal interview process look like?",
            "Whoever said that is giving/receiving the wrong kind of technical interviews.",
            "Another way of looking at this could be that if you are capable of doing bicycle tricks, you most likely can be taught to drive. Although i agree interviews can be a bit more related to the job.",
            "Hiring manager here - tell me what you'd like to see as an alternative to my interviewing you technically.",
            "Leetcode is straight memorization a med school student could prob pass a medium after a few weeks of studying",
            "Nah, it's like testing a driver on their vision. If you fail the first test, what comes after would probably also pose a challenge.",
            "This analogy is a joke. LeetCode is a decent way to gauge a lot of things. How familiar they are with the language, ability to work through an unfamiliar problem, communication skills, how they deal with pressure.",
            "More like testing a delivery driver candidate on his ability to pass random, well-controlled, elaborate driving tests. Can be a good indicator depending on the job and how you conduct the test, but can also be completely irrelevant and unrelated to actual delivery performance and competence.",
            "I feel like most of the times I hear this debate people either suggest that leetcode doesn’t test actual job related things or that 5 day long take home projects are too difficult on the candidate. I don’t think it has to be either or. Probably the best way to fix this problem is just to merge both solutions. Have candidates implement a small feature for a random app (not direct work for the company) like a pagination component in React and an endpoint for it (assuming the company uses React and whatever backend service) and have them talk through the process, why they made certain decisions on the backend and frontend side, what kind of libraries they might use, etc. The difficulty can easily be adjusted by the type of feature you chose and you’ll also have a dev there to help with pair programming and support the candidate. I find it hard to believe that most candidates would easily pass this type of interview when you can modify the difficulty and you’re testing for a good amount of things. \n\nThis isn’t a new idea btw: https://techcrunch.com/2015/03/21/the-terrible-technical-interview/amp/",
            "\"technical interview\" is like any interview requiring coding to be completely? i heard code is important to engineering software.",
            "What alternatives do you suggest?",
            "20% of developers do 80% of the work and 80% of developers hate technical interviews...\n\nNot because it's not popular that it doesn't work.",
            "What an absurd statement. Makes no sense. Why would I not test SWE candidate based on their technical knowledge and ability?",
            "People believe in leetcode like they believe in online IQ tests. It should be used as a high level screener at most. It isn't an accurate skills assessment. \n\nIf you don't code for a living then you shouldn't be directly assessing my coding qualifications. E.g. do not ask people questions you only have a tenuous grasp of. \n\nYou should be asking people about their projects and diving into specific technical details that demonstrate their overall aptitude including troubleshooting ability, knowledge of data structures and algorithms, etc. \n\nContrary to what others here have said, you absolutely cannot BS your way through a technical interview with a qualified interviewer. \n\nHow are you going to BS me when I will dive into the weeds until I gauge your true comprehension? Getting BSed simply means the interviewer is bad. Period. \n\n90% of companies I have interviewed with fail at one or more of the points above. That is why hiring in tech sucks.",
            "Ah another someone who has learned to write \"console.log('trolololo')\" and thinks algorithms and data structures - you know - the fundamentals of computer science don't matter for software engineering.   \n\n\nFuck the fuck off.",
            "we should filter by looks... make cs sexy again",
            "Why the hate on sweden :/",
            "It’s really weird to me that people are so opposed to DSA interviews. It’s genuinely not that hard. Just learn the secret handshake and get the job."
        ]
    },
    {
        "post_id": "1btchwf",
        "author": "throw-away-doh",
        "title": "There are too many people taking CS as a major",
        "url": "https://www.reddit.com/r/csMajors/comments/1btchwf/there_are_too_many_people_taking_cs_as_a_major/",
        "score": 990,
        "num_comments": 554,
        "created_utc": 1711998447.0,
        "selftext": "To quote The Atlantic:\n\n\"Last year, 18 percent of Stanford University seniors graduated with a degree in computer science, more than double the proportion of just a decade earlier.\"\n\nI graduated with a CS degree in 2001 - not ideal timing but it worked out ok.  Back then the majority of people I studied with and met in industry had been enthusiastic about computers as children. For example I learned to program rudimentary BASIC on the family ZX Spectrum by copying down program listings from the back of magazines before I was 10. That was not uncommon.\n\nThese days I see a lot of young people coming out of university who don't have a passion for the subject, they weren't into computers before university, they just see it as a well paying career. Having been in the industry for a couple of decades now it is very clear which of those two groups people I work with fall into.\n\nI worry about these people and their futures. Not only is the market saturated, it seems to be saturated with people who don't love the subject and are not especially talented with it.\n\nBeing a professional software engineer is hard. It can be extremely emotionally and mentally taxing. Not everybody has the mind and personality for it. If you are just heading off to university now or still early in your education and you aren't loving CS, I encourage you to seriously consider changing subjects. Your future self may thank you for it.\n\nEDIT: You are a salty bunch. Good luck out there.  \n\n\nEDIT 2:  \n\n\nA lot of you are misunderstanding my use of the word passion here.\n\nFor the most part people thought I meant something like - you should be passionate about your work not just be in it for the money. But that is not what I meant.\n\nWhat I meant is most of you suck at software engineering. You had no interest in understanding computers outside of making money from it as a career and it shows in the work you do.\n\nI used the word passion but I could easily have exchanged it with curiosity. In my experience it acts a proxy for competence.",
        "permalink": "/r/csMajors/comments/1btchwf/there_are_too_many_people_taking_cs_as_a_major/",
        "comments": [
            "As much doom and gloom I have around being a 2024 CS grad, seeing all the kids in my senior design class that obviously learned nothing beyond creating a linked list and a for loop does make me feel better",
            "This is only going to continue to get worse until people start realizing how competitive these jobs really are. We are having an experience “inflation” and education “inflation” due the large pool of applicants to choose from. \n\nBasically companies can require a higher standard of applicants just due to the fact that they have so many to choose from. \n\nThis will lead to lower salaries in the future as well since if you aren’t willing to work for that salary someone else will.",
            "No one says this to finance, accounting, business majors . We are not in healthcare. We don’t save lives. Why tf do we have to be passionate? I’m passionate about having a good paying job to support me and my family. My passions don’t relate to any job.",
            "Ok",
            "Why did you post this if you’ve been graduated for 23 years? What’s the goal of this post? I’m calling shenanigans on this whole thing",
            "Well I got a CS and a Math degree in the mid 90's.  And this post is obnoxious and pretentious.\n\nNot every person earning a CS degree will be a developer.  Not every person is PaSsIoNaTe about their major.  The only thing you should watch when pursuing higher ed is debt because that will be life and career limiting.  Life is a journey, not a destination.",
            "I see your attempt at eliminating the competition failed... We try again tomorrow at dawn.",
            "bro is trying to throw off the competition 😭\n\nI agree the CS degree has become saturated but it really does not require any more special “passion” or talent than any other technical white collar job does. \n\nIt’s also not that hard. Being a software engineer isn’t like being in an adult daycare like some TikToks had people believing but it still is not significantly more grueling than a typical corporate job. Most people prefer this than back breaking physical labor or 80 hour work weeks in medicine.",
            "Started college a decade after you, and even then CS was such a niche major that the majority of my classmates were not a part of. Most people I knew were majoring in business or the humanities. There were only a handful of CS people I knew, and they all were extremely passionate about computers and had been programming for years as a hobby. They also stereotypically were “geeks”. I still remember my dad wanting me to take a CS class back in high school and I was not having it at all, because I thought it was for “geeky losers”. CS also just wasn’t as prestigious as it is today, because while it used to pay a decent upper middle class salary, it wasn’t really a field people were getting rich off of unless they founded a company or worked for Google. \n\nNowadays though, it seems to pay so much. I never would have known back then the earning potential of today. So many people making hundreds of thousands of dollars with only a bachelors degree. New grads making $150k-200k or even more in some small cases. Everyone wants to follow the money.",
            "has anyone else noticed most of these \"passionate\" people about CS make no money?\n\nlike the money-obsessed leetcode grinder with 2yoe makes $500k at HRT and the passionate cs lover makes $120k after 20yoe",
            " Best to educate young people CS could not land them a job , but nursing does , so shoot 2 bird with one stone",
            "I have a passion for CS, but I really don't understand the gatekeeping of CS for people who were programming from the time they were kids. I didn't start seriously programming until I was in college. I had to take a CS class to realize that it was something I wanted to do.  \n\nIf I had listened to people like you, I would have never discovered it. The people who really don't belong will wash out and do something else anyway. We don't need people harping on \"CS is oversaturated\"! Computers are the future of our world.",
            "If not CS, what else? \n\nTo be honest, if you do not have anything that you are passionate about *that makes money*, CS is still the best thing to do, *If you can get your foot in the door.*",
            "Wtf are you doing in a csmajor sub anyways if you graduated already a decade ago💀💀\nI’m thinking you’re either lying or just trying to gatekeep",
            "Based on your graduation date, it seems like not too many people were into computers before your university days either - or they just didn't have big enough houses to dedicate a whole room to computer hardware. Hard to believe you were passionate about dial-up speed and look at you, thriving. 😂",
            "> Being a professional software engineer is hard. It can be extremely emotionally and mentally taxing. \n\nIt is April 1 I get it. Been in the field since 2006. Never considered it taxing. Fun and creative, yes. Well paid yes. Taxing ? No.",
            "Best to keep encouraging people to study CS and tell them that 99% of the applicant pool is uNqAlIfIeD, \n\nBUT YOU, ARE AMONG THE 1 PERCENT !!!\n\ncause I'm curious to see what actually happens to the market if the numbers of CS degree holders continues to rise, while software jobs are sent overseas to more cost effective locations for companies that aim to please their shareholders",
            "\"I graduated with a CS degree in 2001 - not ideal timing but it worked out ok\"\n\ntf u talking about? ungrateful ass. graduating with a cs degree in 2001 was more of a goldmine than graduating with it in 2021. in 2001, you had literally zero comp compard to today i promise you.",
            "why is co2001 in cs majors",
            "Pov: OP just started studying CS and wants to get rid of some potential future competition.",
            "Womp womp 💀 passion doesn’t pay bills. The market is too bad right now to be passionate. I’d like to not starve thank you",
            "Please retire already. No one wants to work for/with people like you.",
            "Whats wrong with wanting a well paying career tho?",
            "Lol sorry bro some of us want to not be in poverty anymore. I got into this major for money and I received many offers because I put in the work",
            "Worried about your job with over 20 years of experience? Cope harder.",
            "Overall we have had high and growing demand for CS in the past 40 years and so guess what ? The share of people studying and majoring has grown too and more and more get a job there.\n\nThere been a few years recently were demand was so high and salaries became crasy. More people than ever entered the field and the Tech sector over hired. Sometime they didn't even have work to do for the newcomers. Covid pushed for even more hires.\n\nSince 2 years we see the excess of the past years being reversed. Maybe there even more graduates than usual but also we got a few hundred thousands being laid off. Most of them got a new job (unemployment for CS is even lower than overall unemployment).\n\nBut people that just got a diploma, especially if they are just average have much more difficulties finding a job.\n\nSo now people don't speak of bootcamps anymore (while many could benefit to have some practice on top of their diploma) and some people start to consider other fields... So we prepare the next step that is not enough people in the field again.",
            "Pretty sure most Doctors don't really care about their jobs nor did they dissect insects as a kid because they loved healthcare.\n\nI get what you are saying though that lots of people are going into it thinking it's easy money. They will get weed out in college or after college, don't worry. I have a passion for the field and was the kid loving computers but I don't expect everyone to be like that. You can get the job done being less passionate about it than I am. People who actually suck at it or hate it will do something else eventuailly.",
            "you're just salty people are making a buck",
            "How is nobody (on the feed I’m looking at at least) talking about the fact that not all these grads will pick the same sect of CS or even be *good enough* in their sect to get a job? Lol\n\nNot everyone likes software but that’s what they chose as their major so they did just enough but that’s not enough for a job in most markets, not just the current one lol and that person may or may not be willing to put in the work to dive deeper into something they might like more like cybersec \n\nTaking CS as a major doesn’t mean shit unless your college starts limiting spots",
            "being a “professional” SWE is not hard lol, so many dumbasses are out here in FAANG, me included. The hard part is the recruiting part, but once you land the job its half work it took to get there.\n\nyou dont need to like computer science to be a swe, thought it helps but a job is a job. \n\nnow is swe the best job in the world? no but if u want to get paid 100k with decent hours, yeah so study hard and land the job. computer science is a soft science compared to electrical or chemical engineering. those are hard majors and they get paid less. comp sci is literally just a made up languages that follows logic and you throw in a couple of algos. \n\ni really dislike a majority of swes who think they are geniuses, are solving the world’s problems, and think what they do is complicated. like bro u work on google ads. chill. \n\nany job that is paying 100k starting uses the same skill set as us, and guess what after 5 years they make 3x what we do.\n\nnow if ur a quant researcher/swe, then you are actually smart(and probably well connected), but if u are sweaty cs kid(i am one as well), chill out and congratz on your 100k job. theres no need to overcomplicate this major and make people feel like they cant do this even though you can.",
            "If they don’t have the passion and you do, then you will excel easily and you will dedicate more time and have better projects because you don’t mind being doing this all day because you love it. No ? So in this case you will be safe and will have jobs perpetually ? So what’s your complain ? You should be doing great",
            "You graduated in 2001 so I assume you’ll be wiser but you saying “young people coming out without a passion for cs” is crazy. \n\nDo you think lawyers go into law cus they have a passion for it and love working 60-80 hours ? Maybe, but not all. Some just see it as a lucrative career. Same thing applies to CS and ANY other fields",
            "What you’re describing is the engineer vs the mechanic. One can design and build and problem solve, the other can patch it together. Both are necessary and it’s up to the employer to determine who they can pay for and in what ratio.\n\nPassion is not necessary for either of these, and it’s horrible for people entering the field that this story and mindset are pushed. As it makes everyone look like they are working unhealthy levels. Yes you have to be able to learn and problem solve, and that’s easier when you love it. but you can do that in a 40 hr a week role where you clock in and out never thinking outside of those hours, or a 100 hr a week role where you are too exhausted to think outside your working hours. You also can choose to stay as an L1/2/3 your entire career, no one is forcing you to become a principal engineer at google.\n\nYou either design the factory or you are the person who rivits the pieces together. Either way, as someone else said earlier “ok”",
            "If you’re looking for a career, passion will ruin most people, bc they will realize “it’s just a job”.\nPassion is for entrepreneurs, it’s for self learners and tinkerers, for researchers and academics.\nIt’s not required and probably a hinderance for most people.\n\nBRB “no one’s passionate about accounting, being a garbage man, roofing, representing criminals, it’s going downhill” derp",
            "meh, i saw a lot of kids like this in college. the ones who are dedicated will easily sort themselves out from the ones who think it’s an easy way to get $200k starting salaries and don’t give a shit about coding or cs fundamentals. \n\nthe ones who had the drive all are successful with jobs. the ones that didn’t graduated and never got a job in the field.  \ndrive =/= passion. \n\nyeah it’s “hard” but so is a lot of other jobs. at the end of the day if you want to support a family on one income, buy a house, have new cars, send kids to college, live the “American Dream” there are very few bachelor degrees that provide a pathway for jobs to pay you well enough to achieve that out of college. CS is one of them, let the ones that want it grind for it. everyone else will sort themselves out. ",
            "Ok then go get a low paying programming job and build open source if you’re so passionate.\n\nLeave the high paying tech jobs to the people who are good at it, passionate or not.",
            "Ehhh. I came into the field in 1995.  I started coding on the C64 when I was 9.  Loved coding.    Not sure if that made me a \"better\" programmer/developer/engineer when I was still writing code.  I saw people back into software from all different positions/roles throughout my career that turned out to be great engineers.",
            "Degrees are necessary nowadays to get a job that pays the bills. If you have to go into debt why not pick a degree that you know will pay better, on average, than just about everything else. \n\nBeing passionate about what you’re going to school for isn’t the norm anymore. We can’t afford to take those risks dude.",
            "I am into nothing. I just want a good job and support my family.\n\nI have no passion. I would've killed myself if my parents don't support me. I feel life boring af.\n\nBut all that doesn't mean I deserve to get hundreds of rejections. I just want to live a life, man.",
            "“Passion” do you think people become investment bankers because they’re passionate about diversifying their portfolio?",
            "Imagine being a dev for 20 years feeling threatened by new grads. You just told us everything about yourself without realizing.",
            "Hot take OP, it is okay to pursue a career for the compensation.",
            "Oh man 10 years ago the same thing was definitely said about people majoring in business administration and psychology. I remember it clearly when I was trying to decide a major. I didn't care much about computers or programming then. I was more passionate about geology and astronomy but i was told by my counselor that there weren't jobs for those majors (in my area). Now that I work in IT, i see a 6 figure geology job in the public sector that hasn't been filled for a least a year. \n\nThe moral of the story, just pick something and let it ride. It's okay to make a U turn. I had to start over in my early 30s. I'll definitely start over in my 40s or 50s. Just do whatever, as long as you finish.",
            "Look. The price tag of college is way too high to fuck around with low paying majors. Will there be a bunch of shitty engineers? Maybe, but I can assure you there already are. That said, I’m switching to cybersecurity. I like it better, and there’s waaaaay less competition.",
            "Like I mean, SWE is not the only thing CS majors do after college. You can go into IT, web design, database management, etc. You can even go into a bunch of unrelated fields. It is common for people to end up in fields unrelated to their major. Like, over 50% common. I'm personally interested in computers, like and am pretty good at programming, and couldn't really see myself doing anything but computer related stuff.",
            "The future is technology.",
            "Completely agree. SWE Industry being filled with just money chasers who don’t know that much about programming and then they complain about how the market is messing with them",
            "I always expect redditors to let their extra chromosomes lead the way when they're presented with a legitimate point, and redditors never disappoint. The majority of the window lickers in industry are the ones who have no intellectual curiosity regarding the subject. When the industry shifts, which we're overdue for at this point, they will be like the sad old Cobol and mainframe programmers from the early 2000's, but I guess irrelevance won't sting so much for them because they're just there for the paycheck.",
            "@OP our jobs are not as hard as you put it, no need to act all smart and shit in front of people who are aspiring to join the field. You’re not special OP. \n\nSure I come home tired, but it’s all politics and design documents. It’s more people than being a hard task.",
            "Relax old man! \n\nIn my case I double majored in EE&CS. And I have no passion for either of them, I just know that it pays me well. \n\nIt pays the bills. \nIt pays my insurance \nIt pays my hobbies \nIt pays for whatever I want. \n\nAt the end of the day it’s a job.",
            "I think OP is wrong here. Also I think people are taking the comment too personally. To say “it’s not” to his comment that it’s mentally and emotionally taxing and harp on the comment as it may be untrue in general is indicative that it is only untrue to you. \n\nPossibly, OP had been part of rough startups that didn’t work, of the few tech startups that made it and defined the tech sector during the dotcom bubble, hundreds failed. I believe OP might be communicating from his bias of failure being that he experienced those very failures more often than experienced successes.\n\nAdditionally, OP, it’s biased to dissuade people from joining CS because you think “they don’t care passionately for programming.” For some, a job is a job. That true may take the magic away from what you do and have done in your career. \n\nSuppose someone gets a CS degree for pay, and not pleasure, while doing the job they might have less of a connection to the craft in comparison to you, yet they yield the same results that you do. \nThis truth doesn’t mean they shouldn’t do the job. It just means that passion is not required to be a skilled programmer. \n\nUltimately OP, you are biased, and are being a stinky poo poo pants",
            "i get you and all, ppl shouldnt do a degree theyre miserable in if only to save themselves the stress but can we not pretend that ppl go into degrees purely for the love of it on average. id love that, but real world doesnt leave much room for u to throw away that kinda cash on a niche degree or something. i understand those who went with CS even if they didnt particularly enjoy it. thats just how it is.",
            "It’s tough. On the one hand, as someone who has been obsessed with computers since I was a kid I see the frustration and do feel a sense of elitism (if I’m being fully honest). That being said, the worlds a rough place and people just want to get by. I cannot judge an artist for majoring in CS just because they want to be able to afford a house someday, and in our capitalist society you don’t always get to do what you’re passionate about. As the market becomes more saturated, the people that are less passionate will burn out.",
            "bro ive been in blue collar and changed to SWE and blue collar is mostly f'ing exhausting. working shift schedule literally accelerates you to an early grave. sitting in an office or even wfh on regular schedule is very nice. sure some of us didnt love to code when we were kids. and most of us found our ways here trough various ways. many people are interested in problem solving, doing something more \"hands on\" which also doesnt rely on you being a people person. programming (or digital plumbing) is a skill which many like to develop (and does so quite easily within a few years) and its not some esoteric wizandry that you slowly brew for 20+ years which you nerds wish it to be. you gatekeep who is a \"real\" programmer or not. that kind of attitude op has is what is poising working in it-culture. idk about USA but in my country we have reports yearly about how many it-workers the market is missing (its in the hundreds of thousands) so i dont know about a saturated market. also seems like everyones friend and their mother is studying economy or law. sure here on reddit there are alot of programmers. its because reddit is heavily skewed towards people who are interested in it.",
            "Yeah no shit … this entire sub is posts from people who are struggling to find jobs/ internships because each opening has 11k applicants. What’s the point of regurgitating this information when every cs major is already hyper aware of it.",
            "These people are also not passionate about any other subject. I know because I was one of them. When you don't know what you want to do, it's wise to choose a relatively promising career path like CS. Work is always hard, I think CS is one of the easier ones, especially compared to any manual labour.",
            "These people are also not passionate about any other subject. I know because I was one of them. When you don't know what you want to do, it's wise to choose a relatively promising career path like CS. Work is always hard, I think CS is one of the easier ones, especially compared to any manual labour.",
            "I try to not post here since I graduated, but you do not need to be passionate about this field of work.\n\nIt’s a job, it’s transactional. The company sure as hell would put their finances over employees, so why can’t employees be that way too? \n\nAnd as for rising graduate %, that’s fine. CS careers are still better paying and have more opportunities than almost any other Bsc. Maybe it’s worth the chance for those trying to gain wealth.\n\nThere’s absolutely nothing wrong with wanting money and prioritizing your own happiness first.",
            "Newbies bashing the OP. He is somewhat right. CS is nowadays useless major, its just absurd requirement to have a 4 year CS degree to land an IT jobs. At max 6 month training is sufficient for any entry role out there. Why waste 4 years. And now AI will make those noobs redundant\n\nI take interviews, and I have had ATS modified. I have hired even BA grads, dropouts, business grads for dev roles, just on skill. All those triggered here are paying for a useless degree\n\nAlso even if you land a job, you have no assurance that you how long will you have career in this industry. Unlike other industries, IT companies are hesitant to hire someone with more than 10 year of work experience. Longest career I saw is 22 yrs. These noobs not gonna last 3 years even if they get hired and they will unemployed for rest of the life",
            "I’m not a CS major, though a lot of my former and current roommates are, so I can see OP’s point of view though I don’t necessarily agree with it. \n\nPeople who are genuinely passionate about CS will probably understand the subject matter more and be more proficient at it, and from OP’s PoV will be easier to work with and teach.  I’ve had a CS roommate who shared the same views as OP and made a clear distinction between programmers and “brogrammers” who just took a CS degree because the job paid well. \n\nI’m a dirty chemist (though I do some data science and ML for my research) so I can’t comment on any of that, just throwing it out there because there are definitely other people like OP.",
            "It's just most people with a CS/Programming focused major are techies that are in the \"know\" with reddit, etc. You're not seeing most of the other students in other disciplines... and remember Reddit is like 5% of the population.\n\nBecause of AI and the fact that I'm just not that interested in coding anymore, I'm switching to a business degree just for the piece of paper and making the jump over into Medical Device Sales. AI is about to revolutionize the tech in surgeries. (I've been in sales for almost a decade, just wanted a break for a bit).\n\nI'm in sales for the 6 figures. Period. It's stressful as hell, but a good 10 years and saving/investing... you're set.",
            "You should see lawyer school lol or MBAs. Business management majors, psychology, etc...",
            "\\>anon writes an if condition\n\n\\>so mentally taxing",
            "Hahah people with fake elitism crack me up. \n\nSo what if students today don’t look up code at the back of magazines ? They don’t need to as code is everywhere . \n\nI refuse to accept that Stanford CS undergrads from 2001 are superior on average to those graduating now . It’s a stupid fallacy in thinking. If anything the ones now are tougher and better trained. \nBack in 2001 students who wanted to make money perhaps studied finance or business, who the hwll knows ? I bet elitists even then would look down on the newb finance grads with statements like : I come from a pure math background ; I studied group theory and topology in high school before choosing to major in math; financial math came to me like breathing etc.  it doesn’t matter. \nThe new generation will learn things their own way , have their own motivations and will push the world forward . There’s no reason to compare to the past. The world will progress despite all the challenges people face or the internal motivations people have.",
            "If people got jobs in what they cared about a large number of them wouldn’t be able to eat or put a roof over their heads.\n\nI suppose then you’re a proponent of UBI yes?",
            "I think your getting the salt bc of where you posted this. A place where people are young and in school . \n\nHowever,  you are CORRECT!\n\nAs someone who came from the same Era. I went back to grad school to get my masters in CS and these students have absolutely no interest in learning or passion for the subject. They make it easy to get a 4.0 because the professor is shocked when he sees any actual competent work. These are the same ppl who are going to be complaining they can't find a job with a cs degree when they didn't learn anything and literally just have a peice of paper with no actual knowledge behind it.",
            "Although you are not wrong about the market being filled with people who are not really curious about computers or CS in general, can you really compare becoming a software engineer in 90’s and nowadays? Abstraction layers only have increased by an order of magnitude, doing projects doesn’t entail coding up in Basic, you have to pick up bunch of languages, frameworks, cloud computing, CI/CD, ML/AI etc. I think this topic is more complex than you described. There a lot more to it, and I tried to touch few nuances.",
            "I've been into drugs and alcohol since I was about 12 and now they I'm sober and fixing all my fuckups I've made, I started a cs program. I'm not passionate about any of my IT classes cause it isn't interesting, but I love my coding classes. The problem solving and seeing it work after trying and trying is very fulfilling. I wouldn't say I'm passionate about computers and didn't learn how to build one when I was 10 due to a shit childhood, but I do have a passion for problem solving and puzzles. Would you think I'm wasting my time with it or will end up being a bad engineer? Not being sarcastic or anything, just curious of your thoughts.",
            "FWIW I think if a person has dedicated themselves to the field and stuck it through long enough to make a steady career out of it then they have earned their title and have proven that they have the fortitude for the job. \n\nFor those who initially thought this was for them but found out it actually wasn’t, they will eventually find their path elsewhere. Or maybe those that didn’t care much at first will find themselves really loving and being “passionate”about the field. \n\nThe point is people will place themselves where they want to be and things will always work themselves out. At the end of the day it’s all about who is willing and able to do the job.",
            "Sorry, random redditor. I am passionate about music and my mom (who is a music major) told me that majoring in what you're passionate about kills your passion when you're trying to make a living off of it.",
            "Thank you very much your post opened my eyes, I've been suffering for 2 years in this domain, its not because I don't like it, but it's because it's MENTALLY complicated.\nI've had 2 burn out in this studies and I feel like it's a chore doing projets for uni than just assignments.\nYou're right, being mentally healthy comes first right? I better change. Thank you so much🥲🙏",
            "I had an interview once with an electric vehicle company right out of my undergrad. One of the first questions one interviewer had was to ask how obsessed I was with that type of vehicle as a kid, and to describe electrical appliances that I had built myself in childhood. Evidently, he wanted to see if I had passion for the subject and was “exceptional”. \n\nIMO, this is a silly line of thinking. It is as if to say that since I was not passionate about the subject in childhood, that I am not currently. \n\nI aced their technical interview, but did not get the job as I didn’t show a “formational” obsession with their industry. \n\nNow, I teach the students who go on to apply to that company. When they ask me my experience with their interview process, I’m honest. \n\nIn my professional career, I’ve met their management. Some are cool, and some have been snobby gatekeepers who are insecure around people with masters and doctorate degrees, and use their formational obsession to compensate.",
            "Passion for your work?\n\nThat's definitely nowhere near the majority of working adults, even those with college degrees.\n\nWork has always been and will always be a means to pay for a certain quality of life. Whether or not you have passion for it is a convenience that a lot of people don't really care for. Sure, it looks good to others when you seem to care about your career, but if your boss came up to you and said, \"You are really appreciated at our company, and we respect your passion for your work, but times are tough and we need to cut your salary,\" tell me more about your \"passion\" for your job.",
            "I have a passion for computers but my parents couldn't afford to buy a computer till later.\n\nSo I would have loved to dabble as a child but the opportunities weren't given. But now as an adult (only physically lol) I am able to afford my own computer and boy , do  I feel like a child on Christmas learning about all of the different application and functionalities of a computer.\n\nIn life one is dealt with a certain set of cards, it remains to the individual how to play life with those pre-assigned card. Life is all about survival and adaptation to ones envoirnment if you can't adapt to change then that's that,  I mean you can be passionate about adaptation it would certainly help but I mean if you are drive is to life a comfortable life no matter what, who are we to say that the motivation is wrong or not. In the end that individual either survives or not(metaphorically).",
            "\"Passion\" is for rich kids and extremely talented people. In the end, most people just want a well paid job without trading their health and whole time.\n\nIf you think a CS job is hard, maybe you should go down a mine or visit an oil ring to know what is really a hard job.",
            "I mean why can’t a CS Degree person be a PM. Or a sales person. Or a marketing manager. Or a Solutions Architect. Or an IT person.\n\nI worked picked up a biz degree, worked in B2B sales until I coded up a new UI for the SaaS product I was trying to sell, and am now a software engineer.\n\nI know an accountant who uses scripts to shorten his workload. \n\nI mean for a “general purpose degree”, CS really opens lots of doors… so it is not a surprise that lots of people get their CA degree to me.",
            "Not a CS major. I just went to a bootcamp and was a developer for years. I promise or half the CS major ls I’ve worked with in blue collar jobs are pretty damn terrible. If you work hard and keep on learning you’ll run circles around them.",
            "Ok got it, we should gate keep a vital skill in 2024 for nerds that had hacker hobbies in high school. Because only they are smart enough to possibly comprehend the rigor of your boring tech job. \n\nThese kids are just trying to survive man. They are not following in the footsteps of the millennials before them crushed by the debt of their regrettable poli sci major. Sure they are not as good at coding as you… no shit, it takes time and indeed weeds people out. But to have hate for people trying to better themselves? Pathetic and insecure.",
            "It's super obvious for hiring managers too :)\n\nThe guy with tictactoe and a CRUD in his portfolio isn't getting hired anymore.",
            "老登",
            "All the worst members of society want to be in CS and everyone thinks it's easy.\n\nFirst is the gold diggers. These are the kind of people who fall for get-rich-quick schemes. They probably bought both bitcoin and GME at the top. They have zero interest and are told it's easy. In fact, they think it's so easy that they're more likely to be \"self-taught\". The quality of worker with zero passion attracted to the easiest thing possible of course is going to be bad.\n\nBut I would guess that the vast majority of people getting degrees are actually gaming addicts. They never leave their computer and don't use it for anything other than games. Their parents told them to get a job, so they take their free ride to a CS university where they don't pay attention.\n\nA perfect storm came together to make the industry terrible:\n\n* big tech pushing \"everyone can code\" and now \"kids can code\" for 20 years\n* the unreasonably high salary for a job that everyone is told is easy\n* everyone wanting to work from home after covid\n* non-tech managers who have no idea how to vet or how much to pay who they're hiring\n\nSo we have this signal that the job is easy AF, pay is ridiculous, you never have to leave your house, and nobody hiring you can tell if you're good combined with it being the default career for both gold diggers and failures to launch.\n\nWe also have an entire generation that was in school during covid and basically learned nothing for 1-2 years. So even if the number of grads is increasing, the quality is terrible.\n\nNormally I would say you have nothing to worry because everyone is laughably bad. The problem is my last point where managers have no idea how good the people they're hiring are. You have 20 years experience and they think you're the same as some dipshit who buys stock at the top or is covered in Doritos. They think you're the same as someone who only knows HTML. Some people are getting paid $200k to do CRUD while highly talented people can't find a job after hundreds of applications. The process has too much luck and snake oil involved.\n\nIn day-to-day life it's even worse. They think your job can be done by a literal child. Parents see their kids learning Scratch and think they'll be like you. They think there's nothing exceptional or rare about what you do. If you tell anyone what your job is, they will respond with \"oh cool, my 8-year-old is learning programming\". If they know anyone in tech doing for loops or even IT, they think you're both doing the same job and are of equal talent. This is a huge cause to worry because there's a massive pool of applicants and the people hiring think the job can be done by a literal child, so why pay you so much? Now they're even wondering if they should hold off on hiring you because they want to replace you with AI. It's such a shit-show.",
            "If they just lowered the pay for Computer Science jobs, it wouldn’t be the case.",
            "The sadness part? Many won't listen to your words and will tell you are envy but then they will end up posting here about how hard it is to find a job. At the end of the day if there are many doomer posts in this sub is for something",
            "This was very much my take, as well, although I studied mass media / digital media instead of doing raw CompSci for some very super stupid reason.\n\nI remember talking to some CompSci students who couldn't tell you what a hard drive looked like, or how to plug in a stick of RAM. Those are not skills necessary to be a developer, but you'd think if you claimed to be a computer person, you'd know a thing or two about them. It's  like, why run before you can walk? If you barely know how to approach a file system, I have serious concerns about your computer knowledge vs your ability to pass a class.\n\nIt's safe to say, they graduated, could barely code, could barely troubleshoot, and did not do well. They all thought their first jobs would pay 100K a year. This is what happens when university marketing is able to sell a program to you.",
            "i no love the way this post triggered people so much",
            "Ok boomer",
            "This is so freaking true, thanks to \"Day in the life\" videos, everyone and their grandmother wants to be a software engineer or work in AI or machine learning, which has the effect that recruiters now get to be extremely picky and not give a chance but only to the best of the best (best doesn't mean competent or having passion). I'm really hoping for the next big thing to attract the bulk of the population, and we can breathe air again.",
            "I switched from CS to Econ/Stats and started making 100k out of college without the issue of finding a job… After reading this group everyday - best decision I ever made.",
            "Probably true. Half the CS majors I met in undergrad had zero interest in it. It seems like it’s become the equivalent of becoming a doctor or lawyer but there’s a lower bar for entry and making good money is less guaranteed\n\nEdit: wow I just went through the comments and I’m surprised by the amount of people who disagree. I graduated last year (for context) and at my school the CS class sizes literally tripled in 1 year and my school wasn’t prepared for it and they were surprised by it. Universities are churning out tons of CS degrees when the market has already become saturated, so what OP is saying is basically true.",
            "Thought this was a post about the recent counter strike major",
            "![gif](giphy|2UvAUplPi4ESnKa3W0)",
            "keep crying",
            "There are too many people taking all types of useless degrees that they are uninterested in simply because \"you have to go to uni to succeed\"",
            "Mom said it’s my turn to post this",
            "Not everyone was exposed to computers before University…",
            "A few years ago all the brokies were told they should just \"learn to code.\" Now that they are learning, there are suddenly too many CS folk? Please.",
            "What a whinge bag.",
            "Full of nonsense. It's like there is another subject that you're interested in and you can earn some money.",
            "I keep trying to warn people that there is a real possibility in the short term that we are going to reduce the compensation of the field if too many people enter too quickly. That's not good for anyone. There's always a shortage of tradespeople and doctors if you're in this for the money.",
            "not everyone had the privilege to be \"in to computers before university\" many of us didn't even know the field existed. our parents were busy trying to survive or immigrants who had no idea about all of these possibilities. im glad you were able to find your passion early as you weren't worrying about helping your parents pay bills, but dont shit on other people who had to find that interest / skill later on in their life",
            "Most people here just want to keep hearing forever what they heard when they decided to get into this field that they will get a good easy job quickly and make ton of money and will insult anybody else who assumes otherwise. Besides why you get pissed so much by people claiming that if you aren't passionate about it you are going to have a hard time? If you don't think that's true what do you care of what others think? It's also funny that many people here cry about saturation but also insult others for trying to \"throw off competition\"",
            "Okay but like 50% of them quit when they realize it’s not an easy degree",
            "https://preview.redd.it/n1fesph9yxrc1.jpeg?width=1024&format=pjpg&auto=webp&s=2510b44934e208654de6179f43498ee2c7c0afec",
            "Honestly, I think you're getting a *bit* too much hate. I was going to do my bachelor's in Physics, but I switched pretty last minute because CS felt a lot easier and more natural. But I don't think I'd be able to do something in physics even if I was paid as much as SWEs were. But ofc money is a factor, it always will be, and I wouldn't be in CS without the moolah we get.",
            "You drop first.",
            "K",
            "Hush, dinosaur",
            "Isn't Stanford part of silicon valley? There's probably a huge skew of CS degrees in that part of the country, if not the entire Pacific coast. I wouldn't take their numbers as being indicative of anything. Tell me the US aggregate numbers for undergrad degrees, you're cherry picking an extreme example.",
            "womp womp",
            "Ok Boomer.",
            "This!! When I started uni I was surprised to see just how many people were there because of money. What people don’t understand is that the real CS people aren’t in it for the money. We’re the people that refactor your spaghetti code as a hobby. We’re the ones that write documentation for your overly complex promotion project. We’re the ones keeping things rolling. So do pardon me if we’re fucking upset with 9-5 people. Find another job will ya?",
            "great weed out post",
            "Ok boomer",
            "Dont care, same thing is said every year",
            "All the commentor here bashing OP but then cry when they can't get a job withing 1 month of applying or get laid off lol. You need passion to endure the hard times. When your passion is money, then you would feel like shit if you don't get it. \n\nSeriously, if money is what you want, there so much more thing you can do out there. Just put the same amount of work you do to study CS and you will 100% be successful. \n\nIts pissed me of seeing people posting \" I apply x amount of time yet not job\" or \" i have cs degree but I can't code now no job\" like come on.",
            "gatekeeper",
            "That's interesting because LLMs are going to make them all obsolete as soon as businesses choose to adopt them",
            "The recent “AI will replace programmers” propaganda is already doing wonders on deterring high school and 1st year college students from going into cs programs",
            "Passion will keep you in the field, all these losers are going to burn out if they don't learn to love it or end up being miserable people.",
            "And they're still all dogshit at programming",
            "Wah wah mf",
            "You know things are at the top of the market and all downhill from here with so many graduates in CS, people who previously had no IT/CS experience or degrees, working as cooks, fast food workers, housewives and other unrelated professions dreaming of starting a career in CS, taking boot camps thinking \"Next stop Google, Meta, Amazon,...and lucrative $300K salaries.\n\nNot saying you shouldn't dream, but let's get a reality check. The US alone is laying off about 50,000 IT professionals since January and counting.  All of these IT newbies entering the market are left fighting for scraps as they will all be competing for the same jobs with those experienced laid off from Google, Meta, Amazon,...",
            "Ok old man 😭💀",
            "Also interesting given NVIDIAs CEOs take today that coding will be taken over by AI, at least early development things",
            "I got sacked from events industry right before COVID hit my country, decided a needed a new industry and I was expecting COVID to drag on for many years(it didn't) so went to uni, apparently compsci roles were top 10 needed roles at the time, but before ive even finished it the market seems to have stopped hiring grads....",
            "Speaking on my *own* experiences at a state university several years ago, most of these students are not the least bit qualified; I had a group project for graduation requirement, and for the first part of the project—which involved documentation, essays, presentations, etc.—my group-mates were splendid and hard-working.\n\nOnce we started the actual development... everything fell apart. I felt like I was throwing them bones for easy things—like a 10 second Google search and copying and pasting two lines of code—and most of them were wholly incapable of doing even this. It's like, as soon as the hand holding, chances to cheat, and working with other classmates on assignments stopped, these people became no better than my fellow classmates in high-school coding classes. By the end of the semester I had to give up trying to let them do their part and had to work morning to night to get our project in a submittable state. Some of these people had jobs lined up after graduation. I have not the slightest clue how.\n\nBy the end of my bachelors, I actually questioned the accreditation of my university (and others like them); they genuinely seem like degree mills who will look the other way to let people pass. In one class, I saw grad-student after grad-student in a mixed undergrad/grad class receive zeroes for cheating and *trying to argue their way out with the professor*. These people were for the most part not even dealt academic dishonesty punishments.\n\nWith all of the tales of totally incompetent new hires and the overflowing saturation of new-grads in the application pool, it's pretty infuriating to see when thinking about how hard it was to find my job. It shouldn't be seen as gate-keeping to say that incompetent people padding their resumes and implicitly lying about their skills to recruiters should not take away from people who actually possess the skills, rigor, and interest that can be seen quite clearly in many scenarios. I can't even say it's as much better as I thought in the workforce...\n\nObviously, I have no idea what it looked like in previous years.",
            "personally, I believe there are too few. The fact that a lot of businesses are not yet online, not yet fully automated, do not believe in digital, not even the benefits of data and data analysis... there is so much work to be done",
            "So a Gen X looking down on Gen Z for wanting to make money, how atypical.\n\nName one lawyer who said he or she has a childhood passion for arguing in front of a court and memorizing case law. This dumbass notion that passion is required to be in CS is outdated and fundamentally flawed because the smartest people I met in CS wanted to go into industrial engineering or applied math but chose CS because they wanted the money prospects.\n\nJust like every other major there's filters at different levels. Before the CS filter was being able to code, then it became getting a degree, now the filter is being able to actually problem solve.",
            "Why are you on the CS Majors subreddit if you graduated in 2001 unc? Go play with your kids or something",
            "We have 3 sectors left in the United States. Entertainment, healthcare, and tech. They're all a hail Mary but CS is the most reasonable/safest bet",
            "What’s with the gatekeeping OP? Gtfo!",
            "Honestly you can't blame people for wanting a high salary job and not necessarily caring about their \"craft\". But also it can be tiring working with people who are like this especially in college when you are long way from that money.",
            "I totally agree with OP.",
            "Wait is this group about kids who are still in college ? Oh man , .... Get ready g buckle up cus' you'needa that 10 years experience for entry job . ( It's 5 years now ) . 😂 . Not a de-moralization  , but giving you a higher bar to jump over . [Visit some r(resume/job/hr/LinkedIn/..) to have some finer edge  ]",
            "Ratio",
            "Should have majored in English",
            "I think a lot of people go into CS not knowing what it is. And if you look at a large variety of tech jobs they say “or similar degree”, so when people go for CS and realize of software engineering is hard and competitive, let me go into it or something. They change their major to something like information systems to avoid taking harder classes such as calculus.",
            "Gatekeeping Nerd",
            "People get upset but it’s true.\n\nIt’s not hard to get an interview at FAANG, the trouble is passing their tests and interviews.\n\nI dont care if you dont love your job, i doubt most people love their jobs.\n\nBut the point still stands CS is hard you can love it and still fail. You need the mind, effort, and circumstances to make it in this field.",
            "I’m going to try to transfer from community college but as a computer engineering but still wanna be a software engineer. The acceptance rate for CS in Uc schools is so absurd😭",
            "Don't get me started on the comments when bringing up \"a job is a job\" on the graduate level.",
            "You think people are passionate about finance and accounting? Also you graduated in 2001, what the fuck are you doing on this sub.",
            "Being a professional software engineer can be extremely emotionally and mentally taxing. Depends on the company. For 90% of teams in big tech its the most chill white collar job out there, but of course that comes at the expense of career growth.\n\nFor the point on 18 percent of stanford grads graduating with a cs degree, that is not a problem at all. Economics has always been a popular degree at schools like stanford harvard etc because it attracts students who have no interest in any field and are only there for the finance and consulting recruitment opportunities. Nothing wrong with that, but in the grand scheme of things 18% is not all that bad of a number at all. It seems like everyone and their mother is doing cs these days because there is no difference between a stanford cs student at a northeastern cs student. Both have the exact same opportunities and frankly, most companies especially big tech give no extra weighting to the stanford brand for generic swe roles. The result is a huge pool of eligible candidates, which makes the field seem saturated. Tech companies really do need to start enforcing the concept of target schools like in finance.",
            "Gatekeep, because how else am I gonna get my six figure salary?😚❤️",
            "OP isn't \"gatekeeping\"\n\nOP is saying (I guess?) that \n\n1) people who might have told you that literally everyone can be a successful software engineer after 3 month bootcamp were wrong/lying\n2) if you are in the game _only_ for money don't come back later complaining how hard it is to find a job or that you don't like your job etc.",
            "Early 21st century CS careers were a bubble that is already well on its way to deflating.\n\nEvery year the skill level required to be productive gets lower and lower and salaries are following.\n\nIt’s also a rough job if you don’t love it - software gets held to much tighter productivity metrics than other engineering disciplines and despite being the highest paid are treated the most like factory workers.",
            "But he is right. It's alarming how many people choose this subject without being passionate about what they doing. They do it for themselves only and this will lead to...",
            "You are right and most of the negativity here stem from the people you are referring to. Software engineering is more than just a job, due to its complexity.",
            "Bold statements here OP. i respect it and will back it. most of these ppl just don't get what it takes to be great and that's fine. it's because these people exist the market is \"saturated\". saturation is quantifiable yet qualifiable in the sense that it's these people who won't want to learn more when given an assignment in school or at work that makes the job market hard. companies are realizing these things HRs aren't that dumb. the truth speaks for itself, especially with AI it's even more obvious who's going to be the last ones standing. definitely not the 20+ hours leet code grinders. it's the project based learning, REAL problem solving (don't let me see another calculator app), curiosity driven individuals that will make the market rise again. we're on the shift right now. good luck to the unemployed, and lift your head the ones that are here because it gives you fulfillment. good night everyone",
            "Wait, you graduated in 2001 with a CS degree but don’t remember all the posers who hopped in because of the dot com bubble thinking computers were an easy way to $millions? It was the same back then—arguably worse because a lot of those people had zero computer background.\n\nAnyway, it will work out the same today as it did back then. Posers will drop out, those with skills will rise to the top, and if you can do more than copy magazine code, you’ll be fine.",
            "\"work to live not live to work\"",
            "It makes even less sense to study something one is passionate about that nonetheless doesn’t pay well.",
            "Now I’m curious, what majors/careers do you think are better for “passionless” people?",
            "I wholeheartedly agree with this. But time will tell, who is passionate and who is there because society tells them it’s a good career",
            "I think OP means if you guys had any interest in learning about  computers beyond making money you would already be making bank right now instead of struggling to get hired. Because with the oversaturation there’s less skilled people in the pool willing to learn beyond what’s taught in school and improve through experiences and projects. The people that grind interviewing prep and make increasingly complex projects, learn new languages which land research and internship roles are the ones getting hired even now, and not a lot of people are willing to put in that work or like it enough to do so.",
            ">These days I see a lot of young people coming out of university who don't have a passion for the subject, they weren't into computers before university, they just see it as a well paying career.\n\nA job is a way to make ends meet, to pay the bills, you don't have to be passionate about something that you do to survive.\n\n>You had no interest in understanding computers outside of making money from it as a career \n\nNobody expects nurses, accountants, HR employees, etc to be passionate about their jobs, stop spreading this \"passion\" BS here.",
            "You’re not wrong. It also used to be significantly harder to graduate from a comp sci program. I started in lecture halls with hundreds of people and my graduating class was less than 20. ",
            "I really don't understand posts like these. If someone is not passionate in cs but they get a job and are good at what they do, what's the issue here? Competent =/= passionate",
            "You don't have to have passion to major in something 🤷‍♀️ If that were the case you'd see a world with many more art and english majors. Blunt truth.",
            "I agree. Without the passion/curiosity, you will be miserable in this field and probably won't do well.\n\nThere is a massive change in the industry right now and a CS degree isn't what it used to be. I graduated in 2022 and was so lucky to stick with my intern since 2020, so I've been unaffected more or less. \n\nI cannot imagine having to look for a job now in this industry.",
            "I strongly agree with you",
            "I'm passionate about money",
            "YOU'RE BLACK YOUR FKN BLACK",
            "I fell in love with CS while in Uni. I am not doing CS, I am doing Data Science and more stats and math classes than the average CS major does but while doing it I realize how fun programming is!",
            "Tbh I have a passion with data ngl so that’s why I went into the major. Data scientist",
            "Tbh I have a passion with data ngl so that’s why I went into the major. Data scientist",
            "Not even a cs guy but cs majors try not to gatekeep challenge (impossible difficulty)",
            "I feel like OP drastically underestimates how passionate people are about making money",
            "It's fine. There are no guarantees in life. Not every gravy train will remain a gravy train. Supply demand. If supply goes up, salaries down. Who cares.",
            "One of the biggest lies ever told is that you should love your job.",
            "I imagine Stanford is not representative of the average university…",
            "This did crack me up a bit..\n\nAs a CPA I just exchanged everything with accounting and having a passion for accounting.",
            "People who think they can do CS (or anything) just  to support their families, without passion for the subject, confess they are selfish. \n\nBut IF you love CS first and only after that consider the money, then you are justified. \n\nIt’s like asking out a hot girl because she’s has a nice ass. Then getting caught for doing so and saying: “oh you shouldn’t have to care about her heart or personality…of course whether or not I can sustain a boner is a factor.”",
            "Not everyone with a CS degree is going to become a software engineer. That’s a degree with many doors and opportunities, it’s not over saturated in fact with the way the world is going we’re going to need more cs grads.",
            "Doing a masters so I can work in software now. lol.\n\nI’ve liked computers since I was a kid. Steve Jobs. Fiddling with different operating systems. Etc. I had a knack for it since it just so great to be able manipulate the environment you use.\n\nHowever I took CS and simply did poorly in college 5-7 years ago. I lacked structure. I am going into it with tangibly achievable goals. Hopefully it’s not the wrong decision.",
            "The quality of the CS has really went down also.  When I got mine in 97-01 math was central to the degree and spent so many hours coding directly on the hardware. \n\n\nNow most universities are a diploma mill. Many of the grads we interview can't solve basic calculus problems.  They didn't even have to take math past Algebra and Trig.  The can't really write code without some framework to lean on let alone.  And don't even get me started on the engineering part of software engineering.  \n\n\nWhen I interview fifty grads I might get two or three that are worth hiring.  It's a different now.",
            "Bro people don't understand. Right now every field is really competitive. Look at law, medicine, engineering, etc. I understand, but prices of living went up exponentially too. Like the World is different.",
            "Sounds like a problem with the economic system 🤷‍♂️",
            "Saw this coming since high school. Graduated 2016. All my friends and a lot of people I knew... I'd say around 20-30% of the senior class(~1000 students in senior class) they were all going to college as a CS major. I didn't really know what I wanted to do, and thought maybe CS could work for me because it would be high paying. But then I thought about it more, and noticed that the main thing anyone ever talked about was high salary. And only a few people already had experience and passion for code.\n\nI felt that if I pursued CS, I'd be competing with tons of people and there wouldn't be enough jobs to go around. Also that the high salaries would probably not be as high once I graduated college, and that outsourcing would also become pretty big. \n\nWhen I talk to my high school friends, it seems that I'm not incorrect in most cases. Many of them landed a job, and then got laid off in the big tech layoff and have not been able to bounce back. Many switched industries entirely and others are considering a switch. \n\nAm I wrong to think that older people in the industry may struggle to remain relevant and that few companies want to hire a 40-50 year old as a non managerial role? Seems like they just get replaced by cheaper fresh meat from college. \n\n\nAll in all, there are plenty of no degree jobs that make you 80k starting, and maybe offer similar lifestyle and better career prospects/stability in the long run.",
            "they cite stats from the world's fourth most selective university. Everyone at that university is extremely hard-working and intelligent.  In most universities, most students get weeded out by introductory CS courses and have to switch majors.",
            "So OP is in copper",
            "With recent CS grads who struggle finding and keeping jobs, the biggest issues I've seen is that they're not good programmers, how they think about software development is limited, they have poor interpersonal skills, and they don't engage with the tech community by contributing to projects, attending hackathons and meetups... \n\nWith that said, the industry needs to stop relying on universities, and start developing talent in-house with apprenticeship programs.",
            "I don’t wish a cs major on my worst enemy, lol. If you’re doing it for money but aren’t passionate about it then the jokes on you and you’re going to be so miserable.",
            "Isn’t it also one of the fastest growing industries for next decade?",
            "gatekeeping",
            "I say that initially I see it that way too (a few of my ex's are in the field and linkedin likes to keep asking me to friend them \\*hint hint future engineers think about that shit...)But what if I am in CS just to be able to be useful in the future world? Maybe I am building a robot at home. Education is the way to survive and make better decisions when life gets tough.",
            "A CS degree is super fucking versatile, you don’t have to be a SWE",
            "As someone who went into cs for the money, around 2006 so not far off from you, i hate programming and hated it through school. I still work in computers now and get paid a lot so it worked out lmao.",
            "It's always funny seeing people try and gatekeep like this when it's just about being a fan of a band or something, but it's especially funny seeing somebody try and do it about a job.\n\n\"They weren't into computers before university\" is literally just \"I bet they'd never even listened to a Metallica album before it was on Stranger Things.\"\n\nThis entire post is \"I'm a _real_ developer, not like all those fakes and posers.\"\n\nYou don't really get to just arbitrarily declare yourself as caring about something more than other people. And even if you were right, you don't get points for it.",
            "Well the reality is the bar for hiring will keep rising until it’s like finance, where only top schools are worth it."
        ]
    }
]