[
    {
        "post_id": "16z3dpa",
        "author": "Puzzleheaded_Can_750",
        "title": "Fellas, I have done it🙏",
        "url": "https://www.reddit.com/r/csMajors/comments/16z3dpa/fellas_i_have_done_it/",
        "score": 990,
        "num_comments": 93,
        "created_utc": 1696366927.0,
        "selftext": "Got an offer today for $80k, couldn't be more grateful!!\n\nI've only sent out around 50 apps this hiring cycle and have gotten around 5 or so interviews. I attend a state school and only have 1 previous internship at a small company. 3.8 GPA, projects on my resume are nothing crazy, just some fun full stack apps I made when bored.\n\nTotally blew a superday interview but it's all good, took those lessons and improved for the remaining ones.\n\nWishing everyone the best of luck🤝",
        "permalink": "/r/csMajors/comments/16z3dpa/fellas_i_have_done_it/",
        "comments": [
            "50 apps, 5 interviews at a state school? Wow, job well done!",
            "&#x200B;\n\nhttps://i.redd.it/m84pjd5v82sb1.gif",
            "This sub needs more posts like this, congratulations bud!",
            "Congratulations!",
            "https://preview.redd.it/56fs9frek2sb1.jpeg?width=750&format=pjpg&auto=webp&s=b201059e633c2a1f5fd91bb2acb46573fc35f912",
            "Congrats!",
            "CONGRATULATIONS!!!!!!!!! you get to exhale now whew, well done <3 <3 <3",
            "50 apps with 5 interviews and an 80k from a no name school? bro is HIM",
            "Had these exact stats but for an internship search lol.",
            "Would you mind posting your resume (redacted of course) and what job sources you used outside of university?\n\nSuch information would be extremely useful :)",
            "Congratulations! 80k isn’t bad at all for Texas so this is a solid start.",
            "10% interview rate is crazy",
            "Congratulations. You did it!!!",
            "Hello, can you share your resume for us? Many of us have been struggling to get interviews and any advice would help. Also, could you tell which companies you applied for or where are you located?",
            "Which firm?",
            "International student?",
            "[deleted]",
            "Beat you with a 30 hour work weeks WLB and 270k base TC, Congrats though\n\nEdit: downvotes boosting my ego cause people jealous, lmao wait until you find out all this is doable while having a life.",
            "Congrats!",
            "Congrats !",
            "Awesome!!!!",
            "When did you graduate, how long have you been applying, what did you do to prepare for the interviews?\nI’m graduating next semester in the spring and started applying to jobs about a two months ago with no luck. Congrats on the job!!!",
            "congrats fam!",
            "Congrats. Pray for me too",
            "Congrats",
            "Congrats bro!",
            "Congratulations buddy",
            "Congrats man👏👏👏. hope I get a job soon too🙏",
            "Yippeee",
            "I love hearing this shit",
            "Congratulations!!!\n\nQuestions: \n\n1. Local company?\n2. US Citizen?",
            "Congrats!!",
            "Nice! Able to say where?",
            "Bro how 😭 But still, congratulations!!!\nI wish I could get an offer like yours soon.",
            "Massive W",
            "Congrats!!",
            "Great dude! Can I dm you?",
            "Congrats!!!",
            "In person or remote? Big city?",
            "Congratulations man. That salary is a great start to your career.",
            "Congrats!!!",
            "school rank top30？",
            "Hey! 👋🏿. Congratulations on this major win. I'm at ASU pursuing compsci but I already have an associate degree in Science and also successfully finished a bootcamp. The bootcamp focused on the Mern stack but didn't teach Java, Python or any other frameworks. I'm hoping to acquire Java and python skills from ASU. I have an ok resume. Can I share with you so you can give me pointers on what to change? I'd also l8oe to see your resume if you don't mind. Again, congratulations 🎊 on this major win!",
            "❤️",
            "What is a super day interview?",
            "How many projects were on your resume if you don’t mind me asking? First year cs student and I have been doing a lot on my own and in school but I just wanna get a better grasp of what employers will be expecting for internships / jobs so I’m more prepared.",
            "Let’s go dude! Congrats 🎉",
            "Damn that’s impressive congratulations bro!!",
            "Stuff like this gives me hope for when i graduate",
            "Wooohooo! That’s awesome, nice to hear something positive on the sub!!",
            "lesssgooo my G congratulations",
            "Congrats OP! Can I take a look at ur resume pls?"
        ]
    },
    {
        "post_id": "1asgblq",
        "author": "BeingOk9936",
        "title": "Job lottery",
        "url": "https://i.redd.it/30tggofcuzic1.jpeg",
        "score": 989,
        "num_comments": 59,
        "created_utc": 1708109442.0,
        "selftext": "*Its an entry level SWE job.",
        "permalink": "/r/csMajors/comments/1asgblq/job_lottery/",
        "comments": [
            "I remember just last year when LinkedIn didn't hide the amount of applicants behind a paywall.",
            "I mean it looks like it's a remote position with an easy apply option, no shit you're going to get a ton of applicants.\n\nGo to any local posting that's hybrid or in person without an easy apply option and there will be 10x less applicants.\n\nLooking closer at the numbers, I find it hard to believe that 96% of applicants have a degree.\n\nAlso, post the locations people are applying from, I want to see how many aren't even in the US.",
            "50% with a Master's Degree is wild.",
            "Scroll down and let's see where the applicants are from. Cause this sub and r/cscareerquestions keeps telling everyone that 99% of the applicant pool are unqualified people outside the country, so scroll down and let's see who's telling the truth here",
            "Spin the wheel young person, welcome to the show.",
            "https://preview.redd.it/h5tn9ldkv0jc1.jpeg?width=2616&format=pjpg&auto=webp&s=1c827d9caf1753810234bd3f0d821b16035f9c84",
            "That is not an entry level. It's a mid to senior level and requires 5 years of experience. \n\nLinkedIn public job postings are magnets for bots, recruiters and internationals who never read the job descriptions. That's the bulk of those applicants and will be rejected immediately.\n\nWe tried the LinkedIn job postings and we got nothing but junk. Once we changed it to link to our own jobs site and application, the number of applicants for a dozen jobs dropped from 2000 to 50, and 40 of those actually met the minimal qualifications.\n\nLI is a nightmare recruiting tool.",
            "certified glory to arstotzka moment",
            "Out of those 2300 applicants, 2100 are indians",
            "https://preview.redd.it/0noduwqsu2jc1.jpeg?width=945&format=pjpg&auto=webp&s=ea9e178134e7878ff377c5695de34ed4f155d67b\n\n🤷‍♀️",
            "Numbers look worse on dating apps",
            "I will never get a job from my bootcamp 😭😭😭😭",
            "And it’s only going to keep getting worse until new jobs suddenly appear.",
            "[deleted]",
            "Why does everyone immediately have the need to join FAANG and other big companies. I don’t get why people don’t freelance. It’s fun, you learn plenty of skills and pays well too.",
            "It’s over lol",
            "Is this an entry level job or no? Could require a master's degree but unqualified people will apply nonetheles",
            "That's not that bad tbh",
            "Doomposter /s",
            "bruh just apply for the cxo position. ez.",
            "Misleading. It's a remote job. Of course it's going to have a fuck ton of applications. You're competing with the entire world for that job not just one region/area.\n\nAlso kind of funny you hide the company name.\n\nGoing for a top tier company that pays well and is remote is a lottery, but that doesn't mean every job is.",
            "Im just shocked people pay for premium"
        ]
    },
    {
        "post_id": "1bno2aw",
        "author": "shiiiinn",
        "title": "Scariest type of interview === behavioral interview",
        "url": "https://i.redd.it/izepl98hijqc1.jpeg",
        "score": 981,
        "num_comments": 45,
        "created_utc": 1711398540.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bno2aw/scariest_type_of_interview_behavioral_interview/",
        "comments": [
            "The moment you put your masking skills to actual test",
            "I unironically love company outings / meals. I get to have dinner at an expensive restaurant I would otherwise never have gone too.",
            "After 5 you become really confident",
            "Do people actually find behaviourals hard? All you gotta do is talk like a normal person and have a conversation",
            "I love behaviorals. I’m the 30 year old going back for CS so the extra life experience makes that shit a breeeeze",
            "Genuine question, how do you actually do well in behavioral interviews?",
            "Work in retail and do 2-3 prior interviews and behavioral interviews are the best one.\n\nIt's all about lying, not being obnoxious, being metacognitive on what you're doing (posture, expression, nodding, etc.), and stop being so damn technical. You can only mess up when you lie and it goes out of control, don't say some stupid shit like I love watching the Paralympics and then just have broken, utter, retarded silence.\n\nYou're dealing with HR, these guys make sure workers do their asynchronous training, occasionally deal with FMLA, and sit around doing arts and crafts. They don't care you have 2 years of experience in PyTorch.",
            "Just prepare for behavioral interviews like technical interviews and you'll be fine.",
            "i have diagnosed anxiety and behavioural >>>> technical, if i mess up while talking in behavioural i can say \"sorry im just nervous\" and they brush it off if i mess up during a technical they just assume i dont know what im talking about"
        ]
    },
    {
        "post_id": "1bzrn2v",
        "author": "bj_nerd",
        "title": "I Asked Which Portfolio Project I Should Do... A Hiring Manager's Response",
        "url": "https://i.redd.it/cdy7hn0ocgtc1.png",
        "score": 975,
        "num_comments": 153,
        "created_utc": 1712667794.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bzrn2v/i_asked_which_portfolio_project_i_should_do_a/",
        "comments": [
            "Hiring managers will always prefer professional experience over personal or school projects which is why internships are important to land.",
            "I believe people are using LLMs a lot nowadays. \nA small suggestion: Ask a few LLMs this question, \n< Hey, I have this skillset x,y,z could you suggest some unique project ideas. Ideas must be unique with a usable value to the community, You must provide a basic understanding of how to implement each of those projects with pseudocode using my skillset, how to package and deploy the final project. I want you to order the project ideas from simple to complex and you must provide the estimated implementation time of each project>.\n\nThat usually does the trick.\n\nYou will gain more insight on how your simple projects has a big impact. \nNext step is - do not directly put the project name in your resume/cv, Use the fancy real world value added project. Again, take help from LLMs.\n\nHope this helps.",
            "I understand your sentiment, but you might be missing the point of what the recruiter is trying to tell you. Only a gifted and/or lucky few have the talent and resources to make something as an entry-level dev that compares to an enterprise or FOSS app. That being said, there's a huge difference between creating an app exactly the way it's been done a million times versus changing it up to be unique.\n\nWhen you're creating just a simple TODO web app that runs on localhost and nothing more, it's very easy to just copy everything from a tutorial or worse from someone else's code without actually having learned anything. But if you were to take that TODO app, host it on a cloud server, and synchronize it between a web app, desktop app, and mobile app, now you're talking about something that's both more advanced and more unique than the standard TODO. Bonus points if you add in some unique features. You don't have to host the app or make it an official app that others can use, though if you can then that's even better.\n\nThe point is don't just do a straight up run-of-the-mill app. Either come up with a relatively unique idea or else spice up the run-of-the-mill idea so that it's more unique and requires more skill and effort on your part. If you can create something that others can use and contribute to, even if it's a very simple idea, makes a huge difference.",
            "Wow things are tough out there. My resume had nothing but tutorial projects on it when I was a new grad in 2019 and I had lots of positive responses from it.",
            "I mean you are not wrong, hiring is ridiculous.\n\nThat being said, humility, almost to the point of embarrassment, goes a long way too.\n\nFear is the best motivator, don't get complacent with these projects.  Be afraid that you have not created a better one.",
            "Everyone’s saying you got a crap attitude OP but i get the frustration. Dont let them annoy you more like they did to me. People in this sub hate sarcasm lmao. I think ive asked what projects would help me get hired multiple times here and never get a clear answer. “UsE GoOgLe” *makes projects that thinks is unique* “ToO EaSy”. Seems like hiring managers dont even look at projects really unless you get interviewed. Honestly im making a game in unity now as my biggest project cuz idc. Making a website is boring and so far hasnt helped my resume at all. So for anyone wondering im literally in OPs shoes and am wondering the same thing.",
            "   He is right but his response is kinda misleading a little bit. He's right that you should create something close to real world scenario project, not todo app .\n\n However, the following phrase \" Choosing a tool that already exists without innovating\" what's exactly the meaning of it? Does he expect from you as a junior to create something remarkable on the job? And the most important question, if you indeed will be able to perform that, would he raise your salary? So junior should push the limits and perform like medior, but with the salary of junior? That's doesn't make any sense.",
            "Don't listen to these dumb dumbs. Doing tutorial apps is how you get started. It shows you can learn and stay motivated. Of course, you should add unique elements to them and avoid copying and pasting, and actually learn what it is you're doing and why. Then, when you put the project on your resume, list what you learned from doing it. Specifically, things that are useful to an employer.\n\nMy first project was a d&d web tool I built using knowledge I learned from a Vue tutorial. It was not top of the line or better than the competitors in any way, but my employer said it showed that I could sit down start to finish and build something. Then, when they hired me, my first task was to complete a tutorial project for Angular so I could familiarize myself with their tech stack before diving in. This is actually a very common onboarding practice and a useful skill to have.",
            "When it comes to writing a tool, you should write the tool that solves _your_ problem, or if possible, a problem you can identify. Apart from that, yeah, you’re not going to recreate grep. I mean, Burntsushi did, but you can’t be compared to Burntsushi. \n\nBuild tools that are simple, be able to explain why you built that tool and the problem it solves, and how you’d iterate on it. Apart from that, it’s not fair to expect you to build a tool that hundreds will use.",
            "I think without some specific examples it’s pointless to argue this. \n\nMy industry is game industry. And I regularly see applicant portfolios. \n\nA lot of them are copy paste of each other. Some game demo via Unity/Unreal where they followed some tutorials and they didn’t add anything of their own. These don’t get much attention.\n\nSometimes I get a small but a unique demo. A new rendering approach, an interesting shader, or a feature like volumetric fog, some interesting character mechanic etc… And almost always these are not even big things, just a demo of a specific interesting feature that I have not seen before. \n\nI also get occasionally big group student projects. (Like an Indy game built by 10 students etc…) These are of course great, but it’s a bit hard to tell what specifically the person applying worked on. Applicants should make that very clear.",
            "TL;DR, you need to stand out from the crowd with projects. I got as far as I did because I built stuff that personally frustrated me.\n\nChances are, you can download a To-Do app that will do exactly what you're looking to code up. However, I got into the TTRPG known as Lancer a while ago and QUICKLY realized just how fast my game notes got chaotic and disorganized.\n\nSo I wrote a system to fix that. Made an MVP as a Notion template and sold over 100 licenses. I'm currently working on migrating it to a full SaaS app.\n\nI got annoyed trying to write a CTF solver with Selenium, so I straight up wrote a library to make browser-based exploits easier. One of my colleagues I was working with at the time was really really into it, and I want to get back into maintaining it so I can make it better.\n\nFind what frustrates you, that you can't find a solution for elsewhere, and you'll naturally build something unique.",
            "just develop ur own library that every computer uses duh",
            "Ah yes, have an open source personal project that we need so we can use it and not hire you.",
            ">asks for advice\n\n\n> is given advice and is displeased\n\n\n>incoming idk why no one is hiring me post",
            "Your reply is like you didn't even read his comment lol.\n\nHe's not saying he only hires inventors, he's saying that you don't need to waste your time making unoriginal garbage just to check a box for getting hired. He's saying he personally views it as a negative, compared to someone who say went to the gym or read a book while you made these dumb tutorial apps.",
            "I agree with this guy. Doing yet another todo app or similar gives me zero signal about you.",
            "This is y I love this app lots of nuggets here. Thank you to tho all who's contributing",
            "God this is the worst field to be a part of 😂 Hiring managers that think they are hiring the next Oppenheimer to work on their shitty CRUD app",
            "😂🤣 y’all should start a discord and invite me",
            "I love the response. The most ironic part is that the higher up you go in management the less experience you see. Time in jobs maybe - useful experience - no. The standards for new hires are 100x the actual general skill level.",
            "I think you missed their point mate...\n\nThey're not expecting you to be a 100x dev - they're saying that making a replica isn't a good representation outside of a tech demo. \n\nIf your goal was to show \"I can build a similar project with XYZ stack\" - good, and label the goal of the project as such. \n\nIf your goal was to show your creativity and problem solving - you failed by following the blueprint of a product developed by 10's or 100's of people before you did; Without pointing out shortcomings and or providing improvements (assumed from the first comment)",
            "[deleted]",
            "Yeah bro that hiring manager is right, you should just do nothing with your free time instead of building projects, you'll be much more successfull that way trust me bro",
            "Comments like this are why I don’t post much on this sub anymore. I’ve had 5 software engineering jobs (and left each of them for an increase in pay) and know what it takes to get hired. When I try to share that knowledge here, I get yelled at by people who don’t want to hear it. \n\nThis attitude is not helpful, OP. Particularly when YOU reached out for help and people are simply trying to offer the help that YOU asked for.",
            "OP is being a sour grape. You don't need to be so sarcastic and nasty.",
            "If there’s out-of-the-box tools that are open source why not just use it, instead of reinventing it again?",
            "While I think you slightly missed the point (you're not supposed to build something competitive to the big ones but either contribute or build something novel) I also think the post is ridiculous and shows the current state of the market.\n\nWhen we, the people who hire nowadays, started out it was enough to be motivated and roughly know what code looks like ;).\nI think it's unfair to now have a hiring bar that is so much higher ....at the same time if you get hundreds of CVs in a day you obviously have to look for something that stands out",
            "Easy for them to talk, they have no idea how easy it is for them to sit back and judge like that",
            "Did you just repost yourself? You think you sound so smart you came to get some validation? Sometimes people say dumb shit relax.",
            "The biggest takeaway is that you need to be able to manage your attitude in response to criticism. I'm not  a hiring manager and am still in school as a mature student so I won't pretend to offer job advice, but a response like this will put people off. On reddit it's not a big deal, but if you responded like that in real life the hiring manager might end up remembering you as someone who shuts down completely at reasonable advice to throw a pity party.\n\nI understand your instinct, I've done it myself. There's a misleading sense of comfort to hearing something difficult and responding with \"oh, then I'm just the worst ever, I'm dumb and terrible and I was kidding myself when I thought I could do this, in order to succeed I would have to be a better person, so I guess its impossible\". I get it. But its not true, and most importantly  not helpful.\n\nYou gotta put some distance between you and the problem, maybe consider the advice if it were given to someone else if that helps you not shut down. The manager is not saying you have to make a competitive product and they are not saying the projects you suggested are not worth doing. They are just saying they are not great resume projects (which is different from saying they are not good learning projects). They are saying that a good resume project does something different that current products don't do (again, it doesn't have to be competitive, it just has to solve a slightly different problem even if the problem difference is just \"I want something like product x but it also let's me do y), or it contributes to something that exists (I.e. find something open source and try contributing)",
            "Projects do count as it shows you are interested to learn how certain things work and what you can achieve on your own. But he has a point. In reality you do not reinvent the wheel when there is no need or improvement. Meaning in a professional scenario effort must be justified.\n\nFrom a business perspective you just have a plan how it contributes anywhere within the company or generates revenue. If you want geberate revenue with something others already, provide you must know what your unique selling points are or how you plan to get some of the market share despite not being much different.\n\nIn your case, even for your project in the README as a lab/personal learning project it would be nice to first summarize what your expectations and goals are/were, what you ecountered and learned and what you could do better or as he says what you did different to other solutions.\n\nI would say if you can do that it shows good practice, reflection and the ability to research and formulate a task and track your progress.",
            "I think you misconstrued what the recruiter is trying to say.\n\nThey're trying to say that being original and coming up with a new tool is more impressive than following what is already established. They did not mention anything about the 'quality' of the product, but your response seem to tunnel into that.\n\nAnd if you look at it this way, I am sure you will agree as well. For example, I can follow a Youtube tutorial and make chess from scratch. Is the act of making a complex game like chess by yourself impressive in a vacuum? Yes. Do you need to have knowledge to make it function properly? Yes. But does knowing that there are tutorials on Youtube change your perception of the project? Also yes.\n\nI don't know the context behind the recruiter's comment and whether they're referring to your personal project or in general, but if your project is the result of well documented methods for achieving the same results, I would have the same sentiment as the recruiter. It suggests that you make 'easy' projects to put on your resume, they are essentially resume fluff and reflect negatively on your profile.",
            "You have many technical answers here like \"make an app controling a machine via IIoT\". OK, crazy. My approach would be completely different, including a business point of view. You can think about \"What businessmen/companies around me need\"? You can ask friends, even family. You can ask your mom: \"Hey, mom, what app would really help you but does not exist\" (or exists but does not work well)? With this approach you will maybe not boast with something technically crazy but you will show you know something about real life, business and that makes you stand out as potential future manager, not just a cog in a corporate machine. During one interview, they asked me: how many real users does your app/website have? How does it help to the end-users?",
            "Pretty sure they’re saying to make something that at least tries to improve on the currently available, even if it only applies to you. My personal projects apply to things that help me or would help me and fit my needs, or at least have a unique gimmick compared to existing apps.",
            "What he’s saying is correct, and your response was childish. \n\nHe’s saying to make projects that require problem solving, and actual thought to them. Not some easily searchable tutorial project that you can throw on your resume. I recommend picking a hobby of yours and trying to think of a way an app/ a tool could help you enjoy that hobby more, and build it from scratch.",
            "Sounds like a skill issue to me",
            "my takeaway from that is don't use school projects in your resume unless there are original aspects to it. Like if every student in the program did something similar what's the point of having that on the resume its the same as writing I graduated from x school with a undergrad. Side projects don't have to be all original code but it should demonstrate your problem solving ability on your own. What i mean by this is your side project shouldn't be following instructions. But i get it. It kind of sounded like the recruited wanted you to build something completely original when that is most likely not the case.",
            "As people have said your attitude is horrible. But as far as the content goes I agree if we're talking about an entry level job. It's pretty ridiculous to expect innovative projects just for a shot at an entry level job. But that's just how it is when there's a lot of competition.",
            "They dodged a bullet",
            "Oh my goodness! What projects you did, that’s impressive! I want to give you an interview in one of the MAANG internships, ready to start tomorrow morning? That’s password strength calculator will take you far to places !!!",
            "Welp.  That's depressing.  Studying this has been the worst decision in my life.",
            "I'm not CS (EE), but are projects really worth a damn? Anyone can put any project on their resume. There are also a ton of online resources to guide you through a project. I don't feel like it does anything to help you stand out amongst hundreds of other grads",
            "They’re completely right though. Nobody cares if you can do what lost of other people can do. That’s not impressive, regardless of your jr level. They’re only interested in hiring the very best candidate, so you need to do something to stand out.\n\nThe sarcasm really wasn’t helpful. You could have just asked them to give some examples.",
            "Sounds like the guy is saying. You should have a purpose for why you are building the project and not just build the same stuff. From my experience people care more if the project you are building is to solve your personal problem. That way it doesn't even matter how complex it is."
        ]
    },
    {
        "post_id": "18dc7yx",
        "author": "PrintSuspicious1449",
        "title": "Name and Shame: Visa Inc.",
        "url": "https://www.reddit.com/r/csMajors/comments/18dc7yx/name_and_shame_visa_inc/",
        "score": 976,
        "num_comments": 64,
        "created_utc": 1702001989.0,
        "selftext": "So I went through the lovely recruitment process for a software engineer new grad with Visa Inc. this year. Applied in October, aced the code signal, and they requested a first-round interview. I gave my availability for the next 7 days. 5 days go by nothing. I reached out and got a message a day later saying they're trying to schedule ASAP and ask for additional availability for the next week.\n\nThen before I can even reply I get an email from the lead recruiter giving a time for an interview the next day in the morning. The interview went well. Then nothing for 2 weeks, At this time I got another offer and informed Visa of said deadline.\n\nThen finally after another week and a half, almost a month since my first interview. I got an invitation to a final round, and the recruiter asked me to get a week and a half extension for my offer. Which I then did.\n\nFinal interview time, I'm talking to my potential future manager going great. In the end, he asked me about any offers and I explained. He basically said, \"I think you'd be a great fit, our recruitment processes have improved a lot and we should be able to get an offer in front of you before your deadline and I hope you sign it. I look forward to you joining the team\".\n\nSo of course I'm ecstatic. Then the next day my recruiter reached out and asked me to get another couple-day extension in addition because \"we need till the end of the week to confirm results\". I'm somewhat sussed out but I ask and somehow get the extension anyway.\n\nI was told I'd get an update this morning. The morning of the day my other offer was due. I waited patiently as the morning rolled past. Nothing. Around 2 pm I emailed the recruiter to check in \"Well have an update by the afternoon\" they replied. Fast forward, now it is 8 pm my time. Left with basically no choice, I send another email asking whether or not I'll get a decision today. 4 minutes later an automated rejection email from Visa hits my inbox. All I can say is what the fuck. Like not even the recruiter reaching out with a rejection. After I was told in everything but print I was hired and extended an offer deadline twice. Like why couldn't they have rejected me a week ago?\n\nI don't even know what to do anymore tbh.\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/18dc7yx/name_and_shame_visa_inc/",
        "comments": [
            "scummy practices? terrible recruiters? yeah that sounds like the visa i know. consider this a dodged bullet",
            "Never assume you have the offer until it is in your inbox. With that being said, super scummy stuff by them by leading you on for so long.",
            "I’m pretty sure the Visa hiring manager decided to keep you hanging while they are screening other applicants. You are VERY good, but STILL not good enough for them to not want an even better candidate. I always pressure the employer to either offer before my other deadline or I will withdraw, tbh.\n\nThe way visa behaved is unprofessional (usually they inform me implicitly - I can read between the lines - or explicitly that they are still shopping despite I am the top candidate so far that has finished the whole loop), but I’m also surprised that the other company extended your deadline TWICE - you were already playing with fire at the 2nd extension. If I’m hiring, no way I’d extend a 3rd time - no new grad is THAT good.\n\nAlways remember: An offer dragging its feet is not worth an offer already in your hand. I would just sign the offer in hand, and if Visa really gave a much better offer, back out of the former one, if I decide the bridge is not worth keeping. Was the other company that much worse than Visa?! such that you’d drag them on without accepting? Now that they’ve canceled on the 3rd extension request, the bridge has clearly been burnt anyway.\n\nEdit: I misunderstood; it’s Visa who rejected, not the original offer company. But still, don’t hesitate to sign an already extended offer for an offer dragging its feet, as explained above.",
            "I don't get why you extend offers TWICE. Accept the damn offer and if VISA comes through just go over there. There is 0 logic in extending offers like that",
            "Made it to the last interview at Comcast for their SWE internship last year... interviewer said I did amazing, was excited to work with me, and should be expecting an offer within the next week. 2 weeks go by, I email the recruiter, and she said I was no longer being considered for the role. Absolutely sucks. It was right before Christmas also, I was so excited to tell my family about it.",
            "Looks like a recruiter problem. I was in a very similar situation as you, and my recruitet fast tracked me very well..",
            "Jokes on you, I got resume rejected by them.",
            "Still u have an offer that matters!",
            "Just accept both, Visa clearly doesn’t give two fucks.",
            "The company that gave you two extensions sounds like a great place to work lul",
            "Here’s something I’ve noticed: if you have an offer deadline, you can tell them about it, but don’t ever push them to make a decision… because then you are making it like a deadline for them too. Companies would rather miss out on a good hire than hire a bad employee or hire if they aren’t ready for some other reason.\n\nI’ve been in this situation before too, and made this same mistake last year.\n\nI think next time if you are in this situation, accept the competing offer, and just wait for the recruiter to get back on their own time. If you do end up getting an offer then you can think about whether it is worth reneging for.",
            "Accept other offer first and then kept going with visas bullshit for a bit is what I'd done",
            "Which team is this?",
            "WTF is this? Well they should burn in hell for this.",
            "Not get your hopes up, and don't fall for that 'extension' crap again. It's for their benefit, not yours.",
            "What’s ur resume looking like? Just out of curiosity. I’ve applied to every new grad visa position but it’s all been rejections.",
            "Yeah, for anyone like this who likes to waste that much time accept the first offer and consider jumping ship if the 2nd comes through, but these big companies like pomp and circumstance to such a huge extreme that if you don't follow suit, you're in trouble.",
            "Name and Shame all the names you know. They play with candidates. Should be illegal smh.",
            "[deleted]",
            "it seems like ur just mad u didn't get the offer. these things take time. u were prob better off not rushing them so much. there's nothing wrong with accepting the other offer and reneging",
            "Thank you for naming and shaming",
            "Very unprofessional by Visa..\n\nThough can you pls tell me how did you get the OA for it? You just applied on the careers page, or took a referral, or something else? I'm also a new grad but not getting any OAs by good companies..",
            "This happened to me years ago with Visa Inc. I went through 3 rounds of interviews, and at the final round, everything (seemed to me, at least) went well. As a matter of fact, the hiring manager even brought me around the office to meet the other members of her team - who would be my immediate colleagues. Then silence. I sent emails, and I even phoned the recruiter. No response. I didn't even receive a rejection email. No idea what happened there.",
            "which team?",
            "Last year happened to me. I received a verbal offer and the recruiter said “X team is excited for you to join as an intern”, then I never received a written offer. Three months later I received a rejection.",
            "Was this for the new grad position in Atlanta?"
        ]
    },
    {
        "post_id": "jxglim",
        "author": "Electrical_Ad_9568",
        "title": "Why has CS become such a Dick Measuring Contest",
        "url": "https://www.reddit.com/r/csMajors/comments/jxglim/why_has_cs_become_such_a_dick_measuring_contest/",
        "score": 972,
        "num_comments": 176,
        "created_utc": 1605838665.0,
        "selftext": "Like seriously...\n\nPast internships? 5x FAANG+Unicorn\n\nTC? 400K+\n\nGPA? 4.0\n\nUniversity? T5 CS\n\nWho gives a fuck lmfao, just do your own stuff and live the best life you can.\n\nLife's too fucking short to compare yourself to others.\n\n*PS: Because people have been asking, TC = Total Compensation (Base, Stock, Bonus, etc.), Unicorns are privately held startups worth over 1 billion (e.g. Stripe, Airbnb, DoorDash)*",
        "permalink": "/r/csMajors/comments/jxglim/why_has_cs_become_such_a_dick_measuring_contest/",
        "comments": [
            "r/csmajors kinda reminds me of r/applyingtocollege pt. 2 tbh",
            "because a portion of cs majors are only cs  majors because they think that going into cs makes you better than people who aren't in cs and ofc those people are also going to want to put themselves above their fellow cs majors",
            "Let's be honest, computer science attracts a certain demographic at times. Part of it is now popular culture BS where comp sci is a bunch of genius hackers. Part of it is reddit started off and still is made up of people in the tech industry. I have doubts about how much of it is true, but if it is, you have to remember it's just that those posts get upvoted, it's not the norm. \n\nAnd yea I agree every hobby becomes a bit competitive online. Even innocuous ones. There are people in r/sewing bragging about their hemming ability probably lol",
            "I came into CS because I was really interested in the theoretical aspect of CS. Also the applied side as well. But unfortunately most CS subs on reddit are all like \"FAANG\", \"GRIND\" and \"6FIGURES\"\n\nI really blame the youtube gurus who make CS sound like a gateway to upper middle class when in fact most CS grads don't make 100k right out of college. Srsly, fuck these influencers. I literally see bs software gurus everyday on ig and YouTube and it's annoying as hell, and claiming you can make 100k with javascript only in 3 months. When did this profession became an instant gratification? CS is not a skill you learn in one day. You have to keep constantly learning and have to go through all the frustration to become better.",
            "I’m just out here chasing a six figure salary to fund my side hobbies. I could careless about working at FAANG or in California. I just want a reasonable cost of living and the ability to live my life. Most people on this sub seem to have the live to work mentality, and I’m all about working to live. CS is a means to an end.",
            "We’re on Reddit so the degenerates need to flex",
            "because life is a dick measuring. I doubt there is a single field where people are not competitive and like to show off that they are the best.",
            "The problem is that people like to compare and brag about their TC on Blind and it has since then become a downhill trend. Those things don't matter as you built up the job experience over time.",
            "The skills are very tangible and the accomplishments are easy to list. Not as easy to do as say a lawyer or doctor, those are more reputation based.",
            "Yo was just telling my partner how I have to stay off this subreddit bc it fills me full of self doubt. Yet here I am again. Ooops.",
            "Every field is like this- law, medicine, banking.  It's all meaningless bullshit, just live your life",
            "I graduate next semester and the only thing I recognize here is, \"GPA\" and \"past internships\".\n\nThe fuck is a TC or a Unicorn?",
            "Dude I just want enough money to play video games and eat when I get home from work and retire healthily",
            "Because they’re a bunch of nerds who suck at everything but their nerd shit",
            "this trend of applying for the most competitive & prestigious (and therefore usually most well paying positions) is something that is occurring across most of society in a variety of age groups. others have written about this in more depth, but I will try and summarize what I know\n\nbasically my general understanding is that for most kids - applying to the most competitive & prestigious slots has been the sole guiding metric of their lives. look at all the work that goes into \"trying to stand out\" for college admissions, internships, and even high school admission\n\nI don't think any of this is ill-intentioned, everyone wants their child to have a \"better life\" - and getting a slot at a well known college or whatever is a good way of helping guaranteeing that\n\nthe issue arises when it come time to graduate, and suddenly the \"optimal path to follow\" falls apart. what to do with your life isn't so clear cut anymore, getting into a  \"get into a good college\" has become \"decide on a career that will help define the rest of your life\". since the latter is so much more open ended, I think many people default to the next best thing in their mind, a industry or company that has name recognition, \"prestige\", is competitive, and pays really well. \n\nthis basically translates into a few firms within law, finance, tech, consulting, etc. even if this really isn't what people want to do with their lives. they substitute real passions or interests with what always has defined their identity & self worth, the ability to get into a \"well respected\" role few others can\n\nthank you for coming to my TED talk",
            "Start applying for jobs and you'll see why. Blame the game not the player",
            "[deleted]",
            "Am I the only one who thinks CS majors aren’t all that bad? I didn’t interact with my classmates much but so far people I met didn’t seem to flex much. If they were arrogant they hid it well.",
            "Dick should be hard. \n\nLC hard, Long cock hard.",
            "I think a big part of it is how crazy internships and new grad TC are in CS compared to pretty much any other major. People generally equate money to success, so they want to flex these crazy salaries they get. I haven’t heard of a CS major flexing their GPA though.",
            "No one gives a shit about your GPA, homies",
            "Sounds like someone’s upset that they don’t got the biggest shlong lol. People on the CS subs are just sharing their experiences in the field. If anybody’s making comparisons and measuring it’s you.",
            "What the hell is TC",
            "Dawg the worst part is you got mfs who also just knowledge hide, and don’t share the code to their work or how they did something cause they are afraid someone will catch up to them.",
            "always has been, always will be. C'est la vie",
            "Hahaha being a girl in cs",
            "We’re social animals",
            "[deleted]",
            "Yeah I mean, people crave high achievement and prestige. It’s common in any high skill domain. It’s actually a good thing.",
            "Bro your title was the exact phrase I needed to fit this description. Thank you",
            "TC should always also come with the average house value and etc in the area of employment.  \n  \nYou couldn't pay me enough to work in California or New York.  \nNo way I'm going to entertain the idea that there's a salary good enough to live in a van.",
            "My theory is that people are nervous about making a living and insecure that they actually have the skills. \n\nSo they try to get a bunch of external validation.",
            "It’s way worse on blind",
            "The entire point of grinding LeetCode hard, getting a good GPA and getting sick sick TC is to put down others who haven't managed to do so.",
            "Man I’m just trying to get a job",
            "i see more of these posts or posts of people being salty/anti-faang then i do flex posts or people being like oMg TC?!?! tbfh bc a good chunk of this sub is insecure asf\n\n^(except on blind), blind pretty toxic but funny af sometimes\n\nme im just tryna have fun working on complex/cool stuff/cutting edge projects at work,  retire by 40, buy a big house ^(mansion) and a big library, travel the entire world and pursue my hobbies, and give my kids a 🔥 life. 400k/yr would go a long way for all that ;)",
            "Selection bias: the people who talk about putting in a moderate amount of work for an above average salary and reasonable work life balance don’t post as much to evangelize their existence or vent about the frustrations of their own decisions.",
            "It's just this subreddit. Basically no one else gives a shit.",
            "I only got 3 internships this summer and my GPA is suffering at 4.1 how am I going to get a job?? 😭",
            "Gotta compensate for my smoll pp somehow",
            "I just need my bread and butter worth and stay happy. Nothing beats targeting 'staying happy' as a life goal",
            "True this. I used to feel bad cause a lot of my friends are smarter than me/have more work or project experience. But then I realized that I don't even wanna work at a FAANG company - totally fine with working at a local company making enough to provide for myself and have some leftovers.",
            "I remember some time ago sharing TC was useful so people can have an idea of the lay of the land. Especially for companies that weren't particularly well known where getting data from your network would normally be difficult. Then it devolved which in retrospect isn't surprising.",
            "Which position pays 400k?!",
            "It's all about supply and demand. In an area where all tech giants are hunting for talents within that community, they would pay top $$$ to get you. \n\nFor fresh out of college students, they are lured by the promises of a good paying white collar job so they flood the job market. When in fact, the jobs in high demand should be doctors, lawyers, and hedge fund managers!",
            "..... well I have 150 applications and no interviews. Beat that!",
            "Don’t look at Blind then, that app is awful",
            "I mean, what's the point of going to an elite school and earning 10x the amount of money u need to live comfortably, if you can't shove it down the throats of the less fortunate. If you reached this point, the only milestone left to achieve for you is dying.\n\nPS:  I'm not even in the US. Don't blame me for the sarcasm."
        ]
    },
    {
        "post_id": "17ojaux",
        "author": "GroundZer01",
        "title": "My hunt for a part time SWE position before I graduate in spring",
        "url": "https://i.redd.it/xsxbontwwkyb1.png",
        "score": 974,
        "num_comments": 19,
        "created_utc": 1699211763.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17ojaux/my_hunt_for_a_part_time_swe_position_before_i/",
        "comments": [
            "You have to wait through phone interviews? Most of the offers I get are purely from my cover letter and resume",
            "Only 6 offers and none of them are 7 digits. Honestly, better to go for a masters.",
            "Weak, you can do significantly better than one CEO offer in this market smh.",
            "Interviews? Dude, just show up at your family office.",
            "How did you make this graph?",
            "I think he is joking",
            "not gonna lie this one got me till I remembered what day it was",
            "Did you solve the leetcode problem through the phone? That is pretty impressive",
            "this is how i imagine recruiting for boomers looked like",
            "750k lets fucking goooo",
            "[deleted]"
        ]
    },
    {
        "post_id": "vgr69p",
        "author": "fett2170",
        "title": "Never realized how accurate HBO’s Silicon Valley portrays big companies until I started interning at one",
        "url": "https://www.reddit.com/r/csMajors/comments/vgr69p/never_realized_how_accurate_hbos_silicon_valley/",
        "score": 967,
        "num_comments": 135,
        "created_utc": 1655746877.0,
        "selftext": "Always thought it was hilarious how the employees of Hooli behaved. Talking about Gavin Belson like he was a deity and all the corporate speak/fake smiles.\n\nLiterally the same thing is happening where I am interning. “It was a transformative and rejuvenating experience talking to our CEO!” “What was the most life-changing insight that you heard in your breakout rooms?” “Oh, my friend I met working here is no longer with us [with an ominous tone, makes it sound like the person died when they just left the company].” “If you were sleeping and you’re now woke, it’s time to do the work! Our company really values social justice!”\n\nMeanwhile, a lot of the other interns are just gobbling up this stuff and I’m here wondering if I’m playing oblivion or Skyrim and interacting with NPCs. Am I an NPC? \n\nI should mention I am not in an engineering role and working with data and people in finance.\n\nMy favorite scene(s): https://youtu.be/m7EqMtLpU3c",
        "permalink": "/r/csMajors/comments/vgr69p/never_realized_how_accurate_hbos_silicon_valley/",
        "comments": [
            "Get high enough in any large corporation and this shit is endemic. My wife works at a really large health insurance company, and listening to her zoom calls, it's like a pyramid scheme/cult if you didn't know any better. They're all really fake happy and talk in code the entire time. \n\nMy best takeaway is that there's no such thing as a \"sales pitch\" anymore, it's called a \"value story\".",
            "\"Failure is growth. Failure is learning. But sometimes failure is just failure. I think... I'm sorry. I didn't think it would be this hard. But goodbyes are always hard, especially when I am the one saying goodbye. Today, effective immediately, I, Gavin Belson, founder and CEO of Hooli, am forced to officially say goodbye to the entire Nucleus division. All Nucleus personnel will be given proper notice and terminated. But make no mistake. Though they're the ones leaving, it is I who must remain and bear the heavy burden of their failure.\" - Gavin Belson",
            "You haven't made it until you have a blood-boy",
            "As my old manager used to say - whenever you get more than two people in a room, you end up with politics.\n\nJust get used to it and, ideally, learn to play that game.",
            "[deleted]",
            "it's like being in a dilbert cartoon.",
            "Some people put a lot of themselves into work, same as people who do the same with sports teams, TV shows or just pick a random hobby. It may not be your thing and it's weird to see from the outside and gets worse the further from engineering you get.",
            "Lol I'm at amazon and they parrot the leadership principles so much. Always talking about customer impact, diving deep, etc... Honestly kinda a vibe, customer impact is cool.",
            "Tbh in engineering you see less of this bullshit but it's still there to some extent and it depends on the company, personally I don't follow any of it and just output good work and it doesn't hinder my career, although you definitely see it more in engineering **management** especially higher up, but as an IC you can ignore it",
            "You are not an NPC. People just drink the kool-aid much easier.",
            "It does take a dominant CEO or a reputation for the company to be “something special”. For example, Google was like that early on and managed to maintain that impact into the early 2010s. It was about making it to an exclusive club plus believing you were contributing to something big, etc. Now it’s more like IBM. Yes, it’s still a good place to work but the current CEO or the company don’t instill the same excitement.",
            "(_Erlich getting the shit beat out of him_)   \nGilfoyle: “I think he knows.”",
            "Weeks into my FAANG internship and it certainly feels like I’m in a Big Head simulator.",
            "I mean it's sort of accurate but they exaggerate the shit out of things (which is fine, it's a sitcom).\n\nPeople write in corpspeak when speaking to larger groups, but if you talk to people 1:1 they usually aren't drinking the kool aid too hard. And writing in the local corpspeak is far from specific to big tech.",
            "Most of your coworkers probably feel the same. They just put a front up because they're used to their higher ups/coworkers doing it when they themselves joined.",
            "Yup, one of my coworkers and his wife worked at big tech companies in the Bay Area since the 90s and while this is fiction, it’s absolutely not a stretch to say that everything was based on reality. He was naming people that certain crazy personalities/stories were based off or left and right. Most notably was that Steve Jobs would always order in whatever food fit his current diet at the time (vegan, fruititarian, etc) for meetings at Apple/next and then… not eat any of it. He always ate after or had something else brought for him. Just one example of craziness that the show was accurate to",
            "Capitalism is one helluva cult drug.",
            "My chinese friends like Amazon cause it feels like home. The 14 leadership principles and whatever the communist party makes people sing feel very familiar and interchangeable to them",
            "Yeah, especially Brogrammers and Teslas were the two most notable aspects for me.\n\nAlthough suffice it to say, I haven't seen anyone who's Dinesh levels of idiotic.",
            "My current company (which I'm soon leaving) has our corporate values plastered all over the office and in emails and it's generic stuff like Respect, Financial Responsibility etc. All super vague and stuff you would absolutely expect as standard from any successful company. I used to say to y dev manager that it's all kinda hollow and you can tell it's just trying to be feel-good without actually doing anything and he would agree. Its like everyone knows its empty but we all universally agree to pretend it actually means something so its always there and the facade never falls. But then as he started spending more time with other management style people he started to slowly become a fan of them and trying to convince me that they're genuine. I feel like as you get higher up and further away from the hands-on bits and the people doing the actual work, it gets harder and harder to show you're involved in any tangible way so they have all these buzzwords to try and keep looking like they're part of the team and eventually they just convince themselves it counts",
            ">“If you were sleeping and you’re now woke, it’s time to do the work! Our company really values social justice!”\n\nlmao",
            "No you are not an NPC. The reality is there are a lot of followers not a lot of leaders. It's the leaders who question everything, who push on the status quo. Not many of us exist, lots of people want this quote to be them but it only pertains to a few of us.\n\n&#x200B;\n\n>Here’s to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They’re not fond of rules. And they have no respect for the status quo. You can quote them, disagree with them, glorify or vilify them. About the only thing you can’t do is ignore them. Because they change things. They push the human race forward. And while some may see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world, are the ones who do.",
            "They really got all the details right down to the Harvest Coconut water",
            "I think we are all npcs in the grand scheme of things",
            "I interviewed at Amazon and realized Amazon worships Bezos like Hooli does to Gavin Belson",
            "You don't have to work in a tech company to see this. Bill Gates had a whole documentary made about how amazing his brain is. Apparently, it's constantly filled with praise after praise of how so goddam brilliant he is.\n\nAlso, my favourite quote from the show:\n\n\"I don't know about you, but I don't wanna live in a world where someone else makes the world a better place, better than we do.\"",
            "Such an insufferable show",
            "Now watch The Circle (2017 movie) or better read the book to see where its going.",
            "It is not a sitcom, it is a documentary.",
            "My gf has worked at two major cloud software companies and we rewatched Silicon Valley with this context (plus everything that has happened with respect to VR, Crypto, and Web3 since the show’s original airing) and it is uncanny how close to home the satire hits to reality. Unbelievably well-written show.",
            "im thinking of starting this show , should i start this or are there any similar ones (my fav shows till date are house md and mr robot , and sherlock too )",
            "I remember the founder of blender saying that the show was an accurate representation of the tech industry during the 90s tech bubble.",
            "I worked for a large bank.  I was on a huge conference call when a woman said she had a passion for Six Sigma.  Thank God the phone was on mute.  I could not stop laughing.",
            "a large group of people are living their life for the company on the belief that if they do it just right they might clear 7 figures some day.  its dehumanizing.  \"we accept all people as long as youre that one type of people.\"\n\n&#x200B;\n\nSomeone I used to work with posted on social media \"Working at facebook has made me a better mother.\"  it still makes me gag.  she was also the \"back stabber\" of office politics.",
            "There's a lot of cleverness in SV, but it still feels like Big Bang theory to me at other times.\n\nI think Halt and Catch Fire does an insanely good job at capturing the smoke and mirrors of big tech.",
            "Ever worked on the other side for the startup? Dead on accurate as well."
        ]
    },
    {
        "post_id": "mbgwtu",
        "author": "CDFalcon",
        "title": "To all the freshmen on this sub",
        "url": "https://www.reddit.com/r/csMajors/comments/mbgwtu/to_all_the_freshmen_on_this_sub/",
        "score": 954,
        "num_comments": 134,
        "created_utc": 1616512418.0,
        "selftext": "Go enjoy your life. Get off this sub. You are valuable, talented individuals and will certainly have a successful career without selling your soul to this endless rat race propagated by so many here.          \n\n  \nYou don’t need to start learning algorithms and leetcode immediately. You can actually enjoy your first year at college instead. Go make friends, play sports, try out a ton of clubs, pick up an instrument, experience your school’s traditions, **live your life**. There is so much more to your college experience than internships, despite what some on this sub would say.           \n\nThis post isn’t attempting to discredit the value an internship can bring to your career prospects. You certainly should try to get one! However, you don’t have to start interview prepping the minute you step on campus. For me, I just enjoyed freshmen year. Sure I applied to a few first year places - totally bombed a Microsoft interview lol - but certainly I never spent more than a few hours total interview prepping and working on my CV that first year. I got an internship 3 weeks before the summer started with a no-name government contractor in my hometown by networking around when I visited home. I originally was just going to study abroad but ya know, COVID. If anything, that internship was a glorified EE internship - pretty much no programming. But it was experience, and valuable experience at that which I didn’t need any leetcode for.            \n\nStarting sophomore year, I took internship hunting a lot more serious. Learned Leetcode, applied to a billion places, etc, and had far better results. However, I did not accomplish those results by spending all my time interview prepping freshmen year. To be blunt, you don’t really need to. I don’t think I could have even learned much leetcode until after I took Data Structures and Algo’s, and I didn’t do that until second semester freshmen year.            \n\nI cannot imagine what my life would be like right now if I had not taken time to enjoy freshmen year to the max I could. I would not have the friends I have right now, I would not have met my gf, I would have lost so many valuable memories and experiences. Freshmen year is special - in my experience, it’s true that the friends you make your first year will be your friends for the rest of your time at college. So please, don’t be a leetcode hobbit who sits in their room all day doing nothing but worrying about internships and their career. Go have fun :) there will be time for this stuff later.            \n\n.          \n\nEdit: a few people have been replying and saying that they think this post is encouraging freshmen to slack off or not care about their careers. I hope I didn't come across that way as that was not my intention. My main point is merely this: **don't feel pressured to spend all of your time interview prepping as a freshmen; instead focus on classes and life.** If you want to interview prep, that is totally cool and good for you! Just don't obsess over it or let people convince you that grinding is absolutely essential for freshmen to have any chance at success.",
        "permalink": "/r/csMajors/comments/mbgwtu/to_all_the_freshmen_on_this_sub/",
        "comments": [
            "Rest is just as important as work.",
            "Also to add to this, for those dead set on just getting a job: good luck passing a behavioral interview if the only thing you did in college was grind algorithm problems in your dorm room\n\nalso good luck not ending up in a mental hospital\n\nthis is what i imagine happens to those leetcode grinders after they graduate: [Link](https://youtu.be/_o7qjN3KF8U)",
            "I am not learning leetcode. I have not taken any cs classes either. I am doing gen ed reqs but still, I do not have a life lol",
            "Fuck yeah ! This sub is becoming Blind 2.0.",
            "What about the freshman souls who never made it to their college campus due to covid😅 Absolutely no social life right now...",
            "Graduated in Dec, employed by Feb. 2, Full Stack Sof. Dev. If I can do it, you can do it. Trust me. I am not a genius. I am a 29 yo who when back to school at 25. I watched as literal geniuses 10 years younger than me flunked out or changed degrees simply because they didn't do the work. All you have to do is get the degree, no matter how you did it, it doesn't matter. Apply to at least 10 places a day, and get dat foyst jobby.\n\n&#x200B;\n\nAlso, I fucking party harder and more than I ever have in college now that I have a job lol.",
            "While I would agree with the general spirit of your post, I also think that it's easier to absorb a lot of information spread evenly over 4 years than over a mad rush in the last year.\n\n>You don’t need to start learning algorithms and leetcode immediately.\n\nLeetCode doesnt have to be 'bad'. It can actually be quite fun. The majority of people that are burnt out on this sub try to pack way too much into a too short timeframe. They want to find a job NOW but in reality they have one year of self-study ahead of them before that can happen.\n\nAlso, the benefit of internships cannot be overstated. And for that its worth getting a few projects done over the first couple years to beef up the resume for the junior year internship and use that to get an even better internship\n\nMy argument is not to NOT enjoy freshman year, it;s that if someone works 'smart' a a little bit each week, you can spread the work over a better period, remove a lot of the stress, and enjoy all FOUR years instead of just the first one.\n\nSo I think its worth thinking of the 4 years as 'its a marathon, its not a sprint'. Even a 30-mile mile hike can be somewhat pleasant if you run very slowly, or even walk parts of it - or even better, run it in 4 chunks over a few weekends. However the same hike starts to be really shitty if you have to start and end it on the same day.",
            "This is great post-pandemic advice but a ton of students are stuck at home with not much else to do; might as well grind at that point. As soon as I get back on campus though the foot is coming off the gas.",
            "Yes!  So much yes!  Don't waste your college years grinding Leetcode just for FAANG.  Enjoy this time.  Take interesting classes (even if they're not CS classes - I personally love philosophy).  Join a cool club.  Pursue internships that interest you.  Get involved in research.  Explore your local area (when COVID is over, at least).  Go camping or skydiving or snorkeling or whatever it is you've always wanted to do.  Attend campus activities.  Have a little fun!\n\nI'd also like to add onto this that CS is *so much more* than just generic software engineering.  Software engineering is great if that's what you want to do.  But you don't have to limit yourself to just grinding Leetcode and DSA problems to work as a software engineer.  There are more career options out there.  You can work in cybersecurity, machine learning, data science, game dev, robotics, embedded systems, or IT.  You can develop compilers or operating systems or design programming languages.  You can get into CS theory if you really want.  There's more to do this just Leetcode to become a full-stack developer.\n\nAdditionally, there are more ways to get a job (even a software engineering job) than just Leetcode.  Often times, who you know and how you sell yourself are *way* more important than anything else.  Spend time brushing up your resume.  Work on cool personal projects.  Make a personal website or blog (also great for improving and demonstrating your communication skills, which are very important too).  Go to some local meet-ups or user groups and get to know professionals in your area.  This will help you so much more than grinding Leetcode, and it's a lot more fun.",
            "Go get drunk",
            "[deleted]",
            "You do not need an internship freshman summer !!!!!!!!!",
            "Nah bro, im grinding leetcode everyday. Im getting that faang job and im gonna provide for my parents",
            "I'd be enjoying myself coming from \\[Georgia Tech | MIT | Caltech\\]. You know, I understand your standpoint, but, judging from your post, you seem to be talking from a privileged position.\n\nHonestly, 4 years are not even enough to finish building your resume and targeting good career prospects post-college.\n\nAnd I disagree with you on being a Leetcode hobbit and not having friends. Buddy, I have loads of friends that I still hold from my first year. I get wasted at least once every two weeks (as a good undergrad). I allot myself leisure time every day (this month only I finished GoT and Mr. Robot). I exercise every single day. I have a girlfriend and we spend most of the week together; we go to the movies very often.\n\nI landed three internships this year: Google, Lyft, and Odoo. Guess how? Grinding every single day.\n\nI agree with you on one part: leisure time is essential to survival. I disagree with you on doing it for an entire year.\n\nFrom here I'ma get all Plato on you. But I believe that life consists of ease and thrust movements. Push, rest, repeat (I'll probably write a book someday).\n\nSpecifically for internships, most of the time the outcome is unpredictable. I believe that landing a job at a FAANG, or any company for that matter, is comprised of a multifactored formula: right timing + preparation + luck. From those 3 factors, the only one you can control at will is **preparation**. I'm not trying to get all Tony Robbins on you, but more in a mathematical approach. The other factor you can pseudo-control with probability is **luck**. The interviewer did not like you, you had to solve a problem from a topic you did not study well, or they just simply did not read your resume; all of that has happened to me, and it sure sucks.\n\nBut let me ask you, what happens if you repeat that process a gazillion times? I don't know if you remember from your probabilistic subject, but if you throw 2 dices enough times, you'll end up having a Gauss distribution, whether you expect it or not.\n\nYo, don't do anything if you don't want to. If you're happy with your life, be my guest. I'm not trying to convince you, life is not black/white. You can be a fucking Leetcode hobbit and enjoy your life. If you want to do amazing things in life, you need to grind, whatever that means to you.",
            "Senior here. No internships, no side projects, $60k in debt, and living the good life. We’ll see where everything takes me. Spent the better half of my college career slaving at a job for most of my time.",
            "Just to add this, I graduated in December without ever having an internship throughout school and decided just to work to never have loans out, and here I am with a full time SE job at a great company. Working at a FAANG/Unicorn ain’t all that tbh, take care of yourself before committing to the Leetcode dream.",
            "I first joined this sub as a sophomore in HS, got accepted into college as a CS major a few weeks ago. I’m officially one of you.",
            "I enjoyed my first year of college by only working on fun personal projects. I only leetcoded the few weeks before my interviews. I ended up landing internships at FB and Google. You can definitely do this but depends on how strong of a programmer you already are and how quickly you learn.",
            "How about you do both? You can live your life, hang out with friends, go to the gym and practice Leetcode at the same time.\n\nFreshmen have more free time since their classes are easier, and Leetcode improves their understanding of the fundamentals. On top of that, since they would be starting early they would have to put less time every day, so it's really not as bad as it seems. \n\nAlso, you seem to be forgetting that with remote schooling, the freshman year experience for this year is much more different than yours.\n\n\"Go make friends, play sports, try out a ton of clubs, pick up an instrument, experience your school’s traditions, live your life\". You can do all this while also practicing Leetcode? And anyways, some of the stuff you mentioned can't be done right now with COVID anyways, so what exactly is your point?",
            "I enoyed all four years a little too much. Now im about to graduate and I feel like I need to take every CS course over again 🤦‍♂️. At least im ending with a 3.2 cumulative GPA. Oh well, im smart and will figure something out.",
            "Thank you.",
            "With Covid shutting everything down there’s literally nothing else for us freshman to do except leetcode lmao",
            "amazon tho",
            "I'm really happy this is the first post I saw. I'm admitted to merced to major in computer science and engineering for fall semester (hopefully they don't withdraw once I do my course updates and tell them I failed and switched out of ap calc, lol) and this made me a little less nervous",
            "This post is truth: regardless of how you reach the end of your life you will meet the same end as everyone else, and how you get there doesn’t matter as much as people convince you to believe as a young person. Ultimately, the goal is to not try to be perfect, but do aim to achieve your goals. What’s important to remember is that regardless of what you do or don’t accomplish you will meet the same end as everyone else, even the most accomplished. That might seem gruesome to some, but the point is to enjoy your life. Your youngest years are some of the most valuable for a reason. Make use of them.",
            "In so many STEM careers, it seems like doing nothing but work, aiming to work at a big company, etc is the only way to succeed. Everyone's definition of success is different. Taking days off for your health won't get you fired, and spending all your time studying and working wont always get you a step ahead. Figure out what you want from your career and jobs (i.e. money, work-life balance, good benefits, ability to work remote, etc). Pursuing opportunities that match your priorities will keep you happier in both the short and long term",
            "me reading as a high school junior 🤠",
            "Why are these \"to all the freshman\" posts such extreme ends of the spectrum? I've been interning at a FAANG for two years, I applied to all the internships the day they opened in July/August, then 3 weeks before the interviews I leetcoded non-stop, and then after I got the offer 2 months later I just sat back and relaxed from Jan-May of my freshman year. there's something called *balance*. Your job prospects don't have to take a backseat in order for you to enjoy your freshman year.",
            "This is just straight up bad advice filled with false dilemmas. You can do all the \"good\" things you mention while reading this sub or doing leetcode. Of course, if you want to.",
            "Would just like to say, I’m not even in high school. Like I’m not even supposed to download Reddit off the Apple App Store (because Reddit is rated 17+) because I’m too young",
            "Hahaha but some of us are geeks who ENJOY grinding leetcode",
            "As a Transfer student during covid, i fucking regret not knowing shit abt LC till now. \n\nAs internship season is coming to a close, im grinding shit out rn. Had I known abt LC earlier, I would not have had to go through this. Start now, especially during COVID where theres nothing else to do.",
            "This is the kind of false dichotomy that is neither correct nor helpful. Doing leetcode does not mean you have no life.  Anyone with even the most rudimentary knowledge of DS&A will be able to understand the easiest LC problems, so start easy and work up. Spending one or two hours a week on LC will not destroy your social life. If you can't even dedicate 1% of your waking hours towards career prep, then you have no one else but yourself to blame when interviews don't go your way.",
            "lol just leetcode. it will make you happier in the long run",
            "You're not gonna make it to FANG with this mentality.",
            "This was encouraging! I am boggled down by my programming class currently but that is because I wasted my winter break and could have had a little easier time. I take an international trip to the homeland for 2 months for the summer and after that, as I complete my second programming class and another CSE class, begin my internship application process.",
            "tfw you spent your freshman year online staring at a monitor taking useless zoom classes",
            "I've been home all year so leet code and exercises have all I've been able to do",
            "Guess this is the time to start leetcode , since I am taking DS and algo this sem. Summer gonna be a lot of work lol",
            "[deleted]",
            "Life, hah, there is no life, just ***grind.***   \n\n\n\\- Proceeds to laugh manically -",
            ">However, you don’t have to start interview prepping the minute you step on campus. \n\nDon't worry, I'm not gonna step on campus 'till this Fall :D",
            "I am not a freshman, but you even made me motivated  lol",
            "This is none sense we all know if you haven’t completed all of the leetcode problems for every single language by the time you finish 8th grade you’re going to be homeless.",
            "Not a fan of hustlers who want you to wake up at 5am and meditate for 15 hours before you start work at 8am.\n\nThe key is not in working long but in using the available time to its maximum.",
            "As an upcoming freshman, I really appreciate this. Thank you.",
            "."
        ]
    },
    {
        "post_id": "1bgk612",
        "author": "Odd-Personality-1294",
        "title": "This is insane",
        "url": "https://i.redd.it/fdv03fohesoc1.jpeg",
        "score": 950,
        "num_comments": 241,
        "created_utc": 1710634451.0,
        "selftext": "This is actually insane 😭 How do i even believe that hiring manager is actually gonna go through each and every resume and give them individual reply? This has to be lottery pick at this point. ",
        "permalink": "/r/csMajors/comments/1bgk612/this_is_insane/",
        "comments": [
            "This is just from Linkedin. What about other platforms? In total the number might be more.",
            "“49% have a masters degree”\n\n💀💀💀",
            "Hiring manager don’t even get 90% of the resume. ATS filters it.",
            "We're all cooked",
            "Senior, Director, and Manager level applicants applying for a SWE intern role… lol",
            "Senior & director applying for SWE intern, crazy.",
            "I mean not really, a remote SWE intern position will always have a shit ton of apps",
            "I saw one today with 3,400 applicants.",
            "In before people comment the lie perpetually told on this sub for coping measures:\n\n\"bUT 99% oF tHeM aRE uNQuAliFiEd\"",
            "It’s Roku bruh",
            "bro medicine is even like this - how we gonna find jobs brah",
            "These numbers are garbage. No way in fuck senior, manager, or director level will apply for an internship…. Lmao",
            "I feel like a /r/csmajors firefighter. The amount of panic here, lol, at least it's entertaining, and that's what keeps me coming back.\n\nThis number is completely bogus and has no bearing on your chances. That's because you need to apply directly through the company, and preferably with an internal referral or a reach out from a recruiter.\n\nThis hasn't changed. It was the case years back as well. And not that it even matters, but what's your baseline on all this? What were the application numbers a year ago or two years ago? Probably smaller, but the fact that you don't know makes this meaningless.",
            "Most of the resumes get filtered beforehand.\n\nBut holy shit, 49% of the applicants have a masters? and nearly 20% of the applicants for an intern position are seniors? Jesus christ",
            "Bruh, there's so many people with masters it's crazy.",
            "More insane is that 28 Directors applied for some fucking internship",
            "And people say we're doomposting lol",
            "Applicants on LinkedIn are the number of distinct users that viewed the listing for the job, not the actual number of people that have completed and submitted an application.",
            "I did some sourcing in the past.\n\nNo director level person is applying for an internship role. No 40 year old guy who was making 700k+ is taking a 50k role. It's just not worth their time. Even if he's unemployed. \n\nWhat's actually happening is that 95% of these applications are fake from foreign countries or just bots. \n\nIf you want to get noticed use what you have as an advantage. Apply at job fairs in person or with references of other classmates. \n\nBasically none of these applications are ever looked at, why would I risk my chances on anyone in this pool when I have applications with references to current employees.",
            "You should try applying to jobs that aren't posted on LinkedIn. Your resume just gets drowned out when its easy apply.",
            "What job did you interview for? This seems insanely high. We’re hiring for a senior role right now and have gotten maybe 20 applications total (role has been open for 2 weeks). F500 company you’d know of if you heard the name.",
            "It's a world famous brand offering a fully remote position. What do you expect?",
            "Half of these are likely international and the manager isn’t going to look at 99% of them.",
            "HR Manager here, we use a proprietary AI system we developed in house to filter away people that we consider non functioning, were usualy left with 30-50 applicants per 1000cvs our system analyzes.\n\nNot looking good for incompetent people tbh",
            "So I gotta get a masters is what your saying???",
            "Remote job in SV at a known company? No shit Jose. You could see see the number of applicants this high even during the pandemic.",
            "AI gonna give the hiring mgr 5-8 to look at… so good luck with the lottery",
            "The hiring manager gets a list of candidates after the applicant tracking system selects the \"best matched\" applications based on the criteria identified by the hiring manager, and entered by the recruiter. The recruiter then reviews these, and filters them down again to share with the hiring manager\n\nThe key is to match key words in your application to the ad",
            "i see this too and honestly this shit makes little sense to me, like 28 DIRECTOR level applicants applying for an INTERNSHIP?! i think not. i dont see why senior level applicants are applying either.   \n\n\nthe part i dont like is seeing that 50-75% of 'entry level applicants' have masters degrees. like wtf when did that happen.",
            "It's remote. When you open an application from an attractive company to the entire country, then you will get this many apps.",
            "We can all always be a cop",
            "It's fine. It's a remote job, so 70% of the applicants prolly aren't even in the US",
            "It’s Making me seriously consider swapping majors as a current I.T freshman student. My only hope is that the market evens out in 3 years",
            "there’s software people can subscribe to that auto applies for jobs - that’s most likely what you’re seeing. Also you could put whatever you want on linkedin as your current position, if I were to guess many of those applications could be international and put some arbitrary title thinking it would help landing a job.",
            "paint pie lip seed dinner wine judicious ten unused follow\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "observation frightening violet agonizing far-flung squalid longing sugar abounding subsequent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "The hiring manager isn’t going to…",
            "Wassup with director level applying for intern levels. I think LinkedIn counts count as applicants ? lol",
            "You also have to keep in mind but hiring managers and recruiter generally use hiring solutions that screen all the resumes first to see which resumes make the cut to even be looked at by a real person. So not all of the applications are necessarily reviewed by visual inspection. You just have to get through the automated system first",
            "Distinguish yourself go and talk front to front",
            "No fucking chance this is real",
            "i honestly dont even apply when i see 100 applicants :( but i’m in canada",
            "i mean, it is a premier high tech company. not your average job",
            "The hiring process is rarely about find the absolute best candidate its about finding the first good candidate.\n\nLets imagine scenario where God himself applied and was the 1500th candidate while a solid coder with relevant experience and good social skills is the 50th. The 50th person has a better shot of getting an interview and actually getting the job.\n\nThe reason? Because hiring has a cost. It takes time and money to interview every candidate. Its better to just find the first good candidate than wasting time and money finding the absolute best.\n\nThis is actually a pretty common algorithms example known as the [hiring problem](https://www.bartleby.com/subject/engineering/computer-science/concepts/hiring-problem).",
            "Shit, I just applied to Roku, no hope now, I did it via the portal and not the platform, so I am not even part of the statistics.",
            "I 100% guarantee you at least 75% of those are barely equipped or not at all qualified for the position. \n\nPeople use automated bots for these applications that will literally apply for everything without reading the job posting. Send the recruiter or hiring manager a message on LinkedIn and you’re far more likely to get attention.",
            "ATS will shit on a lot of them to be honest",
            "What's funny is that the person with a referral will get it and everyone who applied got their CVs farmed",
            "That’s why computer science is a dead field",
            "This is painful to see. I have been through the same recently. Had 3 years of hands on, FS development experience and still, applied for over 300 positions to get back nothing but automated rejection emails. Fast forward to today, I’m working as a FS Engineer L2 at a unicorn. Here’s what I would try if I was in your shoes rn:\n\n1. Apply through third-party recruitment firms - this helps a lot in securing initial rounds of interviews.\n\n2. Look for hiring events happening at nearby educational institutions and connect directly with recruiters. They usually have 3-4 positions ready to recruit for.\n\n3. Look for managers using LI for the role you want to apply for. The senior engineers (in my case) are too busy to help you with referrals. Managers have been the most responsive in my scenario.\n\n4. Sounds weird but use dating apps to get referrals from people working senior positions in the role you want to apply for. These people are always ready to talk and socialize. I managed to get referrals for big techs via this.\n\nHope this advice helps someone out to land their next job!",
            "A power-ball number might round your chances 👍🏽",
            "Just FYI a recruiter, who usually has a non-technical degree like maybe an English or marketing degree, does the first round of screening. Most of those resumes get thrown out by the recruiter before being sent to the hiring manager.",
            "Master’s, directors, managers… Nah some of them most have lied on their resume. Surely it can’t be that bad just for an internship.",
            "There’s an ATS system bot that automatically picks resumes.",
            "I regret not joining the military. Everyone around me said that I’m smart and I genuinely am passionate about tech (I want to do IT/Network/Security). That’s why I ended ip going to college. Everything else I hate (except math and a little bit electrical engineering). Ima have to work really hard for what at the end?",
            "Welcome to swe lol",
            "We are so low that even **Directors** compete for internship",
            "Avoid things where it’s too easy to apply: “easy apply” buttons lower the bar, substantially, and you’ll get a flood of people looking for an easy opportunity.\n\nI’ve never used likedIN, just felt like my resume was going into the void. Instead, generate lists of tech companies you want to work at, and see if they have job openings. Most companies post jobs, but not all have equally good distribution.",
            "Pick up the spatula buddy"
        ]
    }
]