[
    {
        "post_id": "t9idp2",
        "author": "Bsostek",
        "title": "I overheard someone at a party say cs majors don’t pull.",
        "url": "https://www.reddit.com/r/csMajors/comments/t9idp2/i_overheard_someone_at_a_party_say_cs_majors_dont/",
        "score": 948,
        "num_comments": 106,
        "created_utc": 1646750838.0,
        "selftext": "My GitHub says otherwise.",
        "permalink": "/r/csMajors/comments/t9idp2/i_overheard_someone_at_a_party_say_cs_majors_dont/",
        "comments": [
            "That's cap, CS majors don't go to parties.",
            "Not going to make it if you're spending your nights at parties instead of building your resume smh",
            "My social life when I was a business major 📈\nMy social life now as a comp sci major 📉",
            "We're Pushin' P(R's)",
            "You mean we don't pull out?",
            "We Push and Pull",
            "Every software engineer I personally know is married with kids. 🤷🏻‍♀️",
            "`git pull major-ass`",
            "The real trick is to do like I did. Be married for almost ten years THEN decide to go to school for CS. \n\nWorks every time.",
            "what does \"dont pull\" means? i guess its a slang couldnt find the meaning on google.",
            "String s = \"I overheard someone at a party say cs majors don't pull.\".slice(0 , -1) + \" out.\";\n\nprint(s);\n\nThere, now its *finished*.",
            "If you’re good looking and tall you’ll be fine. Or white lol.",
            "I’m a 34 yo cs major and I don’t know what pull means 😂",
            "r/dadjokes",
            "I git pull plenty",
            "Yeah if I was CS instead of engineering major I would’ve pulled as much I think. That CS stuff just didn’t naturally to me",
            "i have a gf... i use arch btw",
            "My leetcode stats says otherwise...",
            "Yeah bullshit.\n\nI may have been with my husband since high school, but I coulda pulled some bad jawns in my day",
            "git pull origin master.",
            "Only cause I don't wanna. :')",
            "Anyone who says this is probably just mad that we get bitches and more money",
            "I fetch then I merge",
            "They do pull ........ From Github",
            "And there’s the answer"
        ]
    },
    {
        "post_id": "q18l0y",
        "author": "Mogambo070101",
        "title": "Which one of you fb interns took the prod down?",
        "url": "https://www.reddit.com/r/csMajors/comments/q18l0y/which_one_of_you_fb_interns_took_the_prod_down/",
        "score": 950,
        "num_comments": 44,
        "created_utc": 1633363852.0,
        "selftext": "Insta WhatsApp and messenger not working",
        "permalink": "/r/csMajors/comments/q18l0y/which_one_of_you_fb_interns_took_the_prod_down/",
        "comments": [
            "pls my interview is in an hour and i lowkey hope it gets rescheduled bc i am so unprepared",
            "I got rejected last week and now their servers break this can’t be a coincidence",
            "[deleted]",
            "😂😂😂definitely PE intern, who got hired just by cracking DS/Algo round Lol 😛",
            "It’s been down for hours. This is actually really bad lmao\n\nEdit: kind of a long shot but does anyone have an estimate of how long it’s gonna take to get fixed? R we looking at a day? Several days?",
            "bruh the internal application portal isnt working either - i got an interview today and shit ain't loading",
            "My friend was like Free PTO!",
            "I guess Mondays are bad for everyone.",
            "hahaha brightens my day bruh",
            "Someone's getting fired.",
            "Not sure but I'll take the free vacations lol",
            "Sooo, someone deleted the dns records from the routing tables. lmfao?",
            "The hero we need but don’t deserve",
            "This... this has me fkn dead",
            "If I was an intern I’d totally take the blame for a million dollars. 🤣\n\nI guess none of you perfect leet-coders ever screwed up production and had to make the call of shame to restore something.",
            "😂",
            "Well, I am sure it was one of the cloud guys. \n\nI am only one of the DNS peasants no one cares about."
        ]
    },
    {
        "post_id": "nilfnu",
        "author": "agregusbog",
        "title": "When the realization settles in that you actually have to work 9-5 for your internship not just update Linkedin.",
        "url": "https://www.reddit.com/r/csMajors/comments/nilfnu/when_the_realization_settles_in_that_you_actually/",
        "score": 947,
        "num_comments": 67,
        "created_utc": 1621698399.0,
        "selftext": ":0",
        "permalink": "/r/csMajors/comments/nilfnu/when_the_realization_settles_in_that_you_actually/",
        "comments": [
            "All the ones I applied to last year and this year go cancelled. =( Guess I'll graduate with no internships.",
            "*surprised pikachu face*",
            "I’m remoting in to another part of the country so it’s more of a 7-3 for me, and I love it lol.",
            "Full metal alchemist! \n\n**Full metal alchemist.**",
            "[deleted]",
            "OMFG LITERALLY 😭",
            "This.",
            "Yeah its literally just a job",
            "i dreaded working 8 hours but it’s actually not horrible. still would prefer 6 tho",
            "Not too bad. The good thing for me was that mine was not as hectic as I had expected.",
            "The fun part starts when you realize that there are people employed who don't really do any work. Welcome to corporate insanity.",
            "Me when I realize don’t have an internship: :)\n\nMe when I realize I don’t have an internship and am going into my last year: :(",
            "[deleted]",
            "Honestly? I'm enjoying it so much. Going back to senior year is going to be hard.\n\nCollege is this constant wave of \"I'm supposed to be doing x\" whether it's class or homework or studying. There's no real penalty if you don't show up to class except more work later. There's complete freedom to work at 2AM. I have ADHD, so it's awful. Just a constant feeling of procrastination and/or \"what am I missing?\"\n\n9-5? Show up. Do work. Go to meetings you have no option to miss. Find a stopping point near the end of the day, then call it quits. Done, you're free, you have no obligation to THINK about work until tomorrow. It's a godsend.",
            "Doing a 10 to 8 here, is that normal? ;-;",
            "I got a job this year and was so happy to add something to experience section in linkedin finally and now my breath is coming out working everyday. Thanks God I like the job I had to do. I would be dead otherwise.",
            "Wait... are you the intern my company just let go after a week of not responding to any slack messages",
            "After reading this post!",
            "I haven’t even put my internship on my LinkedIn or anything yet do companies typically ask you to post that like ‘I’m excited for this internship?’ I’m interning a big company but they didn’t ask me to post that on my LinkedIn they just sent me a lot of training and asked me to start whenever I could and log the hours.",
            "This!! 😂",
            "Seriously",
            "Holyyyy. I so feel this man.",
            "Mine is 9-6 but things have been fine cause of wfh, don't know how it will be in office",
            "I am so scared to work but more than that i am scared I won’t get an internships/job.",
            "Wait for the realization you’re gonna have to work 8-6 for the next 30 years"
        ]
    },
    {
        "post_id": "12qpmee",
        "author": "2001ThrowawayM",
        "title": "We are lucky.",
        "url": "https://www.reddit.com/r/csMajors/comments/12qpmee/we_are_lucky/",
        "score": 942,
        "num_comments": 222,
        "created_utc": 1681829484.0,
        "selftext": "I keep seeing people on here being sad that their pay isn't the best for their internships, like they are making $20/hour or something, and everytime I see that I find it confusing, my girlfriend is an education major, the second half of her senior year, she will have to spend Monday-Friday 7am-3pm in a classroom \"student teaching\", which pays a whopping $0/hour. There are so many people that work full time internships for free, and then you come on here and realize that people are upset that they are \"only making $20/hour\".",
        "permalink": "/r/csMajors/comments/12qpmee/we_are_lucky/",
        "comments": [
            "Why is everyone hating on OP… Go outside and talk to people your age and you’ll find out most students are working close to minimum wage job. People here acting like they’re entitled to 50$/hour for an internship where they will most likely not contribute much to the company is kind of embarrassing.",
            "this sub is rather out of touch in many regards",
            "[deleted]",
            "I'm graduating next month with a cs degree and I'd love a 20/hr internship.",
            "Even unpaid cs internships on linkedin have hundreds of applicants within a day. Other careers do unpaid internships just because they can, so I wonder if we’re going that way.",
            "I honestly think this sub should just split up into two already so we can talk to like minded people. There are csmajors who just want to work on cool project and land “A” job, others are what some would call “degenerates” immersed in hustle culture who want to grind and MAXIMIZE their TC to the tits. I would consider myself the latter, but it would be beneficial for all.",
            "That’s weird. I thought that if you stop being lazy and grind leetcode accordng to this sub, we can make 6 figures easy.\n\nOh wait, that’s not reality.",
            "I’ll be making 30/hr and that means I will be earning more than 95% of my family for this summer semester which I think its beyond amazing",
            "What a weird post, why are you glorifying barely sustainable wages and using exploited unpaid labor as an argument? Without additional financial support you would, on average, barely be living paycheck to paycheck.\n\nFor the numbers:\n\n $20/hr is $41,600/yr before taxes and with the most recent tax bracket rates is $33,548/yr if you forego all health insurance and ignore social security and retirements contributions. That's  $2796 a month. Median rent is $1700 and 35% of everyone rents.\n\nAverage sums for utilities, internet and phone bills from 2021 and 2022 values was \\~$469.\n\nYou're looking at around $600 a month to pay for health insurance, transportation,  food and state taxes and misc fees. Should I bother bringing up that average health insurance cost eats this up alone or that all but the cheapest state have food costs of around half or more of this? \n\nStop thinking people should be happy with permanent financial struggle you tone-deaf tool. You sharing expenses with someone else doesn't remove the expenses of single-income homes. You being used to poverty conditions while sinking into debt as a student doesn't make it normal. Other workers being exploited with little or no pay does not make these numbers you're justifying suddenly afford more. How old are you? Do you realize you are trading in years of your life and the start of otherwise formative career years for better prospects only to be so happy making just enough that a flat tire or surprise Dr. visit will make you go hungry for only half a month. But what do I know. It must surely be those people who aren't grateful for such bountiful options of paying rent or going to a dentist that are out of touch.",
            "Its because it simply isn't the industry standard to make just $20/hr as a swe intern. Even series A-B startups in MCOL regularly give out 25-35/hr these days.\n\nHonestly I hate it when people bring this topic up too. Its the other side of the same coin. Just like there will always be someone better than you, there will other be someone worse than you too. You don't need to always be over comparing yourself to people who have done more and feel down as a result. But you also don't need to over compare yourself to people who are \"doing worse\" to cope.",
            "I’ll disagree, yes are jobs are way better in terms of flexibility, pay and enjoyability for the most part, but I wouldn’t call it “luck”, we chose this field, people going into other fields should know what they can expect, we weren’t randomly given this position for it to be luck. \n\nOn being sad about having better conditions than the average is also understandable, it’s good to be grateful for what you have, but at the same time having high expectations of yourself and being sad when you don’t meet them is understandable. Not everyone wants to be a bit better than the average, some people have goals of becoming the 1% and I think for the most part that’s good and their frustration is understandable",
            "[deleted]",
            "Someone always has it worse than you but why should that prevent you from having feelings of sadness or disappointment just as someone always has it better than you so why should that cause you sadness or disappointment? Everyone should be allowed to feel what they feel given their circumstance. \n\nSomeone could argue further that didn't those who chose education as their major know what they were getting into? If they didn't isn't that on them? But I don't think that is really the point of your post. I think the term lucky invalidates people's feelings; they chose a field with a lot of work and high pay and now because of an economic downturn those goals and dreams have to be altered. Isn't that worth being sad about?",
            "My internship is paying me a whopping $0/hr! In CS, too.",
            "My med school roommate will go into debt $200,000 at 6% and make $15/hr until 30. My law roommate interns for $30/hr at some regular finance job. My Urban Planning major roommate will make $25/hr following graduation. My psych major roommate makes $0 or less with gas right now.\n\nI haven’t graduated yet and am set to make $55/hr this summer. We have it good, especially when we are young. Being rich and young before you’re too old to enjoy it is a special, delicate privilege.",
            "\"We are lucky to be underpaid for our work\" is a take, that's for sure.",
            "This is an unfair comparison, when comparing TC, cs majors should be comparing with other cs majors and not with like an art or education major.",
            "CS has a massive grind culture, and we get paid well because the stuff we build generates the company a lot of money. \n\nPeople didn't get lucky. They made a strategic move to go where the pay is and not be broke anymore. The only thing I got lucky on is having the information of how well tech paid before I choose my major as not everyone knew that.",
            "When I was an undergrad I knew an El Ed major who told me he wanted  to find a permanent job earning XXX per year. It was less than I made as a Co-op student at my job.",
            "I wholeheartedly agree. My second internship doubled my prior salary; which was based on years of  customer experience.",
            "This is such a stupid argument, \"other people are suffering so why shouldn't we suffer too\"? That's why the system exists, complacency. You should get as much money as is fair and you should root for other people to make a fair amount of money, this is just self defeating bullshit",
            "The fact that your are comparing CS to other majors itself is wrong. \nCS is a high paying field and has been for decades.\n20/hr isn’t big money when you grind 60 hours a week just for an interview. \nSimply saying they do unpaid internships for their major so you shouldn’t complain doesn’t make sense.\nThey field is different and requires different things from them.\n\nJust my 2 cents",
            "I only made $20/hour working night shift my first job and was grateful to even have that after looking for work for a year. Will admit I used it as a leverage point to a decent position at the company but those were still a rough few months.",
            "This sub is out of touch with reality.",
            "You guys are getting internships?",
            "It sucks for poor people who didn’t have a choice. But the people who did have a choice chose to get into 200k in debt, that’s on them for going through with their path. They can complain, we can complain. If you want to suffer like everyone else we will bring everyone down",
            "As long as its paid I'll take any internship",
            "I picked CS and tech specifically so i could make 20 bucks an hour as an intern and complain about it. I can't speak for education but i remember specifically choosing to get into tech so I could make money. I literally did pulled up the stats and picked the major with the highest starting salary and most job opportunity. So you're damn right i'm gonna complain about my internship being 20 an hour",
            "I’ll get downvoted for saying it but oh well. We’re suppose to not feel discouraged when comparing ourselves all the time and yet at the same time we need to be humble and compare ourselves to those “less fortunate”. \n\nLook we all made choices and we know the result of our choices. If you became an art major(or insert whatever low paying occupation that requires college) in 2023 or later and with all information in the world at your fingertips and still complain about how the pay is low I don’t know what to tell you. I mean that might just be natural selection at its finest. \n\nI’ll say 90% of the time I see people bring up this argument (assuming it’s not troll) it’s someone referring to their significant other or a parent. \n\nI have a friend studying neurosurgery I’ve checked the SAME WAY HE HAS what they get paid. I understand the hours, and experience it takes to become one and even went to the hospital to see day to day life for six months. Guess what I decided I don’t want to do that because it’s not worth the money and it’s not my passion. I have 0 drive for it besides the “status” effect. \n\nSure do people here in this field have big egos yes they do. But it’s why myself and many others love the field. I love the competitive aspect and I hated being around people that acted like it was weird to simply want more out of life. \n\n\nTLDR: They went into their field knowing what it would be like and if they didn’t that’s on them we are not accountable for their failures. There’s nothing wrong with having an ego especially one that’s well deserved.",
            "i could argue that that's on her for choosing education as her major, i get education is not the easiest major but there's a reason it pays less and CS pays more (hint: swe products generate more revenue as compared to education, which is on capitalism, not us as individuals) why should i not strive for $50/hr just because some other major gets 0/hr? sorry about your gf's situation but she should've seen what she was getting into, and if she took a non-high-paying major like education for \"passion\" then there's very little room to complain about money",
            "Lol so much complacency on this sub, life is not supposed to be shit. So don’t act like we should be grateful in comparison to people that work for shit wages.",
            "Not only do you not get paid for student teaching, but you also have to pay for it in terms of tuition.",
            "$20/hr is pretty low. Rural fast food chains offer that for a cashier.",
            "bro is comparing CS to education. both are completely different industries.",
            "yeah I complained for making 25£/h in the UK for an internship like wtf. But I guess when you realise how others are in better position you sort of compare to them in a way and want to become better. You should understand however all of us come from different backgrounds and the different in pay might be necessary for the luckyness involved or university ranking or whatever excuse you come up with. Behind every individual is a substantial amount of work that we don't see until we make contact.",
            "i just accepted a 8$/hr internship, i’d have taken it even if it was unpaid just to have that leverage next year",
            "Talking about US here, while we can still acknowledge some level of gratitude to be earning money in internships, I think instead of us being content, we should be outraged that other field’s internships are treated like dogshit.  The idea of someone somehow finding a way to live in a $900/mo rent situation while getting $0 for their labor (which internships vary ofc with whether or not you’re necessarily providing value for the company, but the idea that there isn’t anything that you can do to get some housing accommodation is fucked) is just another way the US ends up punishing people for not being born into wealth",
            "This major is 100x harder than an education major. They dont spend an extra amount of hours studying. They dont come home after 5 hours in classes to study some more and repeat everyday. Even on the weekends, its more studying or grinding leetcode. \n\nWe dont stop. They can go out and have fun on the weekends. We cant or we fall behind. Maybe only 1% of people in CS dont need that extra study time but the majority of us does need that extra time. \n\nOf course i am going to complain about twenty fucking dollars an hour. Especially if i have to take online classes while working an internship or full time job. This aint it. Crazy how this shit has many upvotes.",
            "people from this sub are just 90% spoiled ass entitled brat",
            "No, we are not lucky. We create our own luck by grinding 60-100 hours a week. I'm sorry, but comparing CS to other \"grind culture\" degrees would be the best.",
            "who working for free",
            "Are u sure u are a CS major? And who are we here? Does we refer to yourself?",
            "Everyone wants to make a livable wage for the hours they give up each day. That's totally reasonable. Someone wanting more than $20/hr has nothing to do with another person making $0/hr.",
            "guide your girlfriend into moving into marketing or design or tech sales or 100 different things that pays well",
            "FANGG salary or you are poor",
            "A simple quick search of average salaries and touching grass will bring them back to solid ground.",
            "People should amortise the internship salaries over the time they prepared to land it.\n\nSure $120/h sounds nice until you realise it took you years of Networking/LC/side projects. All while your X major had his time of his life in Uni partying and enjoying himself.\n\nTLDR; Yeah internships pay ‘a decent’ amount of money but if you amortise it the pay is average.",
            "Student teaching counts as time in class, an internship “can” but generally does not and replaces a job.",
            "$20/h isn't even that much, if people are complaining while getting $30 yeah that's entitled. But the whole idea of \"other people have it worse\" as a means to shut down any discussion is wrong. We as a society should be striving to be the best, not striving to not be the worst. This mentality breeds complacency.",
            "I had to and I'm sure your gf also had to pay for that student teaching experience as well. (My bf is also a cs major so I browse on here for him)",
            "My internship pays nothing this summer..",
            "Why should anyone feel obligated to be content with the amount they are paid. If there is an internship paying $100/hr and you work hard for it and don't get it then you should feel unsettled. I wonder how much the pay actually matters to people. I have a feeling most just have a $ salary amount they want to hit and that's respectable because if you hit that amount you feel accomplished and can then pick a new goal to hit. Sure we have more opportunities than most majors but that should not stop us from aiming as high as possible.",
            "In X-ray you work for free part time for two whole years, including full time during summers and spring break, with only 2 weeks off around Christmas. The money is decent when you graduate but not much opportunity to make 6 figures in the field.",
            "Everyone should be getting paid for their work regardless if it's an internship or not but I quite agree, it's rare to see $20/hr even for regular service jobs.",
            "yeah but an education major is not a fair comparison. that's comparing apples and oranges. they are comparing themselves to others in their field and therefore are upset they are getting paid significantly less. It's justified to be upset about that especially when you picked a major known for its high salaries.",
            "I'm not CS (I'm ECE) but yeah complaining about internship pay is only valid to a certain extent.\n\nI had my first and only internship last summer. In San Francisco, pay was 26 an hour with 1.5x for hours over 40 per week.\n\nShit pay for SF. However, I'd do it again in a heartbeat. The experience made my senior year job search an absolute breeze (it got me into a field that's hard to break into, that I love), making six figures.\n\nHad I instead taken a better paying internship at a consulting firm or some other lame shit I wouldn't have my current ft offer, nor would I have been able to land a similar job.\n\nExperience >>>>>> pay. You're doing it wrong if you're choosing an internship solely off of pay, or even mostly because of pay.",
            "*me making barely more than that as a full time employee*\n\nYeah, what a bunch of losers!",
            "majority of the cs major didnt have a try on any work outside the cs world. if they had they wont comment like that.",
            "I would pay so much money for an internship right now I’m about to graduate with 0 internships. Applied for thousands. I paid for college because I thought it would get me a job so I would pay for an internship for the same reason but I can’t find a way to do it",
            "Exactly. Gratitude is key",
            "While interns in india making less than 100$ a month",
            "Pay in capitalism as an employee is proportional to how hard you are to replace and the value you provide. The amount of individuals who can apply algorithms and produce quality code is much less than the amount who can sweep a floor; hence pay disparity between cleaning staff and, say, an SWE or quant. You either play the game or you hate it.",
            "They probably aren't comparing themselves to a completely different and lower paying field like you are",
            "Thank you for shining a light on educators. It’s really sad. I actually worked like until 1am or so getting ready, at least during covid times. I hope you are supportive during those times. Not a lot of people know and there may not be at all, but there are student teaching scholarships, because it is literally impossible to work “after work.” Also, the unemployment department, at least in my state has training benefits you dan apply to and student teaching is one of the ones that you can apply for.",
            "Most people recently got into programming for money and job availability, unlike teachers. Now that that rug is getting pulled out from under them, they're getting scared.",
            "."
        ]
    },
    {
        "post_id": "ofwmam",
        "author": "luluretard",
        "title": "How to develop superiority complex?",
        "url": "https://www.reddit.com/r/csMajors/comments/ofwmam/how_to_develop_superiority_complex/",
        "score": 945,
        "num_comments": 89,
        "created_utc": 1625706622.0,
        "selftext": "I heard a lot of CS majors develop superiority complex’s and I wanna know if I should get started on that.",
        "permalink": "/r/csMajors/comments/ofwmam/how_to_develop_superiority_complex/",
        "comments": [
            "it’ll come naturally when you do your first medium leetcode question dw",
            "Read a lot of self help books, and listen to motivational podcasts and Boom! You're there 😂",
            "Idk, I developed imposter syndrome instead.",
            "Yes, in fact you're already behind. You should have developed this skill in middle school when you were involved in the robotics club at your local private school. Best of luck. /s",
            "They don't develop them, they either come in with them in the first place or they don't. Much like any other STEM major. Freshmen usually have the biggest egos, they're also the hardest to teach.",
            "This one's eazzzzy. First, you need to spend every waking minute on either gridningLC/studying/programming/'complaining about why you cant get your first big N internship, and obsessively browsing r/csMajors. Once you've done this for a few months, then you need to look at yourself from the eyes of a stranger, and realize you have no life outside of CS, but you cant quit your cycle yet. You're  so close to that big N internship! So you push through anyways. Next you need to be bitter about missing out on important life events, and i'm not talking about ordinary bitterness  . you need to be extra bitter, I'm talking about bitterness that can only be found in the asscracks of deceased whales in the dead sea. That kind of bitterness is just right! Next you need to go somewhere social, somewhere you stand out because you know you have terrible social skills. There, you wanna try and talk to people, but you fail, and make a fool out of your self. And instead of improving your social  skills, you realize you don't need friends or a bf/gf. all you need is that fat juicy big N [i](https://internship.At)nternship. After that, you never try to make friends because you're better than them, because your'e about to get that big fat internship, and these scrubs could never. And once you get it, that big fat N word, you realize you've better than everyone. There, at that particular moment,  you realize you're better than everyone.  After a while, once the allure of the internship has faded, you've  realized you've attained it, an superiority complex.",
            "I like to think that CS does a good job of purging this from people and replacing it with imposter syndrome.  But there is a subset of dickheads who instead go Dunning-Kruger mode to protect their fragile egos from the onslaught.  \n\n\nJust bend over and accept it like the rest of us lol",
            "Work at a big N",
            "Shit talk JavaScript. That’s a good start",
            "Absolutely, first thing is to flex the higher level math courses and flex you got all A’s, second grind leetcode hard , don’t leave your room except for class and studying literally don’t take care of yourself either poop sock is optional but is a +5. (/s)",
            "Amazon",
            "you just go to your iterm2\n1. Type rm -r imposter-syndrome\n2. git clone superiority-complex\n3. cd superiority-complex\n4. npm install",
            "Take some notes from passive aggressive stackoverflow comments, it'll come second nature.",
            "You only have 15 years of industry experience? That's cute. I have 15 years of experience in React, Angular, and Vue alone. Technically, I have 17 in Angular, but it's easier to just lump them all together - they're all the same to you. I have almost five decades of experience writing web applications on punch cards, and I'm only 22 years old. I'm a web entrepreneur, and I release a top app on Google Play each month. War of Lust: Strike war? That was me. Speaking of Google, in my free time, I'm a senior developer at Google for an extra $1.6m a year, and that's just so I have some walking around money (if you know what I mean).\n\nYou write a chess engine when you're learning a new programming language? Snore. Boring. How about something bigger, like a P-time theorem prover? You think you're so high and mighty, but you don't even know how to prove that sqrt(2) is irrational, let alone prove the Collatz conjecture. I once wrote an algorithm to break AES256 encryption in O(logn) time as a snack. I am so much smarter than you, and my educational background is so much more comprehensive than yours, that I look down and laugh at your kind simply because I am better than you.\n\nRead the documentation? I've read all of it. In fact, I didn't just read it all, I wrote a good chunk of it. I contribute to at least 30 different open-source projects every day. I literally wrote GCC, bud. Don't believe me? Check out my Github. I want to take this opportunity to remind you that I am so much better than you and so much smarter than you, and you'll never amount to anything nearly as successful as myself because I am simply that much better than you.\n\nEdit: literally nothing. I'm so good that I don't even need to edit. Not only does my code always run on the first try, it does exactly what I want it to do. Not once in my life have I seen the words \"Segmentation fault\" on my screen, except when a wannabe posts his shitty code to Stack Overflow. Comments are for the weak, and writing tests is a waste of thousands of dollars a minute. I am literally God, and I'm damn well aware of this fact. Don't even think about wasting my time again.",
            "Superiority complex is good and all, but don't forget misogyny. Can't have good old CS without that",
            "After that you can also fake your internship offers, your amazing social life and your total compensation in this sub.",
            "Get a job at FAANG and tell absolutely everyone about it",
            "Write a good resume and compare it to others. Honestly. Or just writing skill in general. I had to look at a resume today that didn't even have an email on it. And the cover letter said \"my academic education\", and then proceeded to just list skills rather than actually show me how he utilized them in the field.",
            "Get an Amazon interview and schedule it at the end of the year. Then flex on your friends that you're going to a FAANG company. Fail it. Repeat.",
            "I believe it comes when you land a big internship and others aren’t",
            "Probably better not to, act like an ass and you won’t see a job offer",
            "you better get started on that early. you are already behind if you  haven't started practicing since hs.",
            "I have an inferiority complex personally, I envy people with arrogance and confidence and I wish I could have those traits 😭",
            "I can’t answer that, I already had one. Perhaps you should just try harder, good god. \n\n(I’m just kidding, sorry. I mean, I did have a superiority complex but the rest was a joke. Sorry.)",
            "I'd rather have a superiority complex than imposter syndrome. When I was growing up I was the smartest kid I knew. Maybe that was just because I didn't know that many kids. All I know is now I feel the opposite.",
            "I fluctuate between superiority complex and inferiority complex on a near daily basis.",
            "Constantly talk shit about non-cs people",
            "Idk I'm just an impostor from the fine arts department 🤷🏽‍♀️ either it develops naturally or you learn to fake it til you make it.",
            "Learn how to reverse a linked list",
            "superiority complex in the sense that compared to non-cs people not your piers",
            "every tech bro has a huge ego they should know how pathetic they are",
            "Accidentally stumbled upon foobar gave me superiority complex… and that happened in the middle of my lecture in my introductory cs class\n\nWell, more like imposter syndrome. But definitely complex.",
            "Build an app that goes viral like Flappy Bird... and then take it down because people upset you... and take a Junior Dev position.",
            "Please what how old are you",
            "Please what how old are you",
            "[Be like Ricky Bobby](https://www.youtube.com/watch?v=tna3B5zqHdk)",
            "https://www.youtube.com/watch?v=\\_o7qjN3KF8U",
            "Just look at any other major’s homework and you’ll feel super smart (facetious)",
            "It’s a coping mechanism of adult virgins. So it may already be to late for you"
        ]
    },
    {
        "post_id": "1b2lcp8",
        "author": "SwolSan",
        "title": "Is this why CS jobs are moving overseas?",
        "url": "https://i.redd.it/ylkfik5uwelc1.jpeg",
        "score": 946,
        "num_comments": 165,
        "created_utc": 1709163580.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b2lcp8/is_this_why_cs_jobs_are_moving_overseas/",
        "comments": [
            "This sub is just shit",
            "Because people are doing their job? Measuring productivity in hours worked alone is fucking stupid",
            "From r/cscareerquestions \n\n\nhttps://www.reddit.com/r/cscareerquestions/comments/1b21syv/comment/ksjcaoc/\n\n\n IRS Section 174 forces software development labor to be amortized over 5 years. So if your company made $1M and spent $1M on devs, they now need to pay taxes on $900k of paper profits. Thats the real reason for the layoffs. Started for the 2022 tax year. It has made the United States the worst place to hire software development labor in the world.",
            "Man shut the hell up with these doom and gloom posts. Time spent head down coding doesn’t mean anything. Planning, thinking, clarifying requirements, and taking time away from a problem to let your brain process it is important. I have a dev on my team that cranks out a ton of code but his code quality is the worst and he has to spend the same amount of time going back and fixing his mistakes because he just starts writing as soon as he gets a ticket.",
            "They're moving jobs overseas because companies can get away with paying smaller wages and not offering benefits. \n\nCompanies have all the power in deciding where to hire and you're too dimwitted and busy pointing fingers at fellow devs  to realize. \n\nEnough of these shitty posts!",
            "If you can’t find a job just make one. There gotta be a new bullshit thing crypto thing you can sell. \n\nJust slap AI onto your NFT or something",
            "Don’t listen to junior SWE’s or students on Reddit. I have been in some of the dumbest, genuinely most impressively stupid arguments of my life on here about very simple facts. I’ll never get that time or effort back. Don’t be like me.",
            "Just like real estate the best time to get into tech was 20 years ago.",
            "It’s dead switch majors",
            "People overseas are human too. They screw off on the clock too.\n\nAs a salaried employee, I focus on how much I get done. How I spend my time is largely up to me. Sometimes I'm done at 2pm, sometimes I'm working until 2am.\n\nAlso, lots and lots of people on Reddit are full of crap.",
            "No it's more about the businesses bottom line much like manufacturing. If it's cheaper to make software overseas even tho quality may suffer businesses will absolutely do it",
            "Yes. It's all over. Coding is dead. Cs degrees will be as useful as underwater basket weaving degrees in the future",
            "not really. the lead applications developer at my last internship spent a small amount of time actually programming compared to everything else he has to do. software development is a lot more than just coding, those meetings have a lot of necessary info for what needs to get developed.",
            "https://preview.redd.it/zo02a0wciflc1.jpeg?width=1290&format=pjpg&auto=webp&s=bab747018e2e810ada3a8383c7de0d1db7e51f1a",
            "I find it hard to believe these people really exist. I work 8 hours every day at least, probably 6 hours of that is zoned in coding. Might be the fact i work at a small business though.",
            "No, this is why it’s getting harder to get a job.",
            "2h coding, 2h meeting, 2h socializing with colleagues, 2h chilling/doing nothing",
            "have yall ever worked a real job, with a mature code base? it’s not like your Java class where you complete an assignment from scratch and then turn it in for points.\n\nit’s almost impossible to have serious coding for 8 hours a day. your brain needs time to process information and consciously (and sub-consciously) break down problems to solve them. not to mention all the work required to get context for the code you are changing to understand how it will affect everything else in the code base. \n\nthis and GPT4 doom posts are the most annoying to read",
            "Lmao as if developers overseas don’t do the same",
            "So h1b1’s can do the same for less? ☠️",
            "I’ve project managed offshore teams (India) as a lead developer. \n\nIf you think a US developer coding 3 to 4 hours/week is bad, you will be appalled to know in India you can get a team of 5 workers producing 3 to 4 hours/week of one barely competent US developer.\n\nMany offshore teams prey on the naïveté of non technical decision makers to exaggerate the scope of a project and produce the least amount of work conceivable. \n\nMy organization absolutely lost a bunch of money (overpaying 2x) hiring offshore workers in many instances but it wasn’t my decision to make and leadership wanted to offload responsibility by pointing they had 5+ workers working on the task.",
            "Our society won't allow unproductive workers to last too long lynching off companies. If there are too many of them our society just won't function as there will be absolutely shortage of necessary workers that can actually contribute. They will get punished sooner or later by self-purification of our society. I think the currently tech layoff is still not enough to punish them. Bullshit jobs need to go.",
            "It’s really not, as Indians spend 1 hour coding and 39 munching curry, I literally just got a job in 2 days of searching y’all just suck",
            "That's a factor but not the sole reason, capitalism's main point is always to maximize profits and cut costs. \n\nUS Devs are probably the most expensive Devs on earth, if corporations can find someone somewhere with almost the same skill and pay 1/10 of the salary they will.\n\nUnionize.",
            "Do you live under a rock",
            "We call this enshittification when the jobs move overseas",
            "Time spent pounding away on a keyboard isn’t indicative of work. I play dueling leetcode at a local bar with a couple of CompSci majors, and I spend about a third as much time as they do actually writing code. I spend some time drawing a flowchart, then a little time looking up documentation, a minute or two looking at the drink specials menu, but the code still gets written, and seemingly with a great deal less consternation than the others undergo. So, the question is, whom would a business be better served by hiring?",
            "Its somewhat accurate. Id add in time doing compilations/builds, testing, design, and such",
            "No wonder company thinks layoffs is better and AI is for win. I really fear for our programmers future",
            "No idea if this is the reason. But can confirm in Asia we don't get this much free time in coding jobs. It's mostly either writing code or debugging for us and only 4 or 5 hours in meetings and even they are mostly for debugging issues with the team mates. At the end of the sprint if all work was completed perhaps a 1 free day.",
            "No it’s just cheaper",
            "that guy probably has a low paying job or government job 4 hours coding is def not normal",
            "If you think productivity/quality of the work offshore is going to be any closer to the productivity of that person you are going to have a very bad surprise.",
            "The pertainent question here is how much time does the onshore developer spend fixing offshore code ?",
            "No, because my Indian coworkers do the same exact thing lmao",
            "Here in Europe we do the same. But cheaper.",
            "Had an argument with one of the managers about this. Told him I waste too much time with office nonsense like emails, meetings etc. He told me to do what I'm paid to do and that includes emails, meetings etc. So I waste time because they pay me to.",
            "Overseas programmers do the same exact thing for a lower salary. \n\nAs a Product Manager on a dev team that uses scaled agile, programmers essentially _predict_ how much work they are going to do in a given time and they allow themselves a huge buffer (mostly because they don’t want to be overworked). When they complete the work, it’s been tested and works as per the definition of done, then they do busy work until the end of the sprint - which most of the time is like barely doing anything. They’re also forced to attend useless meetings where they answer trivial questions from senior leadership that don’t really have a clue what they’re building .\n\nNow new CS Majors coming out of college aren’t really that great, unless they’re extremely passionate and brilliant coders, but most of these guys go on to do their own thing and don’t mind coding 60 hours a week. That doesn’t mean that CS majors will suck forever, but even a year or two of solid experience in the field after college can really improve the knowledge, skills and abilities of software developers. \n\nThe bad news is, the bubble burst a long time ago for programmers. The global market is saturated. There’s still a premium for really great programmers, but the average guys aren’t going to be making 150-200k anymore - especially when pretty much everywhere overseas has people that are willing to do it for a fraction of what people are expecting in the USA.",
            "Where do people get these jobs I was working 60 hours a week at my last internship",
            "Its why tge think the can cut and not lose productivity.",
            "No, but it is why some people are getting laid off.",
            "Are CS jobs moving overseas?  Where would that be exactly?  India? Pakistan?  Both enjoy a big share of the offshoring, it was more in the 90's and early 00's, but we realized that didn't work for a number of reasons.  It's not going to china or russia.  So where are these jobs going?  Offshoring has been done for years.  In CS it doesn't work for exactly the reason above.  You can meet about a feature or design element if there is a 15 hour and 10k mile gap.",
            "'overseas'",
            "My ratios for a paid 37 hour position -\n\n15 hours of coding\n\n20 hours of meetings\n\n12 hours of correspondance\n\n5 hours of documentation.\n\nYes, that is 15 too many hours. I haven’t had a real weekend in years.",
            "Keep in mind most of these people are working in different positions. Spending more time in meetings than coding sounds more like a lead role than the typical SE role.\n\nBut yeah OP is a loser",
            "SRE in Europe here. Do you think here it looks differently? Coding or actual touching infrastructure is the smallest part of my job by time. I spend many hours a week in meeting but these are necessary to either learn or plan/design stuff the way it should be. After we have few meetings discussing what needs to be done and how we approach doing it then we do it. When it comes to slacking off it depends on time. There are weeks where nothing breaks there’s just few tickets or some documentation writing. But there are also times where everything is on fire or I need to stay after work hours to implement planned change/deploy. Soon also on-call. \n\nNOONE works full 8h daily. I literally don’t know a person like that. But you know what? We meet all our targets, S indicators are how they should be so who cares?",
            "Nah. The overseas people are doing the same shit. Just for less money. It's the same reason manufacturing moved overseas.",
            "The thing people don't understand about this is you have to be a really good developer to pull this off.",
            "I asked my parent who’s spent years in investment banking and this is the advice they gave me; not as a parent but as a businessman:\n\n*”why the fuck would I pay some snobby entitled shithead, who saw the CS Major as a ‘get rich quick scheme’ on TikTok, a 6 figure salary when I could hire someone who has twice the mind and less questions asked from a more poverty-stricken country where they’d be grateful just to get what they get?”*",
            "It would actually be interesting to see data that backs this up. Or disprovees it"
        ]
    },
    {
        "post_id": "1c0amec",
        "author": "Affectionate-Owl-178",
        "title": "My uni has reached a breaking point with the amount of CS students",
        "url": "https://www.reddit.com/r/csMajors/comments/1c0amec/my_uni_has_reached_a_breaking_point_with_the/",
        "score": 939,
        "num_comments": 296,
        "created_utc": 1712716152.0,
        "selftext": "They are literally at their wit's end in how to manage the situation. The torrential flood of CS majors has completely overtaken the department. The introductory sequence weed out courses (Intro to Programming, Data Structures and Algorithms) which before had around 50-75 students on average with half dropping out and only 2 sections available now have 3 separate sections with each one filled to the brim with 150 students, 70 students, and 70 for the third as well.\n\nThe Data Structures and Algorithms course for this Spring semester across all sections has 250 students... so not very many are getting weeded out it would appear.\n\nBefore in the upper level courses like Compilers, Networking, Operating Systems, Computer Architecture the classes would be very small and intimate since only a few original majors would have survived and made it to that point. It used to be like guaranteed class sizes of maybe 20 people, 25 at most.\n\nComputer Architecture for this semester has 90 people in it. Operating Systems which before had only one section with around 25 max capacity now has 50 students, along with another section they had to open to accommodate another 30.\n\nCompilers, which is supposed to be an extremely upper level 500 level course, has 90 PEOPLE in it this semester.\n\nThis shit is crazy y'all.",
        "permalink": "/r/csMajors/comments/1c0amec/my_uni_has_reached_a_breaking_point_with_the/",
        "comments": [
            "Should’ve just been born 8 years earlier so you could’ve entered the industry at the right time.\n Honestly though I agree with you. Tech was one of the last industries where school prestige didn’t matter and the barrier of entry was very accessible. Supply is finally meeting demand and a lot of people are going to be having it rough in a couple years",
            "You must go to a tiny school there's like 160 at my schools compilers class",
            "huh your classes are pretty small\n\ni don't know if it is a college but at my university it is normal for classes to be 100-300 people",
            "Yep, even back pre-COVID, lower-level required courses (discrete structures, OOP) or popular electives (Intro to ML) hit 500-600 students. Needed enough TAs to hold office hours every day of the week for several hours. And my undergrad institution was large, but not even that large -- at the time, something like 14k undergrads. Can't imagine what it's like at the huge public schools.",
            "I hope some of them create new businesses because this is unsustainable.",
            "Yeah, the growth is just not sustainable. The laws of supply and demand should correct it at some point.",
            "Drop out and go into welding",
            "I mean it’s just becoming a more mainstream major like business, finance, psychology etc",
            "I mean you're part of the problem and you're complaining?",
            "Well i think its important to consider the major reason so many people are staying and not dropping as is usually the case. the answers are \n\n1) more of a community, which prompts more answer sharing and if one guy spreads the code the rest of the class is prolly getting it. not saying this wasn't here before but its easy now cuz of discord. you dont have to worry about these people because if they cheat in things like dsalgo then they'll prolly struggle getting the job. But then again, a person can prolly learn leetcode separately.\n\n2) chatgpt. people not caring to even review the answers they get on discord, instead they plug it into chatgpt and get the assignment out. easy bingo. and with chatgpt its become easier to learn the material as opposed to having to find the right yt vid anyways. so people relying on chatgpt (in the wrong way) will prolly not be in ur competition range too, assuming you work fairly\n\nor maybe number 3, people are just getting smarter. i mean nothing you can do there, except hope you have referrals or hope you're extra good at dsalgo",
            "250 students is standard for a lecture hall at a 4-year university, no? Chemistry lectures are constantly filled with 200-300 kids, so why is CS any different?",
            "Now imagine that’s a speck of dust compared to the amount of CS majors in Indian universities.",
            "That's a whole lotta homeless people",
            "I feel like there’s a certain level of latency between current students figuring out a major is oversaturated and incoming students finding out. Like a lot of incoming CS majors are completely oblivious to the state of things and that’s why enrollment rates keep climbing",
            "My school has 8,000 cs majors currently. I’m fucked.",
            "The weed out courses are not programming related, they are stuff like multivariable calculus, physics, statistics, etc. If your uni doesn't have those mandatory at the start, then there's your problem. If you're grading on a curve, there you have another problem. Etc.\n\nNot that I would actually care if you can calculate an integral around a singularity in the complex plane for any actual job, but that 90% failure rate per final was quite a sight to behold.",
            "250 is pretty small. Come to my university, DS&A is 1800 people",
            "Oof psychology had like 200 students per year when I was in uni. Isn't that normal?\n\nI know biological sciences also had about 200 students. I studied in the UK.",
            "Jesus Christ what do all these people think they will do when they graduate?!?! Hasn’t anyone told them there are no fucking jobs??!!?",
            "That’s pretty small. My college normally has intro courses with 1000-3000 people. Then from there eventually 3rd and 4th year courses get down to under 100 people.",
            ">literally at their wit’s end\n\nWow, so they just have students dropping out of the sky huh? There’s no way they could just, I don’t know, select a couple of them they think fit in well and apologize for running out of space to the rest. \n\nWell no way to do that *and* mint money I guess. \n\n/s in case its needed. I find it vaguely offensive and funny how everyone here complains about everyone else  trying to get a comp sci degree but think they’re special.",
            "They should put C++ as starting programming language to weed out most of the CS students😁",
            "They're about to find out. Unemployment is hard.",
            "Colleges are businesses (especially, the private ones), so why would they be opposed to a growing influx of clients as long as they can accommodate everyone?",
            "When did compilers become considered that advanced? They were a compulsory module year 1 for us (20 odd years ago).",
            "The module names and their respective semesters line up exactly with my uni and course. Did you go to university of S in England? I graduated last year and noticed a big change after my placement year. Even had a TA tell me they are being more lenient due to a skills gap compared to previous years. In my third year, one module had an optional coursework that I found out was compulsory for previous years but the average grade was too low.",
            "Those are rookie numbers. Back in 2014 my intro class had like, 400 students? It was 1200 in 2018. They hired like 30 something instructional assistants and we're having lectures in random buildings on campus - school of public health and what not.\n\nToday, the university has a standalone application for CS and half the posts on the university subreddit are \"help I didn't get into the CS program but I like the university and want to do CS\".",
            "lol this is nuts. back in the old days of the 2010s my advanced algorithms class had 5 students",
            "Expect shit pay when they all flood the market. It only benefits the companies",
            "The school wouldn't reach breaking point for that though. They'd just start rejecting applications, which would probably involve raising the bar for acceptance. Which does seem to be happening.\n\nThe university is under no obligation to accept every, or any student. CS enrollment has probably increased disproportionately to other majors, and if the administration is being greedy that might negatively impact the student experience.\n\nBut the uni is not at breaking point because it it.",
            "not another wgu/bootcamp grad confused why they can’t speed run a cs career",
            "Okay but data structures is entry level class, the numbers go wayyyyy down after those classes",
            "In my university there are 6500 students itself in CSE branch and they're rolling out other variations like cse with aiml, blockchain, cybersecurity, data science to get more students idk and every year they show the 100 percent placements report....",
            "So what?",
            "I feel bad, there's no jobs when they're done.",
            "As an educator, the concept of weed out classes upsets me. They are a marker if departments whose students succeed despite their shitty teaching, not because of it. God I hate the education system.",
            "I had 8 sections with 40-170 students each. Total 1000 CS students on 2020 batch lol.",
            "Mortal Kombat",
            "I went to law school in my home country. There were 1800 of us in the first year. Half the 2nd year and again half the third year.",
            "My school was having this problem, but we got new teachers for algorithms and operating systems. Idk if it was intentional but those classes went from 150 at the beginning to like 20 at the end. The upper classes only have 10-20 students now.",
            "Joke is on the people taking compilers classes; there are an infinite number of superior teachers with free resources to learn to build interpreters and compilers online. For one, look up crafting interpreters.",
            "Population growth is explosive and kids are getting to an age where they're entering higher education and the workforce. CS seems like one of the only safe careers to people in a time of AI and Robotics replacing a lot of other work.\n\nMaybe the school can expand with the additional tuition those students are bringing?",
            "What’s the school?",
            "Don't worry, universities find a way, a very usual way is to use a relative grading system. That way only the percentage of people, representing the maximum number of students the university can manage in that course, will get grades that allow them to continue the course. This is incredibly shit for the students by the way.",
            "Not sure which school you went to when there’s 20-25 people in your OS or Computer Arch class. My classes would have around 100 people and my school only had 7000ish kids. Compilers I’d expect to be on the lower end",
            "Mine has in 3000s , some dudes literally cry cause they cant make it , like tf? Yep its gonna be hella dry in a few years",
            "Hire more people then...",
            "Compilers with 90 people is INSANE. My university just offered it for the first time and years and there were only like 18 of us across undergrad and grad!! People avoided it like the plague!!",
            "Are the majority of students Indian ?",
            "It’s chill, most of them will be consulting after college",
            "I guarantee you more than half of the people in the sub haven't even entered the industry yet. So why would you take any advice or input from these people.",
            "[deleted]",
            "ITS TIME TO STEP OUR GAME UP BOYSS",
            "I feel the classes most likely got easier too in many schools and  how is a professor suppose to grade so many projects and assignments. \n\nPersonally if want weed out courses make them doing higher level math done!",
            "The reality is that just like for doctors, 4 years is not enough for a good engineer. It takes much more time. The difference is that for software engineering that time is hidden: some started coding/debugging when they were kids, some code many more hours per week. And all that time goes into relevant understanding of how software systems work, to something they will be able to use later at work.\n\nSo a good engineer actually spends much more time learning - it's just not as formalized as with doctors. A teenager interested in brain surgeries can't just do brain surgeries on cats in her free time after school. A teenager who likes coding for Minecraft can.\n\nSo yeah, people who just superficially motivated, and who spend only like 4 years total, they just won't cut it and will eventually move on to something else.",
            "Mmm usually the school/major/department itself should be capable of regulating itself isn't it?\n\nAt some point you either declare a major or apply for one, and the school can decide if you're allowed to move forward or not based on your qualifications or application.\n\nMaybe the facilities haven't expanded, but I'm sure the department/school/college is just enjoying the extra numbers, funding and clout...",
            "Which uni? I'm sure numbers will drop later.",
            "250 is not a lot. \n\n20years ago my university has 20-30 cs students per intake. While businesses, pharmacy and electric/ electronics engineering consistently getting 100-200 students per intake.",
            "At  my uni, the Python programming subject, has I think roughly 600-1000 students depending which semester. Though to be fair many of them are non CS students with the Python subjects (such as engineers who fail a lot). There are less people in my DSA class.",
            "I was tutoring in Vienna/Austria for about 500 people in distributed systems almost two decades ago.\nTypically we had about  1000 new students every year.\n\nInterestingly the numbers didn't really increase. In fact they even decreased quite a bit over the years last time I checked.\nI've been teaching at smaller colleges and sometimes they even struggle to fill their capacity.\n\nConsider that studying is almost free here.\n\nCompletely contrary to what I see in my job for US companies where it's become an insane mass market.",
            "I go to everyone's second choice University for my state. The hardest class I have taken so far was Device Drivers. There were 8 people.\n\nI guess when you reincarnate you can try to go to a smaller University away from major Metro areas.",
            "Umich made it so people have to apply to the major now to help control the flow",
            "Good, this should bring developer salaries down. The  people in it for the money can walk themselves out",
            "No, it is not there yet. The intro to programming course at my school has 2000 - 3000 students 😅",
            "It’s entirely their fault for allowing so many students to enroll",
            "Perhaps what they should’ve done is established an employment pipeline to determine how many students they could turn over towards CS employment, instead of overselling the availability of work in the major field and bloating their rosters with students they can’t guarantee a good career field for.",
            "Bro didn’t make it Ivy League",
            "I did CS in the 90s and there were 150 of us. I am sure a department can manage where everyone has their own supercomputers on their pockets, laptops and widespread access to ultra-fast broadband. \n\nWhiny fucks",
            "Education is good for all. I dont see the problem here. Whats the issue?",
            "y’all my school only has 2 CPSC seniors and 15 CPSC Freshmen (was initially 45 but they were weeded out)….",
            "It all depends on how many of those students *actually* pass those courses. I wouldn't pay too much on the amount of students inside per classroom. Yes CS is popular, but if you don't have, at least, some kind of curiosity for it, you won't make it far. This also applies in getting a job as well. Getting a degree is not even required to get into a SWE job tbh (can certainly help, but not gatekeep level required like medicine and law). Have curiosity and build/acquire necessary skills, and it'll be fine, no matter market conditions.",
            "I swear to god they just need to make the math courses harder. 90% of people would have gotten filtered from math courses if they actually got tested properly instead of letting everyone be a winner.\n\nSo many of the people I worked with do not belong in the courses they're taking, they're incompetent."
        ]
    },
    {
        "post_id": "1835mvg",
        "author": "hawaaaa3",
        "title": "embarrassing swe intern interview moments LOL",
        "url": "https://www.reddit.com/r/csMajors/comments/1835mvg/embarrassing_swe_intern_interview_moments_lol/",
        "score": 934,
        "num_comments": 92,
        "created_utc": 1700869206.0,
        "selftext": "I just randomly thought about 2 embarrassing interview moments when I was first trying to get internships a few years ago and wanted to share them:\n\n* the first was my second year of college and I had only taken the 2 intro to CS courses. I didn't know anything about software development, or frameworks and node and all that stuff and the interviewer asked me **\"what's your favorite most exciting technology?\"** and I said...... 😭😭 I said..... **\"STACKS & QUEUES, I just love the way you can manipulate data and make it come out in different orderings\"** I still cringe so bad omg idk why they hired me. it was at a life insurance company\n* the second was at Salesforce SWE intern interview. I wrote my code to the problem and the interviewer asked me \"can you **rate** your code?\" I had no idea what he meant by \"rate\" so I said ..... 😭😭 \"I mean on a scale of 1-10 I feel like the style looks nice and readable so I would give it a 9/10,\"and he said.. \"I mean time complexity \"  LOL I DID NOT get that position, but I actually did move on to the next round after that . \n\nanyways just goes to show, regardless where you are at in your journey, just do the best you can with the knowledge that you have and things will hopefully work out.\n\n&#x200B;\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/1835mvg/embarrassing_swe_intern_interview_moments_lol/",
        "comments": [
            "if it makes u feel better, if someone asked me to rate my code i wouldve said the same thing… ive never heard the term ‘rate’ be used for complexity analysis in my life",
            "Interviewer asked me \"What's your favourite language?\" I replied \"English\" and she said she meant programming language. I then corrected myself and said \"Java\" she then said \"you do know that the required programming language for this position is Python, right?\"",
            "LMAo not the stack and queues 💀✋️",
            "interviewer asked me what dependency injection was, couldn’t answer. i was using it everyday at work as an intern working b.e with spring",
            "I got caught lying about something I worked on in a past internship. They kept asking questions and poking holes in my story, so I just ended up leaving the interview lmao",
            "One time I gave an interview on a coderpad. The Coderpad  link had a drawing and rough works portion, before the interview I drew out a popular leetcode problem that was also tagged for this company. \n\nThis was just for testing to see if I understood, I drew out the problem but decided it was too difficult in my current scope so abandoned it. The interview comes and wouldn’t you know it’s the exact same question, I open up the drawing portion to try to draw it out again, and wouldn’t you know there’s the previous drawing portion with the exact same question and diagram highlighted and my explanation of it 😭.\n\nThe interviewer looked at me in dead silence for like 2 minutes I still didn’t know how to solve it so I failed the interview. 💀💀💀💀",
            "\"9/10\" LMFAOOOOO at least you were humble",
            "Once I had an interviewer ask “what does this website do?” about a website I made that I listed on my resume. I had the website bookmarked on my browser so I was going to share my screen and show the interviewer while saying something like “here, I can go ahead and show you!…” to which then I clicked on the bookmark and it took me to my website … but at the same time it ended the zoom call because I had joined the call through the google browser and all of this occurred in a singular tab 😭 long story short, I wasn’t allowed back into the call ☠️",
            "my interviewer let me open up some documentation on my browser and they saw my op.gg",
            "I had a fire alarm go off mid-interview and had to leave for 5 mins while I *sprinted* to a campus building to rejoin. Had to do the rest of the interview frazzled and sweaty and was a total mess",
            "Interviewed for this startup swe intern position and bro just kept giving me rapid fire questions on weird ass react shit and halfway I left the interview 💀. I emailed bro that my WiFi disconnected and he actually said that he was free tmo but I ghosted 😭",
            "Lol I had my first interview sophomore year at a mid-sized company. They asked me a question that was basically Two Sum, and I fumbled the proper solution, so I used two for loops 🤓. Later on, I used the word \"cursed\" to describe sorting strings in alphabetical order to check for anagrams in order to be #relatable with the interviewer.\n\nNeedless to say, I didn't pass the interview.",
            "Someone showed me example code in an interview and asked me to go through it and say what it does and why. We went like by line and I couldn’t answer a single freaking thing. He asked a handful of *push you in the right direction* questions and I still did not answer a single thing. It was so obviously awful I apologized for wasting him time at the end of the interview \n\nI still to this day don’t remember what the code was and am not sure if I’d know the answers if I saw it again. It’s not like I’m incompetent I landed a different software job shortly after. I’ll always remember that one",
            ">\"STACKS & QUEUES, I just love the way you can manipulate data and make it come out in different orderings\"\n\nThis is a perfectly good answer.  In some ways, it's better than naming a framework or IDE or such.  For example, decades from now, you'll (hopefully) be using different frameworks and IDEs.  You'll still be using stacks and queues. \n\nI'm definitely adding this question to my interview set, hoping for this type of response. \n\n>rate your code\n\nThe use of \"rate\" in that context is ambiguous at best.  \n\nIt does remind me of one of my first aviation solo flights.  I'd not a lot of experience dealing with departure controllers, and when I was asked to \"state altitude leaving\" (which should have been in my initial call) I'd no idea what he meant.  That was my fault.  Not knowing what was meant by \"rate\" in that context was not yours.",
            "In my first interview out of uni. I froze up when they asked me to describe what a class is",
            "That's gonna be my go to from now on, and if the interviewer asks to demonstrate I will bring a 10-piece Tower of Hanoi puzzle and try to solve it in the remaining time.",
            "Stacks & queues rizz, lowkey can be used as a pick up line",
            "Lol",
            "HAHAHAAHHA bruh. The stacks part killed me. My worst interview was my first one ever on my life. It was with Nuance and it was a MS Teams call. What I didn't knew is that when you do these calls you have to turn on your camera 💀 Got rejected 10 minutes after...",
            "On one of my first interviews during college, that was in person, I dropped a bottle of water on the office and it made a big lake 😂😂\n\nI got the job",
            "Wait the first one is cute 😩",
            "😂😂😂 2nd one is enough internet for the day",
            "1 is lowkey cute lmfao (pause)",
            "LMFAO I had a logic question to make an AND gate from a MUX and holy shit should it have been trivial and I ADDED FEEDBACK! Oh lord I look back and have no confusion on why I didn’t get that job. \n\nFunny enough I ended up being considered for another position. They gave me another interview and I did get that internship lol",
            "Omg the stacks & queues answer reminded me how during the interview for my first internship I gushed over how much I liked linked lists & were my favourite data structure to the interviewer unwarranted. Guess I must’ve shown how much of a nerd I was because I still got the job lol",
            "Interviewer wished me good luck on the next interview . My sleepy ass said “you too” and cut the call.",
            "this is so funny",
            "im no swe dev but the second rating made me laugh LMAO love this thread",
            "glorious tan rock zesty offbeat worm memorize busy humorous instinctive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I was asked in an interview what a binary search was, I replied with linear search. This the phone interview in my senior year for a really great role. I still laugh/cry about it sometimes.",
            "embarrassment is the cost",
            "I don't see any reason to be ashamed.\n\nOn the first one, if the interviewer was good, he should have identified this answer shows you have the potential to be a good DBA.\n\nOn the 2nd one, me, with more than 30 years of experience, would never catch that by \"rate\" the guy means time-complexity of the algorithm.",
            "It’s okay my first ever cs interview I told my interviewer the time complexity for my code was O(n/2)",
            "Can someone genuinely explain why the first answer is cringe or ill-advised? Stacks and queues may be elementary but they’re still very important and within some complex data structures. A lot of data structures are genuinely clever inventions, especially trees and hashtables.\n\nI know you guys will recommend exhibiting practicality and talking about a real framework instead. But actually name dropping a legit framework as your favorite will open you up to a bunch of high level questions on abstracted details you weren’t asked to understand day to day before. It feels like opening a weak spot that you can’t 100% prepare for.\n\nI enjoyed Springboot a lot but I could not answer to all the precise intricacies that make it work for rest API’s down to the nut and bolt, though I’m trying to study up on it. At least a classroom data structure is safe and you’re more likely to crush follow ups.\n\nFrameworks change every decade, CS classroom principles don’t.",
            "one time my WiFi was lagging so bad I gave up on trying during the interview",
            "This was back in the spring when I lied on my resume heavy and didn’t really know too much about web development but i had my first phone screen and the dude asked, “what kind of technologies do you use for your projects?” And I literally blanked cause I didn’t know, MIND YOU, my resume has a technologies section that has, “.NET, Express, MySQL, MongoDB, flask” needless to say I didn’t move on to the next round but now I know much much better and have had a good amount of phone screens this cycle and I crush that question with ease lol",
            "I just had a horrible interview yesterday, and reading all these stories in this thread has made me feel significantly better. Thank you",
            "PLS 😭😭😭 thank you for posting this and keeping it real!!! this has been every one of us at some point but it's so easy to think you're the only one. made my day, thank you :)"
        ]
    },
    {
        "post_id": "twy8rm",
        "author": "OneVeryOriginalName",
        "title": "I’ve been told to try “getting a girlfriend” however I can’t seem to find that problem on LeetCode. Anyone know what number it is? I know it’s a hard difficulty so it’ll surely be worth my time and effort.",
        "url": "https://www.reddit.com/r/csMajors/comments/twy8rm/ive_been_told_to_try_getting_a_girlfriend_however/",
        "score": 940,
        "num_comments": 55,
        "created_utc": 1649174356.0,
        "selftext": "Title. Just can’t seem to figure it out",
        "permalink": "/r/csMajors/comments/twy8rm/ive_been_told_to_try_getting_a_girlfriend_however/",
        "comments": [
            "That feature isn’t available in the beta version",
            "It's an NP-hard problem. Can't be solved in polynomial time from what I've heard....",
            "Getting a girlfriend I heard grinds your behavioral interview skills up pretty well.",
            "It unlocks once you delete your account",
            "That’s a feature in beta testing right now as part of a new tier of difficulty called “Touching grass”",
            "It sure will make your leetcode hard",
            "[deleted]",
            "i recommend backtracking approach on local gym, updating hottest variable on each recursion",
            "You have to pay for Leetcode premium for four years and then you should get an email saying your girlfriend is ready to be shipped.",
            "its question 69",
            "It's not a Leetcode problem, sadly. It's more akin to a certification program. Once you get your first 6-figure FAANG job, you can start the application process.",
            "That problem is dynamic, but somehow lacks programming.\n\nWhile it’s in the NP class of problems, the last thing you will get is hard.\n\nI think you need to integrate with the red lights districts GFAS (Girl Friend As a Service), but be wary of viruses\n\nThis sounds like a networking problem.\n\nIt was a mistype, they meant to say “get a gh” not “get a gf”. Gh is a common acronym for GitHub you will use it to showcase your work.\n\nYou are probably going to have to start with mocking some data.\n\nThe only unit you will be testing is….\n\nOkay I’ll see myself out",
            "F for this one",
            "Its number 69",
            "Wtf is a girl?",
            "Solving 1000 leetcodes will print GF offer. Keep grinding. Dont eat, sleep, and poop. You got this",
            "Hahaha",
            "Task : get some bitches\n\nTask failed",
            "That question is under the tinder search algorithm section.",
            "Oh yeah, the edge cases are fun for that one ;)",
            "Try taking a shower and then getting some interesting hobbies. All leetcode and no play makes Jack a dull boy.",
            "I feel like you've confused Reddit and Blind.  Go ask over there.",
            "that's ultra hard mode!",
            "The hardware is all that matters in that department, nothing to do with software.",
            "r/outside",
            "You have to get the girlfriend before getting her number. Very ironic problem.",
            "I think it’s a premium question but you can do other questions tagged with insertion sort and you’ll be fine",
            "good one dud",
            "It unlocks when you get a six figure job",
            "."
        ]
    },
    {
        "post_id": "1ch2to3",
        "author": "Ok_Issue_6544",
        "title": "number of cs grads over time (and possible futures)",
        "url": "https://i.redd.it/w9qf8yeoeoxc1.png",
        "score": 932,
        "num_comments": 76,
        "created_utc": 1714508771.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ch2to3/number_of_cs_grads_over_time_and_possible_futures/",
        "comments": [
            "Lol, adding the misaligned AGI was a nice touch",
            "can anyone explain the peak at 1985 btw? I know Microsoft, IBM, Apple, etc. were taking off at the time, which explains the rise, but why the drop?\n\nEdit: source is [nces.ed.gov](http://nces.ed.gov). Also the number is for bachelor graduates in \"computer and information sciences\", which may include other majors related to CS.",
            "Now we need a graph of related job openings over time to compare with",
            "It’s US fault for keeping the program so easy. In Poland 90% people who enroll at good universities (there are like 10 tops which matter in whole country when it comes to finishing cs) don’t finish the bachelor of science. We don’t have an overload of cs students which don’t differ much from bootcampers.",
            "Hahahah what the f is this graph analysis?",
            "That is a really neat graph... I like this one more:\n\nhttps://preview.redd.it/a9nx7eoesoxc1.png?width=2620&format=png&auto=webp&s=feded6770bbe4dca33028c66eef70371d84df13f",
            "Nah, outsourcing will drop those numbers to like 10k. US be either factory worker or a banker. Or a porn star.",
            "Unfortunately, I think it peaked during 2021-2022, it will follow the redline for one reason: baby boomers continuing to retire and too few kids. And with all the recent IT layoff and bad press about it, will only push more of them of CS degree, I already see it happening. And this is already the state in Korea and Japan, that are now lacking Software developers heavily.",
            "Funny post 🤣🤣🤣",
            "I'd imagine a Butlerian Jihad would lead to a similar outcome as an AGI extinction event in terms of this chart",
            "RemindMe! 5 years hopefully I pass this computer org final and become a part of the ai techno utopia branch.",
            "In short, we have absolutely no idea what's going to happen in the future, right?\nIt's useful to be reminded that once in a while, I guess...",
            "How are you establishing these “possible future” other than just drawing lines on a graph?",
            "Is this a Bitcoin halving graph",
            "The graph could either go down OR up? These are some crazy predictions man",
            "[deleted]",
            "You don’t know what happened in 1985??? 🤣",
            "Love how the extinction event matches utopia until things suddenly go south",
            "why after dotcom crash people had more common sense that today?",
            "im bullish, graph obv states its gunna go back up",
            "Funny that you think AI automation will cause reduced CS workforce. I think it will just cause a bigger boom.",
            "\"freshmen changing major in 2022\" hey that's me!",
            "I'm praying for the cyberpunk/ ai thing",
            "WTF",
            "was this made 4 years ago or what",
            "This is the worst graph ive ever seen."
        ]
    }
]