[
    {
        "post_id": "p7krl4",
        "author": "kldsfji23rke3sf",
        "title": "Is this insider trading?",
        "url": "https://www.reddit.com/r/csMajors/comments/p7krl4/is_this_insider_trading/",
        "score": 936,
        "num_comments": 55,
        "created_utc": 1629398173.0,
        "selftext": "I want to buy company X stock. I am planning to join company X in the coming weeks. I know once I join, the stock will skyrocket from my impact. Is it insider trading to buy the stock now?",
        "permalink": "/r/csMajors/comments/p7krl4/is_this_insider_trading/",
        "comments": [
            "Yes, expect FBI very soon.",
            "No that’s horrible however on a unrelated note, what’s the name of the company and when are you gonna join it btw",
            "I shorted my company before I joined, made 101230123012312 dogecoin, and now I'm facing a 5 year sentence for insider trading",
            "What a chad",
            "[deleted]",
            "In most cases, no, you aren't that special. If, however, you are bringing material assets like patents that will immediately boost the value of the company, someone could probably argue that as insider trading.\n\n(IANAL)",
            "Yes. 100%.\n\nBecause you have the insider knowledge about your future impact. You will 100% go to jail.\n\nThis Reddit thread will prove that it's premeditated.",
            "**Insider Trading:** \"the illegal practice of trading on the stock exchange to one's own advantage through having access to confidential information.\"\n\n**Confidential:** \" indicating that what one says is private or secret\"\n\nYes, if you bought company stock X or advised someone to buy company stock X, it would be insider trading.\n\nLike imagine of Bezos bought a huge share of some no-name company and then a year later became CEO of that company. Investors would come flocking to follow his name, and he got a premium on it due to information that no one else had access to.\n\nThis brought to you by an arm chair lawyer",
            "No, don’t be silly, you are currently outside of the company. How could it be insider if you’re outside?\n\nBuy, buy, buy. \n\nSigma Grindset to the fullest 😤😤😤",
            "This might be the most cs post ever posted in cs posts... i give you 9/10 points for the humble bragging,  8/10 for the mathematical nerd humor (very stale and logical) and 3/10 for the relevancy to this entire subreddits actual purpose (spectacular work)",
            "*SEC? Yes this post right here.*",
            "gigachad",
            "You’ll be inside soon!",
            "Honestly talk to a finance/tax lawyer about that",
            "No. Before you sign with the company, you are not affiliated with the entity, therefore you are not an \"insider.\"",
            "Only if you are joining for full time and not an internship.",
            "No it’s not. That’s just a pure guess. Insider trading is if you knew a change was going to occur within the company that would move the stock market and you buy or sell stock directly before that change becomes public information.",
            "Yes. \nI believe so, since like my mom works for a company, and we know about the insides of it. So that would be insider trading.",
            "I don't know whether I should just say yes or to tell you to curb your prongramnin abilities",
            "Buy Twitter, got it.",
            "More pressing question: will there be adequate space in the building for people AND your ego?"
        ]
    },
    {
        "post_id": "rb80yp",
        "author": "Forrox",
        "title": "I finally did it",
        "url": "https://www.reddit.com/r/csMajors/comments/rb80yp/i_finally_did_it/",
        "score": 937,
        "num_comments": 96,
        "created_utc": 1638907203.0,
        "selftext": "I got an offer. Bank of America. My first one. I'm too happy right now 😢. I suffered for so long.",
        "permalink": "/r/csMajors/comments/rb80yp/i_finally_did_it/",
        "comments": [
            "Congrats! New grad?",
            "Bofa",
            "Hey congrats!!!! Did they end up calling you?",
            "[deleted]",
            "No man, woman or child has suffered more than u",
            "LETTTSSSSSSS GOOOOOOOOOO. CONGRATULATIONS!!!!!!!!",
            "New grad?",
            "I was an intern at BofA awhile back. Congrats! This is great. They are a great company and you should be so proud of yourself. Feel free to DM me about anything.",
            "Congratulations!",
            "Can you share some tips for sophomores and juniurs who are applying now?",
            "Congrats! Do you mind sharing your timeline?",
            "make sure u dont skull fuck their entire system",
            "Congratulations! I hope I’m as lucky soon…",
            "Are these Subreddits mainly for \"I made it!\" posts?\n\nI am sincerely confused by how much of my news feed is made up by these sorts of posts...",
            "I’m so proud of you! Congratulations 🤍",
            "What was their offer if you don’t mind me asking?",
            "Tell bofa to let me do app mfa instead of phone mfa pls. Someone can sim swap me and take money out of my bank",
            "I’m so proud of u",
            "CONGRATULATIONS 🎊\nMy self esteem is currently in the 🚽\nDid they ask you LC questions?\nAre you a new grad?\nIf you're comfortable would you share details like benefits and salary?\nI'm currently a Junior and I wanna live vicariously through you lol",
            "Me too I did it too!! It just feels so nice",
            "Oh my congratulations!!!",
            "congrats!",
            "Congrats on the offer :)",
            "congrats!",
            "Don't worry the suffering has just started 😂👏",
            "Omg I got an offer from them today!",
            "[deleted]",
            "I feel you! Good job buddy!",
            "[deleted]",
            "CONGRATS !!!!!",
            "Kudos to you buddy. You got it, I believe in you",
            "hey Congrats!",
            "Let's fucken gooo",
            "congrats! is this for their freshman tech analyst program?",
            "Congrats!!! Best of luck in your new position!",
            "Congrats 🎉🎉",
            ".",
            "Ooo what location are you at"
        ]
    },
    {
        "post_id": "18g6lnw",
        "author": "Dazzling-Rooster2103",
        "title": "START GOING TO THE GYM NOW.",
        "url": "https://www.reddit.com/r/csMajors/comments/18g6lnw/start_going_to_the_gym_now/",
        "score": 932,
        "num_comments": 136,
        "created_utc": 1702334654.0,
        "selftext": "If you are a Computer Science major, please start going to the gym. This is a career with very little physical activity, you will spend entire days on meetings without moving, get into the habit now of going to the gym, so you can continue that habit when you are older. I know it may be hard to take an hour out of your day to workout. But it's worth it. You will thank yourself when you are older if you start now.",
        "permalink": "/r/csMajors/comments/18g6lnw/start_going_to_the_gym_now/",
        "comments": [
            "Reading from the gym. Leg day, pain day, gain day 💪",
            "Going to the gym was really hard when I was in school. Now that I work full time it is so much easier, been going 6x per week for the last few months.",
            "Build the habit as early as possible. Lifting and my fitness has really helped me in school too because of the mental clarity it brings. I honestly think I would be dead if it weren’t working out due to the mental health issues I faced when I was younger and in the beginning of college. Everyone needs a physical outlet; our bodies were made to move and not be sedentary. Not to mention, being jacked in a CS lecture is kinda lit.",
            "Going to the gym has been one of the best decisions I have ever made. Started when I was still studying and now it’s a habit that improves my quality of life so much.. Start early :)",
            "I would highly suggest people to buy dumbbells and exercise at home. I bought them during my internship and it has had a great impact on my health even though I started in july. The biggest challenge i felt earlier was gathering the willpower to go to the gym after uni work, but its much easier to do it at home, and if you do it even thrice a week it makes a big difference.",
            "“We don’t shower, you think we care about gym”🤓",
            "I'm a mature professional, I served 10 years in the Army, another 12 years in Law Enforcement, and just the past year of working in Tech alone has got me fucked up.\n\nYour metabolism slows down, you gain weight faster but it takes twice as long to lose it. \n\nDon't get complacent and lazy, but you'll pay for it later in life. I'm currently suffering from some major issue that has resulted in physical therapy because I haven't been staying as active as I have been.\n\nIn my age, it can quickly become irreversible, so keep on top of it while you're young and flexible.",
            "Gym is not the only way of staying somewhat healthy. All I do Is going for a walk (minimum 5km) 6 times a week.",
            "Just do pushups and bodyweight squats in your room, if it’s easier",
            "Good message",
            "Bench PRs 👇",
            "You’re asking these nerds to do physical activities?",
            "I ❤️ the gym",
            "As a CS student, father, and fix it Felix, physical activity is paramount. I make it a habit to do 40 pushups per hour for some type of physical activity. \n\nAnd at the gym, I don’t listen to music. I listen to the podcast “base.cs”. Podcast is featured around applying real life situations and examples to data structures and algorithms. Very entertaining if I do say so myself.",
            "Or be like every CS major I know and get into indoor rock climbing!",
            "Is there a way to read CS theory papers while also exercising at the same exact time? Maybe augmented reality?",
            "How to know what to do at the gym? At my campus, I go completely blank after entering gym. I don't know what to even do! There's no trainers, and that's why I stopped going to gym.",
            "since i dont have a job atm, i hit the gym occasionally...",
            " Absolutely, hitting the gym is a fantastic way to unwind after a long coding session. It's not just good for the body, but it's also a great mental reset. Enjoyable and refreshing",
            "Yes. You're right. i was literally bored after work looking for something to do.",
            "Everyone post their LAT spread rn",
            "The trade off is that it pays well enough to join my local country club in my 20’s",
            "BIG FACTS. Between where I started my dev job to present day, I have gained 30+ pounds. And that's with me working out here and there over the course of a year. HIT THE GYM NOW!!!",
            "I started in 2011...",
            "We all gym bros now",
            "Well I did, and then I stopped, started again, and stopped again… 😭",
            "Not to mention the benefits exercise has on the brain.  Thanks for the reminder OP.",
            "Computer and desk jobs are kind of optimal for bodybuilding as you can train really hard then rest the whole day while working",
            "I'm a senior engineer. Do what OP says. Weak core and back muscles will kill you sitting in a chair for hours on end. Don't ignore this warning, someday you may really regret it. Sciatica is terrible, you never want to experience it. I was lucky enough to have a good doctor and the opportunity to make lifestyle changes before things got too bad for me. But I'll never be 100% again.\n\nGo read the sciatica subreddit for a few minutes and you'll understand just how important of a warning this is.",
            "I’m currently working out just to be one of those comically large dudes working a desk job in the tech field. Oh and to be healthy too I guess",
            "I am succeeding in workout more than in CS lol, I am happy to give one hour to it",
            "Be jacked and be smart so don’t do CS and get into debt getting that degree while AI will take over jobs soon. peace ✌️",
            "I bought a kettlebell and I use it at home in between meetings, anytime I can. After work do some street workout with a pair of gymnastic rings (mainly because I hate gym closed environment or waiting). Also Pistol Squats & Bulgarian Split Squats every other day.",
            "I walk daily for 30 to 40 minutes. I hope that would be okay.",
            "Best advice ever",
            "Another good tip: always take the stairs. My little cubicle space is on the fourth floor, the cafe, gym, company store, large meeting rooms, etc, are on the first floor. I have been at my job since June and I may have been on an elevator once, with my manager.",
            "Just buy a weighted vest, a few cheap free weights and barbel online, facebook marketplace, or Craigslist tbh. That’s all you need. During covid that’s what I did and when I had my summer internship, eat healthy and you’ll easily get some visible abs plus muscle.",
            "Thanks for this message. Will now start working out and get absolutely jacked",
            "100% agree. I started the gym seriously earlier this year and I feel and look better than ever. Please get in the gym guys🙏🏽",
            "I have underdesk Treadmil and walk avarage of 25 K steps a day.",
            "It’s about being active not going to the gym. If you go for a 30min walk in the mornings and then 30min walk in the afternoon then you will be more active than actually going to the gym and lifting weights. If you go to the gym to do cardio you can just do that for free wherever tbh. \n\nThis is why people in Europe are not fat. None of them have ever stepped a foot into a gym before. Obviously need to eat clean too.",
            "The only exercise we need is leetcode. Gyms too expensive",
            "i suggest the climbing gym! :)",
            "I don't understand how people can get by not going to the gym. My body just starts falling apart everytime I take a break from it.",
            "Amen, don't skip deadlifts or you'll get neck/back problems later!",
            " Or bring gym home and do it in meetings",
            "That’s assuming you actually land a career in CS after graduation and don’t end up doing shitty low wage jobs for the rest of your life like me 🥲",
            "Honestly though man. \n\nThose days where I have mental fatigue going to the gym kinda cancels it out haha. Feel like the physical exercise clears the mental fog/fatigue",
            "Bro is trying to reduce the competition ☠️"
        ]
    },
    {
        "post_id": "13o9p53",
        "author": "rmrking8d",
        "title": "Instagram SWE Intern",
        "url": "https://www.reddit.com/r/csMajors/comments/13o9p53/instagram_swe_intern/",
        "score": 926,
        "num_comments": 30,
        "created_utc": 1684711368.0,
        "selftext": "Just pushed my code!! Proud to be working with such a great team :)",
        "permalink": "/r/csMajors/comments/13o9p53/instagram_swe_intern/",
        "comments": [
            "I knew this post was coming",
            "Lol I just thought my wifi was being whack until i saw this post",
            "I now know why my instagram comments section was acting weird. So it was the \"intern\".",
            "Goddamn it Aaron!",
            "You'd say \"landed\" instead of \"pushed\" if you were an Instagram intern. Nice try though.\n\n(Yes I know this is a shitpost don't bully me)",
            "😭",
            "Hahaha",
            "Nope",
            "What happened?",
            "So you were the reason...",
            "So they kept u after that? 🤨",
            "Instagram lol? U mean meta? The one that doesn’t give return offers? /s",
            "Dear intern. Please fix the instagram bugs and get rid of spam bots. Thank you!",
            "Jokes on you there are no instagram interns this year. (Atleast in London, but probably worldwide)\n\nThey didnt give out return FTE or return intern offers last year",
            "😭😭😭",
            "Saw this on blind",
            "Lol"
        ]
    },
    {
        "post_id": "108dr7i",
        "author": "None",
        "title": "make your life worth living now",
        "url": "https://www.reddit.com/r/csMajors/comments/108dr7i/make_your_life_worth_living_now/",
        "score": 922,
        "num_comments": 51,
        "created_utc": 1673367538.0,
        "selftext": "My dad worked in the CS industry for about 35 years, stayed loyal to his company for his entire career and didn't really have much else going on. Didn't drink or smoke, the worst he did was probably stay up way later than he should.   \nHe was the kind of person that probably resembles a lot of us, wasn't easy for him to talk about his feelings, struggled with physical affection a bit,  those things got somewhat better over the years, maybe he would have even gone to therapy once he retired.   \nFew months ago he had an anyeurisma and after being in a coma for some weeks, he'll never be able to walk, talk or do fuck all ever again, he seems to be mostly aware of what is going on around him.  \nMost likely won't be able to stay arround for any grandkids, won't be able to enjoy a retirement and out of his coworkers, there is two that come see him once in a while.   \nI am not saying this wouldn't have been worse if he was in a different field, that he didn't somewhat enjoy what he was doing, that things won't go different for you but in the end TC, your Faang internship and your hackerrank don't mean shit when for 3/7 days of the week the only people you see a doctors and people moving you around or using a tube to suck the thick saliva out of your mouth because you can't swallow anymore.    \n   \nWhat does matter is the family and friends that come around sometimes, massage his feet, put in a CD for a while, check in with the doctors and try to make this as bearable as possible while it lasts",
        "permalink": "/r/csMajors/comments/108dr7i/make_your_life_worth_living_now/",
        "comments": [
            "I’m sorry to hear about the unfortunate situation your dad is in. I hope that he is still able to feel joy and love when you and your family visit him. But pardon me for saying that, while you have a point to make life worth living now, you should not assume that your dad didn’t live the life he wanted. If he wanted the quiet life with a stable job, a wife and kids, and a few close friends, it sounds like he got exactly that.",
            "[deleted]",
            "Sorry for your loss, OP. Hope you're doing well.\n\nI just wanted to chime in as Devil's advocate since people have said similar things to me.  I'm a very simple guy, like simple things, and a simple life, no vices. Maybe your dad was the same way. Some people just want minimalist lives.\n\nYou can't take money to the grave, but you also can't take food with you either but that's no excuse to keep your fridge empty. I don't save money for death, like I don't buy food for when I'm dead.  I save for when I need it while I'm alive. What happens to it after I'm gone is what wills are for.\n\nYour dad may be like a lot of us, and just wanted to work to support his family and showed his love through his support.  And you guys supported him when he needed it, too.  It's bad enough to mourn such a loss, OP, but try not to mourn his life, too.",
            "Living a minimalist and non ambitious life is very much the life of a happy person. Too many people think you need to travel, have a beautiful wife, and lot of $$ to be happy and its far from the truth. There's a reason why buddha preached about having less and giving. Your dad lived a happy life but at the end he fell victim to the merciless reality of universe. It's not his fault and he has no control over it.",
            "All prayers and love for you and your father op! I'll be honest, I think I spend too much time focusing on improving myself as a coder. I do workout at least, but, I feel like I need to do more since I've read you post.",
            ">  but in the end TC, your Faang internship and your hackerrank \n\nI'm convinced that 99% of people want this because they want to be in a happy romantic relationship and think accomplishing this will help them achieve that.",
            "I am so sorry to hear about this, OP. Sending you, your family, and your father lots of love and positive energy and thoughts. I really really hope he recovers soon!!",
            "You’re probably upset, it’s a big change to have suddenly dropped onto your life. But your father got you and your family to this point. Got you into CS school and on track to be successful in upper middle class America or beyond. Try to have some gratitude for all that he’s done for you and your family. In a way, his life was a sacrifice for your lifestyle and education. Appreciate that and consider it when you’re deciding how to help him now in his future.",
            "this is really unfortunate to hear and wishing all the best for you and your family at this time + wishing a good recovery.",
            "As saying goes you don’t live to work, you work to live.",
            "Nature of impermanence",
            "🎯",
            "Damn I'm so sorry. At that point I don't think for him it's worth continuing. That quality of life would be too poor. I don't think a life of basically a brain but no body is worth it.",
            "That's why I'm going hunting this weekend. Gotta enjoy time off when u can",
            "[deleted]",
            "What is the “CS Industry”?",
            "dat sux",
            "I’m sorry to hear about this.. It’s truly heartbreaking when things happen to people we care about the most :( hope you’re taking this in strides",
            "The only thing that makes life worth living is being successful",
            "You could be a rich vegetable instead of a poor vegetable if you leetcoded hard",
            "."
        ]
    },
    {
        "post_id": "yda2px",
        "author": "lowhearted",
        "title": "i took an hft phone interview on the toilet",
        "url": "https://www.reddit.com/r/csMajors/comments/yda2px/i_took_an_hft_phone_interview_on_the_toilet/",
        "score": 926,
        "num_comments": 49,
        "created_utc": 1666717775.0,
        "selftext": "i completely forgot about my interview and received the phone call mid shit i sat on the toilet for over an hour taking the interview and got rejection email an hour after",
        "permalink": "/r/csMajors/comments/yda2px/i_took_an_hft_phone_interview_on_the_toilet/",
        "comments": [
            ">So why do you want to work here?\n\nI \\*heavy breathing\\*, I uh \\*spatter noises\\* want to work here because uh \\*stressed groan\\* I enjoy solving complex problems \\*hgh\\*.",
            "Should have finished the Interview by flushing the toitlet to establish dominance.",
            "We all have shitty days",
            "a true shit post",
            "i like how it’s tagged as flex",
            "You were running a garbage collection process in the background.",
            "hft recruiter called me 5 mins early once right as I was starting to piss. had to pressurize and blast it all out quickly and mute the phone when flushing",
            "was the camera on?",
            "Lol they knew.",
            "I got my internship offer last summer while I was in a public restroom. Nothing compares to asking \"are you guys open for negotiation?\" when there is a guy on the other stall watching the Simpsons.",
            "They knew you weren’t a Charmin Ultra Strong worthy candidate",
            "Sorry about the rejection email.",
            "Lmfao",
            "This is honestly not the craziest/worst HFT interview story I have heard. I have a friend who shat his pants during the interview, because he didn't realize the call was going to be so long.",
            "high frequency turding",
            "The quality content I come to this sub for lol",
            "Optiver?",
            "Must have been a hella dry wipe after 1 hour it airing out",
            "Did they know that you were on the toilet lmfao?",
            "Shit posts only allowed on Sunday brother",
            "Shouldn’t have had the chipotle prior man",
            "Mood",
            "LMAO same thing happened to for but not for a HFT",
            "Bro what 💀💀😂😂😂😂",
            "Did you end by asking them what their bathroom/shitter policy is?",
            "A really shitty interview indeed.",
            "Wow amazing unique awesome",
            "Relatable",
            "In today’s episode of ‘How I Got My First Prolapse”…",
            "Sorry about not getting the job, but reading the comments made me laugh."
        ]
    },
    {
        "post_id": "194lllj",
        "author": "infrequentable10",
        "title": "17% layoffs from discord and a thousand from google",
        "url": "https://www.reddit.com/r/csMajors/comments/194lllj/17_layoffs_from_discord_and_a_thousand_from_google/",
        "score": 919,
        "num_comments": 276,
        "created_utc": 1705031749.0,
        "selftext": "Listen up – the job scene is brutal, especially in computer science. Thanks to clueless folks thinking a quick bootcamp equals a fat paycheck, there's a freaking crowd. If you're eyeing a CS major, better be damn sure 'cause reality might smack you hard. I tried shouting warnings on [cscareerquestions](https://www.reddit.com/r/cscareerquestions), but these idiots act like they know it all and then whine about job struggles. Go figure out.",
        "permalink": "/r/csMajors/comments/194lllj/17_layoffs_from_discord_and_a_thousand_from_google/",
        "comments": [
            "Just curious because I really don’t know, and I don’t hear this talked about. But is it possible that these employers recognize the glut in the market and management thinks to themselves, “hmm, we could layoff several hundred non-critical employees making $200k and refill 3/4 of those roles with people who have been unemployed for 3 months at $120k.” I don’t know real compensation so I’m just throwing out numbers, but I am curious about that.",
            "The doomerism in this sub is honestly starting to come across as gatekeeping to stifle competition",
            "So glad I left CS with all the layoffs and crazy competition",
            ">Thanks to clueless folks thinking a quick bootcamp equals a fat paycheck, there's a freaking crowd.\n\nLol, If you're damn sure about yourself then you shouldn't be worrying about those quick bootcamp folks since the employers don't care about them either, so they aren't the problem.",
            "College students think they know everything lol. Lots of college cs grads are just about as clueless as boot campers.",
            "[deleted]",
            "These layoffs really make me question entering corporate tech.  \n\nBecause I'll:  \n\n• Do leetcode \n\n• Prep for interviews \n\n• Send multiple applications \n\n&#x200B;\n\n Only to be:  \n\n• Underpaid \n\n• Overworked \n\n• Laid off at the slightest market convenience  \n\n&#x200B;\n\nAt that point, why bother?",
            "Yes, I heard they fired ALL of their SE's too. It is just absolutely brutal out there, please don't apply and strive to become a software engineer please, its just not worth it in this market.",
            "I guess most of us won’t be making those high six figures salary right out of college. I will Keep making side projects and collecting AWS certificates while grinding Leetcode so I think I am doing something different to stand out like a sheep in a herd. Or try learning Data Science and Machine Learning engineering without masters or PhD. Good luck y’all. Y’all can do this",
            "\\> Thanks to clueless folks thinking a quick bootcamp equals a fat paycheck \n\nAnd they were right. For some time it was working and now they are already IN.",
            "I'll be joining college this year, and want to pursue a CS major. However, considering the current situation, or should opt for some other major?\" I'm having second thoughts. Should I go ahead with CS, or should opt for some other major?",
            "SIzeable chunk aren't even developers. And companies are converting their interns to FTE in droves these days. Stop dooming.",
            "In 2022 I decided to go back to college to pursue my passion for computers and technology. And then this happens + AI. Fuck me, right?\n\nI'm not even trying to get a FAANG job nor do I expect 150k/yr right out of college.",
            "I have plenty of CS new grad friends who are landing internships and jobs left and right in the past two years, some FAANG and some non-FAANG. None of them are from top tier schools either. I have seen them working their butts off polishing their resumes, networking constantly, and practicing coding interviews. \n\nFrom what I have seen, the ones from the same schools that aren't getting gigs are missing one of those three. For example, a friend (CS grad) of a close friend of mine reached out about working at my startup (good networking), but his resume was just horrendous - a whole page of text that didn't tell me anything about his capabilities, limits, or achievements. I interviewed him anyway as a courtesy and had to ask a bunch of questions to extract that out of him - oh you put a huge list of skills with crazy number of JS frameworks, but you really only have experience with designing and coding front-end stuff, etc. I would suggest [https://www.reddit.com/r/EngineeringResumes](https://www.reddit.com/r/EngineeringResumes/) as a first stop on this, their wiki is really helpful in structuring your resume and writing down USEFUL information.\n\nAnother thing I have seen are people who just keep sending resumes into the void that is the ATS. I made this mistake throughout my career as well. When I was starting out, I was seeing my friends getting internships at FAANG but I couldn't get anything, so I asked one of them how they got it. They told me that they actually looked up recruiters recruiting for those companies on LinkedIn, and send a connect request with message. They did this a bunch of times over the span of a few months to get SOME recruiters' attention. I don't suggest you log into LinkedIn right now and just spam recruiters though, that won't get you far. As a starting point, many recruiters for FAANG and other large companies make posts about jobs regularly on LinkedIn, some even compile a list of different companies as well, you can start following them and slowly build the relationship and go from there. Recruiters are your friend.\n\nLastly, stop blaming the bootcamp folks, you're not going to get very far in life with that mentality. I have worked with quite a few very passionate people trained by bootcamps who are very good problem solvers and did quite well, it was just that they were just from very disadvantaged backgrounds. The get-rich-quick-scheming folks aren't limited to those coming out of bootcamps, and I think the bootcampers actually have a bigger uphill battle in this arena as well since through traditional schooling, you get a lot more opportunities with internships and research opportunities and whatnot, which makes it much easier to prove yourself.",
            "bootcamp isn't causing the problem, H1B is. 700 new jobs, 85k H1B.",
            "1000% layoffs from Google?!?!?!",
            "Let form our own tech firm. We can do better than those big companies if we can all work together with all of our skills and knowledge gained from those big companies. Who’s down? Inbox me I have a finance and accounting background. I can help with the numbers and business things.",
            "just a child throwing a tantrum, nothing to see here",
            "I will forever regret the day I decided to study cs and not mechatronic engineering",
            "How much of it is VC cash pulling out due to higher interest rates?",
            "So I just recently switched careers. Worked in IT as a network engineer for 15+ years, no degree. I landed a job as a software engineer at a company for less salary but way better benefits, like benefits that mean I’m actually making more in the long run. Anyways they are paying for me to get a degree in CS now, going to focus on AI. So it’s not all doom and gloom.",
            "What is a reasonable major to do then??",
            "It’s just the labor market correcting itself. CS had high demand and low supply. Now it’s mostly evened out so salaries go down and openings are less. Welcome to what happened to IB in the mid 2010s",
            ">Thanks to clueless folks thinking a quick bootcamp equals a fat paycheck, there's a freaking crowd\n\nSo you can't get a job because \"clueless folks\" are taking them from you? Wow, most people wouldn't admit that.",
            "I do hiring at a startup and at this point we just want someone with experience and don't have time to train a junior or teach them stuff. So anyone we need to hire needs to have 5-7 years of exp.\n\nWith so many mid level people available why would anyone hire a new grad. It's just a waste of time.",
            "This is an excellent shitpost",
            "I think this is more due to companies migrating their SWE teams to remote cheaper countries. COVID pandemic might have shown that it is possible to have remote-first teams in development and that SWEs from those countries are good and willing to work for a tenth of the price. It takes some time to create the infrastructure and train the teams to be able to work in a multicultural remote-first context but once they are able to do that then can replace a bunch of teams. \n\nReplacing them all at the same time could be problematic, so doing it in batches is safer",
            "Demand is lower than offer. Computer Science is DEAD.\n\nIf you want to make money you should consider another path.",
            "Im so glad Im in tech and don’t hold a degree, this way somehow I don’t have as many problems as you guys.\n\nThe market is tough but which one isn’t.",
            "There will always be jobs for competent developers. If you are passionate about cs, you will not be unemployed. If you put in the work, you will not be unemployed. If you are unemployed, then you are simply not good enough. Unemployment in the tech industry is extremely low, and as crazy as you might think this statement is, Reddit does not reflect the real world!!!",
            "It might be because all of your posts on r/cscareerquestions are bs bait posts.",
            "Uh I hardly doubt a bootcamper can make it straight to a faang. I mean if they do they still need to crack their interviews. \n\n\nA lot of the layoffs I saw were people from a stem background so blaming to bootcampers is just a meaningless",
            "Don't let the layoffs affect your thinking about future job prospects. Worry about what is in your control. Continue to work on projects, prepare for interviews, and grind LeetCode.",
            "**I hear there are several industries in CS that are safe? Like IT and software engineering.**",
            "As a sophomore in high school eyeing top colleges, I'm interested in hearing why I shouldn't go into CS? Is this job market just temporary? I'm assuming it will be better by the time I graduate in 2030?\n\nI'm interested in a lot things including politics, CS (duhhh), business, etc.\n\nBut Big Law making 250k but 60-80 hours a week for greedy corporations?\n\nSelling my life to wall street?\n\nOr 200k+ at google SWE for 40hrs/week... (also probably the most ethical out of the others + least nepotism, and since i'm starting this early, couldn't I get ahead of the competition? I'm starting many community projects that I enjoy)\n\nAs someone who has zero connection in CS and is confused, help me out!\n\nEdit: Downvotes, as expected. Can someone actually give some advice? 😭",
            "I just got a job and I was pick out of 600 applicants- so sad",
            "Then give a solution to this problem like \"How to get a Job in IT ??\"",
            "It has nothing to do with people going after bootcaps. The worker has nothing to do with it. It's the FED rasing interest rates along with companies trying to maximize profits in that environment, also it has to do with companies realizing they can save even more money by cutting wages.",
            "I posted the news there without any comments or personal opinions, no text just the link of the article and a bunch of people reported my post for no reasons except they weren’t happy of me sharing the news lol.\n\nI feel like CS is now becoming like any other job market where it’s hard to get in and easier but far from being as easy as before to navigate once you have more experience.\n\nIf you’re in Europe like me I don’t see how studying cs is a good idea. Salaries are meh especially compared to the life long learning requirements",
            "This is very unrelated but I feel like I’ve already seen this post before, like maybe a week ago. Exact same comments and everything 😭",
            "You think bootcampers are your problem? So you’re saying as a cs grad you can’t get a job because a boot camper got it? \n\nSeems like a skill issue to me buddy. \n\nFYI, it’s not bootcampers causing the current climate. Blame everyone but yourself eh",
            "Discord has been a shit hole since 2023 so I couldn’t be surprised by the layoffs. There are employees there that don’t even like the working environment. I made a post about the [state of Discord](https://www.reddit.com/r/discordapp/s/lAIbYDeCSu) several months ago in the Discord subreddit. \n\nI want to add that about 6-7 years ago, Discord posted a video on YouTube showing how it was like to work at the company. Everyone seemed happy and it genuinely seemed like a company people would enjoy working at. \n\nNow? Now people speak of Discord like it’s the worst thing ever. It’s gotten bigger and therefore more attention. All the shareholders and stuff want so-called “improvements” to Discord. These “improvements” have received a ton of backlash from the community. The most recent update is the UI update on Discord. No one likes it. \n\nScrew Discord.",
            "Google laid off 0.5% of employees, and discord about a hundred or so more. Hardly the end of the world.",
            "Stop being so picky with your job search and you will find jobs…",
            ">  I tried shouting warnings on [cscareerquestions](https://www.reddit.com/r/cscareerquestions), but these idiots act like they know it all and then whine about job struggles. \n\nlmfao maaaaybe because you're talking to people with a lot more experience than you who can validate that you are wrong?",
            "Sooo considering I’m going to start cs at college next month, and based on the comments here, I SHOULDNT be feared to switch majors and grind it through?",
            "Damnnn AI is winning",
            "this happens every tech bubble. we'll have a glut of CS majors over the next 2 years, then it will fall back to normal levels.",
            "i applied to their internship and got an email saying \"  I’m so sorry for the inconvenience, but effective today, we will be pausing the internship search for summer 2024 indefinitely.   You may have heard the news about Discord’s announced reduction in force. \" -\\_-",
            "job scene is absolutely brutal for entry level. Let me tell you why. and for reference, I run [mobiusengine.ai](https://mobiusengine.ai) and we helped over 400 people find jobs last year so I am speaking with experience. \n\na.) companies don't want entry level (or super experienced) people in downcycles. They dont have money or patience to train\n\nb.) Many companies are waiting it out to see how the gen ai pans out. They will redo job ladders and JD's based on that. \n\nc.) There hve been over 400K layoffs in last 1 year and many of these 400K are competing with you.",
            "Total noob here thinking of pursuing a CISM certification...am I foolish?",
            "They fired the ppl that hired during pandemic\nCs field is awesome and has HIGH demand just not in fang companies for the next year",
            "The biggest issue currently is that there's a massive retraction in the job market. Junior roles have been reduced, and mid-level roles are incredibly competitive. Yet, the staff / principal roles remain unfilled in many cases. I'll be honest, the last few years have made mediocrity acceptable due to over-hiring, and now companies are seeing the lack of value being delivered along with pressure from their boards to hit certain revenue margins.",
            "If a wave of bootcampers are what has disrupted our market, then we were just living a bubble. If the value is a CS degree, to employers, is no different than a few months of cramming, then maybe we wasted money on our degrees...but in any case, I'm not blaming people who tried to educate themselves and get jobs that offered them better pay.",
            "This market is only just starting to get bad, i'm a recruiter and i've been seeing the signs for a while. All the people we place have been. waiting for months. Luckily we've worked hard and been able to place them. All this is only now starting to show on the news. \n\nI know some of y'all have been getting recently laid off, If your still looking for work or thinking about getting back into it, i'd love to help. I can at least help you get past the hundreds of other resumes. \n\nHere's our Calendly: \n\n[https://calendly.com/learnmutiny/showcase](https://calendly.com/learnmutiny/showcase)"
        ]
    },
    {
        "post_id": "1bloj58",
        "author": "Consistent_Slip5308",
        "title": "Got FAANG offer with 2.5 GPA",
        "url": "https://www.reddit.com/r/csMajors/comments/1bloj58/got_faang_offer_with_25_gpa/",
        "score": 918,
        "num_comments": 152,
        "created_utc": 1711187598.0,
        "selftext": "Love computer science but I've always been generally been bad at school mainly because I have terrible time management skills. Grinded projects outside of class, did some interesting ML-related research, left my GPA off my resume, and grinded Leetcode and finally got my first internship. Definitely did not think this would've been possible 6 months ago even though I read all the comments on posts saying that GPA doesn't matter as much for SWE. I'm honestly not really qualified to give resume/school advice but I would like to \"pay it forward\" in some way so if you have any broad questions about the process or anything hmu ig.",
        "permalink": "/r/csMajors/comments/1bloj58/got_faang_offer_with_25_gpa/",
        "comments": [
            "Congrats on Amazon ! 🎉🎉",
            "How long did it take you you get ready for interviews, did you pass an OA first and then passed to the interview stage?",
            "Congrats! BTW, what projects did you out on your resume?",
            "Same, my GPA is terrible and I'm doing a few years longer than expected to finish my degree. Got 2 FAANGS.",
            "> I would like to \"pay it forward\" in some way so if you have any broad questions\n\nWould you mind sharing your resume?",
            "Why do people make misleading posts like this “i got an offer from ____ with a low gpa”. Like dude they didnt even see your gpa nor do they care about it to make a difference. I could understand of its a place that actually cares like a defense or finance firm but why do people word it like this?",
            "Congratulations on the offer! Are you an international student? Also, how did you align your resume to the job posting.",
            "Just say Amazon bruh",
            "what type of project do you think got their attention ?",
            "How many job applications did you do before the offer?\n\nEdit: At least a few hundred. Yes, I answered my own question",
            "No one cares about gpa",
            "yo sameeee. 2.8 gpa --> big tech (not zon lol) internship paying 52 bucks an hour (my first internship ever + soph)\n\nYour gpa doesn't matter. Just your leetcode practice and resume. :)",
            "Who’s spreading the misinformation that GPA is super relevant anyway?",
            "Did you apply based on referrals? Also I wonder what research you are doing!",
            "lmao who gives a fk about GPA nowadays.",
            "Can we talk bro",
            "Ayooooo congratulations OP!!! I’m so happy for you :) \n\nHow did your technical interview go ? :) anywho I’m so happy for you :)",
            "same, my GPA < 2.5 and i got an internship this summer for a FAANG. Not trying to brag either but some people (like me) get stupid lucky when it comes to applying. Wishing everyone the best with their job search",
            "What kind of mL research\nCan you share the resume",
            "What caliber of projects did you have on your resume?",
            "GPA doesn’t entirely NOT matter, it matters when it does. Some companies care, some don’t. I got an offer from a FinTech company that didn’t even check after background investigation as well, but this other random startup I applied to did",
            "Gpa generally doesn’t matter, I doubt they even asked. Congrats tho",
            "How did you practice for behavioral interview?",
            "Can i please dm?",
            "Congratulation on your success op\nCan you tell us the project that you did and how many leetcode question and after how many questions \nyou felt yes you have grasped the problem solving part of grind",
            "I studied a month for an interview but I messed it up and got rejected even though it was my favourite topic. I just couldn’t solve in an interview setting and feel really bad about it. Any advice for me on how to bounce back?",
            "Was the research with a professor or institution?",
            "What projects did you do? How do you even get started on a project or decide what to do? I'm a Freshman who's just learnt OOP and going through DSS this sem but still wouldn't really feel confident programming outside the scope of an assignment where it's clear cut what I have to do",
            "How do you suggest to start doing side projects and does it come up during interviews?",
            "Meanwhile me with 4.0 GPA in a CS master’s and 5 YoE struggling for a year. :(",
            "Same here I'm horrible at test taking none of the jobs or internships I had asked me for a GPA. Although government agencies/contractors may care in the private sector such as faanmg they don't care",
            "Not too crazy. My buddy got a Google offer with a 2.8 but that was in 2021!",
            "I’m trying to find a fang cybersecurity job, any advice, yea it ain’t SWE, but it’s still CS related right?",
            "OMG dude I just came here to make a very similar post. Different company but still. Congrats!!!!",
            "Internship or actual job offer",
            "Congratulations 🎉🎉🎉. I'm search one too. Hopefully I can get one like you.",
            "Why tf m I unable to crack even mid tier companies after solving 700 problems. Wtf is wrong with me.",
            "Thanks for this, needed some motivation, please talk about project and the ML research",
            "Congrats! What ml-research did you do? Im in college and im looking to do ml projects. I would like to train a model and create a web ui for people to interact with.",
            "This is what I love about CS it’s never about your GPA or grades at school, I got to internships while being in community college with 2.8 GPA.",
            "I think you mean with no GPA.",
            "Yeah what I've realize is that they actually don't care about GPA once you've actually qualified for the job.",
            "Proof that the market is fine. You just need to actually apply and actually know your shit.\n\nThe whining terminally unemployed redditors do neither.",
            "I’m currently at a 2.95 in my last semester…how worth it would you say getting above a 3.0 is in the application process.  I could definitely get a 3.0 but it may set me back a semester.  What should I prioritize, early graduation or 3.0 gpa?",
            "[deleted]",
            "Did you have internship experience prior to this? How was your resume structured?",
            "[deleted]"
        ]
    },
    {
        "post_id": "rci3rl",
        "author": "lapurita",
        "title": "geeksforgeeks is ass",
        "url": "https://www.reddit.com/r/csMajors/comments/rci3rl/geeksforgeeks_is_ass/",
        "score": 911,
        "num_comments": 107,
        "created_utc": 1639057945.0,
        "selftext": "It's a shame that geeksforgeeks shows up as the top search result for like 90% of everything computer science related. The site is buggy and slow as hell, full of ads and the content is often subpar and sometimes straight up wrong",
        "permalink": "/r/csMajors/comments/rci3rl/geeksforgeeks_is_ass/",
        "comments": [
            "Some content requires you to login which is dumb",
            "What's happened to the site? It's gone really downhill. It used to be pretty good a couple of years ago.",
            "Use this within your google searches\n\n`-site:geeksforgeeks.org`\n\nThis will remove all results that fall under the geeks for geeks domain",
            "Well they use some really good SEO tactics to rank their page as the best result on Google Search. 70% of the time I read their info it is wrong and also I have to sign up to access the info which ngl is shit. #reportgeeksforgeeks",
            "Honestly GeeksForGeeks has a ton of good content and a lot of niche DSA content too",
            "Ikrr, but it’s kinda like the only site ik that has literally all DS/Algo topics that I’d ever want to prep for an interview. \n\nIs there any other site like this, but better? I’d like to know!",
            "Y’all don’t use ad blockers?",
            "And worst of all is  when they force you to log in... so annoying when you just wanted to look something up for a few seconds",
            "Wait, I like geeksforgeeks. They explain leetcode problems pretty well.",
            "Wtf geeksforgeeks is awesome",
            "Y’all salty that a free educational site uses ads to fund itself? That too after paying thousands of dollars for school and not grasping the concept enough that you had to google? Imma head out",
            "I see them too often, and I think only actually followed one of their guides successfully",
            "wait what’s an example of wrong info on there? i’ve only used it for basic DSA concepts and from the stuff i’ve seen it’s all correct",
            "Then don’t use it, duh.",
            "their code solutions suck ass too",
            "when googling, just put '-geeksforgeeks' and it won't show anything from them",
            "You don’t like to read a broken English explanation of a complex topic?",
            "What do you recommend instead?",
            "their website yours to be great until they started forcing you to login. i am never charged either, always logged out.",
            "I like their content but my laptop gets super laggy when I scroll thru it",
            "It was a godsend whenever I first started 2 years ago, but now it requires me to login just to see a tutorial? Yeah I'll go somewhere and blacklist it.",
            "That site turn on my macbook fan every time I visit. CPU to 100%",
            "They have a lot of good coding questions though",
            "Adblocker and the link someone posted about avoiding the annoying af prompt made them tolerable. Their content for DSAs and closure properties in CS theory was very helpful.",
            " I don’t even click on that garbage site, it is a hive of horrible code examples and bad practices.",
            "Can we report that website to bring it down? It’s horrible.",
            "I loved GfG during my DSA class. I think it gives a clear overview of ideas that helps clarify and contextualize other sources (including my teacher) who had me lost in the weeds.",
            "Finally someone said it",
            "I never look up something on G4G! The site is lithely trash! Ads everywhere! The user experience is the worst I had!",
            "I find that their code is often unnecessarily complicated. They write dozens of lines of code for an algorithm that could be written in a few lines, mainly because of their incessant use of OOP. I only look at their C++ code though, it may be better for other languages. \n\nAlso, their explanations are sometimes unclear.",
            "yes geeksforgeeks is trash.  I hate how convoluted everything is there.  Stack overflow is so much more efficient",
            "Exactly, I don’t understand why people recommend that site. It has horrible UI and subpar content. You’re better off just reading Leetcode discussion sections if you want solutions to problems or textbooks if you want to learn DSA. No offense but Indian CS content in general is just awful",
            "At least you get some free content. Use your brain on how to remove ads.",
            "I liked there site until they started putting ads and asking me to login",
            "Don't forget how half of the articles are broken English so hard to even understand, and most pages would be considered \"shallow\" in the content department",
            "articles are either wrong or outdated, despite being written within the last few months lol",
            "Based",
            "i have never seen or heard of this site",
            "Agreed the signing up to view content is so annoying",
            "It used to be good too :/",
            "Did anyone see their Python binary search template? It’s like 10 lines longer than it needs to be 💀💀",
            "[removed]",
            "That's why stackoverflow",
            "any idea  about any other solid site where i can go or follow ?",
            "I tried to do some of these algorithm challenges, their test cases S-U-C-K\n\nLike, they literally make no sense, stupidest test cases I ever seen, they aren't clear if they want you to print the answer in the console or return an array, and some questions I return the same answer, but it only takes it if I do it in Depth First Search instead of BFS for tree questions, what a trash site.",
            "Yep this is why knowing how to exclude site from search results is useful to know.\n\nSome of the crap I've seen on that site.",
            "Hit or miss but I've found it works great quite often tbh.",
            "I looked up what a websocket is, and geeksforgeeks showed up but full of grammar mistakes, run on sentences, etc. Just googled them and of course they are based in India. There should be a downvote button for sites like these to get them off the top search results.",
            "Use this [https://chrome.google.com/webstore/detail/gfg-to-leetcode/dkodhhfojohfonoidpcheichdjbicnfg](https://chrome.google.com/webstore/detail/gfg-to-leetcode/dkodhhfojohfonoidpcheichdjbicnfg)\n\nThis chrome extension embeds leetcode links in geeksforgeeks problems page.",
            "Thank you! Google should banish these guys to be forgotten. Only thing they do is take over the original documentation of whatever it is you are looking for. Without actually having access to the rest of the docs..",
            "This is true. Some of the contents are so confusing and the code as well are not very consistent. It is as if they have not think about what they post in there",
            "The site helped me with SQL and database management. I also used YouTube but found most of the content helpful... I guess I am in the minority.",
            ".",
            "I can't believe this is still a thing. Worst site ever. I don't understand why it's always at the top of searches when the information on their site is usually horrible.",
            "Exactly it has incorrect information on certain topics, I was studying dbms nd this site has the opposite definition of 3 tier architecture & 3 tier schema"
        ]
    },
    {
        "post_id": "166eh8i",
        "author": "lidrt",
        "title": "years of experience for an intern job..? This is rough",
        "url": "https://i.redd.it/6y7kn9rmtglb1.png",
        "score": 918,
        "num_comments": 41,
        "created_utc": 1693496216.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/166eh8i/years_of_experience_for_an_intern_job_this_is/",
        "comments": [
            "They’re asking a whole lot to work on a website that sells… *checks notes*… Pant Suits. Exactly how complex of an operation is it for a web app that sells pant suits?",
            "they probably copypasta'd from a new grad description and forgot to remove the 2 year requirement.",
            "Not all “experience” is industry experience. The experience they mentioned is basically you working on full stack for 2 years, be it projects/research/work experience/open source, etc",
            "Also \"this internship will include remote work\" makes me think it's a hybrid position they're advertising as remote",
            "If you're applying as a junior or senior then you already have your 2 years of experience, from college",
            "I don't even have that and I've done 4 internships....",
            "Whoever wrote this posting is barely literate",
            "I've been seeing a lot of these. \nEven interviewed at some companies that had full-time positions posted and not hearing back from them, and then seeing them posting the exact same position with similar job scope but with the word \"intern\" at the back of it a few months later. \n\nA previous employer also put up openings for an intern to take over my work when I left a full-time UIUX job a few years ago. \n\nThey want similar work done at a portion of the actual pay.  It's disgusting.",
            "The years on these are so weird. The role is from February to mid May 2022, Deadline in 2025, posted on September 2018. That’s why they need 2 years of experience clearly the company invented time travel.",
            "I just submitetd an \"assignment\" that required me to make an webapp with some APIs to implement and role based access to fetch data from database, have a [README.md](https://README.md) prepared to it for an internship role. I have one more similar assignment that I also need to deploy on AWS Elastic beanstalk to be submitted by the end of this week (Sunday 11:59:59 pm) also for an internship.",
            "I count school as experience so i just graduate so i have 4 lol dont do this 😭😂",
            "I think years of experience is different applying for intern and the actual job. Most company clearly state only professional experience for actual job. For interns, it probably doesn’t require that the experience is professional. I don’t think two year of full stack web experience is requesting a lot. If you don’t have that experience, how do you expect to ever get a job. You don’t learn coding from a book. You learn through experience.",
            "What is the website?",
            "this is mostly suitable for international students who come her for masters with some experience",
            "Anybody looking for its 5th intership would be a great fit! LOL",
            "You see, 'Intern' means Intern pAy",
            "this posting is so clearly fake bro what 😭😭",
            "lol get outta here",
            "🚩",
            "fuck it, say you have it and apply anyway"
        ]
    }
]