[
    {
        "post_id": "1977iwk",
        "author": "CelebratedBlueWhale",
        "title": "This... is a rejection letter?",
        "url": "https://i.redd.it/znan8hf4klcc1.png",
        "score": 877,
        "num_comments": 70,
        "created_utc": 1705321419.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1977iwk/this_is_a_rejection_letter/",
        "comments": [
            "They make it sound like you are the one who rejected them",
            "Wow, this is the most passive, indirect way to phrase a rejection I’ve ever seen. They really need to fix this; it’s a terrible way to communicate.",
            "received the same email from Intel a couple of weeks ago, yes it's a rejection",
            "It's so confusing. The worst non-rejection rejection I've ever seen.",
            "Looool, it effectively reads like \"aww it's too bad you don't want the job you applied for. Hope we have a position you want more soon!\"",
            "Yes it’s a rejection letter",
            "Just read the last line \nMakes it easy to decide",
            "I hate this. I much rather prefer the rejections I’ve been getting over the past few weeks - Unfortunately we will not be moving forward with your application at this time. That’s it.",
            "They really tried gaslighting you to to make it seem like you rejected them 😂",
            "Better not to join Intel. I worked there, bunch of old power hungry folks who work less and talk more. Shit loads of office politics, many deprioritized projects and basically you’ll learn absolutely nothing. Hard to get a promotion there too.",
            "As someone working there, you dodged a bullet.",
            "Intel should fire the incompetent person who came up with this rejection email to free up cap space for people who are good at their job.",
            "You should call them and be like “My interest are definitely aligned, I’m sorry it came off that way. When can we schedule a meeting?”",
            "Imagine what it must be like working there.",
            "It's gaslighting, they said you're the one not interested.",
            "They’re gaslighting you",
            "It’s because they read the “name and shame” threads here and took those too seriously",
            "Avoidant attachment intel",
            "I think HR is definitely a kind of girl who says .. l like you but as a friend",
            "When she says: “it's me, not you. But I think we should remain friends.”",
            "It is a Rejection letter.\nGot the same thing even after applying for different roles.",
            "intel doesn't want to appear in those TikTok videos were people show 25+ rejections before getting an offer. Makes em look bad\n\n\\s",
            "I have a friend who got that and a week later they contacted him for a different position. They said the fit in the first one wasn't right but were impressed with him so they offered him a position that opened up in something more aligned with his interests. They do keep the CV/resume. (This was also Intel)",
            "Gaslighting at its finest",
            "Damn that was so passive that you can almost feel the cock stroke",
            "Lol is this MasterCard? They've done this shit to me before too",
            "Thought you’ll get at intel so easy?!! Haha lol gg bb",
            "That is word for word what I received from Intel when I rejected an offer from them a couple years ago. Maybe double check with them to make sure they know you’re still interested?",
            "Unfortunately yes",
            "Is this an internship? I don't understand. What is a position of \"Student\"? I've never heard of a company referring to internships as \"students\".",
            "It is indeed. Congrats!",
            "Almost 90% of responses which I get is the same",
            "Yes a rejection letter",
            "Yes and it is your fault!",
            "They’re leading you on💀",
            "Yup the last sentence shouts rejection my friend",
            "The Intel ads was right below the post for me lol",
            "Obviously",
            "This seems like a gaslit rejection 😂",
            "I think it's a poorly written rejection letter.   \nChat GPT would have written it better.",
            "Same when I applied there",
            "Basically theres 3 options that most HR systems provide - not just accept and reject. Theres also “we like this person but theres someone better for this role”. For a small org this works as theres a smaller hiring pool and people could remember you. But for such a big company its unlikely you ever get reviewed unless you apply for the job",
            "I always hate this kind of email from companies, I prefer a refusal that's clear anytime of the day rather than an answer where they try to get away through without any clarity.   It also is kinda of insulting because it implies at you not having the skills to fulfill a certain role, but they are not being direct about it, while it could simply be that you have the skills but they have the role already filled.",
            "Lmao I got this too",
            "A rejection letter is better than no reply at all. like a lot of nepali companies do, they don't fucking reply with anything except than the first mail saying We got your application after that there's no thing",
            "I would say its almost incorrect english semantically. \"We understand that...\" is a recognition of someone else's opinion or belief. They would at least have to say \"we have come to the understanding that... \" but still a bit awkard.",
            "\"We are happy you applied and sorry that you rejected the job that we never offered you.\"\n\n\nHR speak for, CBA."
        ]
    },
    {
        "post_id": "150h551",
        "author": "Neither-String4482",
        "title": "Is it normal to have my life run by code?",
        "url": "https://www.reddit.com/r/csMajors/comments/150h551/is_it_normal_to_have_my_life_run_by_code/",
        "score": 878,
        "num_comments": 233,
        "created_utc": 1689440523.0,
        "selftext": "Not a shit post. Genuinely wondering. I am not sure if it’s because I leetcode too much or code too much, but I’ve been noticing extremely weird things happen in my life. I feel like I live in the **metaverse**.\n\nStoplights are just if elif else statements to drivers, a pile of clothes is just a stack, a line at the coffee shop is just a queue. A shoe store is just a matrix 2D array of its products. A map of places is just a graph. An itinerary or plan is just a linked list  \n\nIs this normal? I feel like my life has been dominated by code. Is it normal to see everything and anything I do in code? Sometimes when I do something like search my bag I imagine myself as a recursive program and my base case is when I find it :) \n\nSometimes I think I am in a metaverse and everything around me I just pixels and bytes stored in memory",
        "permalink": "/r/csMajors/comments/150h551/is_it_normal_to_have_my_life_run_by_code/",
        "comments": [
            "Bro is evolving",
            "Those concepts are representations of how we think the world works. They were derived from observations of the world, not the other way around. That's why they seem similar.\n\nI suggest you get out there and \"touch grass\" before it's too late.",
            "is there a r/csmajorscirclejerk",
            "Sanest CS Major",
            "Sex is just a while loop of thrusting that ends after ejaculation 💯",
            "You taking the red pill or the blue pill",
            "when i say cs majors are insane this is what i am talking about",
            "Y’all need to go outside and touch grass.",
            "Yes it’s normal, you’ve become a sigma",
            "[deleted]",
            "Same bro it’s crazy. I’m starting think of stuff like emotions as markov state spaces as well. It’s pretty crazy",
            "You need to start seeing some pussy",
            "Your brain is just a series of interconnected neural networks",
            "Me after taking Discrete Structures",
            "How do you think we got the traveling salesman problem? Life is NP-Hard bro",
            "Mfs after taking one CS class 💀",
            "I'm a civil engineering major (hard lurker no lie) and istg i see fucking EVERYTHING as a vector",
            "It's pretty normal to associate stuff you see in everyday life with work and hobbies, but seeing everything around you as bytes sounds like you're confusing computing concepts with their original mathematical origins, which were meant to abstract and describe reality.\n\nMatrices, queues, boolean algebra, set theory, etc. are a means to observe and make predictions about the real universe. A computer can make those calculations and store the results as data, just as a person can do what computers do on paper using mathematical theory. Every program you write is in some sense a simulation.",
            "Stop it. Get some help.",
            "[deleted]",
            "My gf lost her toe ring in the swimming pool, so I basically broke it up into riemann sums then basically traversed each one area by area walking in a straight line until I found it.\n\n&#x200B;\n\nIt's good practice, you should do it keep it up. You remember and have a deeper connection with things if you apply them to daily life, for piano I make sure I brush my teeth rapidly with both hands, and use a very loose wrist, and there is a lot of other things I do away from piano/coding that I apply to my real life.\n\n&#x200B;\n\nMaking all of your thoughts measured and effective is a good habit IMO.",
            "Top tier shit pot bruh",
            "“When you are a hammer 🔨, everything starts to look like a nail”",
            "Respectfully, you need to go outside",
            "What is odd - and sad - is that there are people who don't see this way.  Where you see structure, which can be understood and sometimes controlled, they see unpredictable disorder and chaos.",
            "Hurry guys flip the killswitch!! OP has become self aware!! Terminate program!!!\n\nSide note for all you 2000s metalheads. Love that my phone's go-to autocorrect was to capitalize Killswitch 😁😁😁",
            "What you're talking about is logic and data structures, and that's everywhere for sure. Just a matter of how you label it. \n\nWhen you first learn a concept it's normal to see it everywhere. A liberal arts version of this is when you learn about social constructionism, suddenly everything is a social construct and nothing is \"real\".\n\nIt goes away after a while as your brain calms down.",
            "Bro touch grass and go camping. Get bit by something poisonous if youre really desperate to snap out of it",
            "Honestly, yeah I remember a brief period of time where I started mapping code concepts to real world stuff, pretty much how you described. \n\nIt’s a good thing! It means the code concepts are sticking and you’ll feel everything “click”. \n\nIt also means it’s about time to cut back a bit and take some time to resting yourself before you burnout.\n\nGood luck!",
            "please, use dijkstra’s algorithm to find the shortest path to the shower",
            "Naw stoplights are def switch statements not if/else",
            "Haha I had this with chess when I was playing a ton",
            "I'll have what she's having",
            "I can completely relate. I stopped playing serious chess growing up, because after a two or three day tournament, for a couple days, I would be thinking: “I’ll say this, and then they’ll say this, and then I’ll say this, …” etc. it was like a (burned in) mental, after image. Really sucked.\n\nI’ve had a little bit of the same thing off and on with code, but never quite as bad.",
            "Describe to us a woman",
            "He knows too much",
            "Ok I know you said it’s not a shitpost but lmao",
            "Why wouldn’t it be normal? If your life is dominated by something, you’re bound to see it in other things. If you really want to start bending your mind read up on simulation hypothesis.",
            "Lol you’ve made my day lol",
            "Taking a break to set your mind on other things can help.\nBrains like patterns and will see more X if you are focused on X a lot of the time.\n\nFunnily enough this is when I know to take it down a notch playing games. I'll see three flowers together on the ground and think to myself \"oh I'll just merge those quick\" or I'll be walking my friend's dog and \"oh better destroy that bush so the bush b'st'rd$ don't get an easy kill\".\n\nLike take a moment, notice you did it, laugh and then find some hobbies that take you out of the code zone. Or actively spend time thinking or reading up on or drawing things that are separated from your coding skills and processes.",
            "you ARE a simulation in a video game               \n\nhttps://www.youtube.com/watch?v=J9BFGlCPS8I\n\nhttps://www.youtube.com/watch?v=QlTHyIswDeA\n\n\n\nhttps://www.youtube.com/watch?v=qANA2rI9ueg",
            "This is how I’m starting to feel.",
            "This is so much “I am 14 and this is deep”.",
            "Tbh this post gives off “I just took my first CS class, look how smart I am” vibes.",
            "I wish i was this good at LC i can think like this",
            "It is normal, but only for individuals with an extremely high IQ, which you definitely are.\n\n/s",
            "😂\n\nEdit: Underrated post",
            "You don't need to spend every moment living and breathing code, you just have to like doing it. I don't code my every waking hour, and there are days  I don't code when I'm not at work.  Heck there are some days I don't even code while at work due to the nature of what I do. It is one of my favorite things to do so I do do it a lot. I just don't feel the need to always be coding.",
            "Lol you realize software runs literally everything.\n\nAnd people have no idea, very few can code well, and all they talk about is ‘man coders get paid too much’.\n\nFun times we live in",
            "These comments are cracking me up 😂",
            "You should watch the movie Pi directed by Darren Aronosfsky. I feel you would relate to it strongly",
            "There is no normal and there is no such thing as mental illness as we think of it",
            "Holy hell google real life",
            "nice shit post",
            "https://en.m.wikipedia.org/wiki/Tetris_effect\n\nDo anything enough and this happens",
            "If you obsess over a number, for example, you'll start to see that number everywhere. In your case it seems you are obsessed with putting a template on top of life, in this case a template made of code related things. You just have to realize you're doing it and put away the template if it's not serving you.",
            "It can happen if you spend most of your time coding. Take up a hobby that forces you to see the world differently. I started doing photography a while ago, and even though it technically involves digital image processing, it’s very different from the computer vision I do for my job.",
            "maybe because code is implemented to follow real life and common sense",
            "You need some sleep",
            "Yes, but it wears off after a short while, and you get used to it.",
            "I know the feeling I've dreamt of fucking matrices and math equations for a whole week up to my exams. I would suggest you take a break, Do some activity in your free time or a hobby in case you're overworking yourself.",
            "Lol I do the same id be like how would I could this and write it up in my head",
            "This happens with all people who get rly into one particular thing. People who play Tetris too much say they see it when they close their eyes, or in their dreams. Artists look at the world as value, color, shape, texture, composition, etc. You see your work in the world. It’s pretty common.",
            "It do be like that.",
            "No that's normal. It sounds like your experiencing delusions, that are somewhat bounded in reality, anti-psychotics could help.",
            "Once you get into a thing deeply, you will see everything in the metaphor of that thing. Code is better situated for that, but Shakespeare said \" All the world’s a stage, And all the men and women merely players; They have their exits and their entrances; And one man in his time plays many parts, \"\n\nI would say thinking the way you are will make you good at this. But make sure not to believe that it's anything other than domain transfer based pattern matching.",
            "I am with you man! As a matter of fact, I recently sign up in Reddit for testing purposes (exogenous interaction). I was loosing my mind surrounded by machines, code, algorithms, programming books, AI, you name it.",
            "How do you see a mental hospital? A patch? I recommend getting some totally non-electronic hobbies before the mental hospital. I did get 20yrs ago.",
            "you are becoming one with the code. This is probably how John Carmack feels lol",
            "Ok which feature of your repressed trauma are you projecting onto the code?",
            "You, who are on the road..🎵🎵",
            "We after discovering console log hello world.",
            "Very good, you're halfway to meeting the list of requirements for our unpaid internship",
            "Why do I find this so interesting? 🤣. Am I normal now?",
            "Dude, chill.",
            "Im glad to hear someone else feels like they are living in program, or maybe you are someone’s sim character, anyway you are not alone.",
            "I mean this in the nicest way possible.\n\nTouch grass",
            "In England, a line at the coffee shop *is* a queue",
            "There is a reason is math is the way it is, we inventes these mathematical objects such as matrices and vectors because they help describing the world around us. I actually find It fascinating how much of our life can be represented by simple math",
            "O M G   B R O    😵😵😵🤯🤯🤯🤯😱😱😱🥴",
            "Touch grass",
            "This is *exactly* how my mind works now, and I absolutely love it. Computer science is, in so many ways, an accurate reflection of life and how society works. And I think it's glorious.",
            "6 YOE here. You’ll get over it… or you won’t 😗",
            "That’s how I’m starting to see it too. Everything I see makes me think of the code in the backend for it. And I would argue that it’s actually a good thing. More things to make you like code and programming, and it would hopefully make you get a better job 🤷‍♂️.",
            "you have been cursed with knowledge",
            "But actually think about it, the world is not much different from the metaverse: our world made of somewhat infinitely small building blocks(hence analog) and metaverse is made of not-so-infinitely-small units of data(building blocks), hence the term “digital”",
            "You need friends outside of CS.",
            "That means you're thinking about it too much imo. Maybe you have been over studying recently?  That happens to me when I over do something mentally\n\nGet some other hobbies.",
            "It's normal in like middle school.\n\nidk why you guys never get past CS101 with your examples though. I guess people with this kind of imagination die inside when they get to red blacks or whatever finally kills their hopes and dreams. They get through with a D average, then come back to Reddit to say they learned nothing in university because they couldn't imagine an abstract factory or the proof for the halting problem in a shoe store.",
            "bro issa while loop",
            "So while on the subject… anyone want to hire a CS student  😁",
            "Just wait until you hear about OOP...",
            "Are you familiar with Mage the Ascension, you sound like a Virtual Adept, my favorite kind of mage as you can see from my profile name.",
            "Is this gonna be a new copy pasta",
            "It's like when Neo begins to see the code behind the matrix",
            "1. The brain is a biological computer so yes your life is run by instructions executing on that platform  \n2.  This post is cringe and borderline a circlejerk  \n3.  Touch some grass please",
            "Please seek therapy",
            "neo is that you? the oracle warned us about you, you can see the matrix cant you",
            "Sounds like the Tetris Effect! I’ve been there, take a break from the coding to snap out of it, your mind will thank you.",
            "I like how not a single line of the OP is followed by a real-world software use-case. As if to suggest his curriculum is abstract bullshit.",
            "Less weed bro",
            "\"Touch grass\"\n\n\nOP: https://docs.aws.amazon.com/greengrass/v2/developerguide/what-is-iot-greengrass.html",
            "Ah my reminder that it is indeed shitpost sunday",
            "Go outside",
            "Yes but I just don’t think about it that strongly. I do nearly everything in my life in a systematic way and computer science basically studies doing things in a systematic way\n\nMost of the things you mention are named after the real life version. A stack of clothes is a stack. A queue at a coffee shop is a queue. A store often contains an array of items which is an array. A map maps places to locations (or locations to places)",
            "\"He is the one\"",
            "Glad you asked. I was asking this myself 3 years ago and here I am as a SWE intern . So far so good",
            "Bro wasn't gonna let a AI take away his job, that he himself became the AI",
            "This is the part where I tell you that black holes get bigger by absorbing information onto their event horizion and physically growing the surface area.\n\nWe already have a term for converting a 3D imagine onto an enscribed flat 2D surface - a hologram\n\nAnd since black holes are constrained by the same laws of physics as everything else in the universe; it's possible that everything is already inside a blackhole and if they really do function in this way;\n\nIt would mean reality is a hologram.",
            "Did you know that trees are named after a computer science data structure?",
            "> a line at the coffee shop is just a queue. \n\nYou’re becoming British!",
            "I'm glad I'm not the only one.. everything I see makes me wonder what is the code that got this working",
            "Soooomeone's object-oriented :D",
            "Go post this on hackernews /s",
            "My roommate is a CS major and this is why I don’t talk to them",
            "What you feel is known as the Tetris effect, where your brain applies patterns from an activity, in this case coding, to interpret the world around you. It's normal among people deeply engaged in a specific activity. I would recommend however to go outside more...",
            "voracious different erect rob plants shaggy point offbeat wrench consist\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "‘No mom it's not a \"messy pile of clothes on my chair\" it's an L1 cache for fast random access to my frequently used clothes in O(1) time.’",
            "There's this film called The Matrix. You should watch it",
            "You get used to it. I don't even see the code. All I see is blonde, brunette, red-head.",
            "reminds me of a phase during my electrical engineering degree when I was seeing sine waves everywhere",
            "to the tune of original star trek theme: Touch graaaaass, touch gra-ass, touch grass, oh touch graaaaaass, touch grass, touch graaaaaass",
            "this is definetly stright out of 4chan.",
            "Entire universe is huge automation. Only thing that stops us from controlling it is not knowing all the associated variables and consequently ways to manipulate all of them.",
            ">a pile of clothes is just a stack\n\nthis is a heap, know your data structures",
            "Sounds like coding is the only thing your brain knows how to do anymore",
            "Shrek is Love\nShrek is Life😭",
            "Here try this article out, it will explain your mental breakdown:\n\n&#x200B;\n\n[https://www.stilldrinking.org/programming-sucks](https://www.stilldrinking.org/programming-sucks)",
            "This will be perfect when you become a full time swe:)",
            "This is the sign that you are evolving",
            "Go touch some grass and don’t over think shit. You’ll end up in a matrix situation",
            "I think conceptualizing life in a similar way (as in, Pretending you’re a Sim from the game The Sims) has been recommended as a “productivity hack”… so it’s probably not “normal” but might be quite useful!\n\nDoes this mentality bother you? Do you feel like you’re disassociating from life? There are some things (like relationships for example) that might actually suffer from this sort of strictly logical mindset, so that’s a potential downside.",
            "This has nothing to do with \"code\" what you are talking about are symbolic mathematical concepts (broadly) that people created over time, this happens to mathematicians all the time, instead of a building they see an elongated cube, instead of a tire/doughnut they  think of a Torus, etc.",
            "OP I think this is normal for anything one does a lot of. I had an INTENSE chess phase and started dreaming in chess moves which is... wildly more difficult to explain. It just sounds like you're recognising and applying patterns",
            "When I'm just about to fall asleep in periods of relationship problems, I  have recurring thoughts like \"what if I just format the hard-drive and re-install the OS?\"",
            "Yes bro, when i was on the leetcode grind. U need to go touch some grass lol",
            "Bro is reaching enlightenment",
            "Please go touch grass",
            "Bro I thought this was only for me - we’re all living the same life",
            "Bro knows too much",
            "Free will does not exist, from birth we are fed inputs in the form of external stimuli and can produce outputs after processing them. We do not choose the starting configuration of our brain nor the stimuli we are exposed to as we cannot control where we are born.",
            "Take a bout 5 grams of dried psilocybe cubensis and get back to us after the experience.",
            "I FEEL THE SAME LOL\n\n&#x200B;\n\nGlad I'm not alone",
            "As a CS major with a math and physics minor, I can confidently say that I need help. I was hoping to use recursion to go back to my original state.",
            "On a road trip rn and all I can think about is Dijkstra",
            "Freshman CS majors after they write hello world in Java",
            "I don't think all this crap is important (as normalized as it is made in society). If something is taking over your mind, maybe get your ambitions down. Maybe your brain isn't as mature to accept these things and not disbalance your life. Just do things as much as you can balancing your mental health. No need to fall in the trap of FOMO. Majority middle class of India is earning 3 LPA. It isn't a bad salary. Don't run behind salary. Everything comes to you with time. Career is a lifelong game, not a 5 year sprint.",
            "Imagine what it’s like for us physicists.",
            "idk bro but I think we should start calling booleans coolbeans",
            "The question is in which programming language are you thinking about it in",
            "."
        ]
    },
    {
        "post_id": "129mloc",
        "author": "memmo111",
        "title": "Thougts about the next cs major being hosted in Denmark?",
        "url": "https://www.reddit.com/r/csMajors/comments/129mloc/thougts_about_the_next_cs_major_being_hosted_in/",
        "score": 878,
        "num_comments": 24,
        "created_utc": 1680445091.0,
        "selftext": "Personally i think they should have done it in Katowice since the first csgo major was there and Katowice is just associated with cs at this point. Would be intressting to see who the crowd would cheer for heroic or astralis, thats if astralis even makes it to the major lul",
        "permalink": "/r/csMajors/comments/129mloc/thougts_about_the_next_cs_major_being_hosted_in/",
        "comments": [
            "Now this is the content I come to r/csMajors to see!",
            "10/10 shitpost sunday",
            "what kind of internship is it? What is the TC? Is it an HFT?",
            "Katowice is iconic for CS. I honestly have no idea why they are going with Denmark. \n\nLETS GO VEEEEEPEEEEE ^^:(",
            "It's not though. The next CS major (last CSGO major) will be in Paris, France hosted by BLAST.",
            "April fools was yesterday?",
            "Took me a while to figure out this post lol",
            "You're not in the wrong subreddit.",
            "cant wait for CS majors 2 this summer.",
            "Can you please describe your interview process and shed some light upon us newbies? Also please dm me your resume if you don’t mind.",
            "LMFAOOOO",
            "You're about a day late, buddy.",
            "r/lostredditors",
            "the first CS2 Major next year hosted in Denmark would be a BLAST!",
            "I don't see humour in this (I don't play CSGO).",
            "Are you talking about the game💀",
            "First off wrong subreddit and second off the next major is in Paris hosted by blast its gonna be really good. They already canceled the 2nd major planned for this year due to csgo2",
            "Lmao I got so confused for a second",
            "i was so confused for a second",
            "I saw this post on my frontpage for the whole day yesterday and ignored it thinking I was on /r/GlobalOffensive . LMAO",
            "."
        ]
    },
    {
        "post_id": "18xv9t7",
        "author": "gtighe",
        "title": "This is how all companies should treat their rejected applicants",
        "url": "https://i.redd.it/bmc9wquwqaac1.jpeg",
        "score": 876,
        "num_comments": 63,
        "created_utc": 1704318832.0,
        "selftext": "I interviewed with this company months ago and was rejected after what I thought was a great interview. I wasn’t going to accept an offer if I got one, but I wanted interview practice.\n\nToday I get an unexpected package where they send a little bluetooth speaker and a puzzle. Pretty cool of them to do that. Most places just ghost you after you have applied.",
        "permalink": "/r/csMajors/comments/18xv9t7/this_is_how_all_companies_should_treat_their/",
        "comments": [
            "honestly you dodge a bullet, I worked there, it's a really good pay for what the job is about,  it's not what you would want as a career, there is little to no coding if you're into software engineering. The closest thing you'll do is SQL queries.\n\nBut if you're interested, the best way to get into FAST, is through referrals, you're pretty much guaranteed to get the role, even if you answer poorly in the interview.\n\nThey have their own team in Colorado coding the whole thing, you're just using an in-house system that's pretty junky to 'assemble' things together, you literally need zero CS knowledge to get into FAST.\n\nThere are so many issues internally both in the culture and how things are done.",
            "That’s nice I guess, but personally I’d rather just get a polite rejection email. Don’t ship me a bunch of knick knacks I don’t need.",
            "The ghosted me after an interview lmao",
            "Yeah and applicants start applying to jobs just to get ‘rejected gifts’ instead of actually looking for a job. 🤷‍♀️",
            "Welp, applying rn 😂",
            "Was it to get a review or feedback otherwise I never knew job rejection companies does this",
            "Very nice of them",
            "I commend you for saying a pleasant thing about a company that didn't hire you. Very mature and good attitude. This company obviously doesn't want to burn bridges, something a lot of people on this sub should learn from.\n\nUnlike what you normally read on this sub, you can't expect every company to hire you for every job you ever apply for.",
            "You got treated better than the people they hired XD",
            "It’s free advertising for them",
            "The participation trophy generation enters the layoff line 😂",
            "Is this a plant?"
        ]
    },
    {
        "post_id": "r0687c",
        "author": "FroyoConsistent3155",
        "title": "I feel like a fucking idiot for going through Microsoft final round as an undocumented student",
        "url": "https://www.reddit.com/r/csMajors/comments/r0687c/i_feel_like_a_fucking_idiot_for_going_through/",
        "score": 865,
        "num_comments": 120,
        "created_utc": 1637646492.0,
        "selftext": "Hello fellow CS Majors. This is just going to be a vent post because I'm feeling really depressed right now, and I don't really know what else to do. I guess I just want to speak to my CS colleagues anonymously, because I don't feel comfortable saying this in my IRL environment.\n\n&#x200B;\n\nI am \"undocumented\" in the United States by way of visa overstay. Throughout high school and up til now, I was never able to work anywhere that required work authorization (so, basically everywhere). My father still has work authorization through some convoluted process before our visas expires, so he's basically been the sole provider for our family. My mother has a chronic illness and is in need of an organ transplant, which we can't get because of our shitty state provided poverty insurance and we need another to supplement it.\n\n&#x200B;\n\nAnyway, yeah. I did not have the most privileged childhood. Our utilities would get disconnected every now and then. My school had exactly zero STEM opportunities, and I had to learn coding on this atrocious laptop from the late 90s (in the late 2000s). It was bad. There was no way we could afford college, but I grinded in high school, got a perfect ACT, and got a full ride based on merit to a T5 CS school. That was wonderful. A weight off our shoulders.\n\n&#x200B;\n\nHowever, my parents were getting older by that point. I didn't see how my dad was going to keep working. Every year I would ask about our legal status, and every year he'd say \"you'll get it next year.\" I should have responded to his temerity with doubt, but of course as a naive teenager I held out some foolish sense of hope that it would actually come.\n\n&#x200B;\n\nNewsflash, it's now my final year in university and it never did. By all means, I believe I did make the most of what I have. I maintained a 3.9 major GPA. I could not do any internships in my years at college, despite FAANG recruiters reaching out to me, which was quite sad. The only things I could do were unpaid, so I found a research position at my school and grinded away in that like I did in high school. I produced a few papers that were accepted in the likes of AAAI and ICML.\n\n&#x200B;\n\nThen, last summer, a glimmer of hope appeared. DACA had been reinstated! I quickly filed an application with the help of my school's undocumented center (to which I owe a great deal of commendation to, as they guided me through navigating university with my status). It was the first time my family felt hope in a long time.\n\n&#x200B;\n\nI did my biometrics, and everything was looking good. Then, a week later…the ruling on Texas’ challenge to DACA. All applications stopped. Silence. Nothing to say, really. Just silence.\n\n&#x200B;\n\nIt was our last hope as our immigration petition filed at the beginning of the last decade will be adjudicated in 2025, far too long, and my father will be far too old by then to work. This was a huge blow. It was such a strange feeling, going back for my fourth and final year of my undergraduate experience, and trying to make the best of it and have fun after the isolation of the pandemic.\n\n&#x200B;\n\nWith every party I go to, or every friend I get boba with, this eventuality hangs over my head, like a dark cumulonimbus: I have no viable path after graduation.\n\n&#x200B;\n\nAnd so, in the thick of recruiting season, I still apply to jobs. Foolishly, of course. I have to indicate that I am not authorized, and that I will need sponsorship. Which is technically the case, except I can't really be sponsored since I'm out of status. Nonetheless, I do it because I don't know what else to do.\n\n&#x200B;\n\nI pass Microsoft's resume screen for their new grad SWE. Then their phone screen. Then they invite me to their final rounds. I grind Leetcode for two weeks straight. In the back of my head, a constant resound: \"Why?\" I know nothing will result from this process. But yet, I do it. Again, foolish hope that \\*somehow\\* they'll be able to hire me. I know it's not going to end well.\n\n&#x200B;\n\nAfter many sleep deprived nights grinding Leetcode, I do well in the final round interviews. Maybe more than \"well\", as you'll see in the email I got from the recruiter.\n\n&#x200B;\n\n\"From: <[verynicerecruiter@microsoft.com](mailto:verynicerecruiter@microsoft.com)\\>\n\nSubject: Microsoft Interview Results\n\nTo: You should've known it was going to end like this, idiot <[idiot@t5csschool.edu](mailto:idiot@t5csschool.edu)\\>\n\n&#x200B;\n\n&#x200B;\n\nHello \\[me\\]\n\n&#x200B;\n\n&#x200B;\n\nI wanted to follow up with you as I've been able to confirm results from your interviews with us - unfortunately Microsoft will not be moving forward with an offer at this time due to your current out of status status while living in the United States. I realize this final outcome may be disappointing but know that you reached a stage of the campus recruiting process that an extremely small portion of applicants achieve.\n\n&#x200B;\n\nUnderstandably, we are often asked to provide guidance from interviews, but unfortunately, we are unable to share specific feedback. However, we can tell you that we received exemplary feedback from all your interviewers.\n\n&#x200B;\n\nThank you for taking the time to interview with us. We really appreciate your interest in Microsoft and if that interest continues, we welcome you to re-apply within a year. If you have any questions about next steps with Microsoft otherwise, please reach out to your designated recruiter.\n\n&#x200B;\n\nIt was a pleasure hosting you at Microsoft and I hope that you enjoyed your time.\n\n&#x200B;\n\nBest of luck to you moving forward!\n\n&#x200B;\n\nVery Nice Recruiter\n\nMicrosoft University Recruiting”\n\n&#x200B;\n\nI guess it's cool that I basically passed the final round? I guess I did pass the resume screen, phone screen, and final round at one of the most prestigious tech companies in the world. And I knew there was no way I was getting an offer. But still, I feel…empty? Not necessarily sad, or disappointed. Just empty. Knowing that I did do all of that, and it's just this fucking thing that is out of my control. I didn't ask to be brought here before I could form sentences and be subjected to these conditions. But now, I'm dealing with the consequences of it.\n\n&#x200B;\n\nI also looked at PhD programs. Same deal. Research assistantships or Teaching assistantships require work authorization, which is part of the funding for the degree. This was the same answer from all T20 CS PhD programs. The undoc center and I spent a good three days talking to all of them and confirming this.\n\n&#x200B;\n\nI guess it's just that it was abstract before. Like, oh, I \\*know\\* I can't get a job. But now, it's real. Material. I got through all the rounds, and my status stopped me from going further. I \\*see\\* I can't get a job.\n\n&#x200B;\n\nMy friends have asked me to hang out with them, but I don't feel like being social at all right now. I've told them as much. It feels like all the things I knew were going to be issues from the past few years are coming to a head. Oh well. That bottle of Ciroc in the fridge is tempting.",
        "permalink": "/r/csMajors/comments/r0687c/i_feel_like_a_fucking_idiot_for_going_through/",
        "comments": [
            "I’m shocked the top comment isn’t asking you to contact your local congressman to petition uscis under compassionate grounds. \n\nHappens very often. No one will have an objection to a story like this if it’s true. \n\nWe need to keep kids like this in this country and I need to hire kids like this goddammit.",
            "This really does suck. Like I can’t even imagine how much pain this brings you and what you wanted was simply solace for your hard work. I hope that you’re able to receive work authorization or sponsorship in the near future to make up for it. Good thing is that you’re obviously very skillful so don’t let that go to waste. Your opportunities are limited for now but overall are limitless. *you should create a startup*.",
            "I’m really sorry that u have to go through this. I hope u can power through this",
            "Like others have said, maybe try and apply outside of the US? With a T5 school I’m sure you can land something, I live in Canada and the tech opportunities are immense here too maybe look into it/ other European countries such as in Nordic regions are huge in trying to attract foreign workers with talent. Im sure you will make enough to sustain your family and maybe even get a green card in one of these countries (I heard Portugal or something they straight up give you green card).",
            "Hey, do you have to stay in US? You might as well apply for jobs in EU and get visa sponsorship. Which I did as non-EU new grad, it is very likely that someone in your profile will land a job in FAANG Europe offices. I know couple of mid-sized companies that sponsor new grads, send me a DM if you are interested.",
            "Damn, this broke my heart. Sometimes you can do everything right and still not achieve your goal. I don't know you but from what you've written here I think we can all tell you're an incredibly motivated and talented person and I'm confident you're going to achieve a lot in this life. I'm really rooting for you.",
            "I wish positive energy and good karma to you, that’s all I can say as a mute non-immigrant spectator in US.",
            "Ah that sucks … I sorry you’re having to go through all of that . I hope somehow you’ll be able to work soon",
            "How bad are we fucking up as a country were a top STEM candidate like this is not able to work? I am constantly disappointed living here",
            "Hey OP, I’m in kinda a similar situation to you. I go to a T4 cs school in the US but my immigration status prevents me from getting internships or working. Mind if I dm you? There’s not a lot of people I know who I can talk to about this stuff",
            "[deleted]",
            "Can you apply to PhD programs and get a visa and funding through that?",
            "I'm so so sorry that you had to go through with this. Maybe you can marry into citizenship? I don't really know what to say except that this is really unfair for you and I wish I could help.",
            "[deleted]",
            "I am so sorry you had to go through all these. Maybe Microsoft would sponsor L1 visa to you and let you work in another country temporarily, then after one year you may get an EAD somehow back in the US? My Chinese folks do that very often when they somehow go out of status, but I am not sure if you could leverage that. Also, you published papers right? Is there a chance to get an O1 with some help from your professors and well-known people around for a rec letter? I wish you all the best and please don't lose hope!!",
            "Could you apply outside the US? Europe, Canada, idk.",
            "Can't really tell what is a viable option in your situation. I don't live in US and I'm not familiar with their law, but I would suggest looking for position in EU if that's an option. I'm pretty sure none of that shit you described works like that here.",
            " I have DACA and there was a time I did not have it and went through this with lots of jobs, I feel for you dude.",
            "Wow your achievement is very impressive. I am very sorry you have to go through all that. \nYour profile would transcend borders (top school, top publications). May I suggest you to apply for Canadian/EU positions? To my knowledge, they are more easy going with the immigration process over there",
            "You can still get married and adjust status. Lot of others in your position. Best of luck.",
            "USA is a really strange place where it you are rich you are gold but you are also always a step close to misery. And misery is fucking terrible.",
            "Bro, your energy is incredible, i really admire you. \nAs about Visa, do you hear about EB3, I know bunch of people get out of school to do EB3 for 3 years -> get US citizen ship -> come back to work.",
            "if i were you, i'd try to get out of the US, family in tow. not only would medical treatment for your mother be less expensive, but you wouldn't have to deal with this bullshit in the EU. best of luck to you, brother",
            "Have you tried doing some cash only web dev? Had a friend of mine do this, that person made pretty good money. However, their status was not the same as yours. \n\nHopefully politicians get their heads out of their asses soon and incentivize our immigration system as, from personal experience, it's quite fucked.",
            "Marry your friend, then apply again to msft",
            "[deleted]",
            "This is why we need immigration reforms. Make it harder for illegal immigration and easier...., nay much easier for legal",
            "I’m so sorry you have to go through this. I hope that you get the work authorization you deserve. Blame Trump, republicans and anyone who tries do deny immigration to people like OP here. I suggest you write a letter to someone in your local government and see if you’re able to get some sort of special permission. This is why this is a problem, the unneeded hoops you need to jump through. Stronger borders doesn’t mean lesser problems. There’s research and studies on this. Most of the people coming in are people who want to make it, and seize the opportunity like you OP. I will always be for immigration, fuck that white supremacist purist bullshit. \n\nSorry to turn this political but I’m bringing up the fact to whoever in here is against immigration to advocate AGAINST stronger immigration. So this kind of thing happens a lot less in the future.",
            "I am really sorry fate dealt you with a bad hand :(",
            "im so sorry you had to go through this,",
            "Sorry to hear this man, you don't deserve that. I hope you find a way to get your papers.",
            "Try looking into crypto. Many small gigs would hire you remotely (say, for web dev or smart contract dev) without giving a shit about your legal status. Many would pay in crypto (stable coins like USDC). Lots of talent moving to crypto these days. No need to be limited by broken govt rules. This is the way.",
            "[deleted]",
            "Isnt Amazon generous with sponsorships ? By the way consider posting this (shorter version truthfully, they’re toxic) on Blind since I think that there’ll be more people who dealt with this on there that are in the US workforce",
            "I know that you can become an immigrant more easily as an higher educated individual (which you are) though I’m not sure if it works for your current situation, but I think it’s worth looking into. I know your current situation sucks and immigration process takes a very long time, but it could be something viable. If you’re able to get Microsoft now, you can get it again!",
            "I don’t support the military at all but I’ve heard story in the past people using it as a way to get immigration status",
            "hey maybe try asking ur recruiter if they can sponsor you for an intern visa(I think its J1). Not sure if MSFT does it or not, but it doesn't hurt to try! Also, all this hard work won't go in vein, I know it can be tough but try to stay positive and good things will be on your way!",
            "[deleted]",
            "To be honest, I think you should start your own startup, I can see your talents in there although I'm just a sophomore. You can have a startup and it will be better for you than getting offer and realize that you cannot work ? This is just my thought! I feel bad for you too",
            "That really sucks",
            "This brought tears to my eyes and I am just hoping someone from a FAANG or MS sees this and does something about it. I am praying for any type of sponsorship to stay in the states and your parents getting help happens asap. I really really hope for you!!!",
            "I'm in the same boat as you.",
            "I think your best bet is to move back to the country where you come from with your parents. With your technical qualifications and English skill you would easily get a FANG level job there and would still be able to support your parents.",
            "Is it possible to work for other countries? You are so good and I am sure you can find the position you want all over the world except US. Do not give up and keep the hope on",
            "."
        ]
    },
    {
        "post_id": "lgacqx",
        "author": "r69000",
        "title": "Amazon",
        "url": "https://www.reddit.com/r/csMajors/comments/lgacqx/amazon/",
        "score": 866,
        "num_comments": 248,
        "created_utc": 1612896615.0,
        "selftext": "Amazon",
        "permalink": "/r/csMajors/comments/lgacqx/amazon/",
        "comments": [
            "I was the mod on CSCQ who argued against the Big N containment megathreads many moons ago, but I gotta say, I'm starting to feel it here. Or maybe just a separate sub? I dunno.",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "[deleted]",
            "Amazon",
            "Amazon",
            "**Amazon**",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "[deleted]",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "uozɐɯ∀",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazeon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "A",
            " Amazon",
            " Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "A",
            "Amazon",
            "Amazon",
            "AMZN",
            "#AMAZON",
            "Amazon",
            "Amazóń",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "A M A Z O N",
            "amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon.",
            "I am lost",
            "AMAZON",
            "AMZN",
            "Amazon?",
            "AMZN",
            "A -> Z",
            "Amzn",
            "Amazing",
            "[deleted]",
            "Could any good willing soul explain me what the hell is going on?",
            "Holy fuck Reddit's mob mentality is ridiculous 😆",
            "No",
            "AWS",
            "I like this company",
            "[Amazon](https://imgur.com/t/this_is_the_way/SFaWrTq)",
            "jof bezo",
            "I take it you didn't get an offer",
            "Prime bitch",
            "[deleted]",
            "AskJeeves",
            "Alabama\n\nEDIT: What? Y'all don't like unions? :(",
            "Ebay",
            "Palantir\n\nyep downvote me idiots bring it on",
            "Come on and slamazon, and welcome to the jamazon",
            "Developers",
            "Microsoft",
            "??",
            "Banana",
            "AWS",
            "How’s this for an idea, \nA poll site where users gotta log in with Reddit.\nYou can have refresh dates/times but results are saved so people can view results of previous years/hiring terms and the current.\nWhat do y’all think? Might help solve the 10000s if posts asking who got in/how many ppl got in, and it’ll be much better visual to see the percentage of ppl getting the job. And logging in with Reddit would negate a good amount of fakes.\n\nAnd lmao I’ll be interning at Amazon this summer but mann I was always searching Reddit for any help I could get.",
            "I find this offensive",
            "Cat",
            "Overrated",
            "ok rob",
            "Google",
            "AmazOn",
            "Amazon!",
            "Ratio",
            "Yahoo",
            "Nozama",
            "Amazoom",
            "Zamzor",
            "WE ALL LOVE AMAZON!!!",
            "Drop an A in the chat boys.\n\nA",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazooooon!",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "Amazon",
            "."
        ]
    },
    {
        "post_id": "18ellyf",
        "author": "Atorpidguy",
        "title": "There's no point in participating in hackathons anymore",
        "url": "https://www.reddit.com/r/csMajors/comments/18ellyf/theres_no_point_in_participating_in_hackathons/",
        "score": 865,
        "num_comments": 52,
        "created_utc": 1702151780.0,
        "selftext": "I've been to 5 hackathons in CA this year and I'm telling you, each time the winner is an AI-based system that has seemingly \"good potential\". At this point, they are not even considering projects in other subdomains of CS that do not have the word in it.  ",
        "permalink": "/r/csMajors/comments/18ellyf/theres_no_point_in_participating_in_hackathons/",
        "comments": [
            "Yeah, I went to a big hackathon this year, and almost every project that won was some ChatGPT wrapper.",
            "The tech world is completely built around hype, underperforming expectations, and bursting bubbles.\nYou see the trend, if you want to win you need to build a chatgpt wrapper. \nHackathons have always been stupid, they're now just a kind of stupid that you don't like.",
            "For real, can people please make something without the 100000th GPT wrapper",
            "I hate to sound cheesy, but winning is just a minor part of it. Doesn't really matter who wins, or how.\n\nHackathons force you to build cool stuff under pressure. You're probably working in a team as well, so you get to practice working/coding in a group, and all the skills that come with it.\n\nAlso, hackathons are a fun way to meet people and learn what they like to work on, and how. Generally, it's just a great vibe. At least in my experience.",
            "Hackathons are a great simulation of the real world.  The judges are like investors with no technical knowledge who just care about the most ambitious prototype with the flashiest ui.",
            "Please don’t go to a hackathon with the intention to “win”. I did that once and it’s really miserable, going with the intention to build something cool and unique will change the entire experience, from my experiences…",
            "The hackathons aren't about winning. They're about sticking to a project idea, learning about a domain for a long period of time, and making friends. In 2013 someone could have written this post about VR.",
            "[removed]",
            "Lol I had a very different experience last year. Did a company hackathon and our team was the only one that incorporated ChatGPT tokens and a pre trained model, the rest were basic full stack apps. Somehow didn’t win anything, the top 2 teams were all Full Stack.",
            "Welcome to the world of research. There's always a fad.",
            "I have to agree… winning hackathons has come down to researching what kind of AI models have won the top prize previously and then slightly twisting the end goal of the project (while keeping the same AI models in mind). In our case the previous hackathon winners all relied on computer vision models, so we did the same this year and… well… we won. I’d like to say it was because of hard work but it’s more just finding out what the judges and audience want to see.",
            "The amount of hackathon winnijg projects I've seen that are made with a simple GPT API call is saddening",
            "Anymore? It has been this way for a long time now.   \n\n\nStep 1:  AI  \nStep 2: Blockchain  \nStep 3: ???  \nStep 4: Profit",
            "It’s not just hackathons, it’s school projects too. I’m a TA for a graduate SE class and there are so many CRUD apps with a ChatGPT component. And then I went to an undergrad project showcase and they’re so cool, like a kernel compatibility layer that translates Linux system calls to FreeBSD system calls. Sigh.",
            "At least they’re wrapping ChatGPT. Back in the day people just built a frontend and in their pitch explained that it would use “Machine Learning and blockchain” in the backend. No actual implementation.",
            "there never was",
            "Haha I think you just unlocked the VC vision. Now you know what to do if you want to win a hackathon or VC money",
            "If you can’t beat ‘em, join em",
            "In my last hackathon the win ér team built hw prototype. That was awasome.",
            "Does this apply to all hackathons? Heard places like Treehacks is kind of prestigious or ebays hackathon.",
            "This is the perfect time to find the next “ai” thing though.",
            "FOR REAL",
            "Bruh i knew it",
            "Is this true for the more prestigious hackathons?"
        ]
    },
    {
        "post_id": "17stm63",
        "author": "Dazzling-Rooster2103",
        "title": "Apple admits discriminating against US citizens through PERM program; paying $25M",
        "url": "https://9to5mac.com/2023/11/10/apple-admits-perm-discrimination/",
        "score": 865,
        "num_comments": 231,
        "created_utc": 1699706609.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17stm63/apple_admits_discriminating_against_us_citizens/",
        "comments": [
            "$25 million is actually nothing.",
            "The same thing happened at the startup that I shortly worked for, except as far as I know, they never got busted for it.\n\nI’m not making any judgement on doing it or not, but it doesn’t seem like an uncommon thing to me and my former CEO didn’t seem to care very much as long as he got the person he wanted to hire.\n\nClearly he wasn’t only hiring international people, since I was there, just saying he wasn’t exactly working within the spirit of the law.",
            "need to pay 25 billion",
            "very poor wording on the article's part. companies never really \"admit\" to any wrongdoing. they agree to a settlement, saying they don't believe they did anything anything wrong but theyll still pay to avoid further litigation/etc.  \nper the cnbc article linked in the 9tomac's: \"Apple contests the accusation, according to the agreement, and says that it believes it was following the appropriate Department of Labor regulations. Apple also contests that any failures were the result of inadvertent errors and not discrimination, according to the agreement.\"\n\ni will explicitly say that i don't support apple's doing in any way, just pointing this out.",
            "[deleted]",
            "There have been numerous similar cases brought against other companies:\n\n\\- Here is 2021 case against Facebook: [https://www.npr.org/2021/10/19/1047354380/facebook-settles-a-federal-lawsuit-over-allegations-it-favored-foreign-job-appli](https://www.npr.org/2021/10/19/1047354380/facebook-settles-a-federal-lawsuit-over-allegations-it-favored-foreign-job-appli)  \n\\- And surprise, surprise Facebook is being sued again this year: [https://news.bloomberglaw.com/daily-labor-report/metas-h-1b-hiring-spurs-ninth-circuit-look-at-citizenship-bias](https://news.bloomberglaw.com/daily-labor-report/metas-h-1b-hiring-spurs-ninth-circuit-look-at-citizenship-bias)  \n\\- Bunch more cases here against other companies: [https://www.justice.gov/news?search\\_api\\_fulltext=+h-1b&start\\_date=&end\\_date=&sort\\_by=field\\_date](https://www.justice.gov/news?search_api_fulltext=+h-1b&start_date=&end_date=&sort_by=field_date)\n\n&#x200B;\n\nThe H1B program needs to be abolished or completely revamped. The folks who abuse the system even have the nerve to try and double the number of H1B visas: [https://www.reddit.com/r/technology/comments/16pf2df/us\\_lawmaker\\_moves\\_bill\\_to\\_double\\_h1b\\_visas/](https://www.reddit.com/r/technology/comments/16pf2df/us_lawmaker_moves_bill_to_double_h1b_visas/)\n\n&#x200B;\n\nWant to fix it? Contact your representatives.",
            "This is happening everywhere.",
            "There shouldn’t be this many international hires while we have qualified talent in the US. These companies are taking advantage of visa programs and fucking us out of jobs.",
            "H1b work more hours, are trapped until green card, and can coordinate with outsourced teams easily. All the big tech companies prefer foreign worker. They hire h1b for new grad positions while the market is flushed with new grads . What does that tell u",
            "Imagine, Americans getting screwed, in America, by none other than cheap foreign workers on H-1B from india.\n\nThen one of the companies responsible for destroying next gen Americans is getting soft slap in the hand.\n\nNo wonder people on r/h1b keep celebrating",
            "Hold up isn't it harder for foreigners who need work authorization?",
            "[deleted]",
            "[deleted]",
            "> Apple was accused of not advertising positions on its external website and erecting hurdles such as requiring mailed paper applications\n\nQuite the accident",
            "It’s not just Apple. Every big tech company you can name is doing it.",
            "Reverse discrimination😂",
            "Why would a US company prioritize hiring H1Bs over US citizens?",
            "I have US Citizen on my resume and wondering if I should keep it on there. I've definitely applied to several Apple positions.",
            "All those people saying it wasn’t true are quiet now",
            "In a a good free market capitalist system, the government should not restrict hiring abroad in the first place.\n\nThe free market should allow anyone to hire anyone.",
            "The capitalism is too late stage, start fucking nuking companies when they get too big",
            "they were doing the needful sir\n\nbitch lasagna and blody redeem",
            "No one finding a job? Check your skin color I guess lol.  Being white means you’ll have an increasingly harder time landing a job in America, unless you go towards the defense industry I guess.",
            "25 M fine and that is it? I bet they will do it again so they can underpay and exploit immigrants.\n\nUS citizens should boycott Apple products",
            "Next up: Apple found guilty of turning obsolete iPhones into IEDs, must buy judge lunch.",
            "Look at how long it took to catch them. They'll continue hiring the same amount of foreign employees using the program regardless.",
            "When HCL, Wipro, Deloitte, IBM, Infosys, Tata, Tech Mahindra, Accenture?",
            "$25M on $160B cash holdings is roundable to nothing. Maybe they should be fined what the difference in cost savings was between the two groups."
        ]
    },
    {
        "post_id": "1alza6m",
        "author": "OddChocolate",
        "title": "\"Just learn to code\", they said",
        "url": "https://i.redd.it/sh0bv6qynbhc1.png",
        "score": 866,
        "num_comments": 120,
        "created_utc": 1707408810.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1alza6m/just_learn_to_code_they_said/",
        "comments": [
            "Right around the peak in early 2022 was when you see kids on TikTok and IG flaunting their jobs with crazy comps doing 2 hours of work a day. I saw dozens of those videos every day around that time frame. In the past year I’ve seen none. Now they all post videos of real day in the life of X actually working a full day. Coincidence? You think the managers and directors at these large companies don’t see shit like this?",
            "This would just be considered normal levels if politicians and social media did not push the field so hard. Now it's just too many people trying to enter it. They will all phase out eventually when they realize it's not what they thought it would be.",
            "So basically they are just back down to normal... and companies are getting rid of all the shitty hires they made during the pandemic",
            "Why don't you zoom out a bit there bud",
            "post doesnt make sense. programming job market was good in 2020. it became ridiculous during the covid years and now its back to 2020. which means its back to normal aka good? i think you guys have unrealistic expectations of this job.",
            "Learn to coal mine",
            "So we are 20% below pre-covid? That's crazy good actually, if the data is representative.",
            "[deleted]",
            "All I'm seeing is the death of bootcamp hires",
            "I feel legitimately the reason they taught ppl to code is that when everyone’s special no one will be",
            "The chart need to extend to pre-COVID 🤨",
            "Looks like a Gaussian distribution, seems like it is only getting worse from here, pack it up.",
            "It's over.. The new art degree",
            "This graph is awful",
            "starting your y axis from the minimum :(",
            "I mean the main “learn to code” peak started around 2010-2014.",
            "What goes up must come down",
            "Does this account for all job titles or just “software developer”? There are a lot of emerging new titles that cs majors can naturally go into which could be missed here, i.e Analytics engineer, data engineer. Not to mention the other software developer POTENTIAL aliases: software engineer, web developer, backend/frontend/full stack developer, the list goes on…",
            "This is actually a graph of my optimism for my degree before, while and after finishing it",
            "Jesus Christ",
            "[deleted]",
            "So.. cyber security Now?",
            "shut uuuuuup",
            "Look at the y-axis. It seems you did something interesting to make the current number seem lower than it is. (Deceptive).",
            "Oh well! Software Engineering is awful as a career!! Everyone else do something else and leave software jobs for the rest of us 😂",
            "Notice the timeline is relatively short and it ends where it starts",
            "Yes.  Just learn to code.  Nothing has changed.",
            "This timeframe is too short and too specific. If I’m reading it correctly, it is indexed against Feb 2020… right before Covid hit, and the job market went nuts. Maybe widen the view by a decade to see what’s what.",
            "Looks like Mount Fuji!",
            "Lol who cares",
            "all this graph shows is the numbers going back to covid levels (before the mass hiring for remote workers)",
            "You are looking at a bubble.",
            "Most of the middle of that graph has been laid off after companies hired piles of useless engineers as a hoarding exercise. What you're seeing toward the tail end here is the actual demand which is still good, which any competent engineer should be able to compete with. The field ain't going anywhere. ",
            "Lesson: Don't trust social media"
        ]
    },
    {
        "post_id": "13qq1j2",
        "author": "mpaes98",
        "title": "Money is a perfectly valid reason to study CS",
        "url": "https://www.reddit.com/r/csMajors/comments/13qq1j2/money_is_a_perfectly_valid_reason_to_study_cs/",
        "score": 862,
        "num_comments": 141,
        "created_utc": 1684945043.0,
        "selftext": "I'll preface this post by saying that I personally do have a genuine passion for my niche field of CS and for technology in general.\n\nHowever, I've noticed that the comment sections of a lot of the doomer posts are criticizing people who are \"just in it for the money\".\n\nNews flash: money is a HUGE reason most people are in this field.\n\nAnd that's perfectly fine. \n\nTruth is that this field pays extremely well compared to others, and that's what attracts people to it.  I'm a research scientist in the field and make significantly less than what I could in industry, yet it's still in the mid six figures (well above what researchers make in other fields with my experience level).\n\nYou don't need to have a deep passion for microservice architecture design, write \"insightful\" LinkedIn articles, grind leetcode and hackerrank as your favorite hobby, or be like that kid who \"dreams in code\".\n\nJust try to be good at your job, and don't make the job of those around you harder. \n\nAt the end of the day, it's just a job. It doesn't have to be your identity.",
        "permalink": "/r/csMajors/comments/13qq1j2/money_is_a_perfectly_valid_reason_to_study_cs/",
        "comments": [
            "It is possible to be passionate about information technology and understand that a career in software development is ultimately just a job and a way to earn a living.\n\nFor example, I got started in the '80s when almost nobody had a home computer of any kind. I learned to program because I love building stuff, and delivering new tools to users who get real value from what I made. That passion had kept me going through childhood, university, and now over 20 years of professional career.\n\nAll that said, I have a life and other interests. I do not practice leet code. I do not believe side projects should be required or even considered a part of a healthy balanced life. I believe side projects are something you do when you have an idea that's so awesome you can't help yourself, work sucks, or during periods of mania (which I think we all experience to some extent). I do not believe in tying my identity to being a programmer, and I especially do not believe in tying my identity to a specific programming language or toolkit or environment. (I think that attitude puts one at risk of obsolescence.)\n\nI have a family, and friends, and I regularly practice and improve at music.\n\nI do not claim to have all the answers or even necessarily know what's best. I've been looking for work for over 9 months. The current market is brutal. There does seem to be a preference for the obsessive leet coder types, which obviously I'm not, although I rarely have much trouble solving the technical problems thrown at me during an interview.\n\nI'm also very interested in software entrepreneurship, and finding like-minded people to invent a product together with, and make it happen together. I hope one day somebody will read what I'm saying here and chat me up. Most software is too big and complex to work on it alone.\n\nSorry for so completely jumping the shark.",
            "I go to a cross-fit gym every Monday, Wednesday, and Friday. I do this because I am out of shape and overweight and want a healthy lifestyle.\n\n&#x200B;\n\nAt this gym, there are talented coaches who are excellent athletes who would likely rather be training peak athletes to break their 4 minute mile or whatever. However, most of the other people at the gym are schlubby like me.\n\n&#x200B;\n\nAnd that is just like my job. I loved programming, and I loved doing it for years, and I found myself burned out and frustrated constantly because i was doing grunt work that didn't challenge me intellectually.\n\n&#x200B;\n\nAnd eventually I realized: This is the work that is out there. This is the work that people need me to do. Just like my crossfit coaches, of  whom I have seen many come and go, the ones who stick it out are the ones who learn to distance themselves a bit and do the job they were hired to do.\n\n&#x200B;\n\nThis is why I say I am \"in it for the money.\" The work that I do isn't particularly challenging. But it is useful and the company makes money. So it goes.",
            "[deleted]",
            "That's not my problem, my problem is when people on Blind say the sky is falling because they went from their 250k FAANG job to 120k normal job. People in that position should be fortunate they have such a well paying job - the reason they're not is because of the crap peddled by influencers about CS being a \"superior\" career to all else and anyone with a pulse gets 200k.",
            "I think you're missunderstanding what most people are trying to say. \n\nIf you're just going into CS for the money and have no technical aptitude, genuine interest in the  subject, or skill, then you're gonna get destroyed in the market. People who have the above traits will just out perform you.\n\nI don't see very many genuinely talented engineers making doomer posts. They're to busy actually having jobs. Even the ones that got laid off back in January are likely working again now. \n\nThe people making doomer posts are mostly new grads who are realizing that they either don't perform at a high enough level to get paid the big bucks, or aren't good enough to get hired at all. Those people, the people who would probably be high performers in a different industry but forced themselves into CS for the money, are the ones that get criticized.",
            "Growing up poor in an affluent town taught me it’s OK to go do something for the money. Most of my friends’ parents’ worked in finance, law, etc. They went to work and then they left work at work. They went home to paint, work on vintage cars, build treehouses, etc etc. They didn’t hate their job, but the majority of the reason most of them did it was because it made good money, they were good at it, and they liked it enough. \n\nMost people will never be able to do what their heart “truly desires”. For someone like me getting a degree in something like art, film, or English would be foolish. I’d end up in poverty. However, I can get a job doing something I’m good at and makes good money and then go home and write.",
            "Just as big of a problem is having to fake being interested in working for a company during the hiring process when the recruiter, hiring manager, or ICs ask you questions about why this company or this role. The reality is that except for a handful of companies who gives a f\\*ck about your B2B SaaS software or your morally bankrupt social media company I just want a job to pay the bills and live my life.",
            "Fact. To add to this, work life balance as well. It has its fun perks but still a job at the end of the day. I would rather work then clock out and have time to spend time with my family and do other hobbies.",
            "In my previous field/degree, I was told that “you aren’t gonna be a millionaire working in this field.”\n\nI thought I’d at least be able to make ends meet. Nope.",
            "A job is a job. We all have bills to pay. If it happens to be something you have a passion for then that’s great. It just doesn’t apply to everyone nor does it have to.",
            "Exactly. I plan on working to live, not living to work. Therefore, money is my main motivation.",
            "My favorite are the people who claim to be passionate yet are less talented than people motivated by money.",
            "Money and passion for your job are not mutually-exclusive.  If you get both, that's great but at the end of the day, we're all just trying to survive (and hopefully make lots of money along the way :-))",
            "Seriously. I was a horse trainer and farrier for 10 years. Decided I wanted more money to raise a family with my wife so I got a degree in computer science. Making 120k now and it’s only for the money. I’d much rather be working outside with animals but responsibilities o my family don’t allow that.",
            "Why is there this assumption that you automatically get a six figure salary by just being a cs major. Most people are prob not making that much money and those who are didn’t get there so easy.",
            "Yeah sure, I don’t give a fuck what is motivating you as long as you can keep on my speed, even better if you are faster and show me the way!\n\nAnd having a life outside of CS is totally necessary if you don’t want to burn out",
            "I swear I’ve been on the internet too long, no matter how long I live, no matter how little I actually played it, no matter what sub I’m in. CS just automagically means “counter strike”",
            "\"If you're in this business for any reason besides the money, you're a fool.\" - Gorilla Monsoon, said about pro wrestling, but I find applicable to CS",
            "Yep! It is a perfect reason! Shit I’m like 3 weeks away from graduating with a CS degree and a good job! All I care about right now is making $$$ and taking care of my parents. :)",
            "W post",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "How did you get a decent paying R&D position? I hate hate hate web development and I've tried several times. But it seems like the only high paying CS jobs are all in web software",
            "It's the only reason I went into it",
            "This is true but I'd be careful pursuing a degree based solely on the monetary benefit. Money doesn't mean you'll be happy or satisfied.",
            "The idea that you need to be passionate about a job was made up by corpos to make people value their pay less. In the end the reason you have a Job is for the money, not because it’s fun, or else you would be doing volunteer work. Yes, you can enjoy your job, but the end goal is money and that is perfectly acceptable.",
            "not anymore, with mass layoffs making oversaturation worse, coupled with AI, the golden age of swe salaries is over.",
            "100% 🙌",
            "I agree. But I’d be curious to see how much your willing to grind when your ass is in the hot seat and you have a challenging problem you need to solve, vs a person who loves the field and is engrossed in challenging problems. One of them will quit and take the day off and one of them will not stop till they solve the problem. I’m fine with people studying something for money, but I just know when times get tough, it’s much easier to break through obstacles when you have a passion/genuine interest in the subject. Now as for how you measure genuine interest, that could be subjective and is up for debate. One persons definition for this is different for another. At the end of the day idrc, cause I only care about MY passion for a subject, not anyone elses, cause well, why should I care.",
            "I think what most of the posters mean when they say \"Money isn't a valid reason\", is because most of the people who do it for money don't have a CS background and will not survive within the industry. I am barely surviving.",
            "I won't beat around the bush. I need money to survive. I do like computer science and genuinely find it an interesting field, but you'll never catch me taking an internship or job for low to no pay. I turned down offers from Uncle Sam to large companies because they simply did not compensate me what I believe I am worth.\n\nThe best thing about this field in my opinion is the flexibility it gives you. I'm disabled and can't leave home, but that's no problem at all for most CS work. Almost all of it can be done online. I've found that freelancing is more my thing. It's a part of me, it gives me freedom, but it isn't my life - it just lets me live it to its fullest.",
            "Add data science and AI to the list too.",
            "Ok, be in it for the money, but then if you make doomer posts expect to be ridiculed!",
            "It’s incredibly entertaining to me, people who have liberal arts majors and can’t afford a better living are often told they should have picked a better major but then when people pick majors that will pay them well solely because they pay well they’re vilified",
            "If you don't like the process of coding then from my observations it will be nearly impossible to stick with the job long enough to get the big payout. You don't have to love it or live and breathe it, but it'll be hard to keep up if you loathe it.\n\nIn a similar vein I once knew an Obstetrician who was a literal misogynist who couldn't stand being around women. He could tolerate the patients most of the time, but all his nurses, front desk, and billing staff were women and he couldn't stand them. Didn't like men much either, but didn't hate them as much as women. He didn't last long enough to pay off his student loans- maybe lasted 5 years max in private practice?  Some people will be so miserable in some jobs that no amount of money is worth it.\n\nSo, yeah. Only the tiniest portion of devs would keep dev-ing if they won a $100 million lottery- we're all here in large part for the money. But people who hate the actual work of software development will probably be better off in other jobs. Just my two cents.",
            "There's nothing wrong with picking a career for the money.",
            "At the end of the day, most people have jobs period for the money. Teachers, nurses, doctors, skilled trades, so on and so on - you think anybody grows up with a real passion for plumbing? or setting catheters? \n\nHonestly, most people should just take the most lucrative path they have available and use the resources that provides to pursue whatever passions they may have. Real savants who are just completely enamored with their subject matter are legitimately few and far between, and even then, the nature of employment will likely be the most soul-sucking application and elements of that skillset.",
            "The more saturated it becomes the more it will drive the salary down",
            "It doesn't have to be your identity, but it means the type of person drawn to this field is indistinguishable from finance bros (aka unlikeable people). That's just the truth. Instead of fun-loving nerds that enjoy what they're doing and have passion, you're mostly going to be surrounded by neurotic, anxious, and competitive money-chasers. Personally, I'm not a fan of this.\n\n\"Money is a perfectly valid reason to study CS\" is a meaningless sentence. What does it mean for something to be valid? Don't you think if people need constant outside validation for what they're doing, they might not be doing the right thing for themselves and/or the field? You say not to make the job harder for those you work with but it does make it harder when you're annoying and refuse to talk about anything other than the FIRE movement.",
            "The thing is TECH companies pays well, so you don’t have to be in cs. CS pays pretty solid but if you are in it for the big payday you can be anything you want just get into a tech company",
            "who cares what's \"valid\" bruh just live your life",
            "I think a lot of the criticisms of that mindset stem from the fact that many of these people believe they are OWED jobs and high salaries, simply because the market has done well the past few years (just browsing through this sub shows that)",
            "I enjoy the work and started out studying comp eco and engineering because of the money. I feel like people who don’t enjoy the work and join for money are the same people who are struggling to find jobs in the market right now. Maybe that’s being too harsh but fuck it mate.",
            "I did it for that and I regretted. tbh going to IT has been more not only relaxing but enjoyable",
            "The only thing I want to add is that this isn't as well paying as we think it is.\n  \nI met some investment bankers and shocked what they pulled in for bonuses alone.",
            "Why not do IB if you’re only in it for the money?",
            "Idk tbh if I hated my job I'd really hate it. I can't imagine forcing myself to do something I don't somewhat enjoy",
            "Tech is interesting to me, I’n good at it, but money is the biggest reason I didn’t bother exploring other fields and am sticking to CS. Period.",
            "Very true, but also for those of you who are only in it for the money, hold out hope for eventually falling in love with some aspect of the field. I grew up programming, loved it, then went through a phase in late high school/freshman year of college where I was only in it for the money. The idea of going into CS sounded terrible to me as I was much more passionate about music at the time, fully convinced I could make it as a musician.\n\nNonetheless, I still went into CS out of fear of employability and hated myself for it. Now, I'm happy I made the choice. After starting at my current company I realized I actually love doing this as a job (even if it's not as glamorous as being a musician). It's like solving puzzles everyday to me. Not to mention I get paid good money, and still have time to practice my guitar and jam with my friends. Just cause you don't feel any love for CS now, doesn't mean you'll never grow into it.",
            "I’m totally in it for the money. When I went to college, I had 0 real passions that made money, so I decided to go cs. \n\nI’m young and getting a college degree(21 just finished the 3rd day of my internship :D) which is an advantage, but I’ve been able to navigate finding jobs pretty well. I understand that I definitely don’t have the proficiency/passion to take me as far as the people who’ve been coding since they were 10, so I just focus on the more people-oriented jobs in the industry. Tech sales internships were the easiest to find imo, and in jobs like that you kind of control your own destiny. \n\nI ended up going with a different job for my internship this summer in a tech-adjacent role, and so far it’s been great. Somehow knowing how to code makes me wildly qualified for a high paying position working with only softwares other people built.",
            "Thank you",
            "People need to stop acting like wanting a better pay is evil. Its ridiculous the worker has the right to decline a job that pays you garbage. Instantly saying someone is a golddigger, in it for the money is a sign of resent and stupidity. The bills aren’t gonna pay themselves, the food isn’t gonna walk over to my house and plop into my mouth. Everybody needs money and obviously choosing the career that pays higher is not a sign of being in it for the money, greedy etc.",
            "People that are in it for the money are the reason we can’t have nice things in this world.\n\nTC: 500k",
            "\\> News flash: money is a HUGE reason most people are in this field.\n\n&#x200B;\n\nSince some years maybe, but not before. For me it's sad to see my favourite field filled with nerds and people interested in computers or linux getting filled by all the career guys who think being manager is some kind of promotion",
            "It's a valid reason but having at least some semblance of passion for your job helps. Or something that you like about CS in general. I know quite a few people who went into CS, got bored then went into something else like policing.",
            "\\> At the end of the day, it's just a job. It doesn't have to be your identity. \n\nIt has to be part of your identity. No sane human would want to make a living doing something from which they are completely disconnected.",
            "In other news: Water remains wet.",
            "People are so stupid if it wasn’t for money I wouldn’t work any fucking job",
            "Don’t worry in four years it won’t be.",
            "Money is a perfectly valid reason to study CS, true\n\nBut i think passion is what drives resilience in the field, the little things. Someone who is passionate will retake classes and learn on their own and do their own projects and be leaders if they wish, will basically drag themselves through the mud for it even when they take L's in some subjects or are somewhat garbo at using math the traditional math (like me) or even being a minority in the field (also like me) and that is very valuable.\n\nSo yes, while you can totally be in it for the money, the insane among us are the ones who probably won't give up even when the money dries out and the uphill battle becomes stupider and stupider, while many who are in it for the money burn out or end up hating the very subject they chose\n\ni've always mentioned, it really takes a special kind of crazy to really stick through it, thick and thin, and passion is one of the things that keeps a motivation like money alive as well\n\nwhen the money runs out, those who were passionate and became passionate are the ones who will find value in it\n\nIn the end, hellscape capitalism makes everyone seek anything for money, such is the profit motive, but i think its worth re-examining the paths you take because hell, trades make money too, a business degree is like almost guaranteed carpet to money in one way or another, anyone can also make good money in cs by not even going to college, got a whole industry out of being anti-college in the tech sector too.\n\nSo maybe, the question really becomes, at the risk of sound elitist, who should get a degree? and why should one get a degree? Passion and Academics are great answers and an under/graduate program should be reserved (and for way less fucking expensive) for those who truly want to strive up to the challenge because they're good at it or passionately insane \n\n\ntl;dr:  in an ideal world without capitalism, we wouldn't be getting degrees for the money, we would get our degrees because we're crazy and want to dedicate ourselves to the field THAT much",
            "That said if you're really bad at it and not improving after a few years please get out of engineering/dev and go into a support role or something.",
            "."
        ]
    }
]