[
    {
        "post_id": "nzuv6v",
        "author": "superbmani15",
        "title": "Let's stop talking about Computer Science",
        "url": "https://www.reddit.com/r/csMajors/comments/nzuv6v/lets_stop_talking_about_computer_science/",
        "score": 870,
        "num_comments": 67,
        "created_utc": 1623699087.0,
        "selftext": " It's no longer relevant and really unnecessary. It creates a sort of \"class boundary\" between those in CS and those not in CS.\n\nIt also just doesn't make sense. Is programming really in the same caliber as data entry or accounting right now? I wouldn't say so. Additionally lots of people here would be pretty satisfied with a job at Target or Walmart. If you, like me, are specializing in cars, then your dream job is likely a car saleserson or car mechanic or again, racecar driver (vroom vroom).\n\nPart of the beauty of computer science is that it's applicable to just about anything else, what's with all the focus on tech?\n\nOne more thing: if you are good enough to work at one of these more prestigious companies, I would argue you should stop selling your labour and start YOUR OWN company",
        "permalink": "/r/csMajors/comments/nzuv6v/lets_stop_talking_about_computer_science/",
        "comments": [
            "I always appreciate a good parody",
            "What leetcode questions should I practice for a car mechanic interview?",
            "I saw that post earlier otherwise I might’ve thought this was someone delusional but legit.",
            "I’m guessing this is a parody post to the “Let’s stop talking about FAANG” post lol",
            "Vroom vroom",
            "this made me lol",
            "lmfaoooooooooooooo",
            " don't understand what you mean  anyone explain the parody pls ? English is not my native",
            "lmao didn't even realize until now the parody post is from a sophomore who \"specializes in AI\". Probably never took intro to stats and got a 600 on SAT math but \"specializes in AI\".",
            "original\n\n/r/csMajors/comments/nzn51r/lets_stop_talking_about_faang/",
            "I am laughing so hard at these posts",
            "lol",
            "I see what you did there.",
            "Low coupling and high cohesion.",
            "lmaoo",
            "My god this is great",
            "It's because we as a society should really be automating servant-level tasks.\n\nI've folded probably 50 thousand pizza boxes before I got my degree and my first CS job. If I get motivated, I could probably build a machine to do it at least partially now. And I wouldn't feel bad about it either. If you think I'd be TEKKEN DER JOBS you need to do some critical thinking.\n\nIf you're a person who unfortunately for whatever health or mental reason can't aspire to anything higher than a basic minimum wage job, you deserve to be taken care of by the state.",
            "Commenting on this for the meme",
            "vroom vroom",
            "never change",
            "how do I make good pancakes? like i feel the batter is always either too runny or too lumpy and it just doesn't work out",
            "So creative I’m dying😐",
            "I think this is uncalled for.... the other post wasn't even wrong. Youre just making fun of them at this point. \n\nBe respectful to others.",
            "Hahaha",
            "lol",
            "I understood the reference. Good one!!!",
            "[deleted]",
            "Computer science? I thought cs was car science.",
            "S",
            "        C 2",
            " X q c c,     c c    T. C u t2",
            " W c",
            "33",
            "3.",
            " 5z c",
            "   H hxc.",
            "."
        ]
    },
    {
        "post_id": "jhjuu1",
        "author": "SongNinja",
        "title": "Advice I learned or wish I knew from a college senior",
        "url": "https://www.reddit.com/r/csMajors/comments/jhjuu1/advice_i_learned_or_wish_i_knew_from_a_college/",
        "score": 869,
        "num_comments": 35,
        "created_utc": 1603584961.0,
        "selftext": "I'm a college senior and I remember reading this sub for advice years ago early in my degree so I wanted to return the favor. Some background on me: top 50 CS school, 5x internships, 4x FAANG. Below are bits and pieces of advice and things I learned or wish I knew when I was younger plus some thoughts addressing common posts I see frequently on this sub. Hopefully this can help some of you!\n\nRegarding your CS degree\n\n* \"I'm struggling in class. Am I not cut out for CS?\" **Struggling is a sign of learning and growth, not failure**. CS is not easy. Persevering through challenges is not only useful for your degree but for your life after. You don't need to be naturally gifted to do well in CS. I personally bombed my intro classes and it took me \\~4 months for things to start clicking. During those four months I just kept re-reading the material and going to my professor's office hours to ask questions. There will be very rare cases where CS doesn't mesh with some but for most, do not give up when things get hard if this is something you truly want to do.\n* In addition to the bullet above, you'll always feel like there are people that have to work way less to do well/understand the material and **that's ok**. I see a bunch of threads about how students feel that they have to put in more work than their peers/it seems like everyone else in the class just gets the material while they don't. Many of the people that were \"loudest\" in my intro classes were putting on an act because they were afraid to show weakness and look dumb. Lots of these people either dropped out or are struggling with the rest of us in the upper level classes. Your competition is not your peers but yourself. By comparing your learning and current abilities with your past self, you eliminate a ton of stress from your peers. The way that I look at it is if I am a better programmer today than I was yesterday then I am getting closer to achieving my goals.\n* **Be comfortable with looking stupid.** There were times in class where I was afraid of asking a question because it was on something so basic that I thought that I'd look dumb to everyone else. Know what's worse than looking stupid? Going the whole semester never getting that question answered and performing poorly on exams/future classes that required strong understanding of that topic. You are paying a ton of money to attend class so use your money's worth and ask questions until you understand. More often than not, there will be other classmates that have that same exact question but are too afraid to ask it. This will help you in your job as well because the worst engineers are the ones that are unwilling to learn/admit their lack of knowledge.\n* **Do not cheat/copy code**. You are paying potentially tens to hundreds of thousands of dollars for an education. I'm not talking about risking getting caught and expelled. When you cheat, you are cheating yourself by not learning the material. Embrace failure and use it to learn because everyone fails at things they are new at and anyone that says otherwise is a liar. If you cheat, yes you may get a higher grade, but you are paying thousands of dollars to end up exactly the same as before you started your degree. A degree/good grades can open doors but it won't get you past the technical interview.\n* **Survivorship bias**. \"All my friends/peers are doing so well in class and getting amazing job offers.\" Social media and LinkedIn makes it difficult to not compare ourselves to our peers. However, no one posts about the interviews they bombed. No one has a LinkedIn header of \"failed X onsite\". Behind every offer can be a story of countless rejections and failures that aren't apparent because \"hey they got the offer at X company so they must be naturally amazing\". When I got my first internship, I applied to 100+ companies and only heard back from 1 which ended up giving me an offer after only a behavioral interview. There may be a small subset of geniuses who always do well but most people still find success and are just good at hiding their failures.\n* **Having strong technical skills and writing lots of code does not make you a better programmer**. Lets say person A is the next Alan Turing; they write brilliant code at 5x the output of their peers. You might think that they can get a job anywhere. Wrong. They might write code so brilliant that no one is able to understand it and it takes a team of 10 people just to maintain and refactor their code for the rest of the company to understand. While writing complex code might make you seem \"smart\", no one wants to be the person to maintain the code after you inevitably move projects/companies. An average coder with great communication skills and coding conventions is capable of being more valuable to companies than genius coders. Don't neglect writing clean/easy to understand code and non-technical skills. Be someone that people want to work with.\n* **Everyone's timeline is different**. Don't be discouraged that you haven't gotten your dream internship/job yet. I was originally an engineering major and switched to CS after 3 semesters. I constantly felt behind people my year as I was stuck taking intro classes while they were taking advanced courses and using that knowledge to pass interviews at amazing companies. I almost didn't get a coding job as my first internship. I've had to push off non-academic semesters and go back to school because I couldn't get any internships. Be confident in yourself that you'll end up where you want if you keep trying.\n* Learn how to improve from your failures. What usually happens to me is that I think the answer is X when it is actually Y. Then I investigate what thoughts/assumptions caused me to arrive to X as the answer and rewire my thinking/logic for the future. Create your own methods for learning from your mistakes to help you learn.\n\n&#x200B;\n\n&#x200B;\n\nRegarding internships/jobs/interviewing\n\n* **\\*\\*\\*Apply to that company even if you think there's no chance you'll get it\\*\\*\\*.** Never write yourself off from a company because you think you won't get past the resume screen or you'll bomb the interview. That decision is for them to make not you. Even if you bomb the interview, you now have data on what kinds of questions you can expect if you apply in the future to better prepare. The year I got my first FAANG internship, I was rejected/ghosted from all the other 80+ local and big tech companies (many of which were far less competitive). I was already on Christmas break expecting to go back to classes in a few weeks when I unexpectedly got my only offer. Apply, apply, apply.\n* IMO the two most difficult things about interviewing are your resume and communication skills. It can be difficult to objectively critique your resume since you're essentially picking which things you wrote about yourself don't meet the bar. Critiquing your communication during an interview is also difficult because you're focused on answering the question, not seeing if you are communicating well in real time. Get your resume reviewed by a few trusted sources and do some mock interviews to find potential issues with your communication habits.\n* **\\*\\*\\*You can do everything perfectly and still not get the job\\*\\*\\***. This is one of the hardest things I've had to come to terms with. I've had many interviews where I thought I nailed every question and got rejected after. I'd spend days after questioning myself and why I didn't receive an offer. Unless there was some glaringly obvious issues in communication or implementation, you probably did just fine. There are so many factors that are out of your control (interviewer was having a bad day, position got filled, your communication style didn't fit the interviewer, etc) that dwelling on the why can be counter-productive. Interviews are flawed by nature so don't spend too much time reading between the lines for things that aren't there. Do you best, reflect if there were big mistakes that you could improve on but move on to the next interview.\n* **Getting a job/internship is a numbers game**. Going off the bullet above, you will be interviewed by people you get along with and people you don't. There will always be things you can't control that can prevent you from getting the offer. You'll get questions that you aren't strong with. Just doing more interviews increases your chances of everything aligning for a great interview.\n* Learn what leetcode is and use it early (I understand there are large amounts of companies that don't ask leetcode-type questions but most competitive companies do nowadays). Use leetcode to reinforce your understanding of algorithms and the pros/cons of data structure to understand when they are useful. **Do not use leetcode to memorize questions**. Using leetcode to memorize questions for certain companies is IMO a waste of time because the chance you get that question is very small and memorizing often times does not equal understanding. If you have solid understandings of most data structures, coming up with solutions to new questions will be must easier.\n* Good interviews are where you work with the interviewer to build a solution. A beginner mistake is to think you have to walk through a whole solution by yourself. Part of the interview is to see how well you communicate with others engineers (the interviewer). I always work with the interviewer during the question. When I'm making a solution I'll usually say \"I'm thinking of doing X because of Y assumptions. Does this sound reasonable to you?\" or \"I can't think of a good solution to X because of Y. Do you have any ideas where we can go from here?\". Your interviewer wants you to succeed and is there to help you and point you in the right direction if you get lost. Don't neglect the interviewer as a source of information since it also shows you're a good communicator.\n* If I didn't say this before, you'll get bad interviewers. It happens, move on. Some of the advice above might not always apply because the interviewer is not cooperating or is doing a bad job. Realistically there's not much you can do to salvage this situation so just move on.\n\n&#x200B;\n\nThis is most of what I can think of off the top of my head. Hopefully this helps! Feel free to ask other questions and I'll do my best to answer them.\n\n&#x200B;\n\nEdit: I forgot to add that luck plays a big part in getting a job/life in general. I have no side projects and don't think of myself as a genius coder. I consider myself to be very lucky that I got my foot in the door with my first FAANG offer. Keep trying til the odds are in your favor.",
        "permalink": "/r/csMajors/comments/jhjuu1/advice_i_learned_or_wish_i_knew_from_a_college/",
        "comments": [
            "this is a fantastic post, but especially your point about\n\n>You can do everything perfectly and still not get the job.\n\nrejection in anything fucking sucks but it's important to remember that not getting the job doesn't mean you were a 0 out of 10; you could have been a 9 out of 10, but someone else who interviewed might have been a 10 out of 10 (in the company's eyes). it doesn't mean other companies won't be eager as hell to have you, though. :)",
            "thank you for this! :))",
            "I'm gonna add to this: I'm a freshman and I had 0 CS experience. I came into my into to java class where a whole lot of people knew C++, python etc. They would all be the loudest in the class and make me feel really really dumb. Guess what, most of them are just loud; not smart. They were the ones who later asked the 'beginners' for help.\n\nDon't treat it as a race, especially as a freshman. Enjoy the learning curve and the process",
            "Thank you so much for this",
            "Been feeling burnt out recently.. have a mock interview tomorrow and spent the whole weekend trying to finish a school project and am exhausted. Needed to hear this, thank you a ton",
            "Thank you so much. I have been feeling a bit desperate lately because I feel like I put in so much work but accomplish nothing. It's good to be reminded not to compare ourselves with others :)",
            "This is great, thanks so much for this!",
            "Thank you so much! I needed this.",
            "Bro you rock! Thank you for this!",
            "Thanks!",
            "I’m going into CS in January! I’ll try my best to follow these guidelines. Awesome post by the way.",
            "I would add to seek out advice early on, though know how to filter them and find good mentors",
            "New mantra: Keep trying till the odds are in your favour",
            "I wish I had a free award to give you. Good effort put into this, I know many students will benefit",
            "Needed this. Thank you",
            "Thank you!",
            "we really need more of these. thanks :)",
            "Nice write up!",
            "Thanks for this. I've been having trouble lately with grasping material and have been thinking if I'm cut out for CS. But things are starting to go up, I hope. :))",
            "Thank you, I’ve been sending a lot of applications but haven’t gotten a single interview yet, hopefully things will get better soon",
            "Thanks. I wish I had read this as well. One thing that id like to add is get mental help if you need it. \n\n\nIve always had major anxiety ever since I was a kid and I didnt address it up until I was 24. The result: spending 8 years getting my CS degree and failing multiple classes because it was overwhelming, and not networking with peers/professors because I was afraid to talk to people.",
            "Most of this is useful life advice regardless of field, not just for CS people. Definitely worth sharing with non-CS friends as well.",
            "This is so encouraging thank you so much a lot of us needed this rn. This really made my day.",
            "5 internships? How long were u in school for?",
            "Thanks I....really needed this. Had a complete breakdown last night, ready to drop out because after hours of reading stack overflow and googling stuff, feels like I've made no progress. Took my brother who's an engineer to get me to stop freaking out. This post helps a lot. I still feel like I have to work 3x as long to make code that works 1/3 as well, but hopefully it goes away. Thanks",
            "Thank you for this. Programming has never come naturally to me and I tend to feel really insecure when I feel like other people in my class find it easy. I just need to focus on my own path.",
            "Did you intern during fall or spring semester ?",
            "This is very needed right now! Thank you u/SongNinja.",
            "Great post. Thanks for all the advice and insights.",
            "This really helps a lot! Thank you!!",
            "."
        ]
    },
    {
        "post_id": "uiafo3",
        "author": "volvogiff7kmmr",
        "title": "the “real” reason why im majoring in CS",
        "url": "https://www.reddit.com/r/csMajors/comments/uiafo3/the_real_reason_why_im_majoring_in_cs/",
        "score": 864,
        "num_comments": 116,
        "created_utc": 1651681528.0,
        "selftext": "the validation whenever someone asks me what my major is and they react with “wow you’re so smart! i could never do that”",
        "permalink": "/r/csMajors/comments/uiafo3/the_real_reason_why_im_majoring_in_cs/",
        "comments": [
            "LMAOOO\n\nTbh I think maths majors are the smartest. \n\nCS and engineering majors are “clever”, in that they are good at using the resources available to build, create, and innovate.\n\nBio majors are “hardworking”, in that they may not be super deep thinkers but know a lot of things on a surface level and spend a lot of time to memorize a lot.\n\nBut maths majors.\n\nThose people scare me. The level of abstract thinking you need to get to do well in upper level mathematical logical thinking is insane imo.\n\nI once met a grad student studying maths at Berkeley. Low key scared me.",
            "the real reason I was majoring in CS is that for a foreign student, CS is probably your best bet if you want to stay in the US after graduation. Get a job, get employer sponsored h1b, green card  etc you know.",
            "Did a physics undergraduate and switched to cs during my masters. Physics has given me major PTSD so I'll give this round to theoretical physicist. God knows how anyone gets good at quantum field theory still blows my mind.",
            "I told someone I was majoring in CS and they said “oh I love my IT guys!”",
            "I just respond with “neither can I”",
            "Whenever u get that response I go “most people can be successful on some level at CS. Math and physics are a whole other beast.”",
            "[deleted]",
            "Physics majors are just bananas",
            "I did it cause I heard programmers get laid really often\n\n/s",
            "CS major looks comparatively easier than other engineering majors like EE, ME, and AE. Yet CS in highest demand 😅",
            "I am majoring in CS because of money and didn't know what to do after high school. Initially, I wanted to become a chef but being from India and belonging to a particular community that didn't allow me to eat meat, i joined CS reluctantly. \n\nFast forward 3 years, I am in my final year of undergrad, did 2 internships, became the head of web development of my college's IEEE student body, conducted 2 major technical festivals, and going to the US for my master's degree in computer science.\n\nI learned coding during the COVID lockdown because my sister (who graduated long ago) gave me the motivation to learn how to code.\n\nI like to cook but it is not my dream anymore. Things change and people change.",
            "CS is not really the hardest major though lol 😂",
            "I liked using computers and hated my English classes.",
            "When I tell people my masters is comp sci they think I’m a high achieving adult, but I’m just a teacher that hates their job and likes tech and making stuff",
            "I did it for all the women lining up to meet me.../s",
            "[deleted]",
            "This is the reason why I avoid telling people that I am a CS major 😆",
            "No point comparing majors. Each major has a diff focal point. As an individual, need to figure out what you connect with and go with that. Earlier you figure out what you are good at, better off you will be in life",
            "Do people seriously do that? I've never considered CS to be all that difficult a career path. It's just slightly harder to break into since a lot of the stuff you need to learn is tough to do so independently. I'd still classify math, physics, even biology majors as tougher. What we do is closer to engineering so we can easily apply what we learn as we learn it. In other disciplines it's so abstract for most of it that I can never really tell whether I really understood it or not until I got some chance to use it.",
            "Nobody thinks cs is hard anymore, especially in places in europe where they think it’s code monkey stuff. Doctor/lawyer will always be seen as smarter.",
            "I was in PA school before this to become a physician assistant. Before that I was deciding on whether to take an out-of-state acceptance to dental school. I will say that CS is a lot more applicable with immediate results versus medicine which I do like. However, it's a lot less social which I'm not as much of a fan of. I prefer social roles.\n\nWhy CS though? Money, employment, and I'm hoping it helps finance my actual hobbies and aspirations outside of the job itself.",
            "ime physics/math majors are smarter then cs majors",
            "No this ain’t it, it’s money and my childhood dream",
            "sure, but the rest of the student body shits on you",
            "That was me",
            "ha, swap out CS for Physics then! ;-)",
            "Lmao",
            "I get the opposite response, probably because most people I meet are in Finance or Mathematics.",
            "Lol if you live life to get validation from other people then you a cornball",
            "."
        ]
    },
    {
        "post_id": "17b8c7r",
        "author": "Odd_Investigator2150",
        "title": "Seen a lot of successes here recently, here's how my internship search is going",
        "url": "https://i.redd.it/zkw0rsual2vb1.png",
        "score": 860,
        "num_comments": 43,
        "created_utc": 1697682456.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17b8c7r/seen_a_lot_of_successes_here_recently_heres_how/",
        "comments": [
            "For more context, I've aced almost all the OA's i've gotten, though many of them were automatic so it's pretty likely that I just got resume screened after that.",
            "Hey at least the interview didn’t ghost you after",
            "how do you get these charts?",
            "Same situation. I feel like the other sankey posts are a hoax. I don't understand how others could be doing so much better than me.",
            "How to make this visualisation?",
            "Same bro same",
            "Me too. Thanks for not making me feel alone",
            "Personally not a fan of the “ghost category” as maybe some companies take a while to reply, last year I did my OA back in mid October and I didn’t get anything back til December (ended up getting the internship) so don’t lose hope yet, yes a lot of big tech does it early but midsized companies and non-faang companies sometimes take longer to get students/facilitate recruitment!",
            "dude, this looks exactly like what i have going on right now",
            "hiw do you see this data?",
            "This has to be the worst type of chart that I’ve ever seen",
            "The illusion of choice",
            "What’s this vis tool",
            "Finally someone relatable. The problem isn’t doing good on interviews, it’s GETTING one in the first place. I got 3 interviews in 300+ apps but aced all of them. If only people will give me a fucking chance…"
        ]
    },
    {
        "post_id": "157q8rr",
        "author": "None",
        "title": "CS IS ALL ABOUT JOBS WTF",
        "url": "https://www.reddit.com/r/csMajors/comments/157q8rr/cs_is_all_about_jobs_wtf/",
        "score": 866,
        "num_comments": 180,
        "created_utc": 1690146193.0,
        "selftext": "GODDAM EVERYBODY CARES ABOUT JOBS!! NO cs related questions, nothing. Not even meta(Not this meta!) related discussions about algorithmns, architectures or future perspectives.\n\nMan dfck",
        "permalink": "/r/csMajors/comments/157q8rr/cs_is_all_about_jobs_wtf/",
        "comments": [
            "I think r/computerscience is probably the subreddit you are looking for.  This subreddit is more like a r/cscareerquestion junior.\n\nEDIT:  Consider r/compsci also.",
            "[deleted]",
            "\" \"I was never in this for the money. But it turns out that the money was an absolute necessity for me.\"\n-Michael Scott  \"  -me",
            "What’s more frustrating is that people complain about the material they are taught, claiming that it “won’t help them get a job.” You signed up for a computer science major, which, surprisingly, won’t teach you how to be a code monkey. \n\nProbably going to suffer downvotes here but oh well.",
            "[deleted]",
            "\\#1 bag chasing major.",
            "I used to think people who cared about money had it all wrong. This is until I experienced “the real world” and the cruelty of entry level positions in restaurants/warehouses. Now I completely sympathize with those chasing a good, well paying “cushy tech job”. \n\nFuck everything that has to do with working your ass off for 40+ hours per week AND being strapped for money constantly. It’s one of the most humiliating feelings I’ve ever known. \n\nCS is beautiful. I’m all for some more CS related discussion, but I think a lot of us here are trying to escape the bottom ranks of the working class as soon as possible.",
            "Yeah, kinda crazy that people go to college and major in something to then get a job in that major.\n\nHard to understand",
            "Lynbrook High School",
            "It’s up to us to start posting more about actual CS content…",
            "You pay me so I don't have to work for the rest of my life and I'll chat about the theoreticals all you want, until then I need the bag",
            "Complaining about excessive job talk while offering future perspectives as an alternative is kinda counterintuitive, no?",
            "I've been working in industry for almost 6 years\n\nI originally got into the field not for money, but because I was genuinely passionate about programming and the computer science underpinning it. I feel like when this sort of topic comes up, a lot of people who are passionate about CS as a subject will express frustration with people who've joined the field just for a job. Maybe they feel like there's a lot of inauthentic bandwagoners in the field? Not saying that OP feels this way of course, but there are some people who do.\n\nI have to say, if you're not directly interested in CS on its own, and you're mainly just interested in the career/money.. **go for it**! I unapologetically think that it's perfectly fine and understandable to want a high paying career.\n\nMy family was poor when I was born. As I grew older, as I saw my folks climb to middle class and gained stable, modest jobs as public servants. During this transition, I saw the positive effect it had on their lives. I don't have any familial wealth to fall back on. So with that in mind, I care about having a good job, and I unapologetically care about money. Not in an unhealthy, Scrooge McDuck sort of way, but because I genuinely respect that having it is life changing. As they say, money can't buy happiness, but it sure removes a lot of blockers to being happy. So yes, I find it understandable that this is something many people want.\n\nNow, I'm not unrealistic. Anyone who actively dislikes CS and programming is probably not going to succeed. Sure. But I'm not going to gatekeep people from entering this field \"for the wrong reasons\". Because career/money is a *great* reason IMHO.\n\nI have a friend who switched to CS from like Polisci. He's very smart and he would have excelled in more or less any subject, but among all the possible suitors so to speak, he chose CS since it would make him money. And he learned to like it. And now he is no worse than me, a person who was genuinely \"passionate\" as a kid. We are both very comfortable in our careers right now. We will both probably retire early.\n\n6 years later, I am no longer really passionate about CS. I also can't say I \"love\" programming. I find it somewhere between tolerable and enjoyable, but my emotions don't run as high about the topic as they did back in college. But, I don't need passion to do my job well. I don't need to love my job to do it well. It's just what I do.\n\nSo yeah, I guess my point after all the rambling is... I suspect like a lot of people with a good bit of industry experience are just like me. People who used to be \"true believers\", as well as people who joined because CS looked lucrative - after enough years, we're all the same anyway. A lot of us are no longer \"passionate\", but it doesn't matter. So if you don't really care about CS and you just want a good job.. if you're smart enough to learn the CS along the way, you'll do fine probably",
            "I'm in this for the money. Money money money",
            "Implementation is practical as is jobs. If you are hoping for theoretical, stay in academics or atleast in a company who's revenue isn't tied to consumer purchasing.",
            "That's the point of r/CSMajors there are other subreddits for discussion about CS topics. But this is a subreddif for CS majors to discuss college things. Like jobs, classes, internships, etc.",
            "This post made me snort out my coffee thanks\n\nCan I have advice on resume while we are at it",
            "Petition to change this sub's name to \" I am recent grad and I need a job now pls\"",
            "well it’s about the bag in this field. but good to see you’re hungry to learn tho. that leads to longevity in this path",
            "That's because we pay thousands for a degree and expect a return on that",
            "Ain't that the whole point of college",
            "I guarantee most people only care about money. Heck, that’s why I switched over. I don’t care if I’m coding the next thermonuclear bomb timing process, I want my $",
            "Get off this sub and go join tech twitter. My twitter feed is all LLM paper stuff",
            "What is the best sorting algorithm that I can apply to all my job offers?",
            "The irony is if people focused on CS fundamentals, then getting a job would be 100x easier (ex: leetcode is easier if you actually understand algos). Instead, people complain about leetcode 💀",
            "Most people don't pay 30,000 a year for college so they can nerd out on Reddit about things that won't get them cash money quick.",
            "Just cause you type in caps doesn’t make you right, go find another server that talks about these technical topics. #HFTORROPE",
            "Sorry homie but we all grinding for the dollar.",
            "Go to hacker news for better discussion",
            "money money 💰",
            "Its sad",
            "I mean that’s why I studied cs",
            "You’re in the wrong sub bud",
            "We need a /r/CompSciMajorsCareersQuestions subreddit",
            "I'd love to see more CS content. But the internet has sold to a whole group of suckers that they can be software engineers in 3 months and make 6 figures. Our field is saturated with people purely driven by money. Which I don't totally blame them, it's one of the last professions that gives you a middle class status without needing a graduate degree.",
            "There's always [Stack Overflow](https://stackoverflow.com/).",
            "Are you looking for /r/programming sub?",
            "college are for those aspiring to be worker bees and hope to have a superior boss to lord over them so what do you expect they wanna talk about? C students who slack off on school are the ones who talk about what they are actually passionate, in addition to be the ones doing the entrepreneurship and the hiring.",
            "You’ll find those discussions yes. But a lot of people are graduating or coming up on internships, so of course they’re curious. Then you’ve also got those unfortunate enough to not get a job or internship trying to figure next steps because they’re new to the market. Don’t fault kids for being kids.",
            "So, what do you have to talk about?",
            "this isn't stackoverflow",
            "Need to keep chasing da 💰💰💰💰 🏃🏃🏃",
            "Grind for the TC",
            "Start a diy operating systems thread and we can discuss paging algorithms if you want",
            "I need the green pieces of paper (they don’t pay enough in pounds or euros)",
            "I honestly just read this subreddit for comedy at this point",
            "Do you think we do this for fun?",
            "I mean isn’t the end goal a job when you’re majoring in something in college? You can talk about an algo here, but it can also go in a general CS sub. There really isn’t that much discussion around degree plans",
            "Half the people who study CS just do it for the money. Personally, while I find CS interesting I definitely wouldn't be studying it if money wasn't factor.",
            "isnt jobs the whole reason we go to post secondary?",
            "I’m only in it for the Guap man",
            "Bro the bills be knocking on the door..",
            "You guys hiring?\n\nI kid, yeah its annoying af, i contemplate leaving this sub atleast twice a week. It seem alot of the people here aren't cs majors because they enjoy it, they just want a \"job\".",
            "And you don't?",
            ".",
            "Its a joke"
        ]
    },
    {
        "post_id": "1bpl6h8",
        "author": "singing738",
        "title": "Bro wtf 😂 ",
        "url": "https://i.redd.it/2kktlhdiqzqc1.jpeg",
        "score": 864,
        "num_comments": 102,
        "created_utc": 1711594939.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bpl6h8/bro_wtf/",
        "comments": [
            "Don't entertain stupid shit like this lol",
            "\"Bachelor in computer science in computer science\"\nSo do I need a Computer Science² to apply ? How does this work, I need to graduate twice from the same place ?\n\nSurely they didn't ask ChatGPT to write this, maybe that's why they need an expert on writing grammatically correct and error prone sentence to an AI.",
            "For an AI prompt engineer 😭",
            "\"prompt engineer\" is such a silly name lol. Like calling a cashier a \"customer service technician\"",
            "Name and Shame in the works !!",
            "I'd guess it's because the job is specifically for an EdTech startup, where they're likely building tools to help students study for the AP & SAT exams? They probably want to hire people with domain knowledge as well as technical skills.\n\nI don't totally agree with that (not the least because \"doing well at exams\" and \"knowing how to study for exams\" are totally different categories of people) but there's a valid rationale",
            "I will provide a warning here. Don’t waste your time with this GT.School role. I’m assuming it is on the Crossover platform. I passed all of the tests and still didn’t get hired. I think they’re just collecting data, because these roles have been listed for years. It’s a lie. They aren’t hiring. And I heard they make you download tracking software to track all of your activity and spy on you with your computer camera. Not worth it…",
            "Prompt engineering is already a dead hype.",
            "This excerpt screams “I have no idea wtf I actually need”",
            "With all these non sense AI + ML + alien space and what not startups are doing to teach? \n\nThere’s never an upside to those besides getting a certificate or whatever which for hightest of cases have no professional significance. \n\nEven with the AI (and whatever) recruitment platform, what for the love of god are people doing? Just adding noise to the chaos of filling more forms, creating more profiles, clicking apply buttons at more places. \n\nThese companies should get a hold on themselves",
            "I'd apply anyways but cut them off halfway through the interview and start asking THEM questions.\n\nWhere is the value in what I'm doing? Like how are we going to make more money by me working here? What the fuck is this job really?",
            "Uh is there even such thing as a ML bachelor's?",
            "I work in edtech, took a look at their web site…. It took me 20 minutes to figure out what they actually do, something doesn’t pass the sniff test here. Feels like a bunch of tech bros trying to “disrupt” the education world and slapped AI on a website",
            "This is some retard shit…",
            "I have that even though I’m not from US nice",
            "Lol this is like the Canonical recruiting process where they ask you to answer 9 questions about your high school accomplishments, even if you’re applying to a senior role",
            "I wonder if there’s a subreddit for bad job postings. We need to name & shame and hopefully have companies scared they’re going to get blasted",
            "Let's take a shot every time you see the word \"AI\"\n\n*wasted*",
            "Usually hiring exclusively from ivy leagues accomplishes the same thing anyway. \n\nThe difference with this seemingly odd requirement is it is more inclusive to poor people who are forced to go to a state school/community college. \n\nNot saying it's a reasonable requirement btw.",
            "\"Ai Prompt Engineer\" is the worst thing I've ever read…",
            "Lol... That's the only 'skill' I have in the screenshot shared 😂",
            "2300 SAT lol - back then you could get into Ivy Leagues with a lower score than that.",
            "Lmaooo these startups are hella desperate😂😂",
            "Even ai can't score that 🤣",
            "Wonder what the pay rate is, hope it is 1500+/2300+, or else that would be emotional damage.",
            "Isn't a 1500 SAT score the 99th percentile?\n\n> Banned from proompting // reason: did not test well enough in high school",
            "Daily meetings?  \nfuck no",
            "That Boolean logic will not give them the correct outcome",
            "I got a 1450 am I cooked",
            "Atleast they arent asking 500k advance to fund the business",
            "This “start up” is doomed to fail.",
            "“AI prompt engineer”",
            "It doesn't specify \"some\" or \"all\" for the AP scores of 5.",
            "This sounds like it’s a “Startup” by college freshmen.",
            "What does a prompt engineer do exactly",
            "![gif](giphy|13st3p22s9qD6M)\n\nMe and my teammates at our prompt engineering job after we find out we all scored 5s on our APs",
            "That’s fucking insane 😭",
            "Fairly certain it's a scam. Their application has been up for almost a year now and you have to submit official ACT and SAT transcripts to submit it. I was applying to it with a Masters in Comp Eng and a thesis in AI (was desperate for a job at the time) and ofc I didn't have those documents anymore lol",
            "Elon Musk actually asks for SAT scores for Tesla and NeuroLink applications",
            "This is for the GT School, an EdTech startup owned by Joe Liemandt and ESW Capital. Even if you got this job you’d likely be fired within two weeks.\n\nAll ESW Companies I know of have a “fail fast” program where the goal is to fire as many people as possible in the first two weeks under the belief that you “aren’t high quality”. From those making $10/hr to VP/SVP’s, nobody’s job is safe, and two ESW Company CEO’s have told me they aren’t sure they’ll have a job at the end of each week. You will never get feedback (ESW doesn’t believe in feedback) and if you don’t perform you will be fired without warning.\n\nI was a VP there at 3 different ESW companies for a total duration of almost 3 years (the average VP tenure was 7 months when I was there) and I was fired with one weeks notice.\n\nMy recommendation is that any of the companies I list below should be treated as temporary jobs. You may have them, and they may last you a long time, but I literally didn’t even try to learn some other VP’s names depending on the company because I knew they wouldn’t last.\n\nESW Companies include:\n-Crossover\n-Trilogy (The COO and two EVP’s are some of the worst people I’ve ever worked with)\n-Aurea\n-IgniteTech\n-GFI Technologies (CPO was fired recently)\n-Skyvera\n-Coppertree.io (btw their CEO and COO were fired last year, along with almost their whole exec team)\n-Versata\n-Alpha\n-GT School\n-DevGraph\n-DevFactory\n-Think3\n\nEverything I say applies 100x if the job is working for Trilogy. Good luck with that lol.",
            "Dude I saw this!\nLike what!? You have a degree it don't matter",
            "Prompt “engineering” is a joke",
            "Don’t see anything wrong with using standardized scores to filter, no different from using school GPA. That said, this is a stupid job.",
            "I got my resume selected for one role and they asked me my School & college historic 😂",
            "you know what’s scary is after working for a bit I have started applying again and the frequency of postings asking for high school success is like 10x what it was a couple years ago. I hope that companies don’t start using “were you a genius in high school” as a barrier for entry.",
            "LMAO THIS IS THE ONE JOB IM AN IDEAL CANDIDATE FOR",
            "I really dont know what goes through their head when they make job postings",
            "I saw that exact same job offer and didnt apply",
            "Yeah , go ahead and laugh about it :)\nIt’s the reality guys, I know a tech savvy copywriter that wrote a program using prompts and it’s production ready brings a lot of value to a specific field… it’s a game changer deal with it"
        ]
    },
    {
        "post_id": "17xsqsa",
        "author": "PlusLawfulness298",
        "title": "Oversaturation in CS in a nutshell",
        "url": "https://www.reddit.com/r/csMajors/comments/17xsqsa/oversaturation_in_cs_in_a_nutshell/",
        "score": 861,
        "num_comments": 177,
        "created_utc": 1700264750.0,
        "selftext": "A recruiter for a startup I interviewed for told me that they initially had only 100 applicants in their pipeline (me being one of the early ones), but then their job posting somehow made it onto the public Github new grad posting. In just 3 days they said they recieved over 50,000 applications... JUST 3 DAYS.\n\nIt fucked me over since she made it clear they had a lot more applicants to consider to now and filter through. so they had me wait another 3 weeks despite having finished the final round with a pretty good performance, until they reached back to me to tell me they hired other developers... \n\ntldr: I'm hate these fucking Github postings that everyone and their mom has on 24/7 eyewatch since it literally encourages mass applying, more oversaturation and fiercer competition in an already bad market. why do they exist, wtf?? do people not realize how much more RNG they make the process by posting it publically for hundreds of thousands of people? \n\n&#x200B;",
        "permalink": "/r/csMajors/comments/17xsqsa/oversaturation_in_cs_in_a_nutshell/",
        "comments": [
            "50,000 applications? Is that a remote-only position? Those always receive a ton of applications and IMO aren't worth applying to as a Junior anyways.",
            "how tf is a recruiter going to filter out 50,000 applicants?",
            "The recruiter is not doing a very good job if they suddenly make a schedule change for people who applied early.",
            "Being a junior developer now is _so much more difficult_ IMO then it was when I started in the workforce in 2014. \n\nI haven't looked for a job in like 7 years. Recruiters message me, if I'm interested I interview, eventually someone is dumb enough to hire me ;)\n\nSeriously though, it has seemed to get significantly more competitive and the bar has raised a lot since I was a junior.\n\nI will comment that I would _never_ apply for a job from GitHub. Such high volumes of applicants... \n\nMost managers I've encountered can barely manage anything more sophisticated than taking a dump.",
            "There are around 125k CS graduates a year in the US.  Only FAANG gets 50k apps.  I think your recruiter is exaggerating.",
            "There are a ton of international grads ( mainly masters students) that were lured in by the gold rush of 2021 \n\nTheir stay in US , loan payments and perception of self worth ( unfortunately ) is tied with getting a job in America ; so they mass apply to all applicable jobs",
            "Imagine how competitive the compensation is going to be when you have 50k applicants",
            "I have spoken with several recruiters over the past few years and I'll guarantee you that at least 95% of those applicants were completely unqualified for the position, assuming it was a new grad position in the United States.  \n\nSome try to lie about their employment eligibility and citizenship throughout the interview in hopes to feel impressed the interviewer so much that once it's disclosed that they need a visa the interviewer will fight to get them one, which almost never happens.\n\nA huge portion of those folks are going to be people who don't even live in the United States and /or don't have authorization to work in the United States.  Another group is going to be folks who don't have the qualifications for the job. This is a new grad position but I guarantee you you're going to have a ton of people applying from boot camps and self-taught.\n\nThe biggest problem with this is that it's going to slow down the recruiter if he doesn't have a good way of filtering out all of the undesirable candidates quickly. A recruiter's job is to find the small selection of candidates that can be sent to the hiring manager for interviews.\n\nDid you ask him about what you could have done to stand out for that position? What are the things they look for?",
            "Used to run a student and grad program (well, about 8 programs) for a large tech firm in Ireland. We got about 13,000 applications A YEAR for our main graduate stream. The idea of getting 50,000 in such a short space of time is ludicrous. \n\nAnd if anyone is wondering, we didn't use AI or any suc automatic filtering. I went through each one. Incidentally, of those 13,000, we hired 100.",
            "Yes but 99+% of those applicants are crap.\n\nIt is totally **not worth** posting jobs to public boards like github (or Reddit subs) because it requires too much effort to wade through them.\n\nIt's almost always better to just outsource it to a recruiting specialist.\n\nI cannot overstate how absolutely worthless most resumes are that come from postings like that. Most of them don't even read your job description at all, much less pre-qualify themselves.",
            "how tf is that possible are they really gonna check 50k apps? in a short period of time😭",
            "As an ex-recruiter I can tell you confidently that it is their problem. I worked in sf bay before covid and sometimes when a job was posted for a while there would be thousands of applications really quick and that simply means you just pick enough really good ones to interview and most others who apply later just have to be wait in the pipeline and probably never been seen at all cuz we have to balance out the time we spent in each position. And that’s why timing was always an important factor.",
            "It’s not *really* oversaturated.\n\nThere’s been a saying for years that I’m going to butcher about for every open CS role in Silicon Valley, recruiters get resumes from the same 90% of applicants.\n\nFor roles that I’ve personally hired and done resume screens for, this seems to be the case. So many applicants don’t read the job description and just fire off applications in the dark. \n\nFor mid-level roles with specific requirements, we’ll get *hundreds* of junior candidates with “deep technical expertise”, yet their most impressive project is a to do list. They ignore the specific asks in the job description.\n\nYour recruiter did you wrong, but in a way, also did you a solid. Only toxic companies optimize for the very very best candidate out there. Decent companies have their hiring bar set, and will hire the first candidate that reaches that bar.",
            "[deleted]",
            "Peter Thiel says \"competition is bad\" and I fully agree with him on this. It will only lead to frustration when you have to compete with hundreds of people for one job. It's enough if there is just one person in line who is smarter or more eloquent to lose the game.",
            "Ok I think you tell the recruiter you will write some code to make all 50,000 compete in a version of digital squid games for the job.  \n\n50k is crazy.  For real though if the school program isn’t managing placements for new grads this is what happens.   Greedy fucks take 150k for about 2000 hours of training. Then don’t endorse you to employers? Like that should be part of the schooling. I shit you not this was a service in our high school.  College should be better.",
            "Make LeetCode 100 a hard bar and half of them will be gone.",
            "🧢",
            "There could be a clear nationality/ethnicity pattern. A concerning trend is that it seems a new ethnic-based hegemonic streamline is formed in IT to exclude all \"others\".",
            "pretty good performance? it wasn't probably that good since they hired somebody else OP, maybe not a saturation issue, but skill issue",
            "[deleted]",
            "Would someone mind linking the repo of one of those link aggregators?",
            "It's not right that they made you think you had a good chance to get to the final round, but then they looked for more people and didn't choose you. That must be really upsetting. So, the *important* thing to learn from this is that it's a good idea to apply to several good companies.",
            "so in other words you want jobs to go to the best connection rather than the best candidate. You call it \"RNG\" but 1) it really isn't, more information means it's more likely the best candidate is found. 2) even if it is RNG, the alternative of only those having access to links applying will mean the best connected will find it rather than the best candidates.\n\n&#x200B;\n\nMay those githubs flourish.",
            "It’s just people applying to apply, doesn’t mean they’re CS majors. In 2021, only 59,000 in America had a CS degree, again just people wasting time or boot camera LMAO tryna get in a SWE position",
            "People on here think the issue is with your resume, or you must be a shit developer bro. Grind leet code bro…\n\n\nSeriously people need to stop copping and get other jobs in the meantime. This shit is crazy bad… 5 yoe here",
            "When these new CS majors proclaim themselves to be intelligent yet create a problem for themselves on the regular 😂"
        ]
    },
    {
        "post_id": "193ljy4",
        "author": "clangprime",
        "title": "I received a congratulatory email about my supposed offer from a university recruiter for a company I applied to. The issue is the company never interviewed me and rejected my application back in September.",
        "url": "https://i.redd.it/xhimegkzxobc1.jpeg",
        "score": 853,
        "num_comments": 38,
        "created_utc": 1704926555.0,
        "selftext": "I still don’t have an offer yet for this summer how can I gaslight them into giving the position for real",
        "permalink": "/r/csMajors/comments/193ljy4/i_received_a_congratulatory_email_about_my/",
        "comments": [
            "\"Thanks for your kind words! I seem to have lost the original offer email, could you resend it?\"\n\nez money",
            "I got the same email and asked them to call me, they replied with this\n\nhttps://preview.redd.it/lwcloq32cpbc1.png?width=1283&format=png&auto=webp&s=897e236025f105d431a99c7319bfbbb4f6475bdb",
            "confirm it’s not a scam before you do anything, but if it’s not a scam and you are certain then run with it. worst case is they realize the error and let you go, but thats just where u are now anyways so",
            "do it",
            "I am assuming they got your name correct, is this company legit? Also is this same recruiter who sent the rejection mail?",
            "This is KPMG, i got smae thing its a glitch",
            "Keep us posted",
            "Yes, this was a system error on KPMG's part. I wonder how many emails were sent out, they already sent an apology email.",
            "If you're certain this is from the same company, try to see if you can get an offer letter. It could be that this email is a mistake, but it also could be that your earlier email was the mistake.",
            "Way your pros and cons, can you fake your way in and what are the downsides to doing so?",
            "Automated email glitch",
            "Take what you get.",
            "I wouldn't be surprised if you receive a follow up email saying they sent this one by mistake. This feels like some kind of automated email that was sent with the wrong filter.",
            "Accept it anyway",
            "the amount of people thinking this person has a chance at getting a job they never interviewed for, because of an email glitch, is insane",
            "Definitely a scam",
            "Email them the screenshot of your rejection so they feel bad lol",
            "Just show up on Monday.",
            "Fake it till you make it, bluff your way in there",
            "This happened to my sister for a retail job that she ended up accepting and a few weeks later her “recruiter” was fired, wonder why… 😬"
        ]
    },
    {
        "post_id": "19awkcu",
        "author": "Fluffy-Reveal-8128",
        "title": "International students have the worst situation",
        "url": "https://www.reddit.com/gallery/19awkcu",
        "score": 854,
        "num_comments": 351,
        "created_utc": 1705705438.0,
        "selftext": "The reason why allowing the job postings got like 3000💀",
        "permalink": "/r/csMajors/comments/19awkcu/international_students_have_the_worst_situation/",
        "comments": [
            "They're mostly done by IT companies that engage in mass recruiting drives. The salary is horrible and barely enough to get by in a big city. We got our independence in 1947, but the bureaucratic setup, corporate setup, urban infrastructure and planning, public transport etc are designed to remind the common folk they are cattle fodder and put them in their place. It still alarms me when the rich kids in Mumbai use the Mumbai Local as part of their \"day in the life of a pleb\" checklist and romanticise the act of an overcrowded transport system that dehumanises human beings to a horrible extent",
            "I’ve heard a lot of jobs are like this in India, not just CS. I follow dental forums (don’t ask) and I read posts about how many people are dental students there and it’s like this picture. BUT, I could be totally wrong. It’s just what I read about online.",
            "Man whenever i feel sorry for myself I remember  India exists and suddenly all is well again .",
            "India is very cutthroat from the very start of your education. My parents told me how they had to go fight to get me into a good primary school so that I could go to a good upper primary school (thankfully we moved to America cause ya boy dumb af). \n\nI still have a friend, a son of one of my dad’s college friends, who while in his high school years was learning stuff I was learning in my college senior courses, and that moment is something I’ll never forget because it made me so grateful to not have to grow up there.",
            "India is the worst spawn point",
            "Yes I am fucked👍",
            "This looks like the placement exams for college in India",
            "And is this why I should not pursue CS? Seems like I'm really really late to the game",
            "It would be super interesting to see the stats on how many are actually qualified, I’ve met some super smart visitors and also some that made me do all the work. If all 3 k are top qualified this is terrifying",
            "[deleted]",
            "Op do you have any idea what company was that?",
            "If the floodgates open it’s over for everyone lmaoo",
            "So glad I wasn't born there",
            "Is this real??",
            "These look like domestic Indian job postings though. So not really international students since they aren’t in the US",
            "Sometimes, I wonder, what heinous crime I must have committed in my past life to be born in this cesspit of a country?",
            "Hard lobby",
            "this should give you an idea of the whole cs field in general only those who can are on par with the industry demands get in what you see here are average dudes",
            "This looks like IT is coming to normality.\n\nNormality I mean in next 5 to 10 years salaries will be similar to average office professional job.\n\nMy kids won't work in IT for sure.",
            "90% of them will get filtered after they’re asked a basic CS related question. The ones that aren’t absolutely trash aren’t queuing up for this shitty company.",
            "Context - basically india hires mostly developers from btech then the layers. Are IIT- cs departments, IIT non cs departments, \nBITS , NIT , cs departments and non cs departments, \nother tier 1 Universities. Roughly 200000 students here.\n\nThen tier 2 colleges \n\n\nTier 3 colleges.\n\nThen they hire BCA , MCA\n\nThen BSC in computer science \n\n\n\n\nSo you can see that the competition is cut throat you have to work really fking hard at age of 17, 18  to get into University and then 4 years in college.\n\n\nOtherwise you have to struggle for next 6-8 years",
            "Could the comment section be anymore racist?",
            "I am from India and the situation is only scary if one is a stupid.   \nAsk them Two Sum and 90% would be filtered out, ask them what is linkedlist/hashmap and 50% would be filtered out !!",
            "Reason why my 7 year old cousin in India dreams about getting into IIT ( MIT of India) rather than playing Roblox.",
            "This shit demotivated me a lot. I'm not going to have a productive day today because now I'm feeling depressed.",
            "!remindme",
            "Pretty damn scary.",
            "Bhai lag rha bahut badi galti ho gayi iss domain ko as a Career le liya",
            "These are not international students, the job postings are domestic.",
            "Now it's a bit more understandable why many indians are going abroad",
            "[deleted]",
            "[deleted]",
            "Maybe it’s the billions of people?",
            "I know it smell crazy",
            "Population control is the only solution. No Govt. can provide guaranteed jobs to as many people as in India. Not even if there are many skilled people",
            "When did this become a big problem? Y’ll gen z snowflakes can’t face competition and want everything on platter. \nI wrote aptitude test with 5500 ppl of which 400 qualified for next round, and 200 got the job.",
            "Imagine the smell",
            "Dance little monkey, dance.",
            "Which year is this from?",
            "Oh yeah, I saw this happening in real life. It was not cool…",
            "damn these pics should be posted on r/recruitinghell subreddit 😯😭",
            "Is it like this for all careers in India? Or is being a software engineer in India like everyone’s dream job?",
            "I don't think many people on this thread understand. Most of the people born in India are born in extreme poverty. Poverty to the point which Americans cannot even imagine.\nGetting a job that pays 300 usd a month is still a very deal for these people.\n\nIf you're looking at this and smiling or laughing at the terrible situation, thank whoever you believe in that you didn't have to go through this.\n\nAnd people make it. A lot of times from this exact point to Silicon Valley. If I saw one of these people making it to Silicon Valley I would have the utmost respect for them. This is the real bottom where people start from. Still funny that Drake's definition of poor is to be stuck in traffic."
        ]
    },
    {
        "post_id": "yujegi",
        "author": "DungPornAlt",
        "title": "How do you control the urge to completely destroy the company's codebase and database at work every day?",
        "url": "https://www.reddit.com/r/csMajors/comments/yujegi/how_do_you_control_the_urge_to_completely_destroy/",
        "score": 852,
        "num_comments": 105,
        "created_utc": 1668384670.0,
        "selftext": "I have been working at my current company for a year now, it's a pretty great company, good TC, good WLB, and its in a sector that's largely unaffected by the layoffs caused by the recession so far, and my boss promised me a raise and a promotion soon. On paper this is a very good position, however, I can't help but have the urge to completely destroy the company by wiping out our codebase, then the database, then the back-ups of everything etc. I've already tested the response time of my colleagues by pushing a small bug to production, it took an hour for someone else on my team to notice, which is more than enough for me to delete every thing and wipe the back-ups. I've already wrote the BASH script to do the former, which I placed on my desktop. I like starring at the icon for at least an hour or two per day because it's so captivating, the thought that a decades old companies can be destroyed in minutes, hundreds if not thousands of people will lose their jobs, and the stock price will goes to zero all because of me, it excites me, gives me thrills I can never imagine.\n\nAnyone having the same issue as me at work? How do you cope with it?",
        "permalink": "/r/csMajors/comments/yujegi/how_do_you_control_the_urge_to_completely_destroy/",
        "comments": [
            "Patrick Bateman but instead of NYC it's Silicon Valley",
            "Bring that up in your next salary negotiations",
            "Oh yeah, can definitely relate. I worked in a team with sudo permission for the ENTIRE fleet. The untold chaos I could have unleashed...\n\nI've attempted to contain it. But with every passing day, my fingers edge closer to \"sudo rm -rf /\"",
            "You doing ok?",
            "Call of the void",
            "Tell us which company it is before you do it. We'll out our life saving into shorting the stock and become multimillionaires 🤯",
            "The equivalent of the urge to veer into oncoming traffic/step off the train platform/other “call of the void” intrusive thoughts.",
            "My brother in christ go to therapy.",
            "NTA Divorce",
            "NTA your urges your rules",
            "NTA get that promotion",
            "The power to destroy something is the absolute control over it. It is the intoxicating power of a SWE at a mid-tier non-tech focused company where changes to the codebase don't need to be approved before merging",
            "Do it and tell us the story next Sunday",
            "If you want to get sued & get charged with a Felony for a CyberCrime go ahead.",
            "let your intrusive thoughts win homie",
            "Before you do it, DM me the company so I can buy some puts beforehand.",
            "I have OCD. I deal with these intrusive thoughts from time to time. The best thing to do is to just realize it's stupid to think that and ignore the entire thought.",
            "I've never had that urge because I'm a normal human being",
            "Programmer's call of the void",
            "seek help OP",
            "The thought of federal prison for the next twenty years and a bar from working In tech ever again is enough to disuade me",
            "how is it even possible assuming you're working at a large company, and there are quite many rounds of code reviews and automatic procedures that run and check your code? yes, code review is still done by other engineers and humans make mistakes but assuming you're a new grad, people always pay extra attention to your code?",
            "You’d probably be sued or go to jail sooooo, a temporary satisfaction wouldn’t be worth you ruining your entire life over",
            "Go take some psychedelic mushrooms. Either you’ll end up realizing your thought patterns are all kinds of messed up, start enjoying nature, find a new purpose in life and become a happier person in the long run, quit your day job and dedicate yourself to spiritual enlightenment journey among monks in the Himalayas or Nepal… or contact some long lost friends, family and even love interest, begin appreciating the simpler things in life and let go of  addictive tendencies for a better future, [buy a log house in the woods and a small acre of agriculture to lead a simple, self sufficient, trad life with the bare minimum to live peacefully and watch the birds sing.](https://youtu.be/6cqVFvDER9Y)\n\nOr you’ll say “fuck it nothing matters anyway, YOLO” and press the nuke button one day. Then all shit cuts loose, all shit hits the fan, and someday… in one way or another, you find yourself with the shit being propelled right back into your arsehole. As they say: shit that goes around, shit that comes around. Like a boomerang. Somebody will find out, trust me, and shove that shit so far up your arsehole that you won’t even have the time to protect yourself with a legal butt-plug. \n\n/s\n\nFor real though, love of absurd humour is not always a bad thing. But it can become a problem when you are so  knee deep into meta-irony that reality becomes sort of “fused” with fiction, as it would in a kid’s mind. Losing all sort of deeper meaning in one’s life can be painful when one gets older, unless you become like Ricky Gervais or George Carlin or something and manage to overcome depression and loneliness at the 50~65 age period by doing good standup and being a successful artist/comedian who heals his pain and trauma through creativity and public accolades. Or like Eric Andre or Filthy Frank, manage to make buckloads of money through hilarious absurdist TV shows or YouTube videos, which plenty of hormonal teens and even “sophisticated” adults enjoy from time to time today, including myself… then retire fondly in your 40s on a pile of unlimited money, whilst having the rep of “MTV-like jackass superstar” or something even as you get older. Which is both a blessing or a curse, depending of how you look at it. It does guarantee you some sort of life-long sex symbol status in the crowd of people who used to be “punk rock” and “anarchist I’m-not-like-other-girls/guys” growing up, so there’s that. Unlimited goth-ussy, if you will.\n\nIf you’re not entirely shitposting… go to psychedelic therapy if you find yourself so overwhelmed with impulsive thoughts, self-destructive thoughts, being addicted to absurdism in all spheres of your life and shit. It’s more akin to an addiction to the rush (dopamine+noradrenaline+endorphins) rush of thinking of doing it… than actually doing it. It’s like that urge I had to watch apocalyptic/end of the world movies when I was a kid, I don’t know why but watching tons of humans grovel like ants and run everywhere, with the tornadoes and water rushing in from all sides, just the feeling of complete and utter chaos… it gave me an extreme rush of morbid curiosity, adrenaline, endorphins and intensity like nothing else. It’s fun to watch, not fun to actually be in.\n\nElse go and train in something like wall climbing, parachuting 🪂, circus acrobatics, fire spitting, bungee jumping… plenty of extreme/intense activities out there which, when trained for and done properly, don’t come with the chance of disastrous consequences. Most of the time, 99.99% of the time it’s ultimately safe while giving you the rush… but hey, better than it being 100% chance of it failing and getting you knee deep in the shit that is legal precedent to outlaw criminal la-la-land, like the scenario you describe. Jail ain’t no fun unless you’re into a 10th hole in your body in places you didn’t think there could be one.",
            "Intrusive thoughts",
            "the absolute knowledge I will not get away with it. they will easily know its me then I will have to pay lawyers in a case I will lose.\n\nAt minimum I will pay damages and at maximum alot of prison time.",
            "ngl kinda had the same intrusive thought at my internship once",
            "Ayy lmao",
            "When you feel ready, start your own business.  It seems you want to work for someone else.",
            "I know the feeling.  I get that every day during my job in a minueman missile launch control center.  So insecure, why you could end the world just by...\n\n/S\n\nThough allegedly some generations of ICBMs WERE highly insecure.",
            "Imagine encouraging op to do it only to see yourself jobless next week",
            "Just do it.",
            "I suggest you go ahead and do it. This will have two benefits:\n\n1. It will be an effective test of the company's disaster resilience plans\n2. Your coworkers will have a healthier work environment after you're gone",
            "Every day we stray further from God...",
            "Not funny or entertaining, even on a Sunday.",
            "Tell me the company before you do so i can become rich",
            "Honestly I really really wish someone would do this to a soulless Insurance company, or even better a debt holdings company.",
            "😂 terrorist",
            "Getting some Fight Club vibes",
            "Get help, mate.",
            "Let me know where you work so I can load up on puts",
            "I like to edge and just delete and recreate a demo database from a production back up over and over.",
            "Can you send me the script? I also want to try.",
            "mr. robot vibes",
            "Damn. I can imagine the thrill.",
            "You must execute that script brother. It is the programmatic expression of your will, your destiny manifest in computer software. Unleash it, do not hesitate. The fire rises.",
            "OP having intrusive thoughts but good that he is also self-aware",
            "this ain't intrusive thoughts, this a whole psychopath 🫢",
            "I don’t have access to most of the codebase.😔😅",
            "Im guessing this is a joke, but funny story about a girl at our school. She was doing a co-op and a manager apparently insulted her work so she deleted their code base and i think some portion of their database, then quit. She got arrested because the company called the cops on her and pretty sure she got expelled. I mean funny story for us, not so funny for her",
            "Do it. Do it now.",
            "No pain no gain, keep backups of backups.",
            "But if you do it, you'll regret it like pnut clarity",
            "I wanna see you do it you could be a hero",
            "Wait until layoffs or if they fire you/fuck you over. Then just add a wacky little timer to launch and sit back and revel in your debauchery you scoundrel",
            "can’t wait to watch the movie they write about this",
            "Most sane CS major",
            "I remember there are folks like you, who feel my pain, and know deep in my heart that one day we will rise, show the world what we're capable of and launch a new tech empire that the masses will need to follow because they're too dumb/handicapped by falling into the trap of the rich. We'll be their liberators, we'll restore fairness and law. The government will no longer be needed and we will all thrive in a society focused on facts and logic. /s",
            "Mr Robot vs EvilCorp come to life",
            "You need therapy",
            "What controls the urge, money",
            "I don’t understand accounts like this that just shit post and make things up for the post karma. Sad source of attention",
            "All I can say... wow. Just wow.",
            "He passed the leetcode interview with flying colors but they forgot to do a psych evaluation.",
            "I can think of a few banks where you would be doing the world a service. However, you would probably discover if you launched this that there are offline backups you can't reach. Also, depending on what country you're in, they will lock you up and throw away the key. In others, it might get a bit more physical. Either way, you would never see sunlight again.",
            "It is illegal.",
            "Share the BASH script so we can all do it together",
            "Jesus Christ bruh lmfao \n\nThank goodness I've never had such urges and hopefully never will. Just thinking about destroying so much data it gives me massive anxiety.\n\nWell, my company's prod envs are protected behind several layers of security, so doing something like this would be incredibly hard anyway.",
            "do it king! just tell me what company it is first so I can make some hedge bets",
            "IKR, it is similar to how when you are standing at the verge of a cliff, and for a moment you have this urge to jump , I feel you.",
            "Let us know in advance so we can all short it. Love this post though. Mr robot.",
            "Silicon Valley psycho",
            "The fact that you placed the script on your desktop, assuming this is not satire, speaks of a self-destructive urge. Are you sure your internal success thermostat is not set too low? Seems like you are contemplating how to push away all that good stuff you listed in your first sentence.  \n\nThe subconscious will work very hard to get to where it thinks you should be, whether rich or poor, comfortable or in chaos, in love or alone…you will make your way to your set point if you don’t practice introspection. \n\nSorry to get all deep, but this happens more often than it should to people who don’t know how hard they are on themselves and the struggle never ends. \n\nOf course, as satire it’s funny as hell and yes.",
            "Do it, I dare you",
            "."
        ]
    }
]