[
    {
        "post_id": "1br5ibn",
        "author": "SuspiciousProperty93",
        "title": "Internship search - Had almost given up, then this came out of nowhere!",
        "url": "https://i.redd.it/k8coxod2jdrc1.png",
        "score": 848,
        "num_comments": 85,
        "created_utc": 1711761956.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1br5ibn/internship_search_had_almost_given_up_then_this/",
        "comments": [
            "468 apps for an internship shows you how fucked CS is",
            "I honestly want to see the graphs of other liberal arts majors as well lol",
            "Congratulations, I exactly know how it feels, it came outta nowhere for me as well a week back!",
            "Congrats!! A few years ago when i was looking for an internship and it took me around 150 applications to land one, looking at this makes me realize how times have changed :(",
            "One shot, one kill.\nNo luck, pure skill!\n🫡",
            "CS major is so fucked up",
            "Happy for you!! All the best!",
            "Happy for you and I very much respect your perseverance.",
            "As an accounting major not knowing why this showed up in my feed holy crap I feel for you cs majors on getting jobs I only applied to like 20 internships before getting an offer but you guys make more so",
            "Congrats, it’s a tough job market, I applied for 1000+ applications all rejected, now it’s too late for internship for me, but I guess I’ll not give up and just hope this could happen to me in the near future for full-time job lol.",
            "Congrats!!!!",
            "Congrats man, recently got mine after 309 apps",
            "You deserve it - congratulations!",
            "Congrats! First job is always the hardest to get. It will get much easier for your next opportunity",
            "congrats!",
            "Which company?",
            "Congrats!!! The fact that you pushed through after all those rejections is v impressive!",
            "congratulations",
            "Commenting to read more",
            "\nWhat country did it happen?",
            "Congrats!",
            "If you want a job rn, focus on leveraging real connections, friends with jobs, previous jobs, old co-workers.\n\nI just emailed my old boss and secured myself a nice internship at a company that I like. Stay conservative rn.",
            "Awesome dude. This gives me hope :)",
            "Somehow I'm more interested in how users make these graphs. Can anyone share the tool used?"
        ]
    },
    {
        "post_id": "1atykm7",
        "author": "ten-stickers",
        "title": "Company with 10k employees doing unpaid internships",
        "url": "https://i.redd.it/fpr029sxidjc1.png",
        "score": 844,
        "num_comments": 90,
        "created_utc": 1708275143.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1atykm7/company_with_10k_employees_doing_unpaid/",
        "comments": [
            "What the hell is “are you” doing in that question",
            "I was just about to apply to a company called [Qualitest](https://www.linkedin.com/company/qualitest/) and discovered that the internship is unpaid. I'm surprised to see such a large company (says 10k employees on LinkedIn) take advantage of students :/",
            "Nah, you get paid with experience! 🥰🥰🥰",
            "I just saw it too. Funny how they put “Salary: Unpaid Internship” under “Why Qualitest”.",
            "Worst thing is they still have a selective process even when it is basically fucking charity work. Tech is a joke rn.",
            "I submitted a dummy application and ripped them a new one. If enough people do the same then they’ll get the memo",
            "Name and shame",
            "Name and shame??",
            "As someone who has done two unpaid internships. They suck so much they don’t even care to teach. Also they expect experience which is retarded since they are not paying you. \n\n\nJust did an interview for a company I found on Wellfound. \n\nIt’s started like this\n\nHim:  “just so you know it’s unpaid”\nMe: “ I understand but I am excited to contribute to an innovative idea blah blah blah… I am also trying to gain experience in more backend” \n\n Him: “judging by your resume it looks like you have not solved any real problems” \n\nMe: 👁️👄👁️ i didn’t even know what to say to this but I replied. “ I am a student that is still learning but the problems I have solved I was able to solve completely by myself without any help” \n\n\nPoint is he ended the interview short cus my web dev experience wasn’t enough to work for there “amazing and innovative start up”.",
            "Expecting livable wages and compensation for your work in 2024? Do you think we're some productive technological society or something?",
            "at this point firms are just profiting off students now 😒",
            "Unpaid internships are the worst embodiment of capitalist society, simply diminishing students’ hard work and education. How hard can it be for a company with over 10,000 employees to pay students $20 an hour? Now, it’s getting ridiculous",
            "Prob a bunch of people still willing to do it and they can be picky",
            "Sad part is there will be many desperate people still applying",
            "*sigh* I’d still apply",
            "imo especially with how bad things are at the junior/entry level even unpaid you take what you can get. The experience is way more valuable than whatever money they will pay temporarily, also even if you dont apply someone will just take it you are just doing yourself a disservice.",
            "Can you provide me with the links?",
            "Is this a job board, or the website of the specific company? Also can you provide the link? Some of us really need any opportunity, whatever that may be",
            "Shameful",
            "It seems like they’re UK based? From what I understand it’s way more common for internships to be unpaid in Europe.",
            "Why should they pay for internships if they had 1000 people for 1 vacancy.",
            "but i thought capitalism is awesome",
            "Send the flood man",
            "Uber does one too💀",
            "Name that company.. no body is going to Sue you for it",
            "Bruh they can't even ask the question properly",
            "I tell everyone I know I’d rather live on the street and be homeless than doing an unpaid internship because i would quite literally earn more money doing so",
            "That's a hard pass for me lol.",
            "i’m pretty sure this is straight up illegal unless it’s a non profit",
            "Report that bullshit companies",
            "Just remember everytime you see some stupid shit like this (or anywhere really) it’s because it works."
        ]
    },
    {
        "post_id": "r83pbd",
        "author": "iHammmy",
        "title": "WorkDay is the worst website known to man",
        "url": "https://www.reddit.com/r/csMajors/comments/r83pbd/workday_is_the_worst_website_known_to_man/",
        "score": 845,
        "num_comments": 100,
        "created_utc": 1638550915.0,
        "selftext": "Immediate red flag for any company that uses WorkDay",
        "permalink": "/r/csMajors/comments/r83pbd/workday_is_the_worst_website_known_to_man/",
        "comments": [
            "I don't understand why I can't have a universal account when it comes to job applications with companies that use workday. I have like 10 accounts with the exact same credentials now",
            "What is the point of having a resume auto-fill feature if I have to manually tweak all my experience bullet points anyway?",
            "The last two companies I worked for used it. It's \\*shockingly awful\\*. So if you think the hiring process is bad wait until you get to use it to request PTO, elect benefits, do performance management twice a year. How it's one of the 'top HRIS' systems is beyond me.",
            "My company migrated from SAP to Workday. Its a blessing. I used to cry when they used SAP. Its a blessing internally to use Workday.",
            "Greenhouse/Lever for the win, all my homies hate workday",
            "I was literally filling out an application on Workday yesterday and wanted to just die lol",
            "I've worked on the employer side of Workday and let me tell ya, it's just as garbage as the employee side. Everything about the interface and reporting feels Bush-era. I don't know how much a license for it costs, but it must be cheap because it doesn't have anything else going for it.",
            "At least you don’t get company spam emails for every account you make (or at least I don’t). I honestly hate it more when you have to apply directly on their website and you have to make an account there because then you get company spam emails",
            "the greenhouse application things >>>",
            "Workday as an internal HR tool (e.g., benefits enrollment) seems decent; my company uses it, haven't had any problems. Workday as a recruitment tool, however, is absolutely trash.",
            "Google uses workday 🤔",
            "You are damn right man",
            "Have u seen the application page for AMD? If uve seen their application page, u would wish they r using workday.",
            "To whoever it's irritating to use the workday because it takes so much time to fill the application use chrome extensions like [simplify](https://chrome.google.com/webstore/detail/simplify-%E2%80%93-autofill-your/pbanhockgagggenencehbnadejlgchfc?hl=en) because we cannot change it many top companies use it.\n\n  \nIt helps me to autofill the application in seconds even when the application form has 2-3 pages where you have to do next on each page.\n\nhttps://chrome.google.com/webstore/detail/simplify-%E2%80%93-autofill-your/pbanhockgagggenencehbnadejlgchfc?hl=en",
            "The company I work for uses workday. Why is it bad?",
            "No one seen icims? Or OrangeHRM? My company used those and workday is much better lol\nAnd I hate Taleo too",
            "Clearly never used Oracle/Peoplesoft…",
            "\"Immediate red flag for any company that uses WorkDay\"\n\nThat's a ridiculous statement because so many companies use it, including top companies lmao",
            "ICIMS is the worst in my opinion. Workday atleast has a nice UX",
            "Fuck workday",
            "Workday sucks ass",
            "I do not think so. I worked at a great company in my company that uses workday. I think Salesforce also uses workday and I read some good reviews on that company.",
            "Company got bought out and now use workday -- trying to internally apply is a mess",
            "I straight up refuse to apply to any job that uses Workday for their portal. They take me like 20 minutes each plus I have to create an account which is bullshit. Much rather just fill out a quick form upload my resume and then go from there",
            "McGill",
            "Big facts",
            "Does taleo no longer exist?",
            "FUCK WORKDAY",
            "I can't agree more with you!  WorkDay is the worst platform I have never encountered or use in the past 20 year!",
            "Workday is THE WORST piece of garbage I have ever used. There are no words to describe how much I hate it. I have to use it as an employee and a supervisor.",
            "I came here just to rant about how much I fucking hate workday. It is literally the worst piece of software to have ever existed.",
            "I've used workday for other stuff apart from applications to positions. I actually don't mind the application process, but it does feel like extra work to apply . The UI is really nice for employee management. But I found the integrations with other things to be real crappy . If I could get the University of British Columbia to go back to their old system I would .",
            "Workday is the biggest piece of shit ever designed.  I'm trying to pay a student for the upcoming term and I was specifically told not to do it as an \"Add-on\".  So I tried doing it the regular and a message pops up telling me the student isn't in the system and to do it as a \"new hire\".  I was furious as this happens all the time and I knew she wasn't a \"new hire\", so I phone HR and was told that this student was also working in another department (how the hell would I know that?) and to do it as an \"add on\".  \n\n\nWhoever invented this POS program:  I hope you die of Covid  and I hope it's slow and painful.",
            "It is the WORST mobile app ever developed. Pure Crap!!! Just Horrible. You can't afford a real app developer???",
            "I am also adding my view here.\n\nI have been in the job market for last few months and applying to jobs in Germany, and most of the applications I made through the workdays. In my experience, it is the worst website I have used. Why companies can't abandon it. Multiple login accounts, and basically, you can't add that to the password list because of the same email link; google always updates it by itself. And some random message like this account is in use. Such a trash portal, and companies hire people using this website.",
            "I absolutely **HATE Workday**!!!!... I have been in the Tech Industry since 1984 and have used many HR related applications over the decades, but Workday is by far the biggest POS application I have ever been forced to use in my career. Workday is an insult to application programming as a science and art.",
            "I have talked with HR professionals, they hate it too. But it isn't just a huge pain in the ass to employees and job seekers. the HR people hate it too. If you have some funding from a family connection and a good computer background you could destory this POS company and make a billion bucks.... centralize the job applications information, background checks, i9, etc and submit only the specific information the companies need based on their requirements and have  a single sign on and you could make a billion bucks.....be the next ELON !! I am too old at 56, but I would be glad to help with ideas and presentations. I have 30+ years in the computer field.",
            "I hate that they have you change your password, reconfirm you want to use fingerprint to unlock, and reconfirm your pin ever month. I usually only check it once a month. They think this makes it more secure, but it causes people to use weaker passwords so they can easily get back in. They have no options to adjust these settings and you can't even complain to their support because you have to be a member of the HR department to even contact Workday. Oh yeah, and the app doesn't appear to let you copy and paste when you are updating your password, so if you have a more secure password you better hope you can type it in correctly.\n\nThis is one of those companies that think they are doing a great job, because of all the companies that are using them, but they fail to realize that the companies spent a lot of time and effort getting it setup and training employees how to use it, so they are basically just stuck with workday. After seeing all the shortcomings changing to something else would just be an even bigger headache.\n\nI'm sure if Workday allowed the employees of companies, you know the people that actually use the application on a regular basis, to submit issues directly to Workday they would quickly see why it's so frustrating to use.\n\n(If anyone knows where to lodge complaints to Workday, let me know, because I've been through the app and the website and still can't find a place to log a complaint or get help.)",
            "I want to maintain the same clock-in time with Workday every day, but I am finding it a 'JOB' by itself. WD is always slow especially around 8:00 AM and 1:00 PM PST.  Also, the message to check the '\"Security Alert\" was activated every time I access the portal. This could be our admin laziness but it is annoying as hell!  They should have three options (best practice) to recommend, saying once a day (or  Monday to Friday is) fine too. Not every time you log in and out.  We already have an enterprise MFA enabled (using an app from my iPhone) and this \"Your workday was signed in from blah blah blah\" is inconvenient as hell, it needs to be checked once per day (or once per week) - Just my 2c!",
            "I totally agree. It's a complete dogshit site",
            "100% agree. \n\nI hated it when I used it as an employee and I hate it even more as a job applicant.",
            "If you changes banks  not going to get a direct deposit for at least a month late. Won't pay over time correctly. Have to submit your own hours Saturday evening but cannot do it from home you have to be at work. So nothing like going to work on your day off.  Took a month to fix a issue and get paid and even then it was done incorrectly. Instead of the 20% tax deduction only taking half that. This app sucks. Can't clock in early if told to do so. Have a small window of time to fix issues to be paid on time. Every pay day is wrong and or late. Since I downloaded the app my phone isn't working properly. Takes up a huge amount data. $40 month on my phone bill.  This app is going to cause law suits there are federal labor laws that are supposed to guard against this incompetency. I filed a complaint with hours and wages just to receive my very late pay check because this app  is Satan's play toy.  A cheap way for corporations to handle pay roll.",
            "god it really is.. holy shit I didn't think something could be this horrible.",
            "god im so glad im not the only one who thinks this. its so annoying having to re-enter your work experience and education...",
            "Worst user interface and most convuluted website I have ever used. Terrible.",
            "simplify chrome extension will lessen your pain, but they could also do a better job in filling the form. It is not even hard to make it better.",
            "This is just the fucking worst, no universal account on the same platform what is the point",
            "fvck workday",
            "Finding this post from two years has made not feel alone. I'm literally using Workday right now",
            "Workday has to be the absolute worst app since the invention of the cell phone!! I'd rather have a route canal as to deal with this worthless piece of dog sheeit excuse for an app!!",
            "I spent 4 hours trying to onboard for a job using workday, idk if it’s just me but right off the bat it’s password system blows, it registered my last name (Rodriguez) with an accented I so when I tried doing the I9 it immediately flagged my last name as incorrect bc the i9 can’t have accents, I just ended up passing on the job altogether cause of the commute and that headache",
            "There is absolutely no reason to require an applicant to spend 30 min filling out every submission. Absolutely no reason to not save data such as employee work history to use across multiple submissions except to charge companies more to store additional information. Bad website created by idiots.",
            "I FUCKING HATE WORKDAY!"
        ]
    },
    {
        "post_id": "14jvj7b",
        "author": "2001ThrowawayM",
        "title": "It doesn't feel real.",
        "url": "https://www.reddit.com/r/csMajors/comments/14jvj7b/it_doesnt_feel_real/",
        "score": 844,
        "num_comments": 165,
        "created_utc": 1687818769.0,
        "selftext": "I remember in middle school telling me guidance counselor that I wanted to become a programmer, and asking what courses I could take, and now I am a rising junior in college with a software engineering internship getting paid to program everyday.",
        "permalink": "/r/csMajors/comments/14jvj7b/it_doesnt_feel_real/",
        "comments": [
            "👍",
            "👍",
            "👍",
            "👍",
            "💪",
            "I got a 1 on my AP comp sci test. I then got a degree in history. Now I work as a software engineer.",
            "👍",
            "👍",
            "👍",
            "Yeah that realization is gonna keep happening every pay raise or promotion. It's a nice feeing",
            "👍\n\nI’m glad you’re enjoying your internship, wish you luck in your future endeavors. : )",
            "https://preview.redd.it/d7l567dt9h8b1.jpeg?width=1290&format=pjpg&auto=webp&s=8a470596729730047146e261b7977fad018ca597",
            "👍",
            "👍",
            "👉👌",
            " 👆",
            "👍",
            "👍",
            "👍",
            "👍",
            "yea I remember my first internship being like \"holy shit. I dreamed of this when I was 13. And I studied and planned my life for it and I'm here\"",
            " 👍",
            "I wish I knew about programming earlier. I was always fascinated with computers and what they do and was known as the technical guy. People used to tell me “you need to get into IT!” However, i had zero guidance and lived in a pretty shitty area and had a bad home life, therefore my existence was dedicated to surviving. Then I became a father at 15 and had to get to work. Now, I’m studying CS and I’m helping my son explore his love for computers as I study. One day I hope to get there too, but I digress. Good job, OP.",
            "My guidance counsellor was my gym teacher. Cool innit",
            "👍",
            "👍",
            "👍",
            ",👍",
            "👍",
            "👍",
            "Senior engineer here, I was in year 12 not even knowing how a function worked. That was 8 years ago.",
            "At 7 or 8 years old I played my first video game (Atari 2600 - Pac Man). At 11 I learned you could program computers and declared I was going to make video games when I grew up. I spent my teenage years dealing with disappointed parents who felt I was chasing terrible dreams.\n\nI got my Bachelor's in CS in 1998 and failed to land any gaming jobs but joined the era of the \".com\" development.  Found my may to the gaming industry in 2005 7 years later.\n\nIt has never felt real that someone pays me to do what I enjoy. Though as my career has grown my attitude about what I get paid for has shifted from \"programming\" to \"solving problems\" and I have a more solid understanding of my worth and why I'm paid. \n\nStill doesn't feel real :) \n\nMay your career be just as adventurous and may you never lose that sense of awe. Never stop being curious.",
            "🫰💵",
            "👍",
            "👍",
            "👍",
            "👉🖖💦",
            "👍",
            "👍",
            "🫵👊",
            "That's awesome! I hope everything goes well!!! Congratulations :)\n\n&#x200B;\n\nHope I can be like that someday :o",
            "It's a good career. And a challenging one. More so than  many other careers, you have to dedicate yourself to life-long learning.\n\n&#x200B;\n\nKinda crazy what we get paid for what we do though, when you really think about it, creating value out of thin air with our fingertips.",
            "👍",
            "🖕",
            "It’s all uphill from here. Impress the shit out of your colleagues and you’ll have a career.",
            "Soon you’ll realize programming, and the core joy and awe of it, won’t get you nowhere in this industry.",
            "Who cares",
            "I've seen it all over and I'm finally going to ask. Wtf is a rising junior/senior? Someone who thinks they're going to be good? Wouldn't pretty much everyone in cs feel they're rising?",
            "Until AGI makes your job irrelevant.",
            "Idgaf",
            "👍",
            "Nice",
            "It’s a cliche, but it really has been about the journey",
            "[**Sinapi12**](https://www.reddit.com/user/Sinapi12/)·[3 hr. ago](https://www.reddit.com/r/csMajors/comments/14jvj7b/comment/jpnj9jz/?utm_source=reddit&utm_medium=web2x&context=3)\n\n👍",
            "👍",
            "👍",
            " 👍",
            "👍",
            "Yep",
            "👍",
            "👍",
            "Living the dream!",
            "👍",
            "Remember and keep that passion and drive when things get tough. 😁👍🏻",
            "W",
            "👍",
            "👍",
            "👍",
            "👍",
            "👍",
            "Hard work pays off, congrats.",
            "Lol did you make a throwaway account your main?",
            "I can relate to this! Congrats OP",
            "👍",
            " 👍",
            "👍",
            "Thing is, it doesnt feel real to me even now. Im a first year computer science student, about to go into the second year and i still cant believe im pursuing what i thought was just another dream",
            "👍",
            "🥸",
            "👍",
            "One of the greatest feelings I've felt in my life :) you earned it, enjoy it",
            "👍",
            "🍆",
            "👍",
            "How much are you getting paid and why software",
            "Good shit fam, keep grinding but don’t forget to stop and enjoy the moment here and there. Best of luck 💪🏽",
            "Ahh, this made me smile. When you are the you you aspired to in your adolescence. You made lil you proud and he’s so proud of you!! \n\nSomeone tells me to say you once more time",
            "Welcome to hell",
            "🤓👍😂🥹😭",
            "👍",
            "Big W so happy for you buddy",
            "The world is your oyster",
            "how did i know it was u before I read ur username lmaoo",
            "👍",
            "congratz my bro",
            "👍",
            "👉🍑",
            "👍",
            "👍",
            "I feel you. One day I was like okay I’m gonna code so much, someone would be crazy not to pay me to code and now I’ve got 3 YOE.",
            "why the emojis funny to me",
            "W",
            "That's nice.",
            "👍",
            "👍",
            "👍",
            "👍",
            "Same, its great 👍",
            "Veni vidi vici",
            "This is awesome, congrats OP! 🥳",
            "Congratulations! It’s very important to take a minute and see how far you’ve come, and appreciate the struggle to get there and all that you’ve learned.",
            "Damn, slide me a referral then- I’ll send mpg my resume 🥲😭",
            "👍🏾👍🏾",
            "."
        ]
    },
    {
        "post_id": "1apy7lc",
        "author": "Own-Inside-3124",
        "title": "Internship hunt of an international student in US",
        "url": "https://i.redd.it/nn8u0nrhudic1.png",
        "score": 841,
        "num_comments": 76,
        "created_utc": 1707843197.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1apy7lc/internship_hunt_of_an_international_student_in_us/",
        "comments": [
            "How did you manage to get 36 referrals?",
            "995 is insane",
            "Did you use your OPT time for internships or some other mechanic?",
            "where did you guys find more than 900 companies to apply?\n\nanyone have a list?  I don't know many companies other than the classic faang",
            "How do I see that graph for the jobs that I’ve applied",
            "21 OAs!!\nAlso where are you going to intern?",
            "Good luck. In this environment, I am only considering US citizens.",
            "Dap me up for that",
            "How much time did it take for you?",
            "What’s an OA?",
            "Are you a sophomore, or junior?",
            "Wow! Congrats on finding a job. Super happy for you!!!!! Definitively deserve it given the amount of effort you put in",
            "Would you mind telling us what kind of company it is?",
            "Can relate🫡",
            "Congratulations! Did you get referral at the company where you got the offer ?",
            "Are you a masters student? Can you tell us the rank of your college?",
            "Wow! When did you start applying? 995 is a lot!"
        ]
    },
    {
        "post_id": "19f0w0k",
        "author": "Forward_Opinion6038",
        "title": "Goals",
        "url": "https://i.redd.it/0al1vasbkiec1.jpeg",
        "score": 840,
        "num_comments": 93,
        "created_utc": 1706156864.0,
        "selftext": "I’m doing something wrong🤦🏽‍♂️\nHow can I internshipmaxx",
        "permalink": "/r/csMajors/comments/19f0w0k/goals/",
        "comments": [
            "Tf is Bits of Good",
            "Lessons to learn from this person:\n\n1. Get in at the perfect time\n2. You can possibly get away with listing student orgs (Bits of Good, HexLabs) like employers on your resume, people who notice apparently might not care too much and people who don't might think you've been employed as a junior\n3. Don't get in at the wrong time",
            "Maybe one day (I’m going to peak at Revature)",
            "I thought at first this was one of those depressing posts where someone had a ton of good internships but got fucked by the new grad market.",
            "Bro collected all the infinity stones",
            "You want to be unemployed?",
            "This market so bad even people with this much experience are getting rejected. Met a person during my internship who was interning at two companies at the same time",
            "Georgia tech student?",
            "Most probably a student trying to stay in U.S by all means possible",
            "Bro played the university name and Covid overhiring\n\nThe man got the once in a generation timing",
            "do you go to GT",
            "Typical Waterloo students",
            "Eww trash. Where's quant/HFT?",
            "No return offer?",
            "How were they a FTE and an intern at two separate companies at the same time?",
            "If you can, get a 12 or 16 month internship instead of multiple 4 month. You'll get to work on  bigger projects and get more valuable experience.",
            "I know this person irl LOL. OP, do you know him as well?",
            "corpos are a dime a dozen, lets not idolize them",
            "Avg waterloo kid's resume",
            "Still can’t get a call back",
            "Hes now incoming software engineer at tiktok",
            "Why would you want to intern max lmfao you just get paid less and delay your graduation… sometimes to the point where the market turns and all those internships mean nothing when you cant find a job",
            "the perfect person",
            "He seems like a helluva engineer",
            "Internshipmaxx by creating a perfect resume in ur sophomore year of high school 😔",
            "You can start by charging your phone...",
            "What app is that",
            "As a hiring manager I see nothing appealling about this.",
            "What good is those internships when they don’t even work as software engineers in those big companies.",
            "Interns are generally useless, it’s not that impressive",
            "My max is 3",
            "If only 😔",
            "[deleted]",
            "Why intern for a bunch of places when you already had a job in 2021?",
            "How many internship can one do :/",
            "Bro gonna do internships until they retire",
            "This is goals how?? The market really is sad when this is goals 🤨"
        ]
    },
    {
        "post_id": "170km2r",
        "author": "Juicyjackson",
        "title": "1 Image to confuse r/csMajors",
        "url": "https://i.redd.it/57n2x115iesb1.png",
        "score": 840,
        "num_comments": 61,
        "created_utc": 1696519064.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/170km2r/1_image_to_confuse_rcsmajors/",
        "comments": [
            "why does this sin wave had arbitrary labels? /s",
            "cs w a minor in econ.\n\nU lose👎",
            "all i see is depression",
            "Idk about Econ, but I was at citadel securities career fair, and they prefer engineering students to do the math rather than finance/econ majors.",
            "Not an expert in economics but how can we assume there will be an expansion when expansions in tech are highly dependent on very low interests rates (historically speaking) and we can not predict interest rates. Even now interest rates are low in a time line of 50 or so years.",
            "Me every week",
            "Did the horse keeper industry come back after the minor nuissance that was the invention of cars?",
            "Except we're not in a recession right now, so this is irrelevant",
            "Im a CS major, did this in Grade 8 econ. \n\nCS majors can learn about GDP as well as all the macroeconomic effects of Positive and Negative Growth rate in a day. \n\nSolving a dp problem in lc is much harder than this lol",
            "It'll confuse csmajors because it's a lie. When has GDP looked like a sine wave for any extended period of time? I'm assuming the point is that cs grads need to be patient for the next hiring wave? Just say that instead of pretending you know how economies work.\n\nEdit: guys, let me explain as simply as possible: business cycles are not predictable, never have been. so when someone is complaining about a bad job market, pointing to a sine wave and saying \"just wait for the expansion\" is ridiculous.",
            "Everyone here seems to somewhat know what this is talking about or that it’s about economics? This image actually makes no fucking sense to me.\n\nEdit: I’m being downvoted because I agree with the title?",
            "This cycle just looks like my mental health throughout the semester lol",
            "sorry, but i’m a computer science and Mathematical economics double major,",
            "How is it not obvious that people in this sub say there’s no job market left to deter any competition in the future",
            "What do you mean? Looks line a sine wave to me."
        ]
    },
    {
        "post_id": "1305i55",
        "author": "2001ThrowawayM",
        "title": "Be social.",
        "url": "https://www.reddit.com/r/csMajors/comments/1305i55/be_social/",
        "score": 836,
        "num_comments": 141,
        "created_utc": 1682557858.0,
        "selftext": "I know, this is Computer Science Majors I am talking to, but be social, talk to people, go out sometimes, spend time with friends, don't ignore the rest of your life and just focus on CS, put yourself out there.\n\nOne of the biggest ways to get ahead of people in interviews is to be good socially, you might not be the best programmer, but if you can chat up the interviewers, and are far more likable, there is a far far higher chance of getting the job compared to somebody that can't communicate at all but is a God programmer.",
        "permalink": "/r/csMajors/comments/1305i55/be_social/",
        "comments": [
            "which lc problem is that?\n\nSounds like LC hard ngl",
            "even more true for international students. if you have W rizz, you can rizz your way into a marriage green card and not bother with h1b.",
            "OP are u trying to distract me from my LC grind? Nice try, it ain't gonna work",
            "I know everyone likes to make fun of CS majors and call them antisocial, but many CS kids ik are pretty normal socially and hit the gym and stuff.",
            "[deleted]",
            "Idk. Even the most bookish cs majors I knew were in clubs and even leaders in engineering clubs. A little awkward sometimes but not antisocial. Not partying doesn’t mean anything. Honestly it’s probably healthy and safer not to go to frat party.",
            "[deleted]",
            "Day 5000 of someone assuming CS majors lack basic,  human functioning",
            "I agree dude! \n\nI am fairly clever, but I’m not a good programmer… I kinda coasted through my whole degree. However, I’ve worked in bars/restaurants for years and although I’m an introvert, I can chat to and charm anyone I meet. \n\nBy using my conversational skills I landed an internship at a Fortune 50 company, and now I’ve been offered a full-time position for after I graduate. If they’d asked to see my grades/focused on my programming skills I’d have been fucked. \n\nI see comments here saying that what you’re suggesting isn’t true, because talking to friends and talking to interviewers is completely different. I totally disagree. Every interview I’ve had, I’ve talked to them like they’re a friend. Unless you’re talking to some power hungry weirdo, then people mostly want to be seen as a nice person and not feared.",
            "I really hate talking to people, especially unfamiliar men, but I will say I'm grateful for my tour in retail hell because it put me out of my comfort zone and had to learn to chitchat with strangers and pretend to be likable. I hated every minute of it, but I probably would have never learned those people skills otherwise, and people skills are important wherever you go in life. I agree OP",
            "[deleted]",
            "NP-Hard",
            "With 25+ years in IT (and hiring manager at times), this is exactly true.  I will add to it - don't act like you are God's gift, even if you are incredibly smart.  Be confident but humble.  If you act superior, I don't want you on my team.  Because you are going to ignore good advice and suggestions that are counter to yours.",
            "Sheeesh I need to upgrade my rizzz",
            "real",
            "Go outside and touch some artificial grass.",
            "agree with this a billion times over. this post came across my feed for some reason, i’m a hiring manager in r&d for a top quartile pharma. we refer to our statisticians and programmers with personalities as unicorns. i’ll add that it’s not just the interview but day to day on the job. the biggest challenge is finding one that can collaborate as part of a team made up of people from diverse backgrounds.",
            "If I was an employer, I’d rather take the super saiyan boss programmer and work with them rather than have a mediocre programmer with communication skills of an English professor",
            "No",
            "What if ur school is a commuter school :(",
            "Tbh man I feel that most of the cs majors I knew in college were sociable, easy going yet also hardworking people. I was Greek in college and also part of school clubs, and knew a handful of cs majors who were doing the same. I was probably on the opposite side of the spectrum and should've spend more time leetcoding than socializing. Still got a job post grad tho",
            "I can not more than agree. In my early 20s, i was the quite stereotypical nerdy tech focused programmer.  Wanting to debate with other students or colleagues about the 100% perfect right thing  \n\n\nBut then you realize, most people just want to have a cozy job or student class, and could not care less what some guy from 1998 wrote about pointers.   \n\n\nAlso I've only ever seen one person getting fired for performance reasons, but many more for that they are just awkward or can not communicate with others or is rude. I honestly think a class in conversational skills would be a huge benefit to all CS programs",
            "A nice way of saying \"touch some grass\"",
            "Being social has potentiality got me an internship. I started applying really late this year and I didn't expect to get any responses. But then my gf (yes shocking I know but she's also my only consistent social contact I have) told me her friends mom works at a software company. She couldn't get me in but she did refer me to another company with a position open and now I have an interview next week. Lesson learned, being social is very important, however I am completely devastated by this information and I will probably not change lmao",
            "A good way to boost social skills is to join a public speaking club.\n\nFor example, in high school, I often competed in international debate contests via the local debate club, helping me learn how to communicate effectively to large groups!",
            "I'm an extrovert in this field.Trust me I like being around introverts and socializing. I feel my ability to get along with people will help me get ahead later.",
            "Do you really believe this? If you run a company with products to release and revenue depending on it, would you hire a sociable programmer or a god programmer ? \n\nRemember you are running **a business** here not a social gathering \n\nBe real bruv",
            "you brain has self convinced this is what you're lacking of and think everyone is like you. Well it ain't gonna for work buddy",
            "You are just adding stress to people",
            "Make friends in clubs, esp the big ones that aren't major specific. Ethnic and recreational clubs have the funnest ppl.",
            "friends are online",
            "[https://www.reddit.com/r/csMajors/comments/130brtr/breathe\\_air/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/csMajors/comments/130brtr/breathe_air/?utm_source=share&utm_medium=web2x&context=3)",
            "asocial we are 💪",
            "That sounds very intractable.",
            "Before this post I was not eating or drinking because I was so busy being a computer science major, I haven't left my room to see the sun in over 7 years. Thank you so much.",
            "I was doing great until Covid hit.  Once Covid hit, and everything went alone, I took a gap year and all my friends graduated haha.  \n\nForever alone.",
            "My analytical and interactions skills have always exceeded my technical skills.\n\nOne of the best answers I gave on a technical test, “I would rip the code out of another program”.\n\nThe interviewer said on review, “That is a correct answer.”\n\nI got the job.",
            "Na I'm good",
            "Couldn't agree more. I'm not the greatest LC guy, nor do I have as much technical experience as others have, but I'm able to hold conversations really well and managed to land my internship by talking to a lot of devs and having great conversations w my interviewers.\n\nSide note, I also hate when people ask questions in the groupchat and no one even tries to respond. I didn't realize that CS and math people are so antisocial until I got into the higher level classes.",
            "Someone give me tips on how to make friends in my major. I don’t think people in my major like me because whenever I talk they don’t take me seriously. It may be because I’m a girl but the other girls in my major are taken seriously.",
            "honestly, workplace communication skills and social smalltalk skills are not as similar as I expected. \n\nImmigrants are a great example of this, most of them don't really fully \"socially fit in\" with smalltalk and whatnot but many of them do great in tech.",
            "When I was in school I hung out all the time with a group of fellow CS majors. Bonding over programming projects can spill over socially.\n\nOn the other hand my brother was a total introvert and never did a thing. That’s on him, not the CS degree.",
            "This is exactly why I'll use some of my Microsoft Summer internship money to fly to South Korea for a month. I have a best friend I want to meet there of 2 years of knowing each other. I'm starting to value my life more because life is too short to keep yourself isolated and work none stop.\n\nTrust me, I ain't close to retirement, but I am sure once I'm old, I'll regret not being social and enjoy life to it's fullness.",
            "I really wish I did. But it's so freaking hard. I regret my social skills being so bad but no matter how hard I try, it is harder.",
            "Very true I can say I got an internship because I had an interesting conversation with my interviewer rather than being hired purely on my prior experience/ resume.",
            "> One of the biggest ways to get ahead of people in interviews is to be good socially \n\nI disagree with this. Most people I know who have trouble getting top tier internships are fine socially, but can't do leetcode. Doing leetcode will help you more.",
            ".....be social\n\n\n\n\n\n\n\n\n-lizing on Reddit",
            "I have brain rot!!\n\nI read it as you got a job at BeReal and I was like good for them",
            "It will only get worse when you get a job. Take OPs advice and make it a habit of LAW.",
            "This is one of the most Reddit posts I have ever encountered",
            "This 100x",
            "Any tutorials for that?",
            "."
        ]
    },
    {
        "post_id": "1c5jz9e",
        "author": "mspectxrs",
        "title": "my internship search has finally come to an end",
        "url": "https://i.redd.it/peq3fbri7vuc1.png",
        "score": 830,
        "num_comments": 73,
        "created_utc": 1713283793.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c5jz9e/my_internship_search_has_finally_come_to_an_end/",
        "comments": [
            "who was the lucky company to accept you?",
            "What country is this? Only 100 applications is insane luck.",
            "Is no one gonna mention how 8 + 68 + 41 ≠ 113? Am I just dumb what am I not seeing lmfao",
            "It's not over until the fat lady sings. Keep looking for a backup.",
            "Good job Brodie",
            "You can make this more elaborate with details like how many were cold applications and how many with referrals....coz 8 interviews is pretty amazing in this market.",
            "Stats? School?",
            "How do you create these images and how do you track these applications?",
            "Congrats",
            "Did you find better luck applying on pipelines like LinkedIn easy apply or indeeds version of that or applying straight on company websites?",
            "How long did it take you?",
            "experiance and gpa check???",
            "What's your background? College? Any past FAANG internship experience?",
            "Congrats my guy - good interview conversion imo",
            "took a break from r/premed  reddit and came here... only to run into a sankey off the bat",
            "What was the time period between applications and offer received ?",
            "Congratulations",
            "How do y'all make these graphs?",
            "Shai-Hulud!",
            "What kind of applications? All tailored or a lot of LinkedIn?",
            "I think it's a good school.",
            "Hey, what app is this?",
            "113 applications for an internship? Holy fuck its doomed... Moving to the woods rn, shits over",
            "if it would have been canada, it would be a 10000000 application zero offers. or 1 offer with no pay only a bus pass worth 50$",
            "What was the timeline? When did you start and when did you get an offer?",
            "What app/site?",
            "[deleted]",
            "Are you a us citizen or an international student in the usa? Also, are you a grad or an undergrad?"
        ]
    },
    {
        "post_id": "18vjrio",
        "author": "Ved-dell",
        "title": "Internship search over, finally getting the cushy life",
        "url": "https://i.redd.it/pxsr5g6prp9c1.png",
        "score": 833,
        "num_comments": 75,
        "created_utc": 1704064888.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18vjrio/internship_search_over_finally_getting_the_cushy/",
        "comments": [
            "Just curious what kind of questions they asked you.",
            "Did you just cold apply to Amazon or through a referral? Never seem to move past the application stage",
            "International?",
            "Do you attend a prestigious school?",
            "Curious what the 3 offers you turned down were about?",
            "What company",
            "Would you mind sharing your resume anonymously?",
            "I am new to this , Just completed my first semester and I want to ask you op , what are the things or language you need to know before getting or applying for an internship",
            "as a high schooler planning to start this rat race after a year, I can't lie, I'm reaaally starting to doubt if i have the mental aptitude for this lol",
            "Nice!",
            "Congrats!",
            "congrats big guy thats no easy feat",
            "What company did you accept?",
            "My Man u got a internship at Amazon? Ima be in DC, which office u going to?",
            "Which tool did you use for such visualization?",
            "\"Ghosted\" implies they actually responded to you at some point?",
            "Do you want to elaborate on your process so it can help others?\n\nWhat's the point of this post, to gloat???",
            "Hi, did you make any changes to your resume based on the job description? or any specific keyword that i should keep in resume? Most of the companies i applied are saying \"Our recruiting team carefully reviewed your background and experience and, unfortunately, we won’t be moving forward with your application at this time\". any suggestions?",
            "How did you do it with the decision deadlines for your offers?",
            "i didn’t even know amazon started interviews??",
            "Conguardshoelaceshins",
            "&#x200B;\n\nhttps://preview.redd.it/r7l7exj11z9c1.png?width=219&format=png&auto=webp&s=88fac1ee6dfa8d33123b1b312f99b3007bd1133c",
            "Did you write cover letter for everything? If so, how?"
        ]
    }
]