[
    {
        "post_id": "1cg0hq4",
        "author": "Vegetable_Mess2943",
        "title": "CEO of Y Combinator just dropped some gems",
        "url": "https://i.redd.it/wj7tvuaxhfxc1.png",
        "score": 2930,
        "num_comments": 484,
        "created_utc": 1714400872.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cg0hq4/ceo_of_y_combinator_just_dropped_some_gems/",
        "comments": [
            "The problem is corporations insist on hiring engineers who can build, and then proceed to stick them in a corner managing CI/CD pipelines while their developer skills rot away.\n\nThey’re hypocrites",
            "CS seems more like an art degree than an engineering one. Imagine aerospace engineer being asked to build RC planes in their spare times or Civil Engineers being asked to play with legos or something lmao",
            "I mean, I like programming to build stuff, I agree. It's just that 90% of the grunt jobs out there are CRUD maintenance. The rest are overly excited and understaffed startups that will squeeze you out.\n\nI play music. I play in a few bands, semi professionally -- I tour festivals and sell my music, just not full time. I like writing, performing, creating stuff with people -- but keeping it professional as well. After years of playing I barely even touch my instrument at all, except when I have to rehearse or play live. \n\nI see CS the same way. \"passion\" doesn't really matter, nor does it matter what kind of fancy tricks you can do -- just play the damn set and be good at it. This \"it MUST be your LiFE DREAM to become a HARDCORE coder 24/7 with SIDE PROJECTs in your unpaid FREE TIME\" can get fucking bent. \n\nIt's a job making computers do beep boop for money, just the same as my job as a musician is making instruments do pling plong for money.",
            "Yep. Working on an interesting and relevant project is what ended up leading me to getting a job right out of college this past December as an otherwise exceedingly average student at a very average uni.",
            "Focusing so much on leetcode early on ruined coding for me. It was soulless work. It wasn’t until 5 years after graduating when I started building things the way I wanted is when I became passionate about CS.\n\nAll those wasted years 😭",
            "This some out of touch shit tbh. \n\nI have 4 YOE, working as a data engineer right now , going to do a masters for my own interest, and have helped directly with recruitment process for 2 companies now. \n\nOn average our HR looked at applicants resumes for 5-7 seconds. Meaning if your resume makes it to them, that’s how long it takes to decide whether you make it to my teams desk or not. \n\nSo for all of you who aren’t even making it to interviews, it ain’t because your projects suck, it’s because you couldn’t convince HR in those 5 seconds you were relevant enough to even be given a proper read through. \n\nOfc every company’s process is different, so take with grain of salt, but this is my experience.",
            "Yeah I build 10 projects, 5 of them SaaS. \n\nCan’t score an interview in past 5 months. \n\nAnd if I would have spent past 5 months on Leetcode I wouldn’t know shit about building stuff.",
            "The money guy prefers to fund people who will work \"for fun\" every waking hour. Good to know.",
            "After a 4 year degree and thousand in debts, this sounds hopeless. \nWhat a shitty place to be",
            "\"Build for fun\"\n\nShit, fun is going for some drinks, to the movies, to a mall,  to get some ice cream, go eat new things etc\n\nThis is a career, this is very fucked up about the industry, they expect you to work your ass off in your free time.\n\nFuck...",
            "It is true. I have a really interesting project in my resume, and literally all interviews & screenings asked about it.",
            "99% of CS majors hate him!",
            "Or, and get this….. people could do fun shit for fun and work for money. Not everyone eats breathes shits sleeps boring ass code lmao.",
            "Well, my friend build own C++ compiler and debugger, he is still unemployed.",
            "Bro I want to do this as a job not live and breathe it 24/7",
            "A project I made got me hired. Literally all it did was convert Shopify’s shipping data output to FedEx Same Day City shipping input format. Took me 3 hours to write and sold it to a company for $2000.\n\nOnce I put it on my resume, I got hit up all the time and interviewers got giddy when I talked about it.",
            "“Prove that you’re willing to work for free, and we MIGHT let you work for us for pennies.”",
            "Or they’ll underpay you because CTOs and Hiring Managers believe you are a workaholic rube",
            "Yeah dude. You need to actually enjoy coding because the development loop is only flow inducing when you're in this trance-like state of hyperfocus on the problem(s) at hand. If you don't dig it, you shouldn't do it.",
            "I once had a coding interview round waived, and instead, we just discussed one of my projects.  150k TC offer. Not exactly faang, but more than enough for me.",
            "Been saying this for ages and trying to get people to build together. Too many people allergic to working with their craft and just want a six figure salary with 0 genuine passion or interest in their craft.",
            "The industry caters to people whose entire personality is that they’re a programmer and nothing else. If you want to be more than just a programmer, then choose a different career like I did. I did exceptionally well in school and still program in my free time, but I hate the industry and will never work as a dev. Ever.",
            "Employers overvalues themselves and what they have to offer...",
            "It’s not gems it’s common knowledge. \n\nAlso this is how I got hired for Apple!!!",
            "Same, my projects got me a lot of interviews",
            "This is bs reason lot of people cant get hired is just number , supply ⬆️ demand 📉🚽. 4 years ago having a cs degree was enough hell theyd just hire u for a stupid bootcamp cert even if u only had a GED. Its an employers market and they are looking for cream of the crop for as little pay as possible, next 5years are gonna be painful",
            "They say that and yet when you can't solve a leetocode hard they reject you",
            "So true. My projects might feel lame to me now but during my first job the co founder spent ton of time going through my projects. \n\nI was below average student all my life plus had 6 months of gap after degree.",
            "What’s frustrating, at least for me, is that the projects I’m able to do in my free time can only be so technically sophisticated, because I only have so many resources at my disposal as a broke college student who has to work and support myself. Hell, I don’t even have my own desktop PC, just a crappy laptop. \n\nCompanies seem to expect us to have built real world projects that have been deployed or earned revenue  while still a student but like, there’s only so much we can do. I can’t afford to spend money for a project. Plus, most ideas for projects have already been implemented in much more detail by someone else who has access to resources. This makes standing out 20x harder.",
            "Hahahaha and this subreddit downvoted me in the past for saying exactly this. Just goes to show how Reddit is a cesspool of sobbing and doom scrolling.",
            "Programming is the easy part of the job. Designing for scale, users, and use cases is the hard part.",
            "I made a side project for fun and showed it to a job interview and actually got the role",
            "I'd love to have the kind of income required to spend time building for fun.",
            "Or just lie on your resume",
            "Reflecting on my career from a web designer to a developer, roughly a decade ago. Back then, having a portfolio with designs and links to functional UIs, websites, and perhaps even applications you had built was non-negotiable for consideration in the industry.\n\nWhile there might have been a brief period during the pandemic where recent graduates were hired without extensive scrutiny, back in the day, whether you specialized in frontend, backend, were a designer who codes, or embodied the versatility of a full-stack developer, showcasing your skills to secure an interview and prove yourself during it has always been paramount.\n\nI recall a friend who studied mechanical engineering, he struggled for a considerable amount of time before securing a decent job. The notion that a computer science degree guarantees immediate employment is simply a fallacy.\n\nPeople who secured good tech jobs rights after school, were just an anomoly, thanks to irresponsible goverment spending, goverments sent the world markets in a frenzy with all that artificial wealth.\n\nDon't like it? By all means change fields, better for the rest of us in this industry.",
            "This is why we keep saying passion matters, you cant fake or force curosity 😎",
            "He is not wrong. The majority of CS graduates are doing it for the \"money\". They can't build shit",
            "I built a project for fun again recently. Down almost 20k between my extra dev and infrastructure costs",
            "Contributing to open source projects isn’t that much different of unpaid internship.\n\nThey let you work for free and let us compete against each other. You would call it good competition or nature evolution m, whatever.\n\nThe point is you will have to work harder to be there so that companies can have a pool of talents to pick from. They don’t want to invest in you but want to have an immediate return by hiring you.\n\nYou and your employer are like two faces of a coin. You form one thing but you can’t never be the same (having the same interests).",
            "How do you measure \"fun\"?\n\nBy the emojis in the PRs or is it the YOLOs and LOLs in the comments?",
            "Spend time on a portfolio instead of a degree is the lesson. Degrees are worthless.",
            "Punishing those who were unemployed longer by not employing them further and making them useless then beyotching about lack of skilled workers makes absolute sense, that's a genius and profitable move by employers.",
            "Exactly this. I don’t have a degree, but have never had a problem getting a job… and in fact many jobs I’ve gotten are from people that found me for skills demonstrated in personal projects. Not having a degree, I just assumed I had to do this to prove I could do what I was claiming to do. I’ve never once been able to sit on my degree laurels and be networked into or assumed into a position.   \n\nIn the past, when I’ve suggested this strategy on this subreddit, I’ve been downvoted to oblivion… as though people should just be entitled to a job after a degree. And all I have to say to that is that it’s a competitive market, you have to compete. As long as you’re not doing this, there are folks like me who actually are…. \n\nAnd unfortunately, leet code doesn’t count as a side project… it’s more like a pre-interview filter that will hurt you if you’re not as competitive there. Most of the time, those aren’t the skills you’re using on the job, anyway. I’ve always only used it as a tool to practice interviews and never as application support.",
            "It's easier to say when you have gotten the bag already",
            "Build for fun huh. Most of us are working 40-60 hours in a job that we don't like just to make ends meet. And this guy wants us to build things for fun.\n\nI have a friend who builds for fun, he was funded 500k for his startup by Y combinator as well . But he could afford to do so because he was financially secure and had almost no risk involved. Rich people can afford to do things for fun. We can't unless we take huge risks and quit our jobs to pursue personal projects.",
            "\"dropped some gems\" lol this is generic common sense type of advice",
            "Not everyone wants to code 24/7 though. People have other interests besides coding, and don't want to spend all of their free time doing it. If we paid thousands of dollars for a degree then the degree should be teaching us how to build, deploy, and stuff. A degree is to prepare you for a job after all",
            "As a former hiring manager who reviewed 1000s of resumes and hired >100 engineers over 20 years, I agree with Garry. One of my favorite interview questions was always \"What project did you work on that you were/are excited by and proud of?\" This is how I usually found out what the potential engineer was actually capable of. If they were working from a place of self-driven interest and goal oriented passion, I wanted them.",
            "I have an accountancy degree, I don't read the ifrs for fun. Ever",
            "It can be literally anything. I got a job at a Fortune 50 company by talking about a dumb little python home assistant i made years ago that i kept remaking and futzing with",
            "The field of new grads is oversaturated like crazy in CS. So its now stupidly competitive. Learn IT or networking idk you’ll be fine.",
            "Very very true. I’m not a seasoned programmer by any means, but I have landed an internship specifically based off of a program I built. They wanted more information on a project that I was starting on and I gave further clarification. Rather than a technical interview, (which I probably would’ve failed at the time), they wanted to see my knowledge level and willingness to work on these projects. It was also a project I built for fun which speaks to what Tan is saying.",
            "Any degrees can lead to unemployment in this day and age. If you actually study for a degree you have a lower risk of unemployment, the knowledge to make good investing decisions in your industry, and the tiny chance to run your own business if you apply that knowledge. Just finish what you start and work with what you have.",
            "Yeah, just work long hours on your own CS projects while paying the bills...selling your body? Selling drugs. Whatever. See? The antidote is just to do projects on your own while enjoying the trust fund we all have. \n\nThe system is shit is the real answer. Between your parents, school, and the rest of your society and institutions, there's a failure to connect people with the job path that works for them, and to leave them empowered to be employed with the skills that best suit them. This is a loss for workers and employers.\n\nStart asking people why you aren't getting the job offer. You have a deficiency somewhere, put your emotions aside, locate weaknesses, improve them, and go again. If you're a good worker you have a spot somewhere in this world.",
            "Shouldn’t need to be curious or passionate about an industry just to get a fucking job in it. People have bills to pay and life is only getting harder for the average person as time goes on and this doesn’t look like it’s ever going to change. We shouldn’t shame people for only chasing money (regardless of reason, such as choice of major which the tech industry loves to gatekeep so hard for whatever fucking reason). Maybe all of these entry-level and junior-level developers would be able to actually build something if they got real-world experience by actually landing a fucking job in the “best economy in the world”, or arguably the “best economy of all time”.",
            "First off, the CEO of Y Combinator is the absolute last person in the world you should be listening to, along with any silicon valley CEO huffing the venture capital powder because none of them live in reality. \n\nIf you are marginally competent your CS degree will absolutely get you a job, it will not take 1000 applications, and anybody who thinks AI is going to replace coding any time in the next few decades is insane. \n\nHaving some personal projects to show what you're capable of is great, but don't ever let the CEO-brained folk ever tell you that you need to do unpaid labour to get the \"privilege\" of working for them.",
            "He's not wrong.",
            "He is right, on this. There was a post on another subreddit where the dude was ranting that during the interview, he was asked to make a program to check whether the word is a palindrome or not .\n\nThat guy couldn't even answer that but proposed designs instead of the answering the question with a code.",
            "ah yes, do things, when people can barely make enough living to pay their rent and have barely enough time to cook and sleep",
            "They really should have a class on enterprise design. Could he something where you make an app using something like aws services where you have to turn in design documents and get them reviewed by peers etc.",
            "I built a new, commercial, well functioning app in 4 and a half months, let me update my resume and see how it goes.",
            "I don't really care what projects you've worked on. I do care how well you can pick up new things, because we're always moving forward. I can get someone who can learn up and running in a week or two, and will be very happy to have them, regardless of how much experience they have.",
            "FACTS",
            "BUILD FOR FUN OR DIE MAGGOTS\n\n*No pressure though, have fun*",
            "This. \n\nBuilding something from start to finish will show your potential employer that you have the drive & experience to get things done.  Doing so will differentiate you from the legion of students who are just spoon-fed assignments to finish. \n\nSource: I was that student who was spoon-fed assignments. My first job as a junior dev, I was pretty much spoon-fed everything.  Only after I quit being a developer and came back to it a few years later, did I realize what I missed about it so much, and found the passion to create something from start to finish and release it.  That's how I proved to potential employers that I can do the job, and that's I found a job.",
            "r/thanksimcured",
            "I had 0 experiences in any formal internships during my college. Worked on cool projects in classes (always was fun and they were well received). Got an offer at a great place right out of school. Definitely also had luck in my favor, but just wanted to say I believe in building things!",
            "a lot of peeps are jacking off here.\n\n1.  truth is there is now a huge supple surplus of IT personnel, as illustrated by every position getting hundreds if not thousands of applications, which simply means IT companies get to pick and choose at will, and all the other shit that comes with that privilege. The scale has tipped on the employers' side for a while now.\n\n2. Building shit yourself won't matter IN THIS SPECIFIC MARKET, the conditions of which i explained very briefly above (except for the few intern positions left). There are so many IT people with ample experience who lost their job, to the point that it becomes unnecessary for companies to consider anything besides job experience these days.\n\n3. Corps don't lie to you. You act as if a corporation or a company is a person. It is always a PERSON that's lying to you. It's always always always a person. For example it could be that your team leader never gives you credit, your manager releasing their frustration with his manager on you, your co worker talking behind your back with your boss, your junior messing up your work, the guy that left the company left you with a mess that's impossible to fix.\n\n4. Expanding on the interpersonal thing. Because people are complex interpersonal relationship is also complex and who knows what the fuck could have been going on when you get fired or miss the promotion or get moved to another department. Sometimes it is true that someone is after you for sure, but more often than not it isn't really. You know it could be the guy is so busy or forgetful or has undiagnosed early onset dementia, the CEO fucked up the company financially, your boss's family member passed away etc etc. Love it or hate it, it's just the truth about the complexity of it all.",
            "My two cents. Nobody in the hiring gives a single fuck on your projects. Most of my experience is java and built a simulator in Go(golang) and react and deployed in the cloud with everything documented on my process. Who can guess how much it help it when recruiters approach me ?",
            "nothing about this is novel",
            "This kinda gives me hope because I’m more into building stuff than writing documentation.",
            "People on the software side doom & gloom about a lack of jobs, meanwhile we on the hardware side are doom and gloom over not enough people applying for the jobs... The only thing that's cooked in CS is high-level SE",
            "great comment :)",
            "My just for fun projects haven't gotten me anywhere tbh",
            "Hm my GitHub repository and portfolio helped me land my internship, but I had to self teach myself the frameworks since it was never taught at school though.",
            "I wouldn’t take high interest child’s hot takes seriously.",
            "Agree. My side projects helped me secure an internship which eventually turned into a full time position. Actually, the interviewer for my internship nearly focused on my side projects the entire time.",
            "This is pretty accurate once experienced and at a professional level. However with both when getting started you really have to put in the hours, and those without enthusiasm or passion will struggle.",
            "A CS degree is like a Business degree. You can know the laws and the fundamentals of marketing and how to set up a management structure. But none of that matters if you can't build a business. Either you get lucky and get hired out of a nice Uni with a good internship or you're SOL until you do something interesting.",
            "Nobody cares about this. Grind Leetcode, Codeforces. Become the best at it. The best companies do not care much about projects. They want people who can learn and solve problems. THAT is what a CS degree is for. It is not a software engineering degree precisely because it is designed to teach you how to think. Languages and frameworks change everyday. Algorithms, compilers and programming paradigms do not.",
            "Well, my friend build own C++ compiler and debugger, he is still unemployed.",
            "Sorry this is true sorry if you can’t handle the industry. The same would be true in any saturated industry if the extra curricular experience was so accessible. You are welcome to use your cs degree to be an IT admin if you can’t handle it.",
            "Get an internship before graduating. Preferably multiple. This is the single most important thing. It’s more important than your GPA or your side projects. Employers want professional experience.",
            "How is this not obvious to most lol",
            "Out of Uni, I wasn’t able to find a job. I had work experience because of Co-op work terms, and had my degree, but still couldn’t land a CS job. I spent my free time working on my own side projects (mostly games stuff in Unity). \n\nI decided to put these projects into my resume (admittedly i oversold how significant they were) and suddenly I was being contacted for interviews. My co-op experience was likely a large part of it but every interviewer asked about my personal projects. \n\nAfter I got a job, i was able to get my friends from University various positions at my company. So the moral is, sell yourself, and also have good friends.",
            "The best CS graduate and programmer I ever met said  he goes to bed thinking about what programs he’s going to build and when he wakes up he starts thinking about how he’s going to do it, then he does it.\n\nHe worked for me on a side project I was building and he did such a great job, I wrote a recommendation letter for him. He owns his own company (part-time) and works for a tech company full time. He _loves_ what he does and he’s _always_ building something.\n\nWhen I read the threads here, I rarely see that kind of passion & work ethic, I see delusional expectations. The days of $200k salaries right out of undergrad are gone and have been gone for over a decade. \n\nIf you’re not making it happen for yourself everyday, and in anyway possible, you’re doing it wrong - because that’s what it takes today.",
            "Got 9 interviews and an international SWE internship first year uni after doing unrelated med sci stuff all my life before uni. the market is fine."
        ]
    },
    {
        "post_id": "18e5n8u",
        "author": "willw14",
        "title": "Saw this on LinkedIn lmao",
        "url": "https://i.redd.it/ouiiaahu775c1.jpg",
        "score": 2881,
        "num_comments": 23,
        "created_utc": 1702096858.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18e5n8u/saw_this_on_linkedin_lmao/",
        "comments": [
            "This is infinitely better than the usual cringe npc posts",
            "This is a jab at the corporate corn balls in my head cannon",
            "Well deserved",
            "Little does he know he soon will have 4 more to go",
            "my electro dragons are gonna have an easy time with this layout",
            "this is the best possible future tbh",
            "lol i thought this was a COC sub, because the one before and after this are from r/ClashOfClans",
            "“Cfbr”",
            "Based",
            "Blizzard it is.....",
            "Saw this too! Smh not even TH13",
            "Based",
            "His base design seems awful",
            "rusher 😡😡",
            "Linkedin karma",
            "We should also post hime to r/linkedinlunatics"
        ]
    },
    {
        "post_id": "15m00rz",
        "author": "UnlikelyFly1377",
        "title": "CS is not worth",
        "url": "https://www.reddit.com/r/csMajors/comments/15m00rz/cs_is_not_worth/",
        "score": 2877,
        "num_comments": 593,
        "created_utc": 1691542117.0,
        "selftext": "It is very bad. Go away",
        "permalink": "/r/csMajors/comments/15m00rz/cs_is_not_worth/",
        "comments": [
            "Tbf it probably isn’t worth to a good deal of students who have been tricked by social media to think this is a fairly easy way to make six figures working remotely or with an adult daycare office right out of college. I’m sure when reality hits them that like their academics are unfortunately only like 40-60% of the work they should be doing to jumpstart their career, as leetcoding and projects and all that take up the rest, they’re going to regret it. They expected an easy path, and nowadays it’s becoming increasingly difficult and requiring a shit ton more work than before.\n\n\nHonestly idk if I could survive starting over as a freshman now.",
            "I agree. Everyone please dropout and stop applying for jobs.",
            "Bro tryna remove the competition 💀",
            "Probably time for companies to require bachelor degree on cs again",
            "It’s only saturated because the hiring standards were lowered so much. If they’re raised back to the same level as other professional fields (ie, bachelors degree, internship, competitive gpa, etc) things will be normal again.",
            "This subreddit acts like a cs degree means you can only become developers or software engineers. You know there are many other doors that open with a cs degree right?",
            "[deleted]",
            "Agreed. Its already saturated. I have convinced my younger bro to do dentistry instead.",
            "Agree. Get a degree in finance and work in investment banking.",
            "s k i l l   i s s u e",
            "Low effort post doesn’t even make sense… premed law finance has nothing to do with coding or tech… This sub falling off",
            "A problem is that majority of companies don’t specify different tech positions in internships.\n\nFront end, QA, data science, etc. are all very different and most companies don’t really offer internships in these positions. People just come on as “devs” and transfer into them later when they go full time. \n\nThat, and the amount of international and non-CS people who just apply to US internships because they’re very easy to find.",
            "Maaaan I had this notif randomly popup, thinking it was Counter Strike Majors and was like... yeah... makes sense, but why so toxic..... and then I realised lol",
            "You know what's even dumber than the people trying to break into the industry after watching a few TikToks?\n\nPeople who visit this moody-ass subreddit. One day you could read a post or comment that gives you all the confidence in the world, and the next you could read something like this that makes you reexamine your career trajectory before it has even began.\n\nUnironically go talk to people in-person and leave reddit behind. You already have a good idea of what you need to do by browsing this subreddit. By getting yourself out there and talking to folks, not only will you get a better feel for what the market is *really* like, you'll be upping your networking game and mental health *at the same time.* Consuming all of these FUDposts will do nothing for your career.",
            "There are very few careers where you have a solid shot of making $150k out of college while working 40 hour weeks. Have fun going to medical school or working 80+ hours in investment banking for the same pay.",
            "[removed]",
            "This comment section has somewhat made me revisit a concern I had in that with the heavy advertising of the new era of software engineering/coding, an explosion of CS or CS adjacent major applications and grads, as well as the IT sector being advertised as an option without a degree as well as people who have found they want a career change whether for money or comfort,\n\nIt feels like CS has become saturated without really teaching anyone where the tech industry is making their money from, with a bunch of rising and falling startups and generally not really knowing how and what parts of CS/IT are growing in tangent with the amount of people learning. \nWhat would be good to read to learn about this stuff?",
            "my company hires multiple interns a year and ive noticed something.\n\nmost kids who apply for internships do nothing to stand out.\n\nmost resumes I see just showcase skills/projects that are part of the curriculum which makes it hard for any specific one to stand out.\n\nand its not like college kids actually know anything lol.\n\nso my question to the people whining about not getting callbacks or w/e.\n\nare you guys doing anything outside of school? do you have a plethora of \\*\\*meaningful\\*\\* (no a random website that doesn't really do anything does not count) projects to show? do you have the ability to somewhat talk shop about the industry at large? hell can you hold a conversation that isn't just code related?\n\nlike i remember interviewing this guy who built random discord bots for  his mmo guild. it was super basic shit like creating a bot to notify xyz captains/generals and start a call with all of them for big pvp battles.\n\nhowever it did show basic competency of being able to interact with 3rd party apis. and well..coding outside of class. most interns i interview can't even do that.",
            "I might just work as a truck driver.. $80k per year salary",
            "Hackerman! Really CS sucks. Syllabus is tough, exams are tough. You get out of college, job market is crowded. Plus AI takeover. I regret my decision to be here.",
            "spark touch tart direction groovy somber school deserted worthless aspiring\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "14yoe\n\nCS is absolutely worth it.  But you have to enjoy it.  Software dev became \"cool\" when that stupid Google shill movie came out, and now the industry is infested with people that lack the  desire to actually perfect the craft.  On top of that the quality of graduates is absolute dog shit - as someone that interviews and hires regularly I've found an almost perfect correlation between \"terrible\" and \"academia\".",
            "In my country the average completion of the degree is  almost 6 years. So here isn’t saturate, and you just have to be better than 60% to earn a lot. Do you really think it’s hard to be better than 60 people for every 100? Not really",
            "common cs new grad / student gatekeeping nonsense",
            "Tbh I’m sticking with it. I already knew it wasn’t gone be easy, but I realized I liked to work with computers and stuff like that. And I like challenges and I like to work without having to speak to a lot of people all the time.",
            "Lol, I dropped out of medical school and got a degree in CS. One of the best decisions I ever made.",
            "Go MIS route.  Easier than CS and we apply for the same jobs",
            "Says people without a femboy programmer bf",
            "CS.leave()",
            "I cant tell if this post is a weird way of throwing off competition, since 2000 people will see this at most so it aint like its fnna save your career",
            "Study math. Always study math. If you can hack it, you'll be a great 'grammer",
            "Tbh i agree",
            "doll historical price decide employ vast dime ludicrous squealing imminent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "There's never been a shortage and back in the early 2000s white males were getting walked out after training their H1B replacements for severance.\n\nNo one ever talks about this though...\n\nDice forums used to be popping with crazy stories.\n\nhttps://cis.org/Report/There-STEM-Worker-Shortage",
            "One hundred percent true",
            "Lmaoooooo OP actually removed the part of the post where he wrote\"Upvote to reduce competition, will remove this comment soon\"\n\nStick with CS IMO, CS has ALWAYS been saturated, it's a story as old as time but premed, law and finance are 20x worse. CS is by a long shot still the best shot for best WLB and salary. And even if CS didn't pay 200K+ at the very least you get a cozy air conditioned office job where you realistically work like 20-30 hours a day compared to how brutal going into med is, how LONG the hours in investment banking and law are. Your hour to work ratio will be by far the best in a dev job. Not to mention the extra amount of schooling and debt you take from lawschool or medschool lmfao\n\nDon't take my word for it either, do your research before you listen to gatekeepers or people saying \"you work 30 minutes a day and just eat food all day!!!\", it's obviously both extreme ends of exaggeration but this doom and gloom is nothing but people on the bad end of a boom and bust cycle who aren't being objective.",
            "Why is it not worth it? For me it was the best choice ever made...",
            "CS is superior to all.. Tech SWE working from home you can clear serious $$ in your pyjamas.",
            "You have to work your ass off and be consistently trying to get better on a daily basis .. it’s not easy at all",
            "CS majors come down to the individual, and the fact that you need to figure out where you want to specialize in. Theres really no hope for a lot of front-end web development for the most part. Go to a coding camp for web dev, and you'd be in with the sea of people who've done just that. There's too many of them doing it now. CS is probably one of the hardest programs up there with med school  and engineering disciplines. IMO. It can be dry as hell, and not everyone may know why their learning the math or other subjects. My professor said \"you need to know how to use it in your discipline\".  I believe the school systems now are complete trash when compared to the working world.\n\nThe major challenge is that true CS isn't for everyone one, because it's not just about being a code jockey and you only build fractions of softwares. Software engineering is for that. There's an expectation that you should be working on side projects and other frameworks that make it even harder. \n\nI personally don't get the point of doing shit tons of leetcode because it's mostly problems of various difficulties  (I've only skimmed leet code.) of things you probably should know from the degree. Practice is good, but work on frame works that can be used in modern technologies or learn that super niche language.  \n\nI finished my first degree in Business and a minor in computer science because I didn't know if I wanted to put the time in. It's definitely a sacrifice for sure.",
            "College dropout dev here - don't go to college unless you plan on doing postgrad stuff like OP says. Otherwise, just get a shitty QA job out of highschool and learn by doing.",
            "It is if you aren't top of your class, lack work ethic and suck at communicating. \n\nPlenty of average CS students will struggle, so they have to be okay with working at a help service desk or Wendys if they aren't a top candidate. But I would much rather do a trade at that point.\n\nEverybody and their momma wants in, a lot of you think you are the main character and deserve an opportunity, but the reality is there is someone better than you out there and you aren't special.",
            "As someone who is in healthcare trying to get into CS, dont do premed. Go to CS, law, or finance.",
            "Because getting into law school or med school is a cake walk and the bills that result are manageable? Grass is always greener.",
            "The negativity in this subreddit is amazing 💀",
            "CS is not bad at all. I am 43 now graduated at 41 in the height of the pandemic and secured a job that started around 75k, with 10% bonus, and now pays me 105k + 10% bonus. I work from home as well with a random office day here and there.  \n\n\nYou have to have a self starter attitude though. If you cant work on side learning, problem solve, and see the bigger picture other than the task that is right in front of you, you wont go far.",
            "Ridiculous.",
            "Well yes, it \"is not worth\", as they say, if you are only in it for the money...",
            "I took cs because i fucking love computers and math and it's just pure technology \nI didn't go in it to make money..\nIf you want to become a computer scientist just for the money then don't bother\nComputer Science is pure math and Innovation,",
            "Hey man. How's your first semester going?",
            "Was worth to me.\n\n170k starting out of college is possible, not easy, but v possible",
            "I really don't get you Americans and westners in general you literally have the best passport ever you could travel and build a company abroad if it's expensive here, all of you just want to cruise in a cushy job and not do shit, if you actually had skills you could build stuff not wait for a job for 6 months.",
            "People want that \"this is a day in my life as a software engineer in Silicone Valley\" lifestyle. Coffee shops and 3 hour office days making $80k.",
            "He said premed 😂",
            "Ah it feels good to have a developer job being self taught.\n\nIf you are lucky enough to actually have a CS degree or are getting one work harder. Get internships, learn more languages, do more projects, always learn new things. You guys have it easy.\n\nI was working for minimum wage and my roommate was being supported by his parents and getting a CS degree. He played video games. I studied. I have a job now. He doesn't",
            "This is definitely a warped perspective. Plenty of industries are desperate for technically sound software engineers. \n\nWhat they don’t want, is a fresh CS grad with zero work experience, and zero credentials.",
            "You don't need a CS degree to make it in IT.\n\nJust get some certs. \nStart at a help desk and work up.",
            "The problem is not competition",
            "Well, duh.\n\nAI made most nerds obsolete pretty much overnight.",
            "I'm self taught, coming up now on just about 3 years and starting the job application process, and I 100% guarantee you that my knowledge, experience, portfolio, and contributions destroy anyone who is graduating with a CS degree except possibly the elitist of the elite.  \nCollege IS a waste of time, if you love computers and coding, you should do that.  You don't need a college degree to become a programmer, and 3/4ths of your college degree will be in literally unrelated fields.  \n\nGo spend those hours learning, exploring, and writing code.  Create, contribute, apply yourself.  You will find a job faster than if you went to college, and you won't be saddled with $50k+ in debt.  \n\nLearn by doing, 90% of being successful in software is being able to quickly parse, and understand new content.  Want to build something, you gotta go read the docs on the API to understand it.  Trying something new?  Better go learn how to find your own answers.",
            "Agreed.",
            "I’m doing it because I’m getting it for free & getting paid to do it",
            "What did you think would happen when the people being voted into office tells everyone to “learn to code” instead of working some other job.",
            "Bruh, fr",
            "It's free bro?",
            "If you can stomach it go for finance for sure...",
            "haha",
            "Cs > premed",
            "Yeah, if you don’t like it, it’s not worth. If you like it, it’s incredibly worth",
            "[deleted]",
            "Ignore this post. Im going into my sophomore year and I have already had a lucrative internship. I promise you if you put in the work (leetcode, projects, etc...) you will be perfectly fine. But I will say it's a lot of work, but if you enjoy programming and problem solving you will love it. like me :) \n\nGood luck to all CS Majors and workers.",
            "I was prelaw before changing to CS. All of my college friends are licensed attorneys who hate their jobs or stopped practicing. My wife was premed and just finished her Biomedical masters and decided to change careers(into tech) after working at a hospital. My best friend is a Pharmacist who hates the state of pharmacy. Literally everyone says this about the path they chose.",
            "If your hard work pays off and you acheive your aim then it is worth it",
            "Working in the medical field or law almost always means minimum 60 hour work weeks, and you won't be doing all (if any) of your work remotely. Plus these industries are notorious for dealing with a lot of abuse.\n\nYeah those fields can pay well, but you're going to be busting your ass and dealing with a ton of stress. Not everything is sunshine and kittens when you're making good money.\n\nEveryone has a different idea of what they consider to be \"worth it\". Gone are the days where a new CS graduate can land a cushy low-stress remote job paying six-figures before he even gets his diploma, but there is still a lot of opportunity out there.",
            "All 3 of the jobs you mentioned are also absolutely terrible and awful time sinks that aren’t worth it. Maybe finance is okay ? The problem is that the labor market basically wants to chew you into pulp. I know doctors (work in healthcare) who effectively make less than I do (no degree) and work 110+ hours because the loans are huge and the education is many many years.",
            "I am currently in a CS grad program realizing I am not sure what the application of my degree is irl.. strongly considering a shift into healthcare informatics or into data analytics... Also realizing I strongly prefer working amongst humans and not alone at home or in the basement doing code in a dark room. But someone talk to me more about leetcoding. Bachelor's is a BFA btw.. how did I get here?? Haha",
            "Those are all significantly worse options",
            "Lot of people who sniff their own farts in here",
            "Hell yea keep thinking like this, more opportunities for me 🤷🏿",
            "As someone else said, yes please go away, so i can land easily a job and being paid at least 500k RAL\n\nI really hate to compete the market with people doing 6 months of bootcamp while im smashing my head with engineering classes",
            "In tech, but I do not recommend finance for people (I work at an IB firm). It’s still very hard and the job options are slimmer.",
            "Lmfao premed?? Hahaha. \n\nIf you fail at premed you’re left with a shit degree. Ask me how I know. Premed is not worth it these days. Sure you’ll eventually make a shit ton of money but you can just as easily build your nest egg over 11+ years that would be spent on schooling.",
            "Counter strike?",
            "Do we think accounting and/or supply chain management might be stronger degrees at this point? I'm going into Junior year i still have time to switch lol",
            "<3 CS!",
            "CS != SWE, there are people who actually like CS as a discipline.",
            "Well you heard it here first folks, guess we'll just pack it in then.",
            "I’m gonna go play farmer when I finish my degree. I’m over it",
            "Im sorry, i got caught up in figuring out this bug i have on line 567 in my meaningless program i made and been stuck with it for a month..... My code only has 120 lines.",
            "Stop stressing me out 😭 what should I change to?? Lets not pretend like any other major is any better fr",
            "I read this in Jian Yang’s voice for some reason lol",
            "It’s really tough but if you understand the concepts and can write basic code without resources I think you’d love it and more than that it’d be worth it.",
            "Lol, imagine grinding leetcode and projects everyday to compete with 500 people for an entry level job. Couldn't be me, I'm just a gender studies major helping 20-somethings find theirs.",
            "Unfortunately we came in at the worst time. Cs is the new business degree, every freshman who floats around with no direction for the first 2 years (most people) will default to cs because it’s “doctor money without the doctor degree”.\n\nAlso doesn’t help that there are numerous cs programs around the country that are completely useless. Outdated material, terrible professors, awful courses. New technologies are popping up every couple years and most unis are teaching you shit that’s 4-5 years behind (some 10, my uni had me taking vba and excel classes)",
            "I used my CS degree to teach abroad, take my advice is much better then actually doing CS",
            "that's what I figured you must have meant. I agree. I just wasn't sure what you were talking about because as far as I am aware there is no such thing currently as regulated media at least in the US",
            ".",
            "False",
            "I feel software engineering is the beetter than CS. I regret getting into cs but the way things are rn. Having a degree is better than not caz job market is pretty fucked. Don't see it getting any better in future tho.",
            "Its probably not the best time for this industry. The skill required to become employable will keep on rising ,thanks to rapid advancement in AI. From business pov you have to have good soft skills and from technical pov you need really good hands on skill. Both of these skills require real world experience in industry .I hope this gets better but tbh i am also not so sure . Nursing is really a good alternative , considering the overall world population is getting older.",
            "As a tech recruiter dude I think you're full of it two years ago I was working for Home Depot and we're hiring kids straight out of school at 90k as Jr devs with basically a guaranteed 105 lvl 2 at 2yrs in . Well I agree it's not the expectation that you'll get six figures it's pretty hard not to once you have three to four years of actual dev experience.",
            "And what about cs grads with a degree getting into business fields and we don't have a job now. 💀",
            "The problem is people go in here thinking they'll get rich",
            "Only if you are not a self-starter and need things spelled out for you",
            "Do you recommend getting into computer science after finishing my medical degree in a few months ?\n\nI'm working in a speciality that will be very soon closely intertwined with AI.  \nI have a small experience in coding Python, lua and some JavaScript and I would really like to transition into an IT position.",
            "Nah, you probably just aren't good enough to hire or you arent networking and just assume everyone is going to be just DYING to hire you because youre special. Every person I went to school with that put in the extra work found jobs at $80k+ within a month of graduating; most had jobs lined up a month or two before they graduated. \n\nIt's like I told one of my Jr's who was asking about me working towards my Master of CS. You get what you put in, just like any other degree in any other school. Getting a diploma doesn't make you hireable. Put in the work and you'll be successful; don't and you'll just end up posting crap like this on Reddit.\n\nIf you have put in the work and network yourself you'll do fine. If you're lazy, you won't 🤷‍♂️ It's literally like every other career. A CS degree isn't a golden ticket to 6 figure laziness.",
            "As someone with a bachelor's in CS, you are correct. Not a single company recognizes the degree. After being in the job force for a few months, I'd say that they are correct in not hopping at hiring someone new without any certifications or experience. It feels like experience trumps certifications trumps degrees.",
            "Godspeed",
            "CS is not worth *to those who can’t hack it*.\n\nFTFY",
            "Confirmed it sucks it's awful everyone go away",
            "Graduated recently. I can say without a doubt, if your parents are forcing you to attend University against your will, disown them, move out, and cut off all contact until they wise-up.\n\n5 years wasted studying Applied Computing. I had my health to focus on and held no passion, only to graduate and find myself unable to code.\n\nI loathed every day. I prayed daily to win a lotto ticket so I could escape that hell.\n\nUnless you have 3 years of work experience, good luck getting into any entry level coding job.\n\nI live in Washington state too. The \"dream\" is a myth. Nobody even hires an IT Helpdesk without work experience. It's all a fantasy.\n\nThis isn't the the 90's anymore, nobody will hire anyone without experience.",
            "I agree with you"
        ]
    },
    {
        "post_id": "196nn3i",
        "author": "Mike6969420",
        "title": "This is how technical interviews feel",
        "url": "https://i.redd.it/vqm485jzggcc1.jpeg",
        "score": 2726,
        "num_comments": 27,
        "created_utc": 1705259831.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/196nn3i/this_is_how_technical_interviews_feel/",
        "comments": [
            "\"I solved it in your name glorious Bezos\"  \n\"Hmm seems acceptable, but what if you solved without dictionaries\"",
            "https://preview.redd.it/of5v7xhspgcc1.jpeg?width=941&format=pjpg&auto=webp&s=dcc45b808a9b6cd3c7bf7f73e01f04bb8cc5ba61\n\nme thinking im making it to the next round right after (the solution was a 1 liner and i wrote 75 lines)",
            "Haha yep, theyre absurd\n\n\nMy brothers a carpenter, his last interviews were a chat with the boss over a beer at the local pub",
            "&#x200B;\n\nhttps://preview.redd.it/h1qmfrc48hcc1.png?width=1650&format=png&auto=webp&s=e66678da5a5e8351c0bd0e8e9670d9f0c4af7fdc\n\nNah it's more like this(the guy on the right would be the hackerrank test cases)",
            "Wish my interviewer was this handsome. Jk haven’t gotten an interview in 2 years.",
            "Fireship has a video called “Technical Interview Survival” with this as cover image and I loved it. 😂 highly recommend his channel",
            "Ok yes best comparison ever",
            "The supreme leader looks so sassy here, like do you even code fizzbuzz?",
            "LMAOOO",
            "Is there a machine gunner who can’t wait to commence firing behind the ‘coding’ man?",
            "Hahahahahaha",
            "Haha seems scary"
        ]
    },
    {
        "post_id": "19anhc6",
        "author": "rafecito",
        "title": "I got my first internship",
        "url": "https://i.redd.it/2eu395eoefdc1.jpeg",
        "score": 2710,
        "num_comments": 222,
        "created_utc": 1705682795.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19anhc6/i_got_my_first_internship/",
        "comments": [
            "Great, all the best for internship and hope you get a return offer.",
            "I don’t know if it’s just me, but seeing people get internships NOW is like seeing one of your friends who’s been through hell finally succeed. I use to envy those who got positions over me, but we’ve been through the worst together. We’re all rooting for you OP, go kill that shit",
            "Nice, now please make AWS less buggy",
            "Fuck you and congrats",
            "1RM deadlift squat and bench should be a section on all applications",
            "Congrats now pass the good energy to others",
            "Op ,do you mind dropping your anon resume?",
            "Damn nice job",
            "Nice job! Stats? (Bench, School, GPA)",
            "Omg nice!!! (I hate myself)",
            "Congratulations!! I did my internship at Amazon last summer. If you want to know anything feel free to DM me :)",
            "Hook a brother up",
            "Great man\nCongratulations",
            "Congratulations man!",
            "Can I see ur resume that got u this internship please?",
            "Congrats!",
            "Congrats bro, can you drop ur resume",
            "Congratulations. Enjoy this moment!!",
            "Congratulations 🎉",
            "YAY!!!!! Congratulations!!!!",
            "Nice. Hope u get an offer from them.",
            "Welcome to Amazon! From a fellow Amazonian.",
            "Seems like a few people are getting their internships these days",
            "Congratulations!!!!",
            "Congrats dude!",
            "Hey congrats! what year are you in uni?",
            "Congrats!!!",
            "Best email you can get! Congrats !!!",
            "Happy for you Op! Congratulations 🎈🎉",
            "Let me terminate you",
            "Congrats. Now lock in and get a return offer.",
            "Congrats dude! Are you a junior or sophomore?",
            "congratulations!",
            "It’d be cool if you weren’t working for the shittiest company there is",
            "At a FAANG no less, I foresee a lot of success in your future!",
            "fuck you and good job, hope you kill it 🔥🔥🔥",
            "Congratulations! I wish you the best in your internship :)",
            "CONGRATSSSSSSSSSSS.   \nI am taking the OA rn wish me luck (I'm shitting myself lmao) could you guide us through the interview? And how you prepared for it",
            "From all places AMAZON uuuggg.\nU can do better believe in yourself lol",
            "Congrats on winning the ticket to eventually become a corporate slave!",
            "What questions you got in the final interview?\n\nCongratulations",
            "Is an internship like this paid or not? \n\nIn australia internships aren’t really a thing i just went straight from high school (while studying) into a junior role working like 2 days a week - about the same pay as working at a grocery store.\n\nFor context i knew a bit of python but they taught me c# on the job. Couldnt really do shit for the first like 6+ months i don’t think.",
            "This is good. How old are you and how did you get it? Is it paid? Do they provide a place to live?",
            "Congratulations man. I'm looking for roles. How did you prepare for Amazon?",
            "Hi! I have my interview coming up, could we please set up a call on discord when ur not busy to help me out?❤️",
            "Hate these posts lol. Cant relate to getting anything back from the companies",
            "Nice congrats! What are your stats?",
            "How was the interview",
            "Which school ? What is your major ?",
            "Mind sharing your timeline?",
            "Do you mind sharing your resume?",
            "[deleted]",
            "Awesome 👏",
            "What is pay?",
            "May I know how you got amazon as your first internship?",
            "What was the process timeline",
            "How the fuck did you get placed in austin",
            "What's your tech stack , projects , resume , LC/Codeforces stats ?",
            "Hey man, A lot of ppl here are struggling to getto the OA. Could you tell us how you tailored your resume? Did you tailor it according to the job description.",
            "Previous experiences? Notable projects?",
            "Congratulations! If u dont mind, can u share ur cv in dm? It would help a lot..",
            "Gg boy",
            "Don’t do it. You will regret working there. I have worked at amazon",
            "Any tips on how to prepare for the OA?",
            "Congratulations. Do you get paid for this?",
            "Congrats OP",
            "Amazing wow.",
            "Forgive my ignorance, but are internships unpaid?",
            "Wtf man. You lucky! Congrats! I check my application every week but no update lol",
            "Congrats!!",
            "Hi when did you got oa and when was your interview",
            "Huge congratulations! Good luck and try to enjoy it!",
            "Runnnn! Seriously, congratulations. But note that Amazon is known for burning through software Engineers. So get some work under your belt, put it on your resume with stats for how your team helped, and put your resume out there.",
            "Congrats!! Would you mind sharing your resume?",
            "BRAVO",
            "Can you share your resume with me? I just want to have a look",
            "Confetti 🎉🎉🥳 what year are you in, out of curiosity?",
            "This is huge for you. Work hard when you get there and you're set for life.",
            "Great job I’m trying be like you my boy",
            "Congrats! Taking my OA next week.",
            "Congratulations man, as much as I envy you I love seeing people succeed and I wish you the best future",
            "Niceee congrats (i feel bad for myself)",
            "I have a question as a cs major in progress. When you get an internship in another place do you spend your own money to relocate or do you usually receive a relocation package or so they give a living allowance ? Ik it’s case to case but what is sometimes the case that you all are familiar with?",
            "Hi do you mind if I dm you? I have an internship interview soon!",
            "Congratulations. All the very best!",
            "Congratulations! Amazon has a lot of cool teams in Austin",
            "Is the USA market for interns improving?",
            "Congrats!!!!",
            "Congrats! A lot of ppl including me are still waiting for Amazon full time return offer after interning last summer. Hope the next intern batch won't suffer as much 🫠",
            "Internship is all about learnings.",
            "Congrats on the offer! I have my interview with them in 1.5 weeks. How was the interview like? Any tips?",
            "Congratulations and fuck you 😁",
            "Congratz!",
            "Lol at whoever the salty crybaby is, going through here and downvoting every single comment. Congrats OP, we’ll all make it eventually",
            "Are you at UT Austin CS?",
            "[deleted]",
            "Congratulations 🎉🎉",
            "How long did it take you to hear back after the interview? I just had mine yesterday and was wondering",
            "Congratulations bro! I was just wondering is that your 1st internship? Do you have any previous experiences?",
            "How much? Bet you earn more than graduates in the same role in London. (I want to cry)\n\nI previously did an internship in London with Amazon Robotics. The graduate role that they are interviewing me for pays less than the internship.",
            "Congrats, hope you have a good internship and return offer!",
            "Congrats!",
            "Congratulations!",
            "Nice I just got rejected from the same one today parallel worlds we live in.",
            "congrats (what the fuck how the fuck do you get even get internships while im given back too many rejection letters left and right FUCK)",
            "This is great, congrats!!",
            "Congrats work hard, learn harder make them want to give you a job offer in the end.",
            "Congratulations bro 😎 Can you give me some insides on the final interview the 45mins one",
            "Congratulations, could you please share your resume!",
            "\"I want to be him when I grow up\"\nCongrats on internship!",
            "Is this a paid internship or your working for free?",
            "Mind sharing salary or signing bonus?",
            "Can I see your resume ??",
            "congrats dude",
            "Congratulations man🎉",
            "did you use a referral?",
            "How was your assessment round?"
        ]
    },
    {
        "post_id": "18ui6mi",
        "author": "Adventurous_Storm774",
        "title": "For those that need a bost",
        "url": "https://i.redd.it/3hkmlrskbg9c1.jpeg",
        "score": 2664,
        "num_comments": 106,
        "created_utc": 1703950473.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18ui6mi/for_those_that_need_a_bost/",
        "comments": [
            "The last time I saw this, I looked up the dude and let’s just say he was never gonna fail lol\n\nDad was a chemical engineer, he had a 2.4 from an Ivy, and he had all sorts of other connections and upbringing opportunities that most people would never have access to. \n\nLike it’s great he overcame that 2.4 to go on to do the things he’s done, but him getting a 2.4 and having the resources to carry on is never going to be the same as some random middle or lower class kid trying to overcome a 2.4 at their state school while trying to exist off their financial aid package and scholarships.",
            "okay these exists for sure, but we got to know these are rare cases.  \nCollege is pretty easy compare to a job where you may end up on your own to solve a problem. Regardless it's never too late, and GPA doesn't define who you are...",
            "What’s it called? \n\nOh right Survivor bias lmao",
            "also before every job posting had 1000+ applicants",
            "Sure, grades \"don't matter\". The reality is many people with poor grades have poor performance in the rest of the application as well - e.g. LC skills, internships, soft skills etc. And you have some folks who couldn't care less about school, and thus have poor GPA, but are really hardworking and focused on getting a job from day one. So their minds' on building projects, grinding LC, networking etc.\n\nYou can try to delude yourself - yeah grades don't matter. The caveat is the lack of focus on coursework must be channelled into something useful so that you have something to show to employers by the time you graduate.",
            "Blatantly bullshit posts like these should be banned tbh.",
            "As someone who used to work in the space industry, this guy just cracks me up. Landing a spacecraft on another planet is the collective hard work of tens of thousands of scientists, engineers and technicians from all across the globe and this guy is saying “I’ve landed”???? Big douchebag vibes for me 😠",
            "my copium",
            "i did my undergrad in EE and had a low GPA . somehow i got lucky and got into master program. i worked my ass off, GPA: 3.8, published several papers and etc, Then i applied for PHD program and got rejected everywhere. i stayed at the same school to do my phd and my days are better now, but i still have nightmares about my undergrad.  i lost a lot of opportunities because of that. i wish i could go back in time and fix that.",
            "Did he land Curiosity and Perseverance on Mars?",
            "I think everyone is missing the point here. “Grades don’t matter” is the perspective that GPA is an unreliable metric in determining if you are cut out for a specific major. \n\nThe kind gentleman is not saying grades don’t matter at all.",
            "we need more modern day examples if u really want me to believve WAGMI rhetoric   \n(we're all gonna make it)",
            "Ok but that’s engineering, where getting a job is just posting your resume on an application with 8 applicants and doing an interview is how you get a job. Not like CS, where you do 3 OA’s and get rejected by 10,000 applicants",
            "His LinkedIn says he graduated with honors.",
            "And yet I'm almost certain every single job they post had gpa minimum",
            "all that knowledge but he's still wearing a mask               \nwhat an idiot",
            "Same here.  First semester I dropped most my courses and just scraped by with enough to not end up with a mandatory academic withdrawal. Had to take a whole extra year to finish first year, and only had a 1.9 gpa after all that. Clawed my gpa up to a 3.0 by the end of engineering.  \n\nHowever I managed to make some pretty good projects. Did some free work at a few professors labs. I tagged along with any of my friends that  got placements in labs and helped them out.  Lead to some very good reference letters- good experience that helped me get my grades up.  \n\nManaged to land a very competitive masters spot, with a full ride and a pretty good stipend, round 10k more then what kids in the program normally get.  Got a good paid spot in the respected research lab as well.  \n\nI’m doing better then kids with much better gaps then me, all because I was willing to poke my head out and claw at every opportunity I could sniff.",
            "I have all As and I don’t even know how to code because it’s all theory. What should I do? I can’t do leetcode or hacker rank yet. I just finished my data structures class. They didn’t teach us how to code. And focused on asymptotic upper bound run time complexity and trees.",
            "GPA doesn’t matter, but the development of GPTs does. \n\nThat will actually affect your chances of getting a job (#whereisGPT5)",
            "He came to STEM barely prepared but loved what they teach there.\n\nSome guys comes well-prepared. Dont even need to give a lot of effort on first year. Party more then learn and in the end they finish it with low scores and no passion.",
            "definitely needed this 😳",
            "Yeah grades don't mean much after you've been working a few years. In the start of someone's career, they do carry a little weight.",
            "Me in my senior year with no internships 😔",
            "Really hope my curiosity and perseverance pays the fuck off 🙏",
            "If you have a GPA above 2, as long as you're at a good, well renowned school, you'll get many more opportunities compared to those with 3.5/4.0s at regionally known schools. A 2.5 at like University of Texas - Austin will get you a high paying job at almost any big tech company. A 2.5 at your local university might not even get you a job in the area you want. Shit, even a 4.0 is a struggle if you're in a competitive field like CS or SWE\n\nReally depends on who you know and where you go in every way.",
            "I don’t care about grades. Grades care about me.",
            "thanks for the bost",
            "A great example of the WAGMI rhetoric.",
            "Barely holding onto my 2.5 but I just got a cybersecurity internship with mayo clinic next year",
            "Nepotism also matters",
            "Regardless of his ivy league background, they were handing out jobs like candy around the time this guy graduated. Terrible take",
            "It’s 2023, not whatever year he graduated. Atp everyone is an engineer 😭",
            "Regardless of the content of the tweet, the Curiosity/Perseverance pun is wayyy underrated.",
            "We don't need to be Turing or Tesla or Newton \n\nMost of the stuff done now is done by throwing just a lot of people at it and having them work at it for a lot of time\n\nThis is true of all stem",
            "My first midterm in my first engineering class I got an 18%. Ended up graduating with a 3.6 GPA.",
            "yes i definitely need a bost",
            "A 2.4 GPA in my education system is an outright fail",
            "Grades do matter. My calculus grades sucked and the dean wouldn't let me into the engineering program.",
            "Me meanwhile hitting 2.5 thinking about quitting the one day thinking about getting my master the next day, declining job offers the other day. Life is strange 😂😂👌🏼",
            "Hmm, some truth here.  I had to take an film class along with linear algebra for the 3rd time my last semester to get my GPA over 2.0 so I could graduate.  2.01 GPA.  That was 35 years ago, I've had a great career in computer science and software engineering.",
            "GPA doesn’t determine who one is. I took 3.5 years to get an associates degree, my GPA was a 2.47, I’m 25 years old. Now I’m in a senior college in my second semester and I have a 3.95. It’s who you grow as that’s more impressive than being a slave to books. People just have different paths and as long as one is successful that’s all that matters.",
            "Yep",
            "Everyone I work with has a 4.0 GPA from East Maharashutha Technical University, Uttar Pradesh, East Campus.",
            "The valedictorian is the one who graduates first in their class in high school. The word for the person who graduates last in their class in medical school is “Doctor.”",
            "2.4 gpa in the top university like Harvard is not the same as 2.4 gpa from the low ranked universities though",
            "Does cs graduates still care about cgpa? My cgpa is 2.68 doing more than fine compared to my 3 cgpa friends.",
            "The level of responsibility this man has too, insane... A lot of applications out there you can get away with writing some buggy code, but not with nasa. This kind of code has to be damn near perfect to go into production. \n\nIt shows ppl can start out not so good with someone and improve significantly over time.",
            "![gif](giphy|G4ZNYMQVMH6us)"
        ]
    },
    {
        "post_id": "18gs40g",
        "author": "Last_Consequence_231",
        "title": "I am just lucky",
        "url": "https://i.redd.it/9gdhdo2rlw5c1.png",
        "score": 2645,
        "num_comments": 121,
        "created_utc": 1702404209.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18gs40g/i_am_just_lucky/",
        "comments": [
            "This isn't applications sent out, this is companies applying to be OP's new workplace. \n\n&#x200B;\n\nNice work.",
            "What company is this?",
            "how do i create such diagrams?",
            "These kinds of posts give me hope. Thank you",
            "what are ur stats",
            "My first internship was my one and only application.",
            "Sent applications cold or had contacts?",
            "Was there oa or technical interview?",
            "This is what we dream for",
            "No you submitted 3 apps and you only got 1/3 thats ab as statistical as it gets",
            "“How’s your father”.",
            "Based on my own experience cold applying I don't know how this was possible, but I salute you",
            "[deleted]",
            "I actually had a dream last night I got a good offer on the first job I applied to. I was like wtf 😳",
            "The perfect trio",
            "Congrats but don’t do us like that",
            "You're just simply better",
            "You are lucky but you seize your chance. Great job!! Congrats 🤗",
            "Congrats! Manifesting this job hunting process haha",
            "Flex",
            "Congrats my friend!",
            "This reminds me of my own full time job search. Applied at 5 companies. Two interviews and one selection. I am still working on the same company 4 years later.\n\nMy internship search on the other hand was hell. Applied 200+. Less than 10 interviews and no success.",
            "I sent 14 applications, got 10 interviews (i ghosted 6 of them), 4 offers\n\nI had average grades from a highly theoretical/mathematical uni, no leetcode, only hobby projects, no internships.. the only really good thing was an exceptional bachelor's thesis, but idk for how much that counts\n\nBut I'm in Germany, so I now earn probably about half (53k p.a.) of what OP makes and after taxes it's only like 38k :( It's weird how companies literally apply to you here but still refuse to pay anything even remotely resembling US wages (yea, CoL is lower, but the ratio is still off)..",
            "Why the fuck do you nerds have charts of your interviews?🤓🤓🤓🤓🤓🤓🤓",
            "Why did u need to make a graphic flowchart for this😂",
            "Boomer stats",
            "[deleted]",
            "Didn’t ask",
            "Which app or site is this?",
            "thats great man! I've been to 10-15 interviews now, either ghosted or rejected. Hope to get something soon.",
            "Lmao, I can sooo relate to this! This year I completely gave up on finding on an internship, so I only sent like 5 applications and I got one.",
            "As an ex WSB member, congrats and f you",
            "How do you create this",
            "Pretty much the same happened to me. I reached out to a company that was hiring on LinkedIn, and I had a phone call the next day and was working there a few weeks later.\n\nI don't think it'll ever happen again like that for me. It was fully right place right time luck.",
            "The chosen one",
            "Congrats! Do you mind if I could dm you to see your resume?",
            "Luck is when preparation meets opportunity. Congrats 🍾",
            "I'm too ig, applied to one internship got there.",
            "Im in the same situation, just remove the yellow and green tracks. Pre economic downturn tho.",
            "Congrats brother.  How long did it take for them to reach out to you?",
            "Did you have to do LeetCode?",
            "this post makes me so angry. \n\nThe same feeling you get when watching a really rich kid get their whole life payed for by their parents and they throw it all away, and you have to work so hard for everything!\n\nmy own personal feelings aside though, good job man i’m sure you deserved it!",
            "Weird flex but congrats!",
            "How do people make this graphic??? Someone please drop the link LOL.",
            "Congrats, I hope that you find it fulfilling."
        ]
    },
    {
        "post_id": "1bc9ym1",
        "author": "Moo202",
        "title": "Uno reverse",
        "url": "https://i.redd.it/60xsn98oxqnc1.jpeg",
        "score": 2589,
        "num_comments": 63,
        "created_utc": 1710180839.0,
        "selftext": "I’m in such a power trip \n\n",
        "permalink": "/r/csMajors/comments/1bc9ym1/uno_reverse/",
        "comments": [
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)",
            "It was almost cool until the \"please tell me if I need to do anything else, daddy\".",
            "Did this to 3 companies last summer. Felt good",
            "Give it to me",
            "I'm so on the fence about rejecting Amazon CSA. I just don't want to do cloud support role and I have ML internship with Intel atm with good chance of return offer. If I accept Amzn and then reject a week before it is meant to start, am I burning this Amzn bridge?",
            "I did that to a company that almost got me for way less than the market rate. When I got 2 more offers the next week, I said, \"Increase my comp to match the rate with other companies\", they did, and I still declined. Felt sooo gooood. Fuck them fuckers. Also, they got someone to join for the same position a week later, whi left after 1.5 month. Lmaoo that position is still open after 3 months the.",
            "Tag me next time so they can give it to me",
            "you forgot \", FOR A PAYING JOB\"",
            "Original offer gets rescinded 😭",
            "I love that “while I am grateful”",
            "my g",
            "The chosen one?",
            "Did this to the companies who ghosted me 🤣",
            "I’d recommend expressing “future work” with the organization. I did it last year",
            "Lol nice",
            "Lisan Al Gaib?",
            "LMAO",
            "Okay. And now what?",
            "Adonissss",
            "Saving for future reference",
            "I have seen this happen a lot with interns. It is fine if you were interviewing at multiple locations and then had to pick an offer. It sounds like you may have accepted the other position first though. \n\nThe biggest worry is that the people you sent the letter to lookup where you move to on LinkedIn and then have buddies at the company and let them know. It’s just best not to burn any bridges and you never know who is on Reddit seeing this post…….",
            "😂",
            "[deleted]",
            "Plot twist: he sent that to his dad",
            "good for you bro but i guarantee they do not give a fuck"
        ]
    },
    {
        "post_id": "1bmnuhw",
        "author": "maitreg",
        "title": "Recruiter breaks down 3000+ Applications received on a single job posting",
        "url": "https://www.reddit.com/r/csMajors/comments/1bmnuhw/recruiter_breaks_down_3000_applications_received/",
        "score": 2569,
        "num_comments": 368,
        "created_utc": 1711295258.0,
        "selftext": "This topic comes up frequently on this sub. This is the reality of those huge numbers of applications you see on online job postings. This recruiter's experience matches my own when hiring in the past couple of years, and it's getting worse. If you see 1000+ other applicants, that doesn't mean you are actually competing with 1000+ applicants. Those numbers mean almost nothing in 2024.\n\nhttps://preview.redd.it/851cmh7lyaqc1.png?width=534&format=png&auto=webp&s=d66b12b53a50acef9193d73419be4c84673acf50",
        "permalink": "/r/csMajors/comments/1bmnuhw/recruiter_breaks_down_3000_applications_received/",
        "comments": [
            "What If I’m willing to relocate immediately for free..",
            "Jesus, 28 days? Imagine being one of those people who actually got through the whole loop only to see rejection at the very end. What a waste of a month.",
            "Tagline: remote-first\n\nThrows out 1662 resumes due to location",
            "This stuff from the hiring side is always interesting to see in detail. We are always guessing how the hiring process works because to everyone (except the hiring team) it's all a black box.",
            "It’s bad but nowhere as bad when you remove the 2,401 applicants who applied for giggles(visa and location applications)",
            "What about the other 5 that completed the entire interview ? 🙃",
            "And all the new \"Let AI do your applications for you!\" sites are going to make the situation even worse.\n\nGlad I'm not a recruiter.",
            "The 763 that didn’t showcase I am assuming did not have all the requirements on the resume were automatically sorted out?",
            "Interviewing 6 candidates for a single role is kinda fucked, unless if they each failed one at a time. Not just from the candidates side but as an interviewer you’re making me do 6 loops to hire one person?\n\nAlso wtf with the location the company is literally called “Remote-First”",
            "Now it's recruiters' turn to send sankey charts...",
            "So I complete all of those frustrating nerve wrecking steps that probably take weeks to complete, pass all of them and then still have to be the best from those 6(!!) people remaining?\nThat's ridiculous, like how big is the chance to make it this far and then you have to still be the best out of the six best applicants?\nThe point of this post seems to be that 99% of those applications are not relevant and there is a point in trying.\nI don't really see that, like I have never been the best in anything, why would I be in this process involving over 3000 applications?\nIt almost seems unethical to torture people like that.",
            "So now you are completely fucked if you don't even live in a the city that has the job, but you cannot move to that city because it cost to much money to move to the city, and the rent would be too much for a basic labor job. Because I would relocate for free if the offer is good enough.",
            "124 is still a large number to compete with for short lists and so is 6 during final stages. Don’t get it twisted it is still very competitive and the margin for error is very little, even if you aren’t competing with 3000.",
            "It's weird that there is a remote first in the recruiters tag but more than half were rejected based on location. There needs to be more context such as were they hiring in those states regardless of location? How many people clicked the box that they were willing to relocate? What was the actual job posting? Was this entry level? Yes that matters because entry and people with less than 5 YOE is being hit hard. Wanna bet it didn't have any of that mentioned.",
            "+3300 applications for a single job? What the actual fuck?",
            "right off the bat the post is already BS. 1662 aren't located in the right area?? so you only want locals???  there's something called relocation??",
            "What is cultural interview? ",
            "“Remote-first” but requires applicants to be in certain hiring locations…",
            "Extended an offer to only 1 candidate? Cruel",
            "I posted a job opening and got over 1k applicants.\n\n\nThis is what i did:\n\n\nI added one question:\n\n\nI am a industry expert with over 60 years of experience.\n\n\nAnyone who answers yes are auto filtered out.\n\n\nAnd just like that bots are no more.",
            "And yet they still fuck around and run 5-6 rounds of interviews for the lucky bastards and a take home project. Nah. You bred and cultivated this shit show, don’t complain.",
            ".03 % acceptance rate . 3000 for 1 opening? 😂 give up if you are a cs major and becum a finance bro",
            "[deleted]",
            "Can confirm. As a tech recruiter, I've yet to see anything above 3% on average of applicants suitable when applying.",
            "Jesus fucking Christ that’s bleak",
            "Those are some neat randomly chosen numbers",
            "Why location is so important? People can move.",
            "im sure this was all filtered out through a database and not manually.",
            "Two button clicks to filter down to 124 candidates, then let’s say two hours to parse the resumes by hand assuming 1 min/resume. Allow me to bust out my violin, you had to spend two whole hours coming up with a shortlist which still had an ample number of people to pick from.",
            "Fuck take home exams",
            "Recruiters really think they’re the shit.",
            "125 competitive applicants competing for one job is still pretty fucked",
            "Welcome to recruiting Oblivion. So, basically, in 50 days they did read 150 cvs and made 15 interviews . That is what I call hardworking! Congratulations HR team, for beeing as useless as you are supossed to.",
            "Her tagline says “remote first” yet they disqualify 49% of candidates that didn’t live in a city with an office?\n\nAgain, the problem isn’t you: it’s HR. The problem is the brief she was given and what this company thinks is important. \n\nYou don’t want to work for this company, and they probably don’t want you either (faking growth).",
            "Oversaturated major!!!",
            "Use tools!  3164 of 3360 +7 referrals didn’t met basic criteria.  Your resume system should have sidelined them in a received bracket immediately.  That leaves 196 +7 referrals to peruse.\n\nyou short listed 124 of them, which is 63% of the resumes not lacking basic criteria.  Which the hiring manager narrowed to 43.  Did you really get paid for this?  The hiring manager really only wanted to consider 1/3rd of the people you forwarded.  You screened half failed, and then half of the half that remained stilled failed the next step?\n\nLearn whatever it is you’re attempting to staff so a 2 minute conversation will clue you in if the person has a clue what they’re talking about.\n\nOMG they’re paying headhunter fees so someone can go oh don’t near the zip code.  Sheesh.  Dealt with this garbage as a hiring manager so many times where the screeners had no idea what they’re screening.",
            "So that's it for the IT job market in North America?",
            "This just seems like such an inefficient way of going about this. \n\nI think a mandatory regular evaluation orgs enforce on engineers or which you pay to carry out could be a good approach. Then the company that carries out the evaluations can matchmake job changers with the orgs and remove the need for interviewing entirely and cut out the middlemen/recruiters from the process.\n\nA company the size of LinkedIn would be well positioned to push this sort of alternative.",
            "Remote jobs are spammed by indian, others asian and african people that apply to those jobs when they don’t qualify requiring a VISA.\n\nWhen you either needs to be alocated in the same country, state (probably) and requires VISA.",
            "Still rough, you are competing vs 300 people who meet resume requirements, and even if you pass all interviews well you compete with 6 others for 1 single top dog for the position… rough",
            "get out of CS.  The trades are begging for people.  Tech jobs are full.",
            "this is jarring. This phenomenon has to explain why anyone who is less sophisticated or disadvantaged will not understand the modern approaches for getting a job interview. I don't think school counselors even understand",
            "And people say AI had nothing to do with this😂",
            "What if I'm applying because I'm moving there?",
            "Matches 100% of my experience! Not only for recruiting but other areas as well, e.g. when searching for a flat / tenant.",
            "The fuck is cultural interview?",
            "4-5 interviews to make a hire and arbitrary unmeasurable HR KPIs sound like the real hurdle here.",
            "yeah the issue is here is clearly the 763 that didn’t showcase basic skills or experience .  like i have a cs degree do you really think i need 2 years of excel experience on my resume to prove that i can perform the functions of a data analyst?  absolutely wild",
            "what do point 3 and 4 mean?",
            "Basically sounds like the average buyer of an online sales listing.",
            "As a recruiter that process is broken as hell too. 50 days to fill one job is horrible.",
            "Yeah I am switching majors ,…… that’s it",
            "Take home evaluations??",
            "What if we leave our address out of our resume?",
            "Hm. The 1662 and the 763 are the biggest concern to me. How does a recruiter know from a piece of paper run through ATS that someone doesn’t match the requirements for a job? How do they know that someone can’t move readily?",
            "Here in India, most of the intern positions are unpaid or severely underpaid. And they even expect us to relocate on our own expense. After 2 years of MERN experience, I won't working for free. I'm launching my SaaS, it's completed but I ain't getting access to a payment gateway, all because of the government.",
            "Take home filtered out only 2 candidates out of 11, that means it was a waste of time",
            "The location requirement is silly imo, as this applies to nation-wide candidates too. I had jobs not take me further in the application process because I live 4 or more hours drive away. Many of them had contract starting in 2 months or over, which is more than enough for me to relocate. It's a forced restriction that shouldn't even exist, especially on high-skilled or graduate markets.",
            "I appreciate the breakdown, but I still have no sympathy for recruiting teams tbh. The entire job search/recruiting landscape needs to change.",
            "This tracks with EXACTLY with what I've been hearing from technical recruiters for the past 5 years. 90 to 95% of the applicants are completely unqualified.  The only difference between right now and 2019 seems to be that there are a higher absolute number of qualified applicants to go along with the higher numbers of bullshitters applying.",
            "My company gets on average 30k applicants per job post. It is relatively easy to make it to the screening level if you meet the qualifications because so many do not but 10x everything here and add a step where they short list the applicants by checking boxes for racial stats, gender and orientation, and only allow top university programs or fellow faang companies representation in that group. Gotta cut it down and no one documents the reasons why they don’t consider people so no discriminations. Just a closed door meeting with a group of technical people and hr, you propose someone to move forward as a technical reviewer and HR says no until you propose who they want.",
            "So few jobs? Pity.",
            "People need to stop doing take home assessments. \n\nYou're really gonna do a 1-2 hour quiz for a <5% chance at an offer(that might not even be that much money)?",
            "Take home assignments are bullshit",
            "You're still numerically illiterate if u think this changes anything. 1/21 and 1/11 are still stricter than anything other than the ivy league.",
            "Needs more emojis, I can't read words.",
            "But I wanna know in all this which I don't think she included to avoid heat did any of the referrals made it to the last rounds or actually hired 🤔",
            "When they say \"didn't showcase experience or skills\" what do they mean? Bad resume?",
            "Funny enough, I recently got an interview with a conpany through networking.  Interviewed with the whole team, they seemed to like me and asked me to apply online so the HR recruiter has my info and can send it up a level for another interview round.  Within minutes of submitting my resume I got an automated email that I was rejected.  I reached out to the team and they got my resume through whatever keyword search/filter was in place.  Interviewed up a couple levels of management after that and got a job offer.\n\nI’ve always wondered what the impact of these ‘AI’ filters is for job applications.  I know I wouldn’t of gotten the job had I not met some folks and a conference and backdoored my way in.",
            "I've recently had a recruiter tell me they're not doing tests anymore as the candidates hate evaluations. I'm in their \"applicantzone\" limbo btw.",
            "Prescreening, call with hiring manager, take home evaluation, technical interview, and a motherfucking \"cultural interview\" these people are fucked in the head",
            "Eh, I’m still applying for whatever I can because I believe in the rule of large numbers. I used to do IT in telemarketing. Someone will say yes."
        ]
    },
    {
        "post_id": "1apqb5p",
        "author": "killuazivert",
        "title": "DON’T QUIT",
        "url": "https://i.redd.it/37gh07k9xbic1.jpeg",
        "score": 2513,
        "num_comments": 144,
        "created_utc": 1707819860.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1apqb5p/dont_quit/",
        "comments": [
            "I have 999 apps and was just about to quit until I saw this post. I will now go apply to more jobs, wish me luck!",
            "when you think about it, this is the same line of reasoning gamblers use 😬",
            "I’m done. Working on my own business because if I keep applying and do nothing with my life, I will have nothing to show for it.\n\nLet’s say I do want to get hired, what am I gonna put on my CV? “Applied to jobs for 2 years straight” ?? 💀💀",
            "Am I the only one here in this bubble who just want to live a regular 9-5 stable lifestyle and don’t care about making six figure unless I’m in a HCOL area? \n\nSeriously, I don’t get why the American dream of a stable job, stable house, stable income supply, stable relationships, stable lifestyle, etc. is so fucking difficult to get. If anything I get why it’s hard, because hard work and success pays off, but for those who are stuck in my situation with shitty family, no support system, disability, etc. it’s going to be a hard decision for many to consider which one they should sacrifice in getting that dream.",
            "Maybe if the places where people GOT skills to work in those jobs had a pipeline, instead of being left high and dry when they’re looking for jobs, maybe we wouldn’t have this issue\n\nEducation should pay its students back with work, no questions!  If it can’t get someone a job, it shouldn’t cost a dime.",
            "[deleted]",
            "People need to realize not everyone is going to get a 200k+ TC offer for ENTRY LEVEL. Like cmon bro some of u ppl r delusional and need to get a life. Dont u want to have time to do things other than just work💀 i understand wanting 90k - 100k TC if ur not in a super HCOL area but ppl need to chill w the 100k+ especially in a time like this",
            "These are the same people just at different points in their careers. The top one will also work very hard to clear it all, but by the time they are close to the elusive offer, they are tired and it’s time to retire.",
            "Sunk cost fallacy",
            "I have a job, but having the same issue with online dating (keeps getting ghosted or rejected) . I felt terrible about myself until seeing this post. Thanks op.",
            "**If it's almost a year and you don't have a job, it's not hard to see why people go elsewhere.**",
            "What r u gonna do after u quit applying? Nothing. So might just as well keep going",
            "not the 250k offer but just got an offer a month ago, I stopped tracking my application when it's over 500+ but feels like I applied a little more than 800+.  LFG GUYS",
            "Too late  \nam now professional people person instead of professional programming person.",
            "Maybe prequilify guys to work something else. If the job market recovers you can always go back",
            "FUCK YOU AND YOUR MEMES 🤬",
            "This is v true.",
            "Fr fr",
            "I just started applying today lmaooo\n\nI'm screwed no internship for me",
            "Ahaha not even Jane street pays that high in the UK",
            "You guys gotta start saying which state you’re in because it just makes the whole sub look bad w less info…",
            "1000+ is ridiculous any way you slice it though, just saying. I’m still applying though",
            "This is starting to feel like wsb",
            "What’s the cheat code ? Knowing the right people ?",
            "Why is it like this",
            "Keep applying but also start a side business it doesn’t even have to make money it’s only there to pad your resume",
            "I am the 1% of gamblers that win big",
            "If you're hitting that many apps without a response there's probably an issue with your resume or application that isn't making it through filters. Remember to constantly revise it through the process.",
            "lol no",
            "Brother you ain’t making that much money right out of college unless you’ve already had experience",
            "applying where? theres literally no postings for entry level (0 exp) jobs.",
            "This made my day! , I recently got laid off",
            "I just read online that a recession is likely to hit this year, I guess I'd have to soon pack my bags and leave this country.",
            "Thanks for the motivation I'm going to start applying from now on again!!!",
            "I stopped applying about a week ago cuz all i would get was rejection letters. Was starting to consider a minimum wage job for some quick $, UNTIL I SAW THIS POST. Starting to grind applications again, thanks for the motivation.",
            "‘Bum’\n\nWell that’s enough self reinforcing positivity for one day",
            "Insanity: \n\n**doing the same thing over and over expecting a different result** \n\nGive it up and move on. Its not for you",
            "I pray one day CS majors will look past SWE. CS is a very hireable major .",
            "Do you guys write cover letters for every application?",
            "I’d rather sell pickaxes",
            "This... actualy hugely motivated me. Im so so so scared about me not having all the skills that  college goer's have, but i also dont have time at the moment to put in to learning that.",
            "Making a believer again are you!!"
        ]
    }
]