[
    {
        "post_id": "17n3xxj",
        "author": "gtighe",
        "title": "My Small Internship Search Summer 2024",
        "url": "https://i.redd.it/9gqnviplx6yb1.png",
        "score": 834,
        "num_comments": 78,
        "created_utc": 1699042507.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17n3xxj/my_small_internship_search_summer_2024/",
        "comments": [
            "Got 2 offers with 12 applications in total? Damn Congrats!",
            "How tf, thts an insane ratio compared to what I've seen in this sub before",
            "Last summer i had 575 apps, 1 interview,1accepted.   \nYou seem to be god's favorite child.",
            "For context I am a 2nd semester sophomore with an internship last summer that I am still working at and will continue working at until next summer. I didn't apply to many because I wanted to stay in my area. Pretty happy with the result.",
            "that's actually pretty good ! 12 applications with 2 offers dang \n\nwe're you applying to local companies?",
            "[deleted]",
            "Can i see your resume?",
            "sometimes it’s just luck, I applied to one and got accepted so didn’t bother with anything else.",
            "Impressive! Congratulations!!",
            "Meanwhile 500 applications and dead silence 💀",
            "The lines for swe jobs at my schools career fair were so long you could only talk to 2 companies max",
            "Which company did u get accepted in? Did u apply through a referral ?",
            "Love the diagram! How'd you make it? Congrats on the internship btw!!",
            "Do you mind sharing what you’ve got on your resume? Or anything else that may have got you these results?",
            "Bro wtf. I think I have experience making an application for my retail job that handles paint orders. Thought that’d be good but nothing",
            "OP, congratulations!!\nIt would be great if you could share your preparation experience and anonymized resume. It would help an incoming freshman. Thanks and good luck!",
            "did you have like ab exceptionally high gpa?",
            "Can I see the resume as well please. Struggling a lot with my internship search",
            "Can I also see your anonymous resume please! Do you have side projects on there ?",
            "Not CS but compared to an entry level job does getting an interview for an internship carry a lot more weight? 3/4 of the interviews I’ve received for an internship I got an offer. OP seems to have a somewhat similar experience. Is it common to get the job after an interview offer? Whereas in a job just because you get the interview your chances are still slim",
            "Drop the CV bro, that's insane",
            "Where did you apply through?",
            "Did you do any projects? Or grind leetcode for this?",
            "How do you go about finding small companies to apply to?",
            "Were interviews remote and how hard were the leetcode questions? And was the behavioral all just standard questions?",
            "Lol you got just in 12. Here applied 200+ and 3 interviews and lots of rejections.",
            "This is impressive, well done!",
            "What company are u working at tho",
            "You are sooooooo lucky.",
            "How do you get this statistical diagram looking thing?",
            "For anyone that’s saying these results seem to goo to be true, career fairs make all the difference in my experience. I attended a career fair recently at my university and got 7 interviews. I have been made offers by 2 and still have more interviews to go. One of the offers there was no interview other than the 10 minute conversation I had with the recruiting engineer at the fair.",
            "hey OP, I am struggling to crack an internship offer. Can we connect? I need some of your tips and guidance..."
        ]
    },
    {
        "post_id": "13ntff6",
        "author": "John-The-Bomb-2",
        "title": "Why FAANG isn't that great, from a former Amazon engineer",
        "url": "https://www.reddit.com/r/csMajors/comments/13ntff6/why_faang_isnt_that_great_from_a_former_amazon/",
        "score": 828,
        "num_comments": 225,
        "created_utc": 1684674814.0,
        "selftext": "There are a lot of CS majors who aspire to work for the FAANG/MAMAA companies the same way some high schoolers aspire to get into Ivy League universities. As a former Amazon engineer who worked on the AWS Virtual Private Cloud service back in 2017-2018, let me explain to you what is wrong with that line of thinking.\n\nThe first thing you need to keep in mind about any real job is that work is normally exploitative, and big tech jobs are no exception. They give great starting salaries compared to other junior developer positions, sure, but there's a catch. They lose money on you during your first year working there with no experience with the expectation that they will make that money back from your labor later on when you know what you're doing there. Big tech companies like Amazon and Facebook often use their own, internal, company-specific tools that aren't used at other companies. For example, Facebook created and uses the Hack programming language that nobody else uses (it started as an offshoot of PHP with types added and became its own separate programming language sort of like how C++ started as C with classes and then became its own separate thing). Amazon's core services run on Amazon's unique internal deployment engine called [Apollo, which you can read about here](https://www.allthingsdistributed.com/2014/11/apollo-amazon-deployment-engine.html) and are built by Amazon's unique internal build system, [Brazil](https://twitter.com/GergelyOrosz/status/1568190805948473344?s=20). Most companies put their applications that run on servers in containers like Docker, deploy/scale their containers with say Kubernetes, and can use the AWS Elastic Container Service (ECS) that handles the deployment and scaling of your containerized apps automatically. For building, they may use a common, open source build system like Maven for Java, sbt (Scala Build Tool) for Scala, or whatever build system your programming language normally uses. The problem with only using and mastering tools that are only used by one specific employer like say Facebook or Amazon is that they don't teach you what is commonly used outside of that company, so what you were taught isn't as readily transferable to another employer if you get fired or choose to leave. Essentially, there is some \"employer lock in\". You may look around at the facilities at say Amazon or Google and go \"golly, gee, there's the Super Smash Bros videogame in the lunch room as well as games and free food, wow\", but that stuff isn't just there to make you happy, it's part of the \"employer lock in\" to keep you from leaving. Once you're locked in and are acquainted with their tools and processes and stuff, they're making profit off of you. If you instead worked at a \"regular\" company using \"regular\" commonly used software tools like say (on the backend) the ASP.NET Core framework if you're coding in C# or Spring Boot for Java Spring, you will have skills that you are already deeply familiar with that you can immediately transfer over to another company. At Amazon the backend was in Java which is a common programming language, sure, but they used their own unique custom internal framework called [CORAL framework](https://www.teamblind.com/post/Why-amazon-uses-CORAL-framework-and-not-spring-boot-OPgpbvqu) which I think had some Java Spring in it but was a totally custom thing, not the usual stuff that's used at other companies with Java backends. Also, unlike with common open source frameworks and tools, there are no books on say CORAL Framework or the Hack programming language that you can buy on Amazon and read before bed the way there is for say Java Spring or Docker or whatever (which is an issue for me personally because I learn by reading technical books).\n\nWhen the money supply shrinks or a recession happens causing layoffs, or your performance isn't great, you can get fired, and when that happens you want to be able to find another job quickly and be useful at that job. Sure, having \"Amazon\" at the top of your resume gets the attention of recruiters from India on LinkedIn, but once you get past that stage you have to actually demonstrate your usefulness to prospective employers on their particular system. I've had prospective employers tell me, as part of their interview/hiring process, \"build a JSON API that can be used to play a simple card game\" or something like that, where the deck of cards is represented as an array of integers. I can't build that HTTP REST API with Amazon's CORAL Framework because that framework doesn't exist outside of Amazon. Instead I have to learn some common, open source framework that is generally used, like maybe Java Spring Boot or Express on Node.js for backend JavaScript. And like if I work for Facebook and I've been exclusively programming in the Hack programming language for 4 years and then all of a sudden I get fired because there's a recession, I can't do the coding interview at other companies in the Hack language, other company's coding test probably doesn't even support it. I have to learn and use something more common that other people and companies know, use, and support. \n\nSo definitely keep that in mind and have a second/backup tech stack and skill set handy with demo projects that use it in case you ever get fired and need to find another employer outside of the FAANG/MAMAA companies. Ultimately a job is just an exchange of your time for money and an employer is just a source of money. Some people embrace the idea of living to work, but really you should be working to live. Before you accept an offer, establish how many hours a week you will be working so you can have a life outside of work. Don't make your employer think that putting in Herculean (like Hercules) effort is the norm, causing you to get burnt out in the long run. First and foremost, watch out for yourself. Amazon is just another company, and they will put their customers, their shareholders, and their leadership/executives before you, their worker.\n\n**Edit 1:** One person commented \"but the big concepts carry over between companies\". And they can, like common object oriented programming language features can transfer over from say Facebook's Hack language to say Python or like the concept of container deployments can transfer over from Amazon's Apollo to Kubernetes. But there's definitely a learning curve and it's not instant, and also in my case I have issues with my brain which made learning new things increasingly difficult over time. If you know what skills/knowledge you need to learn or transfer over ahead of time and put in the work to do it before you get fired it's usually not that bad, but in general I don't like any sort of specific lock-in and in some places lock-in is an intentional feature and not a bug.\n\n\n**Edit 2:** Also, even though the starting/junior salary at FAANG is higher than at \"normal\" companies, if you never get into leadership, management, or anything upper management or executive, their mid to late career pay isn't that amazing. Yes, you get a pay bump from L4 (junior) to L5 or L6, but then your pay from then on is flat forever. If you used \"standard\" technology and built systems for \"regular\" companies for that duration of time you could be designing/architecting whole systems from scratch at other companies, setting the rates, and getting paid better than what Amazon would be paying you. One guy described it like this \"if the system is a car, at Amazon I was fixing the tailpipe while at this other company I designed, built, and installed the engine\". The same person, after 10 years at Amazon, could still be designing and building tailpipes while at another company they could be designing and building the engine or even the whole architecture of a car from the start. Your job title at a non-FAANG company could be \"enterprise architect\" instead of \"senior developer\" at FAANG. See [this comment](https://www.reddit.com/r/csMajors/comments/13ntff6/why_faang_isnt_that_great_from_a_former_amazon/jl1sunu?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button).\n\n**Edit 3:** Oh, and at Amazon you sometimes get woken up by the pager at 3AM because you're \"on call\" and something bad happened with the system. See [this comment](https://www.reddit.com/r/csMajors/comments/13ntff6/comment/jl3bgar/?utm_source=share&utm_medium=web2x&context=3).\n\n**Edit 4:** Also, FAANG jobs are more likely to be in very high cost of living areas. After I left (was forcibly asked to leave) Amazon with less than 2 years of experience in total, I got a job coding for a bank at $86 an hour on W2 in North Carolina where my rent 3-4 blocks from work in the center of town was about $1350 a month. Yes, your pay at say Google is a little higher then where I worked after I left Amazon, but your cost of living in Silicon Valley (and even other locations like New York, Seattle, and Washington DC) is much higher.",
        "permalink": "/r/csMajors/comments/13ntff6/why_faang_isnt_that_great_from_a_former_amazon/",
        "comments": [
            "As a former FAANG guy myself, I can tell you're from Amazon.  Bezos required wall of text.\n\nJust give me the goddamned bullet points! :-).",
            "I've been at amazon for 12 years. Lots has changed. For example:\n\n* Build system is moving towards idiomatic build tools like gradle and npm.\n* Apollo is basically dead. Teams are using AWS for continuous deployment \n* All new systems are built on AWS, which is clearly transferable knowledge \n* You learn to build systems at high scale, which is a unique skill most don't have \n* The common languages nowadays are Java, Kotlin, and Typescript\n* The pay is very good (I am approaching 800k TC as a principal)\n* The stock you hold is generally more reliable vs. a start-up with an unknown IPo timeline\n* If I wanted to move companies, leetcode is the skill I need. Not some specific technology.\n\nHard disagree. And a side note: Amazonians learn to write concisely as they move up. Long rants tend to be ignored",
            "An opposing view, but FAANG really IS that great, especially if you have no prior work experience (eg recent grad).\n\nA FANNG company on your resume propels your career by a significant margin as compared to a generic F500 or start-up.",
            "I spent four years at Amazon and generally agree with these points.\n\nThere's one more that I think bears mentioning: \n\n* You will learn more at small companies.\n\nOne of the main reasons I left Amazon was because I felt I wasn't growing as much as I had at small company jobs I'd had before.\n\nAt a FAANG, you'll be one engineer of thousands. You will own a tiny part of a tiny cog in that machine. Ninety percent of your job will be grunt work. When something technically interesting does come along, you won't own it. FAANGs already have world-class experts in multiple domains. They will do the most interesting work and just vend you their solution.\n\nAt a small company, OTOH, you have way more impact and opportunities for meaningful, interesting work. When interesting or challenging problems come along, you and your team get to solve them.\n\nThis isn't just an Amazon thing either. I have a good friend from Amazon that spent three years at Google and he left because the same thing happened to him there. \n\nFAANGs hire the best of the best, and then put most of them to work on the boring stuff.",
            "You can't really encapsulate FAANG by having spent a year or so at the most notoriously nightmarish big-tech company.",
            "Recruiter is still gonna hire a layed off Google employee than some rando",
            " Yea yea let me see for myself once I get in",
            "Bad take IMO - if you are familiar with how VCS works, you shouldn't have too much of a problem jumping from Git to Mercurial to whatever else. If you're familiar with Build tools, should be too hard to go from Brazil to BLAZE. It's a core understanding of what the tool actually does that matters, not the tool itself.\n\nIt's like how if you know one Object Oriented Language, it won't be hard to pick up another. Their internal tools aren't actually limiting you, just exposing you to a slightly different way of doing things, which is a good thing. It helps increase your understanding of why certain things are and function a certain way.\n\nAlso the pay is crazy",
            "Couldn't get through your post because it's too dense, but I wanted to give my bulletpoints for why I love working in non-tech companies. Just in case it helps someone who's trying to decide what industry to go into. I've worked in the technology arm of a healthcare company, then telecommunications, and now insurance. Here's why I love it:\n\n* Most people in the company have no idea how long shit takes. So we set our own schedules. Which means we work pretty slow, compared to a lot of tech companies. Expectations are also very reasonable.\n* Bigger emphasis on WLB. Most tech companies have just accepted that the average tenure of a SWE is 2-3 years, so they try to squeeze as much out of them in that time as possible. We don't accept that over in the business world! We want and expect our engineers to stick around for awhile, so we try not to burn them out\n* Tech isn't the main thing we do, so there isn't such a rush to get stuff out the door. That means less death marches and less encouragement to overwork. WLB really is great!!! I see FAANG engineers constantly complaining about overwork, but I work like 25-35 hours a week.  \n* I get a LOT of exposure to business stuff that I wouldn't at a tech company. It makes it easier to jump roles or even entire career paths.\n* You get to work with a lot of people who were hired for their social skills. Which makes it easier to make friends, and socialize. My scrum meetings are never uncomfortable. I love my team! I love working with other lines of business too.",
            "When you mention that there are skills that don’t transfer over from one company to another, it reminded me of this [YouTube clip](https://youtu.be/2UqVsf_GL5w) where a former DQ employee went to work for another fast food chain.\n\nThe free food gets reduced during tough economic times. Went from breakfast and lunch to just lunch just 6 weeks ago and people got pissed about it.",
            "The wrost about amz is oncall, in what world does it make sense to wake me up at 2AM because some random internal tool is broken ? Everytime it happens the only thing I can think is \"if I go back to sleep and tell my boss I am quitting how long until my savings is over\"",
            "I do not work at FAANG but I have this exact same experience. The language we use does not exist outside the company *and* it uses a custom internal library with very little documentation.\n\nI love my job and it's very stable (4 years) but if I had to go somewhere else I would probably have to start as a Junior, just being honest. I worry about this.",
            "Terrible take in my opinion. You will learn a lot and become a better engineer if you work at any of the top tier companies, these skills are always transferrable\n\nI only read like one though because there is just a huge wall of text",
            "It's kinda wild to see how much this has been upvoted vs the amount of people running to suck some company's dick for free in the replies.\n\nPersonally, no amount of money is worth sacrificing my personal life, routinely overworking, and shrinking my expertise in my skillset to focus on any company enforced programming language not used elsewhere. With what time will I be able to learn and practice what I need to off the clock if I'm constantly on the grind? I guess a lotta folk in here are young, idk, but I'm old/wise enough to know that repeatedly sacrificing my health and life for money is a shit deal. I don't like any job enough for that shit.\n\nSorry you dealt with Amazon's nonsense by the way! I hope your somewhere more enriching by now, it seems like you have a good head on your shoulders. Good luck to you!",
            "I agree but having worked at Amazon and other large tech firms I can say the issue is far far far worse at Amazon. \n\nMy manager essentially told me the way to get promoted at Amazon is to greenfield some new tool / product for Amazon internal use, force feed it to other teams, show it off to management, and then abandon the project. Then just rinse and repeat.\n\nThis isn’t typical behavior for large firms (at least not to the same degree), many other large tech firms put a large emphasis on avoiding building all of these internal tool’s because then they are responsible for maintaining them. Amazon’s approach is who gives a shit if the docs are terrible and the service is unusable, but not all companies take this approach.",
            "JSYN, Brazil/Apollo/Coral isn’t the default experience as I was on a team that used native AWS & Lambdas :)) And even then there are a lot of transferable skills in CICD/pipelines - it’s not a completely unique concept, and they don’t use proprietary languages.",
            "90% of the people here don’t give a damn about tooling or culture. They want that bag $$$",
            ">i learn by reading technical books \n\nTouche'",
            "yes theres brazil, crux, corol, arest and other random tools/things but you dont need to be an expert in any of these. simply using them takes a few minutes of getting used to, assuming you know the concepts behind them. same thing applies to any company. however,  becoming an expert in all of these is near impossible, but youre not expected to be this.\n\na good engineer will easily pick up anything given to them.  whether its a language, library, tools, design philosophy etc. so imo the \"company lock in due to software\" only applies to subpar engineers. this is why interviews are not based on \"tell me about how to set up a router in express\" but rather \"explain why you'd define XYZ endpoints and what considerations would you account for?\"\n\nthe *real* lock in imo comes from company culture. im appalled at how many people genuinely buy into their companies \"culture\". heard things like \"id never work for X because Y is different from our Z\" \n\nthird paragraph is bang on imo, its just a job guys, treat it as such. dont idolize.",
            "One of the more amusing things about working for a FAANG was my parents. I had been an analytics professional for many years, working for major corporations, and my parents were very happy with that, although they did not understand what I did. But when, at an advanced age, I landed at a FAANG, they were suddenly \"cool\" among their friends - when they were asked what I was doing, they would respond that \"he works for (FAANG)\", and their friends would apparently oooh and ahhh. This always made me laugh.",
            "Pls learn to use paragraphs.",
            "I guess Microsoft isn't FAANG, but I know people working there who love it. Not overworked, enjoy their jobs, have a good time. Mayne FAANG gets shit purely because of Amazon (maybe Google too)",
            "This is a very long winded way to say that working for FAANG could pigeonhole you into working with their internal systems that no other company uses.\n\nThe rest of text could be applied to any job. You could get fired from any job during any recession.\n\nA better advise is to take what you can get and have a side job. Maybe that’s doing software consulting on the side, selling product on Shopify, creating content on YouTube, etc.  In the end, putting your faith on one employer is a bad idea.",
            "I bet the money was really bad, eh?",
            "Nice point of view, mate, havent thought about that. Thanks :)",
            "I'm not exactly at FAANG but quite closely related and as for me the biggest problem is that I work with a company-specific tools only but these tools are huge and you need years to master them. However, all these tools are not relevant for other employers. Smaller companies want an expertise with libraries but at our comoany we do not use even std:: The same time my current employer is eager to pay for my expertise with all these internal tools and there is not so much motivation to change a job. That is why we have people who worked at the same company all their life till retirement.",
            "FAANG doesn’t mean much if you were hiring during the pandemic. I knew too many stupid people who got in because they were just fighting for who had red e most employees.",
            "Hey man I’m one year in at amazon as an sde1 and I just want to say this posts resonates with me. I dread waking up for work every day and at this point I no longer care about being pipped or fired or laid off. I’m just robotically carrying on right now. Honestly I might just go back to school for a phd or something instead of getting another dev job when the axe finally drops. I’ve spent so much time fixing pipeline/cdk issues that shit is probably all gonna be wasted when I’m no longer working here",
            "This is a big reason why I decided to leave my current job. \n\n\nThey are rebuilding the entire site from ASP.NET into Salesforce. Salesforce as you all probably know is a super closed system with its own programming languages and an absolute clusterfuck of acquired products seemingly duct taped together with a Salesforce logo sticker on it. \n\n\nThe idea of being stuck in this system and learning a system that I can't do anything with outside of work was incredibly uninteresting to me. \n\n\nI got into code because I could make cool shit with it, and if I can't use it outside of Salesforce then I just don't really care honestly.",
            "The problem with the “big concepts transfer” is that yes, they do, but it’s the little things specific to a company that take the time to learn. Your expected to know the basics already so you can pick the little things up quickly, and it still takes months to years to onboard.",
            "Let face it, being employed in technology for most of us is not that great.  If it wasn't for the money we would go someplace else.    Stability in technology is not there.  Every 3 to 5 years there is a layoff of 7 - 20% reduction for almost all high tech companies.",
            "Also worked at a FAANG. If you want to work on cool shit, FAANG ain't it. There is a reason why they pay a lot and it's called the golden handcuffs.",
            "i worked at amazon, fb (current? and interned at g. Lemme say amazon is not that great. G and fb is pretty good. Fb not so much now, but the remnants are still good",
            "The F in FAANG is paying for my custom house in the middle of the woods.  that’s great.  I’ll ride the stress as long as I can, and still have the house when I leave.",
            "I used to work for a company that worked on their own programming language, known by around a hundred people in India and literally dozens in England. The difference was below average pay and the fact their name on the CV wasn’t worth much. Fortunately for me I evacuated very fast as soon as I realized what’s going on. \n\nBut yeah, I’d much prefer to have FAANG instead of it.",
            "Every company has their bespoke systems, it just depends on how integrated everything is.\n\nIf you thought you could stop learning after you were done with college & your first job then I guess OP would be right (and you're gonna have a *terrible* time in software no matter what company you land at).\n\nIt's pretty cliche to hear of a FAANG developer joining a non-tech company & trying to re-implement their favorite system in {blank} but the reason is because they've seen how good those tools can be and how much they enable productivity\n\n The sheer head start you get from seeing the things that are possible is worth learning some \"non-transferrable skills\".",
            "I definitely agree that there are downsides to working with FAANG, the biggest of which are the “small cog in large machine”, progressing in your career is harder, and having to play office politics can suck. It is a lot easier to make big impact at a smaller or earlier stage company by comparison, and the way most people moved up in FAANGs is by bouncing around and boomeranging up levels.\n\nI’d say there are some big pluses to joining a larger company out of college, the main ones being a large amount of experienced folks, and good exposure to industry standards for software. New grads can learn from a lot of really talented individuals, and larger companies generally do a better job of documenting what works and what doesn’t, best practices, etc.\n\nI think there are some statements made here that are a bit misleading.\n\nInternal tools: yes most FAANGs use their own internal tooling which you won’t use in other companies. As said before, the concepts are the same and you should be able to translate them over. Any reasonable new company should give you reasonable time to ramp up with the tools they use before you start contributing. I really don’t think this is some big detriment at all.\n\nYou also brought up in-house languages and not being able to do stuff like working with JSON, and HTTP REST APIs. Yeah, Amazon uses Coral internally which is different, but I’d be concerned if anyone looking to get into software is unfamiliar with JSON or working with HTTP as a whole, and isn’t familiar enough with a common language for a coding interview.\n\nSalary: its a bit more complicated than you present it. Yes your base salary doesn’t go up much in most FAANGs after a while, but you get a LOT more equity. Not to mention FAANGs are publicly traded, so the equity has well-defined value. It can get a bit more complicated with pre-IPO startups where you may get a higher base salary, but equity is worthless until an IPO, and they may not offer other benefits like company match on a 401k or healthcare. You also need to look into what happens if the startup is acquired. Smaller companies are higher risk, higher reward.\n\nFrom an Amazon perspective: the team you’re on is really what drives your experience with oncall. VPC is AWS-critical, so it was probably hell. I didn’t work on a tier 1 service, so my oncalls were pretty relaxed. \n\nOverall, I think that FAANGs and larger companies are a great place to start a career, learn the best practices, and then move on to smaller companies when someone is ready to make a large impact.",
            "So the companies known by the acronym 'fang mama' are kind of vampiric?",
            "This really reeks of \"model saying looks aren't everything\" energy.",
            "As a current Amazon sde, you failed to learn to be curious. Not sure what team you were on. You were right about the tech. But if you don’t know any of the stuff and you’re too lazy to learn to understand stuff, it’s not big tech fault. It’s your mindset",
            "I mean that cuts both ways. A custom framework means your employees can't leave as easily, but it also means you can't on board as easily. So I really doubt that they use custom frameworks just to lock you in. But I think what you said about mid career growth being halted for non management and the cost of living surrounding those places is really important.",
            "I'm also in FAANG, and I worked in a smaller company before joining. From my experience, I agree that small company use more open source softwares, so you'll gain more exposure on what the vast majority uses. However, I did learn a lot more of things happening at scale at big tech. I think the blend of both is the best for career advancements. If you want to stay in FAANG, you gotta switch team in couple years to gain more experience. If you happen to be out of FAANG, take a bit of paycut hit to get into positions with new common tech. Career advancement does happen faster outside of FAANG. It's simply due to the fierce competition here. At Amazon, it's a squid game. It's not a place to stay long term unless you like pain and suffering.",
            "Very good perspective. There will be many dumbass dude, who are mostly international students, come in here and say shit like money is good. \n\nI have seen a handful of cs major that have absolutely nothing outside of school and coding. Whenever I see them they just talk about interview. And when I ask them why would you want to work for that company, they say because it’s fancy and has benefit.\n\nFancy my ass, get a fucking life.",
            "Does Amazon really hire people who don't know how to write paragraphs?",
            ">former Amazon engineer\n\nTLDR ^",
            "This post is highly regarded.\n\nGuy acting like critical thinking and problem solving are not transferable skills lol",
            "I have slowly become disenchanted with FAANG. I realized that my ambition was a form of revenge against society for labeling me a nerd throughout school. I thought making a high salary made me better than other people, and working at a company that everyone knows made me more important. Now I see salaries from other less-known companies and they seem pretty high too so I'm not sure anymore.",
            ">> faang isnt great\n\n\n>> former amazon engineer",
            "FAANG is awesome, from a current FAANG",
            "All that shit to tell me Amazon sucks.",
            "Here's some salt for you all. You need it when you consume the opinion of a 1- or 2-year Amazonian.",
            "These big techs are far from perfect. But still better than many companies. When you think an internal technology is bad, consider k8s was from google internal tool, similar like Kafka from LinkedIn. Even AWS was just an internal infra.\nIn the end of the day, it is not some special common tech stack , but the way of design, thinking, problem solving , handling big scale with trade off are most important",
            "Hey man if I may ask whats the issue with your mind that makes it difficult to learn?",
            "what a load of nonsense, every company has proprietary tech that you need to learn, and you worked for the shittiest, grindiest, least fulfilling faang company",
            "The only reason you think what you have to say is worthwhile is because of your FAANG experience. No one is lining up for someone from some no-name company to hear their opinion.",
            "People don’t work at a FAANG because they believe it’ll be enjoyable or have a good work-life balance. They work there because they pay buckets of money and having it on your resume makes you get insta-callbacks on future jobs. It’s just a stepping stone for most people.",
            "IMHO the key point missing is that the purpose of having a FAANG job is not necessarily to get another FAANG job. One needs to take the $$$ and do whatever it takes to become financially independent with it (even on a \"low\"  scale). I have worked in an industry which until 5 years ago had brutal ups and downs and this was the only way to keep sanity and reduce stress. For some reason this site jives with me: [https://www.mrmoneymustache.com/](https://www.mrmoneymustache.com/)",
            "Only in the SWE career media can people insist that earning hundreds of thousands of dollars in your early twenties “isn’t that great”",
            "1. I’ve been at multiple faang adjacent companies, Amazon is definitely by far the worst. It’s not all bad\n\n2. If you’re a good engineer you’ll pick up other skills later. Things transfer over, just because you dont know one thing doesn’t mean you can’t learn. Unless you’re being hired for your specific knowledge (which most of the time you aren’t) then you’ll pick things up. In addition amazon is probably not the worst place to have transferable skills. AWS is a standard everywhere and most teams have migrated off of MAWS anyways at this point.",
            "But money",
            "Amazon is changing a lot of their systems to better reflect external development practices and dependency management systems. What you said is definitely true, but I've migrated a few of our orgs software stacks to the \"new\" Brazil and it has made onboarding new devs much easier. \n\nProbably depends on the team, but in a few years Amazon will be closer to standard Gradle/Rust/Python work streams across the company (with some teams moving sooner, like ours).",
            "Although what you said can't be generalized, but carries a interesting perspective about being self aware of your skill development despite money, perks.",
            "“Former Amazon engineer” — you could have finished the post with that…didn’t need to read the rest",
            "This belongs in r/antiwork",
            "If you can't pick up new languages, frameworks, and build tools when switching companies you're a bad engineer.",
            "Amazon ain’t special in this regard, no other FAANG is. You’re always going to have a learning curve when you switch employers.\n\nIf you’re being hired to be a “tools” engineer, then you’re in the wrong place. They should be hiring you to figure shit out and give you the space to do so. If you’re reasonably competent, it isn’t a big deal going from FB or Amazon specific stuff to other orgs",
            "Every company hires you to make them money\n\nEvery company can lay off employees when times are tough\n\nEvery company mainly has benefits to try to entice people to work for them, not because they are beneficent \n\nThe only point worth making from this entire post is that working for these companies may limit your generalizable skills due to their use of proprietary ways of doing things",
            " TL;DR",
            "Amazon is far worse QOL than the others",
            "[The user has removed all potential PII from submissions.]",
            "the only thing that matters is the technical skills, if you're using internal tools that shouldn't impact anything later on if you actually now how to be a software engineer. \n\nYour skills that get you hired and the skills you continue to use there are what will make you marketable. And if you forget those skills during your tenure at a company then it's only you who can be blamed. At the end of the day the new company wants to know if you can continue using those skills.\n\nPlus let's be honest most interviews are just a variation of LC and system design which is easy af.",
            "[deleted]",
            "Can confirm, at Amazon atm, using Brazil and Coral is good and bad. Good in the sense that everyone at Amazon is using it so it’s compatible with lots of other internal services, bad in the sense that nobody else outside of Amazon uses it",
            "Might not be great work there, sure, but it sure does look nice in a resume.",
            "\"Facebook created and uses the Hack programming language that nobody else uses (it started as an offshoot of PHP with types added and became its own seperate programming language sort of like how C++ started as C with classes and then became its own seperate thing)\"\n\nThat sounds like the most terrible idea in the history of terrible ideas.",
            ">They lose money on you during your first year working there with no experience with the expectation that they will make that money back from your labor later on when you know what you're doing there.\n\nLiterally every single company ever. If they aren't making a profit, then they can't grow. If they aren't breaking even, they're on the decline until they can become profitable.\n\n>Once you're locked in and are acquainted with their tools and processes and stuff, they're making profit off of you. If you instead worked at a \"regular\" company using \"regular\" commonly used software tools like say (on the backend) the ASP.NET Core framework if you're coding in C# or Spring Boot for Java Spring, or perhaps React if you're doing frontend JavaScript development, you will have skills that you are already deeply familiar with that you can immediately transfer over to another company.\n\nThis is completely non-sensical. Every company is going to make a profit off of labor, as I stated above. \n\nEvery company will create custom tools as necessary to help solve their problems, or accelerate development, whether that's a custom framework or a programming language. Though the latter is rare. Saying that's employer lock-in is pretty dumb.",
            "The problem is that you worked at Amazon. From being a delivery driver to a engineer it’s more cutthroat though it more depends on your team as an engineer.\n\nThis is the only company I know that forces interns to sign non compete agreements FFS.",
            "Good summary my man. I have a lot of external experience and I find some of Amazons internal tooling lacking. I also have not had to write more docs than in any other job. I’d suggest going to a startup after and get your hands dirty.",
            "> with the expectation that they will make that money back from your labor later on when you know what you're doing there\n\nthat is the point of every business ever",
            "bar at Amazon must be low. You think you are learning hot stuff that's gonna make you hirable at your bank compared to FAANG experience?",
            "Doesnt matter, i know this response will be downvoted but for a final year college student like me, all those shiny things that MAANG offers along with the technology they work and produce hypnotises me... I am ready to work there for 20hrs if given a chance cause with that money i can get anything, dream car, gaming setup, money to travel, social reputation etc. \nMaybe i am new to Tech industry or so but this is my thinking.",
            "Thoughtful",
            "There probably are very good reasons for not working at FAANG, but idt the reasons in this post would be at the top of that list. Ya tooling is important but so is thinking (for life as well). Same for kids who copy hw, cheat on exams and do bs extracurriculars to get into Ivy Leagues.\n\nOne of the best reasons is that you won't learn as much as you would at a startup. When everything is breaking and you need to pay the bills, you ship faster. Low af salaries aren't for everybody though (not even for mostbodies). Going into big tech for a few years and then moving somewhere else has its merits.\n\nIf you can handle it, grinding a fck ton 22-26 when you can afford to starve a little is the most optimal path.",
            "Amazon is technically FAANG (and good pay) but shit-tier from an IC perspective.  I sure as hell didn't grind hard 15 years just report to a high ego, low empathy QA or TPM turned SDM just parroting leadership principles",
            "u/subredditsummarybot"
        ]
    },
    {
        "post_id": "1836lpc",
        "author": "johns_throwaway_2702",
        "title": "My job search as a staff backend/systems engineer with 8 YOE",
        "url": "https://i.redd.it/uukza3gw0e2c1.png",
        "score": 818,
        "num_comments": 85,
        "created_utc": 1700871768.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1836lpc/my_job_search_as_a_staff_backendsystems_engineer/",
        "comments": [
            "Thanks for the insight. This is a very cool read. Asking from a career perspective, as a backend/systems engineer, why did you decide to apply so heavily to companies big in the AI space?",
            "What do you mean by networking? Is it to be cordial with your manager and colleagues or do you have to intentionally throw yourself out there to new people?",
            "Around Mach 2023 I decided it was time to change roles. I let a few VC contacts know I was on the market and reached out to a few Tier 1 companies in the AI space. I interviewed through all of March and April before accepting a final offer at the beginning of May at <insert extremely popular AI company everyone here has heard of >.\n\nTC for most offers was in the $600k-$1.2M range. Some offers were difficult to value since they included significant equity as a founding engineer at new startups.\n\nCS Majors and new grads - hang in there! I had *so* much trouble getting a good internship in college and getting a good job right out of college. I went to a tier 2 school (decent state school, nothing notable) and I had mediocre internships. Give it a few years and you'll have recruiters and founders knocking down your door offering good jobs\n\nMy primary advice looking back on things - *don't burn bridges.* By the time you get 5+ years into your career, *everything is done via backchannels*. Your references won't really matter, employers will do their own investigation into your past by contacting former colleagues and managers. If you burn bridges, odds are the people on the other side of those bridges will be contacted and asked about you. I managed to not burn bridges thus far, and it paid off dearly during this search.",
            "What jobs did you switch starting from college, and how did your TC progress? How many faang/tier 1 companies under your belt before this? Any tips for reaching your stage within 7-8 years? What would you do if you started fresh from college again?",
            "Did you leave your current role before interviewing? If not, have you ever worry that letting your network know you’re one the market would lead to your current employer learning this?",
            "Thanks for doing this. As someone interested in Al/Ml and heading back to school for engineering. What do you think is useful to learn for the first job. For example, I’m in computer networking and I often helping colleagues with excel, and automation. I wish I had learned common business application, programming and business in general. I am also interested in technical aspect to build some side projects. What are fundamental for AI/ML? And if you were to reverse time back to when you started, how would you go about making the most out of your time at school? What would you do differently ? What’s one thing that often think about and that you had learnt or master before moving on to professional environment? \n\nThanks",
            "Jesus christ, it's Jason Bourne.   \n\n\nSeriously though these are killer numbers. You should share the pathway you took to get here. I personally, am more curious what kind of stuff you did outside of work to get to where you are now (books, masters, etc...). I'm 3 years in and I have no idea what to do to get to the \"next level\" of development.  \n\n\nCongrats on the new job!",
            "I am also planning on working in the backend engineering. I am happy that you were able to make it at such a difficult time. Congrats on the success!",
            "How many places tried to downlevel you? I was a senior at a Big N and got several offers at mid-level even when I thought I did well, which I of course declined. I suspect places are just trying because I’ve heard this happening to others",
            "How many hours a week did you usually work? How much WLB did you sacrifice in order. As in, did you forego fitness, hobbies, socialization? Trying to get a feel for what kind of lifestyle it took?",
            "What was the max offer from a public company? (Non-paper money)",
            "Which platform is this ?",
            "how many leetcode problems have you done if any of your interviews involved that\n\nand i hope burning bridges doesnt include reneging offers because i've already done that and i'm not even graduated hehe. i believe you mean just leave a company on good terms",
            "More of these freakin graphs 😫",
            "Thank you for this, your answers have been very insightful! I’m currently a May 2024 graduate and have accepted an SWE offer at a large financial services (such as Fidelity, JPMorgan, Capital One) company. I was wondering, what kind of path you would take if you were in this situation in terms of  transitioning to AI and AI-adjacent companies? Is it important to spend time doing leetcode or should I be focused on personal projects and self studying regarding AI and large scale distributed systems? And is there any benefit to spending time and gaining business domain knowledge in fintech?",
            "What software is this?",
            "Humble bragging/flexing.\n\nDid you post in the Blind yet?",
            "hey OP, even I started my job like you. I spent my first 2 years at healthcare AI startup, then I worked with NLP based AI startup.\n\nMy work is both companies involve data preparation, training, testing and productionising ML models.\n\nI know the ins and outs of ML models and how they work in general and the basics around them.\n\nI am trying for python developer roles with AI requirements in JD. Also I am preparing leetcode and sys design to get into FAANG companies.\n\nI am bit confused, should I leverage my experience and go work for startups or try for FAANG.\n\nCurrently I am a masters student graduating in AUG 2024.",
            "May I know your location and the base pay you were able to get in your new job ?",
            "Hey, I’m someone who’s been at a faang for several years, would love to pick your brain privately if you’re opening to DMing"
        ]
    },
    {
        "post_id": "r2zy4z",
        "author": "askdocsthrowaway1996",
        "title": "Excited about my new offer at Airbnb",
        "url": "https://www.reddit.com/r/csMajors/comments/r2zy4z/excited_about_my_new_offer_at_airbnb/",
        "score": 818,
        "num_comments": 34,
        "created_utc": 1637970333.0,
        "selftext": "Hey guys, \n\nI am so excited to share my news that I recently got a new summer internship offer from AirBnB. So excited to start my internship next summer. Wish me luck, guys!",
        "permalink": "/r/csMajors/comments/r2zy4z/excited_about_my_new_offer_at_airbnb/",
        "comments": [
            "Imagine if you took away an offer from another company for an offer at Airbnb and ended up with fucking nothing I’d be so livid bruh",
            "Who’s gonna tell him",
            "Have fun! Hopefully the offer doesn’t get rescinded",
            "Me too! I just accepted it a couple weeks back over my google offer. I’m so excited",
            "hahaha he is obviously joking",
            "Good luck buddy, I am with you!! <3",
            "Oh I got some news for you buddy",
            "Every comment here: who's gonna tell him?\n\nThe post with a shitpost tag: .... am I not a joke to you?",
            "i'm conflicted about this post",
            "Grind LeetCode",
            "The state of this sub this week is just perfect",
            "Serious question tho: anyone know why Airbnb decided to do dat?",
            "Do we tell him?",
            "Who is going to bell the cat?",
            "🤡",
            "There’s been way too many trolls now a days",
            "Wow that’s awesome. Congrats. Oh wait this is a joke. Ugh",
            "Congratulations and wish you luck ahead",
            "."
        ]
    },
    {
        "post_id": "14o0i2y",
        "author": "StandardMediocre4748",
        "title": "couldn’t get a return offer bc no head count :D",
        "url": "https://i.redd.it/0h0p7gft0e9b1.jpg",
        "score": 817,
        "num_comments": 128,
        "created_utc": 1688232105.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/14o0i2y/couldnt_get_a_return_offer_bc_no_head_count_d/",
        "comments": [
            "If they are getting rid of existing full time employees with years of experience at Amazon, I wouldn’t be expecting a full time offer",
            "You’re not alone. My friend interned Seattle, ended in March I believe but no return offer although he was inclined (no headcount). Sorry to hear this :(",
            "“We have enough cattle to milk. Looking at the cattle headcount, it’s enough for now. In case any cattle stops producing, moves to greener pastures or otherwise dies, we will talk to your handlers.”",
            "Got the same email when I finished my fall internship in December :(",
            "[deleted]",
            "Does it apply to aws if so I will start relaxing rather than stressing to get a return offer. I’m at week 6 rn",
            "That's tough\nDon't waste a single second on this and start leetcoding",
            "can you provide any information on what org? or anything like that? Also was there any indication that from your manager that this would happen? \n\nI'm so sorry to see this.",
            "But did you get put on waitlist at least or no?",
            "[deleted]",
            "How’s it going for the summer 2023 interns who’ve got the inclined vote?",
            "Did you get put on a waitlist or no offer at all?",
            "Wow I’m screwed I finish in August @zon and sucks to hear it’ll be for nothing",
            "Just be sure you get a solid reference from them.",
            "Does anyone know if you can elect to return as an intern instead, or are they not giving those out either anymore?",
            "What does head count mean?",
            "Are u supposed to join in 2023 as full time?\nWhat about summer interns now who will be joining in 2024 as full time? The headcount scenario will be different then, right?",
            "It's weird that they mention org-specific headcount. ASP have the authorization to move students across any orgs (retail to aws, music to ads, etc.).",
            "Amazon hires contracting agencies to keep their roles filled cheap. They don’t want people who get PTO, Benefits, competitive salary, etc…\n\nLayoff the people who have that to fill in the gaps with whoever doesn’t want it",
            "Did anyone get any new updates on return offers from Amazon ?",
            "If you don’t mind, what team were you on?",
            "same boat with my internships lets goo!",
            "Same thing happened to me after co-oping at a company for 2 years. Manager loved me, was the only one working on a big internal tool. After I graduated they let me go because of no headcount",
            "Yup, happened to me at Meta",
            "Same bro tf",
            "Frugality",
            "How long after your internship did you get this email?",
            "Gotta wait until OP1 is done",
            "Sad :(",
            "It’s sad to hear this….\nCan you provide some information about your internship like what org, location are you in for reference? Appreciate it",
            "They're still pushing back last year intern return offers no idea why anyone expected that they'd get one this year LOL",
            "What is meant by headcount availability?",
            "Is there still hiring freeze?",
            "What kind of FT offers does someone with an Amazon internship get? Is it comparable to having one of the \"bigger\" FAANG companies on your resume?",
            "No offers will be given until after 2024. There is a huge backlog of delayed new grads all the way up until december 2024 and they are trying to honor them (probably will rescind tbh the later the start date)",
            "Amazon is a horrible company to work for. Don't feel bad.",
            "I had a very similar letter after a complete set of interviews at Enron, about 10 months before they imploded.\n\nJudge this once you have gone on a ways in life.",
            "Got a job (1 1/2 hours away) with Amazon but at my starting date I was having some health issues. Then happened across reviews about working there (some I already knew about) and was like 'I dodged a bullet'. My issues wouldn't have complied with their hydration and bathroom schedule garbage. I do though have a free shiny new pair of work boots.",
            "What if the team I’m in has headcount?",
            "What Org were you in?",
            "Which Amazon office location?",
            "If the intern on my team gets this letter when he finishes his time here I stg imma punch my laptop. Such BS, Amazon definitely has the capacity to start hiring again now.",
            "I have been laid of 10 months in as a NG. They aren’t doing returns offers at this time.",
            "Hopefully, you'll get other opportunities, Amazon on the resume looks good",
            "What does this head count mean? I'm sorry I'm new to this terminology",
            "Sorry but what's headcount availablity?",
            "yep, microsoft is saying less return offers - gotta LC and network. i got 6 referrers at top companies, been doing LC year round, for anyone reading this this is your sign to do the same",
            "."
        ]
    },
    {
        "post_id": "1910a6e",
        "author": "PokemonSaviorN",
        "title": "IT Employment Grew by Just 700 Jobs in 2023, Down From 267,000 in 2022",
        "url": "https://www.wsj.com/articles/it-employment-grew-by-just-700-jobs-in-2023-down-from-267-000-in-2022-adbd8a61",
        "score": 819,
        "num_comments": 211,
        "created_utc": 1704656049.0,
        "selftext": "Your vibes weren’t wrong. 2023 was awful for interns and new grads 💀. How have you been coping thus far?\n\nSigned an underemployed May 2023 CS grad.",
        "permalink": "/r/csMajors/comments/1910a6e/it_employment_grew_by_just_700_jobs_in_2023_down/",
        "comments": [
            "\"There is a talent shortage!\" said the rich CEO who wants to pay you below minimum wage.",
            "I wonder is this is going to impact senior developers? Junior devs will become seniors, so they should be affected in the future as well.",
            "https://i.imgur.com/dcDxD0K.png\n\nway too many going into cs lol",
            "Long given up on this field and seeking something else.\n\nMy parents are delusional and think I can score a 60k job right out of college in this market.",
            "this is scary !",
            "Im going to become a plumber now",
            "It’s TikTok’s fault",
            "There’s a high talent demand for a lot more experienced folks. We’ve all seen it, 5 yrs of experience for a library made 2 years ago. 3 yrs of experience for entry jobs, no internships included. \n\nThere seems to be little faith in college graduates lately or something similar.\n\nFor 2024 grads for example, most of the repos on GitHub are reporting 500 opened positions since last September for 2024 grads. However, an average of 296 of them are closed. I got this data by aggregating a few different repos",
            "It’s crazy, a lot of people going into CS and it’s growing exponentially every year",
            "[deleted]",
            "I am getting a feeling that I may have chosen the wrong major.",
            "Does SWE count under IT?",
            "Cs major bubble burst",
            "[deleted]",
            "![gif](giphy|adOhvwrFJ32psmc5Pb)\n\nPut your copium mask back on, remember team, **\"wE HaVe MoRe JoB SeCuRiTy ThAn MeDiCiNe\"**",
            "[deleted]",
            "Should I switch to something like nuclear engineering?",
            "That's horrible",
            "But isn't it projected to grow significantly over the next 10 years?",
            "[deleted]",
            "Finna go be a doctor :/",
            "I’ve been saying it - that maybe these jobs will disappear in the future due to AI and I get downvoted every time. I don’t say it because it makes me happy lmao, I’ll be unemployed too. I say it to open people’s minds that maybe they need a backup. But they don’t like hearing that. It’s naive to think that companies won’t capitalize on AI \n\n267,000 to 700 is a 99.7% decrease btw.",
            "Over 21,000 jobs added in the last quarter.",
            "Well, renewed my nursing license last week, so I have that as a back-up in the worst case.",
            "This year will be negative for sure.",
            "Wonder how much it grew in India and abroad. I hear they're moving to offshoring.",
            "I think there’s a bubble",
            "Unpopular opinion: this is at least partially because so many cs majors and tech workers are corporate bootlickers that refuse to do anything even close to unionizing or advocating for stronger workers rights to have leverage against companies.\n\nI’m 100% a liberal capitalist, but I know that companies don’t give a shit about its workers and will pay the lowest they possibly can, independently of how much value they get from workers. This whole doomerism narrative that causes people to become more anxious, and be desperate for even lower salaries, is a self fulfilling prophecy that I wouldn’t be surprised if companies are intentionally pushing to lower pay for software engineers. \n\nBig tech still net billions of dollars in profits. Every software engineer produces massively more capital than they are paid. Two years ago, devs were satisfied and didn’t even think about standing their ground because of the high salaries, but now that it’s going down (even though companies still continue to profit), software engineers are scapegoating newcomers to the field instead of directing their anger at companies that CAN pay more but simply don’t because they can get away with it. Don’t be a pushover. We have to have more solidarity as a bloc in the longer term instead of being distracted by the market’s ebbs and flows. \n\nCompanies will pay you minimum wage if they can get away with it. They will pay you less if they can get away with it. \n\nThe worst thing is that even people who are angry and want to stand their ground now will suddenly become an amnesiac as soon as they get a higher salary.",
            "American companies are the best run and the most ruthless in the world. Read into the history of NAFTA and how it decimated the American industrial base leading to the current issues we see in the rust belt. Understand that American companies will do the same thing to the technology sector, the way you capitalize on the future trend of American companies seeking lower labour costs is by staying out of America. Plenty of people get angry when I say this, but plenty of factory workers in the rust belt were also in disbelief that their industry would be decimated by NAFTA. Ultimately economics is everything, American companies have always sought cheaper labour to boost their bottom line, it will be no different for technology. People think of outsourcing as moving jobs to India/China, but the biggest beneficiaries of NAFTA were Mexico and Canada. Just food for thought. Put another way, FANG companies are valued at 30x+ their current earnings, this implies that to maintain these elevated valuations, high returns to shareholders in the future are not only required by necessary. Where will this capital to be returned to shareholders come from? History tells us that it comes out of the pocket of American labour.",
            "Honestly, if IT can at least retain most of the Covid explosive growth most industries saw, it’ll be far better than what most industries are seeing at the moment.",
            "I was thinking about something. Before the financial crash everyone was hoarding stocks all of sudden. People I know who have never bought a stock in their entire life all of the sudden invested thousands of bucks in stocks (including me). There was youtube videos, posts on social media and forum threads everywhere about investing - and friends and family all talked about investing and how much stock they've bought. Then .. it crashed.\n\nI've been told afterwards that this pattern often occurs before a crash. All of the sudden a lot of people I know have started studying IT and want to persue an IT career. The 30 year old dude I used to know who've lived in his moms basement all life, my friend in his 30s who have studied law for several years and a lot of the \"friends of my friends\" have gone back to school to study IT since \"the market SCREAMS after programmers right now\".. I don't know .. maybe I'm wrong .. but I have a bad feeling about this ..",
            "This sub is so confusing. Is it over or not??",
            "Ahhh CS. Never seen a group of people with bright future job prospects doom and gloom so much.\n\n\"The sky is falling!\" Software developers have been hearing and saying this for decades, yet it's still here. Wait for the interest rates to come back down. Many tech companies slowed down hiring, but this type of thing is cyclic. It'll come back around.",
            "-1000 with AI"
        ]
    },
    {
        "post_id": "yv8jbh",
        "author": "cute_as_ducks_24",
        "title": "Amazon reportedly plans to lay off about 10,000 employees starting this week",
        "url": "https://www.reddit.com/r/csMajors/comments/yv8jbh/amazon_reportedly_plans_to_lay_off_about_10000/",
        "score": 817,
        "num_comments": 139,
        "created_utc": 1668451341.0,
        "selftext": "https://www.cnbc.com/2022/11/14/amazon-reportedly-plans-to-lay-off-about-10000-employees-starting-this-week.html\n\nWell it was a matter of time...\n\nWe are the luckiest batch to go through whole Corona and now this. Gonna wait for a zombie outbreak at this point might be thrilling :)",
        "permalink": "/r/csMajors/comments/yv8jbh/amazon_reportedly_plans_to_lay_off_about_10000/",
        "comments": [
            "Anyone here know what this means for new grads? I rejected another offer for this and Im wondering if I should go back and ask if its still available.",
            "This recruiting season is fucked 🥲",
            "Plz don't rescind my offer Mr. Bezos, I need rent money",
            "Uhh what a good day, let’s scroll through reddit. INSTANT REGRETS. WTH is wrong with this season🫡. Already had like 10% hope of getting a job but now I think I have only 1% hope left",
            "Fade me",
            "[deleted]",
            "I was today years old when I learned that Jeff infact isn’t the CEO of Amazon ☠️",
            "im doomed",
            "[deleted]",
            "It’s literally mostly the faangs doing this I would fret so much unless you’re a faangsexual I promise you if you’re a US university student that is proactive enough that they worry about this you will land a job somewhere",
            "An AWS recruiter told me they’d be hiring again by early December. Who knows what’s true though.",
            "Stop following this depressing ass shit. lol. I just got a Summer offer from Zendesk and am doing a winter internship at a DOE laboratory. And before anyone projects their own insecurities onto me, no I’m not humble bragging. I’m pointing out that opportunities always exist. Fuck the market, fuck the layoffs, fuck all that shit. Quit expending so much energy thinking about it.  You don’t have to work at a FAANG or even in a traditional SWE role. Just keep applying. Especially those of you who are new grads. For as oversaturated as the SWE field is, other STEM fields are under saturated. \n\nNot to be captain obvious, but YOU HAVE A STEM DEGREE. lol. It might SEEM like everyone has one. But they don’t. STEM as a whole is projecting an 11 percent INCREASE over the next decade. Everything else is less than 8. And only about 18 percent of all graduates PERIOD have a STEM degree. The shit is valuable. Take that shit and go get some experience doing SOMETHING. When the CS market rebounds, apply for a SWE job. Or don’t. But don’t let this shit get you down. Economic downturns are gonna happen every few years for the rest of our lives. \n\nMy mentor from my Summer internship made the extremely astute point that a ton of STEM jobs require some degree of CS work, even if they are not CS jobs, and it gets you very valuable work experience. It’s how I ended up in a lab this winter. Best of luck to all of you, nothing but good vibes and positivity!",
            "I hope this isn’t too cope-y for you guys, but I’ll just give context that a lot of times lay-offs impacts contributors making higher salaries than those making lower ones. I wouldn’t say this is a silver bullet for how executives pick people to lay-off, but if there’s an opportunity to lay-off someone eating a lot of their cash then it is beneficial. \n\nObviously I’m saying this because new grads will not be atop that list of contributors making the most money. Also, it’s not clear if the lay-offs will be mostly engineers. I know Meta laid off a lot of recruiters and such. R&D spend is largely tax deductible, and we all know how Amazon is notorious for playing the corporate tax game.",
            "And here I was feeling bad that I would \"only\" be making ~85k a year post graduation at a non tech company. I feel blessed now.",
            "Welcome to amazon where we all gonna get pipped",
            "It’s looking like I’m just gonna avoid fanng for a bit",
            "[deleted]",
            "Wife works in HR at AWS (northern Virginia). Been there about 3 months. How “shitting our pants” should we be?",
            "Folks gonna have to get experience the old fashioned way, building websites for influencers for exposure and cred.",
            "[deleted]",
            "Likelihood of SDE intern offers being affected? Any idea what teams are there in JFK 14, NYC?",
            "This is so corny",
            "I’m scared :(",
            "in other words, a regular week at Amazon",
            "Why did I get an email from an Amazon recruiter like 2 hours ago then??",
            "at-least i wont need to wake up to 10 rejection mails as a zombie fr",
            "We are so SOL. Honestly, it might the worst time to look for internships/entry level jobs.",
            "i hope yalls internship offers dont get rescinded :|",
            "Pretty scared as a new grad, but can only try my hardest and hope it works out. Terrified but will try to remain hopeful.",
            "\\>We are the luckiest batch to go through whole Corona and now this. \n\nSigh. This is nothing new. \n\n1973 - Arab Oil embargo crashes the economy. \n\n1986 - S&L crisis crashes the financial markets\n\n2000 - Internet  bubble crashes financial markets\n\n2008 - The \"Great Recession\" crashes the housing and financial markets",
            "Everytime I see an article like this... its never the engineers.",
            "I have 2 interviews coming up and they’re the only responses I’ve gotten all season. Luckily I passed OA’s and resume screening but if I don’t get either job I’m terrified I’ll be unemployed after graduation…\n\nLike you know shits getting real when AMAZON has a freeze and layoffs.",
            "wow",
            "Why wait until peak busy season you may ask? Hmm to weed out the weeklings. Couldnt have waited until after the holidays Bosos?",
            ">\t“The cuts would be the largest in the company’s \nand would primarily impact Amazon’s devices organization, retail division and human resources, according to the report.”\n\nWe are going to be fine… right?",
            "Anyone knows what it means for 2023 interns?",
            "Sucks to b living now!",
            "I haven't heard any news that dents the tech employment rate. Tesla, Twitter, Facebook, Amazon, Adobe, blah blah blah. It was \"I got hired by FAANG\" here and \"I got hired by FAANG\" there for years, and now the news is obsessed with being fired by FAANG. I'm not a storm trooper and I don't work for empires, I don't chase their hiring sprees and I don't panic when they clean out their garages.",
            "Jesus Christ, that’s a lot - mostly retail or not."
        ]
    },
    {
        "post_id": "zca0h8",
        "author": "liquidInkRocks",
        "title": "I landed a MAANG internship but they want me to cook",
        "url": "https://www.reddit.com/r/csMajors/comments/zca0h8/i_landed_a_maang_internship_but_they_want_me_to/",
        "score": 818,
        "num_comments": 71,
        "created_utc": 1670161134.0,
        "selftext": "I'm not sure that to do here. The interviews went well. I solved the LeetCode hard problem in the OA, so they invited me to their campus for face-to-face interviews. I brought some brownies with me because, hey, it might make me stand out and I'm hypoglycemic anyway. Everyone I met loved the brownies. Everything went great. My recruiter emailed me an offer: they want me to work in the cafeteria bakery. Ugh. What do I do? They promised I would be considered for SWE after the first 6 months. I worked so hard for my CS: should I take this offer? What if I forget everything I've learned in school because they have me making brownies and cookies all day? Another thing I should mention is that my Mom actually made the brownies.",
        "permalink": "/r/csMajors/comments/zca0h8/i_landed_a_maang_internship_but_they_want_me_to/",
        "comments": [
            "wow times are harder at meta than we thought",
            "Put some drugs in the brownies so all the engineers fail drug tests and you can replace them",
            "Jessie we need to cook",
            "I think it is a great opportunity. Just smuggle in the Brownies from your mom every day and since those are done already use the free time to run around and look at code from other engineers by peeking over their shoulder",
            "a rags to riches fairytale",
            "I go to a top 10 CS (culinary studies) program and all of my peers have landed quant or maang offers but I still fail interviews on brownie and snickerdoodle easy-level problems. count your blessings.",
            "in this economy, take it and run",
            "There's no way this is real. Lmao",
            "damn that sucks but this is fucking hilarious",
            "They're truly heartless monsters.",
            "Moral of the shipost: Mom's brownies are great, but brown nosing only gets you so far.",
            "Do you get paid the same?",
            "I wouldn’t take that offer since you’re already off to being disrespected. Once that 6 months go by they will tell you some other excuse as to why they can’t hire you on as a SWE.",
            "FAANG is now MAANG? No. I think MANGA should be the new buzz word.\n\nI would not take the job. It would always feel like they're enjoying a cruel joke at your expense.",
            "I AM SCREAMING LMFAOOOOOOOOO! this made my day.",
            "Just go for a few months so you can say you worked there",
            "Automate the cookie baking. \n\nBe sure to run it in Kubernetes with 100 % CPU load and reuse the heat to get the baking done.",
            "Honestly, take the job. Having maang on your resume is life-changing but be sure to recruit your mom to that cafeteria. You’ll need her skills in baking and you don’t want them to find out you’re a fraud.\n\nTimes are tough but I also started my CS career in the cafeteria. The visibility and rapport I built really helped me land my way into the csuite eventually. Good luck.",
            "hahaha",
            "Wth, just refuse it and keep trying. This is how much they respect your effort. Send an email saying \"I didn't apply for this position, I would like feed back on my application as [position you applied for]\"",
            "A- troll post, it would have been an A+, but only troll posts that we don't know are trolls get a perfect grade.",
            "no, keep applying",
            "Assuming whatever you said is true, which I still find hard to believe, don't take up this job. The fact that you are able to solve lc hard problems itself proves your skills. Many other good companies would be more than happy to hire you. Just because it is MAANG doesn't mean you shouls take up any kind of job. If you do well, after some years, the MAANG recruiters will themselves apprach you for the job.",
            "I don’t believe this intricately woven tale but I really would love to believe it. It would make a good short film I picture Tom Cruise as the manipulative hiring manager and like Spider-Man or something as the boy who fucked up cause his moms brownies were too good and he took credit for them.",
            "no cap if this was real I would actually do this lol",
            "Are you sure this wasn’t a joke? If this was for real no lie I’d be insulted and ignore it. Gotta have some respect for yourself. Recruiter is an [redacted] for doing that. \n\nOr this is a shitpost.",
            "r/programmerHumor",
            "I can’t tell if this is satire of not",
            "Wtfffff is this serious? \n\nNah don't take that job, unless as a means to make money. Look for real roles",
            "\nstruct r/csMajors\n{\nvar cryPost : Post = createPost (“\nPlease help me. I feel so down. I only know how to cook easy dishes. A few medium dishes after watching Youtube videos but no matter how I hard I work I can’t cook hard dishes. Any suggestions?\n“)\n\nvar wiseComments :  Comment = createComment(“Don’t worry, cook a few more, don’t give up.“)\n}",
            "Once you start the brownies they may not want to lose it and I can already see the swe job being pushed again. This may be a joke post but if not they maybe be stringing you along for office access to good brownies.",
            "🧢",
            "They are after your cookies.",
            "Lmao wtf",
            "Is this copy pasta? This is hilarious",
            "Wow I thought this was real and started getting mad \"Has capitalism really gone this far?\". Amazing shitpost",
            "Tbh if the cafeteria pays the same, I’ll ditch the swe job. I mean we’re in merely for $$$, am I right?",
            "im fucking dying at the last sentence. LOL no way this is real",
            "Tell them to fuck off",
            "It’s MANGA !",
            "No. They promise you will be reconsidered, but that won't happen. If you make bad baked goods, you will be fired and they won't consider you for the job. If you make good baked goods, they won't want to take you away from baking and they won't consider you for the job. Even if they keep their word in as much as they do actually talk to you about it, they won't hire you for the job you want.\n\nI recommend you tell them \"no thank you, that's a bit of an insult, I didn't work hard for a CS degree to work in your bakery, although my mom will be glad to hear that you liked her brownies\" and look elsewhere.",
            "PLEASE PLEASE can someone tell me this is a joke!!!!!",
            "."
        ]
    },
    {
        "post_id": "lnmmj0",
        "author": "OmkingPlaya",
        "title": "The internship talk on this sub is the reason why my life has drastically improved",
        "url": "https://www.reddit.com/r/csMajors/comments/lnmmj0/the_internship_talk_on_this_sub_is_the_reason_why/",
        "score": 815,
        "num_comments": 72,
        "created_utc": 1613758767.0,
        "selftext": "I think that the internship talk does more good than bad. Before browsing this sub, I didn’t even know internships were a thing really. I didn’t know how to study, I didn’t know how to apply, I didn’t know how important they are for my career, I didn’t know shit. My school never talked much about it because it’s an average state school. Now (100% thanks to the wealth of information in this sub), I’m gonna be interning at FAANG this summer and I literally have the rest of my life set up for me (because of insanely high FAANG salaries). Obviously the future isn’t guaranteed but i’m in a fantastic situation regardless with FAANG on my resume. If internship talk was in a megathread or wasn’t allowed, I would have never been able to do this. \n\nAs a kid from a low income household, I don’t get many opportunities to learn this much valuable information for free. I don’t want future CS Majors to miss out on the opportunity to learn that I got from this subreddit. It might get stale if you’ve been in the sub for a while, but that’s just because there is only so much you can discuss before it can get repetitive.\n\nWhatever happens next doesn’t affect me at all because i’ve already gotten out what I needed to know, but I hope for the sake of future students that internship posts aren’t limited.",
        "permalink": "/r/csMajors/comments/lnmmj0/the_internship_talk_on_this_sub_is_the_reason_why/",
        "comments": [
            "Fully agreed.\n\nGreat way to learn about internships.\n\nAmazon.",
            "Amazon",
            "What did you do? Was it just a bunch of leet  code? I hear that a lot from this sub and I’m genuinely worried since I’m taking so many classes and don’t have time for that whatsoever",
            "I agree.",
            "[deleted]",
            "Fully agree, I learned about the importance of practicing Leetcode because of this subreddit.",
            "Thanks to this and cscareerquestions, I probably got the internship I did. My uni never talks about faang (since they're outside of our country (not the US)) and these subs helped me know what I needed to prepare for, and that I could try my chance in the right way. Now I'm trying to prepare my friends at my uni to be as aware of the process. These subs rock!",
            "Congrats! And I agree the reddit community has taught me so much more about my career than college :P",
            "Bro. I literally went from a philosophy major to a Big N intern in 8 months because of this subreddit. I’m legit on it everyday sometimes and yes, it’s not healthy but I feel like a lot of people, including me, can testify to this subreddit being a great resource for career advice and just getting good perspective overall on what one needs when trying to grind up that tech corporate ladder. Obviously there are downsides and the cutthroat nature of the tech world has been influencing this sub and giving people anxiety, but idk... I personally kinda thrive on that. People are obviously on different. I think the main thing is most people are on this sub for internship and career grinding. Cs projects and other school stuff is cool but the biggest question mark in our lives as a student is where are we going to end up in 4 years. Not rlly like is this class a good class?? Just my 2 cents",
            "I come from a low tier school. I wouldn’t have even applied to top companies if it wasn’t for this sub. So much useful information and advice. Guess what? I managed to actually secure a spot at a top company.",
            "Congratulations!!  \nWould you like to share some tips specific to your case that put u ahead of the other applicants? For eg: Was it ur DSA knowledge or personal projects or student club involvement or referrals?  \nThanks in advance!!",
            "Agree wholeheartedly. This sub helped me so much even as a freshman learning about how to apply, where to apply, and tips and stuff for getting better at interviews. This sub would be so dry if these types of posts were hidden. No one can really ask about classes since they are so school-dependent, questions about laptops and projects are really the only thing that makes sense to talk about besides internships. Internships are literally the sole and blood of the cs major. Obviously getting one isn't everything, but real-world practical experience is why people love CS. These posts, while may a tad bit annoying, should stay as they serve to benefit the sub and help bring new people in.",
            "I agree its crazy to think about  Solve a couple leetcode questions and boom youre a guaranteed millionaire by 30",
            "Amazon",
            "This sub and the Discord got my career in order as well. It’s made me so motivated and allowed me to stay in the loop with peers who “tryhard”, or who just genuinely are trying their best to get their career off the ground. \n\nI understand how demotivating it can be when things aren’t going well, but having the access to information that we do here is incredibly taken for granted.",
            "Internships have typically been for the privileged that can afford to work for free, who went to a good school, have connections through their parents friends, etc. but it's slowly changing. I think it's illegal to work for free as an intern in some states (CA). Most states offer at least a stipend to cover your travel expenses, etc.",
            "“I literally have the rest of my life set up for me”\nI chuckled reading this",
            "*internshit",
            "I learned about the importance of Amazon from this subreddit and for that I am forever grateful",
            "Does anyone know\n\nAmazon",
            "[deleted]",
            "Invest that money",
            "[removed]",
            "IiiAber U u",
            "Same here, didn't know what to prepare, what the good resources are, planning ahead. \n\nWould like to thank the authors of the posts with all the info and motivation they provide",
            "good job!!",
            "yeah a lot of being a student is the internship hustle",
            "Love this. I agree. Got my internship advice almost exclusively from r/csMajors. While sure, it gets tiring to shift through various \"which internship should I take, apple, facebook, or google?\" I do believe the good outweighs the bad.",
            "same, this sub pushed a lot of students like me who just planned to coast thru school thinking that a CS degree will get you a job in the field easily, to actually find internships.",
            "Internships are still what make college going to in this day and age. Other majors couldn't even dream about how much the internships in this industry pays as they run coffee for no money. \n\nIt's also what separate us from IT majors, who graduate still thinking internships are just that. Even worse, Cybersecurity students think their majors alone will let them skip years of grunt work and go straight to cyber security jobs right off the bat, which doesn't happen. Those who graduated with no internships are now angrily working at help desk for $19/hr and venting on places like r/talesfromtechsupport. And despite them learning much more practical things in their curriculum, we are still highly preferred across big tech and even for their jobs. This is the reason that we have such a huge internship culture, and they don't. \n\nSo those who are keeping that alive here, you're doing the Lord's work. It's gonna hurt some feelings, but that's life; and this is a competitive field. For everyone dozen or so who feels some type of way about this topic, there are folks like OP who's gotten their big break. Jealousy is not a good look on anyone, so just ignore the haters.",
            "There is another subreddit. r/cscareerquestions",
            "How do you study ? How do you apply? My school never talked about it too",
            "Hmmm",
            "Yeah school does not teach internships and if they find out and they discourage you to apply. Kindda sucks",
            "Hey, I’m so proud of you! Good job on scoring that internship. Don’t forget to smell the roses of the journey from time to time :)",
            "."
        ]
    },
    {
        "post_id": "1btkqtr",
        "author": "RespectableTorpedo",
        "title": "Y’all ok?? ",
        "url": "https://i.redd.it/zorz0ce5nyrc1.jpeg",
        "score": 814,
        "num_comments": 36,
        "created_utc": 1712017548.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1btkqtr/yall_ok/",
        "comments": [
            "Why is bro out in the rain lmao",
            "Oklahoma?\n\nhttps://preview.redd.it/bdd7txmtfzrc1.jpeg?width=1284&format=pjpg&auto=webp&s=ff1b20c3b922304266e3485cc8f47ff4106eba79",
            "I was considering do this but I live in NYC and I will be meme’d",
            "Truly is a tough in the work force! i wish him luck.",
            "this is legitimately sad, wishing him well",
            "H food? What? Also, at least spell “Grad” right. 😂",
            "Down abysmal",
            "I actually have a lot of respect. Less bitching and more action. We should all aspire to be like you.",
            "He should have said will work 0100 food. Must be why they didn’t get the job.",
            "No we’re not",
            "Most successful computer science graduate/student",
            "Yes",
            "Omg this is that southpark panderverse episode come true",
            "everyday i wake up to rejection mails how can one be okay OP😔"
        ]
    }
]