[
    {
        "post_id": "19bp7vo",
        "author": "yoboiturq",
        "title": "So this on tiktok, good luck you all ",
        "url": "https://v.redd.it/oxhgjj14kodc1",
        "score": 809,
        "num_comments": 36,
        "created_utc": 1705793585.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19bp7vo/so_this_on_tiktok_good_luck_you_all/",
        "comments": [
            "https://preview.redd.it/7hiq4h7lvodc1.jpeg?width=941&format=pjpg&auto=webp&s=8b4179ba3c810451080c282269b3b3e103377f2d",
            "If you write your resume like you wrote the title. Have it peer reviewed.",
            "Glad he’s a CS major and not an actor cuz this was dogshit. No emotion, no heart or soul put into this tiktok 🫤",
            "The fuck is this shit",
            "Im pretty sure he went to cc but worked at tesla and another fang",
            "I saw a TikTok about leetcoding with almost 100 k views. It’s not a secret anymore, people say the majority of people are incompetent but forget the number of skilled engineers also increases annually… it’s gonna be a bloodbath",
            "So cringe",
            "why bro acting happy and smiley",
            "This is bad.",
            "Hereby*. Your job search just ended, friend.",
            "[r/TikTokCringe](https://www.reddit.com/r/TikTokCringe/)",
            "Fck is this",
            "This is good, the world is healing...",
            "Most fun cs major",
            "Somebody make sure this guy knows, he’s giving out second hand embarrassment",
            "Do yourself a favor and get out while you still can...",
            "why I don’t date TikTok men",
            "hearby, ngmi",
            "I've got this... Honestly\n\n![gif](giphy|mk0ClXsaw7K2z2cgCF)",
            "![gif](giphy|aNpdBpr8b1nzjCMGhd)"
        ]
    },
    {
        "post_id": "v0ay2x",
        "author": "yangshunz",
        "title": "Tips for a successful internship from a FAANG intern manager",
        "url": "https://www.reddit.com/r/csMajors/comments/v0ay2x/tips_for_a_successful_internship_from_a_faang/",
        "score": 804,
        "num_comments": 46,
        "created_utc": 1653830057.0,
        "selftext": "Having mentored 3 interns who successfully got their return offers, and seen many examples of successful interns at FAANG, here are some tips for your internships which should be useful regardless of company.\n\n1) Do what is expected of you. Firstly in order to do what is expected of you, you gotta know what is expected of you. If you're a SWE intern, most of the time you just need to finish your project by writing high quality code while not being a jerk. To write high quality code, look at how code is written in the code base and follow the conventions, directory structure, naming, use existing abstractions. Break your code into small PRs so that it's easy to review. Nobody likes reviewing PRs which are thousands of lines long. Write tests! At the end of the internship a good litmus test on whether your internship was successful is whether the team would hire you or take their chances with a new intern/fresh grad?\n\n2) Demonstrate independence. Your intern manager/mentor/host is also a busy employee and they have their own work to do. If you run into issues, try to unblock yourself first before asking someone. Look up internal documentation, look at existing parts of the code and see if you can follow similar approaches. If you're still stuck, then ask. Post in support groups/chats and share your high level goal, the approaches you've tried and why they didn't work. This helps people to help you. It's ok to ask more questions at the start but the frequency should go down over time.\n\n3) Take initiative and ownership of your project. Rather than waiting for tasks to be handed to you, look at the roadmap (or create one if it doesn't exist) and keep working on the next item. Break down the project and create tasks for yourself, closing them when completed. Be your own project manager and product manager. Keep a log of the work you've done. This will be super useful if you have to write a self evaluation at the end of your internship.\n\n4) Communicate well. You should be the best advocate of your work. In large companies, peer feedback is taken into account for the internship evaluation. Tell your team what you are doing, make occasional updates about your work, give others visibility into your work and demo your work during sprint meetings.\n\n5) Take feedback seriously. Your mentor should already be providing you feedback constantly, otherwise, you can always ask. Ask how you can improve and what you can do better. Since you'll be spending lots of time writing code, make sure you pay attention to the code review comments you receive and reviewers don't make the same comment twice.\n\n6) Overdeliver on your project. If you're delivering your milestones ahead of time, instead of chilling and sticking to the schedule, finish your project ahead of time. This gives you the opportunity to pursue other things. You can work on stretch goals of your project, think of new ways to improve your project and execute on them. Market your project and get people to use it. Iterate on user feedback.\n\n7) Do what is not expected of you. Of course this doesn't doing mean negative things. Do things which people don't expect interns to be doing. The rockstar interns I've seen, they completed their projects in half the allocated time, had time to help their fellow interns in their work (sometimes even helping full-timers in their work), were added to the team's oncall, helped to review the team's code, and helped to answer questions from external partners about the team's work. Not all of these will be applicable to your situation, but you get the idea. They were functioning and having impact as if they were a full-time team member.\n\n8) Assess the company. As much as an internship is a prolonged interview of your fit for the company, it is also a chance for you to interview the company. Do you enjoy the team's and company's working style? Do they overwork their employees and treat employees with respect? Sometimes interns can be too busy with their projects to pay attention to these things but ultimately these are important factors to take into consideration when deciding whether to sign the return offer. You might not be joining back the same team but the company culture affects the team's culture to some extent.",
        "permalink": "/r/csMajors/comments/v0ay2x/tips_for_a_successful_internship_from_a_faang/",
        "comments": [
            "Great read! What are your thoughts on negotiating a return offer as an intern? As a current intern, it feels quite impossible, since it's likely that you do not have other offers to use as leverage.",
            "+1000 these are applicable for but being a holistically good junior to med level employee (and absolutely even after that!)",
            "~~Oh hey, your enumeration of this broke, but sometimes it be like that.~~ Nice \n\nI find some of this advice to not be comprehensive, even though it's high quality. You obviously have a lot more experience, but I'm somewhat surprised that we have some divergences.  \n\n1.Some teams don't actually have good code quality to start - so writing in line with what they do doesn't always seem like the best. Especially for very mature teams, it seems like they often are in the process of needing people to elevate the code quality, no?  \n2. Honestly, the internal docs suck if you're not doing mainstream stuff. I was told _not_ to wait forever, and to keep the questions my peers should be helping in the chat as a record that I wasn't supported and still pulled through. I was told velocity matters enough that if you spend 1-4 hours trying to find an answer, you should probably ask the people on the team in case there's an obvious solution.   \n3. Do interns at this company _not_ take initiative? My IM explained it to me explicitly, so I feel like not telling your intern that would be screwing them over.   \n4. Idk if your teams have higher standards, but for my 2 FAANG internships, I never got much feedback on the code I wrote. The main feedback I got in general was that I suck at communication (which was what I got leaving with a good offer)  \n5. Is doing extra _really_ required? My impression was that if you clear everything in the project, you'll get an offer, which is reflected by a friend who spent 10 weeks doing nothing. It also seems like there's only two return offers now, so if you aren't going for gold so to speak, that extra work is nil.  \n6. Doing the bonus work is what i was told makes you look great, but isn't it best to work with your IM to figure out what stuff would make you look best for the evaluation?  \n7. Isn't one of the big perks of working at such a large company that you can just join some other team to do other stuff?",
            "In the project, the manager says that if you are stuck on something, ask right away, and save that 1 hour of reading and researching to actually do the task. This advice seems contradict to yours, but it has its good reason. What are your thoughts about this?",
            "How do you get the skills to create the projects and do what is expected of you from the team? I feel like my general skills suck and I’m going to a big tech company where they ask you to do a project as an intern. I feel stressed and not really sure where to start if I get it.",
            "Starting my internship in a few weeks, this is really helpful, thanks for sharing!!",
            "I’m currently struggling with 3. Any advice on how to build a roadmap? I feel like I’m expected to break the project down into tasks, but how can I when I don’t know the tech stack, what’s involved (in a detailed way) and how long it may take?",
            "You say \"keep a log of the work you've done\".\n\nBeing someone who journals and builds a knowledge base during my studies and non-critical work projects, is it okay to continue doing that at a big company?\n\nI'm obviously not allowed to share it, but is it okay to journal for myself or should I separate my notes and keep a strict work journal?",
            "Nice tips",
            "Thanks for the tips! Those ‘rockstar interns’ in the 7th point though, are most likely people with prior work experience. If it’s a fresher or someone for whom this is their first internship, it’s really hard to be like that",
            "If you get place into a team with complex domain knowledge, good luck with being oncall or working on ticket.",
            "TLDR:  Be the best.",
            "Thankiiieeee :))",
            "Saved.",
            "these are literally just the axes fb uses to evaluate rofl",
            "hi, thank you for sharing your insights on this. im currently interning and would like to ask it is alright not to ask many questions?\n\nCurrently, have yet to ask any technical questions because usually i unblock myself with some google searching. I'm quite familiar with the stack i'm using as well and have conpleted my project ahead of schedule.\n\nMost of my questions with my mentor involves clarifying requirements and whether my code design would make sense. I usually check in just twice a week because my mentor seems really busy. So i was wondering if it was alright to only ask not that many questions?\n\nSo far my mentor just says that my project has been nice and gave me feedback pn how to improve which i inplemented.\n\nI always heard asking many questions is a good thing, but i don't have many critically important ones to ask so far, since he is busy.",
            "remindme! 2 months",
            "Most importantly Have fun!",
            "RemindMe! 6 months",
            "What are some examples of intern projects at fang companies? Someone please respond I’ve been wondering this for years",
            "What do you think about freshman interns?"
        ]
    },
    {
        "post_id": "1bs5xjw",
        "author": "OldHummer24",
        "title": "Y'all who are unemployed after graduating, build a startup",
        "url": "https://www.reddit.com/r/csMajors/comments/1bs5xjw/yall_who_are_unemployed_after_graduating_build_a/",
        "score": 808,
        "num_comments": 263,
        "created_utc": 1711875402.0,
        "selftext": "First of all, very sorry this happened to you and yes the job market is terrible.\n\nBut if you've been unemployed for 8 months, and only have a bunch of dummy to do list projects, I would advise you to change course. No employeer cares about tiny pet projects. They're too easy to make, they never know if you just copied them, and it's questionable how much you really learned.\n\nIf you're really into this career, just pick a problem to solve, pick a modern technology, and start building. With cloud services, you can have an actual revenue generating Saas in a couple months. You will learn a lot, things that you would also learn on the job. It makes you stand out and is a great talking point in interviews. But, it must be a published project running in production. With users.\n\nOn the side, also apply for jobs. But this way, you won't be wasting your time as much. You'll be learning stuff + maybe even making some money.\n\nEdit: just to summarize why this works:\n1) You will fill your knowledge gaps from uni and learn a ton\n2) You can claim to be the founder of XYZ and look more appealing than 8 months unemployed \n3) You show initiative, self reliance and passion for your craft\n4) You'll gain confidence, as you know you can build stuff yourself\n5) Interviews will go better as this is great to talk about, and you can show your passion when taking about it.",
        "permalink": "/r/csMajors/comments/1bs5xjw/yall_who_are_unemployed_after_graduating_build_a/",
        "comments": [
            "Ive been attempting this. University education is very far from full stack development for customers. I have knowledge here and there but building an app or software is hard to do. Like i certainly can make a python program doing some basic stuff but in order to create real value, its harder than it sounds.",
            "I did this to fill a 4 month employment gap. The great part is, they only asked for proof that the business as a legal entity existed. They didn't care if it actually made money or if I ever got paid.",
            "To gauge if this is valid advice or somebody pulling something out of his ass the question is - what startups have you OP started and do they bring in any meaningful revenue / have a meaningful userbase? Or are you giving advice on something you have not gone through yourself?",
            "How do you even go about finding a problem to \"solve\" when your only real experience with coding is in academia, and not profession, enterprise-level problem solving?",
            "Ur problem needs to be somewhat non trivial. You won’t be motivated to continue project building after gunning development for the 782nd budgeting app.",
            "The prototype of Uber was built in 2009, during the Great Recession 🤔",
            "Solid advice actually, I'm not unemployed but very much underemployed, working the same help desk job I had while working through college. The good news to that is I've gotten so good at my job that I can complete task really fast so I'm left with a lot of free time. For the past six months in my down time at work I've been developing a company employee directory replacement for the excel spreadsheet they have been using since 20006, I presented it to my boss last week and was given very positive feedback and requested I add a few features before we launch it. He also wants me to work on two other projects when I am done with this one.\n\nNow I have a great portfolio project that I built myself using modern tech, Astro, Tauri, Sqlite, and JS. My annual review is coming up in June, I'm going to request a title change and a bump in pay, if I dont get it I have a neat project to show other potential employers",
            "This is another reason why the market is saturated with terrible \"start-ups\" and far too many dating app variations that no one asked for.",
            "Do you have any idea how difficult startups are??? Yes it’s easy to see “r-tarded company x raised 10 mil in seed” but have you actually tried to raise capital? Have you ever reached out to people asking for money or tried to build something where after 6 months you still have yet to achieve product market fit and keep the team together?\n\nSpoiler alert… it’s F’ING HARD\n\nSource: have a startup that has raised capital and gotten terms from VC’s. ITS HARD.",
            "Created a startup. Worked on it for 2 years. Failed like 99%. Totally useless on my cv. I regret have it done every day of my life. It thought me a lot, tho",
            "Also make.sure that your company is 100% remote. We need the future to be remote companies.",
            "If anyone here is thinking, “Yes I have the technical skills for this” but, “Hmmm I don’t have any {great ideas/marketing skills/ experience planning a startup/ insert non technical prohibitive issue here}” then please message me. I am currently coming from the other side and trying to upskill to obtain the technical part of the technical co founder role and would love to share some ideas with more technically talented people and see if we could work collaboratively on them, I just like building cool stuff and seeing how talented people work so I can learn! And of course, if we do well we could always make some money from it!",
            ">You can claim to be the founder of XYZ and look more appealing than 8 months unemployed\n\nIf you have customers, sure, itll look better. If you dont, it will not look good AT ALL. You would look a LOT better to employers to have gotten any random job (literally amazon warehouse or mcdonalds type shit) out of college before getting your first 'real' job, than to have spent the time after college cosplaying as a founder.",
            "To everyone saying that they cant do it, because they dont have the skills:\n\nThat is exactly why you should. OP is not telling you to go start a succesful business. You can learn so much from trying.\nYou can pretty much do it for free using Azure (and probably AWS as well).\n\nI was able to create something I am pretty proud of right after finishing university using Azure and ChatGpt as an advisor",
            "I don’t agree that “build a startup” is the fix-all solution (if you don’t even have the skills to GET HIRED for a role, you probably have even less of the skills needed to ideate, develop, and run a software company). I think the more important thing is “build meaningful projects”. Build a project that you come up with from scratch, that forces you to learn new things. Build something impressive, something that you WANT to make, something that’s unique and that you enjoy talking about. The result will be much more meaningful to both you and potential employers than any simple project that could have clearly been the result of a tutorial or outright stolen.",
            "This is what I’m doing.  I have a working SaaS solution and it’s the only thing that was able to get me an internship (in a related field) that my (in my opinion, at least) stacked resume wasn’t able to.",
            "I doubt any serious employer is going to be fooled by you starting up some no-name company. Anyone can do that, it proves nothing.",
            "One of the issues is the lack of VC funding to fund startups rn.",
            "Doesn’t the fact that money is expensive and VCs aren’t financing anything near what they used to going to complicate this plan somewhat?  If I’m out of work, I’m looking for my next gig from sun up to sundown, where am I going to have the time and energy to build a useful MVP during that time?  Not to say that this isn’t a good idea for a small, select number of engineers, but most folks will find this idea pretty challenging, no?",
            "The bar keeps rising.",
            "It’s probably a wiser decision to pivot to a dev-adjacent role if you’re a long-term unemployed new graduate.\n\nSuccessful indie hackers need to build an audience, so outside of building your startup idea, you’ll need to be marketing — a *lot*. Good ideas without any user base will be poached and pushed by somebody with 20,000 followers on Twitter.\n\nPivoting to a less-technical role like QA, sales engineer, or solution architect would at least get you something software-adjacent, if you have the social skills to pull it off.\n\nOf course, if you haven’t built a professional network of any sort and you have no idea *how*, no amount of hacking is going to help.",
            "All these people hating on OP.  I did (doing) exactly what he recommended except I'm not unemployed.  I'm a data scientist with no previous full stack dev skills and I built a start up to learn full stack dev.  It took about 3 months to learn Django and React, and six months to build it out.  We just launched our MVP.  Currently, no users yet, but when I put this on my resume, it will be as a cofounder of a start up, not a pet project.  It would be an insult to the level of effort I've put in to be called a pet project.  \n\nIf I were unemployed, I could probably have this done in two months.  The problem is that unemployment takes an emotional toll on your well being and those that are unemployed will not have the motivation to take on such a huge task.",
            "As a student (2nd year) should I start something like this too so that it helps me in future? Any courses I should do before this then pls tell which could help, thanks in advance..",
            "For everyone saying “but starting a startup is hard and all of the problems have already been solved.” If you seriously have trouble thinking of new ideas (even something as simple as a new video game or a marketplace for one of your hobbies) perhaps you need to find someone that doesn’t. Even if your startup fails (which it absolutely will) you will at least gain experience in full stack development, business and dealing with stakeholders, and have something more to show for it than a simple CRUD app.\n\nEdit: For context, I have not founded a startup myself but have been involved as a consultant or on the board in the extremely early stage of many. One failed, one is just starting and taking off, one is successful and will soon be acquired by another company, and the one I’m at now is a work in progress. I consider the education and experience I’ve gotten at these startups to be invaluable and it has drastically helped me at communicating, interviewing, and taking a balanced approach to software development that reflects business needs rather than my own desire to write cool code.",
            "Been looking for people to build projects that can make some money. There’s more opportunities than ever out there. I’ve got experience in building projects like this, and if anyone’s interested for making cool stuff with tech hmu.",
            "It's easier to be a hardware retailer and sell online IMO. To be a succesfull programmer you first need a lot of experience, second you need a REAL problem to solve, third your solution has to give more than competitors, fourth capital, fifth social capital, etc.",
            "To those saying this doesn’t matter: maybe not to Google or Netflix, but project experience is a key differentiator in the early-stage startup world.",
            "Fantastic post, sir/ma'am. I love the positive energy. Posters here need to be more optimistic and creative. Many of you have the aptitude to create something valuable, but you all lack the confidence and creative energy to execute. It's a tough time, but I really appreciate the OP putting this out there.",
            "On one hand this is good advice, on the other hand, No way did i have the skills to do something like this after i graduated. I didnt know my thumb from my arse in terms of system architecture and how how i would build a greater solution to solve a problem. So i guess if you're talented enough or got a remarkably good Uni education then go for it but if i was in the shoes of a graduate there's no way i could have pulled that off.",
            "I agree this is good advice but man it is a grind, to get a heavily taxed salaried job after years of study- not an enviable position.  \n  \nAll in.   \n  \nDon't be afraid to change plans though. Values don't change much. Purposes change less but plans can change frequently as you find better ways. I advocate plan-flexibility. It took me a long time to learn that, as well as to follow the market. In some industries the market is cyclical but sometimes people get pig-headed and think they can tell the market what it wants. I'm just speaking very generally here. Tech is still a great industry. \n\nThe OP had a good path suggested- even a great one, a gutsy one. People say the best time to found a company is when you're single and broke, so go after it. Steve Jobs did. It is a great path. Another one is take whatever tech job you can and just build up slowly. There is no one right answer.",
            "if anybody is here from Nashville and is also searching jobs at the moment; would love to meet and share experiences. Possible help each other in landing a job by solving some problems and learning from each other or perhaps as the post suggest may work on an idea and see where it leads!!",
            ">no employer cares about tiny pet projects\n\nThis sounds like the blind leading the blind, depending on what you mean… and unless you mean projects that are so obviously small and stupid that anyone dumb enough to think they were relevant isn’t smart enough to pass an interview anyway, then you’re just flat out wrong. I’m a mid level dev. Do you know what I’ve talked about in every interview ever? Small projects I’ve done.",
            "Most student “start ups” are just glorified pet projects so think about this before putting it under work experience lol",
            "You are assuming hiring managers can’t sniff through the bullshit, a new grad “founder” is suspicious. You are also GREATLY underestimating the difficulty in acquiring customers. Without users (and ultimately, revenue), it’s just a personal project and not a business. The tech is the easy stuff.",
            "The best dev I know went from graduating, to founding and failing 3 start ups for 5 years then took a job at a major bay area company as a staff engineer then got promoted to senior staff the next year. They learned so much in those 5 years. I went into corporate and I'm kinda jealous.",
            "How opportune. I have a problem worth solving and a solution, but without the technical skills to build it out. I have experience in tech and operations and business development, looking for someone to share my passion in starting something. \n\nI have a plan and a will, just little technical skills and I'm currently looking for a partner(s). Hit me up if you are interested! It is based in the apparel/retail sphere trying to fix the problem of online apparel shopping returns.",
            "My Recommendation would be, unless you actually have an idea, don't build a startup because the amount of those that fail in the run of a year is astronomically high.\n\nYou will not fill your knowledge gaps because you will not have a mentor to critique your work effectively. You can also potentially massively ruin your credit or reputation depending on how terribly you perform.\n\nUnless you actually have a good idea for an app that you want to run as a business, Don't just do that... You would be better off getting a job in a tangentially related field and then transitioning later.",
            "How do you do marketing and sales?",
            "I don’t have the funds for a start up unfortunately",
            "THIS",
            "Hi! I was wondering if people had any tips on where to get started after coming up with an idea to solve. Most of my experience so far has just been in academia so when it comes to things like actually developing something and especially trying to market it I am a bit lost and would appreciate some general guidance!",
            "I need some interns",
            "How do we start a start up? Should we borrow a mone from bank?",
            "Yes just create a business, it’s not that hard.",
            "I'm all in for building saas. But what I feel is the project management, code quality and whether I am reinvent something that's already available to solve a problem. I feel having a veteran mentor would help a great deal",
            "Alternatively, instead of trying to fill a gap in the market, fill a gap in the literature. \n\nDo a review of the literature for a field or problem space you are interested in. Find something you can build off or a gap you can fill. Build off of it. Write a paper detailing the gap in the literature, your methods and solution, and the outcome or benefit of your approach. Pop the paper up on arXiv and the code or solution up onto github. \n\nGet a couple of cheeky, useful, and novel algorithms or approaches under your belt and you’ll be on track to landing a job in no time. \n\nIf you find it really interesting and engaging it should even help you land a PhD position.",
            "honestly, if the point of having an employer is that they get the profits while I get the stable paycheck, but they're willing to fire me because they had a bad quarter, there's no reason to have an employer.",
            "Sure, if you have an idea and the time/will power go ahead and start cracking; just don’t have lofty expectations that your “startup” is going to make any money or be valuable to anyone but yourself. Unless you have deep knowledge of a specific industry or niche, you’ll be making a basic, run of the mill, CRUD application that doesn’t offer much in a saturated market. \n\nI have had success making money in free-lance and independent app development in two ways: niche application that solves a very specific industry problem and two, people paying me money to develop their shitty idea that gets abandoned after I fork over the product. \n\nFor the former, you need to start researching how specific industries work prior to building. Learn and read up on EVERYTHING. When I was in college I made money developing video game exploits, believe it or not, it’s an industry.",
            "I have an interesting edtech startup idea, if any one wanna contribute ping me! Tech stack required is Full stack development and Cloud.",
            "I mean you can literally get a job while you search for another job in your field. Simply being unemployed is usually a choice it’s not like there isn’t jobs out there it’s more like just not ones you want to work while you get your dream job. Idk how anyone just stays unemployed",
            "don't you need money to start though lol",
            "I’ve decided to become an inventor. I will just invent things from now on. If anyone needs an invention, they will just come to me and I will make one for them.",
            "It's like a high schooler forming their own company lol \nIt didn't help me after college either\n\nEmployers don't take startup after graduation seriously , google will still give you a new grad role after couple years lol",
            "secretive grandfather wakeful soup drab gullible fearless arrest tidy nutty\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Bro said “make a startup”\n\nOkay, so I’m unemployed and gonna use cloud services for clients. Which ones am I gonna use to host my client’s massive amount of data for free while I try to become profitable? What market am I going to target that’s not over saturated with better options for less that will draw clients to me? Where am I getting my seed funding?",
            "TL;DR this post: stop being poor pls\n\n  \nGet a grip OP, you're not making any sense",
            "In what other job field would this be the answer? I find it ridiculous for someone to need to create a start up to have a job. This is the same vibe as an employer giving multi-hour long code projects as part of a job application. The job search in this industry sucks because of people with your mindset. Employers need to have some trust in the people they are interviewing.",
            "comment so I can read later"
        ]
    },
    {
        "post_id": "v4u6oz",
        "author": "Pokyparachute66",
        "title": "take a breath, it really ain’t that deep",
        "url": "https://www.reddit.com/r/csMajors/comments/v4u6oz/take_a_breath_it_really_aint_that_deep/",
        "score": 805,
        "num_comments": 90,
        "created_utc": 1654365406.0,
        "selftext": "I’ve been a long time lurker of this subreddit and there’s some pretty obvious themes here. Y’all need to chill and drink a beer or something. The amount of posts that are just blatant overthinking and just trying to find a reason to worry is unreal. No jimmy, just because you you got a 98% on your exam instead of a 100% doesn’t mean you should quit cs. I feel like half of you just sit in your rooms writing down a list of every possible thing to worry about and treat it like it’s going to ruin your life. Just take a breath, it really ain’t that deep",
        "permalink": "/r/csMajors/comments/v4u6oz/take_a_breath_it_really_aint_that_deep/",
        "comments": [
            "Thats why I sleep 15h on weekends",
            "The people in high school that are coming onto this sub need to get outside and enjoy their time before college",
            "ill shorten this: touch grass",
            "This post reminded me so much of r/ApplyingToCollege . It's like the no lifers there just got funneled into this sub.",
            "I’ve said this a few times but I’ll say it anyway. My career goals are ~100k, working 4-5 days a week from home, in a company that doesn’t bust my balls when I ask to take PTO. I’ve got so much other shit in my life, climbing some $300k a year mountain of LC and ass kissing corporate overlords is a waste of time.\n\nI like working, but not enough to spend my whole life worrying about it.",
            "For real lol. All people care about is constant fear-mongering about oversaturation of tech jobs, which Ivy League is more resume-worthy, and whether or not they can land a FAANG as a freshman. It's so absurd the obsession some people have over these tech companies. Just chill out and try your best.",
            "TC or GTFO",
            "I also find it funny how so many people on this sub and cs students in general worry about so many things... but don't even do those things.\n\nRelax, try to do the best you can, apply for interships, do leetcode, get the best job you can, learn from your mentors, apply for better jobs, make bank, retire.\n\nAll of this is simple and attainable. Just relax and do it.\n\nExcept bitches, there ain't any here.",
            "C’s get degrees boys and girls. You’ll be alright",
            "Should I quit cs because I’m about to fail my assignment tomorrow?",
            "A big concern these days seems to be GPA. LPT: almost no company cares. FAANG may act like they care, the majority of other companies do not care. Companies will ask for your transcript to have proof you graduated but that will be after you have accepted their offer. \n\nA lot of people are concerned about GPA as an undergrad because they want to get into grad school. That's a horse of a different color. Grad school apps do include GPA and the committee will look at it.",
            "Like bruh there are more jobs than FAANG that pay just as good or even better for less work. Doctors don’t expect to work at John Hopkins or something out of university and neither should any of us.",
            "Competition for certain jobs like FAANG is definitely fierce and some people like and can l handle that kind of stress. But most will burn out, I certainly am victim and have seen friends burn out. You have to know your limits and push them smartly.",
            "True",
            "My favorites are the humble brag posts. People acting like choosing between Apple or Amazon, will ruin their lives if they don't make the right decision; or if they should go to Harvard or Yale lol",
            "very true, i was the person you're talking about \\~2 yrs ago, now that i'm saner i realize how insignificant things caused me to spiral like you see posts on this sub",
            "Go post this on r/cscareerquestions to.",
            "Yeah. But what if I had nothing else to do with my life, besides shitposting and working?\n\nAnd I overkill it in order to mask depression since therapy doesn't work and while unsure of why, I still want to live thus suicide isn't really an option. \n\nJust let everyone cope their own way, as unhealthy as it may be.",
            "True that.",
            "I find that relaxation is just as important as worrying about studying or preparing for a FAANG job. If you are unable to step away and get your mind off of things at least once a day all your doing is working which in my experience just leads to burning out again and again. And when you constantly feel stressed and burnt out that difference between 98% & 100% feels like the end of the world. Touch some grass my friends.",
            "Try grass my friends",
            "But if I take a breath, I will not be able to do leetcode in that moment and as a result will get left behind in school",
            "Did someone post here being sad about getting a 98? I didn’t see it",
            "I see this post like 6 times a day. Stop projecting bruh",
            "“Y’all” \n\nOpinion discarded",
            "I agree !!!!",
            "🤭 😂",
            "People are stupid lol. Period",
            "Lol",
            "."
        ]
    },
    {
        "post_id": "1bqfax9",
        "author": "Khoj-",
        "title": "Full time Stats",
        "url": "https://i.redd.it/cnn3vc7b07rc1.jpeg",
        "score": 800,
        "num_comments": 45,
        "created_utc": 1711682981.0,
        "selftext": "Keep going. All you need is one. 🫡",
        "permalink": "/r/csMajors/comments/1bqfax9/full_time_stats/",
        "comments": [
            "1 shot and bro did not miss.\n\nRespect 🙏",
            "If you had one shot. One opportunity. To seize everything you ever wanted in one moment. Would you capture it, or let it slip....",
            "Clutch",
            "1 shot 1 Kill",
            "Congrats, This just gave me hope!",
            "Bro is him",
            "Broooo.. that's a huge W.",
            "Congrats! This just gave me the jolt I needed to start the day.\nWhat kind of tech stacks do you know? And what type of company is this? Any previous experience?",
            "You only get one shot, do not miss your chance to blow.",
            "college? this looks weird.",
            "Bro got one shot and he hit the bullseye",
            "One shot, one opportunity and you captured it",
            "I see this type of data visualization a lot, especially on this sub.\n\nWhat’s it called and what software do you use to make it?",
            "That’s awesome, congrats!!",
            "congrats! Did you have any internships? Good gpa?",
            "If you had",
            "Zero ghosts?",
            "Congrats. My mindset is kinda just to find that 'one' path that will take me to the offer to. I just need one offer, just one.",
            "I see this type of data visualization a lot, especially on this sub.\n\nWhat’s it called and what software do you use to make it?",
            "Huge W 🫡",
            "I’m on I think 250 I lost count after 200",
            "I had an interview but fucked it up 😭",
            "Bro do you need sponsor?",
            "120 applications with ~4yr Experience and no interviews yet",
            "Full time?"
        ]
    },
    {
        "post_id": "txqa5h",
        "author": "Embarrassed-Nerve686",
        "title": "Google just rescinded my internship offer",
        "url": "https://www.reddit.com/r/csMajors/comments/txqa5h/google_just_rescinded_my_internship_offer/",
        "score": 806,
        "num_comments": 191,
        "created_utc": 1649262994.0,
        "selftext": "Upd: I posted on linkedin: https://www.linkedin.com/feed/update/urn:li:activity:6917809915700854785/\n\n# I AM NOT FUCKING RUSSIAN. I WAS REFERRED BY A UKRAINIAN FRIEND (LITERALLY). FUCK YOU PUTIN. \n\nI matched with a team 2 months ago and already signed my contract / did my background check and  was in the middle of obtaining a work visa.\n\nI am a student in a Russian university who put their dorm address on the internship contract. \n\nGoogle provided no information, no opportunity to solve this. Others from the same university who had used their home addresses didn’t get their offers rescinded. My only mistake was using the university address. \n\nThis is extremely unfair, I did everything I could. I stayed in Russia despite it not being safe and being financially suffocating just to get Google all the documents they needed in time, and this is how they respond. I gave notice at my current job since the internship was 2 months away. I couldn’t go back to my country because I was waiting for documents for Deloitte for the visa. \n\nI did everything, why am I (a non-Russian) getting my opportunities taken away from me? I come from a third world country and this was a big deal for me, I worked hard for this, I rejected other internship offers from other big tech, what have I done wrong? What can I do?",
        "permalink": "/r/csMajors/comments/txqa5h/google_just_rescinded_my_internship_offer/",
        "comments": [
            "Maybe they thought you’re a Russian citizen and that they can’t hire you due to sanctions? \n\nEmail the recruiter or HR and try to clear it up.\n\nAlso, are you sure your offer got rescinded and you weren’t just not matched to a team?",
            "This might be kinda skeevy, but if you want an actual reply, it might be worth it to post about it on LinkedIn. I see these posts gain traction sometimes and the company feels pressured to respond and resolve the issue.\n\nIn any case, you got into G once. I'm sure you're smart and have a great career ahead of you, with or without G. Best of luck.",
            "Is this for Google US?",
            "[deleted]",
            "Ok Idk if someone already suggested this, but I strongly urge that you post on LinkedIn and tag Google in your post. There are a lot more people who will see it there – including potentially from the Google Zurich office – and the publicity it will get there might just get your case noticed and help you out.",
            "Here's my best advice to you:\n\nIt's a long shot, but try to get in touch with the embassy of your country/nationality in Russia. Explain the situation and ask them if they can put you in touch with a point of contact with your country's embassy in Switzerland/Zurich. (If they can't you may need to do some more research and contact your country's Swiss embassy/consulate directly).\n\nThe final steps would then be contacting Google Zurich's legal department with an appeal and explanation of the situation that you're not a Russian citizen and would not be a party in Russia for the duration of the internship - and have your country (e.g., consular officer or if you're lucky, ambassador) endorse this statement.\n\nLike I said it's a long shot, but right now you first need to take a deep breath and calm down. This is a setback but not the end of the world.",
            "This doesn't make sense. You know what you have to do. Make a public polite post (not like this one) in which you explain the situation on LinkedIn. \nI can't believe Google is doing that. There is clearly a misunderstanding. Make noise. Make noise. Make noise. Using Reddit is useless you need to put your face on it.",
            "holy shit bro check my last post. this is getting out of hand",
            "If you post about this on Linkedin, please send a link here! I am a currently google intern with a sizeable linkedin following, so i want to help spread the word",
            "currently im in the middle of the process with google. i am currently working at yandex (russian google), but i am not a russian citizen too, not even in russia rn. after congratulating me on passing the phone interview and moving me to the final round, the recruiter has been quite for 2 weeks, even though i pinged him already. \n\nstarting to think that i may be in a similar situation.\n\nhope you resolve your problem, it sucks.",
            "Make a LinkedIn post about it",
            "Is there anyone else you’ve been in contact with apart from that recruiter? \nTry reaching out to your Hiring Manager or any other recruiter, maybe via LinkedIn and see if they can help. \n\nAlso put up a post on LinkedIn with the right hashtags, hopefully someone will notice and help you.",
            "I would suggest to post this on LinkedIn too!",
            "I would recommend you apply again and this time make sure your situation is well explained.",
            "“Sanctioning Russian workers hurt Russia” all it does is it hurts citizens",
            "Are you / would you be working remote from Russia right now?\n\nNot sure if Western sanctions also affect non-Russian citizens working in Russia right now",
            "This is so ridiculous and I'm sure it was done by some hotheaded newbie in HR that doesn't even know what to do and just saw Russia in there and decided to make shit up on behalf of Google.\n\nHiring Russians has nothing to do with sanctions, and this guy is not even Russian. I know this because I work at big V and when they closed down their Russian operations, they offered to move Russian employees from Moscow to Dubai to continue with V, or if they didn't want to leave Russia they offered them referrals to other companies inside Russia.\n\nI'm pretty sure other companies are doing the same thing. In fact, between V and G, V is waaaayyy more conservative and sensitive to sanctions given the nature of their business. No one is right of the bat letting their team go because they're Russian. That said, it doesn't make sense to pull an offer because the student went to a Russian university.\n\nI hope you get to resolve this soon and get your offer back.\n\nIf anyone reading this here working at G please help him out if you can.",
            "Put it in linkedln and post the link here so we can all like and share your story. That might help you get more reach",
            "Well, my best (read worst) suggestion is to create a tech startup and put google out of business.\n\nFailing that idea, Google has some options for recourse on this matter. Do you have any contact with your recruiter still?",
            "I don't think the problem is that they think you're Russian. You used a Russian address and therefore are associated with Russia, and in turn, the sanctions levied against Russia and those within its borders. A Russian outside of Russia may not have any ties to Russia (e.g., born outside of the country), but a non-Russian living in a university inside of Russia definitely has ties to Russia.\n\nSanctions may not have been meant for you, but you are associated with Russia. You live in Russia and can have more of a \"say\" than outside of Russia.\n\nAs for your internship, it looks like you have already tried but the offer is gone. You would have to try again, or elsewhere. Unfortunately that is the world we are in now. Managers would be wary to work with a resident of Russia, who may be trying to use students to infiltrate Western organizations.",
            "Damn dude that sucks. I swear I think I saw your post about Google rescinding your offer on my LinkedIn feed this morning!!",
            "Okay, let's use logic, shall we?  \n1. You, who stated your address to be inside Russia, got rejected. Your classmates in the same situation were not rejected. Thus the problem is the location, not the citizenship.\n\n2. Google didn't publicly announce this. Thus this is not something about the public image (in a positive way), but about something else. The most probable reason is money. Google is a company, they care about profit the most.\n\n3. There were no sanctions based on citizenship. But there are a lot of problems with the money transfer and with getting visas (and thus relocation) from Russia to anywhere else.\n\nResult: they rejected you not because Google blames you for the war. They rejected you because it's going to be hard to relocate you from russia to Zurich and they don't think you are worth all the trouble.\n\nI'm really sorry that this happened to you, this is unfair. But it's actually less unfair than what you assumed: banning all russians. Because they didn't choose to have this connection to the aggressor, but you did.",
            "Welcome to the corporate world",
            "I doubt being in Russia had anything to do with it, it's not uncommon for people to get offers rescinded.",
            "This is not something you can use \"reasoning\" here though. Unless you own a critical part of the structure, why would a compamy risk it with \"potential\" political issues ? People can talk about a \"non-discrimination\" workplace all they want, in the end they are here for business, not charity, so \"fairness\" seem not on your side. Try every comunication you can first, but if it's not working, move on, update your address or whatever you think can help, there are so many big companies out there if you are looking for a \"fancy\" company name on your resume.",
            "Google leadership have toxic SJW beliefs, just look at them throwing money at BLM. Their leaders are illogical and ideological.",
            "If you would support them rescinding the offer to someone simply for being Russian, lmaooooo you deserve it. If not, that fucking sucks.",
            "Good times we live in, people need to prove they are not russians to get a job. I remember this kind of stuff happened before, just don't remember where and when...",
            "you went to a russian university, and used a russian address. sorry, but even outside of sanctions you are a security risk to any american company that hires you.",
            "[deleted]",
            "Wrong place to post. Do it on HackerNews, you might get some offers.",
            "bruhh.....",
            "Make a new reddit post saying you posted it on LinkedIn!!!!",
            "cyka blyat"
        ]
    },
    {
        "post_id": "18mk4fr",
        "author": "Snoo42613",
        "title": "Friend started a company and offered me an “internship”.",
        "url": "https://www.reddit.com/r/csMajors/comments/18mk4fr/friend_started_a_company_and_offered_me_an/",
        "score": 801,
        "num_comments": 124,
        "created_utc": 1703041111.0,
        "selftext": "My friend’s a freshman, and he’s been working on a side project for fun. He recently decided to make it into an LLC and call himself an intern for this company and put it on his resume. He said if I wanted, I could put it on my resume too, and if asked any questions to confirm employment, he would confirm it.\n\nIs this going to work for him? Should I take him up on the offer just to add to my resume?",
        "permalink": "/r/csMajors/comments/18mk4fr/friend_started_a_company_and_offered_me_an/",
        "comments": [
            "It’s an internship. Take it.",
            "Sure why not. You could even try calling yourself a founding engineer lol",
            "Why call himself an intern? Why not just call yourself both co-founders.  \n\n\nEDIT: In all seriousness, legally incorporating and starting to build a product are two steps to starting a company. This post is phrased like it's doing something sneaky, but why not just commit to it? It likely won't go anywhere, but it'll look much better to say, \"I tried starting a company with my friend freshman fall. We accomplished X, Y, and Z technical tasks, along with these business tasks\" than to say \"I couldn't get an internship, so I basically did nothing all summer.\"",
            "Experience is experience, I don’t see why not? Unless you wouldn’t actually be doing anything and just putting it on your resume which it sounds like may be the case? In which case, why would you?",
            "Do it! Are you planning on helping with the side project? Maybe you could start your own, even.\n\nHell, thats not a bad idea - i might do it myself",
            "Yes. You can do this for the experience and put it on your resume. Then later you can look for other internships at bigger companies and the past experience will help.",
            "Yes. I founded a startup and it’s still early stages but it’s helped me get jobs after the fact. It’s also a great conversation topic for interviews",
            "I have never seen a better use of an LLC than this",
            "Bro you looking for a part time CTO by any chance?",
            "Your friend sounds like a genius",
            "Put me on.",
            "As long as you gain relevant skills, I don’t see anything stopping you from doing it. Just remember not to embellish what you do on your resume because that’ll inevitably end very poorly",
            "This is a great idea, hence take this post down",
            "honestly, setup a respectable contract with him in terms of ownership and go full try hard mode getting the project running. \n\neven if you think the chances of succeeding are null and the company is fake, the experience is as real as any other.\n\nbetter you do that than land a first job in a tech support role and not develop your sotware engineering skills at all.\n\ndo keep in mind though that this approach will likely teach you alot about greenfield projects, but not alot about maintaining an existing project.\n\nhowever the ability to preserve code quality and maintain a project is likely undervalued so from a career standpoint that may be fine.\n\nEdit: do remember to bring your app to production. that means running on live servers connected to the web or distributed online for one you can install. people tend to greatly underestimate the difference between it runs on localhost and it runs on the bosses wife's boyfriend iphone 4 se safari browser.",
            "A startup as good as any other.",
            "I did this a few years ago. Can confirm it works",
            "I am going to go against all of the other people here. I don't know if he has bought himself any stock equity but put up a little bit of money and tell him you want to buy some stock and become a cofounder. now you have much greater investment into the company and you can still work as an engineer.",
            "Tell me about your time at Mr Godot Enterprises LLC. What were you working on?",
            "based on the post, why is the founder calling himself an intern 😭",
            "How else your gonna have that X years experience in your CV, by doing personal projects. You should talk to him and find some common ground for you to write in your CV that your a junior dev.",
            "If you have the capacity to absorb the workload, definitely lend him a hand. Could be the next Facebook, and you're there in the beginning.\n\nOtherwise, it's still valuable experience.\n\nI think \"Intern\" is too reductive, and \"co-founder\" or \"founding engineer\" sounds a bit cocky (especially at this stage). Try to find a way to make apparent that you're actively participating in the development of a business during your studies (e.g. list the name of the LLC and describe some of your activities, without specifying a job title).\n\nThen again, I don't know the specific job market, maybe the cocky titles is culturally accepted, but from a general perspective I'd probably skip a CV that says stuff like that.",
            "I did the exact same thing when I was a freshman xD. I don't think I learned much from the experience, but what can you expect from a bunch of freshmen who have only taken an introductory CS course in C++. I actually ended up switching roles to product designer because I couldn't code well. Although the experience didn't help me gain technical experience, it did play a role in getting my first real internship the next summer at MathWorks.",
            "yo!! can u add me too-  \n\n\nStill a HS senior tho-",
            "Do it.",
            "Bro's cooking 💀",
            "Somewhat related question, anyone know if you can intern/work full time for a gang or something companies while having LLC being registered on you?",
            "Whoa. That's such an awesome idea.",
            "Ask this in r/careeradvice",
            "I love how this post seems like your being sneaky, but in reality your friend just actually started a company. Sounds like you got it planned out, do things proper, and being able to talk about trying to do a startup even if fails still looks good on a resume.",
            "Honestly, you should ask another sub with professionals about it. This sub is mostly just students and it's a bad time to be one.",
            "You guys hiring any interns on the communications or project management end? :p",
            "Yes, it seems like it will work out for you because from your perspective, it's just having a job. I've thought of this same thing before though, and I'm not sure how it's going to work out for your friend. I don't think he can reasonably call himself an \"intern,\" but even if he calls himself something more appropriate like \"Developer\" or \"Junior Developer,\" how is he going to be a reference for himself? My best guess is that that's where you come in. You can serve as a \"coworker\" reference. I'm not sure if there's something wrong there or not, and I'm really bad at guessing when I'm looking at a \"Yes it's illegal, but no one cares\" situation. Ultimately, I opted for paying someone on Fiverr to fill out applications for me to get around the effort and possible issues.",
            "Made me remember how a friend of mine, just created a VR club in school and put it on him resume as the President and founder of \"so and so club\" just to showcase his engineering skills.",
            "Why are you giving me ideas 💡",
            "DO IT!! Please! You need experience and you can’t get experience without a job or internship. I’m literally helping a friend create an app for her company.",
            "Did the same thing back in college lol, made myself an automation engineer. All I did was create a python script to scrape data and make Youtube videos",
            "do it bro, there's nothing i would ask more than for a motivated friend to pursue entrepreneurship thru side projects w me",
            "I kinda ended up doing the same we even ended up getting some funding from the government so you never know what could happen",
            "Yes. Here is my recommendation:\n\nMake the most of it. You can try different tech stacks, and here'll be questions you'll be able to answer:\n\n* What's a time where you have disagreement with your colleague (you'll have some small-scale argument with your friend, and it's the best time to learn how to deal with it)\n* What's a time you led a team?\n\nGood luck with everything.",
            "Can I join?",
            "TAKE IT!!",
            "Hey! I’d say go for it because why not! Also, I’m a cs major freshmen and I’ve also completed 2 sems at Trent! Can you get me an internship too 🥹🥹",
            "Ya'll got any more of those \"internships\" left?",
            "but the company won't know the salary ryt?"
        ]
    },
    {
        "post_id": "ns7lfy",
        "author": "CrazyIntroduction587",
        "title": "Will I get a girlfriend if I get a full time offer at Amazon",
        "url": "https://www.reddit.com/r/csMajors/comments/ns7lfy/will_i_get_a_girlfriend_if_i_get_a_full_time/",
        "score": 800,
        "num_comments": 157,
        "created_utc": 1622819923.0,
        "selftext": "I'm Serious",
        "permalink": "/r/csMajors/comments/ns7lfy/will_i_get_a_girlfriend_if_i_get_a_full_time/",
        "comments": [
            "Bezos is your girlfriend now",
            "You'll actually be getting married. To Amazon.",
            "[deleted]",
            "Being in Amazon, you won't have time for a girlfriend.",
            "Nah, I'm pretty sure the girls know that Amazon employees are a dime for a dozen. Especially the cs major girls. U shoulda gone for Google, sorry bro.",
            "[deleted]",
            "Jeff Bezos will be your personal girlfriend. Kinda like when nuns marry Jesus when they join the nunship.",
            "Ok as a chick I’ll bite and assume you’re serious.  The only way suddenly having a job at any place should make it easier to get a girlfriend is that now you should have more free time to socialize and meet girls. If a girl is into you just because of her perceived status of your place of employment or the sweet paycheck that comes with it, she’s not worth it bro.",
            "Yes, and a dragon",
            "[deleted]",
            "Have no fear, girlfriends/boyfriends are issued as part of your welcome packet along with your laptop and coffee mug",
            "You mean Alexa?",
            "Do you really want a girlfriend who's only interested in you cuz you are in Amazon.",
            "would you still want a girlfriend after getting amazon?",
            "If you have to ask, then no.",
            "The girls hangout in the leetcode discussion section and try to fuck the guys on the leaderboard",
            "jeff couldn't keep a girl when he fucking own Amazon, and you're talking about getting one just by working for Amazon? \nYou need to stay in touch with reality which is : Yes your offer matters but the fact that you think that the only thing that a girl would see is your offer to date you. Well good luck with that girl👀",
            "Yes, they're assigned at orientation.",
            "No.",
            "Imagine having an Amazonian gf",
            "another question, will I get a boyfriend if I work there 🤔",
            "When you get your sign bonus take a girl on a first date to Nieman Marcus and tell her your TC.\n\nMight not be a good girlfriend, but you’ll get laid 😃",
            "Maybe. Probably. Maybe not.",
            "Only if you tell them you're a surgeon.",
            "I got a new grad job at Amazon and my girlfriend and I of 4 years broke up shortly afterwards because of the distance. Amazon hasn't sent me a new one yet.",
            "I know this is supposed to be funny but the misogynistic (and even transphobic) undertones in the comments are extremely concerning",
            "If you are making jokes like this, good luck getting your hands on any actual woman in the future. Because your jokes are definitely funny and you are hideous af.",
            "Yo, TC or GTFO!",
            "This post has so much potential.",
            "Idk about you, but my girlfriend left me after getting job at Amazon.",
            "[deleted]",
            "I have the exact same concerns. Please send help!",
            "I'm pretty sure RealDoll has just the girlfriend for you once you get your first RSU vesting!  Live the dream of silicone and latex valleys suitable for those with your attitudes.  You got this. 👍",
            "No, this is the exact opposite of a girlfriend.",
            "If that's your only appealing point, then the best you can get is a gold digger who will pretend to be your gf (till you leave your job). But the joke's on her because the new job is better in every way lol\n\nsource: personal experience",
            "Yes, your girlfriend will be shipped on priority if you're a prime member😂",
            "Elon Musk was asking interviewers a few years ago if they knew anyone he could date because he was so lonely... as the billionaire founder of SpaceX and Tesla. Hope that answers your question.",
            "*sorts by controversial*",
            "[deleted]",
            "Yeah, most people have heard of friend-with-benefits, not enough people take advantage of the employee-with-benefits plans. The recent girlfriend options at Amazon (I think they call it the Gal-azon program) aren’t as generous as they were 5-8 years ago before the company really took off, but the company girlfriend isn’t bad, fairly standard kit.\n\nMan, if you’re really serious, I encourage you to explore some ideas that may be uncomfortable for you about women's rights, this is pretty classic objectification of women.",
            "I did. You just tell them you work for Google.",
            "Due to a pandemic there is a shortage of company offered girls available but there is a surplus of boys!",
            "The paycheck might help mildly, but the lack of free time will hurt greatly",
            "This should deserve so much more upvotes",
            "Wait for the new model",
            "Alexa. Order me one gf pls",
            "no but u can order a fleshlight thru prime 😁",
            "Maybe your paycheck",
            "Why can shitposts like this stay up but my tangible advice about how to get a girlfriend got deleted?",
            "[deleted]",
            "[removed]",
            "nyes",
            "OP should search from Amazon renewed",
            "Let us know how the snu-snu goes",
            "Doubtful",
            "no",
            "Not only will you get a girlfriend, but all your dreams will come true. You will gain 3 inches height 10 inches on your vertical jump, profrssional cooking skills and be able to levitate between 3-5 seconds as long as you have enough chakra stored. \n\nThis is *it*. The pinnacle of human life. You have reached it and don't forget us mere plebians as you ascend.",
            "yea. work will be your girlfriend",
            "Just wait for Prime Day",
            "Are you asking if you will have time for a girlfriend if you get a full time offer at Amazon?\n\nOr are you asking if you will have money for a girlfriend if you get a full time offer at Amazon?\n\nOr are you asking if your full.time offer at Amazon will make you more attractive to girls who will want to be your girlfriend just because you work at amazon?",
            "Uh your relationship is basically with Amazon now",
            "No.",
            "No.",
            "you should negotiate that on your contract",
            "Jeff Bezos stepping down as CEO to become your girlfriend",
            "Nah",
            "You are r/cscareerjerk material! I've crossposted this over there -- feel free to join in and bask in your glory!",
            "Indubitably",
            "No, you’ll get a pip if you get a full time offer at Amazon.",
            "A prime girlfriend, cooking prime beef, during prime time.",
            "I don’t know. Maybe?",
            "Most likely not",
            "Yeah ofcourse, just make sure to choose the right size. They make a fuss about replacement once shipped.",
            "Prime Day is coming, hoping that you will get an offer.",
            "As a girl, what?",
            "Definitely. One will be assigned on your one-year anniversary.",
            "I mean, I already have one and start at Amazon next week. If you're looking to break into Amazon, start at a warehouse and take some certs in the 6 months it takes before you're allowed to transfer. Companies like Amazon and, to a lesser extent, Walmart offer a lot of upskilling opportunites and generally prefer in-company transfers to fresh hires regardless of GPA or any of that nonsense.",
            "Did you recieve your girlfriend yet?",
            "I honestly cant tell if this is serious or not. If it is: News flash to all cs guys -> you will not magically get a girlfriend if you get a high paying cs job. Further, most girls actually find it unattractive because A. these types tend to be arrogant solely because they have a high paying job B. Your job becomes your identity C. demographics are not in your favor D. Your job is boring to talk about. Who would a girl rather talk to: Guy A who talks about software engineering and every boring aspect associated with the job or Guy B, C, D- a personal trainer who meets interesting people all day; A fireman who literally saves lives; a bartender who meets a shit ton of people and is fun to be around. I have the answer for you: NOT GUY A",
            "Getting a girlfriend isn’t the key. Keeping one is. Good luck",
            "Yes it happened... 4 year vesting period though",
            "Only if bezos allows u to buy the inflatable ones off his site.... Serious answer 🤣...",
            "."
        ]
    },
    {
        "post_id": "1cd19ls",
        "author": "Affectionate-Owl-178",
        "title": "Tech Recruiter complains that all the software engineering candidates he/she interviews are horrible at coding",
        "url": "https://www.reddit.com/r/recruitinghell/comments/1ccyd7c/i_am_getting_tired_of_how_many_bad_candidates_im/",
        "score": 795,
        "num_comments": 170,
        "created_utc": 1714075726.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cd19ls/tech_recruiter_complains_that_all_the_software/",
        "comments": [
            "Sir, I never denied that I am absolutely terrible at coding. My claim is simply that I'll have your Starbucks order ready at your desk every morning.",
            "WI sent a resume to IBM the other day. They sent me a link to take a coding test within 14 days. A day later and I got an email saying I was rejected. I went to look at the test anyway to see the questions they had. I couldn’t have done them. They were two leet code like problems. One was a charting problem on how many vertices given n points and one was an airline thing. I goggled an algorithm in two minutes out of curiosity but you weren’t suppose to do that. I’m older and I’ve been doing this work for a while. I did some of those problems in class 20 years ago but I don’t have to do that as a regular thing in my job. I have to do crud operations and api calls. It was weird having that be what they expected.",
            "I really don’t want to sound like a scrub, but a lot of these INTERNSHIPS are asking such weird or advanced technical questions that they don’t seem to be conductive to entry level positions at all. I understand wanting competent coders and we’re in a buyer’s market right now, but it seems like such a catch-22 to needing experience to get the job, but the experience is learned on the job.",
            "Why are the gates to sought after fields maintained by the worst students in college?",
            "Offer peanuts, wonder why get only monkeys. Truely a mistery :D",
            "Wasn’t there a study that not even tech recruiters can pass the technical interviews questions?",
            "It’s ridiculous she thinks a 12.5% salary increase equating to €1000 on the job change to be excessive.",
            "Horrible? No. Horrible relative to the level of difficulty of these current market condition’s entry-level coding interviews? Yes.",
            "Last year, had a company want me to design a system architecture for processing several large CSV files, learn Go, and then implement said system using a 10GB CSV file, and having my code never use more than 1GB of memory.\n\nCan I do it? Sure. In a couple weeks though. Y’know, like a normal sprint or two, not 4 days. Oh, and I’m also going to ask you why you aren’t paying for proper ETL tools.\n\nI’m sure the market is wild, but this is a 2-way road.",
            "How would she know?",
            "That dude lost me at laughing at a masters grad in CS expecting a 2500 euro salary, GTFOH man.",
            "Honestly, I want to give my salty old-man-shouts-at-cloud opinion after recently graduating from a public university...\n\nSophomore year, I took Software Engineering; this class involves working with a group of 4-5 other classmates (in my case, 5 classmates, 2 sophomores 3 juniors) in working on a software development project over the course of the semester as well as producing documentation and presenting it at the end. It was a simple Android note-taking app that I would think any competent CS student should be able to Google their way through within a couple weeks. What I saw was an utter disaster of 4 of the teammates unable to understand damn near anything. Unable to Google their way through iterating through an ArrayList type of disaster.\n\nFast forward to senior year and I am working with a team of 4 other (senior) students for a capstone project, a two-semester software development project commissioned by clients the class instructor has sourced for us. The first semester was all documentation, planning, and presenting. It went wonderfully. All my group mates were competent, timely, and hard-working. Then the second-semester, the coding period, came around. Only 1 teammate was capable of producing Java code (a language all of us had taken *as a required core class*) that even compiled. The other three contributed almost nothing to the codebase and despite attempt-after-attempt to throw easy bones to get them to contribute, I had to cram morning-midnight for the last several days to get the project in a submittable condition. An utter disaster, *but only with the coding*! Oh, and two of these people had industry jobs lined up. Even back in early 2023, one group got smited after the professor discovered 4/5 students were ChatGPT-ing their way through the class.\n\nMy conclusion from this capstone, as well as graduating, is that my university does not deserve accreditation for CS, lol. But on a serious note, I would say **the** **majority** of the people in my CS graduating class were incapable of producing code above an intro/high school level. Rampant cheating, absolute no doubt, big credit to COVID-19; I was in a dual undergrad/grad class for graphics programming, and had to deal with waiting after class to ask the professor, the department head, questions in line after 1-5 international/graduate students in front of me bickered back and forth about being given a zero grade for copying and pasting entire projects from the Internet, seemingly every other class. It's downright disturbing.",
            "Not really surprising. I’m studying at a German uni and was working as a tutor for a programming module. This is a common first year module, so it is at least somewhat representative for the amount of new students. Basically the numbers went up from about 400 in 2017 to 1000 in 2023. We have weekly assignments and a lot of submissions were either straight up horrible or obviously ChatGPT. \nNaturally my perspective is pretty limited but it feels like only a small minority is really into coding.",
            "This post is from a bad recruiter.",
            "I just won employee of the month this month (first month it became a thing) and its because I code so fast, but i still fail 90% of these coding challenges. And my code is immaculate. I am obsessed with coding. Industry uses broken techniques.",
            "He sounds like a real cunt.",
            "Wouldn't be considered horrible at coding if they didn't give a guy that works with React, Figma, and AWS all day a branch traversal problem he's encountered only in class.  Even Amazon and Microsoft are doing this kind of stuff for Frontend only roles, so it's not even just a shitty europoor company doing it.",
            "We had a similar discussion as this recruiter has had even with one of the junior guys at my company. He had no real programming training, but worked his way from support/help desk to doing more dev tasks because he kept asking for it. We bumped up his salary slightly and started giving him tasks to do. He rarely completed anything without major help, which is totally fine.\n\nBut then he asked for a $30k raise because he \"did his research and that's what other web developers are making.\" We had to let him walk when he got another offer. He just wasn't worth it. In fact, he was kinda slowing us down to be honest. There were tasks that I could have knocked off in a day that he was taking days to figure out. Oh, and he was also that guy that spoke for 10 minutes during standup when the rest of us spoke for 1 or 2.\n\nI hope he's doing well at his new job but I can't imagine he's succeeding there unless they are very lax about everything.",
            "Hey it’s me, I’m horrible at coding",
            "I took a leetcode test for an internship interview a few months ago for Starbucks. One of the problems wanted me to return a string array in Java, but the method header (which I *could not change* as it is set by LC itself) wanted a stack instead??? So even when I implemented the actual contents it wanted and returned them as a stack, I was \"wrong\" because it wasn't a string array. Like are you kidding me?\n\nIn all honesty, I've applied for over 200 internships from September this year til this month, been rejected or ghosted by almost all companies. I tracked my stats, I got 7 interviews and eventually one offer. I've been programming for 10 years and have a very broad range of skills at this point, and will have my Bachelor's come Fall this year. The market is horrendous right now and especially for internships and entry level. They want people with industry job experience even for the \"starter\" positions and toss you to the curb if you don't have it. Nobody really bothers to look at your skills or projects, just your job history. It's insane and very very frustrating.",
            "Must be DEI is not enforced enough!",
            "Me: Software engineer, 8yrs of experience, knows about 30 languages, has worked in huge enterprise corporations with huge code bases and teams, had direct contact with clients and has tons of proven experience.\n\nRecruiter: You failed a quirky 30min code test with a 75%, you're horrible at coding!",
            "His do you program without stack overflow at your side? Seems impossible",
            "Even people who have degrees?",
            "Even people who have degrees?",
            "That's a bullshit post full of lies because tech recruiters don't conduct technical / coding interviews. They conduct phone screens where, if you don't state the proper sequence of buzzwords, they state \"we should hold off on this for now\".",
            "I had no problems passing onsite coding interviews on whiteboard, doing it online made it way harder \n\nAlso I had impression that most interviewers just focus on finding out if interviewee cheating - which was not applicable in on-sites \n\nTldr: online interviews were created to cut costs, in reality it's waste of interviewers time and much more likely to hire cheaters, but don't worry - there are layoffs, right?",
            "Not all faang interview are leetcode lol",
            "Just for reference from a current senior college student who is now a TA for my schools data structures class. Chat gpt first came out a semester after I took data structures. Everyone uses it. I use it for my classes, but my current classes are fairly advanced and I’m only using it for busy work. However, the kids in data structures are using it passing with 100s on average whereas the averages when I took it were like 70-80s and the class was getting curved 8-10 points. These kids aren’t actually learning how to code at all. It’s a particularly serious issue in CS.",
            " The market is flooded with them because they are the ones that got laid off.",
            "I’m going to get flamed for this, but…. It’s fucking true. I don’t know how many interviews I’ve done with CS graduates who can’t even reverse a linked list. Before I moved to Google I couldn’t stand doing interviews. At least now the quality of candidate is higher because everyone knows Google’s standards. Making calls to other libs is not computer science and that’s what a lot of people are really good at; but guess who else is good at that? AI. I can understand why a lot of people are worried. But if you learn the fundamentals of CS and continue to build from there, it doesn’t matter what AI comes out, you’ll be employable.",
            "Most people are shit coders. It's why leetcode is so valuable for interviews. Imagine literally being unable to reverse a binary tree?"
        ]
    },
    {
        "post_id": "1bea952",
        "author": "barafe",
        "title": "Anyone ever felt like this?",
        "url": "https://i.redd.it/f83lhwxum7oc1.png",
        "score": 795,
        "num_comments": 20,
        "created_utc": 1710383044.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bea952/anyone_ever_felt_like_this/",
        "comments": [
            "All the fucking time. Sometimes I even struggle with the start of the loop itself because I'm wondering if I should start from end to beginning and yada yada. I never not have a paper and pen with me because I can't do mental for loops. I need to write it out by hand and I still fumble it",
            "Oh this? Never happens to me, except when I’m in the technical interview live coding :D",
            "all the time\n\nsomething that works for me to get past it if i'm really stuck is start just typing a half baked solution i know isn't going to work, like really inefficient and dumb. eventually i start to see how i can make it actually workable",
            "🤣",
            "brain freeze",
            "😂😂I didn't know this was relatable",
            "I don’t get it",
            "Real",
            "Soooo much yeaaaa.....also I have always feel like I am expressing my ideas  through a medium whether it's code or written language. I can draw so many parallels between them. And yea , many times I keep looking at the blank cursor.....",
            "This is a quality post. I actually laughed out loud bc it’s so true. Nice work",
            "fun fact; its faster to compare against 0. so starting at 10 and going to 0 with != would be quicker. i believe most modern compilers will do this for you though, but you'd have to check your asm output"
        ]
    }
]