[
    {
        "post_id": "1bxn7j4",
        "author": "sweatyasianpig",
        "title": "Thought this was funny",
        "url": "https://v.redd.it/4murnwgdjxsc1",
        "score": 800,
        "num_comments": 37,
        "created_utc": 1712440038.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bxn7j4/thought_this_was_funny/",
        "comments": [
            "I must have a hella good work ethic, because I go to 95 percent of the lectures\n\nThat or I’m a socially inept loser, or both",
            "“Wonder if CS is for me” hit a little too close to home ahahahahaha",
            "Why did I just spend two minutes watching this",
            "Witerally me owo",
            "aphex fucks",
            "I really wish I had studied CS in uni. This sounds like so much fun. I wosh I knew what I was passionate about when I was 17",
            "true except that I never go to office hour or meet up with TA.",
            "I had a teacher who had a very thick Chinese accent. She was nice but it was so hard for me to understand her like I was actually going crazy.",
            "Funny to a millennial",
            "Where is the working an 8 hour shift to be able to afford food in this schedule ?",
            "true except that I just use chat gippity after a while to fix it.",
            "Where is coding at 3 am?",
            "Damnnn sooo apt !!",
            "So everyone has a existential crisis every assignment, not just me!",
            "Not relatable",
            "Now take all that and put it in person.",
            "u/savevideo",
            "u/SaveVideo",
            "Due yesterday",
            "Wait, you had an OPTION to ask teachers about your code? We literally got zero help and it was normal. I'm torn between feeling like teacher help makes stuff easy and betrayed that I didn't have it (esp. For assembly)",
            "Y’all sleep in till Noon?"
        ]
    },
    {
        "post_id": "1cg1nre",
        "author": "Giantkoala327",
        "title": "Please break into smaller companies",
        "url": "https://www.reddit.com/r/csMajors/comments/1cg1nre/please_break_into_smaller_companies/",
        "score": 800,
        "num_comments": 92,
        "created_utc": 1714403747.0,
        "selftext": "So I am not a CS major but instead a business analytics major. That means am bad at math AND coding. Recently, I got a job after college at a white collar job with 100-150 employees where I am a department of 1. Because I seem to be the person who happens to be the most tech savvy (read: can google well), I am now becoming a full stack dev by happenstance. I am making online tools for clients, making webscaper, refacotring code, automating workflows, and potentially doing database design.\n\nHelp, I don't wanna do this shit. I'm supposed to just make graphs and be good at excel. Please find your way to these small companies that dont have an internal development team where salesforce and excel are their only data sources.",
        "permalink": "/r/csMajors/comments/1cg1nre/please_break_into_smaller_companies/",
        "comments": [
            "I literally have tried to get in contact with small companies and they just ghost me!! IDK WHAT TO DO AT THIS POINT IM GOIN CRAZY!!!",
            "this is why wages go down",
            "did you apply on a job board like linkedin?",
            "Small companies don’t want to hire us, they want to hire you to do your job and ours",
            "How’s the pay?",
            "[deleted]",
            "I did Ms business analytics and now 90% of my job is CS. Should have just done CS but I didn't know what I wanted to do with my life.",
            "A lot of small non-tech companies don’t understand CS roles enough to even realize whether they could help them or not. A lot end up relying on contracting for these sort of things, in some cases exceeding what they would pay for hiring one or multiple full time internal positions simply because they don’t know what they need.",
            "lol they hiring?",
            "What you’re describing isn’t a full-stack developer, but good for you!",
            "interesting that your business analytics course is on excel. Ours is under our school of Computing, which teaches 85-90% of what cs majors learn. given, I'm not from the US",
            "I worked for this exact type of company. I could write a whole page about my time there, so I’ll stick to the main points. \n- It’s a window manufacturer that also does installation on a retail level. \n- They employ 100-150 people, most of which are manufacturing employees. \n- After working as an installer for many years I became the installation manager. \n\nGiven that, I know the inner workings of this smaller company and have rare insight into the executive process since my only boss was the president of the company. \nHis goal was always to pay as little as possible, and blend roles. No one at a position of authority had a job description, including me. Sometimes that’s good, sometimes it’s very frustrating because we did have titles. For instance as installation manager, one would think that my primary responsibility is the installation dept, and it was, except I also had to help ensure that the product was built in time for me honor my schedule with customers. I found myself having to more or less become a plant manager as well. It was always a huge stressor calling people to remind them of their install knowing their product wasn’t even ready and likely wouldn’t be until the day before, the morning of, or many times as the installation is actively going on. \nI only go into this much detail, because at a certain point they decided they better update their software systems and anyone with a CS degree that applied was scoffed at due to the amount of money they wanted. He ended up hiring a 20 year old kid with an associates in CIS to modernize their systems and paid him  $18 an hour to do it.\nThat’s small business for you though. It’s how many hats can you wear for the lowest price. \nAfter 3 years of banging my head against the wall I quit and went back to contracting. I make way more money, although the physical work is much harder. Also, I ruptured my biceps tendon shortly after making the switch. I set my schedule  so I enrolled in college after recovering and started in CS. I switched to Cybersecurity because I enjoy the hacking aspect of it more, and my goal is to become a pen tester. \nAnyway, it ended up being a whole page, but I’ve got good insight into this situation from a position of authority.",
            "They're rejecting us because you're doing this stuff for them. Why would they hire someone with a CS degree when they can just make OP do it? This is why we need unions.",
            "Can I Dm you? I've been applying to a lot of these smaller companies, but I haven't gotten much success.",
            "Now were you assigned that work?\n\nI wouldn't have mentioned that you made all these cost saving tools if you weren't assigned those tasks. Now they know and they'll never let you not do two roles at once for more than half the cost. \n\nI had an HR person leave partly because he was taking on IT tasks because he thought it would have helped. Hated it after a while and left because the company never listened to his requests.",
            "Business analytics is by definition math homie. Literally just doing statistics on businesses like what are you talking about 😂😂😂",
            "No",
            "Tell them your effort on what they wanted you to do I would say. \n\nEach of the Tasks they give you is your effort in a set amount of time, a week is 40 hours work, Task \"X\" takes 70% effort(refactoring for example) so I only have 30% left to try and do the data analytics work. \n\nHaving the skills to do certain tasks doesn't mean you always NEED to do it.",
            "Tell them to pay better?!",
            "As soon as those small companies start giving me offers that aren't pathetic I'll get right on that lol.",
            "The problem isn't that nobody wants jobs like that. It's that many companies don't want to hire an actual developer to do them.",
            "small companies are also very stringent about hiring. plus i've been ghosted a lot more by them",
            "No SWE is gonna accept running the entire department for 50k. They playing you lol",
            "This is an excellent way to not develop as a SWE lol",
            "you are doing weird tasks so your exit opportunities will not be good because no one can figure out the value that you bring other than a little bit of this and a little bit of that. better move on to a better place. you are being used since you are doing two roles but hired for one. you may think you are progressing but you are actually becoming more stuck at your place. ive been in a similar situation for a different type of role",
            ">I am now becoming a full stack dev by happenstance.\n\nwho says happenstance"
        ]
    },
    {
        "post_id": "1958q82",
        "author": "RazDoStuff",
        "title": "Me fr",
        "url": "https://i.redd.it/nt51skuhc3cc1.jpeg",
        "score": 792,
        "num_comments": 25,
        "created_utc": 1705100931.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1958q82/me_fr/",
        "comments": [
            "This sub completely ruined my mental health for a while but it was also partly my fault tbh.\n\nEither way I learned everything I needed to get internships and a full time offer. This sub has been instrumental in my success as a cs major.",
            "I agree! As a new Reddit user, I've noticed a contrast between the content on FB/IG and Reddit. On platforms like FB/IG, users often share positive news. In contrast, Reddit seems to lean towards the sharing of more negative or gloomy news, representing a different extreme on the content spectrum.   \n\n\nNote: generated by chatgpt.",
            "I can agree but tbh I regret not joining sooner lol. Didn't know how important internships were and could really have used the anxiety to give me that sense of urgency to get off my ass and just apply.",
            "Your post is now the beacon of light that has inspired me to leave this sub. It shattered me two days ago. I picked myself back up but I’m not waiting to be shattered again. Yall can have fun and I wish you the best of luck",
            "Survivorship bias. All the CS majors who got jobs stop posting here, while the ones who can't get job whine endlessly about the job market. It's like the r/antiwork of programming subreddits.",
            "Yeah I’m taking this as my sign to leave this sub. I’m happy and have a 2024 Summer Internship and the gloomposting here is crazy. The anxiety and negativity this place fosters is not worth it, and I recommend leaving unless you want people telling you things like your offer might be rescinded if you do manage to get one. I wish you all well with your search though.",
            "yeah I know this subs tend to discuss more negative news (saturated job market, FAANG related), but from that perspectives, I also know there are people who tend to have high ambition and people who are leaning average. It also helps to inspire other people btw (for me)",
            "True AF !!!",
            "It feels like either a doomer wasteland or a place to show off your job offer. Occasionally you get a good meme or advice post…but it’s almost not worth all the doom posts.",
            "lol so true this sub can be pretty demotivating at times but i try to ignore the bad things and focus on the good advice/resources that are shared on here",
            "Fr, this sub is only focusing on making 💰 through internships and big tech. Nobody even talks about CS. At this point, this major feels more like finance than something a Geek would wanna do. There are people who showers and dont learn CS fundamentals but leetcode and collect AWS certificates. Tech bros are insanely intolerable with their salary flex and superior complex. Also, so many 20-22 year old tryna make bag through social media on “how to break into tech” and preaching as if they know the ways of life like I don’t wanna hear’ “3 mistakes in life” from some frat boy who became a software engineer in Bay Area",
            "Ty! That’s it, this is my sign, I am leaving this sub for good."
        ]
    },
    {
        "post_id": "1c144v7",
        "author": "sagark123",
        "title": "Just when I thought june cycle was about to get better",
        "url": "https://i.redd.it/62huu18njrtc1.png",
        "score": 792,
        "num_comments": 60,
        "created_utc": 1712803323.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c144v7/just_when_i_thought_june_cycle_was_about_to_get/",
        "comments": [
            "Why are you worried about bots that scrape linkedin?",
            "Those are web scrapers really. Shouldn’t worry too much about it.",
            "well sharing the position here certainly won't help",
            "Applied - thanks!",
            "A lot of bots that will press apply to everything and or create redirection links from their own platforms.",
            "Easy apply also counts if someone just opens the link and closes it immediately",
            "Its automated",
            "LinkedIn counts anyone who has no viewed the listing as “applied.” It’s very misleading.",
            "I remember times where there was like 5-10 applicants.... the people were more humble back then",
            "[deleted]",
            "Yeah don't worry bro, \"99% are uNqAlIfIeD\" because there can't be anyone else from this sub applying obviously",
            "web scrapers",
            "Pretty sure these are full of bots which scrape LinkedIn and apply to every posting they see.",
            "I honestly wish everyone here would create a fake job once and post it on LinkedIn so you can see the volume of garbage we receive on job postings. For some reason many of you think we are lying when we tell you the vast majority of those applications are junk.",
            "We are real daring with the posts today aren’t we.",
            "[deleted]"
        ]
    },
    {
        "post_id": "1bei7c5",
        "author": "Valuevow",
        "title": "They are looking for a wizard developer",
        "url": "https://i.redd.it/2ep86n7z2aoc1.jpeg",
        "score": 796,
        "num_comments": 103,
        "created_utc": 1710412681.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bei7c5/they_are_looking_for_a_wizard_developer/",
        "comments": [
            "There's 9 bullet points so I'll expect the base pay is at least $35k.",
            "Whoever they are looking for, they dont pay enough for him\\\\her. Looks like some shitty metaverse crypto project.",
            "“Strong start-up culture” means long hours, low pay and dealing with a CEO who thinks they are the next Steve Jobs",
            "dress code listed as a perk? dude..",
            "Be ready for whatever when we figure out a business model.",
            "sounds like a job for Devin the dude",
            "What's the approximate base pay? Is it listed?",
            "\"Attractive pay\"\n\nThen mention it. Nut up or shut up.",
            "they are looking for a team , if you have 2 skills like react related and aws just go ahead and apply ...",
            "Penguins are actually secretly undercover spies for the Illuminati.",
            "Apply anyway. Worst that can happen is you get an email with the word \"unfortunately\" in it.",
            "Exposure to a range of technologies which MAY INCLUDE. Yes may means optional - they gave a list of relevant skills as reference for what they want for the job. They are not saying you need experience with all",
            "Tell me your boss is a narcissistic psychopath without telling me",
            "How many CI/CD tools do you need? Yes.",
            "All that for a staggering 60k💀",
            "Informal dress code. Get fucked. Like this job should tell anyone what to wear.",
            "probably pay is 700k+",
            "They should pay a shitload for this stack",
            "they better pay 600k+ a year to this guy.",
            "Blockchain, metaverse, and Swagger  \nits morbin time",
            "HR wrote this. Not a hiring manager. Apply anyway. Or not.",
            "Sometimes they don’t even need all these by the time they employ someone",
            "HR have the tech stack and just listed it all. But honestly any competent full stack can handle react, firebase, databases, ci, aws, swagger. Those are just the components used to build a modern app. The blockchain, metacrap part is the only exception, and I guess you only deal with that if you’re in the blockchain team. This is isn’t that far off a normal developers tech stack.",
            "that ownership scheme could be a ponzi one. Hopefully the developer can get on the ground floor of this one story building",
            "40k a year! Competitive compensation!",
            "It says \"may include\", not \"all of the following\". And yes, I wrote the job posting, AMA!",
            "Oof, get over it, it clearly says “which MAY include”, not that they require it. They’re just describing their tech stack.\n\nWith the industry the way it is right now, people don’t need this kind of hyperbole on top of the real challenges.  Misery loves company though I guess…",
            "They gonna need thanos WITH all the infinity stones with these requirements 😭😭😭",
            "just a quick look on job description makes it clear this is a bad workplace with toxic culture",
            "Look at the wording. They want candidates who have had some experience or exposure in this case with the technologies mentioned but not all of them. They don’t have to be exactly those but similar. You could be good with a couple, mid in some, and have no experience in any but you’ll be fine if you have experience with some of them or with similar technologies.",
            "Is this an entry level position?",
            "Crypto game that pays out ethereum somehow maybe ?  Devin, what are they building ?",
            "Yeah... just like everybody and their dog who's asking for \"3+\" years of experience minimum in x, y, z, etc etc for an \"entry level\" job. If I had known it would be this hard to find work I would've done something else instead of wasting my time and money on this degree and career path. \n\nMy brother in law is an accountant and gets paid stupidly well (he deserves it, I'm not saying he doesn't), and has a seemingly infinite amount of job security. People talk about AI replacing jobs... Well honestly before I knew what it was like, in my mind, a software developer sounds like a more secure job than an accountant, but in reality this isn't true. \n\nSomehow, for the dev job market, it's the industry standard to hire a bunch and then fire or lay off what you end up not needing, whereas that's not at all how they treat accountants. \n\nAccountants are super super busy at certain times of the year, but in the off season it's normal and expected to take vacation, etc... Not layoff all your accountants. \n\nIt's the employers that are doing this and getting away with it and seemingly have been for years. Obviously that doesn't include 100% of all cases, but it's enough of a percentage to be the rule, but the exception.",
            "Keyphrase: \"May include\"",
            "They said \\_may\\_ include, not must...",
            "Nah that’s like 10 ppl jobs lol. Majority of post are like this for less money.",
            "I expect 2.5m per year since this full team stack right",
            "Might as well build your own start up at that point, since this unicorn will be more valuable then the others",
            "The only candidate that would qualify is Devin /s",
            "Must have active Top Secret Clearance",
            "Well, the company offer far less than employee they are looking for.",
            "MAY include",
            "That's me. I've been exposed to all these technologies when I was 3.",
            "Ci/cd listed twice. Haha",
            "Oh that's nice requirements for job with salary 300$ per month.",
            "\"may include\"",
            "i saw a job listing that required every single technology or language I had ever heard of",
            "they can have Devin for this one",
            "This is kind of typical... and it does say \"may include\" meaning you should have skills in some of these areas but not all.",
            "Maybe Devin wasn't bad afterall",
            "“Exposure to a range of technologies, which may include:\n\n- All”",
            "They're looking for a generalist to help design a platform, you're expected to have \"Exposure\" to these technologies, not be proficient in all of them.  This is a job application where you apply if you have 20% of the technologies mentioned, rather than the usual 70%.  Also you will need to help make intelligent decisions about building on the right tech.  This is a relatively high risk job in that sense.",
            "They said:\n- blockchain\n- metaverse (??)\n- databases\n- cloud\n\nOh they said it’s a start up, I bet it pays like 60k",
            "It's a \"web3 startup\" job, pretty rare to see these days, but this honestly isn't as crazy as you think.\n\nIt's mostly just plugging together a bunch APIs, libraries, and 3rd party services. You don't need to know anything super deep / advanced or worry about scaling.\n\nPay will absolutely be trash though. It'll be mostly stake in the company.",
            "Looks like a normal req for a lightly experienced web3 generalist with frontend leaning. All these things are community standards and developer darlings. You don’t have to have 100 maxed out knowledge in all — just a general understanding and workability. If someone throws mongo or firebase at you, you should be able to deal with it. \n\nWhat do y’all expect? “Know what a computer is. A degree. Salary is 400k”\n\nThis sub needs a reality check.",
            "This looks reasonable for a mid-level web3 focused dev.",
            "I got all that except metaverse and blockchain, tho I could pick it up, wanna hire me? Tho web3 is on my list after IoT",
            "Depends on how much experience they are looking for, a developer of 10 years can have this and more."
        ]
    },
    {
        "post_id": "14lhqe7",
        "author": "grantj23",
        "title": "Finally feel like a real software developer!",
        "url": "https://www.reddit.com/r/csMajors/comments/14lhqe7/finally_feel_like_a_real_software_developer/",
        "score": 792,
        "num_comments": 58,
        "created_utc": 1687978328.0,
        "selftext": "I have been a software developer professionally now for just over two years and today I finally feel like I have made it. This was the first day I worked from a coffee shop and drank a pistachio latte while writing some very mediocre JavaScript. Trying not to let this go to my head but might ask for a raise tomorrow…",
        "permalink": "/r/csMajors/comments/14lhqe7/finally_feel_like_a_real_software_developer/",
        "comments": [
            "Hello world!",
            "Next task: work from a tropical island",
            "My favorite thing is that I'm finally at the point in my job where the code I've written is code no one else understands or wants to touch but it works well enough that everyone uses it :) Self assured job security.",
            "If you don’t have an abusive hate-hate relationship with JavaScript you’re not there yet😂",
            "Dang, I wish I were writing JavaScript. Congrats man",
            "Im on my bed “working” right now.",
            "This is rlly wholesome and I can’t wait until this is me. wgmi",
            "u are my inspiration 🫡",
            "Finally, now go ace the interview for Amazon!",
            "Congratulations! I hope to be where you are some day",
            "Oof. Pistachio latte. Let me guess blue bottle coffee? If so where do you get such a drink??",
            "I remember when I first self studied javascript, it took me a month to understand if else blocks and nesting if blocks. Now I write projects that are doing multi-million in rev. Software is crazy, and yes, we don't get paid enough, ever.",
            "Next step: write code with chatgpt and sip your coffee while it writes for you",
            "I had this kinda of day today too!!! Coming up on two years next month :,) 🙌",
            "Pshhh just wait until you experience the feeling of writing TypeScript while sipping a cortado \n/s.",
            "What was your journey, trying to land a software dev role post uni but here I am almost a year after graduating no closer to a position",
            "Don’t go to bootcamp, go to coffee shop .Got it",
            "🙄🙄",
            "I thought pistachio lattes were seasonal!",
            "You get paid to write mediocre JS? Living the dream, where can I apply? My Js may be some BS but I got enough snippets to piece together mediocre.",
            "Biggest chill.",
            "You are not a developer until you spend hours arguing about your codes with another developer.",
            "Next step, get laid off and struggle to find anything for months.",
            "Congrats Man! You did it"
        ]
    },
    {
        "post_id": "xznu8q",
        "author": "jrjrjffjdd",
        "title": "I want A JOB. All I want is A JOB.",
        "url": "https://www.reddit.com/r/csMajors/comments/xznu8q/i_want_a_job_all_i_want_is_a_job/",
        "score": 787,
        "num_comments": 108,
        "created_utc": 1665327914.0,
        "selftext": "I don’t get the way you guys think. I want A JOB. Anything right out of college. More than $0 a year entry level. I’m in this for A JOB. I don’t care about whether I’m “fulfilled” I want A JOB. Whatever gets me the most JOBS. What do I need on my resume to get the most INTERVIEWS. What technology gets me NOTICED BY HRS. All I care about in this major is A JOB. That’s why I’m in college, I don’t wanna laugh and play with y’all. I don’t wanna be buddy buddy with y’all. I’m here for A JOB.",
        "permalink": "/r/csMajors/comments/xznu8q/i_want_a_job_all_i_want_is_a_job/",
        "comments": [
            "y’all I think they want a job",
            "> `More than $0 a year entry level`\n\nI'll hire you for $1",
            "give job",
            "https://www.reddit.com/r/csMajors/comments/ssoece/i_want_money_all_i_want_is_money/\n\nreplace all \"MONEY\" for \"JOB\"",
            "For $0 job you could go work at Mc Donalds, they pay much more than that",
            "No. You want a job with a FAANG company. You want to code AI ML Deep Learning polymorphic quantum parallelized APIs. You want to ace the OA, then get flown to Silicon Valley on a private jet once owned by Jim Clark. You want to get wined, dined and pocket-lined by venture capitalists in $500 Levis and flip flops. You want an office with a built-in Golden Retriever that can make mocha lattes.\n\nYes, you want all that and more. So much more. Cuz you are a CS Major.",
            "I want BITCHES. All I want are BITCHES.",
            ">I don’t wanna laugh and play with y’all. I don’t wanna be buddy buddy with y’all. I’m here for A JOB.\n\nAnd here I thought we could've been friends getting a job together..",
            "I'll pay you 10% of my salary to do 100% of my job, send your resume if that works for you!",
            "Wendy's is hiring",
            "Wait let me guess…you want a job?",
            "Email companies exactly like you just posted here. Caps, quotations, and the whole nine yards.",
            "Damn this was me not too long ago. I had to take a bullshit Technical Services job out of college because no one would hire me as a SWE. \n\nHang in there bud.",
            "var OP = “New Grad Job”",
            "McDonalds grill masters are always hiring",
            "Get a Job then it’ll be easy to get a job",
            "Man this rly BLOWs. I just want a JOB as well 😔😔",
            "If you wanted to work at a massage parlor, do you care for if you do a HAND JOB ?",
            "It’s not an either/or you know",
            "gib job plz",
            "Try retail. Works for me.",
            "just get a job",
            "Bro same. People out here trynna get faang. And all I want is a job, that pays decent and I enjoy.",
            "Maybe all you need to do is get closer to God and receive guidance in your life. I’m not a smart computer guy but I have 3 internships for 2023. Two of them are at Amazon and the other at Google for software engineer positions. What’s the difference between you and me?",
            " Maybe try git pull a job",
            "You don’t need to go to college to have A JOB. You can also do a thing where you have A JOB while in college. It’s crazy I know.",
            "I can hook you up for some BLOW JOBS.",
            "what's a job",
            "dumbest attitude ever.",
            "Apply for IT jobs",
            "Blow Job?",
            "If (want() === job) {\n    want().job();\n    getJob();\n}",
            "Low GPA no internship mf’s be like",
            "Bot give job",
            "Maybe they just don’t like you when you interview",
            "You can do my job for $1",
            "Guys i think they want a job",
            "Just go stand on the street corner if all u want is money, u can make more hourly than faang",
            "JAY OH BEE",
            "This person wasn’t meant to be a CS major. Too many people major in CS thinking it would be a easy meal ticket.",
            "Retail jobs are hiring for seasonal now.",
            "[removed]",
            "Being buddy buddy with people can actually get you a JOB",
            "More than $0 ? I’ll give you 5$ i need a personalized cheese cleaner on my baby cows Pussy",
            "Apply for internships while you are in college.",
            "Give jib",
            "They took yer jerb!",
            "Porn is a job. You got the goods baby?",
            "OP is not asking. He is ordering us to answer his questions",
            "Just out of curiosity: are you looking for a job by any chance?",
            "I heard Tata Consultancy Services will hire anyone with a pulse",
            "Where did the original version of this go?"
        ]
    },
    {
        "post_id": "1bh9sgx",
        "author": "maybenot56",
        "title": "Accepted a FAANG SWE offer, here's my flowchart",
        "url": "https://i.redd.it/kt9p5hvotyoc1.png",
        "score": 791,
        "num_comments": 84,
        "created_utc": 1710712319.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bh9sgx/accepted_a_faang_swe_offer_heres_my_flowchart/",
        "comments": [
            "Pointing out the obvious, but only 2 out of 173 cold applications made it to interviews… Geez",
            "[removed]",
            "How and why were you invited to apply?",
            "Congrats! Any tips for a rising junior? I’m struggling with landing an internship this summer and realize it’s okay if I do not get one. There’s lots of things I need to learn in my own.",
            "Internship?",
            "woah this is cool, does invited to apply mean a general referral? or like a recruiter contact or something?",
            "Ehich FAANG",
            "school?",
            "Am I the only one who has never heard of being “waitlisted” for a JOB…?",
            "Looks like a really nice green pair of pants!",
            "Pretty sure it's spelled \"Feng Shui\".",
            "I know some delusional people who just cause they at a state flagship they will get free offers…bro can’t even code. Anyway congrats!",
            "How do people build these graphs?",
            "Can i please dm ?",
            "What's ghosted?",
            "Didn’t get rejected once after six interview? How is that possible",
            "How do you create this flow chart",
            "Hey what application is this?",
            "Ctrl+F fluffer.",
            "What’s you degree and university?",
            "I hate this place",
            "What was the interview test like? I might apply for Google or Microsoft…",
            "And here I am 800+ applications and counting 💀",
            "Congratulations.",
            "New to the subreddit, wondering how you generate those charts, is it like some software which helps you keep track of all your applications?",
            "Post resume",
            "lucky guy",
            "Stop flexing without showing us the resume ffs",
            "[deleted]"
        ]
    },
    {
        "post_id": "19c8vm8",
        "author": "goldandkarma",
        "title": "Got a FAANG offer after 700+ applications!",
        "url": "https://www.reddit.com/r/csMajors/comments/19c8vm8/got_a_faang_offer_after_700_applications/",
        "score": 790,
        "num_comments": 125,
        "created_utc": 1705858929.0,
        "selftext": "Some thoughts and reflections\n\n- you only have to get lucky once - keep applying. The more darts you throw at the board, the more likely you are to hit a bullseye. Cast a broad net, you never know which random opportunities might work out. I ended up getting my offer in a country I’ve never been to.\n\n- Separate the process from your self-worth and eradicate imposter syndrome. Not having an offer yet doesn’t make you underqualified or worse than those who do. Continue enjoying life in the meantime and don’t fall into the trap of grinding and being stressed until you get an offer - don’t fall into the trap of engaging in the vicious cycle of permanently treating your current life as a transition period while you wait for some big change or achievement to all of a sudden make things better. You’ll stay stuck in that rat race mindset and perpetually forget to live in the moment.\n\n- spend hours on your resume. Read tips, check sample resumes, use a good template. This one-page document is the main way you sell yourself. You get far better return on investment when working on improving it vs. doing just about anything else. Make sure an external reader can get a good grasp of what you did through the bullet points and what you achieved by doing these things, without getting bogged down in details. Doesn’t matter how good you are at interviewing if you’re not passing resume screens. Sell yourself, embellish your projects and experience within reason, and don’t feel bad about doing it. Everyone else is, and you’re just operating at a disadvantage if you don’t. Recruiting is an exercise in marketing and you’re the product. Don’t worry about feeling like you bullshitted your way into a job that you’re under-qualified for - most people feel that way and you likely underestimate your ability to quickly pick up relevant skills on the job. \n\n- practice leetcode. You don’t need to be a god, but just get better than you were before. If your university has a programming challenge or competitive programming course, take it. You’d be surprised at how far you can get just with a firm handling of arrays, hash sets and a decent recognition of patterns from previously solved problems. Try to get to a point where you can solve most easiest in under 5-10 minutes and can tackle most mediums in <30 min. This is especially important for OAs.\n\n- Talk during your technical interviews. Don’t ever sit there trying to figure something out without constantly communicating your active thought process. Interviews are professional yap sessions - painting yourself as a personable communicator gives you a massive leg up even against more technically inclined competitors. When your interviewer gives you direction or hints at an approach, they’re not failing you - work with them and interface with the ideas they’re giving you. By doing so, you show an ability to handle and act on feedback and demonstrate the abilities that are most relevant to the job as an intern or junior engineer.\n\n- I cannot understate this one enough. If you’re in your senior/last year, are struggling to find junior full time roles, and are lucky enough to be in a position where an extra semester is affordable, APPLY TO INTERNSHIPS AS WELL. Make a second resume with a grad date that’s a semester later. Bars are lower for internships, and while a lot of companies cut down on new grad hiring during downturns, internship programs remain their primary way of assessing and recruiting junior engineers. You’ll get to come out of university more qualified, with an extra internship under your belt. Besides, you have your whole life to work full time - don’t be in more of a rush to get started than you need to be. An extra bonus is that you’ll in all likelihood get to then eventually search for new grad gigs in an improved market down the line. This also ties back to my first point - by widening your scope to both internships and full time jobs, you pretty much double your odds of successfully landing an offer. Maximize your odds of getting lucky.  As you increase sample size, getting an offer goes from plausible to probable.",
        "permalink": "/r/csMajors/comments/19c8vm8/got_a_faang_offer_after_700_applications/",
        "comments": [
            "congratz on amazon",
            "What doesn't make sense to me is Amazon pays, they have the prestige 1-2 steps below the very top.  (prestige isn't for flexing online, it matters for if you get an interview for the *next* job)\n\nAnd yet somehow the other 699 companies thought the OP wasn't meeting their bar?This seems to happen *all the time*.  Sometimes a Google offer, and yet every other company including a bunch of janky startups said no.\n\nWhat bothers me is it means the actual hiring evaluation and matching system is badly broken.\n\nIt would be like someone getting into MIT and then having a bunch of rejects from state schools and community colleges.  Because everyone used a non standardized test written up by the interviewer, and/or filtered resumes via throwing darts, so the local community college was a reject...",
            "Congratulations!!! May I ask which company you got into?",
            "Is it meta new grad?",
            "do you mind sharing your resume?",
            "Can you show us what your resume looked like?",
            "Out of all of the applications, how many of them did you apply directly through the portal and how many through referrals?\nWas this FAANG application through referral?",
            "Looks like you’ve cracked the code at a young age. The people struggling probably won’t listen, but you’ll do well for yourself. Keep practicing interviewing always. Keep the resume up to date. Don’t grow comfortable and use your first 3 years to maximize learning then start job hopping.",
            "Congratulations 🎉",
            "Best of Luck … Just don’t be part of downsizing…",
            "congrats broski",
            "congrats is all I will offer to you. Wish you a successful career!",
            "https://preview.redd.it/7ga794nnrzdc1.jpeg?width=828&format=pjpg&auto=webp&s=0ceaff8d89e68f11a9a3ca634d569e49199f3b9d\n\nWe're so back",
            "Bro I’m going to dc office for Amazon, wbu?",
            "It's sad how much focus there is on resumes honestly. Just because someone has a good resume doesn't mean that they're a good employee, and just because someone has a bad resume doesn't mean that they're a bad employee. Resumes are more about presenting yourself than your actual skills.",
            "Amazon is so random.",
            "Do you mind if I see your resume?",
            "Holy text\nBut yeah congrats\nSeems like SWE internships are on the rise this new year which gets me motivated to get into college next year",
            "Competitive programming college courses generally prepares student for ICPC, and if you don't have an Olympiad/CP background already, high chance for you to flunk the grades.",
            "Just wondering, when did you have your VO and get portal update?",
            "Homie, I am on the same boat. Is it possible if you could give me advice on my resume and guide me towards a brighter path?",
            "Sure you can change your grad date but some internships are strict about being enrolled in school after the internship period due to government aid for the company",
            "How was the final interview? What topic and difficulty did you get",
            "congrats! would you mind sharing the timeline?",
            "Is it amazon? Having worked there and how their pay isn’t that great in comprising does fascinate me how it is part of fang",
            "how did you manage to fill out 700 apps??"
        ]
    },
    {
        "post_id": "n9omhd",
        "author": "Prudencia",
        "title": "Funniest CS intern take home assignment ever",
        "url": "https://www.reddit.com/r/csMajors/comments/n9omhd/funniest_cs_intern_take_home_assignment_ever/",
        "score": 784,
        "num_comments": 69,
        "created_utc": 1620706683.0,
        "selftext": "Ok so I applied for a full-stack developer intern position at some tech startup/consultancy company in Toronto and I got a response to do an assessment and send it back in **48 hours**. I thought ok, wont be too bad maybe like a leetcode thing or a small take home assignment. I open it up the next day and its a giant whiteboard of tasks I have to do. \n\nI applied for the fullstack internship so I had to do both the front end and backend assessments (WITHIN 48 Hours!). So I took a look at them and the front end assessment was to make a dynamic website with music playing in the background and dynamic cursor and a bevy of other bullshit. OK fine, I look at the backend assessment and it says to make a twitter clone API with user login, unit tests for each endpoint, creating and updating tweets, the whole shabang. And the wording of it was so aggressive too. They tell you to make the APIs for the user login first and they end it with \"These APIS MUST BE PERFECT, DO NOT MOVE ON TO THE REST OF THE ASSESSMENT WITHOUT COMPLETING THIS OR **YOUR ASSESSMENT WILL NOT BE SCORED**!!\" \n\nSo yeah exited out of that assessment real fast. The egos on these toronto startups are legit through the roof holy shit. Like get a grip on reality asking an intern position that youll probably pay 20hr for to do all that shit in 48 hours",
        "permalink": "/r/csMajors/comments/n9omhd/funniest_cs_intern_take_home_assignment_ever/",
        "comments": [
            "Yeah. Fuck that.",
            "Should’ve sent in a blank website with a big old fuck you in the middle and Darude Sandstorm playing in the background.",
            "what company?",
            "Shopify asked me to do a whole full stack project also.. never making the same mistake again. I spent a whole week of researching and coding just to.. get.. denied.. F that",
            "Sad thing is there probably will be people who will go through that to get hired, too many applicants",
            "Can't you outsource it to Fiverr? (joke)",
            "Had some of those with oddly specific requirements that appear to be a business task they need to solve. This stuff should be illegal, cause it's not only unpaid work, but it is also probably a false promise of a job.",
            "[deleted]",
            "The audacity of anyone to give actual assignments for interviews, let alone this one, is beyond insane. I can maybe see how a technical question being asked helps to see how the person approaches an arbitrary problem under some sort of pressure, but this is pure nonsense.",
            "Name? I need to know so I don’t apply.",
            "You should just Rick Roll them. With this much work, you might as well create a startup as their direct competitor lmao",
            "Wow we need to start a database for shaming companies. These hiring ethics are getting way too out of hand.",
            "As someone starting study in toronto this autumn, what the fuck",
            "Let me guess - it's an unpaid internship too!",
            "They besicaly asked you to do a whole internship work to get a chance to maybe get a internship lol.",
            "I doubt that even a senior engineer would be able to finish all of that in two days. What a bunch of clowns.",
            "Toronto is filled with these self engrossed startups and their founders. Most will fizzle out once vc capital dries up. If you see such trash, just run.",
            "I’d you are going to go thru all that jazz, apply at a FAANG.\n\nIt’s good practice if you have to constantly demonstrate expertise to experts.\n\nIt’s a waste of time when dealing with a group you suspect couldn’t cut it at the level constant learning + demonstrated expertise is the general run level.\n\nGet in where you fit in is important for long term happiness."
        ]
    }
]