[
    {
        "post_id": "10wozmm",
        "author": "jerrybobjoe",
        "title": "Do some of y'all have weights in your fingers?",
        "url": "https://www.reddit.com/r/csMajors/comments/10wozmm/do_some_of_yall_have_weights_in_your_fingers/",
        "score": 787,
        "num_comments": 64,
        "created_utc": 1675836044.0,
        "selftext": "I swear to God in all of my CS classes there's always one or two hacker gods who are sitting there, slamming their titanium sledge hammer fingers onto their laptop keyboard.\n\nJust today in class this kid next to me is typing up some brainstorming ideas into a Google doc and he's slamming the keys like they called his mom a whore.\n\nWhy are some of you like this?",
        "permalink": "/r/csMajors/comments/10wozmm/do_some_of_yall_have_weights_in_your_fingers/",
        "comments": [
            "tap tap tap tap tap tap tap tap tap",
            "Wait you don't bring your mechanical keyboard to class?",
            ">he's slamming the keys like they called his mom a whore.\n\nPower move",
            "Yes and they all use this same speed typing website which somehow makes their typing have 10x noise",
            "Well theoretically the faster you are typing, the harder you are hitting the keys. Newton’s 2nd law",
            "maybe that keyboard did call his mom a whore. AI is pretty advanced nowadays",
            "get your skills up. If your keys don't look like the top paint was melted off you aren't typing fast enough",
            "You’re chasing the wrong profession if that sound bothers you",
            "It's pretty normal.\n\nWhat about a clickly mouse noise lol",
            "I bet you cut all the tags off your shirts and have to have the sock seam on your feet just right.",
            "Back in uni, we had most of our exams in a computer  lab (our exams were digital but we still had to be in that specific room at a specific time). In one of those labs I noticed that the keyboards looked like they were mechanical. They might have been just loud regular keyboards too, but I was not ready for what was about to happen. Just before the exam everyone was sitting in the lab quietly waiting for them to give us the code that unlocks the exam. The room was dead quite and then the time come and they gave us the code. I kid you not I got startled from all the key tapping noises, 100 people typing felt like a whole army. Needles to say I lost all my focus due to noise. It took me a minute or two to get used to it and actually start my exam.",
            "it muffles the voices inside my head",
            "I always brought my cherry reds to the classroom because I coded better that way.",
            "Hah this is too relatable. The person who sits next to me taps at his keyboard like he's playing the drums",
            "Yeeha, programmer. As for them weights, maybe y’all use em but I ain’t seen a single soul in my day to day strap themselves with one o’ them.",
            "[they got the blues](https://www.cherrymx.de/en/cherry-mx/mx-original/mx-blue.html)",
            "“I type with purpose”",
            "They gotta lube em so it thoccy",
            ">he's slamming the keys like they called his mom a whore\n\nI spit out my coffee and I wasn't even drinking any",
            "OSU players",
            "Lol my gf does this and it drives me crazy it’s like she’s trying to break the keyboard",
            "They will have arthritis one day, don't worry about it.",
            "Lol they just know how to type",
            "Yes, actually. I have a biomagnet lol.",
            "Lmao, you can hear my dad type from miles away and it would drive me nuts, now I’ll find myself typing like an animal without realizing it. I got a nasty look yesterday and did not know why, reading this made me realize 😂😅",
            "Sounds like they took a lesson from Robert Schumann! My man fucked his fingers into oblivion with some finger resistance tech!\n\nhttps://www.wqxr.org/story/weird-classical-when-schumann-ruined-his-fingers-and-his-concert-career/",
            "For me I’ve been like this because I have a mechanical keyboard at home, and habit of having fingers to make sure it activates what I want it to and when ended up carrying over.",
            "This is why I get the quiet switches. I hate the fucking loud switches that keyboard jocks use to show how bad-ass they wish they were. Just fucking type for fuck's sake.",
            "and they're smacking those sausages on a cheap, plastic, rattly laptop keyboard",
            "The harder you type, the more powerful your programs. CS 101",
            "Do they play piano?",
            "At my old office I got tired of my coworkers typing loudly so I got MX Greens. You can try that.",
            "Bad habits. That's really it. I mean seriously, I've hurt my fingers/hand from typing like this, but sometimes I'm so lost in my work I don't realize I'm literally slamming each finger into a key as I type. I try to make a concious effort to not do it\n\n&#x200B;\n\nEdit: I also noticed a lot of people talking about the sound of it, and while I'm sure it may have somewhat to do with mechanical keyboards, it could very well, like me, just be someone physically smashing that keyboard",
            "I type like this depending on who the individual is lol. When I worked from home my homegirl always knew who I was typing to when we were on the phone. She always would say it’s too early to be starting this shit Deon 😂"
        ]
    },
    {
        "post_id": "uutzty",
        "author": "EngineeredPapaya",
        "title": "PSA: what should you be doing during your CS degree?",
        "url": "https://www.reddit.com/r/csMajors/comments/uutzty/psa_what_should_you_be_doing_during_your_cs_degree/",
        "score": 781,
        "num_comments": 126,
        "created_utc": 1653160792.0,
        "selftext": "Hey!\n\nSo I spend some time over at /r/cscareerquestions and I've been seeing a lot of resumes for new grads that are basically empty. They just have a projects section which has their homework projects from various classes listed. Its really concerning to see that CS students seem to just go to class and take tests.\n\nSo I just wanted to raise some awareness and let you know about all the options you have available to you *while* you are a student, so that you can take advantage of them and graduate with a resume that will get a lot of callbacks. **Once you graduate you will no longer have access to these, so make sure to do it while you are still in school.**\n\nAs a student at a university pursuing CS, you can participate in the following:\n\n* **Lab Volunteering**: Most CS labs need student volunteers to do various technical things. Once you get to know your professors, you can ask to volunteer at their lab if you are interested in their research. You can usually turn this into a paid research assistant position very easily since professors always need research assistants.\n\n* **Research Assistantships**: At most schools, if you get to know your professors well, you can get yourself research assistant positions at their lab and work for them. It's usually available to undergraduates and often a paid position, but this will vary from school to school. It's a great opportunity to learn a lot about a specific niche of computer science (depending on what the professors research is in), and a great experience to put down on your resume.\n\n\n* **Teaching Assistant/Tutoring:** It's usually available to MS students, but some universities allow undergraduates to be TAs as well so you should definitely ask around. You can also get a job as a tutor for specific classes, so look into that for your university. Being a TA or tutor for your beginner CS course from freshman year is a great experience to put down on your resume.\n\n* **Co-Ops**: Most universities should have some Co-Op program for CS students. They are usually overseen by a professor and your engineering/department advisor will have leads. At my school, you would get credits for doing a co-op so instead of doing 2 electives you had the option to do 1 co-op and get 6 credits for it. Definitely do it if offered by your university!\n\n* **Internships**: The majority of internships are available to degree-seeking students exclusively. I don't really need to explain how important internships are. Your university might have a program to match you to internships or might have career fairs where companies come in and directly recruit students into internships. All of the above experience will pad your resume enough to make you desirable for internship recruiters. Someone who's resume only has homework projects will get passed on for someone who has a research experience, was a tutor, or volunteered at a professor's lab.\n\n* **Clubs/Orgs**: Most universities' engineering departments will have chapters of various CS focused orgs (IEEE-CS, ACM, MSDN, etc.). Volunteering at them as an officer can be a great experience, and they often have engineers from various tech firms within their network come in and give talks, and it also serves as an opportunity to network with these companies and get your resume directly passed to their recruiters.\n\n* **Hackathons/Programming Competitions**: The orgs or CS focused clubs mentioned above will usually host programming competitions and hackathons at your school. There usually also are larger state-level competitions with multiple universities participating, depending on your area. You can grab some of your friends and participate in them. Getting top 3 at a hackathon or competition is more impressive on a resume than making the Dean's List.\n\n* **Networking**: This one isn't as corporate as it sounds. Just be friendly with all your classmates and you'll naturally become friends. Make connections with your classmates, co-volunteers, your professors, and advisors too. You're going to make some of your best friends in college, and they will go on to work at great companies too. I can basically skip to the phone interview at any of the companies my friends work at through a referral. I can reach out to my old professors and get referral letters very easily if I decide to pursue a MS or PhD. Don't be a loner, software engineering is a team sport!\n\n\n\nSo basically, if all you are planning to do during your BS in CS degree is go to class, study, and take exams: it's not worth it and you will have a rough time getting that first new grad job. When you are paying for a degree, you are paying for access to all these things which ensure that when you graduate, you have a lot of collective experience and are a much more desirable candidate than your peers who have whitespace resumes. Most of your internships will also turn into a full-time offer if you perform well, so you can have guaranteed employment upon graduation.\n\nI didn't go a big tech school, just a public school in Florida where FAANG didn't even recruit from directly. I worked part time throughout college as a math tutor and then a tutor for the intro CS courses. I was vice-president of our local IEEE-CS chapter and organized a lot of events and workshops for all the members. I participated in most of the hackathons and programming competitions my school had and even did a statewide competition. In my sophomore year, I started volunteering at one of my professor's lab which did AI research, and eventually got hired as a research assistant junior year. Through my engineering advisor and another professor who I knew, I joined a co-op program where I built software for a local company. Through the career fair on campus I secured an internship, and received a return offer afterwards. I graduated with a 3.4 GPA but that didn't matter.\n\nI'm not saying you have to go and do all of these, but you should try to do 1 or 2 of them just to learn more and for the fact that it will make your life easier.\n\nI hope all this information will inspire to do things other than going to class and taking tests, and lead to me seeing more impressive new grad resume's on the resume review threads!",
        "permalink": "/r/csMajors/comments/uutzty/psa_what_should_you_be_doing_during_your_cs_degree/",
        "comments": [
            "I envy anyone who has the energy for that on top of their degree work.",
            "I knew too many people who had a 4.0 GPA and nothing else and had so much trouble finding internships, while I and other friends had 2.5-3.5 GPAs and were landing interviews left and right (yes, I know people working at FAANG tier companies from my university who graduated with 2.5 GPAs). Grades aren't everything and in CS especially, the skills that make people do well in classes (lower level languages and outdated frameworks, memorization for exams, being able to remember and replicate stuff on your own) are completely opposite from the skills employers want in interns/new grads (more up to date tech, being able to Google & Stack Overflow your issues, working in teams and communicating well) and all the stuff in this post helps with that 2nd set of skills that actually adds employability to a CS major",
            "This is a great post and very well thought out. However, I bet a good chunk of people will read this, come away feeling guilty that they don't have the energy or drive to do these things, and feel like they are slipping behind. I want to remind people that it's completely fine if you just attend classes. CS programs are hard and being a full time student can be more demanding than a lot of jobs. Don't feel bad if you're not the type of person that wants to put in this amount of effort. Many people go into this field not particularly because it excites them but because it's a great career path. Those types of people attend classes, have fun with the rest of their time (it's college, enjoy yourself!), and get hired at decent companies that pay well. You don't have to live and breathe this stuff to be successful.",
            "Because kids are told, go get a degree , it will get you a good job.",
            "Damn, wish I went to a big US university - mine doesn't offer even half of these (while still costing about as much as a US school).",
            "The harsh reality that a lot of people at my university don't seem to realize is GPA doesn't matter a lot. This was a hard pill for me to swallow coming from a competitive high school, but I see too many CS students with a 3.9+ GPA and absolutely no experience. I feel bad because the professors seem to brainwash them into thinking their classes are everything, when in reality they should be focusing on projects and LC to become a CS student that stands out.\n\nYou are so much better off settling for a ~3.0 GPA and having killer projects/internships than trying your ass off for a max GPA. I've seen it too many times and they have trouble finding a new grad job",
            "If you can do Internships, you should prioritize it. But I feel like getting Internships in CS Degree is as hard as getting a full time job.",
            "What’s the best way to put first place in a coding competition on my resume? I have it listed along with my participation in icpc under my “awards and honors” section. Also, my professor created an article about us winning on our university site, should I post the link to that beside where I put it or somewhere else?",
            "Not as good as an internship but I did a research assistant position and it's A LOT OF WORK, but you'll get your name on some papers. and you will get to present at conferences. The plus side is you get paid too (hopefully).",
            "I go to a community college and then I'm going to transfer to an online university. I guess it's just projects and internships for me. My college right now only has 4 clubs because everyone is online from covid. I'll have to look into hackathons tho bc I have no idea what they are really.",
            "This is so idealistic it sucks balls. You mean to tell me I’m working to afford school and trying my best to be great in my classes, but I’m still not enough? \n\nOp who paid your bills? I work and attend school, managing to get good grades is hard enough",
            "This is great advice! I think a lot of students forget that they need a way to stand out from their peers after graduation considering how many new CS majors graduate each year. \n\nI started an internship the summer going into junior year, and I only got that opportunity because I asked one of my CS professors if she knew of any summer internships. I got super lucky in that I started my internship hunt literally 2 weeks before spring semester ended, and I got into the one she suggested last minute and worked there up until graduation (so 2 years experience ~20 hours per week, paid). My other CS professor asked me to be a lab assistant/tutor so I did that senior year too. That was only 4 hours a week over 2 semesters but still a great way to pad my resume!\n\nOther advice: form good relationships with your professors and take advantage of the career services office at your school!",
            "The first three are a waste of time for people not looking to go to grad school.  Being a teacher’s assistant might be helpful, but that time is better spent making projects.\n\nClubs/orgs highly depends on the quality of the club.\n\nNetworking is generic advice.  “Oh I didn’t know meeting other people would help me!  Crazy!”",
            "Honestly this just isn't realistic for most students. I'm really busting my ass over here and barely scraping by with C's and maybe B's. If I tried to pile any of that on top of my course load I would just fail all of my classes.",
            "I can't understate how useful it is to be a TA!\n\nRemember all those concepts in first year which you were a little shaky on? \n\nWell you'll know them inside out by the time you've explained them the 100th time to a first year during your work as a TA!\n\nAlso ever had those issues during 3rd year or 4th year when suddenly the lecturer is calling back a concept from 1st year that they're now going to build upon? Well you'll remember it perfectly and know it rock solid, as you were just earlier that morning explaining it to a first year! Meanwhile, everyone else in your class forget it immediately as soon as their exam finished for that paper a couple of years ago.",
            "lemme focus on actually graduating first then I'll deal with that later",
            "I dunno. Zero internships, got drunk way too often, had a great time.... Got degrees in CS and ee...excellent career as a software engineer",
            "[deleted]",
            "Really wish people would post their age and years in the work force before posting these long paragraphs so I'd know who to skip right away.",
            "I’m in Florida and ready to transfer to FSU because I thought that would be a better university for internships and clubs.\n\nCan I ask what school you went to?",
            "Hello, I was wondering what you suggest if someone has a completely online university? I'm about to start CS classes and I am trying to finish the degree by December 2023. I'm trying to have a plan on what I should be doing while I am studying. Since I don't have as much of the human interaction, what do you suggest?",
            "Commenting so this saves",
            "1. Thank you this is very helpful\n2. As an anticapitalist i hate the wording of this and it makes me never want to follow the advice even though it's good advise and yes that is my fatal flaw.",
            "None of these are necessary or required to get a good job.",
            "remindme! 65 days",
            "Good read!",
            ">Just be friendly with all your classmates and you'll naturally become friends. \n\nNot if ur not nt its brutal",
            "Hopefully these apply to my B.A in web development",
            "save it"
        ]
    },
    {
        "post_id": "1803yqm",
        "author": "Yung-Split",
        "title": "I got an offer! What I learned..",
        "url": "https://www.reddit.com/r/csMajors/comments/1803yqm/i_got_an_offer_what_i_learned/",
        "score": 784,
        "num_comments": 64,
        "created_utc": 1700526973.0,
        "selftext": "I did it fam.\n\nI got a full-time offer for when I graduate.\n\nJob details: Data Scientist, 120k, MCOL\n \nSchool: no name state school, not even a top school for cs in my state, state is ranked poorly for education, 3.5 GPA\n\nFor those who are still planning for graduation, I've written this with you in mind so that you can find some value in it.\n\nI believe the first step that seeded my current momentum, was a senior project I worked on this Spring. It was a group project. Since I had no professional experience, I wanted to get my group to adopt a project that would look good to potential employers. I was fascinated with ChatGPT at the time, and it is a technology that many businesses are curious about right now, so I came up with an app idea we could build that utilized it, and sold my team on the idea.\n\nFrom there I lead the project and although I found my team unmotivated to really excel in the project, I went above and beyond and really turned it into something substantial. And because of how involved I was in it from every angle, I had a lot to talk about to potential employers. \n\nEnter my school's very modest career fair. I put the senior project on the top of my resume and made it a talking point at almost every single employer table I went to. One company had a recruiter who thought the project was interesting and knew a business unit who was exploring how to use the technology. This is what secured me my summer internship.\n\nAt my summer internship, I had one goal, by the time I was done at the end of the summer, I wanted to have created something that would have management saying, “Wow. We really need to hire this guy.” Knowing I was skilled in making apps using OpenAI's suite of products, they gave me a really great summer project that I was able to play my strengths into and really excel in. I made sure to move fast and just do whatever I could to get as much results as I could in as quickly of a manner as I could during my 40 hours a week. By the end of the internship I had accomplished my goal. They wanted to extend my internship.\n\nFast forward a few months later and you might think that this is where my internship offers me full-time and the story ends, but that's not quite what happens. \n\nTime was dragging on and I still hadn't received an offer from my current company. They say they want me, but they're dragging their feet on the process. Unfortunately, I can't take that at face value. Things happen. So I had to continue searching for jobs. \n\nEnter my brilliant idea. My school's career fairs aren't that great, but I have a college with an awesome CS program just a couple hours away. I wonder if I can go to their career fair? I bet they have great companies that recruit from there. So I found out who organizes it and emailed them, and they said I'm more than welcome to attend! \n\nI arrived and did my usual networking with my new internship experience, and one company who is in a similar industry as my current employer ended up being impressed with my experience and resourcefulness in going out of my way to find opportunities, and invited me to interview for a competitive graduate program. \n\nI went a few weeks later to this interview and unfortunately, I was not selected…. but while I was there, I really connected with one of the interviewers, a lead data scientist who has himself been fascinated with ChatGPT and the possibilities of generative AI. We had some great conversations about my experience and the possibilities on that frontier for their business. \n\nA couple weeks later, an internal recruiter for the company reached out to me saying, they wanted to hire me directly as a data scientist, working under the lead data scientist whom I had connected with over shared interests just a few weeks earlier… and the rest is history.\n\nI'm still waiting to see if my current company gives me an offer, but I honestly don't think it will be as competitive as the one I just got, plus I now have a great chip in negotiation if they do give me an offer.\n\nIn summary, here are the main things that I believe contributed to this outcome, and that you can use to your advantage as well: \n\n1. Learn an in demand and relevant technology \n\n2. Build a substantial project using it\n\n3. Make it a talking point in your resume in lieu of experience\n\n4. Go to your school's and other (better) schools’ career fairs. Drive a few hours if you have to. Talk to as many employers as humanly possible.\n\n5. Get at least one internship and make it your goal to impress. Your goal in an internship should be to secure a return offer.\n\n6. While waiting for a return offer, or if you don't get one, use the internship experience as a stepping stone to other opportunities with companies in a similar industry.\n\n7. Be able to charm recruiters and decision makers (soft skills)\n\nSo yeah that's pretty much it. I didn't even bother to mention the hundreds of applications I sent in online, because truth is, they delivered 0 results for me. Everything that worked for me involved being face to face with people, with my boots on the ground.\n\nAnyways, thats it for the long ass post. I just wanted to share with you guys that new grads are getting hired, that you can do it too, and to convey what worked for me, so that it could help some of you too. I don't consider myself particularly smart, and I definitely don't go to an amazing school, so it definitely is possible. I did it, so you can too!\n\nMuch love everyone ❤️",
        "permalink": "/r/csMajors/comments/1803yqm/i_got_an_offer_what_i_learned/",
        "comments": [
            "This person is a storyteller",
            "This is such a good post that people should take a lot from. It’s a fact that the majority of jobs are obtained not by sending applications, but through networking. \n\nPeople on this sub will cry and say they go to all the career fairs and still nothing happens. I’ve seen these people irl, all they do is listen to the recruiter talk to a crowd and when they’re finished they give the recruiter their printed resume which then gets added on to a pile of 50 others just like it.\n\nTALK TO PEOPLE! Putting a face to a name puts you leagues ahead of the competition and, just like in this story, random things can come from talking to people. It’s a fact that people like to help others it since it makes them feel good about themselves. Everyone should use that to their advantage.",
            "STAR, Take notes ….",
            "the way this post was written had me hooked on every line lol \n\nCongratulations dude, I think this advice is solid",
            "How did the connection with the lead data scientist happen?",
            "Your writing has an amazing rhythm of short, medium, and long sentences. Very impressive.",
            "Congrats man on getting your full time offer is it ok if I DM you",
            "This post is a reminder that both being able to build and being able to sell it is essential to get you ahead in today’s world.\nLoved reading the post g, it’s got solid advice.\nAlso, Congrats on your job and Good Luck!",
            "This was so refreshing to read.  I think it's the balance of it.  The reality is we are all going to face some kind of rejection.  But, to hear you go above and beyond, especially with your networking and then to be rewarded at the end, felt so good to read.  You've inspired me, thank you.",
            "What was the project on exactly? How many hours did you put into it?",
            "Congrats lad btw you do some blogs - you're really good at storytelling/writing I was very hooked on from the get go lol",
            "Congratulations! This is inspiring!",
            "Never accept a counter offer if one is offered.",
            "How much leetcode did you do",
            "how old are you? you sound like a more mature student",
            "Are you an international student or citizen?",
            "Easier to just get certs and mess with your pronouns a bit. Apply to a low paying gov’t position, get a clearance, work there a year, and then literally pick where you want to go from there.",
            "What do you think you're the only soon to be grad in the history of the world to get a job offer????? Good for you......",
            "R u part of some diversity program",
            "[deleted]",
            "Gooood jobbbb happy for u",
            "Really helpful post! I'm a sophomore right now, I have an idea for a fullstack mobile app that I want to build probably using flutter and firebase but I'm not really sure if mobile development is something thats in demand or is something I want to do after college. I would think if I could get my app approved on ios and android and can talk about it well to employers it would be good for my hireability but Im not sure. Any thoughts?",
            "I was hired for company B as a contractor via a staffing agency 'E'. Worked at B for nearly 2 years. I got an offer and for the verification should I  mention company B or E information? They are asking for  apart from manager. Should mention B's refrence or E's employee reference. Please help 🙏 please suggest",
            "Hey OP congratulations,  may you please explain as to what kind of projects did you do? The internship one if possible as how did the data science came into play.",
            "Huge congratulations! Hope to share in some of your amazing luck! 😊🎉🙏💪🍀",
            "Congrats man!!",
            "Well I did this, and connected with a lot of recruiters, and I didn't get anything sadly 😭.",
            "Great post with amazing tips! And congrats on the job.  There should be more posts like this here instead of useless rants and shitposts.",
            "Congrats! I had a few friends who also got the idea to attend another school’s career fair but unfortunately they were turned away at the door, so calling ahead like you did is key!",
            "Thanks so much for the advices in your post! Can I dm you to ask more?"
        ]
    },
    {
        "post_id": "17t92m3",
        "author": "teabear72",
        "title": "stop doing computer science",
        "url": "https://i.redd.it/bgqggtluhtzb1.jpg",
        "score": 780,
        "num_comments": 15,
        "created_utc": 1699751486.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17t92m3/stop_doing_computer_science/",
        "comments": [
            "10/10 meme almost made me want to drop out 🙏🙏🙏",
            "Why didn't i think of that last one? Couldve been rich by now",
            "Uhm we don’t do that because that would lead to Stackoverflow 🤓",
            "https://preview.redd.it/ilgqa9i3myzb1.jpeg?width=784&format=pjpg&auto=webp&s=83c1dfe4d794d328954ad7a4854f968d1330e16a",
            "Don't forget to update your internet explorer on your way out.",
            "Quality shitpost… i guess",
            "I love the math one about this. It cracks me up",
            "Can someone explain the teapot to me😗",
            "ok that was mostly funny, but this FAANG engineer is even funnier\\~\n\nWho is the mommy and daddy of robots?\n\n[https://www.youtube.com/shorts/lNdv5fZd9jY](https://www.youtube.com/shorts/lNdv5fZd9jY)",
            "Most Reddit meme ever.",
            "Most Reddit joke ever. Can’t wait to read the hive mind echo chamber replies to this post and spectate people who struggle to come up with original thought."
        ]
    },
    {
        "post_id": "11fk74h",
        "author": "Infinite-Bee-7215",
        "title": "People CHEATING on coding interviews",
        "url": "https://www.reddit.com/r/csMajors/comments/11fk74h/people_cheating_on_coding_interviews/",
        "score": 783,
        "num_comments": 321,
        "created_utc": 1677709546.0,
        "selftext": "Just found out that people sitting together in coding interviews, sharing/casting screens and getting an optimal solution. These people got summer 2023 intern offer from Meta, Amazon etc.\n\nIts so pathetic, we work so hard grinding leetcode and these people STEAL our jobs?\n\n&#x200B;\n\nP.S These are international students pursuing MSCS at good university in US",
        "permalink": "/r/csMajors/comments/11fk74h/people_cheating_on_coding_interviews/",
        "comments": [
            "Not really surprising given how rampant cheating is in CS programs. Unfortunately, people with no integrity often get ahead.",
            "[deleted]",
            "Do you mean coding tests ?  I am curious how people can group together and cheat in interviews",
            "Competitive coding != SWE.",
            "Found your problem and it's in the last line. Those students are in the MSCS to extend the duration of their allowed stay in the US and then to cement their stay they have to get a related CS job. When your back is against the wall and your way of life is threatened, everything goes out the window and you will do anything to survive.",
            "It has become quite common. Honestly, I found out about it in January and that those guys (I am Indian too and so are they) had got internships. They bought a cheap second monitor and mirrored the screen and had 5-6 guys away from the camera. Further, they even have WhatsApp groups with easily 30-40 people where they send a pic of the problem, and the odds are really good that someone knows the answer. How do they know it? Because they practice leetcode and cheat. This is why them facing issues later  or getting \"found out\" in their career is not really true\n\nNgl it did make me wonder about what if I had just cheated and got an offer too because right now I have nothing. I feel there is a \"no matter what\" mentality that exists in at least Indian students, where pressures of loans, family, peers, etc contribute to this unjustifiable behavior.",
            "I mean with all the scummy recruitment practices these days I honestly don't really care. \n\nIf I can use Copilot/ChatGPT to help me write cover letters, complete shitty HireVue \"interviews\", and complete code questions so be it. If the companies actually treated us well during the application process I think far fewer would turn to these sorts of methods.\n\nJust look at the algorithm inflation over the past few years, you've gone from needing to do at most blind 75 to having to do way more, way harder questions, and go through far more rounds of applications. Students haven't gotten smarter... So somewhere has gotta give.",
            "Yes, this is what happens when you create a rather flat and very rigid standardized testing system... People find ways to game the system.\n\n&nbsp;\n\nThis was inevitable. \n\n&nbsp;\n\nThis is also a prime reason of many as to why I despise Leetcode and similar rigid systems.",
            "But it’s ok for Millionaires to donate and have their kids admitted to college",
            "This is common in CS and worst part is those people typically go on to have great careers",
            "How did you find out",
            "Can someone explain how it’s done in a live interview? Like I get it you can probably share screen and ask someone else to pull up the solution but how do you explain it without sounding sus? I believe most people would be able to make out something is fishy no?",
            "How are they your jobs? People cheat, backstab, insider trade… and a litany of other immoral actions to get ahead this is not unique to cs or school also these interviews are not as simple as get answer get job",
            "Don't hate the player hate the game",
            "So what? It’s not like leetcode skills are practical. If they don’t perform at the company they are at, they will get fired anyways",
            "I am an undergrad international student, but I wish people had some decency. But in this world people who are idealistic and follow their values will suffer☹️",
            "Cheating or not, there is no job being stolen. If you can code and interview well, you can get a job. FAANG or not, coding assessments, especially those targeted at folks fresh out of school, are not THAT bad.\n\nAs an interviewer, I'd almost rather a candidate didn't have an optimal solution, as it almost guarantees they've seen the problem before, which means I can't assess their problem solving skills. If you struggle, and walk thrive the problem, I can see how you work under pressure, and see if you can think independently. Overall, this is a bit of a non issue imo.",
            "It's common. I was doing a ton of interviewing for our off shore team made up of primarily folks out of India. We required cameras be on and we added extra people from our side of the interview who's job was to just check if they were cheating. For every 5 interviews, we probably caught 2 cheaters. It's bad.",
            "Cheating is morally wrong but what prevents a smart student from studying and cheating and getting ahead of his peers. Leetcode does not correlate to industry success so if someone knows their skills and cheats, then there’s no imposter syndrome or getting found out later in their career. \n\nI’m not condoning cheating, I’m just explaining how they get away with it. Also it’s about the $$$ so people will do whatever they can do get it. Just look at meta amazon and google lawsuits, so you could theorize that like attracts like.",
            "people are CHEATING on coding interviews? nah, i don't believe that for a second.",
            "This is why I pushed against HackerRank at my work for a long time, although I finally caved with Covid.  Before then there was nothing better than making candidates write their work on a whiteboard.\n\nBut, modern tools make this easier, and all my interviews are over Zoom now anyway.  So we make do with the tool.  It works as well, I get to watch  you type.  I don't give a hoot if you search Google or whatever for syntax (Lord knows I do,) but if you suddenly paste code in, that would generate a conversation.\n\nWhich is how we evaluate you, really.  It's not about the problem you're solving.  We don't care if you can solve it or not.  Honestly.  I know that's not how it's presented, but that is only the goalpost that we want to observe you trying to reach.\n\nWhat we care about, is what do you do when you're stuck?  What kind of questions do you ask?  Do you just sit their stupidly?  Do you get angry?  How do you try to resolve the problem?\n\nWhich is why it's stupid to try to cheat to solve them.  What kind of conversation are we going to have if you just super fast write the solution?  Even if you can defend every line of it?  It's like, woo, you've seen it before and memorized it.  I don't care.\n\nNow someone who understands the problem, gets stuck, asks good questions, takes hints well, continues to work calmly under pressure?  They're the candidates who get my vote.",
            "> Its so pathetic, we work so hard grinding leetcode and these people STEAL our jobs?\n\nLol. Wait 'til you find out about people who *cut in line at the grocery store*. 😱",
            "wdym? Being collaborative is an optimal skill!",
            "Honestly leetcode has no real effect of any real life situation you will code ever. So do what you have to do to get the job, they sound like they worked the system to their advantage. That’s capitalism bro.",
            "Unpopular opinion here: I'm against cheating in interviews but am for using existing tools to solve problems\nI probably wouldn't be as good programmer as I am without Google and stackoverflow",
            "i was agreeing with the OP until the last sentence. Generalising international students as cheater is straight up ignorant.",
            "Whatever it takes.",
            "Quit crying. All you do on the job is \"cheat\" and use Google anyways. This is the fault of the public education system for training you to think otherwise.",
            "Common with Indian students.",
            "There’s no fairness in the world.\n\n(How only a few get to born in a rich country?)",
            "Think abt their position. Is it unethical? Sure. Is the system perfect? No. \n\nThe kids you mention take loans, come to a new country, and face more obstacles than us non-international students. So when they have a chance to get a job that could stop them from getting deported, payback their loans, and live here what do you think they would do? \n\nOption 1: Do leetcode to the best of their ability and risk the chance of not getting the role becuz they wanna play fair in a broken system\n \nOption 2: Maximize their chances of winning and cheat which could solve various issues in their life.\n\nNot trying to defend cheating j trying to see the other side.",
            "Just found out that people sitting together in offices, sharing/casting screens and getting optimal solution. These people got summer 2023 promotion from Meta, Amazon etc. \n\nIt's so pathetic, we work so hard grinding overtime and these people STEAL our promotion?",
            "It’s pretty common and who cares. You do whatever you can to get ahead. This isn’t fun time, this is to support yourself. If you can cheat and get away with it, that’s a good skill to have. You can plan and think on your feet. \n\nThe world we have created makes cheating morally justifiable. If they can’t handle the actual job they’ll be out in months in this market.",
            "Do you think it’s because a lot of times people say they use google to look up solutions in the real world when working a job? I feel like with that mindset, they’d view cheating as not an issue even tho it’s still valuable to have that knowledge",
            "Fuck those people",
            "If you’re asking questions that can be cheated this way, you’re doing it wrong.",
            "One of my acquaintances who fits exactly in the group you mentioned, did the same successfully. First I heard of it, I was disturbed for a week or so. Can get your frustration, it is unfair to the honest ones. But it doesn't bother me at all now, you cannot control what others do and I would never cheat no matter how high the stakes are (having known how hard it is to work as a senior dev and leetcode, I would never be unfair to my honest competition).\n\nLooking at the cons they might face in the long run- stronger impostor syndrome, poor interviewing skills, being caught and blacklisted etcetra, it's not worth it. \n\nSo let karma take care of things, if you believe in it. \nAnd also maybe faang is not the only option out there, lots of places with decent pay and more welcoming to human devs than leetcode monkeys.",
            "THEY TOOK OUR JOOOOOBS",
            "You'll be amazed how common this is especially in Amazon Interviews. That's one of the reasons I've stopped applying to big names because I know I don't stand a chance against a team of people connected via screen cast and bluetooth to answer interview questions. I've also seen instances where the interviewee doesn't type the code at all. They just move their hands like they're typing around while the code is typed by their friends sitting in the other room looking at answers. \n\nI know I'm an average engineer and that I can't arrive at optimal solutions in the given time but that doesn't mean that the people who cheat in interviews are better than me and deserve the job. \n\nI've seen people cheat in Amazon new grad behavioral interviews to get the 30 minute round.",
            "All these people in the comments defending themselves cheating 💀",
            "I don't mind.  I never took help or never helped anyone is these tests. But I don't think anything's wrong with it. If the testing system is flawed then people are going to exploit. \nPeople who join private colleges pay more money. And the colleges attract/bribe more and better companies. So does that mean by paying more a person becomes more deserving.\nPeople refer each other for a job. There are better people out there who don't have a friend in good places to refer them.\nNobody promised the system to be fair. Nobody stole anyones job. If you were good enough, you would have got it too. Maybe the candidate is just bad with tests, but very good at the actual job than the others who didn't cheat. Who knows 🤷🏻‍♂️. The job is not just the interview they cleared. It involves stress, people skills, dealing with superiors and a whole lot more.\n\nIf you are better than them, then you would get ahead of them. So just get over it.",
            " Before Covid, I had a 1 in 3 offer ratio for on-site interviews. I  received one offer for every three interviews. Last year, I did about  15-20 interviews and only got one offer. This year, I had two online  interviews but received any offers. However, I also had one on-site  interview and got an offer from a FANNG company. \n\nIt suddenly made sense  when my coworker told me about his online interview setup with dual  monitors and an HDMI splitter.",
            "How is them being Indian pertinent to this issue…",
            "I’ve seen many Indian students in my University do this too…. Idk what is so important to stay in this country or their passion for computer science?",
            "Somehow it's always the international masters students",
            "who cares lol. U know that you can do it on ur own, and these fools prob can’t do it during the phone screen on their own lol",
            "[deleted]",
            "You know the saying. Work smarter not harder. Why are you so butthurt",
            "When I see people doing this all I want to do is go up to them and say \"Is this how you want to get that internship or job ? Would it not feel so much better if you actually earned it ?\"\n\n&#x200B;\n\nI'm an international student and I've seen people openly discussing strategies for working together on coding tests and interviews. \n\nI even had a close friend come up to me and ask for help in the OAs, I did not want to help, I mentioned I can help coding it in xyz language(which my friend is not comfortable coding in) and got out of it. They did not want to code in a language they didn't know since it may come up in the actual interview.\n\n&#x200B;\n\n\nEdit : Getting down voted(despite making sense), could it be it's from the people who actually cheat as OP mentioned 🤔",
            "International students trying to get a better life in a different country and utilizing their resources to achieve it? \n\nAlso this industry’s main joke is going to SO and taking the top solution, just embrace it, the job is knowing what to copy and paste.",
            "2 dumb girls Ik got high packages in good companies by using their simps to cheat.\n\nWelcome to the world of IT job market.",
            "People that tend to do that don't really get far in their careers, not just in CS but in general.",
            "How do people do it? If it changes their lives might as well go for it",
            "They still have to clear interviews man chill",
            "Maybe just get better at coding? idk",
            "Sorry. It does seem unfair. I hope you find a good one real soon. At least you can sleep without your conscience getting bothered.",
            "You just posted this on the other thread https://www.reddit.com/r/cscareerquestions/comments/11fk8q0/cheating_on_live_coding_rounds/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Karma will come eventually. Stay kind be good!",
            "I understand this and I feel so bad about it too. But you can’t really call out all international students and Indians specifically. I being an indian myself has taken rejections in coding interview with pride and ignoring the fact that I can take help of my friends in the interviews. I’ll take the job with my own hard work and efforts rather than cheating.",
            "The added \"PS\" is my favorite part.\n\n\"How to I make my complaining post more terrible? Oh I know, I'll just sprinkle on a little racism and xenophobia.\"\n\nedit: Looks like it was originally 100% more racist before OP edited it. So good work on being 100% top American stereotype my friend.",
            "Someone should start official, certified testing centers for the standard DSA coding interviews. Like Pearson used to do for various certs back in the day. Seems like it could save quite a bit of time and headache for everyone. Yearly re-certification required. Jobs can check your cert with a number against some database to ensure candidates have been validated at specific levels of technical literacy and ability. Not sure why this hasn't been done yet. It could be gamed too, but there's quite a bit more control and monitoring that could be put in place. Idk, I'd rather just go get certified than have to deal with hundreds of potential tech screenings. Seems like it would be a win for the people hiring too, as it would save them a tremendous amount of time and money. Getting the buy in from one major FAANG company might be enough to start the trend. If I had the time and resources I'd try to make something like this happen. The current system and approach are a huge, huge waste of everyone's time and money.",
            "That's frustrating! Focus on showcasing your individual skills. Consider practicing with Interview Solver or joining mock interviews. Good luck!",
            "OP should be ashamed of himself for generalising all Indians are cheaters. They are international students and withhold huge loans and might even get deported if they don’t find a job in certain timeframe. \n\nIf I wanna choose between cheating and getting deported, Well you all know what the answer is.\n\nThis is a messed up capitalist world. Being honest and doing the things the way it is wouldnt get you shit. PERIOD!!!!",
            "All the FAANG companies need to invest in a 360 degree camera before they do video interviews. They need to ship it for any video interviews. \n\nSmall investment with some instructions with great return on investment.",
            "The stakes are VERY high for people from poorer countries.  \n\nIt reminds me of this documentary about guys in the training program to become Navy Seals. They were taking a bunch of performance enhancing drugs. Their motto was “If you ain’t cheating, you ain’t trying.”   \n\nBut I don’t want to excuse cheating. It hurts everyone involved at every stage.   \n\nI taught in China for a couple years. Cheating is built into the culture at this point. I had two students personally tell me they were offered money to take tests for other people. While giving a quiz, I noticed one student filling in two additional quizzes for absent students. How can we assess students who get good grades in this way? Without coming to class?  \n\nI am acquainted with a person teaching at a big state university in the US. She explained that the university recognizes that they cannot trust the international students to report accurate scores for English proficiency. Too many people submitting high TOEFL or TOEIC scores simply cannot understand English. So the university requires all international students to take a year of academic English.",
            "Wait until you get into industry and your backstabbed  by Cheater's",
            "Report them",
            "Don’t stress that",
            "Blame the shit interviewing practices this industry has created…",
            "Leetcode interviews are trash, and here’s another reason why.\n\nTheir entire premise is open to being gamed. Either through cheating or grinding, I don’t understand how any hiring manager lends credibility to the signal from this kind of interview.",
            "That’s just life. There’s cheaters in every field across every profession and the shitty part like others are saying is cheaters do win and get where they want. \n\nWhat’s important is asking yourself if you can do the same. Some people cheat and delude themselves to believe they really deserved all their accomplishments and played fair. Are you that type of person? Other people will cheat and be racked with guilt for the rest of their lives. What matters is what you think you can feel happy about. It’s bullshit that “living a dishonorable life will end in misery”— plenty of people live in their own delusions for their whole lives and die happy. The question is whether you can be one of those people.",
            "No such thing as cheating in this world. You can either dev a solution in the time allotted or you can’t. Simple as that.",
            "Don’t hate the player hate the game.",
            "1st time???",
            "There is literally no sport, game, competition, or evaluation where some people don’t cheat. If there’s an incentive to cheat people cheat. As far as interviews go I bet the people who cheat make up less than 1% of candidates who get offers so I really wouldn’t worry about it",
            "And chatGPT doesn’t do any good in this pathetic situation either",
            "youre not \"grinding\" leetcode, its easy, get a grip and go outside",
            "Life ain’t fair. Grow up buddy!",
            "Which country? India?",
            "“Our jobs” lol you are entitled to nothing.",
            "Bruh, cheating is already rampant even in universities. It’s likely they’ll do the same in interviews. Hope they get caught tho",
            "Don't worry. People are usually found out on the job, if they don't know their stuff. What goes around comes around.",
            "fack me",
            "Call them out",
            "Seen it in my cohort as well. Rampant cheating everywhere. Many of them had fake resumes with years of experience where they did absolutely nothing. It also helps that they have a very strong network, so they share resources all the time.",
            "In my company someone’s twin brother gave the interview and later struggled at performing",
            "How?",
            "A poor system will be exploited, one way or another. The current recruiting system needs some major changes.",
            "Gotta do what you gotta do",
            "They also lie on their resumes. And if it's a phone interview then some other person either answers the phone or is on a party line whispering in the person's ears. Some people will do whatever it takes to get a job. Also know that consulting firms bribe managers to hire their people.",
            "Maybe they’ll find a different way to weed out the candidates other than to use tests that highlights the cheaters and not the do gooders.",
            "Well my roommate got a interview call essentially for appearing for interview for US college graduate, they were paying 1500USD for cracking interview and then monthly 1000USD for shadowing the candidate on the job. It was crazy.\nShe rejected it, but we did got to see blurred out resume of the guy she was supposed to impersonate. And it was ridiculous in span of 4 years the guy had worked on every technology imaginable lmao",
            "Its funny that this is considered cheating when that is the exact process we use in our office.",
            "Don’t hate the player, hate the game",
            "Well I don't think anybody is stealing the jobs, the demand is still plenty high for the field. On the other hand, why do you care? Cheating on OAs, or interviews, will only hurts you, and us in the long run. If we don't promote ethical behavior and encourage people to develop their skills through lots of effort, we will see that hiring processes will not be fair and equitable for all.\n\nFocus on your career growth and determine whether that approach is worth it to you. If you have the time to look at others and worry about their cheating, instead of actually focusing on your career; you're only cheating yourself.",
            "I failed a couple coding tests straight up because I didn’t really practice enough, and then my job offers literally came from my internship and two companies that don’t do coding interviews.\n\nIf I get a choice, I will never take one again, it’s not worth the time to cheat, and it’s also not indicative of coding skills, I can get my PR’s done when I need to, but putting me on the spot for an hour when it has no direct meaning doesn’t make sense to me. If I wasn’t performing well, the company I intern for would have dropped me, I’ve seen it with 2 of the interns I started with.",
            "The software industry is all about collaborating. If the people didn’t know shit, they wouldn’t be cracking the interviews and getting those job offers. Try and talk to one of these people, you’d realise that they are pretty darn smart. Also, Nobody is trying to STEAL YOUR JOB. The job isn’t even yours to begin with. Also, the interviewing process is extremely discriminatory against international students to begin with. This being said, I’m not supporting cheating. All I’m saying that cheating on the OA isn’t a big deal as you are making it out to be.“These” people aren’t limited to just Indians. Most people of different races cheat on the test. If you think it’s just Indians, time to expand your horizon. And maybe become a little less racist.",
            "Yeah, I think companies should do final rounds of their interviews onsite. It is a hassle but at least it would be fair.",
            "Based. Secure the bag.",
            "This seems to really bother you but it's pointless to get worked up over it. Some people are cheaters and maybe even get opportunities because of their cheating. But there is nothing you can really do as an individual about it. So honestly might be better to use your energy focusing on yourself and your own goals and spend less energy being angry about stuff out of ur control. And it's not like you cannot succeed without cheating. I got offers from both Google and Amazon without cheating so it's definitely doable.",
            "Well yeah, all you have to do is pass the tests, doesn't matter how you do it",
            "imo theres nothing wrong with this. The process of learning is unfair. Without access to resources, college tuition, you cannot even play the game. Not to mention varying levels of test prep, tutors, school resources, prestige play into who gets past round 1 of the interview. If stephen hawking went to community college he probably wouldn't get past resume screen for amazon intern. To have the entire process be unfair, then to call it out for only one portion is to ignore the inequality in the system as a whole and cherry pick when its something you're not able to participate in",
            "If I had an opportunity to do it and get away with it, I would",
            "I knew people who did that in my master, usually they were international students desperate to get job/internship for immigration purposes. I find it quite discomforting cause I feel like a fool for taking the “honest” way.\n\nI would not call it stealing tho. How many people were passed over by other candidates who had better connections despite having the same level of technical and soft skills. It’s the game.",
            "I am an international student and I would like to give my honest comment on this.\n\nI agree a lot of students do cheat in OAs but most people give the interviews by themselves. And it’s not like we do not grind leetcode. Most of my international friends have more 200-300 leetcode problems minimum under their belts and trust me MOST kids slog! Then why do they do it?\n\n1) Most of the international students come from 3rd world countries and they’ve accumulated ridiculous amounts of debt(from where they come from) and will be deported if they do not land a job in their field of study.\n\n2) They are not allowed to work off-campus to relive these debt or any financial aid because we’re international students\n\n3) Except for the bigger companies, most companies are against sponsoring so trust me you’re still at a better spot than any of us\n\nWe weren’t lucky to be born in a first world country so we had to leave everything behind to get where we want to be. You have no idea how lucky you are to be born as an American citizen. Everyone has their own struggles. So you either slog so you’re better at leetcode than the others or network enough so you can get these MSCS kids to help you. Do what you gotta do instead of complaining!",
            "The upper world belongs to cheaters.\n\nSad but true",
            "I don’t understand why you’re calling out international students. I’m an international student and I never cheat on coding interviews. I grind leetcode problems to the point that I don’t even have social life any more.",
            "Cheaters will be weeded out eventually. At my company you're not going to be kept if you can't consistently do good work and hit deadlines on your own.",
            " \n\nGET 20% OFF(CODE - FRIENDS20) - $15.92/$19.90\n\nCrack your Java or Spring Boot interviews by preparing important topics and mastering key concepts in a guided and structured way in a short time.\n\nGrokking the Java Interview: https://gumroad.com/a/1036063859/QqjGH\n\nGrokking the Spring Boot Interview: https://gumroad.com/a/1036063859/hrUXKY",
            "The fane is the game. We don't live in a meritocracy l, sometimes you fit to get dirty if you want to make it unfortunately.",
            "UB’s cs department almost got blacklisted for this very reason",
            "An honor code not getting you ahead. Some of those people might be hanging on by a thread and need to get a job before getting kicked out the country, missing rent/bills. Some are just plain cheaters who don’t give a fuck. Either way, it’s not for you to care, work harder",
            "Part of this is the way universities force the \"group\" concept of learning.  You may turn in your work individually, but they encourage everyone to work together in teams.   For my undergrad, all of my IT classes were like this.  For my Information Systems graduate degree, with my focus in Project Management, every class except for two were group projects.\n\nNow having said that, the reality in the workforce is that we don't have to memorize anything.  If we are not sure how to do something, we search on the internet.  The key there is knowing enough about what you are doing to be able to find the answer or the right direction to proceed.   The other reality in the workforce is we also can ask our co-workers for help.\n\nNow, considering all of that, if I were an interviewer and observed this behavior out of my candidates, I would not receive it poorly.  It shows they can work as a team to solve a problem.   They can learn technical skill on the job, but the soft skills like teamwork and effective communication is not something you can \"teach\".",
            "Than change the way you interview. Actually take the time to ask substantive questions rather than pick a question from some website.",
            "If you cheat, your job didn't know and your skill level never brought a problem, who is the victim here?\n\nIf the company is making money off of the employees work and he's working, who is exactly being hurt here?",
            "Wahhhh wahhhh",
            "🤷🏿‍♂️ that’s what happens when you ask pointless algorithm questions to filter people out for software engineering positions",
            "First, if you hard grind leetcode there is something wrong with you. \n\nSecondly please define what you mean by steal\n\nFinally, where did you get the information of international student stealing your jobs by cheating?",
            "Is researching/talking to peers really cheating when it comes to coding though? The reality of being a dev is, 99% of the time you're looking to solve a problem someone else likely already solved. That means googling/going on stackoverflow and trying to find code you can use. Why re-invent the wheel? Being a good dev means being able to sift through all of the answers and finding GOOD code, instead of some shitty hacky kludge a low-skilled dev wrote.\n\nThat's just how this industry is. It's also why opensource code is so important. We thrive on sharing knowledge. Trying to suppress this natural instinct in new developers based on some personal bias formed from entitlement or bitternesss (I refer to your \" we work so hard grinding leetcode and these people STEAL our jobs? \" comment) is just absurd.\n\nDo we really want future developers to be afraid to reach out for help when they enter the workforce?  \n\n\nThe hard reality is, if young students are \"stealing\" jobs from you, you're probably not as \"leet\" as you think you are.",
            "How can I partake in this? Lol",
            "Steve jobs",
            "Working smart",
            "Hate this so much! Well, they aren’t gonna be in those positions for too long unless they learn FAST",
            "it's high time only tech stack based hiring should be there, take home assignment etc, where in interview a candidate need to justify his/her code."
        ]
    },
    {
        "post_id": "1adyj17",
        "author": "alollosh1",
        "title": "I finally found out how students get straight A's, have GFs and have a social life while STILL having time to become jacked",
        "url": "https://www.reddit.com/r/csMajors/comments/1adyj17/i_finally_found_out_how_students_get_straight_as/",
        "score": 778,
        "num_comments": 163,
        "created_utc": 1706543645.0,
        "selftext": "Am kind of mad that I only realized this at the end of my Uni careerSo as a fellow biomedical engineering student I always wondered how these guys (I usually call them Sam) find the time to hit the gym. I always thought that it takes a million hours out of the day.Turns out that you can actually build muscle without spending a million hours in the gym and turns out that I was studying ineffectively so I wasted so much time studying.\n\nThis was until I realized a few things. I literally became an honors student while only studying like 10 hours for each subject the whole semester(other than HW) after realizing them\n\nThe first thing is that the gym doesnt have to take a lot of time. 3x per week each 45 minutes working out can build you a decent physique. and if you still think thats a lot of time, check your screen time.\n\nI even made something ive never seen in the fitness space before which is a huge mind map that has everything you need to know about the gym and has all the basic ideas of the gym. If anyone wants it they can comment or just send me a message\n\nThe second thing isactually focus when studying. Dont just look AT the slides. Actually think about them. Think about how each idea relates to the previous one. Be active.Most people dont do this because it is hard and takes a lot of effort, but if you do it, youre gonna save yourself so much time and get yourself so many marks  \n \n\nedit\n\nI made a video explaining the mindmap  \nthe mindmap is here i cant reply to all of u guys : [https://www.youtube.com/watch?v=6d6AznQfD2c](https://www.youtube.com/watch?v=6d6AznQfD2c)\n\nGood luck\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/1adyj17/i_finally_found_out_how_students_get_straight_as/",
        "comments": [
            "You forgot the gf and social life part?",
            "post physique",
            "[deleted]",
            "Breaking: time management allows you to multitask😲",
            "idk it ain’t that deep. Just boils down to being good with your time",
            "I don't have amazing grades(C's get degrees), but I do have a long term relationship, a new grad offer paying quite a lot for my area fully remote, I work out basically 7 days a week, and I like to go out on the weekend to clubs and bars.\n\n\nI don't see the point in dedicating 100% of my life just to get better grades, I wouldn't ever give up what I have now for straight A's.",
            "I agree, A+ students don't just stare at the slides, they think and dive deep, understand each question and every sentence. They solve questions without just looking at the solutions. \n\nAnd say you do that for 12 hours, that still leaves them with 4 hours to socialize, eat, and gym. The only people that have no time for anything is because they don't try to understand the topic deeply so they think it's never enough. Smart students try to understand what's being taught, dumb students try to memorize what's being taught.",
            "putting myself out there and getting friends and jobs has been the hardest part for me.",
            "The secret to workout is… \n\n100 situps, pushups, and squats followed by a 6.2-mile (10-km) run.",
            "The secret: having rich parents to pay your bills while you’re in school so you don’t have to work and thus have time to do all these things 🤣🤣🤣",
            "Im confused, why did he say \"as a fellow biomed engineering student\" when he posted this in the CS sub?",
            "pls do send the mindmap",
            "This post is stupid af remove it.",
            "Breaking: actually using your brain in school leads to higher grades",
            "[deleted]",
            "Woman FAANG EM here. I overhear many men speaking of never having a girlfriend during my career but it’s easy to tell by how they act. I am a powerlifter. Most men waste time on isolation workouts. Do compound lifts like\nBarbell squat, deadlift, bench press, and overhead press. 5x5 program with this is enough to see massive gains and only spend 30-40 minutes In the gym a few times a week. Biggest factor is most men in CS need a social life to improve their social awkwardness.",
            "**Yeah taking the time to understand the tasks at hand, actually goes a long way.**",
            "As a competitive powerlifter and CS majority is wild to me how many casuals think that people who have a good physique spend hours and hours a day in the gym.",
            "I used to be an athlete in high school. I did powerlifting, track, and football. I still am an athlete as I am an amateur boxer and I hit the gym somewhat consistently. Too bad I won’t be as  good at boxing because I really have to balance the time between CS school work, job hunting, and social life. \n\nIt’s really just a balance of all things and it’s kind of sad that you’ll have to sacrifice one or the other. No GF, good social life, 3.7 GPA, hearing back from jobs luckily, but i don’t really have that great workout schedule . \n\nIf you want to prioritize gains, then get in the gym and start a workout plan. Designate your muscle group splits, hit 4-5 days a week, 6-8 workouts per day, as long as you hit those muscle groups you set for that day equally. \n\nIf you want to focus on school, 3 days a week is still good enough for you to be active and fit. You won’t see insane gains and growth, but 3 days is still decent enough for you to tone and gain muscle :). \n\nLETS GET AFTER IT GANG",
            "Gym is pretty simple, only takes 30 min x 3 a week to look jacked I would say. But getting to and from the gym is probably the hardest and most costly part lol.\n\nGf and social life are missing, I never had those. Just muscles and straight As, except that B in Theory of Computing, F that course...\n\nI would still prioritize school over marks because transcripts are forever.\n\nHaving done a science and ed degree, CS is most definitely harder and more time consuming.",
            "Congrats, but how did it take you this long to realize this lmao.",
            "A lot of comments here miss the basic reason. 6 months on some basic steroids, and you'll be ahead of your competition for life. That's as long as you keep going to the gym to maintain muscle.\n\nYou can spend every day in the gym but the reality is it could take 3 years to get a decent look from natural lifting. You'll already be graduated.",
            "cringe",
            "Hi! I would appreciate it if you could send me the mind map! Thank you! I used to work out a ton when I had my sports coaches dictate my plan for me but now that I’m all by myself I haven’t been working out - I think the mind map would help a lot",
            "3x week 45 minutes is not enough",
            "ITT: OP shares their wisdom on a variety of topics\n\n>Getting jacked: go gym  \n>  \n>Getting grades: study  \n>  \n>Getting girls: ???\n\nOP did you come up with all this yourself or did you have help?",
            "Actually for both me and my GF (now wife, been a while since I studied) being in a relationship made us study much more efficiently. Trying to find a partner eats so much more time.\n\nAnd yeah, learning... I am no genius at all but I found many people had a much harder time learning. Distracted too easily, always needed study groups etc.\nI never had a real learning system or plan. Always studied alone and found other people to be a distraction. Mostly just grabbed those slides, turned off all distractions (like other people ;)) and read. Usually after the first time reading through them all I retained most of it. \nWhat I did notice is that I tend to read slower than others. I noticed much later how fast others (like my wife) go through fiction books.\nSo I analyzed my reading and found that I do read and visualize basically every single adjective, for example.\n\nBut then, some topics just vibe better with different kinds of people.\nI took a biochemistry class that everyone said would be so, so easy and some cheap credits. Probably learnt more for that one than most others, even bought books on the topic. Still ended up with a disappointing grade.\nAs the same time I did the exam for the distributed systems lecture in my first semester. All the study wikis said it's one of the toughest exams and plan at least a month of serious learning the Tanenbaum book.\nAnd yeah, it was a lot of material but in the end I also just went through the slides 2-3x and got an A... and became teaching assistant next semester. \n\nBut all in all, doesn't matter.\n I worked as dev 20-30h/week most of my university time so I didn't care too much about the whole university life and was pretty pragmatic about just getting my courses done and having fun doing so",
            "It is the same in the work place.\n\nWe have requirements gathering, design programming, testing and production as the stages of our development work. Fixing a bug/requirement problem is 10 times.mor expensive ( time wise) the further it gets in the development stage.\n\nSo, it's fun when you find out that some productive developers suck at coding, but   they spot potential  bugs right in the requirement gathering or design stages... And likewise some technically speaking great developers suck because they won't notice bugs until they byte their ass in production.\nin my experience , consistent bug inducing developers, are on the bottom quartile of programming skills, even the ones that are one standard deviation below average don't constantly introduce bugs in the code , moat.pf the bugs are bad specifications.",
            "send map? :)",
            " pls do send the mindmap",
            "Yeah but there will still be a people who can bench 200kg, get internships and have everything else you mentioned. How do you compare to them?",
            "hey, can you send me the mind map thing? great insights btw",
            "Not a single mention of word/text: gene lol some people are just built/made different not a single mention of that this make me doubtful of your biomedical engineering   \nOP learns effective studying and time management techniques first time in life but OP if you ever want to excel you need to grind against your genetic limit where your biomedical engineering would be extremely helpful",
            "I’m interested in your gym mind map if you would like to share. Can provide feedback",
            "Can you dm me the mind map thing?",
            "Workouts should ideally only take an hour or so. And you don't have to do it everyday.",
            "Nah he's just better than you, if it was this easy everyone would be doing it",
            "Link to the mind map?",
            "Lmao, your comment abt studying is actually the material in introductory slides of all my classes!",
            "me when I find out theres 24 hours in a day",
            "wtf is this you didn’t talk about half the title 😂😂😂",
            "45 mins 3 days a week is a bit disingenuous. You gotta also consider commute time, getting ready for the gym, meal prepping, studying about diet + weightlifting. It does feel like a part time job almost \n\n\nWhich makes me thing you've not actually done this fully due to the way you described it ",
            "Please consult the triad of college balance. Pick 2: Good grades, sleep, social life.",
            "lowkey the main thing is not needing to work while in school (usually by coming from a middle class+ family",
            "Would rly appreciate if u could send the gym mind map!",
            "How were studying then vs now, and how did you realize the previous way was inefficient?",
            "Those who did that great at my uni were just really smart. But most importantly, they had a large social network. They had help from other students to brief material, they always had shortcuts because they had friends who helped them. A genius who is on their own all the time and always have to carry will ofcourse perform worse than the genius who has a large social net.",
            "...And a fistful of Adderall.",
            "Bro discovered time management ",
            "Send it",
            "can I have it too bro",
            "Bro really out here giving a public speech about common sense:\n\n1. Guys check this out 3*45 minutes is barely any time\n\n2. And look! You actually have to study the materials!!!!\n\nThe f, bro?",
            "Lmao at the pro tip being “actually learn the material” \n\n\nI’m glad these are the people I’m competing against in the business landscape",
            "Send the map man.",
            "Can you send it to me?",
            "May I get the mind map, please?",
            "Mind map?",
            "Ima be real tho 3x a week 45min a day will get you results, but they wont be very significant compared to if u were training longer.",
            "&#x200B;\n\nI made a video explaining the mindmap  \nthe mindmap is here i cant reply to all of u guys : [https://www.youtube.com/watch?v=6d6AznQfD2c](https://www.youtube.com/watch?v=6d6AznQfD2c)\n\nGood luck",
            "Can i buy your course"
        ]
    },
    {
        "post_id": "k6n7wr",
        "author": "charles_atlas_12",
        "title": "124 summer internship application responses visualized. I'm a junior from a no-name college with no relevant experience in the field, but the turnout would surprise you.",
        "url": "https://www.reddit.com/r/csMajors/comments/k6n7wr/124_summer_internship_application_responses/",
        "score": 781,
        "num_comments": 84,
        "created_utc": 1607096517.0,
        "selftext": "https://imgur.com/hZ49FvE man fuck this job market how did no one even give me a chance bro one of the recruiters deadass called me and said \"sorry we thought you were someone else\" and hung up i cant believe this shit",
        "permalink": "/r/csMajors/comments/k6n7wr/124_summer_internship_application_responses/",
        "comments": [
            "I go to a school with a name in tech, and my results are about as similar as yours. Still though, I found it pretty funny, so thanks for making me laugh",
            "I applied to 193 places last year. 105 took the effort to reject me; most got a **C-**. The others went radio silent. I marked them with an **F** in my database for not making the most basic effort.",
            "I totally feel you fam the CS cycle is rough... But so many applications without even a coding challenge is probably indicative of a resume problem. Having been there myself, I've found that rewriting or revising your resume with a friend helps to freshen it up a lot.",
            "Not even one interview??",
            "This is why when people say 'school doesn't matter' I smh. It really does make a difference, especially when the market tightens.\n\nThere are internships out there, it's just being funneled to a small cohort with the 'best' credentials.",
            "no OA's?",
            "i have the same lol  \n\nI applied to 32 places last year. 2 took the effort to reject me; other 30 didnt answer me",
            "[deleted]",
            "Government CS jobs are easier from what I heard",
            "Applied to 60 places and got one offer , it be like that bro",
            "Someone called you?....Lucky",
            "124 applications is close to nothing. I am a senior at no name school with no experience got two offers after 500-800 applications (40% one-click apply / 60% long applications ). Keep trying!",
            "Yeah it’s a real battle for these internships. Gotta make connections and get a reference these days.",
            "Sophmore here, from a top 10 school, 4.0 GPA, have published a decent app and applied to 64 positions so far, the most I got was so far was OA for \"IT Consumer Intern \" for a tobacco company(Haven't heard back), and a few rejects(most of the rejects I wasn't qualified for anyways). I don't even know if I've been ghosted or the process is delayed due to COVID or some shit. I live in Canada, and I hear they start interviews a little later but nothing? Really?! Like who the fuck is getting these \"Student\" positions then?!! Just messes with your head u know?\n\n&#x200B;\n\nP.S: I've had my resume looked at by an SWE from google and a recruiter from Amazon for an event my school hosted, and they told me my resume is strong for a sophomore, so I really don't know anymore... :(",
            "Get used to it. I came across this thread on Google, I’m a professional engineer with most of a decade of experience and that chart looks like my most recent job search last year. It never gets better. \n\nThere’s a lot of competition for work at *every* level. You need to be the best and you need to *stay* the best. \n\nGood luck.",
            "Can't tell if this is a giant satire post or not",
            "Keep applying. I applied to 124 internships in 3 days.",
            "[deleted]",
            "RIP man sorry. Good luck.",
            "The worst thing is that, besides applying, I even sent out so many messages to recruiter, but none of them are replying me.",
            "Jesus I am sorry man. Did you at least got some OA invites?",
            "Bro the job market is awful right now. I feel you",
            "could i see your resume?",
            "Hmm, I thought the US was a better place to be a cs student. When I was a student, we had local companies coming to our class and basically fighting over interns. I applied to only 1 company and they also offered me a job after the internship (which I refused).\n\nI am in the EU.",
            "hey, they called, that's a start"
        ]
    },
    {
        "post_id": "l7a7mm",
        "author": "dragonejt",
        "title": "FAANG is no longer the ideal place to work. Now announcing BANG",
        "url": "https://www.reddit.com/r/csMajors/comments/l7a7mm/faang_is_no_longer_the_ideal_place_to_work_now/",
        "score": 772,
        "num_comments": 11,
        "created_utc": 1611871178.0,
        "selftext": "As we all know, FAANG is no longer the best companies to work at as a software engineer or other tech role. The actual new list of best places to work is BANG:\n\nB - BlackBerry\n\nA - AMC Entertainment Holdings\n\nN - Nokia\n\nG - GameStop\n\n&#x200B;\n\nThese  companies do not have many internship roles, but they definitely have full time software engineer and other tech roles. \n\nThanks for coming to my TED Talk.",
        "permalink": "/r/csMajors/comments/l7a7mm/faang_is_no_longer_the_ideal_place_to_work_now/",
        "comments": [
            "BONK\n\nB - BlackBerry\n\nO - Oh my god where did all this money come from\n\nN - Nokia\n\nK - Gamestop",
            "You forgot the D for Dogecoin ☝🏻",
            "NOK 🚀🚀🚀",
            "Nokia has a ton of internships, at least in canada anyway",
            "POWER TO THE PLAYERS 💪💪💪🚀🚀🚀🥜🥜🥜",
            "Blackberry has some awesome cyber internships especially in the west coast from when they acquired Cylance. They work on lots of research and new tools I would recommend interning there!",
            "Anyone worked at Reddit?",
            "😂😂😂😂😂🙈🙈🙈🙈",
            "Is \"Damond Hands\" an old meme yet?"
        ]
    },
    {
        "post_id": "wlaose",
        "author": "None",
        "title": "Anyone else not chasing after TC / FAANG, and just want a chill, simple, boring remote job with great work life balance?",
        "url": "https://www.reddit.com/r/csMajors/comments/wlaose/anyone_else_not_chasing_after_tc_faang_and_just/",
        "score": 780,
        "num_comments": 217,
        "created_utc": 1660170269.0,
        "selftext": "Title.",
        "permalink": "/r/csMajors/comments/wlaose/anyone_else_not_chasing_after_tc_faang_and_just/",
        "comments": [
            "Yea",
            "I can't say I'm chasing FAANG super hard, but the only reason I've ever been interested in FAANG is because having it on your resume makes getting a chill, simple, decent-paying WFH job easier to reach\n\nDo people actually care about FAANG for other reasons?",
            "I just want money, homie. To live without worrying if I can afford the decent things in life. So yeah, I'm not really chasing FAANG. Would it be cool to say I worked at Amazon, Microsoft, or Google? Sure, but I'm not gonna go out of my way to please them.. I'm just gonna do my best in school and whatever happens, happens.",
            "Nahh bro tc. I’m just tryna grind for a couple years then get out the rat race tbh",
            "Nope, just you and the million other people who make posts like this on here.",
            "kinda 50/50. I don't really care about FAANG but I am chasing TC so I can fund expensive hobbies so here I am",
            "If someone has a list of companies like this that’d be dope!",
            "Not sure what I'm chasing.  Probably not FAANG, but maybe one day. More TC would be nice.  WLB is important. WLB is decent enough in my present role, and I'm 95% remote, and its an overall decent/safe company. But I am sick of working in a tech stack that's made of frustration and mismanaged garbage.  Want to do something \"interesting\" and \"worth doing\".  Boring would be nice like 2 days a week, but I would get sick of that too I think.\n\nAlmost anything would be better than what I'm doing now. My role has shifted out of engineering, and into a rut of ops/support nonsense.  2 more semesters to go to finish out a CS/math minor.  Hoping that helps me get out of this rut.",
            "At a FAANG you can get a chill simple remote job with high TC, the false dichotomy is low paid programmer copium",
            "Kids nowadays chasing quant. FAANG for them is just a stepping stone.",
            "50/50! Want to have some experience there and have a chill life with my future wife and family in some good neighborhood",
            "why not all of that?",
            "Yea, I just want a chill job and not work 45 hours per week and waste hours studying",
            "I’m not chasing TC really, I do want Google for the accomplishment aspect and the interesting work with good WLB",
            "What's TC?",
            "No. I thought I was happy at my $120K job but after joining big tech, I basically feel set for life if I stay there for 4 years.\n\nI’m getting $400,000 in stock value over 4 years ($100K/year). If the stock goes back to normal since the recent market fall, it would be worth over $700K+. If the market stays steady, I still would have $400K in stock I can sell.",
            "Honestly I like the idea of FAANG/ high TC because you can have high salary and stock for a few years, then you can leave when you are comfortable enough with savings to start some sort of business or retire with investments. Its a great path to retiring early. \n\nHowever I don't really care if the high TC comes from a non-FAANG company either.",
            "Another cope thread",
            "I've been a single parent for my entire career (yay teen pregnancy). There's definitely a balance here. On one hand, yeah, getting off of work a 3pm everyday and being present with my daughter is worth way more than money. But, I also feel a need to make enough money that we are able to travel and she never hesitates to ask for extra curricular experiences. With the way cost of living has gone up and salaries have not... You almost have to chase the money for that \"minimum\" standard.",
            "Age 28, back at college for my second degree after teaching band for 5 years. My plan is to hustle hard to get good first job, hustle as hard as I can to increase TC, then once I have kids around 30 or 31 try and find a more chill job.",
            "Yeah not looking for FAANG, but looking for more R&D possibly through academia.",
            "I think not chasing after FAANG and wanting a chill job is becoming just as cliche as chasing FANG clout",
            "google is literally a chill, simple, boring remote job with great work life balance. y'all are just coping u can't get in",
            "Yep. Most non-FAANG jobs still pay significantly above average salaries, which most people would be able to very comfortably life off. It amazes me how people think you don’t make any money unless your base pay is greater than two hundred grand, lmao.",
            "Currently at a FAANG company and I've been contemplating this every few days",
            "FAANG jobs are often remote, boring, and good wlb. Please stop with the cope.",
            "No..   Stagnation is the enemy,  if you don't feel like you are improving and moving forward, it gets depressing.",
            "someone posts this every week and the “I’m not like other cs majors” circlejerk comes out. We need to create a pinned post for stuff like this",
            "Karma bait",
            "[deleted]",
            "As long as I have a good salary, nice coworkers, nice work/life balances, and nice healthcare/401k matching….\n\nI honestly dont care what company I work for. I am a simple man.",
            "That’s me. I went into cs for the remote option so I could live peaceful in the mountains. I don’t want to get married. I just want to raise some cats. I don’t even need the salary. I already have a good amount of wealth where money is no longer an issues.",
            "FAANG is overrated and treats their employees like shit.\n\nGoogle has no concern for what remote employees want, Amazon works you to the bone, and Meta is becoming a true evil of this world.\n\nWorking for a smaller tech company or even working in tech at a non-tech company is so much better. I work in tech at a company that is not in the tech industry and the pay is great, my boss is kind, my work is cool, and I get great benefits.\n\nSeriously, fuck FAANG.",
            "Yep, Work life balance at FAANG sucks, I'd rather do something I like doing for better balance instead of working at FAANG",
            "Unfortunately I enjoy flying which is a stupid expensive hobby so if I don’t want to be poor or forego investing towards my retirement I need something with a significant TC",
            "This is me....",
            "Idk about boring, but yes. Currently going after game dev which is not as hype as FAAANG and obviously pays nowhere near as much but oh well",
            "I want the latter but with good tc",
            "These two things are not mutually exclusive?",
            "I tried looking for FAANG but later realized they need people to work from office or hybrid model. Which is of no use for me. Now looking for remote jobs which gives me peace of mind 😁",
            "Yep, as long as I can work remote, mess with some side projects, and lift daily I’m happy",
            "The vast majority of people want and end up doing just that",
            "I want faang to have a chill simple boring job later in life. Earlier in your career is when you have the energy to deal with a more stressful job.",
            "FAANG OR BUST",
            "i'm up for build a good TC, some prestige and chill. but also want to learn new frameworks while chilling, if not it ain't fun\n\ndon't want to get stuck in some deadend language with deadend possibilities. PHP and react are not the same",
            "Just wondering how are you going to have a social life with a remote job? Most of my school/college friends went different cities.\n\nAt this age I don’t have kids \n\nSo work friends are mostly my friends",
            "80k. Work from home or not, idc. Gimme 80 for 5 years andnill buy and fix up 5 houses @ 40k each, then chill. 750 a month on 5 houses, after theyre paid off... sheeeeeeeit. \n\nIf you cant live off of that, you have some fucked up priorities.",
            "Kinda? I just want a job when I'm young that gives interesting work, and if they have free food, PTO, and WFH opportunities that's also a bonus for me.",
            "I think a good strategy is when you are young get into FAANG by grinding. Then chill and coast. You will be surprised how chill FAANG jobs really are, its the interview thats messed up.",
            "I’m in a remote full time internship rn. I get distracted way too easily and feel stuck at home, so I’ve realized I don’t want to be 100% remote. So unless you’ve already worked in a remote environment, I wouldn’t be set on it",
            "Yup and that's what I've been doing. Fully remote, make my own hours as I am an exempt salaried employee, and no one breathing down my neck. It's glorious.",
            "You're describing Google",
            "I have been there. I worked for FAANG companies. The money was great. The WLB was horrible!!! These companies throw RSU stock and bonuses your way so you will stay and you end up getting burned out. \n\nThis is the first time I have worked for a non FAANG company. I got promoted pretty quickly and my WLB is amazing. I do miss traveling internationally for work. I do not miss the late night phone calls from China or India because something broke. \n\nDo whatever makes you happy. :)",
            "You're the only one.  Search the subreddit history and you'll not find another post like yours.  Anywhere.",
            "It’s not an unpopular opinion, I live and die by a chill job with flexible hours and okay pay. Sure, I’m not on that 200k salary but I earn the same as other engineers I know who have to crunch 50 hour weeks for deadlines.",
            "No",
            "I care about FAANG+ because of Prestige",
            "Even that is very difficult to achieve",
            "Not interested in FAANG (or quant) but I don't want my job to be boring. I like R&D, I just don't want to support these companies.",
            "I just want a job after college that pays more then how much student loans I have that's all",
            "It's not mutually exclusive. You can and most likely will have better WLB with higher TC. The worst WLB I had was in agency paying like shit. I got 5 times more now and way better WLB",
            "Nuh, as a young guy I would hate to spend all my time at home. May be if I had a family that would be a bit different",
            "Yep",
            "I want a good work-life balance on-remote local job. I want to bike to work",
            "Yes, I do many others do, Don't count yourself out though statistically, the best time to get into FAANG is now it's way easier as students since we have more free time. the interviews aren't as hard as they would be too with more years of experience + other life circumstances going on when you're older.",
            "West/Northern European FAANG offices: In my experience good TC (less than US though obviously), amazing (and I really do mean amazing, as in literally best of the world) work life balance.",
            "Yup",
            "It’s all chill until ur  faang bro  buys a Tesla",
            "I don’t even know what to expect for jobs through this sub. I don’t want to be a “software engineer”. I just want to build websites for clients, from home, on my own time, and make 8-10k a month. A simple life.",
            "I'm killing myself for FAANG money so I can buy myself out of capitalism and spend the rest of my life gardening and cooking\n\nif I get bored then, maybe I'll find a job like that, but I think I'd rather be running a sawmill or something",
            "Doesn’t even have to be remote for me man\n\nAs long as I’m paid 60k min, with benefits. I’ll chill and ride that shit for a few years lol",
            "someone mentioned already European based companies are super chill. I LOVED my time at SAP. But the platform/LoB was terrible to work with.",
            "I want somewhere that stimulates my problem solving/intellect. \n\nI can't imagine sitting at a job where I don't do anything, if I'm not growing whats the point?",
            "Just graduated and got that. 90k comp in low-mid COL. Hybrid but I only go to office once a month. This is the life man. 6 weeks pro too!",
            "Building stock equity young, especially at these prices now, can set you up nicely 5-10 years from now. ESPP & RSU will do that. Looking back, I got a job offer and a house down payment at my first tech company.",
            "yeah but bc im not smart enough to get hired lmao",
            "What's TC",
            "I thought that’s all I wanted, but the hedonic treadmill lol",
            "literally. i’m not even that smart like a lot of the people on this sub but i don’t think it’s hard to find a laid back job that pays decent.",
            "Yes.",
            "This is all I want.",
            "Pay me good, me no care. Just need a comfortable lif.e",
            "If this is what you are looking for, look into IT support. It pays a lot more than I thought and there are stretches of hours where you do nothing.",
            "I want to grind for a few years then around late 20s early 30s get this job",
            "Maybe, but it opens many many many doors to get a job/internship so it would make your chances of getting an interview increase by many multipliers.",
            "Yeh LFG! = “Hello World!”"
        ]
    },
    {
        "post_id": "qwzi0d",
        "author": "JonGOATJones",
        "title": "Shat my pants during Amazon Final",
        "url": "https://www.reddit.com/r/csMajors/comments/qwzi0d/shat_my_pants_during_amazon_final/",
        "score": 776,
        "num_comments": 47,
        "created_utc": 1637269250.0,
        "selftext": "Asked interviewer if I could use toilet and they said no. Got a LC hard and decided to do it there and then. Do you think I’ll get the offer?",
        "permalink": "/r/csMajors/comments/qwzi0d/shat_my_pants_during_amazon_final/",
        "comments": [
            "[deleted]",
            "Cool shitpost",
            "if it was LC hard, you could have held it, to be honest. LC soft or LC liquid would be acceptable.",
            "You delivered results, that's all that matters.",
            "💀",
            "At least you can order a toilet roll on amazon now.",
            "Sounds like a classic example of Bias for Action. Good job!",
            "Such an alpha move. Asserting dominance.",
            "I love this sub lmfaoo",
            "It depends. Did you use it as an opportunity to solve [“Maximize Distance to Closest Person”](https://leetcode.com/problems/maximize-distance-to-closest-person/solution/)? If so you took advantage of the situation and gave interviewer real life advice based on a real world situation and it should help you for sure.",
            "nice bias for action",
            "This might be off-topic but how was the smell?",
            "Good, now eat more 🍌s",
            "What I strive to be",
            "They got what they deserved.",
            "Nothing compared to how much Bezos shits on the general public!",
            "Yes",
            "Perfect match! Amazon is also a shithole.",
            "That’s such a confusing post.",
            "I never apply amazon because of the fear of getting wrecked but I might now lol.",
            "Yes",
            "Ayo wtf bruh",
            "Impressive to say the least hahah",
            "What",
            "Don't bring shit to the shitpost",
            "I came here thinking it was a metaphor",
            "Wow, you went all the way! All I did was piss in the interviewer's trashcan on my way out",
            "you showed initiative, so yes"
        ]
    }
]