[
    {
        "post_id": "lvi09f",
        "author": "None",
        "title": "How To Find Internship As A 6th Grader?",
        "url": "https://www.reddit.com/r/csMajors/comments/lvi09f/how_to_find_internship_as_a_6th_grader/",
        "score": 771,
        "num_comments": 71,
        "created_utc": 1614626847.0,
        "selftext": "Hi guys! This is my first time on the Reddit website. I have a question about computers and hope you guys can help me. So I am a 6th grader in middle school and one day want to work at the big company Google. I know it is very hard but I can work very hard. I want to get an internship this summer so I can be ready when I am in college and have experience. Do you guys think I should do leetcode now or wait till high school? Thank you!",
        "permalink": "/r/csMajors/comments/lvi09f/how_to_find_internship_as_a_6th_grader/",
        "comments": [
            "I'm surprised you're still even doing middle school, I did a middleschool bootcamp in just three months and paid a fraction of the cost.",
            "I think you’re already behind. If you don’t have 4 internships by now, you should probably switch fields because you’ll never get anywhere.",
            "You’re fucked dude. Too little, too late. Maybe work on some side projects, leetcode, and get internships before grade school in your next life. \n\nI guess you might still have a shot at going to amazon if you start now, but going there is career suicide compared to staying unemployed.",
            "Youre behind on the curve! Talk to your computer or science teacher and get one ASAP. It might be too late :(",
            "Amazon",
            "This is the future 🥴",
            "You are 4 years late my man. You need to work really hard to catch up. Do at least 8 leetcode questions a day starting today.",
            "Create the next Facebook and maybe you'll have a chance",
            "I am not sure if this is serious or not but if it is, enjoy your life! maybe do some coding online but you are way ahead of the game no rush have fun in school",
            "I can’t tell if this is a joke post or not. But in the event that it isn’t I’d suggest doing a coding summer camp or a summer class at a local college. You can also participate in Google’s Summer of Code. I did coding camps over the summer as a 7th and 8th grader and took a class over the summer after my freshman year of high school. I didn’t have my first cs internship until after my sophomore year of college and I’m interning at a big company this upcoming summer. Bottom line: do something that will allow you to learn coding but is also really fun. You only have one childhood don’t stress too much about the future. You will be plenty stressed when hit adulthood.",
            "Awesome....so you should probably go play with your friends, get a dog, do sports, and eat snacks! Have fun!",
            "I would be very surprised if someone offered an internship at any point in middle school (not only because you probably don’t have enough experience yet, but minor labor laws are complicated in some places, if you are even old enough). \n\nThat being said, keep working on all kinds of little and maybe medium sized projects, they’ll be very valuable to you as you learn and you can show them off as independent experience from a young age. Companies want someone who is highly motivated and thinking about internships now is a very good sign. \n\nLeetcode may be a bit much for you right now, but no one is stopping you, so just try your hand at it. Finding any activities outside of school that deal in computer science and programming like Robotics is also a good place to get started on real world programming and application of your ideas. Good luck in your school career!",
            "I was about to comment, just to be nice, that most places can’t even hire someone under 18 (a problem we’ve actually had with interns)\n\n...and then I read the comments. Oh thank God.",
            "Bro ur behind. It is better for u to drop CS and find another career.",
            "Dumb child go study algorithm and data structure especially the heaps",
            "At that age, I had already interned twice at Google. You are bit late but nothing is over yet.",
            "What the fuck",
            "bruh what? I'm a sophomore and I don't have one... I should be embarrassed",
            "Boy enjoy your teenage years while you have them you don't want to spend your teenage years doing leetcode",
            "Bro fuck off 😂\n\nThis shit is too funny",
            "You probably won't find an internship at this age. Maybe some small local company would hire you, but it's very very unlikely. Think about it: would you rather hire a college kid or a 6th grader?\n\nTo be honest with you: just enjoy your life, dude. Everything is still ahead of you. If you really want to get experience, try to build your own product (mobile app, website, whatever). My cousin built an app in 9th grade that earned him more than $100K, which is much better than any internship. Also, try to explore other interesting things like math and physics.",
            "Get a bible, lay in bed, start praying. You don't have a chance kid",
            "The real question is, are you smarter than a 5th grader?",
            "6th grade? 4 years too late lil homie, I've been grinding Leetcode since I was 8.",
            "You’re not doing leetcode already??",
            "Kid go out and hang out with your friends you got time. Enjoy your childhood while it lasts.",
            "get some hobbies outside of cs. this is pathetic. go live your life while you can",
            "Oh you beautiful soul",
            "Sir, this is the unemployment line.",
            "I think you're a bit late , by now you should've atleast 3 full blown startups or I don't I don't think that there's a chance for you at Google .",
            "sorry but, you should have started coding in the womb. if you can’t do operating systems by now, u should probably just switch to business. just my advice tho!",
            "Ok ,other than a lot of smart people who have been giving you very smart advice I have had 4 internships before I finish college. I graduate this semester as an engineer. Now I really like your ambition but here are some facts that are going to make this impossible:\n1. You can do as much leetcode as you want, however there are some topics like data structures and algorithms, dynamic programming, intro to ML etc etc that are asked in coding interviews. For you to be able to understand the theory behind these concepts you need base of higher calc, higher linear algebra and discrete math. End of story, you need it. CS is applied math in some colleges. \n2. Forget Amazon. I am probably equally as ambitious as you are, just to let you know that, I was invited by the US govt in my 9th grade to visit and take courses at NASA, Huntsville Alabama. Talking about internships, companies see you as a FT employee. They would NEVER spend 4-7k a month in someone, for who it will take 10 years to graduate. They rather hire an UG for the same role. Pay him 4-7k, and then hire him after he graduates. Rather than waiting for you. \n3. The computers won’t let you in, the screening algorithms will pull you out of line the moment you apply. Why? Because ALL the application in tech companies require you to be atleast masters, even the contract positions. \n4. Say you get internship after covid, in Seattle. Will you be willing to move there ? Will you drive to work? \nI am not saying it’s impossible, it is not. But understand over here you are not fighting for the one requisition. You are fighting against the way professional world works. For you to gain attention, go to a hackathon organized by google, Amazon , IBM and get ranked 1. That’s what would matter. Your brain needs to be developed to understand all the CS math. So start when you get in high school. \nI am not trying to push you down here, I am so happy students like you exists. I am just trying to show you the reality. Also ignore these idiots who are being sarcastic. Probably doing museum  sciences at some college.",
            "Almost a year later. You motherfucker 🥇"
        ]
    },
    {
        "post_id": "qgk2s8",
        "author": "None",
        "title": "To Answer This Sub’s Most Commonly Asked Questions",
        "url": "https://www.reddit.com/r/csMajors/comments/qgk2s8/to_answer_this_subs_most_commonly_asked_questions/",
        "score": 765,
        "num_comments": 77,
        "created_utc": 1635293861.0,
        "selftext": "No, your internship or job offer mostly likely will NOT be rescinded if you fail a test (or even a class). \n\nNo, doing grad school won’t *significantly* increase your starting salary, especially in terms of opportunity cost. Do grad school if you’re genuinely interested, and can afford it (if it’s a non-thesis based masters), OR you want to do a niche field (machine learning etc). \n\nYes, this sub is not representative of most CS majors. \n\nYes, this sub is biased towards Big N. \n\nYes, school name matters, but you can still get an internship / job offer at the big N from a non target school. Work hard and you’ll be fine. \n\nYes, your data engineering, business intelligence, data science or related internships can help with future software engineering opportunities. \n\nYes, GPA matters for *some* companies (usually banks, HFTs, defense / anything government.) Leave it off your resume if it’s below 3.5; most big tech companies won’t ask for it or your transcripts. \n\nYes, you can still get a SWE / SDE internship as a math, physics, or engineering major. \n\nNo, double majoring is almost always NOT worth it. \n\nNo, you don’t have to do SDE / SWE full time if you hate coding. Other high paying tech jobs you can get with a CS degree include: product management, DevOps/Cloud/SRE, and sales engineering. \n\nYes, Amazon is still a FAANG company. \n\nNo, you weren’t rejected because Amazon didn’t respond to you immediately after you submitted your internship application. \n\nNo, you weren’t rejected because Microsoft didn’t respond to you immediately after you submitted your internship application. \n\nNo, not getting a response after a day is not ghosting. \n\nYes, alert your recruiter of competing offers. \n\nPlease feel free to drop below any more answers!",
        "permalink": "/r/csMajors/comments/qgk2s8/to_answer_this_subs_most_commonly_asked_questions/",
        "comments": [
            "This post should be pinned at the top r/csMajors",
            "Nobody other than your interviewer knows if you failed or passed the interview, just move on after it’s done",
            "a 3.5 gpa is pretty high. I thought you only left it off it was under 3.0?",
            "BA vs BS isn't significant",
            "[deleted]",
            "[deleted]",
            "I think a question a lot of people I have talked to have is about the usefulness of doing research when applying for software engineering jobs, which I honestly can’t say I have an answer to",
            "Just failed a discrete math test but knew the material. How sad should I be ?",
            " Do grad school if you’re genuinely interested, and can afford it (if it’s a non-thesis based masters), OR you want to do a niche field (machine learning etc). \n\nWhy if it’s a non-thesis based masters(just curious) I’m doing a fast track at my school (work on grad classes during undergrad for no extra cost) and we have the option of a 2 semester project and a 3 semester thesis and I haven’t decided what I would like to do",
            "[deleted]",
            "I met a lot of recruiters at Google during my internship and I was told that the name, phone number, school (anything that indicates gender, race, country you’re from or could be an unfair advantage) gets censored when they take a look at your CV and make their choice regardless. I don’t think the school thing is true, at least for G.",
            "Thank you for taking time to write this!!",
            "McDonald’s is part of faang \nAmazon is tier 3",
            "Is Facebook still a FAANG company?",
            "what about the question: 2nd Bachelor or bridge (conversion) master ??",
            "Which are the Big N schools?",
            "Pin",
            "I joined college this year as an undergraduate engineering student with cs as major. I know a bit of coding in java. Any suggestions on how to increase my capabilities going forward and what should I learn next would be greatly appreciated.",
            "So if i fail a class and don’t graduate, I can still accept the offer?",
            "The only people who say they work at \"faang\" are amazon people",
            "Don’t you tell me my double major isn’t worth it. \n\n:( it is to me!",
            "Please don’t spread misconception :\nDevOps/Cloud/SRE - You still need to code. And this is mostly problem, when people opt in as this position as they hate coding. Your growth will be stagnant, companies want people who are good coders (not like top level) but also know systems as DevOps/Cloud, same with SREs.",
            "How long after I submit my internship application should I assume that I was ghosted? lol.",
            "Why is double majoring not worth it?",
            "Is it wasteful to pursue a language minor if I’m genuinely interested in learning the language/ working in the country,"
        ]
    },
    {
        "post_id": "18if8xf",
        "author": "vrainsfan",
        "title": "Applied to company twice with different emails and got scheduled with the same interviewer",
        "url": "https://www.reddit.com/r/csMajors/comments/18if8xf/applied_to_company_twice_with_different_emails/",
        "score": 762,
        "num_comments": 93,
        "created_utc": 1702578745.0,
        "selftext": "I applied to a software engineering internship at a large company back in August and had a virtual onsite with 3 interviewers in September. I got rejected, but thought I would apply again a couple weeks ago just to see what would happen. Surprisingly, I got and passed the first round interview, and I'm scheduled for a virtual onsite tomorrow. They just sent me the names of my interviewers, and one of them is the same as last time. \n\nI'm worried that he'll recognize me or my resume, and I'm wondering if I should try and reschedule the interview in the hopes that I'll be assigned someone different?\n\n\nUpdate:\nI rescheduled the interview in the hopes that they’ll reroll the interviewers. Even if they don’t I’m still gonna take the interview and see what happens. ",
        "permalink": "/r/csMajors/comments/18if8xf/applied_to_company_twice_with_different_emails/",
        "comments": [
            "following, please update me on this disaster",
            "gaslight the interviewer",
            "this has to be citadel. and if it is, this geeks😭😭",
            "Reschedule and they might put u with someone else lol",
            "We goin bald 👨‍🦲",
            "Go in with a totally different hairstyle and oversized glasses if you don’t wear any already",
            "pretend you're sick and have a sore throat. speak sickly but normal ig",
            "Part of me doesn't see the problem. Clearly your resume is a good candidate for this company. If it was as easy as changing the email, I can only imagine the other things you can bypass...",
            "Interesting",
            "Cancel this one. Apply again as a girl and put on a wig. See what happens.",
            "Wear a mustache and dye your hair",
            "your twin sibling applied to the same company? wild!",
            "They don’t care. I had 2 interviews with the same interviewer (applied with different emails) and still got an offer",
            "Just say you have a twin brother/sister if they ask.",
            "Might be fine if the internship is for a different job ID posting and 3 months have passed.",
            "3 months is not a bad time to reappear for interview.",
            "Lmfao citadel does this on purpose all the time",
            "If it was me, I'd probably recognize the voice and/or face, look at the resume, and put 2 and 2 together. \n\nYou should've been honest and never have done this.",
            "Don't listen to the people trying to stress you out. There's a chance the guy won't even notice, and if he does, there's a large chance he either A: won't care enough to say anything or B: will assume the company knew what they were doing. Even if he does say something this is more on the hiring department than you, they might even not care and let you finish. No point in stressing about it",
            "Whats wrong with trying again? It shows you have grit. Go for it and if it comes up just tell em why you applied again (you want the internship!).",
            "Act oblivious. If they mention it, act surprised. How will they actually know you noticed?",
            "During intros tell them you interviewed before, they have multiple internships and people come who applied earlier. No big deal.",
            "i’ll bet anything this is citadel",
            "Going bald my dude. Change your voice. Wear glasses.",
            "Update pls",
            "Are you applying for the same position and team as before? It’s possible that they are looking for something different this time. If that is not the case you could pretend you thought that it was.",
            "Most application systems pick up different emails with same name.  It really is on the company.  Go and relax.  Or bail.  You don’t lose either way.",
            "Gaslight king, need to secure the bag somehow haha",
            "An on site panel interview means that the odds are high that at least one panelist will be from the original interview, even if you reschedule.   \n\n\nWe're going to need an update when this terrible idea blows up in your face.",
            "This is the main reason why I faithfully follow this subreddit. These stories make my day. Please keep us posted!",
            "Tell them it wasn't you, it was Patricia.\n\nBut seriously though, I hope your interviewer has short-term memory loss like Dory so you get the internship. Keep us posted, OP!",
            "I think this is a situation where you say nothing unless asked.  I would get some glasses at least. 😂",
            "Definitely buzz cut the hair lmao",
            "If they don’t mention ”no double dipping” in the job post I think you’ll be fine",
            "I don’t get it, why can’t you do it again? You’re not lying just changing your email.. whats the problem?",
            "Wear one of those disguise glasses with the big nose and mustache for one of them problem solved",
            "please don't forget to update",
            "Change the pitch of your microphone and run your video feed through various filters and say the webcam was damaged recently. Set up [something](https://jagt.github.io/clumsy/index.html) to degrade your network in case you need to avoid answering a question that identifies you.",
            "This is hilarious but I can feel the pain. You just need to owe up and rescind your application. Let's say you pass the online rounds and have to be on site - someone could easily recognise you in person and get suspicious. The risk here is being fully barred from the company, which could impact you today or 20 years down the line.",
            "Wondering if you got the same recruiter?",
            "Please give us updates, willing to do that for my next wave in January",
            "Gotta wear a party city mustache",
            "This is very easy to solve. \n\nJust say nothing, and if they ask you, just say that you submitted your resume again because you love that company and you’re really motivated to gain experience at their shop. \n\nIf you sound enthusiastic, they’ll believe you, and you might instantly become a stand out candidate. \n\nTake your situation and make it an opportunity",
            "Hahaha following",
            "Go on the first and do your best to get hired then if you got hired , confess that you're also the other interviewee",
            "Change Your resume, wear different style of clothes, change color of hair, add glasses and beard/cut beard.\n\nNo normal person would recognize.",
            "Op any updates?",
            "[deleted]",
            "what the hell is a \"virtual onsite\""
        ]
    },
    {
        "post_id": "1bugpq6",
        "author": "Smart-Win7260",
        "title": "Struggling to get a job has impacted all my relationships",
        "url": "https://www.reddit.com/r/csMajors/comments/1bugpq6/struggling_to_get_a_job_has_impacted_all_my/",
        "score": 760,
        "num_comments": 128,
        "created_utc": 1712109452.0,
        "selftext": "I am a 21 yo girl who is studying CS in EU and have been struggling to find an internship for more than a year now. And that has affected me and the people around me so much. \n\nI am at a very bad place right now. I am only getting up to study for my exams and go to classes because, I know I would be majorly fucked up if I didn’t and I do have dreams and hope for my master. \n\nI do apply to a few jobs everyday, email people, but have gotten 2 interviews so far and have been rejected. I don’t know what to do, how to improve myself. I am so lost. Everyone at Uni is moving forward, I don’t know how, they’re the people I hang out with at uni, they just don’t tell me things. \n\nI have a good GPA, it’s almost straight As. That doesn’t help, there’s always better candidates and profiles. I have been ignored, ghosted, rejected for a year. Still continuing to do so. I have applied to tech roles and research roles yet nothing. \n\nI stopped my contact with my family back home, they don’t understand. Every time we talk, they tell me that it will be fine, or I should have stayed back home, or joke about it. It is so draining. I am not okay. \n\nMy older sister who was also a CS major, and has a job and lives in a more stable EU country has totally turned her back on me. It has been 4 months since we talked. And whenever I text, she’s super formal, almost like a stranger. \n\nI don’t have any really friends, people that I know outside unis are privileged people (not in cs). I can’t keep hearing about their love affairs when I am mentally and financially struggling and don’t know who to talk with or go to. \n\nI was such a great and ambitious kid. I don’t know why I turned into such a waste. I feel pathetic. I am so broken. I failed myself. I don’t know where to go. My time management sucks. Honestly I don’t know what to do.\n\nI grew up poor, I must escape the loop. I am scared. \n\nI have even gone to a few places near my accommodation to ask for a normal job. They’re not hiring. ",
        "permalink": "/r/csMajors/comments/1bugpq6/struggling_to_get_a_job_has_impacted_all_my/",
        "comments": [
            "The \"getting a job\" side solution is to keep applying and build projects or whatever.\nThe \"relationship\" side solution is to calm down, realize your entire self worth does not revolve around if you get a job right now, try to fix things with your family, and go and build/rebuild long lasting relationships.\n\nAt the very least, look at comp sci career fairs, go there for the sole purpose of making friends. Not so you can find a job, but just to improve your mental. That way your building relationships while also helping your job search\n\nAlso, look into therapy If you think you need it.",
            "You’re more than a CS student. You need to take care of yourself.\n\nI feel you when you say you grew up poor and need to escape the loop but you slaving away isn’t going to accomplish that. You need to try to keep in contact with your family as they’re the people who will still be there if all else fails. \n\nI believe in you. You got this.",
            "YOU ARE JUST 21 ‼️ Life is just starting for you. Just have some hope. \n\nYou talk very poorly of yourself, change that and be more nice to yourself. Getting almost straight A’s in school is not an easy job and you’re doing it! \nJob market is just crappy right now, so don’t bring this down on yourself. \n\nI’m a girl in CS and I relate to a lot of the things you mentioned. It’s definitely hard out there!\n\nLmk if you’re down to be my friend and support each other through this!🫶🏽😊",
            "Its not you. The tech job market is shit. Don't beat yourself up over it.\n\nIf you can't find internships go on freelancer sites like upwork and do whatever you can. Build a portfolio of projects. That's going to pad your resume.",
            "Take it from a cs girl who was in the same shoes as you, still am tbh. Whatever you are feeling, it won't go away after you get an internship. \nThe only difference between us is that I got selected in my 2nd interview. \nAnd it has changed nothing. I still have constant anxiety, stress and this feeling of worthlessness that no matter what I do, it's never gonna be good enough.",
            "work on side projects and try to become a research assistant for a cs professor, grades aren’t everything",
            "1) No shame in working a retail or gig job in the meantime, the EU is facing it harder than the conditions in the US and they are not any better here\n\n2) You have bigger problems outside of just getting a job, I would say your current mindset of endless despair isn't going to help you, maybe this is a feedback loop from not getting an internship, maybe it's from outside factors or depression, but you should look to seek help. Your family is absolutely right it will be okay, your sister ghosting you is really sad but people get jobs without internships, CS majors don't need to go into SWE and government jobs are a great tool if you're looking for something to get your foot into",
            "If you are having difficult securing a CS job, try applying for any entry level at a big company with a significant IT department.  Once you have that job it will be easier to move into a more preferred job within the company.\n\nWhat about your University?  With your good grades, could you get a job there?",
            "Hey mate. Good to see new people in CS. \n\nI can’t provide a magic solution, the workforce is fucked for me right now as well in Australia, what I can say is if you’re looking for tech nerd friends then I’m always open for it. :p\n\nFor the work issue? You’re 21, the workforce is scuffed. I’m not at all surprised. It’s so difficult to break into a company at the stage that a lot of people are starting their own home business in consultancy, tech repair, or simply going freelance simply because it’s easier. \nYou might try the same, I can’t say. \n\nFor the relationship though? Your value isn’t defined by money at all. Men get that expectation and even then it’s a bullshit one. The value of an individual is WHO you are, not what you can do or bring to the table, If anyone tries to tell you otherwise they can fuck the fuck off. \nJust be your best true self, unburdened by societal demands, that’s the person that’s fun to be around. I should know, I spent too long trying to be what society expects of me and it hurt those around me. \n\nWe’re here for you, CS nerds have to stick together.",
            "If you know php you can dabble into Moodle Development, it's a good niche for universities and some companies",
            "Side projects are key. Interviewers have never asked me about my classwork",
            "This might seem harsh but you're the problem. I've been there, pushing away all friends and family, I've also escaped from poverty and was focused way too hard on success. \nGo to therapy or if you can't, go to the gym and get out of your own head. None of your As matter as much if you're not in a good place mentally. I truly wish you well, but the only person that can really help you is You. Stop thinking so much.",
            "Damn, I wish I was 21 still, I'm 31 barely in university for cs, you have so much time jesus",
            "There are lots of other options other than internships, be it doing a startup with a friend, or a research project with a professor, or simply an IT Help Desk part time job to help get the ball rolling and your foot in the door",
            "Dw keep your dreams. Not giving up is a trait.",
            "Minor setbacks for a Major Comeback. Keep fighting, you got this…",
            "Whoa whoa I think you should take a breather. You will find something soon don’t worry. Seems like you enjoy the field and work hard at it, the rest will follow. I didn’t even start uni til 24. Working in CS now and it’s awesome. Relax!☺️",
            "holy, first of all you have accomplished a lot more than you think. Getting a high gpa and majoring in cs are two very big accomplishments. Pat yourself on the back. getting a job is a matter of luck + practice. I have been in your shoes, just recently getting an internship. It took me 400+ apps and a lot of leetcoding (neetcode 150) to finally get one. You have to calm down and just take it one step at a time. You will get a job sooner or later. Just keep working towards it and don't compare yourself to your sister or anyone else. The job market is also in a bad place right now and it's way tougher than it used to be. I also have been ghosted/ rejected a ton after going to t20 cs school. It takes time, practice, luck, and skill. Trust me, you have what it takes and you will get to where you want to go. Don't be stuck in doom mode, it's not gonna help anybody, especially you. Praying for you, you got this!",
            "I think genuine relationships with people, be they family or friends, get built during times like yours. You're still young, and you're learning how harsh life can be and how precious real friendships are. \n\nAs far as loneliness is concerned, don't let it dictate the future relationships you'll build. If hanging out with the \"privileged folks\" does not make you happy, prefer being alone. Look for like-minded folks you can connect with (it is a super uncomfortable process yes, but worth it in the end).\n\nIn times like these, self-care is super important. Your health is your main asset.\n\nAs far as the job search is concerned, the market is tough as many pointed out. What is certain, however, is that if you consistently keep growing skills and demonstrating them (through your guthub portfolio, conference papers...) over time, it will pay off!\n\nLast, be honest and demanding with yourself. Learn how to network, put yourself out there and show the world that you can deliver good code on your own (extra points if you do it collaborating with people).\n\nWishing you good health and good luck!",
            "Your are ridiculously young",
            "You sound borderline depressed and that is something that is something those places are not looking for (they can smell the self-esteem problems).\n\nThree things you can do right now.\n\nFirst, start learning about soft-skills: [https://www.linkedin.com/learning/paths/career-essentials-in-soft-skills](https://www.linkedin.com/learning/paths/career-essentials-in-soft-skills) Resilience, embracing unexpected change... you can rewrite your history. HR is nowadays waiting for you to market yourself in a totally different way.\n\nSecond, you network. It should be key. Instead of putting people aside you should keep them near specially your sister and people at Uni that already found something. They will learn sooner about openings or they will just tell you things that are needed in their jobs in normal conversations. Go to events, talk to more people. Don't push, just keep human relations. Keeping your family and those people appart is the opposite from what you should do. Specially your family.\n\nThird, there is usually a lot of options to keep learning for free these days, so do it. It is not just about applying daily but applying smartly. What are those places looking that I am not? Adapt your CV and look those words you don't know. If they ask for Jira, learn Jira. If they ask for Spring, learn Spring. There is some disconnection nowadays between the contents that you see at Uni and what tools are used in real jobs so do that work for yourself while you find something.",
            "I’m a CS major in the Bay Area of the US and from my experience as a non-traditional student it can be difficult to break into the tech sector. I feel like it’s very scattering when a CS degree requires a large amount of your attention yet when you go to apply for jobs they are looking for candidates who have firmly polished projects that indicate industry experience. And let’s face it, the projects we get in undergrad usually have a lot of scaffolding because they’re built to educate you. Long story short, it’s a hard game to play in tech versus an industry like, for example, law where what you are learning is much more easily transmissible into an employment opportunity (“just look at my good grades” => “oh you might be a good lawyer”).\n\nAs a 26M, I feel like the pressure to succeed on people in our generation is massive given increased cost of living and a desire to make enough money to live “the dream.” It is hard, and life is hard but from my experience it helps to just focus on the present by working hard on things you can achieve but also enjoying your life. Idk the answer, maybe I’m talking to myself in all this, but I wish you the best of luck!",
            "It is really not your fault at ALL!! Stop blaming and chastising yourself for no good reason!!!\n\nIt is the job market and it’s not getting better for now\n\nU might have to change fields \nU might have to go for studying in a different field of study similar like anything else but software engineering \nSoftware is getting too competitive and complicated \nYou are still very young and the job requires work experience \n\n\nThis job market is now considered saturated and you are working against artificial intelligence too… meaning you are competing with robots and humans \n\nThe rest of the majors are being affected too not just software but for now u need to start thinking of other options \n\nI was a former software engineer with more than a decade of work experience… I will probably also be your competition too\n\nIt’s really hard in todays market \n\nPlease stay safe and healthy and positive…\n\nU don’t have to keep stressing on just software , u need to think broadly like different fields altogether \n\nRetrain and relearn it’s ok!!!\n\nU can do this !!",
            "You don’t need relationships if your goal is to find a job. Don’t think about relationships at the moment. Focus on what really matters to you.",
            "People need to educated that CS is no longer a magic bullet take them out of poverty and lost of life , but nursing is , job guaranteed",
            "Try to join a research lab at your college",
            "What stack and also have you explored freelance and sidegigs, I'm also in the EU and it's tough getting a job, but I've been working on freelance on the side and it helps with the bills,  you might want to try out some platform jobs like Shopify and Airtable Development, some companies look for those, pending you get on your feet.\n\nThe feeling can be demoralizing but you have to keep trying each day, networking with people helps, joining community groups and searching for jobs from recruitment posts. \n\nWish you all the best",
            "Don't worry too much. Try applying for a phd program in the US if you can't find a job at EU",
            "I think the market is pretty terrible right now, its all come down to numbers game and keep grinding leet codes I think",
            "I feel you, you are not alone",
            "Don’t belittle yourself. You are much than you portray yourself. Student life for an immigrant is always hard. However, I always followed the rule “Rejections/failures are part of life, if something isn’t in your control you can’t do anything about it” during my student time in Germany. Put your head down and keep hustling, you will be there soon. \n\nYou go girl💪",
            "I think your primary issue may be not enough applications submitted. How many applications have you submitted in the past year? if I were you I would apply to at least 50 positions every week. Right now, it's normal to get rejected by 95-99% of jobs that you apply to. That is just how it is for everyone, it doesn't mean that you are not capable. I think you should also try to talk with your family. If you can ask them to talk to you in a way that is more helpful regarding your job search, that would be good. If you can't convince them to change that, you can talk about other things and tell them that you don't wish to discuss that. But not speaking to your family is usually a bad move. It also seems that your mental health is poor. If there are some things that you can do every day to improve your mood, you should do that. You know yourself best. Try not to think about this problem constantly but put work into solving it (high number of applications every day) and let that be enough. Good luck.",
            "Feel u too much I am 17! And I feel worthless, everyone and everything is soo competitive 😭",
            "Keep ya head up kid. Check out a song called Colors by Crossfade and check in with me later",
            "I think speaking to a career Councillor or therapist would really help you deal with your situation. Does your uni offer anything? Sorry to hear what you are going through I've been there",
            "I am 24, I was in the same boat as you. Have you tried applying in other EU countries? I would also recommend studying another language besides english in case that's your mother tongue. Personally, I study german and it helps opening up a lot of opportunities.",
            "1. Do you speak local language? If not you have to be pretty good for them to take you \n2. You speak of studying for classes but do you actually build projects? They look at what you can build with language they need, not if you have As for theoretical classes\n3. Depending om a country you don't need internships to land a job. I feel like it's more US thing",
            "Are you indian",
            "Kindly share your resume so we can help. Also, try to pass any cloud certifications (AWS solution Architect associate or databricks etc) and internship will be easy peasy!",
            "Bruh you are studying in the EU with a high gpa. That’s ridiculous for my country’s standards already. \n\n- coming from a third world country that doesn’t care about education. \n\nSeriously tho,\nKeep grinding and networking trust me you will get there.",
            "Let's see a resume if you need some help, there's plenty of people with connections on this sub.",
            "DM me if you're interested in some advice, I'm there myself (21yo..) But I'm getting along lately.I've been making some progress.",
            "wtf you are 21?????",
            "The job market in the EU sucks. You might want to try a remote for either US or another country. I currently live in the UK but work for an Australian company.\n\nGrades beyond a certain point don't really matter. They are just the qualifier. What you need are connections, which if you grew up poor, are hard to come by (was in the same situation). What you need are projects that get you seen (e.g. Open source). No, not another to do app but something people will actually use. You might need to get lucky on this as it's quite hard to tell what will blow up and what wouldn't. Timing and understanding SEO also helps to make sure your project shows up when people search for it. Best case is impressing a developer and having them advocate to the company to hire you.\n\n  \nTotally feel you on the social aspect. Probably not healthy but during uni, I completely cut off the social stuff. It was infuriating seeing people drink and party every day knowing that if they fail, they have rich parents to back them up.",
            "I dropped a message in your DMs. I am mentor in Women In Tech initiative in my country as well as in career boost program. If you want I can try help you search for something",
            "Your are just 21. Simply slow down and get your live back.\n\nThe job market is a bit oversaturated right now. Thus, just concentrate on studying, friends and family",
            "When people think of CS jobs, they think of SWE. However, there are other jobs out there that aren't even considered by most CS majors.\n\nOne profession in particular is Data Center Technician. It relies on a very basic understanding of the Internet, and the work itself is very menial. However, in my experience (6 months now) the work environment, the people, and the pay (most of the time) is worth it all. \n\nRight now, I am work as a contractor on W2 at various data centers, but my goal is to eventually be hired on full-time.",
            "Im 24 and in the same boat, hope things will work out for you",
            "I am so sorry to hear this ! I absolutely feel you , as the youngest of the family , you find yourself so alone in this fight to have a better career, but what we fail to realize is that not everyone has it easy. I used to be you , until I hassled. I was saying oh I have a CS major I should not work in a restaurant, bla bla bla , but hat’s how you make a network.  I started working  in a cafe , after nearly 6 months of work , not only that I helped my self financially , made friends but my colleagues gave me a wonderful reference letter and recommendations for my current job , they also used to introduce me to old people had businesses and used to come to cafe everyday morning. I spoke to them , serve them in the cafe saying this young lady is Ms. Computer the customers love it and some of them even  asked me to visit them and now I have a job and so many other options in the line , just don’t stop, don’t look at people , look at you , where you were and what you need to do .everyone has their own battle we don’t know. \n\nHope this helps ❤️🌸 xxx",
            "Don’t consider a CS job as your only option. You can work in a Cafe or bar for a while, learn things and meet people.",
            "Ask a professor whose work you are interested in if you can do some research with them. It will help you get started for your masters and give you something to do. If it’s a professor you took classes with and did well, that’s your resume right there. The CS job market is bad right now but most departments have a spot or two for high achieving students to do research.",
            "Like a lot of people who are replying here, I was in the same shoes as a 21 year old. That was actually the worst time of my life, studying in a city away from family with no real friends. I felt completely alone and hence placed my self worth on academic and was depressed because I couldn’t find a relevant part-time job. I am now 26 yo, only 5 years and a lot have changed for the better.\n\n I didn’t managed to find any relevant job until I graduated my Bachelor at 23. My first paid internship was with a lecturer who I did my bachelor thesis with. She was impressed with what I did during the thesis so she agreed on a paid internship when I asked for it. So the best advice I could give is to work on a thesis/project with either a company or a research group. This will probably be unpaid because then it’s easier to get it. And once you have your foot in the door, give it everything you’ve got to impress the people there. Then ask for a paid position afterwards. \n\nBut like everyone has already mentioned here, you also gotta work on improving your self-esteem and get some genuine connections with people, either friends or family. I signed up for a group competition in CS in order to improve my CV and ended up being great friends with my team. We are still in contact now and they have been through thick and thin with me. It was unexpected but having friends genuinely improved my mental state so much. \n\nPlease take care of yourself, and your family is right, things will be fine in the future.",
            "If you are in/near Poland, apply for companies there, a lot of them are hiring and offer internships.",
            "You guys are getting interviews?\n\n![gif](giphy|DOPKHQg6oFWUg)",
            "Talk to a therapist",
            "If you're interested I'd be happy to review your CV, help you write letters and actually might be able to connect you with some people (12 years in IT).",
            "I work for a tech company that's always looking to add new talent. Send me your resume in my DMs and I'll see what we can do :)",
            "I will only say that 21 is so young. when I was 21 I felt like my life was already a failure, but now I'm 26 and realise that things can improve for better in just a few years if you don't give up.",
            "Though times don’t last, though people do",
            "trade crypto...make some cash",
            "As a fellow 21, all I can say is , you are not a waste, you are not pathetic, nor are you a failure. It might feel like the end of the world. And yes nothing is going right. But it's not all your fault. Maybe some part but still you are doing your best now. Shit happens all the time, there are good days and there are bad days. But at the end whichever day it is , it just passes. So don't hate yourself. It will be alright.",
            "Not getting a job hasn't impacted all your relationships. \n\nYou putting your self worth into getting a job has impacted all your relationships because you've voluntarily decided that you're not worthy of them bc you don't have a job.\n\nThis is not a problem that will be solved by getting a job. You'll continue to put your self worth into this single facet of your life unless you consciously change that.\n\n>I don’t know why I turned into such a waste. I feel pathetic. I am so broken. I failed myself. I don’t know where to go. My time management sucks. Honestly I don’t know what to do.\n\nThis mentality is completely useless.You are only 21, look at the cs economy you need to keep trying and eventually you will find something. You are not a failure or broken just bc you can't get a job fast enough.\n\nJob searching is more about resume structuring and being confident about the solutions you present in an interview and fitting with the company culture it's literally got nothing to do with how \"worthy\" you are",
            "I broke up with my girlfriend during Apple 💀 we got back together but LOL I was losing my shit",
            "If your university has a career center, they might be able to help you brush up on job interviewing as well as your resume/CV.\n\nIf that service exists at your university, you pay for it and might as well use it.",
            "Hey! If it helps with anything, in The Netherlands, Almelo, there is a company called ZT Systems, where you could have a chance for a good paying job in a server factory. You can apply through indeed (4minutes or Europlanit agencies), finding housing is hell though. Maybe it helps!   \nedit: they are accepting just about anybody while production is ramping up, I suggest applying for \"quality control technician\", having a CS background helps.",
            "Sounds like me, except I have the same feeling since 2017",
            "Your sister's a dick.\n\nYou have a whole life and career ahead of you - the tech sector is suffering at this time. Try to get research internships or work with profs/get a Master's/get a PhD. It's going to be a difficult few years still.  \nGood luck!",
            "Please I know how easy it is to freak out about this but please trust that you are on the path that you need to take. \n\nDon't forget the value of building personal projects and networking with faculty while you're at school. Look into research positions at your university that will take place over the summer. This will help with both filling in the holes on your resume as well as with your application to graduate school. \n\nGood luck and take care",
            "I graduated and can’t find a job. It sounds like you are a better student then I ever was. I think if you keep putting in the work, everything will be okay\n\nI’m sorry that you are going through this though. It’s really rough out here",
            "Relate 💯 \nGoing through the same thing rn. But I am hopeful as long as I put in the effort it's going to pay off. Also I am nearly 30. So I am going to say. You have time my child.\nYou just need 1 win. The other 100 L's dont matter. \nPush on.",
            "Just focus on the degree.  Internships are tough right now.  The job market will be tough for another 3 years.  Get your degree, if you need money take a service job, you are playing the long game.  It took my until 28 to get on track, now I have worked at half of FAANG++.",
            "You're doing great, you have good grades, so I assume you're doing well with your studies, and just think that this part is where most people (me included when I was studying) struggles the most.\n\nIf you need some professionist to speak about your situation, most EU universities have free psychologists that help students, so you could book an appointment with one of them, perhaps someone like that to talk to about your problems could be helpful.\n\nRegarding the interviews for the interships, don't give up, maybe try to go for smaller companies, as they should have less candidates, but **it's just ok to fail**. At some point we all get rejected, to land my first job I had to go through several applications/interviews and most of them didn't even call me back. Don't give up and be sure that at some point you'll find someone who'll decide to invest in you (I don't see why not, from what I'm reading you're doing great with your studies). \n\nAlso it could help to see some tutorial on how to create a good resume and how to make a great impression on your interviews (I know it seems a completely dumb stuff, but trust me, this helped me a lot).\n\nRegarding the financial problems there should also be scholarships that tend to help students with financial problems, try to ask your university if there's something like that.\n\nTry to not see yourself as a failure, because you're not, you've got plenty of time and resources to make things right. A guy I knew in uni, had some financial problems, he stopped studying for a couple of years, then get back at it, completed his bachelor and now he's working for an international company. \n\nSo consider that there are many solutions, we tend to be perfectionists, but perfection is the farthest thing from reality, sometimes we have to surrender the idea that we're superhumans. We're not, we have, flaws, weak moments, we see ourselves as failures sometimes, or just life hit us hard. But it's normal, just don't give up on your dreams and don't lose your persistence, try to solve one problem at a time (divide-and-conquer approach ;) ) and try to get back on your feet, I'm sure once you'll find the way to fix the situation right now you can reach heights you can't even imagine.",
            "TLDR: You've got to bump those numbers up WAY higher. I passed the 1 year mark unemployed in finance. All my interviews are coming from America now ever since I exhausted all my options in Toronto. I've applied to thousands of jobs. You sound like a smart girl but remember this is a numbers game. There are plenty of people just like you if not better. Keep trying.",
            "Hey take a moment and just breathe, and forget about an internship or a job for a while. Trust me I’m on your same boat just breathe and work on some projects, make yourself remember why you chose this path by working on something you enjoy maybe? Spend some time with your family you’ll be ok",
            "Interesting, I have the same problem with girls",
            "Hey let me tell you that when I was in undergrad, it was incredibly hard to get an internship even in the US (2016). I obtained my internship opportunity through networking heavily. I failed many interviews as well but I never gave up on practicing coding questions. Back then leetcode was only a startup. There were very little resources. Girl, you gotta keep on practicing coding questions and keep talking to people in your class and people more senior than you. I would have missed the Amazon mass OA if not for my friends in college. That gave me a job lasted 5 years and 6 figure straight out of college.",
            "As a senior programmer, I’ve been where you are now mentally when I was in undergrad just like you, and I also grew up poor. \n\nThings will get better. It’s just the market and not you. \n\nPractical advice: \n\nI would work on open source. Either your own projects or  existing ones. It can supplement a cv. Think of it as your time for freedom to create what interests you. When you have a job, that goes away unless you’re lucky. \n\nFind non-programming office jobs that could benefit from automation, like places that churn out a lot of manual spreadsheets. Your boss will love you and you can also build experience.",
            "Your OLDER sister got a job because she applied before you, before the job market has gone to complete shit. No one’s hiring for entry level positions, and people are fighting for a crumb of offers for senior positions too after all the layoffs.",
            "Any advice for those in the same situation,  but aged 24🫠",
            "I feel you girl! I am in the same situation, except I am looking for jobs",
            "I think your problem is lacking self-confidence, get some project done and get your confidence upright, and you will get a job",
            "Just keep doing it and don't lose hope.\nOne more thing, don't ever start an OnlyFans please, you seem to be very intelligent and diligent both, you're made for humanity's betterment not genitalia satisfaction.",
            "do OF for some side income to stay afloat until you can secure a CS job",
            "its seems that you waste all your effort in your GPA, GPA is useless compare to side projects and experience focus on side project and experience no one gives shit about your GPA its 2024 not 2004",
            "Skill issue",
            "Have you tried getting more passion"
        ]
    },
    {
        "post_id": "1cjb9lf",
        "author": "PR3SIS3",
        "title": "I definitely got lucky",
        "url": "https://www.reddit.com/r/csMajors/comments/1cjb9lf/i_definitely_got_lucky/",
        "score": 755,
        "num_comments": 166,
        "created_utc": 1714749576.0,
        "selftext": "I got a Faang internship and I start Monday, no prior tech work experience, just projects. And I definitely thought I failed the interview 💀 I applied to about 40-60 places, got waitlisted once, and got 2 offers. Idk how I got it ngl. ",
        "permalink": "/r/csMajors/comments/1cjb9lf/i_definitely_got_lucky/",
        "comments": [
            "Congratulations!\n\nTop university?",
            "Two questions:   \n1. what projects did you create?   \n2. If those projects aren't awesome projects, which relative of yours is an executive? \n\nSecond question is obviously a joke. Congrats on your big win! Would really be curious to hear what your projects were.",
            "congrats. if ur a rising senior make sure to get dat full time return offer",
            "Congrats! It was likely more than luck.",
            "Congratulations!!! Can you share your resume? I'm in my 2nd year, did one internship in college but it wasn't related to the tech field. I would appreciate any tips you could give!",
            "so cool! and interesting......\n\n\ncs is broad so shoqing which languages you are ready to be put to yhe test about is an interesting thing, quite risky is any less (and for a cs student the curriculum throws a bunch more)\nI'm curious though, how did you decide what yo include and what not to include in your resume?\n\ncongrats again! I am honestly amazed how stfaightforward and simple resume is, but of course that is just one of the things that matteted and the rest were up to you, congrats yet again!",
            "Congrats on Amazon!",
            "Imo getting ur resume looked at is luck but everything after that you deserve all the credit for",
            "Congrats OP! I would like to know more about the interview process. also, how did you apply?",
            "I feel you, bagged one myself for this Summer. Feels good to be a student again and focus more on the curriculum and not damn leetcode.",
            "congrats on amazon",
            "May I be the only soul here to address the elephant in the room? Are you an URM, OP?",
            "Welcome to Amazon",
            "Congratulations bro.",
            "The squeaky wheel gets the grease. Half the battle in life is just showing up. I’ve been showing up since 1998 and just never left. I love what I do, I hope you do to!!! Congratulations 🎈🎊🍾🎉",
            "Chat can I get some Ws for my guy here?\n\nOP may I ask when did you apply? How long was the process?",
            "[deleted]",
            "Congratulations man! Are you an international student?",
            "nah bro don’t think like that congrats proud of u",
            "Nice to hear your from ga state, I goto a near by hbcu and had terrible recruiting year, till I got an offer from a finance firm. 2 offers and one being from a Faang is amazing! Good luck on your journey!",
            "drop the resume‼️",
            "What year are you?",
            "Congratulations which year of college you r in.how did u apply online which site looking one for my kid.",
            "I saw supervisor at 16 and management at 17 with the rising senior and thought how tf do they have this portfolio and the real-estate agent/sales person too made me so behind. When did you start learning and when did you start building your portfolio?",
            "Did you get a referral? Do you have a lot of connections on your LinkedIn page? Maybe connections to other people at faang?",
            "Homie me too, it’s not a FAANG but I definitely thought I bottled the interview lol but I’m starting in a couple weeks with no prior experience or any real projects. Feeling really lucky these days",
            "What internship role did you apply for?",
            "is the salary for an amazon internship consistent with the ones online",
            "Brother don’t discount yourself. You are a naturally charismatic person and my idol 😍",
            "do you remember when exactly did you apply for this and when did you hear back from them",
            "dont fail us now young padawan",
            "For people who are questioning what they're doing wrong, no fault to the OP but fwiw amazon is not a rigorous company to get despite it being faang.\n\nThey hire almost 10,000 interns a year (like over 5x the amount of other faang) and have a very random and easy interview process \n\nI'm also at zon and I didn't get a leetcode question at all and got the offer lol.\n\nSo you can be more qualified, but still no offer. It's just kinda random",
            "You just applied? No cold emails? No recruiters?  No referral? No connections?",
            "Congratulations 🎉🎉🎉",
            "Here I'm also building projects. And doing competitive programming, problem solving, problem analysis. I should try following you.",
            "Awesome(hard and unique projects?)\n\nAnd congrats give yourself more credit",
            "Amazon?",
            "Stop the 🧢",
            "wait whats your position in FAANG?\n\ncoz if you are working as delivery person or customer representative at Amazon, then its not what exactly a job people are talking about here",
            "amazon?",
            "I randomly got recommended this subreddit but I have to say y’all sound like the most toxic group of bitter copium ever no wonder companies aren’t hiring you. OP’s responses show maturity and tact which go far in the corporate environment where you just code buttons anyway",
            "congrats on amazon",
            "congrats! You're probably a reasonable person and your projects looked good. I'm still learning so I'm wondering what your projects are.",
            "I think I’ve made a total of 4 applications so far with 5 offers. It really matters in location as I’m not in FAANG ( no interest in working for tech bro overlords who will lay me off in a year, as ironic as it might be that I got laid off recently )",
            "Biggggg Congrats😂don’t let them hate on you for being an URM!!!!! I feel I had the same luck/grace in sophomore year and made it through with a RO.\n\nYou got the job and that’s on period!\nHave a great summer, grind,kiss ass for that RO but enjoy the helll outta yourself with that big bucks!!!",
            "What color and gender are you?",
            "I'm going to guess you satisfy one more DEI criteria?"
        ]
    },
    {
        "post_id": "1bspryl",
        "author": "jibberjabber37",
        "title": "11k applicants for a 20/hr internship?",
        "url": "https://i.redd.it/awewnlmvirrc1.jpeg",
        "score": 756,
        "num_comments": 112,
        "created_utc": 1711931363.0,
        "selftext": "Is the market really this bad? ",
        "permalink": "/r/csMajors/comments/1bspryl/11k_applicants_for_a_20hr_internship/",
        "comments": [
            "Director level 😭",
            "Easy Apply job listing, not surprised",
            "Yup, it’s legit 11 k applicants. Doesn’t mean they’re all qualified tho",
            "50 year old director making 800k be like \"20/hr sounds like a great career move\" 😂",
            "These “Remote United States” jobs are the issue. You need to look at jobs in certain cities. Those remote jobs are flooded with international applicants who have degrees from random ass colleges that don’t compare in the slightest to US colleges and they have no chance at getting the job.",
            "Mostly international applicants. If you're a US citizen it's bad but you still have a chance. Internationals have no chance in this market",
            "This is basically the Tinder effect. Unless you are very good looking, the min-max strategy for guys on Tinder is to swipe right on everything because their hit rate is so low. Swipe right on 100 girls and maybe you get one or two real responses. There is no point in reading profiles or looking at pictures before swiping right, just look at the one match at the end of the day and decide if you like her or not.\n\nA lot of people just hit apply on all jobs that have \"software\" in the job title (just look at the number of senior level \"applicants\" to this internship). No point in reading the description. Doesn't matter if it is in the wrong country and you can't actually work there. If they contact you back, then you read the job description and decide if you want to move forward or not.\n\nMuch like how dating apps haven't made it easier to date for most people, all these jobs apps/networks and \"Easy Apply\" things haven't made it easier for employees or employers. Nobody can sort through 10k+ resumes. And if they actually do and find a few good candidates, those candidates don't actually want the job after they actually read the description. Meanwhile, someone who really wants the job gets lost in the pile of 10k resumes.",
            "Something is wrong with that data...\n\nSo, not a single person without a degree applied? Not one? Everyone has a degree of some sort, even if it's 'other'.\n\nI don't believe that for one second. There's always going to be at least a few people who try their luck.\n\nI know that the 'other' group probably includes non-degree holders, but that's also a problem. Because it mislabels them.\n\nMy conclusion, is that that that data is about as reliable as this statement,\n\n\"98.83% of applicants are goats with phenomenal typing skills (and a degree)\".",
            "Linkedin should instantly remove all entries of international students for postings that clearly say they are not taking international/offering H1B. \n\nAlso Easy Apply is filled with random entries because of how simple the steps are they always have tons of more applications than anything external especially applications that have questions.",
            "11k applications and people wonder why companies use AI to weed through the applications.",
            "I call utter bullsht, director level applying for an internship ,,,,, fuck off",
            "Half of these people don’t even know what a function or a variable is.",
            "I've come across unpaid positions with that many applicants",
            "probably google ceo applied",
            "50% has a bachelor degree, another 25% wont be in CS, another 1/2 will be from India, so thats about  < 3000 legitimate applicants after trivial filtering",
            "meanwhile 3rd worlder laughs in 1/hr",
            "Of course it’s all sunshine over there per this sub who told everyone to get out of their basement to look at job market.\n\n/s",
            "90% of them are gonna get thrown out immediately",
            "Kintsugi is top tier firm I took it over meta",
            "What the fuck is this",
            "Many of these could be bots. Since clicking apply may take it as a \"candidate\" but oftentimes there are still other procedures to actually apply",
            "People trying to get sponsored visas make about 70% of that amount",
            "I've seen several recruiters reveal that a majority of them don't qualify because of citizenship, lack of experience, and don't live anywhere close.",
            "Desperate times.",
            "I mean, this is similar to the company I work for and  I’m part of the hiring team as I have a CS degree. You have to remember not all people qualify and how easy it is to click the quick apply button. Additionally, for the people saying “oh senior level, manager level, and director level. Welp.” We often see senior people who have been terminated from a previous job or had a different career and decided to go into CS now. Not excusing this, but trying to provide additional context",
            "104 director level???",
            "Linkedin applicant tracking is trash. I applied to a job at Oracle the other day where LinkedIn told me over 100 people applied. The posting actually had an applicant counter that I'm more inclined to trust. That one told me the real number of applicants was <10",
            "False numbers. No seniors are going to take a $20/hr job in their own industry you can make that at Starbucks",
            "What percent of these are Indians?",
            "The amount of senior (and above) level people who have applied for an intern position is insane.",
            "[deleted]"
        ]
    },
    {
        "post_id": "1ajvbam",
        "author": "Dazzling-Rooster2103",
        "title": "What is the worst/meanest/most degrading comment you have seen on here. This is mine.",
        "url": "https://i.redd.it/hxm8mavjrugc1.jpeg",
        "score": 755,
        "num_comments": 103,
        "created_utc": 1707176382.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ajvbam/what_is_the_worstmeanestmost_degrading_comment/",
        "comments": [
            "Lol, so out of touch hahahaha",
            "Buddy thinks he’s Mark Zuckerburg",
            "71k supremacy",
            "That’s the stupidest shit",
            "No need to hide the name.",
            "70 k is like 12 k more than the national average lol",
            "Ahahaha fuck some of you college students are in for a real shock when you graduate and have to accept roles at 50-60k like a whole lot of other job markets.",
            "Bro is probably still a high schooler lmao",
            "Bro’s gonna be going home to his empty $5k/month apartment every night wondering why he’s not surrounded by supermodels.",
            "I mean working from bed is a vibe so he was low key spitting \n\nFor 70K work from bed, none of that in person shit.",
            "These arrogant mfs are usually the first ones to get laid off or fired. Everyone on their team hates them.",
            "That use to be me, before I got humbled by the job market.",
            "This person has never struggled a day in their life. 🙄\n\nAlso, never mind rude comments like that. I've had people (not here) tell me I'd never get anywhere in life because I value work/life balance or call me \"anti-work\" because I put work second to my loved ones (never mind I do work; it's just not my life). If you're living well and you're happy with your life, that's all that matters. There will always be people with nothing kind to say.",
            "My friend got flamed for getting a degree from wgu like 4 years ago and someone said he wouldn’t go far with a degree from a standard 4 year college. Out of all of his friends that disapprove of his degree only him and like 2 of them are still employed. \n\nATM he makes like 90k in MCOL hybrid, he works remote 3 days a week. \n\nHe was going to try and jump to a bigger company and he’s been grinding leetcode and practicing for the interview process but with the way the economy is going he’s gonna wait a bit.",
            "It’s not a flashy salary but it does the trick",
            "Go on Blind, they call people making <200k “poor”",
            "in this economy that’s pretty much the bare minimum you need to live comfortably",
            "Tbf there are some CS majors that are so goated (not me) that this opinion is justifiable to them. They still completely lack empathy and are out of touch.",
            "I agree with that comment why am I in tech for 70k",
            "Bruh in this market i'll work for free until I can prove to them I am good enough 😭",
            "My first job was 65k. It was more money than I’ve seen in my life at the time. I could finally pay off my student loans and credit cards after searching for a year out of college. After two years, I bounced and was able to double that pay. Experience is more important than grades or school after you get your foot in the door.",
            "Really depends on where you are. Idk about \"not get out of bed\" in this economy, but I'd certainly have to be desperate with no other potential offers if this was in the bay.",
            "said the person with 71k salary",
            "thats real asf",
            "cause we in this to get rich bitch $$$$$$",
            "My 2nd job in IT doubled my salary from $8/hr to $16/hr a few months out of college.\n\nA comment I got from a senior coworker on my 1st day:  \"You moved here for this!?\"\n\nI was the lowest paid in the dept for 5 years and earned every scant raise and promotion. I will never forget him.",
            "The participation trophy generation is coming into the work force. People are taking “know your worth” to mean you’re worth more than you actually are."
        ]
    },
    {
        "post_id": "r4iv7b",
        "author": "tangbaijuyi",
        "title": "Why didn't Sang Woo just get a job at FAANG or HFT?",
        "url": "https://www.reddit.com/r/csMajors/comments/r4iv7b/why_didnt_sang_woo_just_get_a_job_at_faang_or_hft/",
        "score": 754,
        "num_comments": 26,
        "created_utc": 1638146157.0,
        "selftext": "He only owed 5 million dollars. He could just get a job as a Quant at Jane Street and work a few years there. After that, he could FIRE.",
        "permalink": "/r/csMajors/comments/r4iv7b/why_didnt_sang_woo_just_get_a_job_at_faang_or_hft/",
        "comments": [
            "he didn't grind enough leetcode",
            "Knowing his habits at the time he would’ve gambled away the first check lmfao",
            "[deleted]",
            "Can we just make a circlejerk sub or is this already the circle jerk sub",
            "Cuz he didn’t use Algo Expert",
            "Too bad FAANG didn't know that Sang Woo graduated top of his class at SNU. They would've been begging to hire him",
            "He got PIPED and lost all motivation );",
            "His kidney was due next month, he did not have a few years.",
            "Wasn’t Sang Woo he guy who got fucked buying futures? \n\nI don’t think that’s the best candidate for JS 💀\n\nBut then again he was new grad from SNU",
            "[deleted]",
            "Who’s sang woo and why he is so indebted?",
            "He failed the FizzBuzz problem.",
            "SMU has a very poor DS&A curriculum, he wouldn't have been able to solve an LC Easy.",
            "Wow...it took me a second to see the crossover to this subreddit! :D",
            "Who is Sang Woo"
        ]
    },
    {
        "post_id": "wfcmqe",
        "author": "sybehr17",
        "title": "Netflix is now taking interns and new grads with an emphasis on software engineering. Valuable information and tips can be found in the links below.",
        "url": "https://www.reddit.com/r/csMajors/comments/wfcmqe/netflix_is_now_taking_interns_and_new_grads_with/",
        "score": 754,
        "num_comments": 79,
        "created_utc": 1659547781.0,
        "selftext": "[For Interns](https://jobs.netflix.com/intern-program)\n\n[For New Grads](https://jobs.netflix.com/new-grad-program)",
        "permalink": "/r/csMajors/comments/wfcmqe/netflix_is_now_taking_interns_and_new_grads_with/",
        "comments": [
            "Cant wait to get my ass handed to me in these interviews",
            "Was an intern, and am a new grad. AMA.  \n\n\nThe first official internship program was summer last year. New grad program started in the fall last year.   \n\n\nThe website is just official now.",
            "Within US:( y'all are lucky af. Well, good luck.",
            "The take home is probably gonna ruin a lot of nights",
            "Nothing in Canada or are they opening more later?",
            "damn i’m curious how the intern interviews will be.",
            "Have they posted opening for new grad?",
            "a glimmer of hope in a sea of companies freezing/rescinding new grad hiring during this recession.",
            "Sorry for asking, but are the new grad openings up?",
            "Is it remote?",
            "What kind of things or keywords could catch their eye on a resume?",
            "Puts on Netflix",
            "there doesn't seem to be any internships open..?",
            "Not seeing any job postings.",
            "You would be dumb to think Netflix is a sustainable company to work at when the tech bubble is bursting.",
            "Has anyone done data science interviews with them?",
            "Just in time for me to not be a new grad haha"
        ]
    },
    {
        "post_id": "180thox",
        "author": "lilacandflowers",
        "title": "my summer 2024 internship hunt summarized",
        "url": "https://i.redd.it/0xeq1m8z1s1c1.png",
        "score": 755,
        "num_comments": 98,
        "created_utc": 1700605749.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/180thox/my_summer_2024_internship_hunt_summarized/",
        "comments": [
            "what did u have on your resume? what type of project?",
            "Bro is Sam Altman",
            "Bro is the 1%",
            "Crazy cause I've sent out 100 applications and have never done an OA before actually being screened or speaking with someone.",
            "you do leetcode?",
            "Congrats, off-topic, how do you really choose a project? or is it from college and you just improved it?",
            "Are you international student?",
            "Wow 7 offers. Congrats!!!!!!!",
            "6/96,bro seems post from 2018",
            "brotha you go to cornell. this isn’t applicable to the average experience. next.",
            "Are you a junior?",
            "Man, it’s brutal looking at what you guys are going through on the CS subreddits. I just secured my accounting internship at a big 4 and had only like ~6 applications sent out and got 3 interviews, and accepted my first offer before even having to attend the other 2.\n\nDon’t get me wrong, I’m well aware many of you guys will go off to companies that make a big 4 look like peanuts (and make hell of a lot more). \n\nBut fuck me, 13 interviews sounds like hell. Let alone the guys that go through that gauntlet and then don’t even get an offer.",
            "Elon musk",
            "Numbers Game",
            "absolutely insane offer rate per application, have you heard of overemployed?",
            "Shouldn't you have stopped the graph at 7 offers? Imagine my surprise when you accepted one and only one of them.",
            "What does OA mean?",
            "Affirmative action",
            "Yo I am sure you are mad fine 7 offers 😍😍😍",
            "Should've accepted the others and never show up",
            "What software did you use to creat that chart? And how did you track all the application?",
            "AIESEC？",
            "are the timeline the same? like did you reject the 6 offers when you decided you will take an offer? quite crazy imo, while I am not in US and not a student, in my country it is hard to get everything on the same timeline and the most valid offers I had at any given time is 2...",
            "How did you do this graph? I'm thinking doing one myself to analyze my journey too 🤣",
            "Dude congrats on the offers! May I ask what year you are?",
            "yo girlie congrats!!! \nare you okay with me dming you about sum related to the offers?",
            "That’s pretty good. For my current job I had twice as many applications, about the same number of OAs and interviews, but only 2 offers (technically three because one got back to me months into my job starting being like oh we had budget problems are you still looking for a job",
            "How are y’all making these diagrams?",
            "Nerds",
            "7 offers and I haven’t heard back once"
        ]
    }
]