[
    {
        "post_id": "1awod96",
        "author": "Active-Chemical-2868",
        "title": "career fairs are worth it",
        "url": "https://www.reddit.com/r/csMajors/comments/1awod96/career_fairs_are_worth_it/",
        "score": 749,
        "num_comments": 68,
        "created_utc": 1708551952.0,
        "selftext": "&#x200B;\n\nhttps://preview.redd.it/drhn9rcbc0kc1.png?width=1200&format=png&auto=webp&s=ef06ff094c3c1bc3d4dbebee603e6aa26d3b9742\n\nApplied to about 120 companies on the Simplify github repo in August, never heard back from a single one. Went to two career fairs and got handed offers left and right. idk bros",
        "permalink": "/r/csMajors/comments/1awod96/career_fairs_are_worth_it/",
        "comments": [
            "I’m wondering if I’m the problem here but whenever I go to a career fair they just tell me to apply online",
            "Really depends on the school. Career fairs are known to be bad at my school since there’s too many people that go. The recruiters are in a rush because of the long lines and end up chucking our email addresses into their data banks and never reaching out again.\n\nThere was a recruiter that even said I’m exactly the person they were looking for for their new grad position. That my background really puts an edge over other applications. Never heard from him again…",
            "People really do underestimate their career fairs. Both of my internships came from meeting people from the company, then applying.",
            "tan history grandfather kiss act party fact brave many swim\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "what school do you go to",
            "Not in my experience. Careers fairs have led me nowhere. I’ve handed my physical resume, applied online, messaged recruiters using the email they gave me during our conversation, connected with them on Linkedin, etc. Not a single response. \n\nI guess it definitely depends on what school you go to and its reputation with employers, so I can’t say that I’m surprised since I go to a university primarily known for its business program. Nonetheless, It would be nice to receive a response from those in person/online applications even if it is a rejection.",
            "What was your resume like any projects?",
            "When I was in undergrad I told myself that I wasn't allowed to leave the career fair until I talked to 10 companies, and brought 10 copies of my resume. After 6 or 7 I was feeling extremely spent and almost left but forced myself to stick it out. 9th table I went to I ended up hitting it off with one of the developer reps that they had sent and we just nerded about Ruby. She put my resume into a short stack which got me an interview which lead to an internship and fulltime offer after the summer internship. Got to go into senior year with a job lined up. Previously I had applied online to dozens of places and only gotten like 3 interviews as I had no prior internships and only middling GPA. That job led me to get a variety of connections which have driven all my career hops since. Also made some friendships from that internship that have lasted for a decade now.\n\nTLDR: go to the career fair, be pleasant and humble, try to make connections, it can change your life.",
            "Depending on school, my school career fair is subpar and lacks companies that hire software engineers, especially for internship positions and career fair is held little bit late compared to recruiting season.\nToo many students but they always say apply online anyway, some companies take resume but often it's just for formality.",
            "I went to SWE career fair in 2021 and got called to interview for everywhere I went. Granted I had FAANG internship on my resume. But my friends without any prior experience also got offers while they couldnt even get a coding challenge before.\n\nI get that it is a different time now. Even SWE recently got bombarded with many students but it is still better than online.",
            "8 interviews from a career fair! Astonishing.",
            "8 interviews, 7 offers is a great score! Perhaps you failed to sell yourself well in the resume stage?",
            "Agreed! I got an internship at a career fair too!",
            "This was largely my experience as well this year.",
            "Career fairs are great! When I was a student I always looked forward to them, so many opportunities that I would’ve never even know about otherwise!",
            "They are most definitely worth it. I can’t stress this enough. I got TWO offers from a career fair last week. Had a simple interview for one. The other was a slightly more difficult technical interview. I got moved to the final phases for both. Got offers from both. \n\nOver half the companies told me to apply online, but the ones that did allow me to connect with them were very kind and took my resume. \n\nI took the offer I had received the same week (which was last week) as the other offers that I applied for online instead. They pay was a little bit less but the work seemed more interesting. \n\nNonetheless, always go to your career fair. If you’re worried you won’t get much from the career fair, you are wrong. Work on projects, network, and attend the career fair.",
            "Which one did you go to?",
            "I went to a career fair at my college and there were only 2 companies present for IT related roles. Both of them told me hiring was currently frozen. One of them was DoD overseas positions lol",
            "YMMV my college’s career fair was a bunch of random companies hiring for random positions (none for SWE). Closest one was an IT position but that was it. I had printed out a bunch of resumes, ended up handing out 0 that day lol. Went home disappointed",
            "Hardly any companies come to my school’s career fairs for CS unless it is the CS career fair which has happened once since I’ve been here. And the few that do come, the line is about 7 km long and when I do get a chance to talk they say essentially the same thing - apply online 👍.",
            "My career fair was so oversaturated that I only got to talk to 2 companies",
            "What’s career fairs",
            "Holy fuck are you from Stanford or Berkeley",
            "Can u share which career fairs u attended",
            "My university sucks for career fair. Out of all the employers coming only 3 are recruiting cs majors",
            "Lol T10 domestic ranking.\n\nCareer fairs were utter shit. They all said apply online, there were never any recruiters just former graduates, pay was always garbage and the biggest companies there were BAE Systems and Frazer Nash",
            "UF has pretty good career fair. That what a lot of people say atleast. But no luck so far.",
            "What kind of career fair? Public or school fair?",
            "Did you reach out to the recruiters after the career fair? And if you did, did you apply online first before reaching out?",
            "What school do you go to",
            "I got my FT offer from one, definitely go!",
            "Was this the Spring Career fair??? Congrats!",
            "Which school are you in?",
            "I got all of my interviews/offers this cycle from my school's fall career fair. To be fair there are also a shit ton of companies that are just there to tell u to apply online, but the ones that take physical resumes there can be amazing",
            "1. Go to career fair, make a good impression\n2. Leave resume, ask for a business card if possible\n3. Apply\n4. Send an email to the recuiter saying you appreciated talking to them at the career fair and letting them know that you applied etc."
        ]
    },
    {
        "post_id": "1avp02w",
        "author": "montmaj",
        "title": "PSA to new CS majors ",
        "url": "https://www.reddit.com/r/csMajors/comments/1avp02w/psa_to_new_cs_majors/",
        "score": 753,
        "num_comments": 65,
        "created_utc": 1708453993.0,
        "selftext": "GET OUT OF THIS SUB ITS BAD FOR YOU \nYOU WILL BE FINE, JUST CODE AN ENJOY YOUR LIFE",
        "permalink": "/r/csMajors/comments/1avp02w/psa_to_new_cs_majors/",
        "comments": [
            "I have a job set up for after graduation and this sub still stresses me out so fucking bad",
            "Lol why is this a shitpost",
            "You know, this post made me realize something. I was getting annoyed with all the doomers on the sub but it should have a net positive on the job markets. All these people whining should have the opposite effect of all those day in the life influencers and anyone looking into CS will think it’s bad to go into because of all the doomposting which means that as annoying as it is all the whiners are actually helping the job markets",
            "PSA to new CS majors…\n\nSwitch majors because CS is dead",
            "Don’t worry about jobs kids just code the economy/government will collapse soon don’t worry about money",
            "Dear CS majors,\n\nSoftware Engineering isn’t that great and doesn’t pay well (I’m gatekeeping)",
            "I left this sub. Why am I still getting updates.",
            "Nah I like the FUD, it really motivates me to take it comp sci seriously because before seeing this seeing this sub I thought the market was still full of jobs ready to hire anyone",
            "I'll be honest, I love coding; but ASU has the worst program for it. I'll be leaving a job opening for one of you graduates! I guess I might take my luck with interpretive dance or sumt.",
            "you will be fine bro. just code bro. lmao. and just be homeless after college bro",
            "Tbf it’s mostly the international students who are dooming because no companies are sponsoring and they’re not good enough to stand out and have to go back to their home countries. The rest of NA citizens have a higher chance if they just stay on top of projects, keep looking for internships, and pursue relevant experience.",
            "I just like seeing people's mental health go off a cliff. I don't take any of it seriously though.",
            "No please I want my daily dose of depression",
            "This sub is pathetic and depressing, I see people getting hired all the time and I do not have one cs friend from uni that doesn’t have a job (most of them were not that great in coding!!)",
            "If a CS major writes like the OP, there's no absolutely no hope.",
            "Well spoken. Learn a few languages, find a project that interests you and full send it, you'll be fine by graduation.",
            "As an older guy switching to CS from Healthcare, this is the best idea I’ve seen on here yet. Came here for information, stayed for the fearmongering.",
            "INCREDIBLY FACTS. this sub ruins my mood daily lmfao",
            "This sub is trying to lessen the competition",
            "Good luck to y'all. Most of the jobs are now moving to India for a fraction of pay. If you think just coding is enough then you are up for bitter disappointment upon graduation. \n\nIt was always hard to find first job as SWE, but now after all the layoffs, employers prefer experienced SWEs and you are competing against all the people lay-off from FAANG . So good luck.",
            "YES",
            "LMAOOOOOOOO",
            "Bro I have a full time remote job (I'm not from the U.S) and to this day checking this sub makes me depressed as shit... Just keep on working hard and you'll be just fine, either in tech or out of tech. It's not the end of your world",
            "You know what. I’m actually gonna do that",
            "Nah this sub shows me how I am so much better off mentally than ofter people. Makes me grateful"
        ]
    },
    {
        "post_id": "w6orqn",
        "author": "Maulvi-Shamsudeen",
        "title": "I always advise freshmen students to not study CS.",
        "url": "https://www.reddit.com/r/csMajors/comments/w6orqn/i_always_advise_freshmen_students_to_not_study_cs/",
        "score": 752,
        "num_comments": 56,
        "created_utc": 1658643111.0,
        "selftext": "Just so there's less competition going forward. \n\nSpread the word.",
        "permalink": "/r/csMajors/comments/w6orqn/i_always_advise_freshmen_students_to_not_study_cs/",
        "comments": [
            "Based",
            "“It’s not enough that I should succeed, others should fail” op prolly",
            "Well, if I could go back I would certainly study Maths. So I agree with you.",
            "Lmfao",
            "Lol the down votes alone tell the mindsets of some people in this sub.\nWith such mentality, you'll never move forward, only become busy bringing people down.\nThere will always be somebody better than you, but only you have full control of your actions.",
            "Why stop there?\n\nStop posting your salaries. From now on we all make 65k as new grads. No signon no RSUs. Faang is rigged and froze hiring forever. \n\nSpread the words",
            "[deleted]",
            "Competition is good I'm very competitive.",
            "op, marry me?\n\nand why stop at freshmen, u shold let thy fellow classmates know. constantly. all the time.",
            "get filtered nerds",
            "We think alike, but competition is good, it keeps you motivated. If you have no competition you’ll start to weaken and let you guard down and then boom, you fail",
            "Having competition forces you to sharpen your skills.",
            "🤣",
            "Hahaha a lot of people are mad but this is hilarious",
            "bro if you’re mediocre at your job just say that",
            "Competition should not be a big deal when there are so many openings. If you're willing to put in the work, you're already ahead of 90% of CS majors",
            "It doesn't work like that, tech isn't zero sum, pretty much nothing is zero sum. A higher number of people doing a certain thing drives innovation in that space leading to job creation. That's why CS entry level salaries are higher than anything else with a bachelor's degree.",
            "If no one was competing for CS jobs I would feel a lot less accomplished by succeeding in it\n\nEdit: how am I being downvoted for this?",
            "Asshole",
            "Lol I wasn't accepted into the CS major but was determined to switch. Everyone, even the advisors said it was impossible. I managed to switch in 🖕🖕",
            "CS is very oversaturated anyways. It's unironically best to do this, because if the school work isn't treacherous enough on them, then we'll get a bunch of scabs and workplace related issues due to the sheer amount of willing workers.",
            "A quarter of those dumbasses will drop out before finishing Programming 101, another quarter will drop out during Data Structures. Then there’s all the math that will filter these idiots.\n\nThen there’s all the morons that only passed their programming classes because they joined the class discord and basically had their hand held by other people, or blatantly copied someone else’s code. You know, the people who make it to senior year and don’t know the difference between accessing something in an array list vs accessing something in an array. Which are the same people who don’t know how the debugger works. In their Senior year."
        ]
    },
    {
        "post_id": "p6am7a",
        "author": "internship_helper",
        "title": "Here are 5 Things You Should Do After Your Internship Is Over",
        "url": "https://www.reddit.com/r/csMajors/comments/p6am7a/here_are_5_things_you_should_do_after_your/",
        "score": 749,
        "num_comments": 42,
        "created_utc": 1629228630.0,
        "selftext": "Congratulations, you secured your summer internship, spent 10/12 weeks working on a team, potentially did a presentation and now its over. You might be asking yourself, what do I do now? \n\n\n\nNo need to worry. Here are 5 tips for things you should be doing post internship.\n\n&nbsp;\n\n**Tip 1.** Add your team and fellow interns on LinkedIn\n\n\n&nbsp;\n\nThis is the single most important thing you can do for your career. Why is this so you might ask. Well did you know that by getting referred you are 4x more likely to be hired? How do you get referrals? By having a strong network and there are no better people to add to your network than those that have worked with you.\n\nThis is especially true for those that may not have received a return offer. If you are in this category, leveraging your network can lead to a direct referral to your next role.\n\n\n&nbsp;\n\n**Tip 2.** Ask for recommendation on LinkedIn\n\n&nbsp;\n\nHave a colleague that enjoyed working with you? Ask them for a [recommendation](https://lisamariediasdesigns.com/wp-content/uploads/2019/02/13-1280x720.png) on your LinkedIn! If they give you one, be sure to return the favor and give them one  as well.\n\n\n&nbsp;\n\n**Tip 3.** Write down the specific things that you did during your internship.\n\n&nbsp;\n\nReally this should be done during your internship pretty much right after you complete something. If you didnt do so, its ok you can do it now. By writing down what you specifically did, you will have no issues when adding your internship experience to your resume. \n\n\n&nbsp;\n\n\n**Tip 4.** Send thank you emails to the people that helped you\n\n&nbsp;\n\nLeave a positive and lasting impression on those that helped you before and during your internship. From the recruiter that contacted, to your manager, mentor, and VP if you had one. Writing a simple email letting them know of your experience and how thankful you are may be what helps you get a return offer.\n\nIf you want to take it over the top, you can write a thank you note and leave it on their desk (if you are not remote).\n\n\n&nbsp;\n\n\n**Tip 5.** Ask for feedback and next steps\n\n&nbsp;\n\nWhen your internship is over be sure to ask for feedback from those who worked closest to you which could include your manager, mentor, or fellow devs. This is another one of those tips that you can periodically do during your internship, but if you did not get a chance the end is good too.\n\n\nWhen asking for feedback you can ask some or all of the following?\n\n- Did I meet or not meet the expectations for the role? How could I have met them?\n- If I were to come back to the team, what next steps would I take to get to the next level?\n- What things can I improve on?\n- What things did you like and should continue doing?\n\n&nbsp;\n\nThere you have it, 5 things you should do after finishing your internship. Feel free to message me if you have any questions!\n\nedit: Have a topic youd like for me to cover? I have a [thread](https://www.reddit.com/r/CsJobLinks/comments/p5kkn8/what_topics_do_you_need_help_with/) for capturing these.",
        "permalink": "/r/csMajors/comments/p6am7a/here_are_5_things_you_should_do_after_your/",
        "comments": [
            "saved",
            ">Ask them for a recommendation on your LinkedIn! If they give you one, be sure to return the favor and give them one as well.\n\nNot sure how much recruiters care, but I'd be wary of exchanging recommendations. It looks much more like a favor and less like genuine appreciation.\n\nA recommendation triangle? That could be better.",
            "Also in addition to #3, write down possible behavioral question answers.\n\nTimes you had to disagree with a stakeholder, times you stood up for your idea, times you struggled, etc.",
            "Saved thank you",
            "Name checks out",
            "Why should one keep notes of what they did during internship other than writing down for resume?",
            "Take my reward.",
            "sorry but who tf looks at linkedin recommendations?\n\nand quick summary for everyone: add co-workers on linkedin, keep a brag sheet, say thank you, ask for feedback",
            ">If you want to take it over the top, you can write a thank you note and leave it on their desk (if you are not remote).\n\nI love the \"if you are not remote\" because we wouldn't want Josh who is 200 miles away sneaking in the office and leaving thank you letters on the desk when no one is around.",
            "Saved",
            "Remindme! 1 year",
            "Is it ok to ask for feedback over email? like 3 questions? I already completed my internship",
            "thanks!",
            "Remindme! 1 year",
            "[deleted]",
            "Am i the only one here who don't have a summer internship?",
            "RemindMe! 106 days",
            "Remindme! 3 days",
            "Remindme! 1 year",
            "RemindMe! 11 days"
        ]
    },
    {
        "post_id": "rp4bkw",
        "author": "differAnt",
        "title": "How to Leetcode? My 2 cents.",
        "url": "https://www.reddit.com/r/csMajors/comments/rp4bkw/how_to_leetcode_my_2_cents/",
        "score": 749,
        "num_comments": 61,
        "created_utc": 1640548070.0,
        "selftext": "Who is this for? CS students with a good grasp of basic DS & A but find leetcode terrifying or difficult.\n\n**What's the target?** The goal is not to master all the hardest problems, rather to accurately code for medium-level (sometimes popular hards) questions in 20 mins + 5 mins explaining. Code should be easy to read, explain and debug.\n\n**Language:** I would recommend choosing Python along with one of C++/Java. Debugging, explaining, coding are much faster in Python. That means you will learn much faster. Sometimes Python is not available so you can fall back to C++/Java\n\n**When to start leetcode:** Starting leetcode without any background in DSA is like jumping into a wall of frustration. I would recommend you at minimum get a grasp of the following :\n\nArray: Searching, Sorting\n\nLinkedList, Ordered and Unordered Sets and Trees: Traversal, Add, Remove\n\nTrees: BST, DFS, BFS,\n\nGraph: BFS, DFS, Shortest Path\n\n**How to build intuition? :** Tbh it's hard to have intuition at the start, so one thing you could do after reading the problem is to fix the data structure and then think about algo. It doesn't work always but it's a good approach without any experience.\n\n**How to prepare? :** My recommendation is to prepare in 2 alternating sessions, let's call them depth and breadth sessions.\n\n1. **Depth sessions** focus on areas you are already familiar with (new problems from known topics). It will be timed to 1 hour and within that hour you will have to code, debug and explain your thought process aloud for all the problems you have assigned yourself. Don't see hints or solutions within this period.\n2. **Breadth Sessions** just pick a random problem (preferable medium and hard from an unfamiliar topic) and think about it deeply. The challenge is not the coding but the thought process. Give yourself a lot of time, if you think you are stuck unlock a hint or the expected time complexity. Then try again.\n\nI used to do 1 breadth session daily. I started with 2 meds in 75 mins, then went to 1 med 1 hard, and now I can pull off 2 hards in an hour. Pace yourself as you find suitable. I used to competitively do depth sessions with a friend. Remember to keep 5 mins to explain the thought process aloud as if you are in the interview.\n\nFor breadth read the problem and take your time, I usually gave myself 1 day to solve it.\n\n**Filling the gaps:** let's assume you have made good progress and can solve most problems but there are a few rare ones that you haven't seen and might trick you. Now go through the first 400 LC, that you have not solved already.\n\nIt took me about 2 months to reach this stage.\n\n**Revising Before Interviews:** Do LC tagged questions for that company.\n\n**How to conduct yourself in an interview:**\n\nInitially explain a few lines on what you want to do.\n\nWhile coding explain each block of code as you type. Don't go into details but give a high-level idea, so the interviewer can understand your intentions.\n\nOnce your code is completed immediately test it (dry run or use compiler) before the interviewer intervenes. If errors come after he/she takes over it counts as a negative. Find errors on your own.\n\nOnce the interviewer is satisfied with the solution, go ahead and state its time and space complexity.\n\nThis approach worked for me pretty well and I hardly ever miss an OA or interview question. Hope this approach works for you too.\n\n**Update:** A lot of the comments say that what I am describing is too difficult to attain or impossible. Well to be frank this is my third shot at interview prep. I had done the same stuff in my junior, final year, and now doing it again as a master's student.\n\nFurther, I come from an education system where solving questions is 100% of what matters in getting a job, apart from your university. Resumes, projects, etc matter very little. So leetcode is not an option it's all you do.",
        "permalink": "/r/csMajors/comments/rp4bkw/how_to_leetcode_my_2_cents/",
        "comments": [
            "[removed]",
            "Amazing analysis, I wish I had this a year ago. Its very easy to get lost into the rabbit hole and not be able to measure progress",
            "you did 400 lc questions in 2 months?",
            "My motivation : 8 hours of LC everyday keeps Service Based Companies away xD",
            "Great analysis, although I haven't had a sorting problem before in my 30+ interviews in the past two years. Merging intervals problems have shown up a few times to my surprise. I'd recommend doing the Blind 75. Understanding those is a game changer (especially for BFS/DFS, which in my opinion are the most important algorithms).",
            "I had a question. How to motivate my lazy ass to start taking leet coding?",
            "Maybe I'm completely retarded, but my personal biggest issue is deciphering *WHAT* output they're looking for in the first place. I swear I spend 4 times as long figuring out what the question actually is than I do figuring out a solution.\n\nHonest question - is this just me?",
            "Is python not being available actually a concern you should have? From my experience most companies just outsource their shit to HackerRank, CodeSignal, etc which all have dozens of languages available, you could code in PHP if you wanted too.",
            "Good advice. \n\nI’d say it’s better to state the space and time complexity at the outset though, rather than at the end.",
            "When would Python not be available? Would some companies just not allow it…?",
            "> Depth Sessions\n\n> Breadth Sessions\n\nUsing Leetcode Patterns to plan your studying of leetcods. Nice",
            "Please do a favor for yourself and use JAVA",
            "Thank you differAnt!",
            "Great post btw. Very thorough, detailed and realistic. How do you find company specific LC tagged questions?",
            "Do you really can handle most of the hards in 20 minute? Does it include optimal solutions? Sorry for my scepticism, but if you don't have competitive programming or math background I hardly believe that you would come up with pretty hard ideas in 20 min",
            "Will your 2 cents moon to 1000x?",
            "Following",
            "So far I’ve only taken my uni’s CS 1&2 course which is c++ divided into two semesters. I’m going to take discreet mathematics next semester then D&A during the summer. Would now be the time to try start to leet code? Or should I wait?",
            "Is there a list of topics that I can refer to?   (To classify  familiar vs. non-familiar)?",
            "S"
        ]
    },
    {
        "post_id": "1c8l0a4",
        "author": "petranteatr",
        "title": "misogyny during class next to professor ",
        "url": "https://www.reddit.com/r/csMajors/comments/1c8l0a4/misogyny_during_class_next_to_professor/",
        "score": 745,
        "num_comments": 214,
        "created_utc": 1713601911.0,
        "selftext": "so i’m a female graduating cs senior and i’m taking this upper math division for fun, and almost everyone else in the class is a math major. it’s a very small class so i see the same people everytime. i sit near a few guys who im acquainted with but not really ppl i would call friends. \n\ntoday in class i was helping them with some github commands bc they were writing code to calculate the math formulas with python and i was teaching them version control. and then one guy is like how do u know this and i said i was a cs major. then he proceeded to ask me if i had a job and i told him i had an offer lined up at a faang company. but then he said smth really out of pocket, along the lines of “so who’s dick did you have to suck to get the job”. i was shocked by this but i kinda just laughed it off, plus the ppl around me (3) were all guys. a few moments later the subjective of interviewing came up and then he made another comment where he said smth like “oh how do you do/pass the in person interviews looking like that” while he gestures his hand at me up and down. i again just laughed it off because i felt awkward and didn’t really know what to say. \n\nit’s also funny because before they found out i was gonna work at faang, i also helped them with the code/github stuff a bit but it seemed like they didn’t really care or were interested in what i had to say. they never really tried to have a conversation with me for more than a few minutes even if i would initiate a conversation with them. and then after they heard about my job offer all of them suddenly started acting super interested in me and what i was saying about the git stuff and began asking me a bunch of questions about jobs/tech etc. \n\nthis really gave me the ick. i’m thinking about mentioning this to the professor because i think this behavior is pretty inappropriate and obviously misogynistic. and i literally barely even know these ppl who are making uncalled judgements towards me. and to think that this even happened in the classroom when the professor was sitting a few rows away. i don’t think the professor heard though bc he was talking to other students. \n\nedit: thanks everyone who showed support. definitely makes me feel a lot better that hearing kind words. in the future i’ll stand up for myself more and not let it slide so casually. i think i was more shocked than anything, as i have never experienced such direct misogyny to my face before in the past 4 years of my college/jndustry career. to the trolls: this isn’t a shitpost. you don’t know anything about me or my past experiences, and your hate comments are just pathetic. i’m leaving and graduating soon, so to me personally it may not be worth the hassle to report it to the school but i’m planning to tell the professor after class next week. ",
        "permalink": "/r/csMajors/comments/1c8l0a4/misogyny_during_class_next_to_professor/",
        "comments": [
            "Whether or not you report it is your decision, but needless to say, never help them again. Don't try to be nice to people who aren't nice to you.\n\nAlso, don't be scared to strike back where it hurts: \"Oh and do you have a job upon graduation?\"",
            "You were helping their arse, and they came up with this? Just stop, and leave the room loudly. Don’t talk to these kids ever again. (And tell the professor about them being offensive).",
            "They're jealous of you",
            "I know this behaviour, that guy was just embarrassed that he didn't know something and tried to bring you down by insulting you. It just perplexes me that on one hand you're asking for someone's help and on the other hand you're insulting that person. What kind of low life person does that.",
            "I graduated about ~2ish years ago. I was the only girl in my math for CS class but the tutor was female and she'd always help me out with extra material, worksheets, math problems. If your tutor is supportive of you, definitely report it. Unfortunately women in IT deal with this everyday but that doesn't make it okay. Guys like this are gonna be HR favourites when they get a job lol.",
            "Definitely go to your professor about this, I'm so sorry about them. Such pathetic behaviour",
            "I am so sorry, this is fucked up and unacceptable",
            "Bro they just jealous they don’t have faang offers, bet if one of their bros got an offer they’d react the same",
            "What a dumbass with his dumbass friends who didn't call him out on the spot. You can complain to the professor but there is a chance he'll say something stupid like: \"Come on he was just goofing around\" so be prepared to be disappointed.\n\nCongratulations on the FAANG gig! I'm a guy but I know in my company there are multiple networks and events for women by women within the company, some self-organized, some sponsored by our employer. From what I've heard, these can provide a lot of support and are a welcome change of pace to the male-majority project teams. Even when not faced with blatant sexism as in your case, it's always good to have a network of like-minded colleagues looking out for each other. \n\nThis can be a good strategy at uni (but it sounds like you've almost graduated so it might be a bit late for this) and will definitely pay off when you've started working.",
            "\"female initiated disruption of male heirarchies incites hostile behavior from poor performing males who stand to lose the most.\" A 2015 study\n\nWeak men have a need to drag you below them,\nEspecially in a group.\n\nYou may want to let your professor be aware of the behavior, although I'm unsure what they'll be able to do, it's not illegal to be an asshole.",
            "Its quite indicative of this subreddit the small response this kinda thing gets compared to all the shitposts. Sorry this happened - just a jealous idiot who probably isn't worth worrying about (but do report if you feel better doing so)",
            "Insecurity at its finest. Report, ignore, and then move on.",
            "Im a dad whose daughter went to college east coast. Racial jokes were used when she was in small groups. She is half Mexican. She called out each person. Some of them actually apologized and became good friends. Others didn’t get it. She became an engineer and is starting med school this year. She is a stronger person for calling persons  out. Your incident happened in a classroom so do report it to professor. It becomes his liability with these jerks. Remember that you’re better and stronger than you think. You have a bright future ahead of you.",
            "The first time we had a female lecturer on my course, it was during lockdown and so on zoom. One prick wrote in the chat \"you are one of the most beautiful Asians I've ever seen.\" That blew up because everyone saw it, but I hate to think how many comments like that are made out of the spotlight. It's genuinely disgusting.",
            "That sucks. I don’t have any advice re: the professor or what to do about it, but what a bunch of assholes. They definitely need re-education. \n\nAt work in big IT companies there’s no way that kind of commentary is tolerated by me, teams I’ve worked in, or by HR. They can and do fire over that at least in Australia, usually after a warning or two. \n\nCongrats on the offer btw!\n\nMy wife is also studying CS and in the industry you think, “wow we just be getting to 50/50 or something by now with young people, in a few years the workplace is going to be radically different and better!” but nope… class ratio looks to be about 15% 💀",
            "Shut them down. What they are doing is completely unacceptable in the work place and they need to know it.\n\nSorry.",
            "Yeah it’s a jealousy thing. By you understanding how things work and helping a group of men out and you’re a female they got intimidated by you and so his response is to make you feel like shit. You did right and kept it professional but I’ll stop helping and let them swim and sink.",
            "Wow that guy sounds like a real dick",
            "Im sorry this happen to you. This are some of the people you will unfortunately will be working with at times. Make sure to report him, I know its hard sometimes to stand up for yourself but you will have to learn to. Misogyny can be rampart in fields like this. Unfortunately the only way this changes is by adding representation in the work force. Which you should be proud of yourself for doing.",
            "That's funny because my perspective has always been... Jeez it's hard to succeed as a man and all I have to do is my job. But women are expected to do the job and then also compose their appearance (clothes, makeup, physique) at a level that most men get away with ignoring in themselves.  It's like women have to navigate two roads at the same time.  Anyone who would see what's really happening and claim life is easier for women is pathologically blind to reality.",
            "If he said it amongst themselves when you weren't there, it's rude but jealous, but damn saying that to your face? Surprised you didn't give a slap for that.",
            "Report them to the professor and make sure they get punished. However, make sure they do NOT it is you, otherwise they may start harassing you outside campus. Some men absolutely disgust me.",
            "I'm sorry you experienced that. Unlike a few people recommending you ignore them (out of fear of retaliation), I recommend that you report them and stand your ground (while also refusing to help them in the future).\n\nIgnoring them may give you temporary peace but will only embolden them to think their behavior is acceptable and consequence free. Without being held accountable now, they will just continue being people that make their female colleagues feel uncomfortable and isolated in the workplace",
            "theyre jealous bitch boys. stop helping them.",
            "The way you treat people is a reflection of how you feel about yourself. They feel inadequate so they lash out to make you feel inadequate.",
            "This definitely warrants telling a professor at the least. His comments were way over the line and the fact that he kept going after the first shows that he’s just gonna keep thinking this is okay. I’m surprised none of the other guys who overheard said anything, and you definitely don’t have to keep interacting with them. What the one guy said to you was extremely misogynistic and rude and the rest of them should’ve said something. I’m sorry this happened to you",
            "Yeah please don't be like that again, response to their rude comments with something equal as rude",
            "Shulda threw hands",
            "Address it directly the next time in front of everyone. It really throws people off when you stand your ground and challenge what they have to say. On the other hand, the more we let others cross our boundaries the more they get comfortable doing it and sometimes they may not even realize there’s a problem with what they said.",
            "I'm so sorry.  No one deserves that kind of disrespect and harassment.  Please do not let them get away with this.  I am a female SWE and used to let things go to avoid making waves for years until I started reporting it.  Do not wait like I did.  It will only make you feel miserable and powerless.\n\nSending virtual hugs your way!",
            "As a woman who studied CS and has been in the real tech world for a decade, the boys in college generally lack confidence and an identity. They don’t know how to interact with women, or people in general. They lack social skills and awareness. \n\nMy suggestion is, do tell the professor but be prepared that the professor will probably do nothing. \n\nNext time, if this happens with another individual , I suggest don’t laugh it off. Say, “That’s a really weird thing to say publicly, I actually worked really hard for <thing>, like my male counterparts”. Then get up and relocate.\n\nEdit: In the tech industry I haven’t had this experience, personally. Men in the work environment generally respect women and I’ve personally felt very valued. \n\nI’m sure this behavior does persist into the work environment to an extent, but in the work environment, these people eventually get weeded out or lose their jobs for these comments.",
            "That's unfortunate, that person was horrible.\n\nI always thought CS major would have more of this kind of people rather than math",
            "i am sorry , you have to go through this. This guy is jealous of you that you know something that he does not and also you got offer from faang.\n\nPeople like him exist .\n\nyes u can report to the professor . But think if you report , then he may start showing  more inappropriate behavior towards you.  Even outside the college , who knows.\n\nFirst of all, avoid him . Donot talk with him. Even you come face to face  with him, think of him just a stranger.",
            "In my experience, there’s a lot of people in cs that are extremely socially stupid. They just don’t understand normal social interactions and what is ok to say and not to say. Idk about math majors though. Sorry that happened to you",
            "When someone says something like that to you in front of others, calmly respond, “can you repeat that?”.  They awkwardly either will repeat it, or will start backtracking.  Either way, it shines a spotlight on that statement and student.",
            "Some men are miserably beings and never got the attention they wanted.\n\nWhile yes, you can report them, they might be even worse to you in and off campus.\n\nI would laugh it off, ignore them and think about how miserable they have to be to say stuff like that.\n\nAnd of course not help them with their problems in the future.",
            "Which university? Name and shame",
            "Reporting to the authorities doesn’t work anymore. You should have told him: ‘why do you ask? You want a job that desperately? I don’t think even you sucking someone’s d would help you get a job. You need at least half a brain’.",
            "It could be a dickhead kid, or you are in the friend banter zone (i have asked male friends whos dick they sucked when they get jobs). Does he talk like this to his buddies? If it is focused on you I would complain, or just not help them anymore",
            "“whose dick did u have to suck to get the job”\nto be honest in the market, I would say that to anyone regardless of gender, etc, etc. Maybe they were speaking how they would to their friends. , sorry you went through that!\nThe second comment they made is disgusting, nevertheless \n\nCongrats on the offer!",
            "1. Sorry you experienced that. Even if you don’t report them, try to distance yourself cuz u don’t need people like that in your life.\n2. I’ve been noticing this as a trend now a days … a problem with aggressively DEI-ing and affirmative action is that the role’s value drops. People who are genuinely really talented and got the job through their merit take a fat L because the are previewed as some diversity hire which is super unfair to them.",
            "I’m sorry this happened to you",
            "I don't believe somebody is that stupid as to say such in front of others. I believe the entire narrative is made up BS.",
            "Obvious troll post like wtf",
            "Their names? Albert Einstein.",
            "I woulda made a scene right there on the spot. Those kinds of human deserve nothing.",
            "I’m sorry you have to deal with this. If it’s any consolation, it 100% comes from a place of insecurity. Sadly, certain people find it easier to think others have an unfair advantage rather than acknowledging they’re not very good. \nBy any means, report it if you think it’s useful. But no matter how uncomfortable it might be, also learn to push back. Next time someone makes a joke you don’t like at your expenses, don’t laugh. Ask them why would they say something like that, point out that they’re being assholes for no reason, and don’t be afraid of doing so in public. I found there’s no need to shout or get angry, just calmly point out that you’d expect a university student to be more well-informed than the average boomer",
            "Is it misogyny or were you treated like on of the guys",
            "You shouldn't be helping people who are insulting you. \n\n  \nWhen someone insults you, don't laugh it off just to make it easier to get through the situation - I have also done that some times reflexively. I think it's because I don't like confrontation. It's better to stand your ground, be serious and let it be uncomfortable. \n\nPeople who behave like this will misbehave with someone else tomorrow.",
            "this kind of behaviour is not acceptable under any circumstances. please report them to your professor if youre comfortable w it. and please, PLEASE call them out on their bs. they hate that. theyll stop overstepping boundaries once you confront them.",
            "Unfortunately this will happen in your career.  There are people like this. Next time turn the attention back to that person.  Don’t laugh, make them answer back to their own question. \n\nFor the in appropriate comment, say something like.  I don’t really understand what you’re saying can you explain what you mean.  Having to explain them selves will make them feel stupid.  If they do explain themselves. \n\nYou sound like you have had lots of interviews.  Has this been your experience.   I haven’t experienced this myself.  It sounds pretty inappropriate.",
            "You meant git commands instead of github right\nbtw Jealousy is real (I feel it too sometimes (not in this context, but I stfu instead)",
            "What he said was a classic insecure person reaction: putting others down to make himself feel less threatened.\n\nIf it's any consolation, I don't think it has anything to do with you being a woman, specifically. I'm willing to bet that if he saw a guy driving an expensive car, he'd immediately comment that \"he must be compensating for something.\"",
            "They are jealous of your success. And congrats on your efforts. \n\nYou should directly address their inappropriate behavior to them. I think most people would appreciate a warning first before you go to superiors. But continued harassment after that is report worthy.",
            "Just ignore them and don't help it again,sadly women need a big backbone to be in stem, hopefully this experiences are the exception and not the rule for you. Congrats for your job and soon graduation.",
            "There misogyny mixed into it especially that guy, all granted.\n\n**They reframed how they see you and their interest for you**.\n\nAt the core this is them having to recognize your success, that you are \"better\" than they are and that they have to reframe what they think of you. You also basically show that you are as interested and competent in science as they are or more.\n\nIt would happen 100% to a man if suddenly they would learn that man was rich or famous or got the same job that you got.\n\nNow that they know you have this GAFAM job, they know you are extremely smart, will have a top salary and career. They know that what you say is high value and that maybe you could even get them a job in that place through referral and even that if you were to be their partner they'd benefit of your brightness and money. In other words, you become more interesting or charismatic.\n\n**Some will be jealous for sure**\n\nSome of them are jealous. Why you that they mostly ignored until now and why not themselves ? \n\nThat's unfair that you had the audacity to succeed and not them. They will hate you for that. And if they are misoginistic, they will 100% be more outraged you managed as a woman.\n\nYou will always encounter people like that, and with time, you will understand it is better if people don't know that you are or about to be extremely saucerful and wealthy. The extra attention and jealousy will backfire more than anything else.\n\nAnd you can report to the professor, but this will just make the situation worse for everybody. If there consequences, they will resent you more and they will react even more strangely when with you. You will also create a reputation for yourself and people will avoid you.\n\nAs much as possible, ignore and avoid jerk and befriend nice people.",
            "next time use,\"so that's what YOU have to do to get into some company. it's a pity, really.\"\n\nhonestly I would have simply got up and left",
            "Insecurity and jealousy",
            "This is completely wrong if he stated that ' Who's dick you had to suck to get the Job ' you should have reacted instantly and very loudly. If you will not bring this thing up to them that you felt uncomfortable then something more worse will happen therefore highlight this issue asap",
            "Never be scared to strike back. People take politeness for granted and consciously or subconsciously they form the idea to insult / belittle someone (that too in front of others). The audacity is never accepted.\n\nCut them off from any conversation other than them being sorry or understanding their mistakes. Don’t help them. But at the same time you can pity them as they are some lousy bunch of self entitled people.",
            "I doubt your professor will do anything. Your best bet is to fight back with insults. He is threatened by you and trying to take you down. You have to fight back.",
            "Not that I'm  a psychoanalyst, but the kid that said those remarks is definitely jealous and intimidated by your intelligence. I'm sorry that he made those comments, they are definitely uncalled for. I hope that you understanding that his actions are a result of his own fragile ego and not anything on your end brings some peace. With that said you should not let that slide. I would stand up for yourself by telling the professor or calling the boy out about his insecurity.",
            "Report it these guys are losers",
            "Yo what the fuck",
            "First, they are jealous and second most of them are virgins, having their digital waifu waiting for them to come home. I would recommend to keep distance and find better people in  your course.\n\nEdit: Grammar",
            "This behavior is gross. Call them out and I guarantee they shut the fuck up. If they say anything else then address it with the professor and/or department chair.",
            "It's crazy that they couldn't help themselves but insult you while getting help. If i had misogynistic views but was getting help from a woman, I'd hold my tongue. But obviously not these guys. Maybe their pride suffered because you knew something they didn't so they lashed out.",
            "Sorry to hear that happened to you obviously that was out of jealousy. Sure you report it to ur prof; however, sadly this won't be the last negative/offensive comment you might get so I'd advise you to stand up for yourself and get back to the guy let him know that you don't appreciate what he said. Always remember there is only one person that will ever stand for you which is you and no one else.",
            "I think you made a mistake when you laughed it off the first time, it probably made him think it's alright to behave that way and told the other guys you were cool with it. As others have said reporting this to the professor is certainly one way to go, but consider that there's not always going to be a professor to report to. In my experience,  such men(or women) take their social image too seriously,  and a simple retort like \"Wow. I can't believe you'd actually say that when I'm literally helping you out\" is enough for them to lose their composure. I'm not faulting you in any way, as a guy I can't even imagine how I'd react in such a situation. Just trying to give you a useful suggestion.",
            "Disclaimer, I’m not a girl (unfortunately) but rather a hispanic gay guy in stem. \n\nOP, pretty sure that only of the guys is the problem, the others just either don’t have a backbone or give a damn. Either way just keep in mind ur issue is with one of the guys not all of them (unless they all make comments regarding ur appearance/abilities). \n\nIf the problem is only the one guy that makes the solution pretty simple because of the FAANG position u have lined up. You noticed that it has weight and alters your identity to these guys. \n\nIf you wanted you can easily use this new weight of yours to change the attitude of the one guy that was making the misogynistic comments. If you don’t get that in line soon then it could just as easily spread to the other guys. \n\nAny one can change the culture of any place OP, most ppl just don’t think too much about it. Make the classroom an environment u want to be in. \n\nOfc it is just easier to say something to the professor but I promise that the outcomes of that are pretty sterile and not as promising as doing the work urself. \n\nConfrontation and people managing isn’t for everyone tho so proceed w caution. But also keep in mind that this won’t be ur last time dealing w fuckers like this. So what better time than now to get ur practice in",
            "That’s terrible. This is why women in STEM are important",
            "\"Sucking the interviewer off? Is that what you've had to do to get hired in the past? I'm so sorry you had to go through that.\"",
            "I’m sorry this happened to you. For this situation yes you could report it to your professor but there is probably a more appropriate way to report on campus as well. I would ask your student union or student affairs.\n\nI also say this with so much compassion and know you shouldn’t have to deal with these things but as a woman with a CS degree you will likely continue to run into this behavior. It will come out of the blue or when you least expect it just like this did. It may not happen for years at a time but unfortunately it will benefit you to be prepared for it. \n\nYou are going out into the world as a new graduate with a great job as an adult and you will need to start taking on your own authority. I am not trying to criticize how you responded to the situation in your post. I have been there and understand completely why you reacted that way. This is for future situations. \n\nYou will need to clearly set boundaries and shut this off in the moment when it happens because laughing it off won’t make it stop. Laughing it off gives others around you a license to do the same, it condones the comment, even if someone else is bothered by it you have accepted the comment with a laugh so for them to do anything else is having a more extreme reaction that you do.\n\nYou do not need to be aggressive of confrontational in this but simply stating something’s along the lines of do not make sexual comments about me or please don’t make crude jokes about my career or a casual not cool or whatever you put together that fits your style. A simple general statement that doesn’t repeat what they said and doesn’t give them a foothold to pushback on. Practice this statement, say it out loud when alone. Get comfortable with it so when that moment comes and you’re in shock from what was said you are so practiced at it that it comes out smoothly and calmly. It’s going to be uncomfortable as hell. You might feel nauseated just thinking about it and at the time it will be worse. It gets easier the more you have to do it. To a lesser degree the same thing goes for saying no and setting boundaries in other ways sometimes. \n\nThis will probably make everyone just a little uncomfortable in the moment but it should because that comment wasn’t ok and it shouldn’t be passed over like it was. Honestly at this point you would be doing that jerk a favor as he’s going to get himself fired once he’s employed. This will also make that space for coworkers to be a public ally. Once the pause has passed get back to the topic at hand like it didn’t happen. If it becomes a pattern escalate as needed to superiors at work or HR. \n\nThis advice is for professional group settings which includes a college classroom, especially at that level. \n\nIf you are alone and someone makes comments of that nature literally just leave. You have no idea if they are just a misogynist or something worse so I wouldn’t call it out in that instance. Just saying I’m going to go now is enough. Do not polite yourself into a worse situation. \n\nIf you aren’t already please join some subs for women in technology and it’s also good to look for women in tech professional associations or groups local to you. \n\nYou will learn when you have a supportive workplace and when you don’t and what you will need to do to deal with it. \n\nBest of luck finishing out your semester and with your future job. Sounds like you have an absolutely amazing start!",
            "The most painful part to read wasn't the misogyny; it was the response to it. Laughing it off? I hope you learned your lesson; I've had similar experiences in the past and nowadays any time I'm confronted with a decision on how to react to a bad situation, the first question I ask myself is this:\n\nAre the coming months/years of mentally agonizing over my failure to stand up for myself REALLY worth being non-confrontational for these few seconds???\n\nHopefully, you're still in the same class as them. This gives you the opportunity to tell the guy what he said isn't okay. There's a 99% chance his \"friends\" are completely opposed to what he said. I am not sure why you assumed they'd side with him, especially since even YOU did not confront him and just laughed it off so it's hypocritical to say they should've done more (even though yes you all should've)",
            "You really should have stood your ground imo. If it were me in your shoes (I'm also a woman in STEM), like immediately after they made those comments, I would have just deadpan stared said something along the lines of \"that's pretty rude to say, don't talk to me like that. I don't need to suck someone's dick to get a job I'm qualified for\" and shut them down calmly with some silent confidence. Usually I stare dead straight into their eyes in silence to let what I said sink in until they start getting uncomfortable, most people usually do if they have some kind of shame. Its kind of a mind game to show them not to mess with you. (This was learned behavior from my mother so it's second nature whenever someone really pisses me off) Most of the time, I'm always just happy and helpful and also a bit of a pushover with most things.\n\n\n\n\nLaughing it off will make them think you're okay with being made fun of like this and they might actually think you're one of the \"chill girls\" who get their weird brand of misogyny that their circle of male friends are privy to, they might not even realize they're being rude because this is how they've operated for most of their life. \n\n\n\n\nEdit: please stand up for yourself more, dont tolerate rude things like this. Most people are non-confrontational and will back off if you present a strong front. I think this is a soft skill you need to learn if you're going into a male dominated or high performing field in general. You don't have to yell and shout or say any bad words or call them bad names. You don't even have to engage more than you need to after saying what you needed to say once, if they backtrack and start saying more rude things to you that obviously don't make any sense in retaliation. Just don't laugh it off, nip it in the bud.",
            "Holly shit ! He’s lucky you didn’t report him that’s out of line !\nEdit:I would keep my distance and be more Kurt if it were me I may even stop acknowledging them . I remember I met a physics phd who behaved similar to what yo I describe they said a really perverse comment about an actress I said I liked. I ceased acknowledging them and stopped sitting near them. They occasionally did wave a gesture at me , I would glance nod and keep going. \nI remember this grad student I met in uni he was a philosophy guy seemed soft spoken nice but he was covertly just a repulsive person . He was judgmental and bigoted ! When I found out I was shocked but I put on a poker face , change my number cease contact",
            "You def don’t have to put up with that. Why do you?",
            "I uttered an expletive when I read what that student said to you. I’m so sorry. I hope if this ever happens in my classroom I will have the courage to immediately throw the student out of class to be dealt with appropriately afterwards. ",
            "Lil bro so jealous of u lol. I would report it, they need to face consequences",
            "The first thing you should always tell a guy that behaves this was is “you’re disgusting, stop being a creep.” He mostly likely watches Andrew Tate every morning before getting out of bed and is single. Never laugh at these jokes because it only enables them to continue to do this.",
            "\nIt's understandable that you wish you had stood up for yourself better; but if you need to put effort into this area than get some therapy about having stronger boundaries instead of going after someone who is self-sabotaging. What we do with people like this is called GREY ROCKING. Basically how one deals with Narcissists.\n\nRemind yourself that you are not paid to manage him and just be grateful that he is not your responsibility. Recenter yourself with whatever brings you joy. People like this are inevitable you but will deal with the next one with more grace. Unless he escalates; I would let it go. All he did was out himself as annoying and uncooperative to everyone in earshot. \n\nI am so incredibly impressed with you. Please never change your caring nature and desire to teach for anyone. Congrats on your new position!",
            "I actually had a friend who during the career fair week her and her friend switched their tinder profiles to search for men 35+ years old. They ended getting some really good job offers after graduation. CS isn't filled with the most socially intelligent people out there. It sometimes makes me question whether it's worth pursuing it.",
            "I had a similar experience earlier in college for a different degree a couple of years ago. I'm so sorry that happened to you. I hate that women can't be in successful positions or seen as smart without implications that sexual favors were made to get where they are. It's disgusting, truly. \n\nBut congrats on the faang offer! I'm still doing the general classes right now but I hope that I'll get an offer before graduating also!",
            "What the fuck? I would be so fucking pissed if someone said that to me. Don’t help those losers again.",
            "they're math majors, ask them about their job as well. these type of people will leech off your helpful attitude. if you wish to insult them, do it and then never interact with them ever again.",
            "You need to work on your sense of humour.",
            "Lmao",
            "God! Been there, faced it and cut those so called friends off from my life! Ignore them OP the scumbags aren’t worth your time and do report.",
            "This is such an unbelievable situation.  Like, I don't think I've ever met someone who would be such an overt asshole to a relative stranger in person.  At least, not in a professional or upper level academic setting.  Unless he's giving off wild autistic vibes I wouldn't think twice about reporting it.  This is absurdly unacceptable behavor for a university student.",
            "grammar much?",
            "They are jealous. They have some male ego that cannot digest the fact that you are way better than them.",
            "This is not your fault but the organisations that have promoted diversity hiring.\nSo now when women or lgbtq individuals get hired then people automatically think it's because of diversity and not actual talent.\nThey are the ones to be blamed.",
            "Not to put the onus on you but if you can please tell him off first before going to the professor.  \nIf this stops the behavior then great if not then you are better armed when logging your complaint.",
            "How is that misogyny they are literally complimenting you. They obviously know you didn't suck someone's dick to get into FAANG so they're trying to imply how unbelievably good your offer is.\n\nAnd obviously when you tell someone you work at FAANG it's gonna make them more curious. Don't pretend like you didn't know that when you told them, you were just seeking attention.",
            "Report them to the professor and make sure they get punished. However, make sure they do NOT it is you, otherwise they may start harassing you outside campus. Some men absolutely disgust me.",
            "lol now i want to know about your interview experiences.\n\n  \nedit: okay that might have come out wrong. i meant the real fang interview experience.",
            "You probably got that job because of diversity hiring, so he may be right.",
            "They were joking. He says the same thing to his guy friends. It's really not that deep. Grow up and gain a sense of humor.",
            "[removed]",
            "why the fuck would you laugh it off, especially the dick comment \n\nthis is what is wrong with this generation",
            "This is how the “me too movement” goes .. we gotta take a woman’s word and believe everything they say , where’s the proof ?? .. \nwhy didn’t you report to the professor right there and then ?? \neven if the guy’(s) said all that why didn’t you leave the setting?? \n\nYou claim they insulted you , yet you stated and helped them.. \n\nMany many men have been victims of this foolishness ..",
            "[removed]"
        ]
    },
    {
        "post_id": "147c8x5",
        "author": "None",
        "title": "Dear Neetcode and his Fans…",
        "url": "https://www.reddit.com/r/csMajors/comments/147c8x5/dear_neetcode_and_his_fans/",
        "score": 744,
        "num_comments": 52,
        "created_utc": 1686535845.0,
        "selftext": "I just wanted to say how much I appreciate Neetcode and the entire community. Recently, Neetcode uploaded a face reveal video where he also shared the most honest updates in his life, such as leaving google.\n\nI only started leetcoding 1 month ago, but I’ve been watching so much Neetcode, both the solutions to problems and most especially about SWE life, what is SWE etc. \n\nI’ve watched this man saddened over the fact that he couldn’t find a job, to finally getting his offer at google, and now leaving.\n\nIn the same way that Neetcode helps us grow and advance, we’re able to peer into his ever-blossoming growth, and most importantly hear about the same decisions/situations that relate us all. It’s a full circle moment. I love how honest, vulnerable, and humble he is.\n\nNeetcode if you’re reading this, never stop doing what you do 💛🖤",
        "permalink": "/r/csMajors/comments/147c8x5/dear_neetcode_and_his_fans/",
        "comments": [
            "Who would have thought his little distraction during unemployment turns out to be his biggest opportunity in his life. His business could be the next Khan Academy for software engineering if he could manage it well.",
            "Guy is a legend",
            "Yeah, Neetcode is amazing. I was a noob sophomore and stumbled across his channel. I was surprised to see how he had like 10k subs at that time. Also, kinda relatable as how he used to whine about not having a job. I remember when he first got his Google job. His life is kind of funny too in a way. He even said it himself how his subscribers got job offers but he was unemployed. But he ended up getting a job later. Also, remember watching his day in a life video. He has made it unlisted but I have saved it in my playlist :). Used to watch it whenever I felt like giving up. It was super wholesome. I also chat a couple of times with him on Discord and also made contributions to the neetcode solutions just to give in return. Personally, I have felt like I have grown with him. From having no clue about algorithms to getting somewhat good at it to earning my first money and doing internships. I know I sound like a fanboy myself but he helped me a lot when I myself felt that it's not worth it.",
            "I’ve never fangirled over someone this hard except Taylor swift and Ariana grande sorry if this sounded too sappy ~~ genuine appreciation for the Neetcode community 😗",
            "I just signed up for neetcode Pro membership and already loving it! \nStill have to get into the habit of doing it on a daily basis though...",
            "Doing tricks on it rn",
            "Guy is a GOAT",
            "u/Neetcode Thanks for your channel.",
            "love that guy",
            "Sir, this is a Wendy's !",
            "Good for him to do stuff he genuinely appreciates doing.",
            "What exactly is a neetcode?",
            "Did neetcode ever make a video about his background? Does he have a cs degree, no degree, or an unrelated degree?",
            "How come neetcode couldn't get a job if he is so good at leetcode that he can teach it? Sorry I am new to his channel",
            "Another Indian! So proud ahhhh! He is my inspiration!",
            "[deleted]",
            "Does anyone have Neetcode Pro discount code? I tried to contact him on insta regarding the same but no rply. The thing is that i don't earn that much i earn around 300$ and his pro subscription is half of my salary so any discount can help. \nEdit: If i can switch to a high paying job i would like to donate to him or buy pro for my friends or any college students.",
            "NeetCode is not reading this 😭",
            "Is it worth getting the pro version of his platform? I really enjoy his content but i would like to read some opinions",
            "Just checked it out and it’s insanely awesome tho it’s quite expensive for me!"
        ]
    },
    {
        "post_id": "t8x0m0",
        "author": "crackalack6",
        "title": "I'm graduating in two weeks, it has not hit me yet.",
        "url": "https://www.reddit.com/r/csMajors/comments/t8x0m0/im_graduating_in_two_weeks_it_has_not_hit_me_yet/",
        "score": 737,
        "num_comments": 44,
        "created_utc": 1646680766.0,
        "selftext": "Time flew by so fast, it's crazy. For everyone doubting themselves if they are capable of studying cs, you can do it. I am not special, I am just an average student that tried their best and worked hard. After hundreds of job applications and countless failed interviews, I have a job lined up for me which I am so fortunate about. I am so grateful for the sacrifices my parents have made in their life so I can have a better life. They are so proud of me. Most importantly though, I am proud of myself. Just wanted to share this with you guys, keep on pushing and it will all be worth it in the end.\n\n&#x200B;\n\nEDIT: Wow thank you everyone for the overwhelming support, I appreciate it. It has been difficult for me to be proud of my accomplishments because I sometimes think they are not special. I've learned however that whether its big or small, I should always be happy and proud of the accomplishments that I've worked hard to obtain.  Thank you again everyone",
        "permalink": "/r/csMajors/comments/t8x0m0/im_graduating_in_two_weeks_it_has_not_hit_me_yet/",
        "comments": [
            "Ppl need to post this kind of post more often than the shit posts",
            "rare wholesome post. grats man!",
            "How are you graduating in middle of March?",
            "Wholesome! Reminded me how I felt too before graduating",
            "Oh, hey, a fellow Anteater! Congratulations on making it to the end! Take the time to relax, enjoy the summer, and prepare for the next big milestone of your life!",
            "Congratulations!! I can't wait to feel this lol. We need more of these posts. Hope you find success after school in a solid CS career! :) \n\n(and don't forget to come back and tell us how things are goin!!)",
            "Looking forward to these same exact thoughts in my future. Good job!",
            "I love these kinds of posts. Will do one when I graduate in 3 months :)",
            "[removed]",
            "Congratulations! 🎉🎈🎊",
            "Congratulations man. No matter where you end up, never forget the people that sacrificed to get you there, and never forget that you also paid your dues as well.",
            "happy for you bro, now go kick some ass and retire early or do whatever makes you happy",
            "After dropping out of school and wanting to go back, this post gives me hope. Congrats on your soon-to-be graduation!",
            "congrats cracalack6 :)\n\nkeep us updated from your job.",
            "Awesome man! Hope everything continues to go up from here!",
            "This is inspiring. I'm a junior right now and just hoping I'm capable enough of finishing this out. Thank you",
            "I’m about to gradguate too but I’ve not been a high scorer. I just got by. Halfway though my BTech i realised i don’t like Cse and wanted to explore cinematography and write scripts and want to make movies. Everyone tells me there’s no future in that.\nI’ve lost all drive and i don’t know why. \n\nI didnt look for any jobs and and give any interviews, i always assumed that i will just join a course somewhere for film and television but now I’m facing the harsh reality that i have just depleted my chances with My career with my BTech degree and also the cinematography career May not be the most outstanding job market out there.\n\nHas anyone got any words of advice for me?"
        ]
    },
    {
        "post_id": "17pkr7r",
        "author": "Interesting_Two2977",
        "title": "I just realized applying without LeetCode is pointless",
        "url": "https://www.reddit.com/r/csMajors/comments/17pkr7r/i_just_realized_applying_without_leetcode_is/",
        "score": 745,
        "num_comments": 220,
        "created_utc": 1699326033.0,
        "selftext": "Okay for context, I have about 50 “easy” leetcode problems, but I’ll be honest, I had to look up the answer for 80% of those. \n\nI am getting online assessments and interviews, but genuinely feels pointless to attempt them because everytime I open one up, I can only code it through pseudo code and not with Java or C++. \n\nI know some of you aren’t even getting these interviews and OAs, but if you don’t know basic OOP concepts and/or leetcode problems, then there is no point in applying.\n\nThis isn’t to sh*t on anyone, not even myself. I just wanted to share this to let everyone younger know that the fundamentals are SOOOOO important. Don’t ChatGPT your assignments in Computer Science 1!!\n\nActually learn the concepts and practice leetcoding. Code everyday like you would go to the gym, because I know I have to do that. \n\nThanks for listening and good luck everyone!\n\nPS: Don’t stop applying if you know leetcode, so many positions are still open. Big tech and small companies. Don’t quit now, you didn’t make it this far to quit right before winning.\n\nYou’re knocking on the door to victory. \n\nOkay fr, good luck!!!",
        "permalink": "/r/csMajors/comments/17pkr7r/i_just_realized_applying_without_leetcode_is/",
        "comments": [
            "> Actually learn the concepts \n\nNo way bro  😱😱😱",
            "[deleted]",
            "Look for the same problem on leetcode discussion. People often post their solutions.",
            "Leetcode grinding doesn't teach you OOP concepts, reading the solutions people write and memorizing patterns is really the only thing that has helped me in an OA. Leetcode acceptance doesn't care if you wrote a million if else statements, but someone grading an OA does.\n\nLike this solution is a single line\n\n[https://leetcode.com/problems/return-length-of-arguments-passed](https://leetcode.com/problems/return-length-of-arguments-passed)\n\nDo it, and boom you added another thing for your Leetcode summary and learned absolutely nothing",
            "Good news is that if you want to code in pseudo code, you can just learn python. Imo it makes it much easier to do leetcode",
            "I finally don’t feel bad about my 60 easy/ 16 mediums",
            "Ok, I'm gonna break down my advice into 2 parts:\n\n1) You should still apply to roles. I don't mean for your dream role (maybe you have a company in mind you'd definitely wanna work for), but more like those \"safety options\". You will see what works to get an interview and what doesn't, what behavioural questions are like and how to answer them calmly and well-structured, and get some practice in how to answer technical questions, e.g., how to explain why and what you're doing while (pseudo-)coding your solutions. This is a skill that needs to be practised like any other, and the best way is during interviews you care little about. \n\n\n\n2) \"Grinding leetcode\"/hackerrank etc. is another skill in itself: How do you get the most out of it? Don't do too many problems at once. If you can easily solve one, then go on to the next. But when you get stuck, Google the question **conceptually**, i.e. \"count length of string\", \"efficient quicksort\", etc.. Do not copy-paste the question, learn to structure the problem and abstract its core concept. This is so valuable for your own skillset as well as to interview well. Once you found the solution and solved the problem successfully, summarise the concept in your own words and maybe add a couple of sentences on major takeaways. I prefer handwritten notes to myself but anything goes, from word doc to txt. The main point of this is that you do not just move on to the next problem but reflect. This ensures growth. If you do one or two problems a day it doesn't add too much to your day but you ensure growth on a daily basis. Good luck!",
            "Or just do what I'm doing and apply to companies that only give behavioral interviews lol",
            "Thanks for telling us what 99% of us already knew. Who would have thought you had to know computer science concepts to get a job,  right?",
            "Leetcode blind 75 is the way to go",
            "depends. lots of companies dont ask leetcode",
            "Honestly the biggest cheat code to leetcode is just to use Python. I love C++, but having a built-in list, dictionary, set, and the Counter class makes every problem way easier.",
            "where are you applying bro?",
            "Doing leetcode every day in hopes of getting a single interview...",
            "There are many applicants passing OAs perfectly, be different and fail them",
            "I've been in IT/SWE 20 years and have never needed or heard of \"leetcode\" until reading the subreddits here.",
            "Remembered the first programming Contest at our university. Questions were pretty easy, but everyone struggled implementing the solution. Knowing how to do an algorithm and implementing it takes a lot of practice.",
            "I've only solved one leetcode problem, and even if I look up the answers, I can't seem to solve leetcode problems.\n\nSo I tried stuff that's easier like hackathon, and it's so much better because I can solve the problems by myself without the help of anybody and make me feel like I'm so smart, lol.",
            "I never leetcoded but got offers. You just have to know how to mess with loops and arrays for the most part, bonus if you remember dictionaries from python. This is not the hard ones just easy/med lc which a ton of companies ask. Know loop tracking and debugging well like setting flags etc. and just try like a couple lc problems if you suck then go learn your data structures better (no need to memorize patterns or algo)",
            "Thanks for the insight bro. Will grind leet code whenever I find time with my school workload 😂",
            "Watch neetcode on YouTube, his older stuff where he gives problem breakdowns",
            "Is leetcode just an USA thing? Have never heard about leetcode in 5 years of programming. The only time I hear it is in here? I'm from west Europe if that matters.",
            "I've never done leetcode and I've secured 4 jobs",
            "[deleted]",
            "no way :(",
            "I've almost never gotten an OA for leetcode. It's usually been some logic-oriented coding assessments rather than testing for what data structures and algorithms you have in your arsenal. Other times it's stuff like showing you know how to use Context in React or make a button do something with HTML and Javascript.\n\nFor FAANG junior sde roles leetcode is probably common. I wouldn't know because I don't apply to those.",
            ">I have about 50 “easy” leetcode problems, but I’ll be honest, I had to look up the answer for 80% of those. \n\nI hope you see the obvious problem with this. You don't have to know everything but you will actually have to know how to write code and come up with novel solutions yourself when you work as a programmer. You're not going to be hired to look up the solution to Leetcode problems all day.",
            "Got an internship without studying any leetcode",
            "I've never leetcoded and got a well paying internship + full time return offer (last year). If you have a good understanding of programming fundamentals, you're fine. Having a portfolio of project(s) to point at helps too, or just being able to talk about notable work you've done in school in good detail.\n\nLeetcode definitely helps you prepare for the questions themselves, but it's definitely not necessary.",
            "Just apply and at least you'll get better at the interviews slowly. Your ego will take a hit but you'll survive.",
            "Thanks for the motivation I actually did stop applying for a week or 2 cause of lost hope",
            "Not everyone can code under pressure during an interview, so if you weren't able to actually get the implementation working, it's not the end of the world, its just some extra brownie points if you do.I think what's more important is the portion before coding where you try to articulate how you plan to tackle the problem. \n\nIf the interviewer has to coerce you towards a solution or give you hints, that's where I think you might lose the most points. My understanding was that the interview was basically over at that point. They might let you continue going and do the coding portion for the sake of formality and stuff.\n\nCoding is not for everyone, might be better to consider looking into business side doing requirements/management.",
            "I highly recommend the “cracking the coding interview” book.",
            "You should probably apply and do Leetcode at the same time. You can start off with some general lists like Neetcode 150, Blind 75, Grind 75, etc while you're waiting for a callback.\n\nAfter you get the callback, you can look at company specific questions in Leetcode.\nWhat do you guys think about this?",
            "I don't even know if leetcode is necessary to succeed in that. There are plenty of stuff that you have to train on. Writing code is only one of them. \n\nThis is how you got into uni as well in the first place.",
            "I'm so glad I didn't go into CS. It seems like a hyper competitive waking nightmare where you're always behind.\n\nI'll take my cozy IT job any day, even if it pays less.",
            "A lot of big companies are indeed asking leetcodes but there are start ups and consulting firms that dont even ask leetcode. They are looking more at your projects, internships and your soft skills. \n\nI have noticed that any company that pays above average will have a LC OA. Some people need to lower down expectations if they are freshies.",
            "Yeah leetcode is very crucial specially in today's market",
            "“can only code it through pseudo code not with Java” sounds like youare good at solving problems, but not so good at translating those ideas into code?",
            "Thankfully I took my CS courses before AI was a thing.  I keep hearing a lot about leetcode.  That's another thing that didn't exist.  So I'm changing careers, have a math degree, eventually completing my BSEE, but since I want to work remote, I'm concurrently completing a masters in SWE (there's reasons for the last part I'd rather not share with everyone).  So I need to knock out leetcode problems?  I counted 2950 problems after a quick search.  Some premium, and some not.  I guess since I have no industry experience and I'm going from a completely different career into engineering with hopefully a focus on the software side of things, I'm looking for a little guidance.",
            "I say I am not bad in leetcode or concepts but I can’t even get to that stage, it’s either straight reject or ghosting. My university said my resume is good so I don’t even know what can I do to just get a shot…",
            "Or just don’t be a swe 😩The mental capacity that good developers have is just surreal to me",
            "Look at this nerd over here, talking about studying and learning concepts. Just use chatPGT bro. Everybody can be a SWE now.",
            "What does your resume look like currently? Ik my application volume needs to be higher but I'm not getting too many replies back ATM.",
            "I can do leetcode just can’t get an OA/interview",
            "Who here took CS education somewhat serious and doesn't have to leetcode to feel confident in what they're doing? Just asking.",
            "Leetcode everyday like you would go to the gym?\n\nI already do exactly that, 0 times.",
            "For that I created one chrome extension named as Leetcode Forcer it force you to solve Leetcode porblem daily.",
            "Too many people who don’t like and have no aptitude coding trying to do it for a living smh",
            "You are getting interviews? I solved over 300 problems and haven’t gotten a single interview",
            "Leetcode is a waste of time. I have been in the industry for 10 years and every job that made me leetcode for an interview wanted to lowball me every time. It’s to create an illusion that the company is elite and that you should drool over working for them. I interviewed for a few FAANG companies and they wanted to pay me $40k less than the job I currently held. It’s just a fad and most of the time, the leetcoders make shit engineers.",
            "Counterexample: Never did leetcode. Have a job. I don't go to the gym either.",
            "How’d you finish a CS Major but can’t do lc easy or write Java/c++?",
            "Yeah it’s very different for you to actually go through a problem and solve it on your own vs looking at solutions. I started using [withmarble.io](https://withmarble.io) a chrome extension for Leetcode that allows you to jam back and forth on an approach before it guides you to code it",
            "leetcode is fun...",
            "rat race ahh post",
            "Hi Everyone,  \nI am selling my unused leetcode subscription, valid for 1 year. Please DM me if you need them. Selling it for $99",
            "F U",
            "I agree on that, theory and practice is very important. I made the same mistakes and suffering now.",
            ">Don’t ChatGPT your assignments in Computer Science\n\nThis should go without saying, but don't chatGPT anything that you're trying to learn about. This applies to your other courses too.\n\n> if you don’t know basic OOP concepts and/or leetcode problems\n\nYou should definitely know about some basic OOP concepts coming out of undergrad, even if you don't intend use OOP. Leetcode is helpful but not necessary.\n\n>then there is no point in applying\n\nIf you mean this literally, I disagree. Firstly, you might be overestimating what it takes to get the position. Secondly, even just getting an interview is valuable because that experience is going to grow your interview skills.",
            "you can know basic oop concepts & basic dsa & still definitely fail a bunch of OAs. i have only passed 1 OA out of the many i’ve taken and it’s definitely because i haven’t been exposed to many similar leetcode problems. i too have mostly done easies & i can’t past most OAs even with close to 100 problems completed.",
            "I've literally never touched Leetcode in my life and have gotten farther than 99% of Reddit. You guys need to focus on your soft skills and office politics a bit more tbh."
        ]
    },
    {
        "post_id": "10guayo",
        "author": "Successful-Gene2572",
        "title": "UT Austin CS dept tells students that jobs offers \"may not come from MAGA (Meta, Apple, Google, etc). They’re going to come from places like G.M., Toyota or Lockheed.”",
        "url": "https://www.reddit.com/r/csMajors/comments/10guayo/ut_austin_cs_dept_tells_students_that_jobs_offers/",
        "score": 744,
        "num_comments": 217,
        "created_utc": 1674213101.0,
        "selftext": "[https://www.nytimes.com/2022/12/06/technology/computer-students-tech-jobs-layoffs.html](https://www.nytimes.com/2022/12/06/technology/computer-students-tech-jobs-layoffs.html)\n\n“Students are still getting multiple job offers,” said Brent Winkelman, chief of staff for the computer science department at UT Austin. “They just may not come from MAGA (Microsoft/Meta, Apple, Google, Amazon). They’re going to come from places like G.M., Toyota or Lockheed.”",
        "permalink": "/r/csMajors/comments/10guayo/ut_austin_cs_dept_tells_students_that_jobs_offers/",
        "comments": [
            "The article itself is definitely worth a read. Kinda crazy Roblox gets 50k+ applications for 300 intern spots damn.",
            "Move over FAANG, it’s all about GTL now. Bring back the Jersey Shore guys",
            "Sometimes I think maybe FAANG is the best acronym, albeit outdated",
            "I am not eligible for Lockheed but they are hiring like crazy.",
            "This makes me happy being a dev for a company that's not big tech. While I don't make as much as a FAANG developer, there is more stability in my current role with good benefits.",
            "Does the company matter? Salary is what gets me up in the morning. Who cares if you work for Google or Walmart so long as the salary is good.",
            "UT Austin cs student here. Applied to 130 internships and got nothing as a junior. Not even GM replied. Have 6 years of consecutive SWE internship summers before this.\n\nEdit: For more context, I had a return offer from a startup which has since gone under but wasn’t informed that I wouldn’t have a job until mid December, meaning all 130 of these applications have been in the last month. I suspect more than half of the job postings I applied to had already been filled by the time I applied. Not sure if applying in January is a lost cause but I’m trying it anyway.\n\nAny advice would be appreciated.",
            "Surprised this Decemeber piece had so many comments, ends up ppl are just arguing the acronym🫠",
            "I hope to work for Lockheed",
            "IT’S MAAAM!",
            "Whatever job it is, I will accept it if annual salary is over 60k/y.",
            "We are 100% not using MAGA as the acronym.",
            "To can bypass the NYT paywall with this: http://archive.today/",
            "Intern:  I'm first in my class a <big name school>.  In my last internship I used a custom deep learning application I wrote to optimize back end system performance and improve end user experience.\n\nMe:  That's great.  Here's a PLC and a hard hat.  The machine you're working on is 85 years old and there is no documentation or electrical diagrams.  Be safe out there.",
            "I’ve been saying this forever, fuck you Maga and faang offers.  Go into defense companies or federal government.",
            "I remember when I posted last week on how many computer science students ACTUALLY get these six figure entry level jobs and if constantly grinding leetcode is worth it for the average cs major, and this entire sub disrespected me so badly I had to delete the post. \n\nBut what I was saying is just common sense. These top paying companies only have so many spots and can afford to be ridiculously selective.",
            "Not true. Even those places are saturated.",
            "Lol they act like those other other than big tech companies just have a spot waiting for them  after graduation. The reality is that those places will become just as selective.",
            "International student Lockheed lmao",
            "Yeah that's pretty expected but once the market gets better it shouldn't be that hard to hop to a big tech",
            "God forbid u get a job that pays the bills and isn’t one of maybe 10% of the jobs available in the industry",
            "I was even prepared for this kind of reality during pre-pandemic hiring. My dad told me to analyze the team, the manager and the coworkers before even accepting a offer. My priority during my first year at working as a engineer was to get exposure on how a development works in a corporate setting, how to handle teammates and disagreements and how to improve myself so I can adapt to the company process sooner and start delivering sooner. As soon as I got exposed, my career goals changed and I no longer attached my goal to a company, but rather questioned where I would thrive long term. I was MAGA crazy, however that changed during the first year at work. It was a lot of work to humble myself, and to change the tune that it’s okay to not work in a MAGA company, the team and the type of manager and the type of work and the value that it generates is more important than being unhappy at a MAGA company and not delivering anything of value. It’s more important to save money and better others than to show you’re earning too much money. \n\nTBH, I’m still learning and changing my behaviors and trying to see where I will create value. I still want to earn more money, I just don’t see myself doing it in a MAGA or coinbase. For me, WLB with a good pay and good insurance with a good amount of leaves is more important than being overworked and burned out like my friend is in Google. My other friend works at insurance and she makes big bucks, along with a great pay bump and additional benefits to the promotion she got this year. She loves the work after switching two teams and her manager always gives her high revenue generating projects to work on. She was smart in capitalizing on her talent with devops and really proving to her manager that she created a good value in one of her initial projects. \n\nIt’s not about the company, it’s about the people and how you “show” your work to them. That requires a certain level of craftiness.",
            "And that’s completely fine with me",
            "Me who just got my 5 rejection Email from Lockheed: Are you sure about that?",
            "Yeah let's lose that acronym. I know there are many outside the US in this sub,  but that has really negative connotations.",
            "There’s a problem with prestige chasing, most people can’t accept that working at Ford might actually be more impactful on the world as a whole than working at Google because Google’s PR is more exciting.",
            "Why is it called MAGA if it's Meta, Apple, Google, and then etc, which starts with an E not an A. \n\nWhy are they forcing this political slogan into this? \n\nI am so confused by that acronym.",
            "With the saturation of the field, most cs jobs are going to pay 80k now"
        ]
    }
]