[
    {
        "post_id": "18aw50z",
        "author": "Dazzling-Rooster2103",
        "title": "0 leetcode problems solved, $70k new grad salary.",
        "url": "https://www.reddit.com/r/csMajors/comments/18aw50z/0_leetcode_problems_solved_70k_new_grad_salary/",
        "score": 734,
        "num_comments": 202,
        "created_utc": 1701728643.0,
        "selftext": "Just wanted to put it out there that it is possible, I got my offer today for $70k/year, fully remote at a pretty big company. And so far, I have done 0 leetcode problems in any of my interviews.\n\nI got an internship, and a new grad position while spending no time on leetcode.",
        "permalink": "/r/csMajors/comments/18aw50z/0_leetcode_problems_solved_70k_new_grad_salary/",
        "comments": [
            "What were you asked in the interviews? Is the new grad job at the same company as your internship?",
            "congratulations bro, getting 70k in this economy is great, people aren’t even getting jobs. i don’t know why everyone is so negative about it.",
            "\nWeird mix of condescending or salty vibes in some of these comments. Congrats that’s awesome! 70k is fine for a new grad especially in this market and at low cost of living. And plenty of companies big and small don’t do leetcode, even tech companies. I’ve been at a few jobs now( 2 internships and 2 jobs) of very different sizes and never had one in an interview. I mean yeah it’s the standard at the most major tech companies that pay the best but plenty of devs still don’t have to",
            "Congrats OP.\n\nThe salt in this thread is hilarious.\n\nThat's a W.",
            "The stench of jealousy oozing out of all the leetcode degenerates with no job is astonishing",
            "But someday you will get the hard leetCode problem on an interview 😏😏😏",
            "Lmao idk why you losers are getting jealous. Quit bitching and keep grinding. Congrats OP! May i wish you a great career ahead.",
            "I would rather have no or real life based technical questions than leetcode",
            "Congrats on the new job. The first one is always the hardest.",
            "ok",
            "Same, internship, 3 job offers, not 1 leetcode problem",
            "What company",
            "This gives me hope, even though I have spent a good bit of time working through Leetcode. It’s tough to even get an interview right now for junior positions, unless you already had an internship with the company like you did.",
            "This my goal lol. Looking for a $70k-75k salary so hopefully I don’t have to deal with the LeetCode stuff.",
            "For the people being jealous about this, I think OP was saying this to give people hope that you don't need to grind leetcode to be able to get a job. Don't think it was necessarily a brag",
            "Master or bachelor?",
            "I graduated in May and secured an offer in February at a mid sized bank without doing leetcode. I did an internship in php/laravel with some basic frontend prior to that. This job hired me for my experience in php/laravel mainly. Finding jobs without leetcode is possible, but they will probably be specialized stacks looking for specialized skills like mine was. If you don’t want to grind leetcode but did an internship in a specific stack, hone in on that specialization and you will find a company looking for the skills that you offer.",
            "Yo congrats dude! Staying persistent, keeping your head down and grinding where it counts paid off.",
            "congrats ignore the salty folks :)",
            "Congrats my guy u should b proud of urself",
            "What I have observed among students is that they are engrossed in Leet code and stuff. Leetcode can only help you in acing the interview but projects and experience get your foot in the door. In current market situation, Landing an interview  is nearly impossible. I think luck also plays a role as I have seen people getting jobs right after graduation without any internship experience.",
            "0 leetcode problems and 130k new grad. We're both lucky asf lmao",
            "Congratulations with your with job!",
            "W OP, congrats man",
            "That's amazing, congratulations!! $70k starting out as a new grad is great in any economy, and fully remote at that!",
            "Leetcode is only for faang level",
            "People looking for this, go for government and bank jobs",
            "Congratulations mate",
            "Congrats, good chance they don't like wasting people's time and are willing to train the right person",
            "People are salty af\n\nGood shit OP!",
            "What state??",
            "It can’t be that big of a company if you haven’t had to do any coding assessments",
            "How did you find this role--school career fair, school job board, LinkedIn, referral, something else?\n\nCongrats btw, that's awesome.",
            "I mean there are more companies that don’t ask leetcodes. Big tech and unicorn startup does, but regular company rarely asks leetcodes.",
            "You did 0 leet code problems in your interviews, FOR your interviews, or both?",
            "Lucky",
            "[deleted]",
            "why post this without saying how at the very least. connection probably?",
            "[deleted]",
            "Why is it so low?",
            "And your salary shows it. For 70k I wouldn't even get out of bed.",
            "70K is ass for an SDE bruh stop celebrating and go do leetcode",
            "No offense but for 70k salary this isn’t really a flex",
            "[deleted]",
            "70k is not great tho",
            "I have yet to see any salt and I won't look for them! But congrats on achieving this.",
            "Is this a swe position?",
            "Consulting or SDE/SWE ? Every company i applied there is a OA in the first round which has coding questions or aptitude to be least .",
            "Congratulations for getting the job.  \nWould you like to share how you got it? Like how did you reach out to them",
            "Same thing happened to me. I guess they just trust that you're gonna be able to handle it. Quite refreshing. They didn't ask a single technical question during any of the interviews. Although, this wasn't for my first job. Congrats!",
            "are you graduating this winter or in the spring?",
            "Congrats on the offer mate. And to other freshers who are still job searching like me:  \n \"We all gonna make it bruhs!\"",
            "What do you believe made you stand out?? \n\nFor all of us out still grinding 😅",
            "Same did an internship medium cost of living area 86k new grad salary. 1 behavioral interview before the internship.",
            "YOOOOOOO IS THIS COGNIZANT",
            "This is great and v happy for you :). Tbh leetcode is only going to help you if you’re chasing the top 20% of jobs that test you hard on coding. Many jobs don’t do this and leave people sufficiently paid and fulfilled.",
            "Congrats on the offer! How did you find the job?",
            "What industry is the company in?"
        ]
    },
    {
        "post_id": "178utt3",
        "author": "DungPornAlt",
        "title": "These interviews are impossible",
        "url": "https://www.reddit.com/r/csMajors/comments/178utt3/these_interviews_are_impossible/",
        "score": 731,
        "num_comments": 30,
        "created_utc": 1697420697.0,
        "selftext": "Nailed the OA, nailed the Hackerrank, nailed the Leetcode questions, nailed the behavior interview, 400.000% GPA, 16 previous internships, and I still didn't get the job because of a small issue like me having killed the interviewer's entire family. This job market is terrible, they wouldn't even let a 10 years old small mistake get by even though I was PERFECTLY qualified to do the job. I already told him it was not personal, and he was still shaking in fear. The prosecutors never found enough evidence to make the case stick anyway, and I was still rejected. Is this all because I need a H1B visa to work?",
        "permalink": "/r/csMajors/comments/178utt3/these_interviews_are_impossible/",
        "comments": [
            "Yah it might of been your internships bud, 16 internships that aren’t at faang companies? Your irrelevant.",
            "Right there with you bud.  I was so tired from leetcoding during the wait for my interviewer's family to show I had a bit of a tremor.  Winged one, missed another totally, barely got away.  I jokingly told my interviewer I was tired from carrying out a contract hit and he *couldn't.* take. a. joke.  \n\nI mean I was just joking, how was I to know his family was in the hospital after my attempted hit?  What are the odds?",
            "It's rough for international students. My friend killed 10 families and still got offers.",
            "Sometimes you just have to vibe with the interviewer (this is perhaps more important than anything else). Quite often the people that do the best technically and are \"PERFECTLY qualified\" don't do well at the more social (and subtle) aspects of the interview.\n\nAlso, not being a citizen does make it a lot more difficult.",
            "16 internships and not 1 full time job came from that? Huge red flag. Resume in the trash automatically for me",
            "You were a perfect candidate till the H1B visa showed up. I think that might be the reason why you got rejected. 💀",
            "Unpopular Opinion but I wouldn't mind if like half of the posts are like these from now on",
            "Sorry bud but veeeeery few companies are hiring people needing h1b visas. And there is a big difference between companies who are willing to sponsor but don’t get their candidate selected, and those companies that sponsor and get their candidates selected by the lottery.\n\nIf you are not applying for the top 10 visa sponsors in the country, any company has very little chance to sponsor you so they decline to even hire you. We are talking about single digit chances of getting through the lottery.\n\nThis is coming from a an intl student who lived through 3 different lotteries. Companies are weary.\n\nEdit: it’s hb1 not h1b1",
            "If it's because you need an H1B sponsorship, you would have never gotten the interview to begin with.",
            "Did you kill them in O(1) time?",
            "Guys do you have any student loan, I’m debating on taking some students loans when I transfer to a university is worth it?",
            "American Psycho",
            "16 internships? Holy f",
            "Hahaha this made my day",
            "Comic genius! <Inserts rejection letter here>",
            "It is quite pointless to whine about how bad the market is all day. I’m so sick of doom and gloom posts.",
            "Brings new meaning to \"killing the interview\""
        ]
    },
    {
        "post_id": "yfsm5f",
        "author": "Wonderful-Job-1459",
        "title": "Stop worshipping companies",
        "url": "https://www.reddit.com/r/csMajors/comments/yfsm5f/stop_worshipping_companies/",
        "score": 738,
        "num_comments": 77,
        "created_utc": 1666973571.0,
        "selftext": "Some of y'all need to stop worshipping some of these companies that treat us like shit and get a life. like its seriously annoying.",
        "permalink": "/r/csMajors/comments/yfsm5f/stop_worshipping_companies/",
        "comments": [
            "Is anyone going to Amazon's scripture this Sunday? If so, what passage do you think father Bezos will shed light upon?",
            "Apple cured my penile cancer (they removed my penis) fuck you OP",
            "Facts gangy. You dropped this 🏅",
            "Based.",
            "And also grow a pair when you have to wait for a response - you are one of thousands applying for your shitty internship - you aren’t special and you won’t be dealt with faster than anyone else in the thousands that are applying",
            "[But](https://www.reddit.com/r/csMajors/comments/ssoece/i_want_money_all_i_want_is_money/)",
            "Nice to see some other people are sane on this sub.",
            "Touch some grass guys. Start a side hustle and pivot there soon lads.",
            "Yeah but if I don’t work for Google what’s the point of my life",
            "Lots of “faang” aka amazon people here who do this, mostly as copium",
            "[removed]",
            "In the last 2 years, I've heard more people tell me not to worship companies than actually seeing people worship companies. Please for the love of God stop pointing out the obvious.",
            "So is this some new Leetcode hard or expert level or whatever the top level is challenge?",
            "FAANGGGGG",
            "no. where else am i supposed to get my self worth",
            "I don't worship companies but I do worship money.",
            "i think some ppl in this sub just need a gf",
            "Also, (and I know this will go against the grain here), but please consider what kind of company you wish to work for and don't sell your soul for the sake of a higher salary.\n\nI know that companies come with high salary and high prestige, but what goes on behind the scenes of these companies sometimes is scary and they are actively participating in a lot of major downfalls (Google removing [\"Don't be evil\"](https://gizmodo.com/google-removes-nearly-all-mentions-of-dont-be-evil-from-1826153393) from their code of conduct anyone?). Don't sell your souls and fellow humans out by supporting the work of these companies.",
            "Correct",
            "especially the ones that have products like a to-do list 🤡",
            "How about we let people do what they want. If they want to put in minimum effort and spend all their time in their hobbies then great. If they want to spend all their time working then also great. If they want to fall somewhere in the middle, you guessed it, also great.",
            "MAAAN\\FAANG sycophants need to learn the hard way. Much deserved.",
            "Sure. When I land an internship",
            "But some of them pay really well and are still hiring... :/",
            "No.  Praise Raytheon.",
            "Don't disrespect BlackRock 😡",
            "[deleted]",
            "Cry is free. So is having a weak mental",
            "The treatment part I don’t know. Generally not. I don’t think it’s worshipping the company. More like SWEs are looking on other fields from the high horse, the younger ones especially. They would be spending 2 years to be an employee #20001 at big tech and wear it as a badge.",
            "But I made coding and Bezos-simping my entire personality!",
            "You could say,\nThese people need to grow a pair of faangs",
            "Who’s gonna pay me and let me buy a house ? Theses companies will !",
            "> stop worshipping some of these companies that treat us like shit\n\n??? Nobody is out here worshipping a company (from a prospective employee perspective) that treats their employees like shit.",
            "But money",
            "One of us! One of us!",
            "Only thing i worship is the money give me all that shit",
            "that post nut clarity from meta crashing",
            "Motherfuckers will literally apply to a top tier company and then make a post 7 days later like \"🥺 has anybody got a response\" like holy fuck",
            "And the thing is, seeing this so often makes me feel like it’s normal. I find it hard to even think of myself being successful if I don’t manage to get a job at one of these companies some day. I feel like the obsession people have with them and nonstop chatter about getting jobs there has smashed my confidence"
        ]
    },
    {
        "post_id": "rimmvn",
        "author": "bgbgb_",
        "title": "I just graduated",
        "url": "https://www.reddit.com/r/csMajors/comments/rimmvn/i_just_graduated/",
        "score": 735,
        "num_comments": 72,
        "created_utc": 1639762822.0,
        "selftext": "wtf\n\ncs + math major and going to have an 80k software engineering job starting in February. I don't really have much more to say but I wanted to share this crazy piece of news from me.",
        "permalink": "/r/csMajors/comments/rimmvn/i_just_graduated/",
        "comments": [
            "damn dude congrats!",
            "my guy if you majored in cs and math then you will literally become a money printing machine. congrats",
            "As a fellow CS + Math major, I couldn’t love my decision to take this path more if it married me.",
            "Nice. I graduate next year at this time, and I’m pretty nervous for what lies ahead.",
            "Congrats dude! did leetcode help in the journey ?",
            "Congrats, you made it 🎉🎉",
            "Congrats bud. It's only up from here!",
            "That's amazing! My 1st job paid me $20/hr in FL. Now I'm working government as GS-12. (About $87k in MD) 😁",
            "Congratz man! These are the kinds of posts i like to see! Honest, and succinct. No bs \"heres how i did it\" to mask bragging, no circlejerk or toxic backlashy salary rant. \n\nYou worked hard, got a good position and are starting your career! It's a really weird feeling for sure. I remember how I felt... but ride that high, keep learning and growing and you will accomplish great things! You may struggle with this shift a bit. I certainly did and had some imposter syndrome... but remember to allow yourself to feel good too! It's healthy and will help you perform better, after the disbelief wears off lol. They chose you and believe in you and that's more than enough reason to believe in yourself. \n\nSorry to rant, it's just some advice I wish someone told me when I landed my position. But if you are ever worried about performance or whatever, just know you are not alone in feeling that way, many if not most people do. But they all grow and evolve, and you will to. Trust the process, and again, congratulations!",
            "I graduate tomorrow and I am looking for a job. Congrats though, wishing you all the best!",
            "Invest",
            "was in your shoes almost exactly a year ago! It only gets better. congrats!",
            "i'd die double majoring in math as well, nice job",
            "It’s exciting but focus on work your first few months. Work is so much different than school",
            "I've always thought that along with the obvious career prospects, cs+math affords an interesting lens to view the world through. You start seeing things in terms of optimization, utility, abstraction, modularity--it can be a blessing and a curse. Better than a business degree at least?\n\nAnyways, congrats! You should be proud.",
            "Congrats!!!",
            "Congrats 🎉",
            "That's literally leveling up in real life, man. Well done!",
            "Any tips on getting internships?",
            "Congrats 🎉",
            "Congrats! Welcome to the rat race",
            "good for you. congrats my g",
            "Gratz man. Always feels good to come out the long road on top. \n\nGo an treat yourself, celebrate. Listen to that song you listen to when you triumph. Good luck in the future.",
            "Yo congrats",
            "Who asked",
            "Do you mind sharing your resume?",
            "Where’s this located bro?",
            "That's amazing, dude! Can I ask you if you ever did an internship?",
            "CONGRATS !",
            "Did you take Elementary Number Theory? If so, how is it... kinda nervous bc linear Algebra was rough man.",
            "Congrats. How was your graduation journey?",
            "#ELONMUSK",
            "Congratulations! Are you starting out at JPMC ?",
            "Dude fucking congratulations"
        ]
    },
    {
        "post_id": "1agmu8w",
        "author": "menace_to-society",
        "title": "Seeing all these tech stocks pop on earnings is sickening",
        "url": "https://www.reddit.com/r/csMajors/comments/1agmu8w/seeing_all_these_tech_stocks_pop_on_earnings_is/",
        "score": 736,
        "num_comments": 201,
        "created_utc": 1706824616.0,
        "selftext": "Meta is up almost 15% after earnings. They issued a 50 BILLION dollar stock buy back along with a DIVIDEND for the first time ever. These companies keep making a fuck ton of money and pleasing the shareholders but keep doing layoffs. I'm absolutely sick to my stomach... ",
        "permalink": "/r/csMajors/comments/1agmu8w/seeing_all_these_tech_stocks_pop_on_earnings_is/",
        "comments": [
            "Just be a shareholder bro.",
            "Nvidia made me so much money this past month and I don't even work there lmao",
            "Yeah be a shareholder, I’m having a great day hearing this news lol",
            "They over hired. A lot of people working on things that don’t really matter for bottom line. That’s the sad truth. We really don’t need 500 data scientist doing random experiments for 400k salaries.",
            "I don’t understand. They’re laying people off and making more money. Isn’t that the goal of layoffs?",
            "Lol, they literally announced that they're going to start hiring more aggressively in the same earnings call.",
            "I mean they gotta do whats best for the company. Sucks but that's life",
            "I enjoy it. Too many \"I work 0.3 seconds a year and make 23402354023895028350 dollars a day as a SWE\" online. Clearly there was bloat",
            "Boohoo. The capitalist economy made it so that tech could offer a fuck ton of money and get whatever engineers they wanted. And because of that same capitalist economy they can do whatever they want and claw those jobs back. It sucks, but it’s not like those jobs in any other country could’ve offered the same salaries anyways. They’re not obligated to make sure you have a job no matter how much money they’re making. The fact that they are laying people off and making more money shows that lots (not all) of the engineers hired during the boom were bad and now it’s caught up to them. If you hopped on the trend for money then you’re not lasting long. If you were going to stick to CS regardless because you genuinely liked it then you’ll be fine.",
            "!remindme 1 year",
            "Why? They were bloated with overpaid developers. There was a delay in the feedback loop.",
            "Pay to play baby. You can also join a company where shareholders = employees.",
            "You think that's bad, I had calls on Google and Microsoft and they went tits up, so I sold my meta and amazon calls yesterday because I'd been burned and figured earnings would be disappointing there too.",
            "Maybe buy stock and be a shareholder yourself 👀",
            "Lots of companies over hired during covid and now they are correcting that. But it also seems like we’re headed for a recession due to the consistently high interest rates. \n\nIf interest rates go down then we may start to see improvement in the market. Until then I wouldn’t get my hopes up.",
            "It takes a special breed of entitled to complain about capitalism after majoring in CS for capitalistic reasons...",
            "Google dumped 7% on earnings. Does that really make you happy? 😂 I’d rather hope these companies are doing ok so that when the economy is finally better, there are still jobs lol.",
            "they're beholden to shareholders can't really blame them for doing what is going to bring stock value",
            "You know that you can be one of the shareholders right?",
            "From their report \"Second, we anticipate *growth in payroll expenses* as we work down our current hiring underrun and *add incremental talent* to support priority areas in 2024, which we expect will further shift our workforce composition toward *higher-cost technical roles*\"",
            "You need to get this fundamental idea through your head: jobs don't exist to give people jobs (at least in the private sector of course)\n\nThey exist because a given company thinks it can make money for their shareholders.\n\nThat's it. These companies are perfectly entitled to do this. You can't stop it",
            "Welcome to capitalism. You may have thought that you're special and unique and talented, but managers just see you as grist for the mill. So when you see union workers striking and picketing, you now now why.",
            "You think this shit a charity dawg? They can do whatever they damn well please. It’s harsh but it’s true",
            "What makes me sick to my stomach is the vast amount of people who are so misguided, they convinced themselves that any time a company is making lots of money, it somehow means there are no reasons to do layoffs.\n\nCompanies do not exist to keep people on the payroll. It’s a common side effect of the actual reason companies exist - to please it’s owners.",
            "Why do they owe you a job? This is a wildly entitled post. I’d rather pocket 200k than hire this guy",
            "You’re not entitled a job at Meta",
            "Do you know why they make money? Because they invest money in new and successful ideas, while cutting their unsuccessful ideas. Do you know why they are laying people off? Because a lot of their ideas turned out to be unsuccessful. Despite this, there’s more tech jobs than ever. Kodak was a tech juggernaut, until it collapsed due to its own weight. You have to be agile to survive, it’s better for layoffs to occur than for companies to fail. Wages are up, job openings are up, and the future is bright.",
            "its not just tech stocks. It's honestly the stock market, which is totally unrelated imo from tech workers, and these layoffs. A lot of financial markets, and stocks doing well...including crypto. All recovered from 2022 lows after covid highs, the last 4 or 5 years have been absolutely abnormal times obviously.\n\nWhat goes up will eventually come down IMO, such has always been the case for markets. There is high likelihood of a recession in the next 1-2 years.\n\nI remember feeling such FOMO as did many people back in 2021, and it all came down in 2022. That's called a mania, and again it feels a bit like that in many ways esp. in AI. These days, I don't think paying attention to what happens in the stock market is important personally. Because things go up and down all the time. People instead forget about what's really important in their lives in all the mania.",
            "Meta increased employees by a huge amount during the pandemic, then laid off 20k+ of that amount in 2023. Now it seems after a positive end of 2023 they are looking to strongly hire again",
            "so tell us, if you were in charge, what would you do, be specific please",
            "Welcome to late stage",
            "Union, socialism, organized planning, democratized workplace",
            "You have to realize a few things. Previously, they intentionally OVERHIRED in order to reduce competition. The theory being if they pass up a good candidate, they may work for a competitor or startup that threatens them. Once the market dynamics shifted and they wouldn’t go up in value just for being a tech stock, they started laying off and running a tighter ship, to actually become profitable. Now they’re printing money. The good news it, because of how profitable these companies are right now, economics suggests lots of new companies will startup and hire people, and there’s space for more.",
            "Welcome to Cyberpunk2024",
            "!remindme 1 year",
            "Aren't they hiring a bunch too? Seems like their near peak number of employees. Idk the lay offs seem out of context",
            "All y'all need is faang, ai5, and mag7 stocks... Nothing else it seems...",
            "It’s not about you. Large tech companies have the most exposure or in other terms “risk” of interest rates, monetary policy as well as political risk (notice how Zuckerberg and a few other tech CEOs had a deposition in front of congress to explain why they are failing at protecting minors on their social media platforms) \n\nOn the other side you have the central bank and the politicians. Their largest predators are tech monopolies. Politicians are scared of consolidation, they can smell the privacy issues and the amount of power private entities have. \n\nWhen interest rates get higher tech giants get reduced margins. They promised their shareholders growth and are liable to deliver that growth. So the tech companies decide to cut cost. You make people go back to the office, cut some benefits and let attrition do its thing. If people are stubborn and interest rates remain high tech monopolies shell out severance packages and let people go. The more unemployed people politicians have the more they have to ease off the pressure. \n\nIsn’t it strange how USA is floating above 5% fed fund rate and unemployment is super low? The labour force participation rate actually increased by 0.1% to 66-67% \n\n\nSo again: it’s not about you, the reader, it’s a dick-measuring contest between governments and international holding companies. It is cyclical, tech giants tend to overstaff, 2024 Q3 and beyond in 2025 the job pool will get much better than today, you just gotta survive and get good in the meantime.",
            "All about churn and options/seniority resets",
            "Google dropped by almost ten percent",
            "Stock buybacks, at least in the US, were illegal until 1968. They were considered a form of stock price manipulation. The only people who get any significant benefit are large shareholders and some of the C-suite executives, usually the CEO and CFO, whose bonuses are almost always ties to stock performance.",
            "This is how a company functions, to the higher ups, employees are nothing more than figures on their excel sheets.",
            "That's why the stocks are going up",
            "I’m so sad I didn’t buy Nvidia 😭",
            "More entitled whining from r/csMajors",
            "What about that makes you sick to your stomach? Clearly these employees weren't needed for the business to operate profitably. All these people were getting paid huge $$ to work there. The company just has to keep paying them forever if they're not needed?",
            "Nobody owes you anything",
            "I'm up like two thousand already today lol, actually insane when you have money to invest",
            "Layoff of 30% of the company, $50 billy dividend",
            "Buy options",
            "And? Just don’t suck at coding. Too many horrible swes/grads. We have the issues of too many potential swe who are horrible and lack of good ones.",
            "Yea tbh Elon firing everybody at twitter made these companies realize they get rid of a large chunk of their staff without losing any functionality of their product. Those TikTok videos of people showcasing their daily life working in big tech and not actually doing any work didn’t help at all either",
            "This makes you sick? Big tech companies always go through periods of layoffs for the nonperformers."
        ]
    },
    {
        "post_id": "17qlyhp",
        "author": "Sufficient_Wait_8559",
        "title": "Good luck international students!! Google does not sponsor immigration VISA for new grad.",
        "url": "https://i.redd.it/ftfunk5ko4zb1.png",
        "score": 737,
        "num_comments": 144,
        "created_utc": 1699451082.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17qlyhp/good_luck_international_students_google_does_not/",
        "comments": [
            "Why would they with all the layoffs?",
            "Some companies do not support sponsorship only for specific roles. Probably when it needs security clearance.",
            "That same exact message was found on the same exact postings in 2020. These are quite specific positions and does not mean they stopped sponsoring for all new grads. \n\n[https://www.teamblind.com/post/Google-stops-immigration-sponsorship-for-new-grad-MASbYMhw](https://www.teamblind.com/post/Google-stops-immigration-sponsorship-for-new-grad-MASbYMhw)",
            "Are you sure this is not a security clearance thing relevant to this specific position?",
            "Layoffs are pretty common now, would make sense to limit international new grads.",
            "You do realise these listings are there to make a case WHY they need to sponsor? Goodluck getting a callback from such postings, they are dead postings just to prove the company’s point.",
            "The position might require security clearance that only American can obtain...\n\nAlso, you're a new grad. Get some experience in your own country.... Just because it's google, does not mean they will always auto sponsor everyone. Sponsorship is expensive, like 10-20k per person ....",
            "Internationals fucked up the market so it's good that some sanity is coming back.",
            "I mean, CS and IT really shouldnt qualify for H1 anymore.  There's no longer a talent shortage in this area.\n\nBut ngl I'm not opposed to Indian Restaurants becoming H1 jobs.  Could use some better butter chicken in my neighborhood.",
            "This seems like one of those weird requisitions that are used to justify green card sponsorships for their existing employees. \n\nOne of the requirements is that they are unable to find a suitable qualified US citizen for the same role over a 6 month period, so it's likely for some PhDs who are already employeed within the company.",
            "I mean tbf.    \nNo company is *obligated* to sponsor immigrants.\n\nAnd in the long run it's for the best. US citizens get access to better jobs and immigrants get to bring back home the talent they accumulated at top tier universities.",
            "[deleted]",
            "Why should they ? About time they stop all this sponsorship bs and start hiring the locals.",
            "Go work in the Netherlands  or Switzerland. Amazing quality of live and also great salaries, plus all the benefits healthcare and social security. And easier visa sponsorship. \n\nThe obsession CS grads have with wanting to work at FAANG companies is cringe.",
            "💀 why y'all study CS\n\nGoogle is an dumb company.\n\nGoogle:\"you don't need a CS degree to work with us\"\n\nGoogle:\"We hired a 17 year old kid\" \n\nGoogle:\"Get a Google certification and become an bartender\"\n\nGoogle:\"We lay off a bunch employees but why my search engine acting up strangely\"",
            "Can't say I blame them right now when \"supply\" is up.",
            "Good they should hire more locals.",
            "how do you even filter by newgrad roles?",
            "I mean if you have a PhD and are competitive for google in the states, you have a fair shot of being eligible for EB-1",
            "Why should the US even issue OPT to international students anyway? The job market is saturated. Deport them already.",
            "Good. Reasoning: layoffs.",
            "[deleted]",
            "This is probably only for a specific role\n\nThe best and brightest minds are usually not US citizens. There’s no reason a company like Google would completely shut off hiring non US citizens for some reason lol.",
            "I don’t think you should take this seriously until you see a news story about this. This would be actual news.",
            "I don't care. I will still apply. It's their job to reject.",
            "If they don’t sponsor, does that mean that, if you’re an international and completed a PhD in US, they’ll wipe their ass with your F1 status?",
            "Based",
            "Doesn't matter. There are other companies too, it's not just Google alone. And almost all the international students will get their PR anyway. So it's not gonna make a big difference either way....",
            "This is shit pay for the type of candidate they're looking for. They're assuming people are desperate",
            "Wow they’re offering 200k in Durham ?"
        ]
    },
    {
        "post_id": "oyjxm5",
        "author": "jabbathehutt_69",
        "title": "Why does everyone here want a high paying and fun job? I don't get it.",
        "url": "https://www.reddit.com/r/csMajors/comments/oyjxm5/why_does_everyone_here_want_a_high_paying_and_fun/",
        "score": 734,
        "num_comments": 127,
        "created_utc": 1628175014.0,
        "selftext": "It seems like everyone here just wants to work for the big tech companies like google, facebook and apple. There is virtually no one who wants to work at the local barber's or plumber's website, and I just don't understand why.\n\nIn every other field, it is not like this. This would be like if most basketball players wanted to play in the NBA or if most football players wanted to play in the NFL, and that would have been crazy. It's definitely not like that right now, at least what I know of.\n\nSo why is this the case in software development? Why does everyone want the most high-paying and fun jobs?",
        "permalink": "/r/csMajors/comments/oyjxm5/why_does_everyone_here_want_a_high_paying_and_fun/",
        "comments": [
            "Why don’t people hate money smh",
            "This flew over the entire sub's head",
            "Lmfaoo y’all are quick with the shit posts",
            "I just want a laid back relaxed remote job that pays enough for me to live a decent life..nothing more.\n\nMan the stress of this field is killing me",
            "I like that you did not include Amazon in the list. Nobody would like to work at Amazon.",
            "r/woosh for the majority of this comment section",
            "This and the Alpha Male post in cs career questions are undoubtedly the best shitposts I have seen in a while.",
            "r/csMajorsCirclejerk",
            "By far the best shitpost on this sub",
            "I love money.",
            "I'm also in the minority opinion here. I never wanted to work at google or amazon. It sounds like no fun and just pressure nonstop. I never wanted an internship. I never stressed about leetcode. Well, a month after I graduated I landed a very well-paying dev job. No stress whatsoever. Everyone is nice. My team is nice and productive. Great bonuses. Great benefits. Got a 25% raise after my first year. I'm so glad I never wanted to pursue google or amazon. There are lots of great jobs that arent those places.",
            "Money, better buy me a football team",
            "If you can get a super good looking girlfriend/boyfriend/husband/wife by just practicing leetcode for a while will you do it or will you happy with someone really ugly",
            "LMAAOOO quality work OP",
            "Imagine not wanting to work at faang. 🤯",
            "[deleted]",
            "I think you answered the question in your post.",
            "The difference is that FAANG jobs are not fun, they’re soul crushing. Hell yeah, fuck work/life balance, lets sell our souls for cash baby!!",
            "[deleted]",
            "[removed]",
            "Grind leetcode",
            "Faangs pay better than other jobs. One summer I was offered an internship with Universal. Theme park admission was free, but they didn't cover housing and it would pay half of what Amazon or MSFT offered me. Other industries value tech workers less. Assuming equal pay I would have picked Universal - but that wasn't an option. People pick FAANGs for their expansive bennifts.",
            "[deleted]",
            "Except prestigious SWE jobs are much more attainable than an NBA spot, and they are much less luck based.",
            "I don't see this as satire.\n\nIt's like how everyone wants to get into MIT and Harvard... One thing to note is that applying to MIT or Harvard is not free - but applying to Google/Facebook is. If Google were to have an application fee, the number of applications will drop.",
            "[deleted]",
            "Thought you were serious at first. Then I read the post",
            "Social media bro, we only see the high paying jobs so that’s what everyone wants lol.",
            "Jokes aside, being in the early stages of a startup is quite fun too",
            "I got the joke but dont FAANG jobs make you work crazy hours?",
            "It's not the case, in my opinion. Everyone in their life aims high.. Be it a basketball player or a software developer, everyone wants to reach at the pinnacle in their respective fields. For software development it's FAAMG.. I am not saying that other firms are not producing innovative or fun products, all I am saying is that Google like firms are the front runner in their domain.. \n\nI am sure a football player at start would have definitely thought somewhere that he/she would like to play in NFL one day, until then whatever comes their way, be it a small league, one must be satisfied with it. But during this whole process, the person is not like, Iam doing well here, I do not want to play in NFL anymore. They still aims high.. Same is the case with a sft dev..",
            "😵‍💫",
            "Well hookers and cocaine are quite expensive",
            "Well, working on a site like that probably isn't gonna pay much. I did one for a tiny company & many of them can be done using something like Weebly. The bigger tech companies work on different things behind the scenes like optimization or build virtualization. If you go work for a small company then you'll have to do the work of 5 people everyday. That's cool when you're still fresh on the scene but it will catch up to you & burn you out. Going with a large company like Facebook or Google gives you the ability to do something different without having to leave the company AND the pay is not bad.",
            "Ego, Status and Youtube/Internet Influence!",
            "After 1 months, grade 11 gonna start, and I'm into game development, but idk yet, I'm thinking of being a solo game development and working on a big game through my college career, or I will join some game development company, but the problem is that game developer's salary is one of the lowest so idk...",
            "Hahahahahahah",
            "My brother in law worked 90/hr weeks for google and with cali expenses could barely afford it, now he works from home in Denver for a easy ass interview software company making 140k 😂",
            "Most basketball players DO want to play in the NBA… I’m confused..",
            "Might be a shit post, but I'm going to take it as a serious question.\n\nHonestly, I don't want a job at FAANG, even tho I think it could be fun. It could serve as a liminal stage in my life tho, but I couldn't even maintain the productivity for too long and I would be seriously concerned about ending up as a speed freak. Big tech disgusts me anyway. The capitalist dream of a successful career as a key to a happy, fulfilling life is nothing but a delusion for me. Even if the job is \"fun\", if it doesn't bring any meaning to my life, then I'm just wasting my time.\n\nSo, I guess a not-so-interesting job that leaves me with enough time and money to have a life on my own would be preferable to a fun, high paying position where I'd be just pawn in someone else's game.",
            "I don't know anyone who would take boring and badly paid over that in any field ;).\n\nI guess you mean something else by \"fun\" but still... \"everyone\" wants to be surgeon or sports orthopedist and not dermatologist or occupational medicine (they really struggle to find someone for the latter) . \"Everyone\" wants to have cool cases in court and not divorce law.\nMy wife studied veterinary medicine and half of them wanted to do the expensive horse medicine stuff in a posh setting, the other half classic cat&dogs stuff - nobody cared for fish or public health (again it's much easier to get something with the latter).\n\nOf course there are always people without much aspiration but that kind of people (many from my vocational school are that way) don't hang around in CS subreddits or whatever. They are glad their work day is over and they don't have to hear anything about CS anymore.",
            "I want to build robotic toilets.",
            "***BECAUSE WE DESERVE IT AFTER GOING THROUGH THE HELL THAT IS CS COURSELOAD, THAT'S WHY.***"
        ]
    },
    {
        "post_id": "melqp4",
        "author": "None",
        "title": "Tesla Job Interview",
        "url": "https://www.reddit.com/r/csMajors/comments/melqp4/tesla_job_interview/",
        "score": 733,
        "num_comments": 51,
        "created_utc": 1616876285.0,
        "selftext": "You’re never gonna have another interview like it.\nLast semester I applied for a software internship working on Tesla’s autopilot programs. There’s so much mystique around Tesla these days. Around Elon Musk. And let me tell you, he doesn’t have time for any of that in person. He’s a busy man, and an important one.\n\nThe competition for one of his internships is one of the toughest in today’s job market, and that’s saying something. I was doing technical interviews over the phone for weeks. One day, an interviewer called in the morning and grilled me for so long that I just straight up skipped one of my classes!\n\nSacrifices. Elon appreciates those.\n\nAt long last I made it to the final round. It’s true what they say-- he interviews everybody who will ever work for him. They flew me out to the Fremont factory in California, and my hands started shaking as soon as I stepped into the building.\n\nI was led into a conference room. And there he was. Elon Musk, in the flesh.\n\nWe exchanged pleasantries. Our tone was light, but Elon’s eyes never left mine. I could tell what he was doing. He was sizing me up. Testing the waters. Seeing if I would crack under the pressure.\n\nEver so slowly, we meandered closer to actual interview territory. “So your resume mentions app development. Tell me about that.”\n\nI had to stop a smile from breaking out onto my face. Oh, wow, Elon Musk read my resume!\n\n“So I, uh, had to spend a little time getting used to Swift, but--”\n\nElon cut me off. “You an iOS fan?”\n\n“Yes. Yes, sir.”\n\n“Here. Gimme a sec.” Elon disappeared from the conference room.\n\nI let out a shaky breath and collapsed into my chair. Was I doing great? Poorly? Incredibly poorly? I’d heard the stories. Engineers fired after screaming rages, careers snuffed out in seconds. Oh, god, he wasn’t coming back with security, was he? He was only gone for a couple of minutes, but it felt like hours.\n\nThe door crashed open. I sat back up, ramrod straight. Here came Elon, and there was something in his hands. It was a jet-black container, shiny and spherical. Except that it wasn’t a sphere, exactly. There was a dent near the top, and it flared inwards towards the bottom. What did that remind me of...?\n\nElon unscrewed the top and gently tapped some of the container’s contents onto the table. A whitish dust spilled out. He took his credit card out of his wallet and started chopping the pile into lines.\n\nMy eyes bugged out of my head. Elon glanced up.\n\n“Oh, no, don’t worry, it’s not coke. Take a look! You don’t have to worry.”\n\nHe slid the open container over to me and got back to his work. I picked it up. The stuff inside was a light gray, so he was right. It probably wasn’t coke. But what the hell was it?\n\nI heard a guttural snort, and I almost dropped the container before setting it down. Elon reared up from his desk with fire in his eyes. “Woah! Still kicks.”\n\nHe had a rolled-up dollar bill in one hand, and he shoved it into my face. “Your turn.”\n\n“Hang on. What...what’s happening? What is this?”\n\nElon looked at me like I was an idiot. “What do you think it is? Guess. I went and got this because you mentioned iOS. I want you to guess.”\n\nThen it hit me. That container. It wasn’t just a sphere, and it wasn’t just an apple.\n\nIt was an apple-shaped urn.\n\n“Oh my God, are you snorting Steve Jobs’ ashes?”\nElon did another line and clapped his hands. “Fantastic, man! Not a lot of people even know he was cremated. I knew I had a good feeling about you.”\n\nThis was a prank. It had to be. This all had to be one big, bizarre test, so I figured I would play along. “Security wasn’t that tight around his grave, huh?”\n\n“Nope,” said Elon, too calmly. “Security at Alta Mesa’s a joke. Couple of months ago I just stayed until midnight, dug them out myself.”\n\nElon dipped a finger into the jar and rubbed his gums. “You know I met him once? Steve. He was such an asshole. He hated me. My companies. Well, look who’s laughing now.” He smiled at me, then coughed. A grey, powdery cloud billowed into the air. I tried not to breathe.\n\n“Steve’s grave was unmarked,” he continued. “But that wasn’t a problem. I could smell him.”\n\nElon’s eyes started to unfocus. “I could smell the animus that drove his soul. The energy. And, soon, it will be mine.”\n\nNobody spoke for a while.\n\n“It will all be mine,” whispered Elon, and it was like I wasn’t even in the room.\n\nHe blinked. “Anyways. You want a hit?”\n\nFor the first time in what felt like forever I felt like I was allowed to speak. “...No, man, I’m good.”\n\nThere’s no way I can do this. I fought back the urge to gag. That’s a human being floating in the air right now. There have to be laws against that kind of thing, right? And even if there weren’t, this feels so deeply, deeply wrong. I might have to talk to the authorities after this. After all, I still have my character, my convictions--\n\n“Listen.” Elon clapped a hand on my shoulder. “One little bump, and you’re walking out that door with a job.”\n\nAnyways, I start next quarter.",
        "permalink": "/r/csMajors/comments/melqp4/tesla_job_interview/",
        "comments": [
            "Elon musk fan fiction?",
            "You are on crack. How did these ideas even come to your brain 😂",
            "CS majors don't get enough credit for our creative writing abilities.",
            "What leetcode question did he ask?",
            "I can’t believe how gullible I am lol. Snorting Steve Jobs ashes seems like something Elon Musk would do until I read the comments  and realized it was Elon fanfic lmao.",
            "What",
            "Read up to when Elon read your resume thanks for the laugh lol",
            ">“Oh my God, are you snorting Steve Jobs’ ashes?”\n\nHahahah reading this experience cracked me up, I had pretty bumpy day, I needed this.",
            "someone needs to switch out of cs and go into creative writing",
            "Lmfao I’ve interviewed for Tesla but this really still caught me off guard",
            "Yeah this happened to my buddy Eric",
            "I believe you.",
            "Please tell me you are/did minor in writing. Otherwise, dropout CS, you have clear talent or drugs for writing",
            "I stopped 1/5th of the way through reading this. Feels like it might be a  weird erotic Elon fan fiction. Edit in a tldr",
            "Yo should put this story on your resume",
            "Either you are a good writer or the stuff you smoke is really good!!",
            "What did I just read?",
            "I was so invested in this",
            "I want my 10 mins back of my life. I literary read it seriously thinking it was an actual ELon-Tesla Interview",
            "I serioustly thought this was real until a dollar bill and Steve ashes",
            "Obligatory fuck Elon for pushing his factory to reopen causing workers to come down with covid. \n\nFuck his going after the diver who helped rescue the kids in Thailand. \n\nI really hate the billionaire worship some people in this major have of him.",
            "Yeah , one time in my Amazon interview also similar thing happened. Bezos challenged me to prank call Zuckerberg in front of him. I was perplexed , not knowing what to do I fucked his wife. Long story short , they're separated now.\nAnd needless to say I joined the company a week later.",
            "I'm genuinely curious, how the hell did you come up with this?XD",
            "r/copypasta",
            "You had me for most of it lmao",
            "I'm pretty sure I've read this before somewhere.",
            "You got me bro loooool",
            "If only elon payed as much as he's worth for all his employees",
            "Hahahaha How many leetcodes you did before writing this?",
            "Where have I read this before? Hmmm...",
            "You got me in the first half, not gonna lie.",
            "Man i axtually thought this was real untill the lines",
            "Great fan fic!",
            "Hey, sometimes you’ve just gotta take one for the team. Get ready to sacrifice every single waking hour upon the altar of Musk. \n\n(Also, I definitely thought this was real until paragraph 6. :D )",
            "  the onlyfans.space is where you can find free content"
        ]
    },
    {
        "post_id": "1agrqow",
        "author": "Forward_Opinion6038",
        "title": "Mood rn",
        "url": "https://www.reddit.com/gallery/1agrqow",
        "score": 733,
        "num_comments": 48,
        "created_utc": 1706837559.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1agrqow/mood_rn/",
        "comments": [
            "To be honest, what were we gonna do as an alternative? Law, Medicine, and Finance all have way more prospective fresh-eyed undergraduates then actual entry-level jobs. The economy for white-collar work is just not good right now.",
            "There will always be jobs even if it means just handling the system for some random small company",
            "maybe not everyone needs to work in a faang company, the world doesn’t rotate around that.\n\nsomeone still has to build a saas backoffice that slightly make the life of some hr worker or an accountant easier with some shitty ui and laggy backend.\n\nthe layouts are just the expression of the stock market, and the market is fucked these dayz.\n\nit’s bad everywhere.",
            "while I am so with this I literally can’t think of a single better alternative.",
            "Do what you love and it’ll help you stick with it when it gets tough! I’d be programming whether I had a job doing it or not. Here if you need anything!",
            "You should quit and do a different career…",
            "lol if cs majors are struggling, everyone is struggling",
            "Neolib economy is a joke when an industry at this size can just collapse so rapidly.",
            "Even if you don't get a programming job right away it won't be hard to find a good IT job in the meantime.",
            "Damn before I start bachelor’s, should I switch to cyber security or something?",
            "What degree is that ?",
            "Yall really need to chin up.  The mass layoffs are a small correction after covid hiring. There is more demand for engineers today than four years ago.",
            "Do you like it? If so, you’ll be fine."
        ]
    },
    {
        "post_id": "17gi84e",
        "author": "VangekillsVado",
        "title": "Guys they actually say SWE",
        "url": "https://www.reddit.com/r/csMajors/comments/17gi84e/guys_they_actually_say_swe/",
        "score": 730,
        "num_comments": 73,
        "created_utc": 1698275824.0,
        "selftext": "Google just held a SWE workshop at my school and the engineer called it SWE (“sweee”) when he said it out loud. I’m switching to business that was the last straw.",
        "permalink": "/r/csMajors/comments/17gi84e/guys_they_actually_say_swe/",
        "comments": [
            "> switch to business\n\nWait til somebody says “EBITDA” in a meeting.",
            "I interned at Google last summer and everyone said “sweee”",
            "“sweeee” is the right answer…",
            "i’ve been hearing the term SWE said like that like 15 times a day since i came to college",
            "suiii",
            "Sweet",
            "Everyone who has been at one of the big companies for >1 year has heard SWE pronounced like that so many times they are desensitized and are about 6 months away from doing it themselves",
            "i'm not a swe, i'm a \n\n✨swé✨",
            "pretty sure business will have much worse abbreviations 😂",
            "I say s-v-ee",
            "No one in my company (including the IT Director) had ever even heard of a software engineer. We had to teach them what this role was and wasn't. If we started using SWE, they'd be so confused. No way are they ready for sweee.",
            "I don’t understand what is wrong with saying SWE",
            "The Society of Women Engineers is in shambles.",
            "No! Stay with us and go to Amazon where everyone say : SDE !!",
            "Was it the Systems SWE from their LA office?",
            "I thought that was normal. I've heard so many engineers at Microsoft saying \"SWEE\"",
            "😂",
            "Is it Sunday already?",
            "Why \"swee\" and not \"sweh\"? It's not eengineer, it's ehngineer.",
            "and how else are you supposed to pronounce it",
            "Everyone says swe. What rock have you been living under? Please don't tell me you say the letters individually.",
            "How do you say it? SW-ay?",
            "In my country, we say swee chai butterflyyyy",
            "We all said \"swee\" when I was in school too. But sometimes \"swee\" meant society for women in engineering",
            "It’s sooooo cringe.",
            "[deleted]",
            "what’s the point of saying SWE out loud? \n\nThe effort of pronouncing SWE is as high as just saying software engineer.",
            "i hate it so much. i also really hate doubly and singly linked lists. why the ‘y’ (haha)?",
            "Just wait until you work in a bureaucracy thar follows the CMMI framework and has a “software engineering process group” and/or a “software engineering working group”. SEPG and SEWG. First time I heard an off-the-chart salary process consultant say “sewage” with a straight face i think i literally loled and called BS.",
            "That’s how it’s pronounced at google",
            "More like hengineer “happy engineer”",
            "In our school, the SWE workshop is for \"Society of Women Engineers\".",
            "Haha I go to your school, I found that funny too",
            "Genuine question: if not SWE, is it pronounced 'swiiiii' or 'sway'",
            "Ronaldo be like",
            "Cringe"
        ]
    }
]