[
    {
        "post_id": "p029sp",
        "author": "sunnygandhi123",
        "title": "I got a NASA SWE Fall Internship!!",
        "url": "https://www.reddit.com/r/csMajors/comments/p029sp/i_got_a_nasa_swe_fall_internship/",
        "score": 730,
        "num_comments": 106,
        "created_utc": 1628373393.0,
        "selftext": "Most of my friends are sellout finance majors and I don't have many people to share it with. I've really struggled with imposter syndrome for a while but this was really gratifying.\n\nI also go to a very much non target state school which has absolutely no CS connections.\n\nSuper excited, good luck to everyone else!",
        "permalink": "/r/csMajors/comments/p029sp/i_got_a_nasa_swe_fall_internship/",
        "comments": [
            "lets us know if you see some aliens",
            "Congrats! I interned as a software developer at NASA twice at both Kennedy and the Johnson Space Center. I got pathways during the rest of my undergrad and after graduating, I was converted over to a permanent federal employee as a computer engineer for NASA, although in actuality I do flight software project management for the Artemis Space Program, for a specific human rated spacecraft. The project, benefits and work life balance are great.",
            "Curious what the pay is if you don't mind sharing",
            "This is super welcome on this sub after the onslaught of Amazon posts. Congrats!!!",
            "Damn congrats, any tips for someone who’s going for a NASA internship?",
            "Language.",
            "That's amazing, congrats! Most of my close friends are non CS majors too so totally feel you haha",
            "Congrats! Just finished my last day with them yesterday haha after interning with them this full year. Was a great experience but make sure to request permissions for whatever you need quickly since those take time :) good luck !",
            "Damn working at NASA sounds like a dream, nice job!",
            "That’s so sick! Congrats",
            "Congrats op. Also, I just wanna say this sub is so damn wholesome. Loving the positivity around here <3",
            "Congratulations and I appreciate the excitement, but\n\n> sellout finance majors\n\nyou don't need to put others down to feel better about yourself. An internship at NASA stands on its own merits.",
            "Congrats! You'll love it. I have a few buddies that work for NASA and I did an internship for one of their projects and it was really fun.",
            "CONGRATS LETS GOOOOOO 🗣😭😭‼️\n\nHow important do you think GPA and transcript is for NASA ? I wanted to apply for JPL but bad grades :/",
            "Curious if they accept only US-Citizens as its government owned",
            "This is really amazinggg, congratulations to you! It's a remarkable feat and you must pat yourself on the back. You deserved this. ❤️",
            "Thas my dream dreaam job, congratulations bro thats dopee",
            "Congrats bro !",
            "can we ask for some info about your skills/projects etc?",
            "epic man, i wanna intern there one day too. i hope u have a good time!",
            "Congratulations. It’s like a dream for me . Good luck",
            "When did u apply, out of curiosity?",
            "Thats awesome! I have. A buddy who did the same, what was the process like???",
            "Congratulations!! You earned it :)",
            "Congrats!",
            "Proud of u.",
            "Congratulations :) Do you know what team you'll be working with?",
            "Congrats!! What advice do you have for us who would like to apply? :)",
            "Congrats",
            "Congrats!  \nEveryone gets imposter syndrome, but until you realize what you have done it will hopefully get better",
            "Same! Working out of Langley on automation :))",
            "[deleted]",
            "That’s sick, is that like JPL?",
            "Awesomeeeee",
            "That’s awesome! Congratulations!",
            "Congradulations! That sounds incredible!",
            "Whats your resume looklike??",
            "international student?",
            "How?",
            "Welcome to the club!!!",
            "Congrats!! Just curious, for fall internships, r u taking it along with school or taking a term off just for the internship?",
            "fly my dogecoin to the moon",
            "Wow good luck"
        ]
    },
    {
        "post_id": "o2j9kn",
        "author": "TC_V_GTFO",
        "title": "Alright, which one of you sent that HBO integration test email?",
        "url": "https://www.reddit.com/r/csMajors/comments/o2j9kn/alright_which_one_of_you_sent_that_hbo/",
        "score": 731,
        "num_comments": 32,
        "created_utc": 1624000774.0,
        "selftext": ">We mistakenly sent out an empty test email to a portion of our HBO Max mailing list this evening. We apologize for the inconvenience, and as the jokes pile in, yes, **it was the intern.** No, really. And we’re helping them through it. ❤️ \n\nhttps://twitter.com/HBOMaxHelp/status/1405712235108917249?s=19",
        "permalink": "/r/csMajors/comments/o2j9kn/alright_which_one_of_you_sent_that_hbo/",
        "comments": [
            "That twitter thread is so wholesome",
            "ama request",
            "Poor intern",
            "Hahaha don't be shy.",
            "[deleted]",
            "Lmao i just stalked the interns on LinkedIn",
            "Blaming the intern is lame. They should have systems in place to avoid this. No intern should be able to email all your customers at once from the test environment.",
            "Lmao I tried to post this last night but the sub doesn't allow pictures.... wasnt me 👀👀",
            "Me: \"worst thing you can do with emails is reply all to the company\"\n\nIntern at hbo: \"hold my beer\"",
            "**Lets throw the intern under the bus!! Ya fuck that new guy!**",
            "Lmao",
            "come out HBO CEO!\n\nwe know its you",
            "\"which one of you is it?\" Says the intern...",
            "My bad",
            "Wish I was interning at HBO",
            "[deleted]",
            "Lmfao I got it",
            "Duck HBO",
            "I accidentally emailed our CIO once during testing. I knew him though. He was fine with it. 🤣"
        ]
    },
    {
        "post_id": "1bwtq9t",
        "author": "peepeeECKSDEE",
        "title": "The other candidate:",
        "url": "https://i.redd.it/x19ycp4kbqsc1.jpeg",
        "score": 728,
        "num_comments": 80,
        "created_utc": 1712352643.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bwtq9t/the_other_candidate/",
        "comments": [
            "I'm blessed to share that I will be applying to my 737th job this semester",
            "Mf posting like they signed a NBA contract",
            "[deleted]",
            "read the post. they didn’t get 8 internship offers. they got 8 spring week offers a.k.a externship. It’s just like a networking program at these companies.",
            "I can understand maybe even getting a job post, but tf is this BS.",
            "Humility is a rare trait",
            "That’s cool but also kind of meaningless. A single internship at any of those companies would be more impressive than all of those “insight weeks” combined.",
            "I bet OP is the original poster of the LinkedIn post, trying to get off on even more likes / upvotes. \n\nWell played OP and congratulations. \n\nThe post can be found by searching the content of your LI post, no need to hide your beautiful face.",
            "[deleted]",
            "Just lookup what the heck is Microsoft’s Embrace mentorship. I think I will identify as “preferred” race",
            "I know this person ships the most ass code you’ve ever seen",
            "What 900 leetcode do to a mf",
            "Wow, some of the worst and most corporate companies that you could work for.  That sucks.",
            "How can you be an intern at 8 places at once?",
            "This is genuinely so stupid. Posting something like this actually impacts you negatively. Going to these networking/externship events isn't a bad thing, but there's an optimal way to approach it that yields you the most value. \n\n1. Whenever the company flies you out to a new place (like L'Oreal flying you out to NYC or whatever), take a few pictures from the trip and make a linkedin post on it. \n\n2. When you go there, talk to everyone and add them on linkedin\n\n3. Use that trip to just do work on your laptop whenever you can and maybe fuck a bitch or two on the side. \n\nEven though these networking events do have value, there's always more valuable things to do like Leetcode.",
            "eh don't worry about it, outside of work they have very little to offer. Work is their life and nothing else.",
            "This one annoys me much more than the typical humble bragging for some reason. The utter tone deafness of announcing to the world that you have many competing internship weeks, which for the record you probably don't want your university recruiter seeing.\n\nNot to mention the greed of accepting that many of them... like dude, you can stop after a while. You probably don't need all that.\n\nI guarantee you this person is a grade A bullshitter.",
            "I know a few people like this and I'll genuinely never understand what drives them to be this way. It's admirable but it's also terrifying, like they just cant have enough.",
            "Did he seriously put all those companies in his linkedin bio lmao",
            "being cringe on linkedin is gonna keep me broke fr bc you will never catch me on this wave",
            "Bro is him",
            "i'm blessed to share that this candidate must be insufferable irl",
            "I’m blessed to share that I’m PIP fodder.",
            "You vs the guy she tells you not to worry about",
            "Brother…. How",
            "Well - Ill give credit that this person is trying to play their cards. The fact is that corporate organizations incentivize this sort of self promotion. Having it ingrained this deep as a first year is interesting. \n\nIt’s interesting to me how corporate it can be for SWE path in schools. The well known cs school in my country has more of a pathway of building things to get noticed by employers. Start ups, products, research. This seems more of a traditional route they teach in business school. Network the hell out of the companies and hope it lands somewhere.",
            "Took one of the worst options too",
            "As someone who has spoken at a fortune 100 company’s externship program (was a stellar employee talking about my experience in the rotation program) , let me let y’all in on a secret. \n\nCompanies LOVE their externship programs. Often times we use these as feeder programs into the internship program and then the new grad program. Every time my company has an externship, we knew we would be hiring at least one person from that cohort. It was a given. \n\nCompanies like seeing these externships or insight days on resumes. This shows leadership experience and helps you be above those that have absolutely no internship experience. I have even seen them referred to as fellowships depending on the company. Bottom line, they look amazing on a resume if you know how to tailor it. \n\nYou don’t have to say what kind of work it was. All industries do these, even sales, marketing, etc. if you manage to get one, you can just say insight week - you don’t have to say whether or not it was technical. \n\nApply apply apply if you can! Every little bit helps to win over the eye of a recruiter.",
            "Given 2 equally qualified candidates, the one who gets the role is the one who shows he is most qualified for it. It's a very very difficult art. But some people are better than others.",
            "Who’s this tool?",
            "Good job nigga. We rockin witchu",
            "Fuck this nerf",
            "Wasn’t expecting the comments to be so negative but to the people saying the post is cringe, yes it is BUT these post help. I am also someone that “brags” on LinkedIn, posting updates like this definitely helps me with new connections + old connections that forgot I existed😂 and these connections sometimes help me find more opportunities because they also make these cringey posts. Instead of looking at these posts negatively, grab whatever information you can from it. There’s people tagged that you can reach out to and ask if there’s anymore opportunities, plus just seeing this post informed me about these spring week opportunities I had no idea about. So see what information you can grab for yourself when you see posts like this instead of thinking of it as a negative thing🤷🏾‍♀️. My random posts helped me to communicate what I’m interested in and I have had people I know reach out to their own connections and got me a referral to a company I had no connections at.",
            "Such stuff feels like someone who worked hard enough to achieve things, yet received equal amount of abuse from peers and parents.\n\nThis is how you cope with such things",
            "Diversity?"
        ]
    },
    {
        "post_id": "19am9q4",
        "author": "ImpossibleBalance8",
        "title": "Got my dream offer from Meta!",
        "url": "https://www.reddit.com/r/csMajors/comments/19am9q4/got_my_dream_offer_from_meta/",
        "score": 729,
        "num_comments": 173,
        "created_utc": 1705679800.0,
        "selftext": "2024 New Grad. This is my first post but thought I'd share some of my experiences. There was this one team at Meta that I really wanted to join, and they had been hiring since May of last year. At the time they only hired experienced candidates. But since their tech stack felt very similar to the one I worked on during my internship, I thought I'd give it a try. I applied in May and as expected, was ghosted.\n\nThen came the fall recruiting season and I wasn't about to give up. I reached out to an EM at Meta that I had previous connection with and asked her for a referral to these roles. She gave me the referral, but again I was rejected three days later, this time by an actual recruiter.\n\nWhen the Meta New Grad posting came out in November, I thought I'd give it one last try. I wasn't expecting much because like everyone else, I was cold-applying to a bunch of other places and didn't have much luck with getting interviews. Especially being from out of the country, I really thought I didn't have a chance. Surprisingly, the next day after I applied I got a recruiter reach out. I followed through the process, one OA and one VO, and was told right after the holidays that I got into team matching.\n\nInitially I was sent several teams, but none of them was the team I was hoping to join. Thinking that if I've come this far, I might as well give it another try, I reached out to the manager of that team directly on LinkedIn, and to my delight he quickly responded and said they were indeed looking to hire E3's! So we had a quick conversation and I was extended an offer yesterday to join this team.\n\nI feel so happy right now because it's like a dream coming true, but I know that so much of what contributed to this good outcome was luck. I guess I wanted to share that if you know what you want and have a clear goal, you just need to keep pushing for it and have faith in yourself, and if you do luck will be in your favor!\n\nThat's it! Happy Friday to everyone and I'm happy to answer any questions as well for those of you who might be in the same process with Meta!",
        "permalink": "/r/csMajors/comments/19am9q4/got_my_dream_offer_from_meta/",
        "comments": [
            "Congratulations mate!",
            "Thank you for giving us shitters some hope !",
            "Congratulations! I’m happy for you!\n\nJust out of curiosity, what’s the base salary? And what location?",
            "congratulations , wish u the best",
            "Congrats! Meta is my dream as well. I just went through the OA, but got rejected the next day. If you don’t mind me asking, how’d you do in the OA? I was able to solve 3/4 and passed a few test cases on the 4th. Thought that would be enough for the VO but I guess not. Asked the recruiter for feedback but didn’t hear back.",
            "If you dont mind,whats that tech stack?",
            "Superb news, there is still hope with hard work.",
            "Congrats, dude. Tenacity pays off!",
            "congratulations!! can i dm u some questions?",
            "Also got a new grad offer from Meta, but kind of worried about future layoffs and them rescinding offers like prior years :(",
            "'Grats man! Would you mind sharing your anonymized cv?",
            "Congrats. You mentioned you are not from the US? Are you Canadian? Curious how they handle the visa situation for you.",
            "Congratulations OP! Would you mind sharing your prep journey?",
            "So happy for you! May god bless you with more success in your career. Rooting for you!",
            "Congrats. Tho personally Meta has been a shame when it comes to how they recruit. They rejected their previous year interns that met performance bar then opened external new grad application. Some got asked to re-apply. Zero clue what they are trying to achieve.",
            "Just sent you a message!",
            "Congrats!",
            "That's so amazing! I'm glad you didn't give up and I'm happy it all worked out for you! Good luck going forward 👍",
            "Congrats mate",
            "Congratulations!!!",
            "@ImpossilbeBalance8 can I dm you?. I have my interview next week",
            "Congrats",
            "CONGRATS!",
            "Congrats! If you don't mind me asking, what was your prior experience?",
            "Congratulations 🍾🎊",
            "That's awesome man... go and do amazing things! Best of success to you",
            "How did each round of the Final loop go for you?",
            "Huge congratulations for your perseverance!",
            "Pffft you’re supposed to send out 10,000 applications to every indiscriminate posting, then complain on this sub. \n\nSeriously though, this is how it’s done. You made connections, reached out to people, and persisted —- congrats!",
            "congrats mate :))",
            "Congrats!",
            "Congrats you are truly living the dream :) what kind of projects did you have?",
            "Grats!",
            "Dream offers are always special. Congratulations on your hard work. Hope it takes you far player.",
            "congrats!! so happy for you",
            "Congratulations Brother. I am in Sophomore Year now. can you share me required skillset Needed for Such Good Jobs ?",
            "Holy acadabra shjt congratulashion dude u r a god",
            "Congratulations! Wishing you all the best at Meta!",
            "hello! Congratulations! \n\nAfter how many days did you hear back from the recruiter after your VO?",
            "How many rounds did you go through?",
            "Congrats on the offer OP! May I ask how you prepared for the OA? What questions/topics should one focus on? Same with the on-site interviews. I’m curious if the interview questions were mainly leetcode/leetcode tagged and mostly east/medium questions?",
            "Meta has bootcamp, not team matching??",
            "Can you post anonymized resume for reference? Thanks.",
            "Tc or stfu",
            "[removed]",
            "Have you had a job since you graduated? Or just been applying since",
            "Congrats! Can I ask what country you’re from?",
            "Hi, can you please let me know whether you are a bachelor's student?",
            "[removed]",
            "Hi. Congrats on the offer, I just dm'ed you.",
            "Hey Congrats OP ! \nCould you tell us what did you di differently when you applied in November that made recruiter reach out ? Was it another referral ?",
            "What was the tech stack?",
            "Congratulations on getting the offer!   \nCan you please share your resume?",
            "Don’t let the Layoffs get to you",
            "Hello thanks for insightful post, how did you gather info about different teams and boiled it down to the one you wanted?",
            "Congratulations on the offer! Would you mind sharing your resume? Also, what tech stack were you working on?",
            "first of all congratulations brother 💪🏻  \n\n\nI'm new to everything over here, so could you help me understand how do you apply for something like this, also what is OA or VO",
            "Was your university a prestigious one or not? and what was your gpa after you graduated?",
            "Can you DM me your resume plz?",
            "Congratulations! Meta is one of my top choices as well. Would you mind sending me your Resume? Just curious",
            "Hey OP, congrats 🎉and it would mean the world if you could check DM",
            "A bit of side question: what is the interview process for Security Engineer at Meta ?",
            "Hey! Congratulations on your offer! I saw in one of your replies that you are joining an AI infrastructure team, which is something I’m super interested in but have very little experience. I’m currently in 3rd comp eng, but what kind of things did you do outside of school? types of projects, internships? and frameworks and languages you have experience in? would also really appreciate it if you could share your resume!",
            "Dm'ed you",
            "Congratulations!! Meta’s work is amazing and after Zuck’s big announcement, i think they’ll definitely need you for their AI infra ;)\nCan you tell in detail what meetup you attended for meta and if you can share the anonymized reume",
            "Congratulations~! ✨",
            "Congratulations!",
            "can I dm you about what u messaged the hiring manager?"
        ]
    },
    {
        "post_id": "1b0av5o",
        "author": "Sweet_Increase6864",
        "title": "When tech starts hiring again don’t post a “day in the life of”",
        "url": "https://www.reddit.com/r/csMajors/comments/1b0av5o/when_tech_starts_hiring_again_dont_post_a_day_in/",
        "score": 721,
        "num_comments": 74,
        "created_utc": 1708929086.0,
        "selftext": "Thats it. Keep scaring the fishies 🐟 ",
        "permalink": "/r/csMajors/comments/1b0av5o/when_tech_starts_hiring_again_dont_post_a_day_in/",
        "comments": [
            "If tech starts hiring again people will quickly forget about the bad times and go right back to those types of videos…..",
            "Start posting them but make it seem really horrible and gruelling",
            "fr we gotta gatekeep",
            "fr take a look at the ibanking day in the lifes they’re horrifying af\n\n(getting in at 9am and leaving at 8pm is a “good” day)",
            "square plant thought payment connect disgusted tap follow special forgetful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Gate keeping is neccesary",
            "I'm wondering if previous years were nothing but a short bubble that won't come again for a long time. So many BS positions and people kept on even when putting in the bare minimum. e.g. Twitter could fire 80% of staff and still end up with a working service and more new features implemented in a short time then with much larger workforce ",
            "I feel like leetcode is enough to scare people away. I literally see CS students can’t even pass the interviews so it goes to show how tough cracking these interviews really is. \n\n\nNotice how the  “I learned to code in 3 months and work at Google” people all sell courses and there whole YouTube channel and TikTok is centered around getting views and selling courses to newbie programmers. \n\nThey all push on how anybody can do it and it’s so easy.",
            "When will tech start hiring again?",
            "Fake Fact: Four-leaf clovers bring good luck because ancient Druids believed they had the power to repel evil spirits.",
            "the only people allowed to post them r those working at hft sweatshops",
            "How are those \"day in the life of\" workers in tech so cushy? They all follow the same format - wake up early, do some asinine exercise like yoga or Pilates, have some health drink, go to office for some hipster food cooked by the company chef, clear emails to 9, go into a nice collaborative meeting and be nice to each other, explore the city looking for good instagrammable food to 2, clear emails to 3, have another meeting to 5, go home, buy organic hipster food, do some asinine exercise, cook, watch the latest series then sleep.\n\nLike when do you work?\n\nI roll out of bed at 7, rush to wash up and get out of the house by 7:10, arrive frazzled and late at 8 something, respond to emails as quickly as I can in 15 minutes, rush all the bullshit as quickly as I can, have a \"stand up\" scrum meeting where I'm secretly still doing work and pretending to listen, have packed lunch at my desk, work then rush home to cook as city is depressing as fuck. Also, none of my meetings are collaborative or calm, its always people low key accusing each other of not hitting targets, or bosses announcing tighter targets, bargaining, etc.",
            "But how will they hope to build another means of income outside of their job that they found out they hate but pays so well?",
            "Lol there's no better tomorrow, this is gonna stay and this is the new Normal :)",
            "or do post \"day in the life of\" and make it street begging",
            "THATS the reason tech STOPPED hiring",
            "If it picks up we need to do the day in the life, but for other majors like aerospace or something lol.",
            "I will do it. I'm not afraid of competition, become valuable in something else",
            "Completely agree. Instead, they should share their experience at the company, how they write code, how they solve problems, what resources are useful and how to improve problem solving skills. I wonder which idiots started that \"A day in a life of\" bs trend. Now people just expect things to be easy because of them and then they get disappointed when they find out it's not. All the bootcamps who are scamming people that you can get a entry level jobs in this kind of market without a CS degree should also stop as well.",
            "I always hate these \"day in a life of software engineer\" bitches. Not sure what they want to showoff, especially these tech-hotgirls.",
            "Nah I think I will",
            "Tech is hiring",
            "Tech stopped hiring? Huh that’s new",
            "I will and you can’t stop me",
            "It's not going to happen but I honestly hope that the doom posting keeps going. It's good for decreasing future app numbers.",
            "...",
            "They should do \"day in the life of\" right now and show some kid Leetcoding with one hand and doomscrolling this sub with the other",
            "No one should one until we secure a job first",
            "I don’t think it’s ever going back to what it was during peak “just major in cs lol” days it’s probably just gonna become like a normal stem major again"
        ]
    },
    {
        "post_id": "r6p1an",
        "author": "None",
        "title": "\"If you've seen a question before, be honest and let the interviewer know!\" Okay Meta",
        "url": "https://www.reddit.com/r/csMajors/comments/r6p1an/if_youve_seen_a_question_before_be_honest_and_let/",
        "score": 723,
        "num_comments": 84,
        "created_utc": 1638392361.0,
        "selftext": "This was written in the email to schedule my final round of interviews at Meta.\n\nWho in their right mind would gamble on a completely new problem when they're given one that they already know the optimal solution to?\n\nThe fact that they tell this to candidates demonstrates a complete disconnect between what they think the interview preparation process is like, and the reality of what it actually is.",
        "permalink": "/r/csMajors/comments/r6p1an/if_youve_seen_a_question_before_be_honest_and_let/",
        "comments": [
            "Keep saying you’ve seen the problem till they give you one you’ve actually seen",
            "Pass interview algorithm:\n\nstep 1: I've seen this problem before\n\nInterviewer: Ok, here's another problem\n\nrepeat step 1",
            "“Ive seen this before” \n“well can you solve it?” \n“I only said I seen it before”",
            "Life hack : if you get a hard problem just say you’ve seen it before so you can get another one",
            "Interviewer: presents fizzbuzz \n\nMe: “oh I’ve never seen this one before hmm”\n\nProblem 2: binary search\n\nMe: “hmm oh wow ive never seen this one before either”",
            "So true. At the end of the day. No matter how much you prepare, there is still a chance where the specific question that you get doesn’t click for you in the 45 minutes time span. In actuality, if you struggle for 5-10 minutes, it already starts to looks bad, and only worse from there. \n\nPreparation is inversely proportional to the luck factor in the interview prep process. The more you prepare, the less you have to rely on luck and are able to solve these questions either because you’ve seen the problem, or because you are just good at DSA in general. \n\nIt’s never going to be 0 luck factor. So that puts you already at a crazy disadvantage, knowing that no matter how much you prepare, you can get this insane question that 0.01% can solve without seeing before. \n\nKnowing all this. Again, I echo what you said. Who in their right mind would be like “excuse me, sorry, even though I already won this Russian roulette round, I’d like to go again please.”",
            "Sees LC Hard problem\n\n“I’ve seen this before”\n\nGets LC Easy next\n\n“Never seen such a hard question in my life”",
            "It's a conflict of interest. It's in their best interest to have candidates answer questions that they haven't seen before. But it's in our best interest to answer questions that we've seen before",
            "How it goes when I've seen the question:\n\n\"Hmm no I've never seen this one before let me give it a quick read through\"\n\n\\*Proceeds to regurgitate the entire Leetcode solution tab",
            "“I’ve seen all Leetcode problems”",
            "I actually got the same problem in my final round as my first round for them. Ended up telling the interviewer I saw it in the last round but only in that case would I reveal that",
            "Me: \\*acts like I have never seen the LC hard problem before... then goes ahead to give the O(1) solution that took Floyd-Warshall 2 yrs to find.",
            "I heard (from FB interns) that if you’re honest and tell them you’ve seen the question before, they give you an easy freebie",
            "I actually think it represents a bit of self-awareness. They know people are doing the leetcode grind and studying specifically for the interview. And, we all know that this is the reason the entire process has become so detached from the reality of software engineering to the point where it's all about jumping through the hoops of this gatekeeping process as opposed to being a good programmer.\n\n They know it's a game just as much as we do, but they keep it up because they specifically want people who research, learn how to play it, and play to win. To a company like Meta, the ridiculousness of the leetcode grind is a feature, not a bug, because it separates out the people who are motivated to go through the stupid process. \n\nSo with that in mind: they are probably not expecting you to listen to this. Bullshit through it as though you haven't seen it before, just like in the real world where you are doing whatever it takes to please your boss. Play to win - that's what they want.",
            "Ironically Meta preys on the personal data of its users but expects the interviewees to not have an edge during the interview.",
            "I had a traditional interview with three different people. Each used the same list of sample questions from the company. I pointed it out on one of them. That felt like a mistake",
            "I just find it best to be honest.",
            "this though",
            "I'd like to think I've got too much integrity to lie in that situation, so I'm going to say that I would.\n\nEDIT: *If you've ever been just scrolling through Reddit and you've seen a comment that, while not aimed at you individually, still made you feel like a crummy person, go ahead and hit that downvote button!*",
            "I always tell them if I have seen a problem, much rather use my time learning how algorithm works and how problems can be attacked than memoizing solutions like a parrot.",
            "Idk how often it's the case but I've heard from some interviewers that it just shows when people know the questions. Just anecdotal though and I guess they don't know how often the candidate knows and sneaks through the process.",
            "Tell them you’ve seen all leetcode medium and hards so if they want you to solve something new it better be an easy",
            "Sometimes they tell you to either way answer it and you get more time for the follow up question. So it is kind of useful and you don't have to pretend.",
            "keep saying you've seen the problem till you get Two Sum"
        ]
    },
    {
        "post_id": "18qr5g9",
        "author": "ParfaitSignificant16",
        "title": "FINALLY GOT AN INTERNSHIP",
        "url": "https://www.reddit.com/r/csMajors/comments/18qr5g9/finally_got_an_internship/",
        "score": 716,
        "num_comments": 165,
        "created_utc": 1703538490.0,
        "selftext": "&#x200B;\n\n[Finally got one after applying to so many jobs!!!](https://preview.redd.it/pclv6tlgai8c1.png?width=1400&format=png&auto=webp&s=1cfd3880d838ed2f832f5af1c8ace19333ccda88)",
        "permalink": "/r/csMajors/comments/18qr5g9/finally_got_an_internship/",
        "comments": [
            "Finally? Bruh you got 4",
            "Did you have any previous experience?\nIf not, what and how many projects did you do ?\n\nAlso, congratulations my man and best of luck for the internship",
            "[deleted]",
            "I literally cannot understand applying to 895 places?? Were you applying to anywhere in America?",
            "Website recomendation to find 800 job offers",
            "Congrats!",
            "congrats.",
            "Congrats 🎉\n\nHow long did it take?",
            "[deleted]",
            "Congrats, comrade! Signed my offer a little over a week ago.",
            "Good stuff bro. I’m drunk out of my mind but I’m so happy for you. Happy Christmas. And, Mrs.Claus is hot and so are you.",
            "What college are you at?",
            "congrats!",
            "Your \"No Answers\" ratio seems much lower than mine, I get no answer from 9/10 jobs that I apply for.  Curious what platforms/methods did you use for applications?  Most of mine have been through Indeed.",
            "Can you tell us how you prepared or what you did to prepare? The usual leetcode grind and good resume? Also can you pm me your resume ty :)",
            "Congrats!",
            "W",
            "Congratulations",
            "Treat bro 😜",
            "Congrats  🥳  🥳  🥳",
            "Congratulations 🎊. Please dm me your resume",
            "W",
            "Congratulations dude, is it possible if you can DM me if your resume. My resume is not giving me interviews :(",
            "These statistics kinda follow linearly for me lol. My szn went ~300 apps, 15 interviews and 2 offers. But I’ve been applying since June as well and I can’t imagine doing 900. Props.",
            "I'm screwed imagining the application count I need to make being outside of the US to get remote part time role😂\nOmg I think I can't sleep with this on my head",
            "Congratulations- it’s a good feeling getting the first job. Went from a 10 by 7 foot shared 4 bedroom apartment to owning my own home in less than a year. So trust me the hard work is worth it. Every second is not wasted",
            "Congrats!",
            "how😔",
            "What company?",
            "a 16% pass through rate from first rounders to second rounders is very poor sounds like you need to beef up your resume and interview core 4 stories.",
            "work on ur interview skills",
            "what were the 3 companies you declined if you don’t mind me asking? i would also wanna know the company you got a job at but i understand if you wanna stay more anonymous.",
            "Can you please PM me your resume",
            "895 applications how is that possible?",
            "Congratulations to you for your internship. Best wishes to you.",
            "Any advice for an international freshman? I applied to a few freshmen internships that were there but never heard back.",
            "Congratulations, can you give some tips?\n1. Which sites did you apply?\n2. Are referrals useful?\n3. How to check if my resume gets parsed by ATS?",
            "Where are you from and in which did you apply at?\nI assume that you are from a non USA country and applied for the USA. Internships in such a manner are basically impossible.",
            "All the interviews have technical questions? \n\nAlso what program is this?",
            "Bro congratulations \nI have question list of website u used for applying ?",
            "It's scary that I may need to apply to 800+ places. Though you got interviews at nearly 40 companies is positive... It's seems quite time consuming & tiring to attend all in a short span. \n\nWas it just the same resume, copy-paste descriptions/ skills/ etc. that you simply submitted to every company or modified it to every company you applied? \n\nAlso, just curious, pls let me know if this quite normal to apply to these many companies? \n\nThanks and all the best",
            "God bless, I’m looking for a junior role too.\nCould you tell me how you got to your success please?",
            "Can you pm me your resume please ?",
            "I just need to know how do you apply for 900 internships?? (Serious Question)",
            "How do you keep track of the specific number of applications you sent in? Once I got into the hundreds I lost track of how many I did",
            "CONGRATS!!! :) out of curiosity, what year are you in",
            "What portal is it ?",
            "Hi OP, did you write cover letter or any stuff? What are some strategies or tactics that you think that help you get 37 interviews? Thank you!"
        ]
    },
    {
        "post_id": "1clnba2",
        "author": "MarkZuccsForeskin",
        "title": "The Duality of Man ",
        "url": "https://i.redd.it/iiw6yqro1uyc1.jpeg",
        "score": 718,
        "num_comments": 44,
        "created_utc": 1715012840.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1clnba2/the_duality_of_man/",
        "comments": [
            "People talking about signs of future like they are investment bankers in big firms, making six figure commissions.",
            "please dont use this post as an opportunity to doom, i just wanna share funny memes",
            "Everyone drop out now 😏",
            "avg bipolar cs student",
            "PNC",
            "Meh. Software engineers grow on trees nowadays anyways. Just like there is always *that* guy, some will keep patience, train them on the next big thing, and ride it out. Market will take years to recover, but not that many. Remember the crash in 2008? Seven years later, 2015 was the golden age. I don’t think I’d be too wrong to say that people couldn’t be happier of their choice (CS, in this case) from as late back as 2010.",
            "I’m a self taught dev, I’m currently about to finish the first year of my first dev job and I just signed on for another dev job with a $22k increase in pay. I applied for maybe 15 jobs all up and I got this one by contacting the company on LinkedIn and then doing a take home project, it was a lot easier than reddit makes out. It’s not all doom and gloom out there.",
            "![gif](giphy|FzyoyDSaAsjHG)",
            "https://preview.redd.it/y4lq949jmyyc1.jpeg?width=1170&format=pjpg&auto=webp&s=a5fdd09b9c47e1ea807d219942e17dadc45be396\n\nThis post was probably the most fucking pathetic doomer post I’ve seen so far in this sub. Mods had to lock it because OP was a fucking loser and started unnecessary drama.",
            "Fuck it, just do it! So what if it doesn’t work out? There’s always a way.",
            "We'll fuck around and find out guys, don't worry.",
            "It's joever vs. we're so back ",
            "Hahahahaha",
            "😂😂😂",
            "At the end of the day, at least you don't have an art degree.",
            "Allow me to explain. The current paradigm is always changing but smart motivated people will always be successful. If no one is hiring because AI then get into AI.",
            "THANK YOU! My god I hate when people try to pretend like a situation is less worse than it actually is",
            "AI.  \n\n1.  Future one : AI takes off, creating vastly more jobs.  Companies start employing models as recruiters again (seriously I was pinged by meta recruiters who had previously been flight attendants and hostesses and other jobs where being an attractive female is the thing, and they would be about 22.  Another called me and had this throaty bedroom voice on the phone and would tease me the way she said things, using lots of \"we\" etc to make incels feel led on.  I was just irritated since obviously she wasn't interested and plus I mean hitting on a representative of HR?  That's how you get blacklisted.)\n\nThis time the model recruiters are told to do \"whatever it takes\"\n\n2.  Future two:  AI stays just good enough to increase productivity but there is no new demand sink.  Web dev especially is far easier to do as AI is extremely good about automating it.  (Easier language, JavaScript being interpreted makes it easier to debug).  Less jobs needed, and a whole new generation of better grads in India to handle those.\n\nMost Americans not doing niche, extremely hard to learn roles leave CS and become nurses and house flippers.",
            "Nobody can predict the future, but the signs are more negative than positive.",
            "Sure, the another 100 million Indians think the same."
        ]
    },
    {
        "post_id": "1ag1ysx",
        "author": "Enoch_Anderson",
        "title": "Yall's doing it wrong.",
        "url": "https://www.reddit.com/r/csMajors/comments/1ag1ysx/yalls_doing_it_wrong/",
        "score": 721,
        "num_comments": 24,
        "created_utc": 1706760227.0,
        "selftext": "&#x200B;\n\nhttps://preview.redd.it/p9ff480cewfc1.png?width=1272&format=png&auto=webp&s=54a5560e47ae457d869cb80c7531faede1dbdb27",
        "permalink": "/r/csMajors/comments/1ag1ysx/yalls_doing_it_wrong/",
        "comments": [
            "![gif](giphy|eUip1YaZdiOU0yEbG4)",
            "Incredible shitpost. Very unique, I like it.",
            "When you go back in time and apply for tech jobs in 2012",
            "You just gotta **GET GOOD**. Agree? 🤯🔥😏",
            "Its bc you grinded and leetcoded",
            "![gif](giphy|l41lVsYDBC0UVQJCE)",
            "dude reversed array",
            "OP's profile:\n- Bachelor from Harvard\n- Masters from Stanford\n- PhD from MIT\n- Created 5 programming languages\n- Won 7 Turing Awards\n- Dad is Bill Gates",
            "One application into 66 job offers, he's insane. It's probably because he sneezed that made him a likable and unique candidate like none other. If you don't stand out, you'll be like everybody else.",
            "When ur dad is a managing partner at Sequoia capital and everyone wants those VC investment\n\nEdit: Though I think at that point you might want to learn a thing or two about Venture Capital instead, much higher reward than being a SWE if you are in that class...",
            "Getting jobs aren’t hard. Just get them",
            "![gif](giphy|X5O5t5GBBd640XteOK|downsized)\n\nanita max wyynn!    \\^ \\~ \\^",
            "Honestly if it’s not like this then it’s a skill issue. Sorry someone had to say it",
            "First company didn’t need him but thought he was a great candidate, so they recommended him to their network.",
            "Chat is this real?",
            "This bro is why we ain't getting offers",
            "https://preview.redd.it/614kyiiliwfc1.jpeg?width=224&format=pjpg&auto=webp&s=8178ef101376a2fa4711a17cff96f0783d211691"
        ]
    },
    {
        "post_id": "jfk6cr",
        "author": "subhronilsaha",
        "title": "I got a rejection mail before the application confirmation email 😂",
        "url": "https://www.reddit.com/r/csMajors/comments/jfk6cr/i_got_a_rejection_mail_before_the_application/",
        "score": 720,
        "num_comments": 67,
        "created_utc": 1603309694.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/jfk6cr/i_got_a_rejection_mail_before_the_application/",
        "comments": [
            "Closure",
            "International students have it like..",
            "At least their rejection process is efficient",
            "[deleted]",
            "This >>>> Being ghosted",
            "i got rejected before i finished applying to the company...",
            "I got a rejection email after accepting an offer... cue my immense confusion...",
            "You only need one. Ignore the ghosts and the “no”s",
            "Damn I felt that",
            "Been there before lol, happens to the best of us! Keep your head up and keep blasting out those applications. Even if it’s a no name company that you’d never want to work at, the least it can do for you is provide some bonus interview experience. As someone above mentioned, all it takes is one!",
            "Don't give up you got this!",
            "Same here",
            "\"You suck but btw hello nice to meet u\"",
            "welcome to the club",
            "Which company was this? I wanna see if it's a foreign thing.",
            "was this capital one ? same thing happened to me last year 😂",
            "I actually \"lol\"ed out loud 🌚🌝",
            "heckin' brutal",
            "😂😂",
            "could be an accident, try to see what happened! what company is it?",
            "F",
            "These days here, that there’s a compliment!",
            "I feel you bro,  just feel you..",
            "Tell them you can fix that.",
            "Nice. Quickest I had was within the hour.",
            "This is both funny and soul destroying",
            "Bros before nos",
            "Haha the same thing happened to me yesterday!",
            "Dada, chaliye jaan",
            "Congratulations, you’ve now entered new level.",
            "Relatable lol.",
            "Something similar happened to me. Im an alumni of a NYC Tech Talent program for college students. This pipeline can give referrals for specific companies. I applied to one and told my career coach i applied and she told me she will reach out to one of the recruiters. 15 minutes later i got an email stating i was denied.",
            "That happened to me about 2 years ago for an internship",
            "Wow, this is my most upvoted post on Reddit now 😂 Thanks y’all!"
        ]
    }
]