[
    {
        "post_id": "10pkv80",
        "author": "Sea-Coconut-3833",
        "title": "Every morning waking up with thank you!",
        "url": "https://www.reddit.com/r/csMajors/comments/10pkv80/every_morning_waking_up_with_thank_you/",
        "score": 714,
        "num_comments": 45,
        "created_utc": 1675129977.0,
        "selftext": "Thank you for your interest in applying for our software engineering intern role. Though your background was impressive, we have decided to move forward with other candidate at this point.",
        "permalink": "/r/csMajors/comments/10pkv80/every_morning_waking_up_with_thank_you/",
        "comments": [
            "Atleast it wasn't like \"After further review we have decided to move onto MORE QUALIFIED candidates\".",
            "And the one response I get I fuck up the OA 🥲",
            "It is officially a part of my daily routine now. See, delete, and get out of bed for another day of trying to balance everything and applying to 25 more positions.\nEdit: Forgot to add a positive note, we shall all conquer! These are the days we will look back to after graduation as days wasted being sad.",
            " I received this email after 6 rounds of interviews. That was more disappointing",
            "Honestly, I'd rather get rejected than ghosted any day. I want to have prospective employers to be communicative about things instead of leaving me in the dark and discarding me without telling me.",
            "Just got one in the middle of reading this. Idk if I should laugh or be depressed",
            "This is genuinely depressinf",
            "I had this thought today when I got two of these emails from different companies within 9 minutes of each other  \nSometimes it hurts more than being ignored tbh",
            "Edison failed 100 times before he invented the bulb, keep trying mate.",
            "400 apps here and seeing thank you day by day",
            "I felt this way too much lol",
            "I didn't get an internship at my company when I applied but a year later I applied again I got the job as a fresh grad. Don't give up.",
            "It is absolutely deflating. Makes me want to give up constantly.",
            "This hit close to home 🥲",
            "Same happening with me for New Grad roles.",
            "I was depressed for a day because of this, it hurts sometimes.",
            "They all do similar screening tests and ask the same questions, they should just come up with a universal test",
            "Us 🥲",
            "Same here bro! \n\nI was really sad for a couple months. Now, it's also my daily routine. I told myself keep trying! We just need only one opportunity! We're gonna make it!!!",
            "Better than getting ghosted.",
            "Who’s the other candidate like bro gmt",
            "received one of these last christmas lmao fucking traumatic",
            "Is getting a job or intern that hard? why people chose a Cs degree?",
            "Frankly, same is the case with experienced devs. Not as easy time right now and has been this way last two months.",
            "Same :("
        ]
    },
    {
        "post_id": "1cg5l6g",
        "author": "farhan3_3",
        "title": "How's your field doing? ",
        "url": "https://i.redd.it/x5xqqp1lxexc1.jpeg",
        "score": 717,
        "num_comments": 135,
        "created_utc": 1714413252.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cg5l6g/hows_your_field_doing/",
        "comments": [
            "I want to know the ones with the highest job openings so I can quit CS",
            "Ouch... Software development, IT Operations, and Media / Communications, that's like my whole dealio as a solutions architect at a media startup. Everything I'm good at is reduced.",
            "The up to date one here https://www.hiringlab.org/2024/04/24/us-q1-2024-business-to-business-labor-market/",
            "we are all doomed",
            "Its ok guys, just make a hit indie game and be set for life. Not that hard tbh",
            "![gif](giphy|QMHoU66sBXqqLqYvGO)",
            "Yeah but playing poker is up 40%",
            "Finance is fucked up as well.",
            "I guess all the software has been written, and it all works fine.",
            "US Bureau of Labor Statistics still pegs software engineering as growing 25% from 2022-2032 so I wonder how this data compares.\n\n[https://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm](https://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm)",
            "so everything related to tech and engineering has declined. not just before im to go for a CS degree lol",
            "Liberal arts jobs are up like 200%. Oh how the turn tables",
            "The death of the white collar job",
            "Really encouraging to know that when I started my CS education at college that there was an expected growth of I believe 20% in my state for jobs IIRC. Maybe it'll get worse In a year when I finish 🫠🫡",
            "This is just a consequence of growth industries expanding like crazy while interest rates were near 0 from covid\n\nMost of those industries are not “doomed” its just a bubble burst that will recorrect when interest rates come back down next year",
            "As an artist, seems like other industries are going the way of entertainment industries :/\n\nGuess reskilling ain't gonna matter",
            "I switched to a BS in cybersecurity. There doesn’t seem to be as much of a lull in the job market. Plus I’m already a decent engineer, so ideally I’d like to get into security engineering or architecture.",
            "oh wow the company where the biggest expense is all software engineers is trying to devalue them",
            "Poor SD, I can see that in my country",
            ":(",
            "Electrical engineering idk maybe good automation will be slow here i suppose",
            "Tym to go back to working at the flour mill :\")",
            "Climatology",
            "Can someone compare this to other countries?",
            "Weird how the us is so different to Europe.\nI am in software development and living in Europe but havent seen a downward spiral in job openings.",
            "I mean wasn’t the market extremely bloated in 2022/23? This seems like a natural correction",
            "What would Data Science fall under?",
            "*year over year change as of December 2023",
            "I’m amazed I got a job in IT with this decline. From an analytical perspective I gotta say that there’s too many factors influencing things to just rely on this. While the job postings may be down, how many are actually qualified for the jobs out there, or even have realistic expectations? \nI know that when I started working towards IT I was way in over my head and was not going to get a job until I got realistic and did what I needed to ACTUALLY make myself qualified, which I did. Furthermore, i occasionally run into folks that mention to me that they wanna get into IT after I tell them that I work in IT now, and they also are super unqualified and have unrealistic expectations. Not trynna shame them, but they usually have no business in any field like this until they get realistic. I have a feeling that the numbers crowding up each job posting are made up mostly by these folks. \nUnfortunately, things like automation and resume filters are making it way harder for qualified folks to get their resumes in front of a hiring manager. So there’s still an issue with getting a job in general, even for qualified individuals. But I feel like a decent amount of the complaining is still done by naive people who think that they can watch two hours of coding with mosh and be qualified for a 6 figure swe job, and then are shocked when they get filtered out",
            "It's not trendy anymore to hire developers so that your company can be the next Google/Facebook. Your company doesn't need to turn its product into a social network for the shareholders to be happy. \n\nNow, your company must use and leverage Generative AI to have an edge. Your shareholders are eying out the nerds at NVIDIA and wondering why your dogfood company can't do the same! Time to hire ML Engineers! Checkout the growth for these positions 😉",
            "Good thing I’m going into Data Science",
            "These numbers are in the negative??!!",
            "I left SWE in December and have never been happier. Strapped to a desk for 40+ hours a week writing bullshit code on a legacy system with ridiculous turn arounds just ain’t it for me haha. More power to those who love it.",
            "I’m going to need all of you to go into cybercrime so that we can boost cybersecurity positions",
            "It’s over with",
            "I was going to do a masters in computer science. What am I supposed to do now?",
            "Well shit, time to start making a furry game with micro transactions",
            "Missiles are still in demand I see. As an EE major I can only home out so long.",
            "I am not sure but I transitioned from pure cs into game development and design. Been kinda fun but hard to get into a company.",
            "Is it % decrease on indeed?"
        ]
    },
    {
        "post_id": "13c2fno",
        "author": "lastcredit",
        "title": "Received an offer Friday afternoon. Monday morning, I wake up to an email stating my offer had been rescinded. 🤡",
        "url": "https://www.reddit.com/r/csMajors/comments/13c2fno/received_an_offer_friday_afternoon_monday_morning/",
        "score": 716,
        "num_comments": 100,
        "created_utc": 1683574883.0,
        "selftext": "I would understand if it was a week or a month later and things had changed. Why’d they have to rush out an offer Friday afternoon. They could’ve waited until Monday and just told me no.",
        "permalink": "/r/csMajors/comments/13c2fno/received_an_offer_friday_afternoon_monday_morning/",
        "comments": [
            "Why do you guys never name the company lmao protecting them when they fucked you over",
            "Ridiculous.  I'd love you to name and shame.",
            "Name and shame",
            "naaaaaaameeee and shaaaaaameeee",
            "Name the company",
            "name and shame or it didn't happen",
            "Rip, my buddy got their offer rescinded and they can’t get a refund for Airbnb. $1,500 gone just for renting out the place for a month :/",
            "Name and shame!",
            "This happened to a friend and it turned out the company decided to downsize a division so all pending hire offers were rescinded and some staff were let go. It's unfortunate but in reality they can't announce they are considering downsizing parts of a business. If they decide they can make it work, they might have needlessly caused a panic. \n\nGlass half full, at least you didn't quit your job and then have the job let you go 3 weeks later. Use the Friday offer to negotiate a salary bump at your current job. They don't need to know it was rescinded.",
            "Name and shame",
            "Name and Shame bro",
            "That's some bullshit bro I feel for you.",
            "discord logs got leaked 😞",
            "[deleted]",
            "Le name, so we can le shame.",
            "Don’t post these type of incidents if you don’t have the balls to name and shame",
            "Name and shame !!",
            "Name and Shame",
            "Name or didn’t happen",
            "Hey, thats quick turn around, at least! I 'member getting an offer like this a few years back, then they rescinded a month and a half later *the week I was set to move into my new apartment and start work*.",
            "If they gave you an offer, depending on laws in your state, they may be on the hook for some compensation (though I think that is more if you left a job). Worth exploring. Maybe r/jobs could give insight.",
            "better to be told sooner than later haha",
            "This one is name and shame hands down, you have no reason to protect them, because they did you dirty",
            "Happened to me with Amazon twice, you know after I quit my job and got subsequently fucked on the morning commute to work",
            "Mods need to ban these useless posts. Name them or gtfo",
            "All the partying you might have done on the weekend",
            "Waited to ruin your week not your weekend. Brutal",
            "Sounds like you dodged a bullet",
            "Give the name to someone else...just blast them...",
            "There's no sound reason to defend this company. Call them out!",
            "This happened to me but they rescinded after I tried to negotiate for $5k more which was still in their stated range. That was 2 months ago. Everyone tells me I dodged a bullet. I described it on Glassdoor sticking to the facts. \n\nI’m now in the final stages of interviewing for a position that pays $45k more. Just keep pushing.",
            "If you don't name and shame I don't feel the slightest bit of pity towards you. People who don't name and shame communicate to me \"My feelings were hurt but I don't care enough to let others know which companies to avoid. I want people on the Internet to console me.\"",
            "There are cuts all over the industry. Line-level managers and recruiters are often the last to hear about cuts. If you're telling the truth, it could just be that the job you were offered doesn't actually exist because they lost the headcount. \n\nRest a bit easy: if that's what happened, it's highly likely the line-level manager is not going to be too terribly long for the company.",
            "Congrats on the L",
            "dropping a comment to come back later in case op names the company",
            "Happened to me once and then they sent a new offer a month later",
            "Save a copy and backup of that offer letter! See if the laws where you live would allow you to collect severance, unemployment, etc. Get their asses!",
            "Reveal who did it. Don't let them do this to others",
            "How annoying and unprofessional of them. Consider yourself lucky to not get stuck working at a place like that. Something better is ahead for you!",
            "I had this happen to me about 25 years ago with Sarasota Memorial Hospital.  They gave me the job on Friday afternoon, then the headhunters called and said I needed to come in immediately for a drug test to be ready on time.  I did, then on that evening they said the funding has been pulled for the position I would take.  Cool thanks",
            "Did they say you had until the end of the day to respond?",
            "My friend just went through a complete background check with a government agency. I'm talking about Polygraphs, Psychiatric checks, calling all references that were listed back from highschool.   \nIt was a 5 month process - they just rescinded his conditional offer even though he passed everything from his knowledge, they were completely onboard even 2 days ago. It was ridiculous.",
            "This means the person hiring you did not have the authority to hire you.\n\nYou dodged a bullet, there is a Machiavellian asshole loose in the company.",
            "Did they give a reason as to why they rescinded the offer?",
            "It sounds as if they goofed somehow. \n\nHow they deal with a mixup shows whether they could be a good employer or not.  Did they retract the offer with no apologies or explanations?  If so, they're kind of crappy. Maybe disorganized or understaffed."
        ]
    },
    {
        "post_id": "q289j9",
        "author": "minibogstar",
        "title": "I got my first offer today!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/q289j9/i_got_my_first_offer_today/",
        "score": 713,
        "num_comments": 47,
        "created_utc": 1633476334.0,
        "selftext": "That’s it. Plz b hppy fr me.  \n\nEdit: you guys are the best ☺️",
        "permalink": "/r/csMajors/comments/q289j9/i_got_my_first_offer_today/",
        "comments": [
            "Congrats friend, to the first of many! 🍻",
            "Congratulations!! Many more to come!!",
            "Congratulations!!! You deserve this win 🏆",
            "LET'S GOOOOOOOO",
            "Congrats!! I am happy for you!! 🎉 I am currently applying for SWE Internships for next year. Do you have any advice for me to be able to pass the online assessments and coding interviews, please?",
            "Amazing bro! Keep it up",
            "Congratulations!! :)",
            "Nice JOB!!!",
            "congrats! i did too :D",
            "CONGRATS MY FRIEND\n\nThe first one is the hardest one. You will get more!",
            "congrats. cling to it",
            "Congrat bro, keep it strong!!!!",
            "congrats!!!",
            "Ayyyyy!!!! Feels so good, keep up the good work!",
            "Less goooo",
            "Congrats!! Hope you celebrate!",
            "Same here:) got my first intern offer today",
            "Congratulations friend! We're proud of you!",
            "woohooooo",
            "Why is this flaired as Shitpost lol\n\nCongrats my guy! Getting your first experience helps a lot",
            "Congrats",
            "Congrats my friend. Keep it up",
            "Congrats",
            "I’m so proud of you",
            "Congrats, working on It myself 🎉",
            "Congrats!! Keep it up",
            "[deleted]",
            "Amazon?",
            "Is it FAANG? Does it have prestige?",
            "good news!!! specially in cs!!"
        ]
    },
    {
        "post_id": "19975s6",
        "author": "FMarksTheSpot",
        "title": "Junior position btw",
        "url": "https://i.redd.it/vnr3jb7ka2dc1.png",
        "score": 712,
        "num_comments": 53,
        "created_utc": 1705524172.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19975s6/junior_position_btw/",
        "comments": [
            "They don't say \"professional\" development experience.",
            "Jeez what happened to CS? It feels like it was in so much demand just two years ago and now it seems like the most fickle job market",
            "There is a huge demand. But the demand is for seasoned developers now. No one wants to train or develop new grads anymore. From what I've seen about the industry moving companies to move up is pretty normal.  As soon as they train and develop them those new grads jump ship and there goes all the time and resources they put in. I can understand the gamble...",
            "fake job posting meant to keep their h1bs",
            "thats all the jobs now\n\ni know its not normal",
            "I actually applied to this company 😭",
            "It’s a sign that the company lacks a proper HR who can post a well written job description? I would still apply even if it says 4 years experience.",
            "I hate this new “norm”",
            "Lol I was just accepted as a L2 with just 4 years of part-time work alongside my degree",
            "You can still be junior after 10 years if you are not very ambitious. They just want junior who is not fresh from school. In the company I worked we actually had a level bellow junor it was called freshman.",
            "I swear I’ve come across entry level positions that require 7+ years of relevant work experience, I can’t even",
            "I always get auto-rejected by Leidos for some reason.",
            "Is 4 years experience not in the ballpark of junior engineer?",
            "Yeah, junior position and the description is most fitting for one. They are allowing any technical degree and only requiring 4 years of general experience which is the standard length for most engineering/science programs.",
            "\"or more\"\n\nWth is the requirement for Sr?",
            "4 years of experience for a junior position 💀",
            "Sa*an controls the job market now…just trolling everyone and making everyone starve to death to garner as many souls as possible…so messed up…"
        ]
    },
    {
        "post_id": "ypvecb",
        "author": "Kap00t",
        "title": "Applied to this company 2 years ago for an internship. I think they’re trying to tell me something.. 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/ypvecb/applied_to_this_company_2_years_ago_for_an/",
        "score": 707,
        "num_comments": 25,
        "created_utc": 1667934363.0,
        "selftext": "[https://imgur.com/BzxbgGD](https://imgur.com/BzxbgGD)",
        "permalink": "/r/csMajors/comments/ypvecb/applied_to_this_company_2_years_ago_for_an/",
        "comments": [
            "Update: Applied and was moved to the final round. 1 take-home, Hard DP (Dynamic Plumbing) question. Found some helpful tips on SepticOverflow. Wish me luck 🤞",
            "Waited 2 years to fucking roast you.",
            "lmfaoo",
            "Plumbers actually make decent money lmao",
            "tell them “tc or gtfo”",
            "This made my day lol",
            "Hahahhahahahhahahahahahah",
            "Ain’t no way",
            "Lmao, they roasted the shit out of you.",
            "Goddamn 😂",
            "They used an advanced ml model to recommend   that role",
            "Gives a new meaning to pipeline engineer 😭",
            "LMAO",
            "Damn my first thought was they thought you knew how to lay pipe at least if you couldn't code.",
            "LMAOOOO",
            "LMAO",
            "I'd drink and cry",
            " Disrespectful",
            "a real shit post",
            "💀😭 omg"
        ]
    },
    {
        "post_id": "1c8hib1",
        "author": "Expl0siveEnd",
        "title": "ALL I WAMT IS TO CODE!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/1c8hib1/all_i_wamt_is_to_code/",
        "score": 707,
        "num_comments": 133,
        "created_utc": 1713588447.0,
        "selftext": "I don’t get the way you guys think. I want TO CODE. 600 lines of code per day. 200k line projects. I’m in this for CODING. I don’t care about whether i’m “making money”. Whatever lets me do the most CODING. what project do i need to work on to write the most CODE. What courses will teach me how to CODE THE BEST. All i care about in this major is CODING. That’s why i’m in college. I don’t wanna laugh and play with y’all. I’m here for CODING.\n\n>!somebody said they’ve never seen a line of code in this sub, so print(“Here you go!”)!< \n",
        "permalink": "/r/csMajors/comments/1c8hib1/all_i_wamt_is_to_code/",
        "comments": [
            "I was the dude that said “I’ve never seen a line of code” . Thanks for finally proving me wrong my Koading brother",
            "Can you be my mentor? I want to code too! All I want to do is enjoy coding for hours!",
            "The duality of man",
            "Sir this is a Wendy’s",
            "Honestly fair, I took CS because I thought it was fun. I took physics because I thought I could get a job in it lol...",
            "So many people that major in Computer Science only do it for the money. That’s why I wish other majors either paid more or Computer Science paid less. \n\nI’ve wanted to work with computers and coding since I was young. Nothing to do with money.",
            "Ah yes the true elightened. People in CS who legitimately enjoy working with computers and not just in it for the money/prestige.",
            "This sub is so cringe bunch of 2nd years yapping about coding",
            "Lol I feel like ive seen this post before. But about “money”",
            "I WAMT YOU TO WAMT ME",
            "Damn you even copied the \"wamt\" \nU must be a stack overflow pro  XD\nBut yeah, I've a better one\n\n#ALL I WAMT IS TO CODE AND GET MONEY!! LOTS OF BOTH!!",
            "Yeah coding can be fun at times.\n\nBut working on a multi threading C program with a shit load of atomic variables for 8 hours straight will always break the strongest of wills....",
            "This is such junior dev mindset",
            "I love your energy, remember this post when you get stuck on a bug, your go far with this this mindset.",
            "Google Josh Hug Data Structures and it should take you to one of this old yearly data structures classes that he teaches at UC-something. Dudes got video lectures online textbook review guide labs and projects. Covers Java but teaches it as if you were coming from Python and goes over all the essential algorithms",
            "Fire up an OpenSource project. Not only will you get to code, but it can look good on your resume. No one is stopping this!",
            "You can write print(“Hello world”) 600 times",
            "> ALL I WAMT IS TO CODE!!!\n\nFuck yeah, passion is key! But let's make sure it's directed effectively, right? You're set on coding a shit ton, but the quality of code matters more than quantity. Cranking out 600 lines a day? That’s a metric, but not necessarily a marker of progress or skill. \n\n> 600 lines of code per day. 200k line projects.\n\nYou gotta ask yourself, are you looking to improve or just inflate numbers? Big projects are great, but not if it's just fluff. \n\n> I don’t care about whether i’m “making money”. Whatever lets me do the most CODING.\n\nMoney isn't everything, true, but don't you want your skills to be sustainable? Think about coding in ways that also build a career unless you’re independently wealthy or something.\n\n> what project do i need to work on to write the most CODE. What courses will teach me how to CODE THE BEST.\n\nFocus on projects that challenge you, not just ones that have you typing endlessly. Look for courses that push your understanding of algorithms, data structures, and system design. Real shit that makes you think and improve, not just busywork.\n\n> All i care about in this major is CODING.\n\nCoding's great, but collaboration, understanding user needs, and project management are also crucial. Don’t ignore these unless you plan to code in a cave alone forever. \n\n>somebody said they’ve never seen a line of code in this sub, so print(“Here you go!”)\n\nCute, but let's get real. Code isn't just about syntax; it's about solving problems. What problem are you fucking solving today?",
            "Code version of the money post.",
            "*inhales*\n\n#YEEEEAAAAAAAAAAAAAAAA! COOOOOOOODE!\n\nI don’t understand why so many people would go into a whole career if they find no enjoyment in it.",
            "Figure out a path that will get you a job in high performance computing (HPC). HPC is still dominated by engineers.\n\n\nPerformance and reliability are the only things that matter in HPC.",
            "Funny thing is, replace “coding” with “research” and you get r/gradschool",
            "That's exactly what I want, I'm fascinated with coding and would looooove doing that all day, but I'm a freaking beginner, I don't understand completely and it's making me not want to keep learning 😢",
            "\"I don't wanna laugh and play with you all\"\n\nNo matter how many times I see the original copy pasta or any of its variations, this line always gets me lmao",
            "Let's found something?",
            "Are you in college for coding? Why hadn't you gone on bootcamp",
            "Im.... im...... IM COOOOODIIINNNNGGGG",
            "Btw 600 lines per day is insane and at that rate you get to 200k lines by yourself in 70 work weeks.",
            "OP, you are my spirit animal.",
            "I just want money",
            "Can we have a meeting to discuss this?",
            "Cool, do you want experience though?\n\nWho cares how quickly someone can output shitty work? Writing code is the least interesting part of it (and if we're being honest, the part that will become more and more automated).\n\nThe real skill is design, and understanding why to do X over Y and in some cases, when. For example if storage is no issue but processing is, you can potentially take a lower complexity higher storage solution, or the inverse in other scenarios. It's determining which data structure to use, or how a tree needs to be traversed.\n\nWriting the code to do all that is only interesting the first time. Learn to love what's behind the curtain of syntax before it's no longer exciting. \n\nTHIS (in my opinion) is the leading cause of \"oops I hate programming\". Everyone is excited to use syntax, but not to write software. When the thrill of \"new\" wares off, you don't have the transferable skills to use later, and you're constantly learning \"new things\" without ever applying past knowledge. Without the  growth I'm talking about, the tech debt you'll take on will be massive.",
            "I'm a bit different ?\nI'm in for writing code, reading docs, finding the best solution, or discussing it with colleagues, asking for support on Reddit, training ML models, understanding stats, and so much more... 🤤\nMoney comes with a good knowledge applied to our field. And managing well your finances.",
            "First coding related post ive seen on this sub",
            "I didn’t like coding that much when I started my cs degree and I was doing it because I like computers and wanted to do cybersecurity. Ended up coding a lot more and started to like it a lot. Its enjoyable now.",
            "https://preview.redd.it/fudku3a3envc1.jpeg?width=1242&format=pjpg&auto=webp&s=b97774eca4f64ad576c3e7b727dec583b67343e0\n\nYou and that other guy",
            "So now this sub is being reduced to \"copy/paste a previous post and just change a few words\".\n\nThe clearly unintended metaphor for entry level development is humorous I suppose. But this sub can be better than this, OP.",
            "Real coders call “coding” “programming”. Something to remember.",
            "SAME‼️ I CURRENTLY WORK UNPAID AT AN AEROSPACE DEFENSE STARTUP MAKING NOTHING BUT ALSO MULTIPLE TITLES IN THE COMPANY",
            "Best option is to develop apps on your own, focus on small mobile apps for android, iOS or even for the Microsoft store. You could also join a startup that needs a founder with your skills, work on an area you would be interested.",
            "Do you do LC for fun too?",
            "I do too! Although I do not have a degree in CS, I spend a lot of time in my work or spare time to code. I just forget about everything else when coding. This may confuse many people but, I get excited when I see bugs. And the feeling of resolving them piece by piece is out of this world. We should connect.",
            "I’m not gonna say I feel the same way 100% but every time I think about going to a different role outside of SWE I just think \"damn but I’ll miss being able to program and get shit done\"\n\nHowever \n\nThe true nature of it is that companies want TRULY experienced people to move up and make technical decisions to improve products. When I asked my tech lead what it was like to be in his position he said something along the lines of \"I really miss being the one that could build the shit and code all the time, and even though I really hated stepping away from it I’m glad I get to have a real impact by guiding developers\". \n\nIf you have this same attitude 3 - 5 years down the line you’d make a great Tech Lead or Principal (or you could job hop to keep grinding the code lol just sayin)",
            "So glad there are people like you.  Make me code I want to gouge my eyes out, haha.\n\nI would look into groups like OWASP.\n\nr/CompTIA_GingerSec",
            "Oh boy if all you want is to code , good luck with promotion then.",
            "I wanted to write code too, which is why i got a firmware dev job. \n\nInstead what I got was an hour of design meetings per line of code :)",
            "Everyone wants to avoid hare labor and spend time chilling in front of computer. But if everyone does that then the whole world will stop. Someone is always require to do hard labor to keep the world rolling.",
            "You think software engineering out there is all about writing the most code? lol, you are in for a surprise…\n\nCode is liability, \nThe best code is deleted code,\n\nThe best skill you can learn is how to READ other people’s code. \n\nAnd 2nd best is to communicate with others to see what solutions they have that can solve your problem at hand.  \n\nMaybe after these I’ll care how well you write code.",
            "If you truly wanted to code you would! You'd be coding instead of typing on reddit! Go CODE if you wanna CODE",
            "I got into CS for the money. 20 years later I’m still in it for the money. What the problem is?",
            "How ? Give me tips to a beginner? What’s your strategy to learn how to code?",
            "all jokes aside, i’m actually like that",
            "What's funny is that it's a mentality like yours that lands a high paying job.",
            "I’ve been coding for years now, high ranked in school state competitions in Florida for it. I’m leaving highschool in a few weeks and was so committed to comp sci, but switched to cybersecurity because it just seems more job secure but mostly that, I love coding. I don’t need to be in a SWE position or whatever to do it. I can just keep it as a passion hobby.",
            "Oh no….im about to…I’m….COOOODINNGGGG",
            "If you’re working in projects that have 200k lines of code, something horribly wrong has happened and the creators of that code base should rethink their life choices that led them to this point!",
            ">I don’t get the way you guys think. I’m in this for CODING. I don’t care about whether I’m “making money”.\n\nThat's such a privileged \"Just don't be poor LOL\" take. Are you a child? Do you not need to eat, pay bills, or provide for a family? I'm guessing you don't.\n\nIf you want to just code all day for free and your situation allows you to do that, there's nothing preventing you from doing that. Plenty of free software work available everywhere.",
            "You want to code but there isn't much need to manually code anymore. AI is 10x faster than you.\nSoftware Developers need to find ways to provide value aside from manually writing code.",
            "lmfao"
        ]
    },
    {
        "post_id": "14i41a3",
        "author": "Fungipops",
        "title": "I'm going to school in AUG 😀",
        "url": "https://www.reddit.com/r/csMajors/comments/14i41a3/im_going_to_school_in_aug/",
        "score": 714,
        "num_comments": 149,
        "created_utc": 1687641779.0,
        "selftext": "Last year I had a brain eating fungus really mess me up and took a lot of my fine motor skills.(I was an electrician) Well I decided to just go back to school get a degree and pick my life back up. First I stumble across American Dream Academy scooped up what I could from them hit up The site like study.com (Crushed Calculus1) and few others. Now I'm starting my BSCS in August and this 37yr old father of 7 couldn't be more excited!",
        "permalink": "/r/csMajors/comments/14i41a3/im_going_to_school_in_aug/",
        "comments": [
            "New Fear Unlocked",
            "Holy hell you are living on hell of a life sir. I applaud you",
            "That is terrifying…but really glad to hear you pulled through! Wish you the best. I’m curious, do you mind telling how that happened to you in the first place?",
            "Father of SEVEN? Dawg did ur misses pop\nOne out annually",
            "Dude watched the last of us and became the main character. Congrats on the grind. I'd be so defeated. Best of luck.",
            "Please share the brain eating fungus story. How does one get that? Just accident or travel or something",
            "BRAIN EATING FUNGUS?!? \nHoly shit dude you're a beast to survive that, glad you're here",
            "Mad respect bro keep it up 🫡",
            "Sorry for prying, but what motor skills did you lose? And is there any hope to getting them back?",
            "I’m 42 I’m going to graduate spring of 2024. I have seven more classes left. \n\nYou got this. \n\nInsert joke about brain eating fungus necessary for understanding CS",
            "Good luck 👍",
            "Oh damn, you a role model. Following you see how your school journey unravels! Best of luck!",
            "[deleted]",
            "Congrats",
            "Congrats man.  Depending on which program you are in, you might want to look into some computer engineering electives.  It's cool stuff and you'd have an advantage with your knowledge of electrical principles.",
            "I'm really glad you are still here",
            "Well this is certainly one career where you don’t have to use your body but instead use your brain. Speaking of holy shit Thats amazing that you survived that. My wifes sister died really young from something similar. Also there will probably be only one class on ds and one on algo. Thats it - but thats the only thing they ask in interviews so make sure you master those subjects",
            "Also a father of 7 here.  \n\nDon't give up when the shit gets really hard.  Use all the resources available at the school.  Go to office hours. Talk with TAs.  It's going to be impossible.  You're going to want to quit.  Just keep working at it, and communicate with your teacher/TA when you can't figure it out.",
            "Congrats on beating that fungus and school. Best of luck and I hope you continue to crush it.",
            "I'd watch you give a ted talk",
            "WGU's BSCS? I just finished this program!  It's changed slightly since I started it, but it's a good program.",
            "Fuck that fungus. Godspeed sir. \n\nPS: I’m turning 37 this year.",
            "Started school last year at 35, it's never too late to learn",
            "How did you even get that fungus??",
            "Hate to hear you went through what you did. But fan-fucking-tastic job beating it! Best of luck going forward, you’ll smash through this as well and be all the better for it. Stay strong, stay focused, stay driven!",
            "Study.com… you going WGU by any chance?? Transferring in that calc 1?\n\nCongrats btw!!",
            "He’s playing life on Veteran difficulty",
            "Congrats on beating death! That being said! Do self study in the language of your choice and get ahead of your coursework so you could potentially land a job before you even finish the program. Build projects as soon as you can.",
            "TELL US MORE ABOUT THE BRAIN EATING FUNGUS",
            "Congrats please bless me with the chance to work on some projects with you my guy",
            "At the beginning, I thought this is a joke from the last of us, when I found out its true, it holly crack made me wobbled .",
            "Awesome, me too!!! I’m only a few years younger, and super excited to start this next chapter of life.",
            "U got this!!",
            "Will your motor ability ever recover?",
            "Father of 7.... put a cap on it",
            "Best of luck for your life ahead!!",
            "congratulations! huge W",
            "HBO made a show about this.",
            "Proud of you mate",
            "Wow this is inspiring. Congratulations and best of luck in your new field! 😀",
            "Hey bro remember to buy kev and nades, they are very useful later in the round",
            "You’re Him",
            "Pull out game weak",
            "[deleted]",
            "[deleted]",
            "Bro chose cs 💀",
            "You’ve really got this life thing under your belt. You’re making this life YOUR bitch. I respect you sir 👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼❤️‍🩹\nI’m sure all your hard work is going to pay off"
        ]
    },
    {
        "post_id": "rn1sk1",
        "author": "anonthrowwww",
        "title": "I passed calc 2!!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/rn1sk1/i_passed_calc_2/",
        "score": 711,
        "num_comments": 117,
        "created_utc": 1640283588.0,
        "selftext": "I know this isn't that big of an accomplishment but I was really fighting for my life this semester and am sooo happy I passed and don't have to retake this shit class.",
        "permalink": "/r/csMajors/comments/rn1sk1/i_passed_calc_2/",
        "comments": [
            "lol congrats fuck calc 2",
            "Enjoy Calc 3 next semester",
            "Passing calc 2 on my first try is more of an accomplishment to me than getting an internship or my first job. I got a 70.2% lol and i was so hype",
            "Congratulations!",
            "It is a big accomplishment. Don’t sell yourself short. Congrats!!!",
            "If it’s an accomplishment to you then it’s a big accomplishment!!\n\nHate the rhetoric just because some ‘genius’ involved in FAANG who breezed through college doesn’t think it’s an accomplishment, it means it isn’t.",
            "Oh man I took calc 2 three times before I was able to pass, so I feel how big of an accomplishment it is, congrats!! It gets easier from here on out, here’s to graduation and a job!",
            "Congrats !",
            "Congrats!! I had a similar experience and god was I happy to see I survived at the end. \n\nHave a beer or your favourite food and rest well tonight, you deserve it!! ^-^",
            "Calc 2 is ass it's a big achievement",
            "Hello Linear Algebra",
            "I’m jealous. Good job….. I’m gonna have to take it again \n\n:’ < (",
            "Ive pretty much considered dropping out at this point because I just failed cal 2, so congrats.",
            "Lolz I felt the same when I pass calc 1. I didn't care if I got 70 or 90, just get me out of  this class",
            "Congrats! I got a D in cal 1 although I passed every exam the weight of the HW and quizzes were enough to fail me cause I didn’t do those often 😭😿",
            "How yall computer science majors and shit at math",
            "Congrats! I got an A (the highest grade) in Calc 2 last semester!\n\nUnfortunately I got rejected from all internships but that's just how it is for freshman ig\n\n**edit:** why the downvotes?",
            "Same with me this semester. So glad I’m done",
            "Whew I know that relief. I didn't need it after switched to business but man, cal 2 is like a rite of passage.",
            "One more to go!",
            "Congratulations!",
            "Congrats dude",
            "Congratulations, I actually ended up dropping Calc 2 because I was taking discrete structures at the same time and I am not an advanced math guy so it was a bit too tough for me.",
            "It is a big accomplishment, Im still super proud about doing it myself a few years ago lol.",
            "Calc 2 was the only course that I took more than once and actually 3 times during college. So it is hard and conguratolations!",
            "Exactly how I felt with lin alg 😭😭😭",
            "Calc 1 was extremely harder for me than Calc 2.",
            "grats, thats how i was in numerical methods, scary ass class",
            "Passed AP calc BC and got credit for calc 1 and 2. Thank fucking god I don’t have to deal with university calc - that shits loads harder than AP lmao",
            "Congrats man, seriously. I can only dream of passing a class like that.",
            "Heck yeah, I just passed calc 2 as well, go us!",
            "Congrats!",
            "Yep I passed Calc 2 this semester in first try too and the difficulty is insane compared to Calc 1. There was too much info in Calc 2 that even my professor didn’t have time to teach in steps. I had to look up how to do some of them. :( My friend failed so he had to retake it again sadly.\n\nEdit: My Calc 2 class had an average of 75% before the final exam lol so the professor gave us a little quiz for those who are probably close to failing.",
            "I barely passed Cal 1. Great job 👍👌",
            "As a math major, Calc 2 was third worst out of all my classes. Truly a massive accomplishment that you should be proud of.",
            "I’m scared, I’m doing calc 2 next sem. How can I prepare for it?",
            "Fuck Calc 2,3 and 4",
            "I've said it before and I'll say it again, I would legit drop out of school if they told me I'd have to take calc 2 again. HELLLLLL no.",
            "I failed calc2, 3 times. Enjoy this fucking victory. That's fucking awesome!!! I almost nearly cried when I passed. Fuck calc 2. Theoretics are awesome but those exams fuck you like a donkey.",
            "Congrats!! I am happy for you! 🎉 Will you be taking calc3 ?",
            "Me too!!! I feel the exact same way. I had problems remembering all the convergence tests and how to choose to use them correctly",
            "Congratulations! So happy for you",
            "It took me 2 tries to pass calc 2 with a C. Congrats bro",
            "2 years out of college and I still remember the nightmare that Calc 2 was. If you’re passing your first time at it, double congrats! :)"
        ]
    },
    {
        "post_id": "18n15q4",
        "author": "soumya_98",
        "title": "1 course cost my gpa",
        "url": "https://i.redd.it/apmptu2uqh7c1.png",
        "score": 714,
        "num_comments": 171,
        "created_utc": 1703096009.0,
        "selftext": "Because of automata overall gpa came down 😪",
        "permalink": "/r/csMajors/comments/18n15q4/1_course_cost_my_gpa/",
        "comments": [
            "Fuck Pumping Lemma",
            "Yup been there. I deferred all my humanities to final year so that I would not loose a 4.0 cGPA until I already had a signed job offer",
            "Dont stress too much about GPA. After your first Job nobody cares anymore, it’s all about experience and what you know how to do.",
            "It's the only challenging class on there",
            "No one cares about GPA (unless you're doing PhD), but just keep above a 3.0 and you're golden.\n\nMy employer never even checked if I had went to the college I had listed.",
            "Did this once. My advisor told me I should have failed it on purpose since you can retake and replace a grade with a D or lower but can’t with a C. Never cared about GPA after that",
            "theoretical computer Science is not for me I guess",
            "I remember this shitshow of a subject, absolutely dreaded it.",
            "Yeah regular languages, context free grammars, and automata was fucked",
            "Lesson learned, next time do not take that course.",
            "wayne state??",
            "This class is so unnecessary and ridiculously complicated, I hate it",
            "If you wanna go into software engineering, I don’t think they really care, I got two internship offers from pretty big companies next summer and I don’t even list my gpa on my resume",
            "Oof discrete math always hurts",
            "Fuck push down automatas and pumping lemma",
            "thats the way she blows",
            "Interestingly, this is the course I did my best on this semester. Meanwhile, I slacked off on the easier courses and ended up with A-'s. Like, literally missed out because I missed a random quiz here and there. Meanwhile, this course was tough so I actually studied lol.",
            "Ended math with a 79.45 (C+) asked my professor to round it to a B- as i only needed .5 for it and he said no 😭",
            "do you go to njit too bc my database class has the same name",
            "Same . Had a C, dropped that gpa to 3.625. Crazy",
            "Happened to me. I just graduated with a BS in cs and had all As in every class except this advanced algorithms and computer architecture course where I got B-. This led my gpa to end up at 3.9 which is still very good but yea one course with a bad grade can significantly lower ur gpa",
            "That's a good thing. I had a roommate that a C+ would have raised his.",
            "Noooo that was my favorite class!",
            "Been there as well. My most hated class",
            "What in the world is this? I just finished my finals today and I (hopefully) got an A or A- in everything except Automata Theory (that’s what it is at my school) 🤣🤣🤣",
            "Mfw im taking it next semester 🤡",
            "Wayne state lets go",
            "A fellow Wayne State Warrior I see 🫡",
            "I would be so pissed lmao, but it really doesn't matter at the end of the day, especially in this field. You're clearly a good student otherwise so I'm sure your overal GPA is still high enough. Shit happens unfortunately lol",
            "Lol! In one semester, I took Advanced Operating Systems, Cryptography and Security, Artificial Intelligence, and Linear Algebra, all while doing an internship, but let me tell you something. I deeply regretted it 💀",
            "Automata SUCKS",
            "I got my first B this semester. It was in OS and I had a really great but very challenging teacher. I worked my butt off for that B so I decided I should be happy with it",
            "Straight to jail",
            "That hurts, stay strong and focus on the future.",
            "LMFAOOO thats me too. i also took database and formal lang and i got a C is formal lang and an A in all my other cs classes",
            "Prog Theory vs. My GPA: coming soon to Netflix",
            "Oh man I remember stressing waaaay out about this. Bombed my databases finals ended up with a C-  \n\nSome other classes also took a toll. Caused so much stress. \n\nIn the 14 years since then, not a single employer ever cared about my GPA or even my diploma.",
            "Same happened to me this semester man theory of computation sucks ass",
            "Well GPA doesn’t matter much when comes to job, if your average is about 3.5. I wouldn’t worry much as most of companies don’t ask for GPA.",
            "Wayne stated",
            "Damn. \nThis happened to me too. \nThe same thing repeated again when I took up  Machine Learning",
            "You mean that your overall gpa reflected your accomplishment?",
            "That was my favorite course for CS.",
            "Bruh what happened with CSC 6500?",
            "That’s why you have to make friends with a shit load of students ideally with those who are older than you and with people in your class.  Also, you can’t go wrong with becoming friends with your professor.  Try to go to every office hours.",
            "At least you didn’t die on the Sisyphean hill of DSA, which separates the CompSci majors from the Cybersecurity majors.",
            "I cant believe these are real classes. Im a dev (high school) and getting graded on these real world topics seems so strange",
            "Something tells me you’ve not had an actual difficult course aside from theory of automata. The other two are complete freelo as well.",
            "It really depends how you approach it, in most classes they'll teach you theory and stuff, but if you dive in the book and do the exercises it's actually pretty fun, makes you a better thinker, programmer even... The key is taking doing every problems in the book, because they start extremely easy and slowly add the complexity to it",
            "YOU cost your GPA man, not the class. Own that shit",
            "Breh i lost because of the humanities subject 😂. This is solely because of awarding random marks for random students",
            "Koi internship Dilwa do bahoot jruri hai .. Nahi mil rha thak gya resume bhej bhej kr sab reject kr de rhye sorry keh rahye please kisi ko link hai to Cse mai software mai internship Dilwa do Bhai.. 🙂🙂🙂",
            "Fun fact: my university lists this course on its website, but has never actually offered a single session of the course in its recorded history. \n\nThere's a mystery that makes it more enticing.",
            "Same, for me it’s fucking English 3/5 brought everything down",
            "Gotta love WSU. Sometimes you don't know the type of professor you'll get.",
            "It’s always automata lol",
            "How deterministic of you",
            "Me in India, same bro.",
            "Chomsky normal form \\*\\*shudder\\*\\*",
            "I thought this class was pretty cool even though I doubt it will resemble anything similar to what ill be doing in the future. Automata was not that bad, computability was tough though",
            "i never hated a class so much",
            "💀",
            "Holy that's big numbers. I think in my university 75% on the Automata course would be an easy A",
            "If you aren’t going to grad school, I doubt anything from automata will really matter unless your job is solving whether P = NP"
        ]
    }
]