[
    {
        "post_id": "jj26m2",
        "author": "imboredasfuckhello",
        "title": "I GOT THE JOB!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/jj26m2/i_got_the_job/",
        "score": 711,
        "num_comments": 58,
        "created_utc": 1603809066.0,
        "selftext": "just sharing happy news. I got my first internship! I’m a sophomore and haven’t taken data structures&algos yet so I grinded my ass off for these technical interviews on my own time. Not a tech giant or anything, but a SWE role and a good company culture that I was looking for!!\n\nHope everyone in this sub gets an offer they love soon! This sub has been my main source of motivation through this hard semester.\n\nedit: of to off too excited to spell",
        "permalink": "/r/csMajors/comments/jj26m2/i_got_the_job/",
        "comments": [
            "[deleted]",
            "Me too! I just found out this morning, my first internship! I couldn’t pass the technical interviews to save my life. Thankfully this company focused on behavioral and I got in! Congrats to us! Yayy 😂",
            "Happy for you!",
            "Congrats! I'm a sophomore too and struggling a lot in getting any interviews, could I perhaps take a peek at your resume ?",
            "Congratulations, what are some resources you used for the technical interviews?",
            "Noice",
            "That’s awesome! Where did you go to practice problems and how many did you do?",
            "Congrats 🎉",
            "congrats!!",
            "Congrats!!",
            "Good shit man",
            "Congratulations, you deserve this.",
            "I'm a freshman taking intro cs, hoping to grind over the breaks to hopefully get an internship sophomore year. I have a couple of questions if you don't  mind: \n\nWhat kind of technical skills did you work on alone? \n\nAny good resources you used?",
            "Which company?",
            "*Does happy dance* Congrats! I'm so happy for you.",
            "This is a big first step, congratulations! Best of wishes on your internship, hope you learn a lot of new things!",
            "[deleted]",
            "[deleted]",
            "Do you attend a college considered one of the top in CS? Curious if the school helped you get the interview or did  you get it on your own?",
            "hey man congrats!! i’m a junior and i’m waiting for next year to sign up for internships! good luck! bro! have fun and make the best out of it",
            "Congratulations! 😁😁 That's amazing"
        ]
    },
    {
        "post_id": "1ahbh6a",
        "author": "Fabulous_Year_2787",
        "title": "AYY BOYS WE MADE THE LIST",
        "url": "https://i.redd.it/8u2fr3hk08gc1.jpeg",
        "score": 703,
        "num_comments": 146,
        "created_utc": 1706900846.0,
        "selftext": "https://financebuzz.com/most-useless-college-degrees",
        "permalink": "/r/csMajors/comments/1ahbh6a/ayy_boys_we_made_the_list/",
        "comments": [
            "https://preview.redd.it/rxupyuxn49gc1.jpeg?width=848&format=pjpg&auto=webp&s=bf551d84364d78441a5ff7a71e720e6e0f3204f3",
            "Good - we need people to start dropping off the CS train",
            "There's a fucking list of 17 degrees. And this is just the beginning. Lets see an additional \"useless\" degree list:  \n\n\n1. Chemistry degree - low pay hard\n2. Physics degree - low pay hard af\n3. Mech eng - mediocre pay hard\n4. EE - hard af, mediocre pay\n5. Geology - hard af, tough af, mediocre pay\n6. Religious degree - actually profitable since you still gotta pay for cemetary singin' n' shit\n7. Law degree - saturated\n8. Econ degree - saturated\n9. Pharmacy degree - saturated, hard af, mediocre pay\n10. Agroculture  - mediocre pay\n11. Mathematics - good fucking luck. Finishing it and then actually getting a job\n\nGee, is there any degree that is actually not useless at this point",
            "Guess it's time for me to start onlyfans and porn then. \nSincerely,\nA useless degree earner",
            "\" most useless degree \" lol\nThe numbers don't lie, it's not a useless degree.",
            "Mom I made it",
            " it's not a useless degree, nice bait bro.",
            "If you listen to homeschooled, lifeless redditors you'll be surprised how much of the degrees are useless, how the economy sucks and how everytime it's someone else's fault. Keep going, be a good professional and you'll do it!",
            "[deleted]",
            "What a fucking hack. Bias aside, this author has no idea how finance works despite writing for a website related to it. This is by the same author who is delusional enough to genuinely believe being an event cleaner or a volunteer for the NFL will get you tickets to the Super Bowl 😭 : https://financebuzz.com/super-bowl-jobs\n\nIronic that she lists creative writing while she’s a “journalist”, but weirdly enough she lists criminal justice and hospitality in there when those have plenty of work available, though I say hospitality since I live in a city where it’s more common.",
            "Its crazy to my how someone can NOT be interested in computer science. Like bro i throw some electrons at it and it can follow my commands. We tend to forget about it due to godly abstraction levels. I just touched a plastic box a few times and now i can share my thoughts with people i will never meet.",
            "Relevant degrees - \n\n1)finance(very hard to get jobs and insane workload)\n\n2) med school(making it tough 8 years of school and 200k in debt is insane)\n\n3)any engineering other than ce(hard asf to make it through and limited jobs)\n\n4)econ(useless if you’re not from a prestigious school)\n\n5) math/physics( insanely hard and barely any jobs)\n\n6) CS(not that hard, good pay, prestige doesn’t matter that much, decent jobs) even if youre slightly above average you have good chances. Also if you have good networking and social skill’s along with cs skills. Youre golden. Dont listen to these bots",
            "I think the listed degrees are kinda quite useful, is it just gatekeeping or sth?)",
            "💀",
            "bro i’m not hearing back w google internships. idk how else you stand out fr\n\nEDIT: I have already interned at Google. What I meant to say is that I am not hearing back for full-time roles despite having already interned at Google.",
            "From that list, I’d say CS and Criminal Justice are useful degrees.",
            "It’s never been useless? It’s only useless if you did nothing to improve yourself while getting the degree in the 4+ years it took you to get it. That’s the case with all degrees from any discipline. A degree alone means nothing.",
            "Yea we’re not there yet",
            "This is a dumb list.",
            "You'll be lynched on this sub.\nMostly by negationists and hopiumists...",
            "XD",
            "It gets more \"interesting\" as I found other useless college degree lists on the internet, and CS is one of them, surprisingly, or not surprisingly, considering this subreddit.\n\nHere are more lists that list CS as a useless degree.\n\n[EDsmart Useless College Degrees List](https://www.edsmart.org/most-useless-degrees/)\n\n[Future Fit Useless Degrees List](https://www.futurefit.co.uk/blog/useless-degrees/)\n\n[CareerAddict Useless Degrees](https://www.careeraddict.com/useless-degrees)\n\n&#x200B;\n\nAnd no, I'm not gonna suddenly change from CS into another major just because it's the next \"psychology\" or whatever.",
            "here come all the copers",
            "This list is weird. Isn't every degree technically saturated? How many doctors do we have? Electrical Engineers?Therapists?\n\nEvery degree is over-saturated and can lead you to eternal sadness.\n\nPick the major that keeps you interested and wanting to learn more.\n\nThe world is too big to think that you'll even be doing what you majored in honestly.",
            "I used my CS degree to get into a technical BA role instead. Basic automation in low code etc. Probably gonna work towards getting into management over the next 7 or so years"
        ]
    },
    {
        "post_id": "u63vp4",
        "author": "BlueBoyKP",
        "title": "Why is LinkedIn so Unbelievably cringe!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/u63vp4/why_is_linkedin_so_unbelievably_cringe/",
        "score": 713,
        "num_comments": 85,
        "created_utc": 1650253349.0,
        "selftext": "How do these people not see that they are the 765,500,435th person to type the same exact thing.",
        "permalink": "/r/csMajors/comments/u63vp4/why_is_linkedin_so_unbelievably_cringe/",
        "comments": [
            "Everyone thinks that they are in the NBA 😂. I saw one guy who posted that he was traded from Amazon to Meta like wtf",
            "Idk why but every single LinkedIn post just looks like a bot wrote it",
            "I am proud to announce that I will be joining cumsack company as a security SDE II (third version) intern this summer.",
            "[deleted]",
            "Come on over to r/LinkedinLunatics",
            "Agree?",
            "You’re telling me?\n\nThat you hate seeing posts. \n\nLike these?\n\nBut it’s so motivating!\n\nI love typing my posts out in single lines like this. \n\nThe LinkedIn way.",
            "The correct way to use LinkedIn:\n1. Go on LinkedIn jobs tab\n2. Get job\n3. Log out until time for next job",
            "Linkedin is cringe but so is Reddit. The type of stupid questions people ask on Reddit in this sub thread blows my mind",
            "Why do people say happy birthday? It's already been said billions of times, too.",
            "[deleted]",
            "You can say the same for Reddit. Same shit is posted over and over again.",
            "Lmao this would be good if it's a repost",
            "[This](https://i.kym-cdn.com/photos/images/newsfeed/002/126/225/67a.jpg) except those people yet to realize.",
            "I'll do some cringe to get hired",
            "Internships should be paid or unpaid?",
            "Im convinced they're not real people. Bots or Big Tech psyops or something. Id be roasted so fucking hard if I posted anything remotely like that",
            "[deleted]",
            "It seems to be an element of human nature where people seem to be more concerned with falling in line and they don’t seem to question it whatsoever.",
            "First fully valid post and comment section I’ve ever seen on this sub",
            "It’s the most boring social media platform, but an extremely good way of getting tech jobs.",
            "There was a guy who made a rap song about data engineering",
            "Treat everyone else as though they’re an NPC. Then you won’t get triggered over something as silly as other peoples linkedin posts.",
            "That is exactly why I connect but unfollow coworkers and colleagues. Too much “they commented on this post” or “like this post” which are just a bunch of Facebook memes, rants, or “started from the bottom, not I’m here”",
            "“Up vote if you think internships should be paid!”\n\n“I’m proud to announce…”\n\nI just try to stay away from the home feed. It is like Facebook but even more in-authentic. \n\nThat being said, the website actually has some great features for networking and allows people to see your experience without a formal resume.",
            "its just corporate marketing platform.\ngetting jobs and hiring ia just a front",
            "Why is the word cringe even a word....  i see it on reddit 1531000870 times a day....  It makes me want to commit extreme violence.",
            "LinkedIn is like upper class Facebook isn't it?",
            "Everyone trashing posting on Linkden but posting about my successes has provided me with more opportunities as a result of the connections and connection’s connections that see it. Is it cringe? Definitely. But I can’t deny that’s it’s helped me progress in my career",
            "The only thing I've ever used LinkedIn for was to send a message to my team leader to let him know I was out of state and needed to take emergency leave.\n\nNow it's coming to me, I also sent a couple messages to some old schoolmates a few years ago to see how they were doing.\n\nIs there anything more than that to LinkedIn?",
            "I agree though you can't deny how very useful it is.",
            "If you’re talking about people’s ‘new job announcement’ posts, I’ve wondered if the companies are pushing new hirees to make those canned posts as a way of getting some kind of free ‘job marketing’.\n\nI’m hoping that companies aren’t forcing people to do it tho, because if so I won’t be accepting the job",
            "Want to get hired? Play the game. Want your dream job? Play the game. The simple truth is, that at the end of the day humans are the ones hiring you, usually HR people who frankly don't know and don't really care about your technical skills.\n\nA mediocre engineer with above-average people skills and a LinkedIn page full of posts will get hired 100% of the time over a brilliant engineer with no people skills and no LinkedIn and posts.\n\nSucks. But that's the way the world works.",
            "Anyone who stays on LinkedIn long enough to get annoyed with LinkedIn is part of the problem with LinkedIn. When you want to level up, log in, get a premium plan, set the 'looking for work' option, ask low-level boiler-room type recruiters not to bother, find a new job, increase your TC, cancel your premium plan and log out until the next time.",
            "Linkedin is one giant, shameless circle-jerk."
        ]
    },
    {
        "post_id": "1433q24",
        "author": "iredditsolongago",
        "title": "Got a job!",
        "url": "https://www.reddit.com/r/csMajors/comments/1433q24/got_a_job/",
        "score": 703,
        "num_comments": 58,
        "created_utc": 1686113628.0,
        "selftext": "It's part-time bartending gig. Couldn't get an internship lol. Guess I'll be slanging margaritas this summer!",
        "permalink": "/r/csMajors/comments/1433q24/got_a_job/",
        "comments": [
            "Congrats! New grad here. I just landed an offer at a warehouse.",
            "Nice, could you serve me something? I wanna get more wasted than the new grad market right now.",
            "place the glasses in a linked list cycle, so that you can fill them in one go",
            "Get into deep convo with your customers. You might end up meeting dev even CEO/CFO at your place. Then share your LinkedIn. I had a friend he used to work at a retail where he met his boss .",
            "Howd you get it? Did u have prior experience? Bc nobody would hire me without experience",
            "Dude I feel you I was part of a startup and planning to work on it during the summer but then my boss fired me 😍",
            "Any job is a good job. Congrats!!",
            "Got a job selling tractors cuz I couldn’t find a dev job and had bills to pay 😂",
            "Lesgooo baby...",
            "[deleted]",
            "Good luck! I hope you like it!",
            "LOL about to be me in a month",
            "Bartenders make so much money. And waitresses. My sister was both and got so much.",
            "You go champ !  Use this as a chance to learn soft skills i guess and on ur time off, code code code!",
            "I got the notification and immediately pressed this to congratulate you… congrats?",
            "Also about to graduate, just got a swanky new job as a hotel receptionist 😂",
            "I personally would take any desk job like some copy writing or excel pasting or something over physical jobs",
            "Well, glad I'm not the only one without an internship. Bartending sounds fun tho!",
            "An opportunity to work on your soft skills",
            "Hey, it’s still better than no job! I did food service in Azkaban, 12 years of it! (Jk but for real, good job and make that money)",
            "If I were you, I would make good cocktails and then add this to my resume: \n\nUtilized a custom-built API (Alcoholic Potent Ingredients) to fetch data on customer preferences and generate personalized products that exceeded their expectations.",
            "Dw. COVID fucked a lot of peoples internships for a year or two. There’s lots of time to go try hard mode even after you graduate. Focus",
            "congrats!",
            "I made more money as a bartender than I do now working in IT.",
            "Same as you OP. Couldn’t get an internship, now I’m working at a food court",
            "Seeing these posts literally makes me want to give up, what a joke of a market. Masters in education science and BS in biology, with expected BS in CS in 2024 with still no propositions. What a joke"
        ]
    },
    {
        "post_id": "12i0eig",
        "author": "Quarks01",
        "title": "I FINALLY GOT A SUMMER INTERNSHIP",
        "url": "https://www.reddit.com/r/csMajors/comments/12i0eig/i_finally_got_a_summer_internship/",
        "score": 705,
        "num_comments": 91,
        "created_utc": 1681169107.0,
        "selftext": "After having applied to 400+ companies, 20+ OA completed, 10+ first-round interviews, and 5 final rounds, I've finally landed an internship.  Got the call from the recruiter today that they want to extend the offer and I should get the official email tomorrow.  I didn't think it'd be possible to get an internship all the way out in April but I'm so happy I didn't lose hope.",
        "permalink": "/r/csMajors/comments/12i0eig/i_finally_got_a_summer_internship/",
        "comments": [
            "LETS GOOOOO",
            "I think I lost all hope at this point but GG to you op.",
            "What company if you don’t mind",
            "Congratulations, you deserve this!",
            "Aye congrats !!",
            "Congratulationsssss. Definitely know you worked hard for this !!!",
            "Wild how someone with Amazon + CMU had to send 400 applications. That too citizen. Crazy times.",
            "congrats!\n\njust curious, did cmu help?",
            "Congratulations!!!",
            "Congratulations! Hard work definitely paid off with a never give up attitude! 🥳",
            "Congrats bro\n\nWhen did u initially start applying for summer roles?",
            "HUGE! LETS GOOOOOOO",
            "Ohh… Interesting.  Anyway good luck fam for your Internship. Hope you would be happy to share your internship progress here in this sub.",
            "Himothy 🐐",
            "Congratulations 🥳🥳🥳",
            "congrats",
            "Congratulations!!\nDo u have any tip for a 1st yr CS student to help get internship faster?",
            "how do you apply at that many places i dont even see that many job posting anymore",
            "Are you an international student?",
            "[deleted]",
            "don’t get hope guys this guy goes to CMU he’s cracked",
            "Nobody cares",
            "That’s awesome! congratulations",
            "🐐🔥\n\nGood job big dawg",
            "That’s great bud! What’s the role you applied in the internship?",
            "Congrats 🎊 👏",
            "When did you apply?",
            "Now you can pay me back. Good.",
            "When’s a good time to apply for internships?\nyou as a freshman?\nsophomore?\njunior?\nor senior in university?",
            "Congratulations!!! Could I ask how it's possible to apply to so many at a time? I'm a little unfamiliar with the internship application process, is it just sending your resume to companies on Indeed?",
            "I got a my second offer yesterday. I wonder if we got the same company lol",
            "Congrats",
            "I still didn’t get one 😭 but huge congrats to you 🎊!!!",
            "Whoa awesome job OP!!! when did you apply for square?",
            "Congratz! Big things to come, best of luck",
            "Sorry if this a dumb question, what is OA",
            "Lol yall are applying to 400 internships im proud of my ten TT Art major btw so I don't even think there are that many internships available."
        ]
    },
    {
        "post_id": "19ajaop",
        "author": "Born_Cash_4210",
        "title": "Thoughts on Bumble for jobs",
        "url": "https://i.redd.it/qez5d7d8hedc1.png",
        "score": 703,
        "num_comments": 66,
        "created_utc": 1705671548.0,
        "selftext": "Came across this image on r/LinkedInLunatics and wanted to know what developers might think about this idea. The stage is yours to share your thoughts/opinions/suggestions",
        "permalink": "/r/csMajors/comments/19ajaop/thoughts_on_bumble_for_jobs/",
        "comments": [
            "This the kinda thing business majors pitch to you when they say they have a genius business idea",
            "Basically ripplematch, before it went to shit",
            "What's the benefit to a company of needing to review candidates that didn't apply to them? They'd probably end up swiping right on hundreds of profiles and ghosting most of them.",
            "We don’t need a bumble for jobs. Nobody needs it. Fire that Product person asap",
            "You think it's a good idea until employers can add filters like education and years of experience.",
            "Swipe dating sites are complete ass and anyone who has a different experience is either lying or an outlier. Either A, you're female or feminine non-binary and get flooded with matches that are creepy af; or B, you are male or masculine non-binary and it takes literal days or even weeks to find a match that doesn't have some insane expectation of your first message and then it still doesn't go anywhere.\n\nIf the only way to get a job was a similar process, I would just give up on life at that point",
            "Brain rot.",
            "Hired.com works like that. I've gotten a few interviews at good companies from it. Though, like LinkedIn, mostly joke places that ignore my comp requirements.",
            "Already exists. Otta.",
            "Definitely not, I'm having a hard enough time as it is 😭",
            "This is a horrible idea",
            "Her:\" I think we need bumble for jobs\" \n\nMe:\"Indeed\"",
            "Bumble already has bizz where you can “connect” with others.",
            "And while we’re swiping there should also be subway surfers (or Minecraft parkour) gameplay underneath",
            "“Rules 1 & 2 of Jumble:\n1. Be PhD in CS \n2. Don’t be non PhD in CS”",
            "Right now, LinkedIn is a place for circus freaks. Stay away from it. Go back to the old ways!!",
            "Already sounds better than the current market. Screw cover letters, million rounds of interviews or fake connections. Just lemme write a bio and you swipe.",
            "it's not only stupid, but it already exists since years. \n\nAnd Linkedin is the place with the dumbest people. Smart people don't have time to write there.",
            "Yeah and Tinder for freelance",
            "isnt this already a feature of bumble",
            "If this is a product head at a product company... I heavily doubt the product's quality there.",
            "I think she better start washing dishes 🧽🍽️",
            "Already exist check fabskill",
            "Lol, this is an idea by someone who's never actually had to hire someone in their life.\n\nNo one in their right mind is going to look at everyone's resume to see if they might like them just for the other person to not be interested, or be already employed. And on the employee side everyone will just say yes to every posting.\n\nThe current systems already overwhelming so everyone's using automation tools to filter out stupid applicants",
            "The job market would turn into the online dating market, where it looks like there is an unlimited pool of candidates so companies would never make a decision and commit to it. Or they would swipe right on someone they like better than you, go for coffee and replace you",
            "It’s just stupid.",
            "ripple match",
            "“I have an idea that nobody had before ”",
            "completely bullshit.. bumble has approx 1:1 ratio of males and females (ik, not the same but at least 3:2 or 7:3), and still, it's hard for males to get matched with anyone, imagine the recruiter-to-applicants ratios it'll be around 1:500 or so. It's highly likely that recruiters might not use it because it takes too long to find people, they can simply run all the resumes through ATS and filter out top applicants.",
            "The user and service provider’s interests are the complete opposite of each other",
            "i’m tempted to make this",
            "instahyre exists",
            "This already happens in some ways. You see job posting and you express like by applying. They get a bunch of resumes and pick the ones they like. Both apply filtering criteria. When employers are on the hunt, recruiters search for candidates. Putting effort in the application is akin to working on your profile. LinkedIn EasyApply has proven that easier application methods dont mean the process is better. This also significantly increases the volume of low interest applicants.\n\nNot entirely sure what problem this would solve besides being cute with the swipe motion. ",
            "so most of job sites? If they like you they contact you. If you like them you apply. Basically how it works.",
            "Oh man, girls are about to experience the average male match rate experience on these apps",
            "The ghosting on this would be legendary",
            "what in the late stage capitalism",
            "Companies swiping left like a mf",
            "BigShyft app is similar to this. Job profiles are presented like dating profiles and candidates can swipe left or right. \n\n&#x200B;\n\nHowever, there is another thing it has in common with Bumble. \n\nYou never hear back from your matches.",
            "It's like waiting in line for getting a Jio Sim for free Internet, and waiting in line to deposit money in banks.\n\nEinstein's theory of relativity will be applicable here. \n\nSwiping to find dates will be fun. So, you will not know when time will flow by. And you may chat with some fellas (girls/boys) too in between. \n\nSwiping for selecting candidates will be hectic process. You have to go through the profile, past experience, relevant experience (even if all these perfectly match the job description, based on algorithm). And mind you, the number of applicants may be incredibly high. Sometimes, there will be 1000s of applicants for a single job opening. Moreover, the HRs will have to do way more overtime that they used to, because, they dont need their work laptops. Mobiles will do , right. So, currently, when HRs are probably chilling out on a weekend, after Bumble-like app,  they are still swiping for candidates' fit with the company. \n\nSo, a carefully designed and discussed app should be used, if it makes things better, not worse",
            "Patrick, you’re FIRED.",
            "It's called Ripplematch and it's fucking dogshit",
            "There is something already! Anyone tried this \"bizz\" thing? There is bumble date(make moves to find that spark), bff(make friends and find community), and bizz (move your career forward).",
            "This is what it takes to become a Product Head at a company?? Guys I think we’re all qualified",
            "Why? So companies can ghost you and leave you on read like your other tinder matches?",
            "the question is not in bad faith.\n\nI don’t know if masculine nb means ‘AMAB nb’ or nb who presents masculinely, irrespective of ASAB.\n\nSimilarly, I don’t know if feminine nm means AFAB nb or nb who presents femininely, irrespective of ASAB.",
            "This post stinks of soy from miles away.  \nThe problem with any kind of system like this is the fact that the \"marketability\" of individuals is used as a selection criteria, as opposed to their skills. Recruiters will choose the person with a profile slathered with emojis and buzzwords, giving the biggest corporate slave vibes, as opposed to a serious candidate with a little self respect and a black-on-white resume profile.  \n\n\nKeep business majors out of tech, for the love of god.",
            "Going to have men with law degrees and PHDs struggling to get McDonalds interviews lmao"
        ]
    },
    {
        "post_id": "rfyc5x",
        "author": "throwaway81450496",
        "title": "How to humble brag about salary?",
        "url": "https://www.reddit.com/r/csMajors/comments/rfyc5x/how_to_humble_brag_about_salary/",
        "score": 706,
        "num_comments": 155,
        "created_utc": 1639453516.0,
        "selftext": "So due to Covid this will be my first time back home since graduating college and I come from a Chinese household so there will be many “parties” that involve people investigating me by asking for my salary\n\nNow I’m a narcissistic and prideful piece of shit, and worked my ass off partially for the pleasure of being able to show my parent’s friends how much better being a CS major is than whatever the hell their children do. But I also cannot tarnish the family name by being “that one prideful guy without tact”\n\nThus, help me out: what’s the best way to humble brag my salary without being too explicit? The more toxic the better.\n\nTC: 350",
        "permalink": "/r/csMajors/comments/rfyc5x/how_to_humble_brag_about_salary/",
        "comments": [
            "bitch about taxes taking away too much of your salary. tried and tested trick",
            "Brag about how much free time you have because you don’t have a girlfriend",
            "Post this on Blind. Assholes on there would have the perfect answer :P",
            "As the old Chinese adage goes, he who keeps silent makes a fortune.",
            "Loudly discuss your 8:30 rez at Dorsia",
            "Buy that lambo man, you'll slay at the party!",
            "Complain about your tax withholding or talk about how 35% tax bracket is unfair.",
            "But you not Doctor!",
            "Pay for the damn party when questioned also where do u work as in which hedge fund",
            "Blind will be more helpful",
            "Chup ho jaa bhai",
            "new cringe lows for this sub lol",
            "I can imagine this cringe scene if you are from a \"not so wealthy\" region:\n\nRelatives: what do you do? How much do you make\n\n\nYou: I am a software engineer and I make 350k\n\n\nRelative 1: oh so you play computers for work? Grow up and find a real job!\n\n\nRelative 2: yeah, not as good as working for government\n\n\nRelative 3: so you are just a code money, you will lose your job when you turn into 35 yo. \n😂😂😂\n\n\nEdit: formatting",
            "Say 15$ an hour then buy a nice house",
            "1. Shut up and don't brag about your company and salary until someone ask you. If you live in a Chinese household, 99% chances are some dickheads are going to ask you how much you made a year, where you go to college, or where you work. Asians are the least tactful people in this world lmao (trust me bro I'm Asian).\n2. Wear a shirt that states where you work or where you study. When people ask why just say that you have no other clothes to wear. Then go and complain about how your company free lunch buffet's rib-eye steak is usually overcooked.\n3. Complain about having no work-life balance despite working 100$ per hour job and that you are a capitalist slave. This probably won't work if you are dealing with a Western family, but Chinese family? Lmao they are gonna tear you up apart.\n4. Complain about having to pay >35% of your salary as personal income tax and how everything is expensive in where you live.\n5. Complain about how your junior coworkers made 400k a year despite you having more experience than him, and is only making 350k a year. Or how your colleague bought a villa in the middle of Manhattan that is bigger than your villa in the central of Los Angeles.\n6. Complain about that college friend of yours who went to Harvard/MIT for PhD or that friend of your who are working in Jane Street, and then pretend to have a life-decision crisis, then ask your relatives on whether you should continue working at FAGMAN for 350k a year or go to PhD at Ivy League.\n\nNot that I actually did this. But knowing how Asians like to measure and compare dicks so much, lmao.\n\n**Seriously please don't try any of the above...**",
            "This has a shitpost tag and I really don't recommend humble bragging at all, but if you're Asian like me and have that one family friend who can never butt out of your business, maybe get your parents involved. My mom got really tired of this one friend of hers always shit talking me & ended up texting her something like \"hey my daughter's picking between 7 different offers for full time, which one should she take?\" with full descriptions of the benefits because she used to interview people at her company & worked kinda closely with HR. That got her to be quiet real quick",
            "Acquire real estate. Invite to housewarming.",
            "You're not a doctor, your TC is meaningless... to your asian parents. So and so's kid did some stupid boot camp and got a job just like you, so your degree was not a good deal.\n\nDo you have access to private banking? if not, your TC is meaningless...\n\nAre you an accredited investor? if not, your TC is meaningless...",
            "A low key way to flex is whenever your friends ask u to hang out, let them know u make over $100+ an hour and that whatever they want to do better be worth it or your literally missing out on hundreds. Also, ask for compensation if u don’t end up having a good time as your time is literally worth 6-8 times theirs :)",
            "Tell it to the most snitchy person of all, but not anyone else",
            "This easy man, say you are just starting out and your starting salary is ONLY 350. 😂",
            "Use the same answers wealthy people say when asked about their pay.\n\n“Well, I do OK.”\n\n“I’m comfortable / I live comfortably.”\n\n“[Employer] takes care of me.” \n\nDon’t forget the subtle self-assured smirk when you say it.\n\nAlso your clothes, especially shoes, are easy identifiers of wealth levels. Same with watches.",
            "Is a score of 21 good on the putnam?",
            "Give out eggshell white business cards",
            "You do it through stuff like buying an expensive watch, or talking about your expensive vacation, or an expensive dinner you went to. You obviously can't mention your salary exactly - that comes off as trying to hard. You have to be more natural about it, and do stuff that gives you an air of appearing wealthy. Also, expensive watches don't tend to depreciate, so it's a nice investment.\n\nOr, you can buy your parents something expensive and get them to do the bragging for you.",
            "Tell them how you can buy all the organs the Chinese govt harvest from prisoners",
            "When they ask for your salary just say it's complicated because of bonuses and stock performance.",
            "A tactful way to handle this is by reminding people that you live in a high cost area (cite a mortgage payment amount, for instance) and maybe have loans to repay, as well as taxes that eat a good amount of your earnings before you see them. Helps to put things in perspective.\n\nUnless none of that is true and you're earning 350k remote from a shack in Montana. Then just say you're accumulating guns, food, and building a bomb shelter for recreational purposes.",
            "Suggest that you are looking into expensive services. Casually bring up that you were debating about hiring a full time chef, but aren’t sure if you will eat all the food since you like to checkout the local restaurants. \n\nFurthermore do people think you should have an investment property in Paris, Hawaii, or just a small condo in Manhattan? It’s just not clear which one is the best investment… of course you don’t want to be sitting on a lot of cash so time is of the essence\n\nIf I had two parking spots, I’d definitely buy a Range Rover, but it’s probably more environmentally friendly to stick with a Model X as your one car.",
            "Definitely look the part. Buy some expensive clothing and accessories, maybe some LV, Balenciaga, or Off-White. Get that nice Rolex. Check out Chrome Hearts for some nice expensive Men's jewelry if you're into that. The trick is though, don't buy the stuff with a huge flashy logo, but prominent enough to flex. If you're suddenly showing up to parties looking like a million bucks, people will be jealous. \n\nAlso, complain about how your new luxury loft is too big and you need to hire not one but two maids to clean it. You also need a third maid specifically for your new \\[car preference\\].",
            "I think you just want to complain about your job. For example, tax bracket, how much/little free time you have, how much/little effort you actually have to put into work, how much better you are than your peers, how after 100k anymore money doesn't make a huge difference. \n\nAnd then to end it off ask them if they can relate (they probably can't lol)",
            "Every time someone asks pull out a $100 and burn it.",
            "350?\n\nWhat's Mandarin for \"my best friend is the loch ness monster\"?",
            "> Now I’m a narcissistic and prideful piece of shit,\n\nLOL\n\nlet them brag first. Then tell them how quickly you got there without a decade of medical/law school. Not only are you making more but are making more in a shorter time span. Then say the stock goes up yearly and this is like \"entry\" level salary. And if they retort then mention the refreshes you'll be getting.",
            "A hooker on each arm and a coke spoon around your neck.",
            "What does this have to do with computer science lol",
            "You're doing it right now! You've got this!",
            "Invest some of that money in a therapist and some self help books instead.",
            "Just talk about how your (imaginary) friend having a different profession is suffering from all these lockdowns and inflation and then come to the topic that how grateful you are that people at your place didn't have to deal with that or something idk make the rest of it yourself I have a test tomorrow.",
            "Tell them you can now retire in your mid 30s.",
            "\"Is that your old TC as an intern? What's your new TC that you're proud of?\"  \n\\-Your mom, probably",
            "Don’t even mention how much you make, just say “ugh, I’m paying nearly 6 figures in taxes”",
            "Whenever you brag, always Follow it up with saying that you owe it to god and your parents 😊✌🏼",
            "[deleted]",
            "How do u have $350k TC straight out of college",
            "God damn 350 TC and you’re either fresh out or barely (1-2 years?) out of college? Fuck, I’m in investment banking at a bulge bracket and fresh out, I don’t make anywhere near 350…slave labor…I should’ve sat my ass down, majored in CS or something, and go into tech :/. I don’t really have much to contribute as to how you can flex, but as another Asian, I understand the need to humble brag for family gatherings and the like hahaha",
            "Why did I continue to believe this was a legit post all the until I got to your TC?",
            "Wait is this fr or another shitpost",
            "Wear a Rolex.",
            "Lmao, I did not see shitpost until the 30th comment.",
            "Just tell them your salary then talk about how it'll never be as high as mine.",
            "There’s no such thing",
            "Just invite them to your office for lunch and watch them be astonished.",
            "Tell them you don't work on weekends. If this not work tell them you pay x in taxes",
            "“Oh your son’s starting salary is 120? I guess everyone starts somewhere… If he needs help applying anywhere in the future, please let me know. My TC? 350, but I understand not everyone can be as lucky. :)”",
            "Why not just be like an American and absolutely flex on your family? Don’t even humble brag. Just start talking shit about how broke they are and how they should’ve tried harder in math.",
            "Same way you’re doing here very subtle",
            "Just say u make good money and never specify how much.",
            "Buy and wear a luxury watch.",
            "Hahaha",
            "Fuck humble bragging, just do regular bragging.",
            "My man just take a visit to r/learnprogramming and you will get a lot of thinking material",
            "I had no idea that complaining about taxes worked. Ever since I started I’ve been complaining about them lol",
            "Just allude to the fact that you’ll stop contributing to social security after xx months because you’ll hit the salary limits. \n\nNote that in 2021 that was about 142k. That will make their brain explode and you’ll get a kick when they suddenly need to use their phone.",
            "Buy your parents something, they’ll be bragging for you"
        ]
    },
    {
        "post_id": "xxj3xg",
        "author": "waypastyouall",
        "title": "I'm a intern and got put on pip",
        "url": "https://www.reddit.com/r/csMajors/comments/xxj3xg/im_a_intern_and_got_put_on_pip/",
        "score": 699,
        "num_comments": 96,
        "created_utc": 1665097609.0,
        "selftext": "Can you believe these bitches? I'm 4 months into my 8 month internship. My manager scheduled a 1 on 1 today along with my team lead. Recently they had performance reviews as I got a email that I should do my self-review and my manager reviewed me. I asked for 1 on 1's in my self review since he never did that with me to ask how it's going. I thought the 1 on 1 he scheduled was him listening to my written feedback. Instead during the meeting he hits me with \"you are on a performance improvement plan and every two weeks we are going to have this meeting to see how you improve\". So far I got hard bugs I couldn't solve myself. My last story was a feature that went all the way from the database, creating a table, updating the ORM model through these series of undocumented steps, making a endpoint in the backend using this obscure way for post requests, where you don't even make the post endpoint, you add a indirection function for the new model, all the way to the monster Angular frontend with a thousand components. Just finding the component I needed to change was a doozy. It took 3 weeks and I asked my team lead for help a lot, couldn't have done it without him.\n\nIn the meeting my manager says he doesn't expect less from me than anyone else. I'm an intern bro. You gave me shitty bugs and a hard story without introducing me to the big parts of the system properly so of course I'm gonna be slow. But I'm confident in my abilities and pick up things fast, in a month I'll be shredding stories. Only thing holding me back is my knowledge of the codebase because I had a non existent onboarding.\n\nAnyone else have similar stories or advice",
        "permalink": "/r/csMajors/comments/xxj3xg/im_a_intern_and_got_put_on_pip/",
        "comments": [
            "Damn 💀 these companies must really be going through it for them to pip an intern",
            "The first line had me dead☠️",
            "Imo not having at least biweekly 1on1 with manager is a sign of a bad manager",
            "Have you asked your manager directly for weekly 1x1s before you did this self-review?",
            "Bro this the first ever time I ever heard an intern getting pipped. Like it doesn’t even make sense for an intern to get pipped.",
            "8 months is a long time. Does it have a chance of going full time? Is it paid?",
            "Name and shame?",
            "The issue isn’t you. Being told he’ll treat an intern the same as a full-time employee who’s completed training, and not having weekly 1:1s…major red flag.",
            "that sucks. i just started learning the things u can install with pip and the fact that ur company is humiliating u by putting u back on it is distressing. i hope u move back up",
            "As someone who mentors students.. your manager is a moron. Under no circumstances should an intern be put on any work they deem high enough priority to warrant a PIP if progress is slow. When you hire an intern you’re expecting them to know little to nothing and to set them up to succeed. It’s their job to be mentoring and providing you the tools to succeed, not doing monthly check ins and expecting production code.",
            "Reminds me of my co-op earlier this year. Got terminated because I couldn't keep up and my manager felt he couldn't teach me anything since I took too long on tasks. Nevermind that even in the interview I mentioned I had never worked with such languages, and was a slower person to retain information. \n\nDidn't help that he was the only Dev/IT person for the company so he was my only resource aside from google. \n\nYou got this. You'll bounce back. In the long run it won't matter.",
            "Most internships are 3 months though, so hard to pip. Are you doing a co-op instead? 6-12 months?",
            "You are the sacrificial lamb.  He has a quota of folks to get rid of without doing a layoff.  Sorry this happened to you.\n\n&#x200B;\n\nbtw, I am available for mentoring for cs career advice, etc.",
            "What's pip",
            "cry is free",
            "I guess I kinda do have a similar story. My first ever review at a software engineering internship was my manager sitting me down and telling me that I didn’t know stuff I should know and that I asked too many questions.  It sucked.  I never understood how you are expected to know everything as a software engineer. One of the many reasons I quit doing it (after going on to have a successful 15 year career as a software engineer)",
            "If I ever PIPed an intern I would just fire myself for being an incompetent manager. WTF.",
            "I’m a manager in Customer support but in the educational technology industry. \n\nYour managers are shit. If your not having check ins on whatever cadence you don’t have a forum to ask for assistance how do they expect you to succeed? Sprint  goals aside your boss just has a poor use of their time or they have the startup syndrome where everything is high priority and nothing gets done because of that. That of which includes managing your team lol 😆 \n\nI also wanted to mention your first line gave me a good chuckle.",
            "Looks like they are setting a precedent in your record which could mean one of two things:\n\n1. You are doing actually well but they dont want to pay you your market's worth. So putting you on PIP will be used as an argument when lowballing you into a low salary offer. \n2. You are doing well enough but they want to squeeze maximum out of you and then get another intern and pay him intern salary instead of hiring you fulltime and paying you a decent salary.\n\nEitherway the place seems like a shithole without processes, decent documentation and without guidance. Save your energy/health and start applying, you have nothing to prove for them.",
            "Name and shame bro. If you can do it without getting doxxed",
            "Can you contact your school internship department and transfer to another company?",
            "To me it sounds like the company is in rough shape financially and looking to cut costs. I wouldn't take it personally",
            "With the way the industry has been lately, I wouldn’t be surprised if they ran out of budget and were trying to find a smooth way to fire you without legal consequences or additional costs.\n\nThere’s a high possibility you’re not going to get a return offer if they’re pip-ing you as an intern. Start looking for another internship and leave or if you need the money and experience, stay but make sure you don’t plan/expect to come back because even if you do get an offer and come back, they will probably have higher expectations and micromanage you for any chances of another pip.",
            "I got a job working for the lone SWE at the company. I was still in school, and they were paying me $20/hr for 20-30 hours a week. SWE leaves the company, and they basically don't hire me a new boss. I'm the resident computer guy now, and recently some higher ups have begun saying shit like \"don't blame problems on people who aren't here anymore\", with the problems being about 10 legacy embedded systems. I'm effectively a new grad at this place, but since nobody knows any better, they think I'm qualified to manage all this and take responsibility for it. It's a joke.",
            "The hard task you described seems like a pretty standard work item. No shade, just an observation from what I've seen in my experience.",
            "Amazon?",
            "Amazon?",
            "skill issue tbh",
            ">Can you believe these bitches? \n\nBased on your attitude, I can't believe the bitches haven't fired you already.",
            "Are you white/Asian?",
            "Are you sure you should be a software engineer lol that sounds like an easy feature lol. That’s pretty much what would be expected off of you during a FTE",
            "Oh my gosh can you complain anymore? I see exactly why you are on pip when you bitch more than you work.",
            "The title made me think you were using unix",
            "before applying for a company, is it possible to figure out if they have a PIP system? I want to be able to avoid such companies like the plague. Is there like a tech company gossip site, something like glassdoor but more informal?",
            "Try to make friends with a few of the other co-workers with the goal that if the manager isn't a positive recommendation, you can ask them to give you a positive recommendation instead.",
            "This sounds like a horrible team and environment.\n\nSorry OP. Maybe time to start looking for other opportunities?",
            "100% your manager is incompetent and got pip-ed before so now he is trying it out on you or he doesn’t know what pip is lol",
            "Your manager is an idiot. Thisnisnt normal. What kindof garbage company puts an intern on PIP.\n\nDon't feel bad OP. You seem to already know that your manager is in the wrong.\n\nIt's a shame this company doesn't understand what the purpose of an internship is and \"expects the same from you as everyone else\"\n\nOn the bright side you know never to interview with this company again.",
            "Damn the first line cracks me up",
            "“Can you believe these bitches” lmaoooooo im dead"
        ]
    },
    {
        "post_id": "15almsp",
        "author": "Blezerker",
        "title": "STOP COMPLAINING",
        "url": "https://www.reddit.com/r/csMajors/comments/15almsp/stop_complaining/",
        "score": 705,
        "num_comments": 168,
        "created_utc": 1690414757.0,
        "selftext": "* YES CS SUCKS SOMETIMES.\n* YES YOU'LL RUN INTO ASSHOLE BOSSES AND COWORKERS AND THAT SUCKS DEALING WITH THEM.\n* YES THE INTERVIEW PROCESS CAN FEEL POINTLESS AND LONG AND DRAWN OUT FOR NO REASON.\n* YES THE MARKET IS A DUMPSTER FIRE RIGHT NOW, AND IT REQUIRES A COMBINATION OF LUCK, GRIT, TALENT, AND CONNECTIONS.\n* YES LEETCODING SUCKS.\n* YES TECH BROS HAVE INFESTED THE SPHERE AND CAN BE OBNOXIOUS TO DEAL WITH.\n* YES THE CHANCES OF YOU LANDING 100K JOB OUT OF COLLEGE IS NOT AS LIKELY AS IT USED TO BE.\n* YES BEING A COG IN THE CORPORATE MACHINE IS SOUL DRAINING AND YOU SHOULD SEEK TO LEAVE AS SOON AS YOU CAN\n* YES THIS SUB ONLY TALKS ABOUT JOBS/INTERNSHIPS AND NOT ACTUAL COMPUTER SCIENCE (VISIT /r/computerscience FOR ACTUAL COMPUTER SCIENCE DISCUSSION)\n* YES SOMETIMES NON-TECH RECRUITERS CAN BE SOME OF THE MOST BRAIN DEAD PEOPLE YOU WILL EVER HAVE THE DISPLEASURE OF TALKING TO\n* YES IT SUCKS RECEIVING AUTOMATED REJECTION LETTERS WITH NO FEEDBACK.\n* YES IT SUCKS BEING GHOSTED\n* YES FAANG/MAANGA TAKES AN ETERNITY TO REVIEW YOUR APPLICATIONS\n* YES IT IS INCREDIBLY SHITTY TO HAVE OFFERS RESCINDED AT THE LAST SECOND\n\nI GET IT. CS IS DIFFICULT RIGHT NOW. MAYBE YOU GUYS WANT TO VENT ON HERE AND BE HEARD (I KNOW THAT'S WHAT I'M DOING RIGHT NOW!) BUT FOR FUCKS SAKE. PLEASE LOOK AT THINGS IN PERSPECTIVE.\n\nRETAIL ABSOLUTELY FUCKING BLOWS. YOU LIKE BEING MICROMANAGED CONSTANTLY WITH SHIT PAY AND SHITTY/NON-EXISTENT BENEFITS? OH AND DONT FORGET BEING STUCK AT THE STORE PAST 10/11PM, SOMETIMES EVEN MIDNIGHT FOR THE MAJORITY OF YOUR SHIFTS. PLUS YOU GET TO DEAL WITH CUSTOMERS SO ABSOLUTELY BRAINDEAD YOU'LL WONDER IF THEIR PARENTS WERE RELATED. ALL WHILE MANAGEMENT DESPERATELY ATTEMPTS TO MAKE YOU TO DRINK THE KOOL-AID WITH REMARKS LIKE:  \"YOU COULD START A CAREER HERE! DON'T YOU WANT TO MOVE UP?\"\n\nI DONT KNOW ABOUT YOU, BUT I LOVE ANSWERING THE SAME FIVE QUESTIONS MULTIPLE TIMES A DAY 9 HOURS A DAY! (YES, I AM BEING SARCASTIC!)\n\nRESTAURANTS/HOSPITALITY IS MORE OF THE SAME, EXCEPT ALL YOUR COWORKERS AND MANAGERS ARE DOING LINES OF COKE IN THE BATHROOM OR ARE ADDICTED TO ADDERALL. AND YOUR PAY IS EVEN MORE VARIED AND UNRELIABLE. DON'T FORGET NON-EXISTENT LUNCH BREAKS AND EVEN WORSE HOURS!\n\nSUPERMARKETS ARE THE SAME AS RETAIL, EXCEPT THE PAY IS EVEN WORSE, THE HOURS ARE EVEN LONGER, AND YOU GET THE ADDED BENEFIT OF POSSIBLY INJURING YOURSELF WHEN LOADING BOXES OFF THE DELIVERY TRUCK. YOU'D BE SURPRISED HOW LITTLE WORKER'S COMP COVERS. FUN!\n\nAND DONT EVEN GET ME STARTED ON WAREHOUSE JOBS.\n\nMY POINT IS, DESPITE ALL THE HARDSHIP, TECH IS STILL A LUXURY COMPARED TO THESE SHITHOLES. MAKE THE MOST OF YOUR OPPORTUNITY TO STUDY CS IN THE FIRST PLACE. REALIZE AND APPRECIATE THE FACT THAT MANY DO NOT HAVE THE TIME, MONEY, WILL, OR PATIENCE TO PERSEVERE AS LONG AS YOU HAVE SO FAR. OR DONT.  IF YOU TRULY HATE EVERYTHING CS RELATED, THIS MESSAGE MIGHT NOT RESONATE WITH YOU. TRY TO LOVE THE CRAFT. EARNESTLY TRY.\n\nI RECENTLY BEGAN READING AN OPERATING SYSTEMS TEXTBOOK TO PREPARE FOR MY OS CLASS IN THE FALL, AND ONE OF THE QUOTES THE AUTHOR INCLUDED RESONATED WITH ME:\n\n\"EDUCATION IS NOT THE FILLING OF A PAIL, BUT THE LIGHTING OF A FIRE\"\n\nLET YOUR EDUCATION IN CS LIGHT A FIRE INSIDE YOU. LET YOURSELF BE IN AWE AT WHAT OUR MACHINES ARE CAPABLE OF TODAY, AND THE CRAFTY SOLUTIONS PEOPLE LIGHT YEARS SMARTER THAN YOU OR I CAME UP WITH AS AN ANSWER TO THE PROBLEMS THEY FACED. I PROMISE IT WILL MAKE THINGS MUCH MORE BEARABLE.\n\nAND TAKE CARE OF YOUR MENTAL. GO OUTSIDE. MAYBE CLEAN YOUR ROOM. IVE GOT A PILE OF LAUNDRY I'M LOOKING AT THAT'S BEGGING TO BE WASHED. AFTER I POST THIS, IM GONNA GO DO THAT. THANK GOD FOR TIDE LAUNDRY DETERGENT CAUSE YA BOY BE SWEATIN ALOT.\n\nTHANK YOU FOR READING, AND GOOD LUCK ON YOUR EDUCATION/INTERNSHIP/NEW GRAD JOURNEY. YOU CAN DO IT. OR NOT. YOU ARE IN CONTROL OF YOUR FUTURE.\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/15almsp/stop_complaining/",
        "comments": [
            "This is the weirdest SQL code I’ve ever seen",
            "WHY ARE WE SCREAMING, WTF IS GOING ON",
            " \n\n* YES YOU WILL BE MOLESTED IN THE BATHROOM AT YOUR FIRST JOB",
            "But why cs job no pay 500k per year with a 2 hour work week? - every person on this subreddit",
            "Thought this post was gonna be annoying but nah you right",
            "It's under the Tab key and above the Left Shift key.",
            "CS is the epitome of good times make weak men. Ain’t no way there’s mfs complaining about how they actually have to work to get 6 figures or more. People used to work in coal mines for fucks sake.\n\nIf you truly enjoy CS and are not in it completely for the money then you’ll be fine. If you chose CS because you thought you’d make 6 figures “easily” and “break into tech” you fucked up buddy.",
            "wait there won’t be any hookers sucking my balls at google???????? What happened to America bros",
            "Holy W best thing I read this week",
            "Sorry. Can't help but feel like this is directed at my \"I'm done with the elitism\" post. \n\nYeah. It can be awful here. But it's a heck of a lot better than elsewhere.\n\nEdit: link: https://www.reddit.com/r/csMajors/comments/159x0ez/im_done_with_the_elitism/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2",
            "Nope. I expect to land a 200k google gig with 30 min of leetcoding a day and a basic html website. If I don’t get it, then I will start complaining",
            "Fuck yes I love this energy. I may not be the best coder, but I'm a damn good bullshitter lol. It beats retail/customer service work anyday!",
            "Damn, OP is cooking. \n\nI’m also taking OS this fall and spent the first half of summer reading my textbook. I have been taking a couple weeks off to let the brain rest and have recently looking into Python practice for leet codes.",
            "But...but....le karma 🥺🥺🥺🥺🥺🥺🥺",
            "Dude you rock. I love this post. Saving it !!!",
            "Alright I usually don't like these types of posts but you hit the nail on the head. It's all about perspective",
            "Not reading all that but I agree",
            "Hilarious to see people complaining that they want to leave cs as if they'll find some job with no shitty boss, bad pay, or whatever. Are they under the impression that everyone else in the world loves their jobs?",
            "Is your caps lock key broken?",
            "People who complain never did anything but college and a part time job",
            "Motivation fr thanks dad",
            "“Stop complaining about retail and warehouse jobs, don’t you know those jobs are luxuries compared to being a cobalt miner in the Congo?”",
            "I used to work in an Amazon warehouse during my CS Uni in UK and now that i look back I hope I would never ever go back to a different job than programming...i went from line worker to IT boy...the amount of stress, anxiety and health problems from lifting 15-20 kg boxes and dragging hundreds of kgs of pallets plus the amount of dust I inhaled will never be compensated...I don't even want to start about my IT manager's speech about \"working hard rewards you with IT Engineering title\"....even if IT world is hard, complicated, complex and some times superficial, at least i grow and i'm doing it from the comfort of my home and i meet people that actually think, know stuff and i have something to lean from. Interacting with \"wifi no work pliz help\", \"laptop isolated, why no internet\", \"speaker doesn't speak\", \"printer printing lines, no text\" or \"can you give me good equipment without a ticket?\" or answer the same questions on a daily basis made my brain feel like goo...now i'm relaxed doing backend in typescript and java...so the push was rewarded..",
            "I think it’s just how our society is unfortunately. I genuinely believe no matter what one’s  status ie. job, relationship, or house , people will never stop complaining. It’s this entitlement that a lot of people have. I did x so I deserve y. Heck I do it too sometimes. A lot of factors need to happen for you to get something you want, and a lot of times it’s not in your control. I think that No matter where you are in life, you’ll probably find something to complain about. Obviously social media is making this exponentially worse. Taking time off your phone and the everyday mundane tasks and thinking about how your life is going. I’m certain that one can be grateful about a whole lot that they think.",
            "I just don't know why I read this whole post with DAVID GOGGINS voice in my mind !!! \n\nHe mentions WHEN THAT MIND GETS RELAXED MAN YOU'RE F****D, IT'S SUPPOSED TO BE HARD, IT'S SUPPOSED TO BE GRITTY, IT'S SUPPOSED TO BE HORRIBLE. IT'S SUPPOSED TO BE REALLY UGLY , BAD, BRUISE, BEATEN.. THE MIND HAS TO TOUCH HARDSHIP, THAT HOW YOU CALLOUS YOU'RE MIND",
            "Preach.",
            "**o my god thanks a lot for this post  !**\n\n*(I am actually in dilemma to choosing a major between mechanical /mechatronics engeerining or computer sciences,, I love coding tho,, yeah math too - so let's go for cs )*\n\nthis is **W** post thanks again!",
            "TC OR GTFO",
            "What was the OS textbook?",
            "I ain’t read all of that. I’m happy for you tho or sad that happened",
            "Stop yelling at me 😟",
            "stunned. incredible content",
            "Loved this post, especially in all uppercase.",
            "People should strive to love CS. But most of what you said is a relative privation fallacy. Let people complain just because other people in other industries are worse off doesn’t mean an effort to improve our conditions shouldn’t be made, nor should the problem be ignored. \n\nCS/IT probably shouldn’t fluctuate as much as it does but the attitude of “it could be worst, I could be in retail” is why CS engineers have little to no protections.",
            ">stop complaining \n\n*proceeds to complain*",
            "Why are we yelling",
            "2 ez",
            "Is it really that bad? I’m CS graduated 4 years ago still not in my field. I’m kinda scared it will be corporate greed. Not to mention the interviews asking specific questions.",
            "Step away from the PC and go touch some grass, OP.",
            "Put down the Adderall bottle buddy\n\nAnd no I did not read all of that",
            "YES, Noone will read your sh!TPost. we all are busy and only come here for some light hearted  banter. No , we wont listen to shit you say.",
            "I ain’t reading all that",
            "ChatGPT was made for posts like this 😂",
            "[deleted]",
            "Rant to the AI overlord after it takes away your prestige \"JOB\" wagecuck",
            "AAAAHHHHH",
            "Stop yelling at me!",
            "Stop yelling at me dad :(",
            "i needed this post. thank u",
            "I hope u find the therapy u desire",
            "I saw somebody here the other day complain about being offered a SWE job at Boeing (Fortune 100) and asking if it will hurt their future career if they take it.\n\nThat should tell you everything you need to know about this sub.\n\nA lot of people here watched too many TikTok videos and now think everyone is paid 400k for three hours of remote work per week and if you went to a half decent school, FAANG is supposed to be groveling for you to come LeetCode for them.",
            "THANK YOU DAD SORRY",
            "STOP COMPLAINING ABOUT COMPLAINING! No one has time to read this long post in all caps.",
            "Can someone use gpt and summarize this.. \nYa I'm lazy af",
            "Lynbrook High School",
            "Your cap lock was broken or something? Lol",
            "Which OS textbook it is that you read? I need one as well.",
            "ahh yes complaining about people complaining, my favorite genre",
            "Most sane cs major",
            "LIGHT A FIRE IN YOUR ASS (but don’t forget to like value your spare time and go on walks and stuff, man)",
            "This is the step immediately preceding the capture of the front and back ends of your human centipede",
            "Good thing you haven't discovered markdown headers yet",
            "Agree with most of this, most entry level minimum wage jobs are shit. All of us just want the pay off for the large amount of work we’ve put in.",
            "I feel the “Cog in a corporate machine part” shit sucks. Anyway back to leetcode",
            "No. It's OK to complain. I've been an engineer for 25 years and I get that for newcomers to this industry it can fucking suck. It's changed from being able to program computers to being able to play the stupid algo test game.\n\nI think juniors have every right to be pissed off, this is a different industry to the one I joined 25 years ago. Back then all you had to do was program a computer, these days there is a ton more bullshit, a ton more needless complexity, and a load more pretenders acting like they've got a fucking clue.\n\nIt's a harder industry now to crack into. I'm glad I'm not a junior today, it looks fucking soul destroying.",
            "$AdminControl invoke $jvm generateHeapDum",
            "Don’t worry guys it’s not that bad, it’s only going to drain your soul",
            "The most down to earth realistic post I’ve ever seen on this subreddit. Power to you!!",
            "Love the post god GOD the untasteful capslock makes it so difficult to read.",
            "Finally someone on here saying what we’re all thinking. Just complainers here. Then leave lol. “Omg my stock is so high idk with all these 100 dollar bills I’m going to do *cries with 100 dollar bills as tears and tissue” poor me blah blah blah",
            "Is this FORTRAN?",
            "Best post I’ve seen since joining this sub",
            "Fr thank God for tide laundry detergent",
            "People think that there was a time when it was easy for literally anyone with a CS degree to guarantee a six figure job right out of college.\n\nThis was never the case. Only a few select places in the US would offer this, and only to the few who qualify. \n\nMost everyone else worked at a much more modestly paying, more traditional companies.",
            "Stop complaining",
            "Thank you! Some gratitude and contentment goes a long way in being satisfied or even being fulfilled in life. Stressing all this crap to not even know if you’re gonna be on earth tomorrow…",
            "Stop complaining",
            "IS YOUR CAPSLOCK BROKEN",
            "Bro can you refactor your post next time before pushing to prod?",
            "YES THIS POST SUCKS TO READ WITH ALL UPPERCASE",
            "Happy for you or sorry that happened",
            "I ain’t reading allat",
            "Whaaat?",
            "Nah. It's better to exchange horror stories, especially in a place like this full of students with no work experience. It's how you learn to identify toxic work places and advocate for what you want. Your line of thinking is exactly why tech employers historically favored fresh grads: inexperienced kids who are too scared to advocate for themselves or talk to each other about negatives in the workplace.",
            "god i love this sub",
            "\"Clean your room\" smth smth Peterson",
            "this makes me wanna be friends with you 😭",
            "Who cares if people complain. Reddit is for complaining.",
            "needed this",
            "i think i should read this every week until i get a job"
        ]
    },
    {
        "post_id": "prh3pu",
        "author": "None",
        "title": "School Name",
        "url": "https://www.reddit.com/r/csMajors/comments/prh3pu/school_name/",
        "score": 701,
        "num_comments": 58,
        "created_utc": 1632087470.0,
        "selftext": "Hi, everyone. I have been feeling very down about my no-name state school. I’ve only gotten a few offers. The offers are from \n\nAmazon, Microsoft, Google, Stripe, Uber, Salesforce, and Jane Street \n\nI’m feeling really insecure all around. I wish I had gone to a better school, but I can’t transfer because my gpa is a 3.69. I really wish I could transfer to a school like Harvard, Cornell, Arizona State, or Berkeley. \n\nI’m just stuck right now. To all the high schoolers on this sub, please please please please go to the best school possible, otherwise you’ll be like me, and have offers from lower-tier companies like Google, Stripe and Jane Street.",
        "permalink": "/r/csMajors/comments/prh3pu/school_name/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "The arizona state took me out, saw that comment on the last thread",
            "I'm an ASU student and the **Arizona State** comment still kills me lmao",
            "Does this sub have a \"Shitpost\" flair?",
            "Is Arizona state that gooood?",
            "People who downvoted didn't read whole post",
            "How much effort have you put into studying and leetcode OP? I want all these offers with my no name school but procrastination and lack of motivation is killing me. Plus, I already have some golden handcuffs so it’s not like I need to switch jobs but I want to.",
            "[deleted]",
            "Why you gotta throw ASU in there like that? Lol",
            "The only thing that a high ranking CS school could offer is referrals and forcing companies to defer offer deadlines. Neither of those being make or break things more just convenience",
            "This is the funniest shit ever.. I choked on my sod while reading this 😂😂😂",
            "Any guy with testicles can get into Arizona State",
            "LMAO I'M DYING",
            "Come to PURDUE. You know you want to be a boiler maker with me and have all your friends mock you for being a boiler maker.",
            "But what if Facebook is my dream company?",
            "I hope this is a joke💀😭",
            "💩🤡",
            "ah yes low tier - google,amazon,microsoft\n\n&#x200B;\n\nalso is ASU well recognized for CS ?",
            "[deleted]",
            "First was Arizona state, second was still getting offers at only the biggest tech companies in the world lol"
        ]
    }
]