[
    {
        "post_id": "18znz2q",
        "author": "kingdemonfalconmusic",
        "title": "Obama responded to me before any companies did",
        "url": "https://i.redd.it/zg93ikey4qac1.jpeg",
        "score": 2498,
        "num_comments": 58,
        "created_utc": 1704505157.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18znz2q/obama_responded_to_me_before_any_companies_did/",
        "comments": [
            "Nice. He just texted me, we’re playing basketball next weekend. Very cool guy",
            "Barack and I go way back. He was my girlfriend’s boyfriend",
            "POTUS is $400k base just saying",
            "You know what? I am beginning to think this isn't the actual Obama..",
            "Wow that’s dope!",
            "Im going to ask obama to send a letter to netflix to give me a job",
            "Not surprising. In this market, even Kim Jon Un is more likely to respond than 95% of companies",
            "Brb gonna email barack obama if I can use him as a reference",
            "I look forward to your Sankey chart for presidential job applications",
            "OMG REAL BARACK OBAMA",
            "Obviously fake. He signed off with Barack. Everybody knows his first name is Obama. 🙄",
            "😂😂😂😂",
            "barack( he/him) that gives it all man",
            "Cool! He replied to me and now we’re going on a cute date next weekend 😍",
            "“Your total comp was 400k? How much leetcode did you grind for your offer?”",
            "Did he send an OA (Obama Assessment)?",
            "[deleted]",
            "………………….\n…………………..\n… Thanks Obama",
            "😭",
            "Obama made me do a coding challenge when I applied for that job\n\nThe time complexity was O(BAMA)"
        ]
    },
    {
        "post_id": "1ccaeqv",
        "author": "Haunting_Arm5149",
        "title": "Another one .. man 4 years of school for $15 bucks ",
        "url": "https://i.redd.it/e65mx8d5yhwc1.jpeg",
        "score": 2465,
        "num_comments": 266,
        "created_utc": 1713994670.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ccaeqv/another_one_man_4_years_of_school_for_15_bucks/",
        "comments": [
            "Not only that, for a damn full stack, fucking position invented to avoid hiring a front and a backend to save money. Cheapskates",
            "Over 100 applicants 😑😑",
            "Use and dip honestly ",
            "The company looks like the shit Jordan Belfort was shelling out in WoWS\n\n[Address](https://www.google.com/search?client=firefox-b-1-d&sca_esv=09085fb6c895584d&sca_upv=1&sxsrf=ACQVn0-IUwfCkGKutvq932JXArw5uJ4-sg:1714001609770&q=palisades+group+address&ludocid=17047335227075163828&sa=X&ved=2ahUKEwiczuDIgdyFAxUOjIkEHZYgDoQQ6BN6BAhbEAI): 6001 Bold Ruler Way Suite 110, Austin, TX 78746",
            "I’m surprised they didn’t include “TS w/poly security clearance required” on top",
            "thats how i felt once i graduated with a BA in political science. i thought that by doing a 2nd bachelors in CS things would be different…..maybe im not meant to make a living",
            "I make more at target",
            "And it already has 100 applicants… \n\nI fucking hate this field\n\nI know damn well whoever they hire will leave immediately when they find a decent paying job and someone else will fill this role, and the new hiree will have no prior knowledge, so by the time they get appropriate access to everything, projects will get delayed, and they will use the experience to find a decent paying job and the cycle will continue \n\nwhile someone else at Target makes the same amount as that while smoking weed in their car during lunch break. But hey if they hate their job, someone else in another country would happy to do it while the executives are sleeping.\n\nI fucking hate this field",
            "I'd just apply for the work experience to be honest",
            "yo, being a dev is hard  \nand the salary .... i have nothing to say",
            "and IN AUSTIN!!!",
            "Not directed at OP, but this is great lesson on why you should never go into anything for the money.",
            "Damn I make 18 as tech support. This is ridiculous",
            "You can get paid more per hour as a cashier at the local Safeway where I live...",
            "Yeah I just saw that. Applied to it too lol.",
            "https://preview.redd.it/0u56fecfgowc1.jpeg?width=1179&format=pjpg&auto=webp&s=6f8406607102f0700cee2bb78baea7866a92d6da\n\nLooks like they removed the pay",
            "Doubt this comment gets seen, but will post anyways.... \n\nI know it's tough out there and I'm sure there are companies paying that low for junior dev roles, but I don't think this is the case for this role.\n\nIf you find the job posting using the LinkedIn app, it says the $15.7/hr salary was found from the job description. That means it wasn't provided by the employer.\n\nBut if you look at the job description, you'll see no mention of salary anywhere. What you will see is a phrase saying this company manages assets that \"amount to over $15.7 billion\"...\n\nThat's probably where LinkedIn got the $15.7/hour number from. Their parsing is probably pretty decent, but obviously not perfect",
            "Clearly made with the intention of being outsourced since “no qualified applicants” were found",
            "Full STUCK maybe",
            "i get paid more as a part-time cashier at an ice cream  parlor 😭😭",
            "Guarantee all the applicants are foreign resume spammers who can’t code for shit",
            "They are really joking",
            "Not gonna lie, if this was remote job, I would have take it. When I started for Accenture, I was paid $3.05",
            "This is the epitome of pump and dump, work there for a couple months to get experience, immediately leave",
            "I make more teaching swim lessons",
            "I earn a bit more in eastern europe for a similar position... Do what you want with it.",
            "Try McDonald’s they also hiring software engineers. I’m being for real. No joke. Like 100000% serious",
            "Crazy I started at ~30$/hr after uni. Changed job after 2y, started at 36/37$/hr in the new job and 4,5y in I’m around 63-65$/hr - Pharma Industry",
            "\"How much does McDonald's in Canada pay? Average McDonald's hourly pay ranges from approximately **$14.50 per hour** \"\n\nNow that's Canadian dollars, but still.",
            "Can’t be real!!!! Jeez that’s crazy",
            "Honestly.......\n\n\nThis makes me want to setup a system that allows people like OP to hunt asinine job postings like this and submit their phone number into the system, triggering never ending robo calls to the employer telling them to up their pay. \n\n\nFuck that all the way to hell man.",
            "Looks scam",
            "Not even full remote, but then again that might mean no outsourcing at least",
            "I almost laughed seeing the pay. Ridiculous.",
            "No way",
            "This is strange to me because in the swedish speaking part of Reddit I read discussions about salaray and those working in IT always has amazingly high salaries.",
            "Texas minimum wage is 7.50 soo not bad if you plan to live in Texas but if not then this really limits you",
            "100+ applyin to it tho ffs",
            "Are we ignoring more than 100 applications",
            "Don’t want to be that guy, but I’ll be that guy. If you have no other options with the tough tech market, take this job. Be a sponge and learn as much as you can, technically as a junior you won’t be expected to do all that much, most of your time will be spent learning and pushing some PRs here and there to reinforce your learning. So I would use a job like this as an opportunity to learn while getting paid some pocket change as you constantly look for another job that actually pays something over this crap. But again, you should take something like this if you have no other options just so you have the experience and have something on your resume while continuing on your job search.",
            "I get paid more starting at food service lol",
            "What a fucking joke",
            "You don’t want to work for a company like that. You’ll probably hate your life.",
            "Can someone tell me what apps or websites do you guys usually use to apply for jobs and internships",
            "California min wage for fast food is now $20 an hour 🤣\nGetting paid the same to flip burgers.",
            "Hey, they offer informal and relaxed dress code",
            "When you get hundred applicants, it sounds like they didn't need to offer more",
            "You know whats even more slimy - they seemed to have deleted the pay instead of being transparent",
            "Try 5€ in eu with an msc on top",
            "My on campus panda express cashier pays 19.5 an hour… just saying",
            "Most average atx market job post",
            "I recently interviewed for a fill stack developer job and they said the pay was 45k……",
            "$15.70/hour in Austin, wow, I’m not even American and I know the « engineer » is going to to est pastas and rice for months there.",
            "That money can feed an African family for a month",
            "4 years of school + maybe a bootcamp and then building a portfolio without working yet.",
            "Why's this market so shit? Even if you take this for experience your setting a bad precedent for yourself. Idk man I feel like what was the purpose of school if im gonna settle for a job making less than what I made without a degree.",
            "I don’t want to think how much they pay for front end",
            "brutal…",
            "I would do it but they’re going to get $15.70/hr effort",
            "Don't even apply they have to learn somehow",
            "And over 100 apps??",
            "Meat production plants pay 20+ now. \n\nLook it's not where I wanted to be at this stage in my life but I'm getting paid $23.63 an hour making girl scout cookies. The only thing I don't like is the overtime.\n\nI'm currently in the process of creating my own startup.",
            "Woah, that’s so messed up. Most retail jobs pay better…",
            "If people stopped taking this obnoxious pay then they would raise their offer. It's basic bartering skills. Stop settling.",
            "Wtf?!",
            "I’d rather work at in n out that pays $20+ and keep applying tbh.",
            "You got to start somewhere",
            "Target is $15.35/hr",
            "I mean it’s kinda befitting that they expect this developer to suck at everything.",
            "I get paid 11.36/h lol",
            "15$ a hour is just fucking ridiculous.",
            "lol I pay my level one help desk more than that.",
            "Man yesterday I interviewed for a company paying 120 dollars a month they just ripping at this point. Not even sustainable at that price for a month",
            "It is fake. In NC, the baes salary in Bojangles is $15/hr.",
            "You should go work there and leak all of their data because this is just disrespectful",
            "What is the American minimum wage… that’s far below our minimum wage per hour",
            "I was making 25 an hour back in 2009!? Yikes.",
            "Should report this god damn shitty job to correct the market,",
            "The BALLS on some companies man…..",
            "I looked at the job, and it seems like an error on LinkedIn's part. I don't see the salary listed on there, and the only mention of $15.70 is that the company has made $15.7 billion. Might still be a bad salary, but I'm not sure what they're actually paying 🤔",
            "If you have the skillset required for this job you'd have the ability to and would literally make more per hour making and selling it yourself, lmao",
            "This is actually a good foot in the door for many new CS grads or people pivoting to CS without a degree in it. It’ll likely be a pressure free role because they’re paying you pennies but the person is also motivated to do their best to move up in their career 1-2 years after being in this role",
            "I make more than that at Walmart lol plus I’m about to finish my internship and graduate 😬 now this market worries me",
            "i got paid more working fast food when i was in highschool 😬",
            "Hey if it's your passion you'll do it for free",
            "Meanwhile Indians working happily for 10$ an hour even after PHDs.",
            "I think we should understand that nobody owes us a job just because we went to school for 4 years. The very fact that a cs degree has been made synonymous with a good pay is ridiculous. Lotta people entering the scene just because of this, which in turn leads to saturation and finally leads to companies treating us like stale meat in the market. I know this is gonna downvoted but it is what it is.",
            "I make $20hr as a pharmacy tech. No school. But I would jump at this opportunity if they gave it to me.",
            "Damn. I hold an associate's, work in a completely unrelated field, and make a lot more than that.",
            "Digital hookers.  Found on every corner.  Barely capable of getting the job done, you're most likely going to have to chip in some effort too.  Developers who work hourly deserve this rate.  Employers deserve their non-viable ROI but at the end of the day, another person gains employment.  Boo hoo.",
            "Just don’t apply there? Sheesh.",
            "In todays world, there are more software engineer than a cook",
            "Basically every result on LinkedIn when you search “full stack developer entry level” is better than this honestly, just get on LinkedIn and spam apply to a few hundred of those and you’ll for sure find something better. \n\nDon’t restrict by location and you’ll find tons of options, if you’re willing to move. Otherwise there are lots of remote options too",
            "Yes these types of jobs with crap pay have existed for decades... so?",
            "womp womp"
        ]
    },
    {
        "post_id": "m6003f",
        "author": "obijuanchernobyl910",
        "title": "I did it",
        "url": "https://www.reddit.com/r/csMajors/comments/m6003f/i_did_it/",
        "score": 2456,
        "num_comments": 157,
        "created_utc": 1615865454.0,
        "selftext": "Stats: Single mother of a two year old and a 8 month old. Working full time. School full time at state university. \n\nSchedule: \n5am-7am get kids ready for the day\n7am-8am kids go to grandma\n8am-4pm work M-Friday\n4pm-5pm pick kids up\n5pm-7pm make and eat dinner\n7pm-8pm get kids ready for bed\n8pm-11pm Leetcode and homework\n11-midnight clean up and prepare for next day\n\nWeekends: \n8am-11am entertain kids\n11am-4pm attend 3 zoom lectures while taking care of kids and doing laundry\n\nInternship: FINALLY RECEIVED for Data Science at Dell Tech! \n\nI know it’s not FAANG and I know it’s not the best well known company but I just want to let you know that if I can do it so can you! I’m telling you it’s possible and I’m living proof of that.\n\nEDIT: Thank everyone so much. I never expected to get so much recognition let alone praise. I wish I had time to reply to everyone 😭. Btw, I am burnt out, have been but if you’re a parent you would understand going to the ends of the earth for your kids and I finish school next year so I’m marking the calendar for sure. Took a lot of talking to myself for motivation and prayer 😂 also, I’m glad I was able to inspire some people because honestly never thought I’d do that in my small insignificant life so thank you 🙏🏼 okay rant over. Obijuan out 🤘",
        "permalink": "/r/csMajors/comments/m6003f/i_did_it/",
        "comments": [
            "Today I learned im actually just lazy.",
            "congrats ! I honestly do not know anyone IRL that works this hard. Your schedule makes my full time job + 2 courses sound like a breeze",
            "..and here I'm complaining about having to wake up at 8am or juggle multiple things.\n\nYour journey is quite inspiring. Thanks for sharing!!!",
            "Your work ethic is admirable. I will continue working to be as disciplined as you! Congratulations.",
            "wtf you're nuts nice work!!!!",
            "Wow!! Congratulations, that's amazing.  Talk about grit.  Dell is still a reputable company to have on your resume, and a wonderful one to start with at that! \n\nBest of luck with everything, and I hope everything continues to go in your favor as you work for your family's future.",
            "I was making excuses for why I’m not preparing well for a Big N interview next week. After reading this post, I have realized it’s a convenient way for me to be lazy. Thanks for inspiring me! It’s 12:02 AM but I’m going to read some DDIA to help my interview. Your story is way more impressive than any of the FAANG or Quant kids stories that I know of. Congrats! 🎊",
            "[deleted]",
            "Don't usually comment on these kinds of threads but ngl that's insane to even have such a schedule, much less to stick to it. I can barely sleep at the right times.",
            "You are an inspiration OP. Congratulations!",
            "Awesome job!  Plus an extra shout out to grand-momma for helping you make this work.\n\nI am almost 50 with two autistic kids (teen and pre-teen). Just took a promotion at work before starting back to school for CS. Husband and I both have crazy work schedules. I decided to cut back to part time after I crashed and burned the first term. Was just too much on my plate at once without the extra support.\n\nHad a nice chat with my husband about what we need to do for me to get where I want to be. As much as I hate going part time and stretching out this journey, I need to. My goal is to get us to the point where he no longer has to work 10 hr days at his factory job. He has already had carpal tunnel and cubital tunnel surgeries on both arms, surgery to repair a torn bicep tendon, and back surgery after 13 yrs at this job.  \n\nAs much as I want to plow through all of this and give my husband a chance to relax, we just don't have the support to do this at a faster pace. \n\nJust wanted to say great job and we are proud of you! But don't forget to give grand-momma and extra squeeze or a glass of wine as well!",
            "Congrats, Dell is still a very good company",
            "Inspiration!!",
            "Congrats girl!! Way to go",
            "This is so amazing to hear and so inspiring! Really happy for you and congratulations :)",
            "This is very inspiring! You make me want to get act together. Thank you for sharing this and congrats on your internship!",
            "I’m a mama and full time student also. How do you manage to get hw done in so little time. I start at 8pm also and I still have so much hw to do after 11pm.",
            "To me, personally, this is the most inspirational story of going to school for CS I've read. Thanks for the inspiration.",
            "You are a super human wow! Great job!",
            "Congratulations! I have 3 little ones and finished my CS degree last year. It’s really tough carrying so much responsibility. I’ve been working as a SWE for ~9 months and it’s awesome! Your hard work will pay off. Best of luck.",
            "Wow, congrats! How the hell did you survive on 5 hours sleep every night?!",
            "You deserve it! Enjoy your internship I hope you learn a lot :)",
            "You go!!! Congratulations! And I thought I was busy haha",
            "You’re incredible! You should be so proud of yourself for achieving so much :)",
            "Congratulations !!",
            "SO happy for you!! That’s insane, and dell is a great company, you should be so proud of yourself :)",
            "Holy fuck congrats",
            "Wow this is awesome. I truly respect your grind. Your story motivates me to really improve my work ethic. I wish you the best of luck in the future!",
            "Thought my part time job /full time school was hard but this! Good job. Congrats, you got this!",
            "Congrats! Comp sci pride!",
            "I am so proud of you. I dont know if anyone ever told you that but I am. Seriously. From the bottom of my heart. You are going to do great things with your life and I hope you can take some time for yourself and relax. You deserve it. Your worth ethic and resilience is admirable. This degree is hard and to do it with the responsibility you have is just amazing. I cant wait to see what you do in the future :)",
            "Congrats! That schedule is insane. Please take time off the grind to take care of yourself!",
            "As a mom of a 3 year old and 12 year old, and a CS student, THANK YOU FOR THIS POST! \n\nI was starting to feel so alone in my journey. My schedule is similar to yours. Im saving this to give me the motivation i need when I'm just so tired after toddler goes to bed, that I just want to relax and watch netflix but I gotta study. Thank you. And congratulations! You fucking deserve and earned your success.",
            "It doesn't hv to be FAANG, others r doing amazing things as well. Dell tech is super cool and you're super cool. uni alone is enough to drain all my energy, I cant imagine how much effort it takes for you to reach there, simply amazing :) i'd like to become a capable person like you too one day. Congratulations",
            "Looking for a glimmer of recognition for your mother’s huge role here and tremendous sacrifice on your behalf, from you or any commenters, and see nothing.",
            "Congrats!!!! Love stories where people work their ass off, and everything comes together for them 🙌🏼",
            "Congrats! I know exactly how you feel being a full time CS student myself and taking care of a 9mo old. This is no small feat and you should be proud of yourself. Keep your eye on the prize.",
            "[removed]",
            "Oh my god my life seems like a piece of cake compared to that. Thanks for the inspiration, and congratulations.",
            "Inspirational journey wow! You rock",
            "LETS GOOOOOOO amazing work really proud of you that's tremendous",
            "I’m so proud of you!!",
            "This is inspiring.  I don’t know you but I’m so proud and happy for you",
            "You are amazing!",
            "Working hard like that, you deserve everything that you want plus more. Make those babies proud! ☺️☺️☺️",
            "So awesome! Congratulations 🥳",
            "This made my day. Wish you all the best.",
            "Congratulations! This is just the beginning, there will be speed bumps but I'm sure with your determination you'll persevere without issue.",
            "Congratulations! What an inspiration",
            "Very cool! Thanks for sharing and goodluck with Dell. You'll do amazing!",
            "Let's gooooo",
            "so inspiring!! congratulations a hundred times over— you earned it!",
            "People like you are inspiration for thousands of people. Thanks for the post. And dgaf about FAANG lol",
            "Wow, that’s a heavy work load",
            "Massive respect for your work ethic, congratulations",
            "You go mom!!!!! Congrats!!! 🎉\nProud of you! This gives me motivation🙌🏼",
            "You’re incredible 💙",
            "Congrats!!",
            "Amazing, you are an hero.",
            "And the best mom award goes to....",
            "Woah well done! That is awesome!",
            "I've been struggling a lot the last couple of semesters, mostly not from being in person for classes, mostly from other IRL stuff\n\nYour post inspires me. You can do it, I can do it. We can do it. You keep on kicking ass and being a hope to the rest of us",
            "congratulations!!",
            "Congratulations :)",
            "Congrats, you are awesome!",
            "Ur an inspiration! Please update us down the road 🖤",
            "Really admire you...that’s amazing",
            "WOAH. Reading your schedule made my jaw drop!!",
            "Holy shit, you rock.",
            "Woah!",
            "That's literally insane. Congrats!!!",
            "That’s frickin amazing. How driven are you? So amazing this should be top post of all time!!!",
            "Wow, congratulations. Nice to hear a story of hard work paying off :)",
            "You are a legend; keep it up. You deserve this, and so much more. Cheering you on from the sidelines. It will get easier, I promise.",
            "YOU ARE INCREDIBLE!!! This is something that you should be soooo proud of. Your kids are blessed!!",
            "in unrelated news i took classes from bed today cuz i was up til 4 last night watching conspiracy videos",
            "wow congrats!!! kudos to you, it's impressive to do just one of school, work, or raising kids, let alone all of them at once in a pandemic! and don't devalue your accomplishments, you've done amazing things! I'm inspired to go do my homework now bc of you :)",
            "You deserve it that's an insane come up story.\n\nNow that you've done it, please for the love of god make sure you are mentally capable of being a mom still. I watched my mom pull us out of poverty but it cost her the mental health of the whole family. That stress + a divorce just caused her to be just super overwhelmed all the time, and had negative consequences on me and my sister.  \n\n\nOp i know you're not my mom and I'm projecting, but please take care of yourself now that things don't completely suck.",
            "What do you drink/eat for this energy?\nI'm seriously amazed!!",
            "> Internship: FINALLY RECEIVED for Data Science at Dell Tech!  \n>  \n>I know it’s not FAANG and I know it’s not the best well known company but I just want to let you know that if I can do it so can you! I’m telling you it’s possible and I’m living proof of that.\n\nYeah no, Dell Technologies is one of the most established and recognizable technology companies ever. Its on the level of AT&T.\n\nBut nevertheless, CONGRATULATIONS!!!!! Its absolutely amazing and super inspiring that you were able to accomplish this with two children and working full time! Honestly, I'm realizing that I really need to work harder.",
            "Love this ❤️ Congratulations!\n\nyour kids are so lucky !!",
            "Wow congrats!!",
            "Wow! Go, mom! Moms always have the most energy. And who cares for FAANG? Dell is a great company/brand!",
            "You are such an inspiration xx",
            "Nice!! Congrats!!",
            "Today I learned im just a lazy ass.",
            "you're amazing.",
            "Well done",
            "Amazing! Your story is truly a source of inspiration for me to keep up. Wish you all the best with your Internship at Dell :D",
            "You are a great mother, God bless you and your family",
            "That is actually really amazing. People like you are what gives me a drive in life. There's no reason to look at the negatives in life as long as you keep pushing to your goal. Oppression is a mindset! Keep working!",
            "Hellz yeah!! Way to go.",
            "Wdym “Dell is not the best known company.”  Anyone that knows Microsoft or Apple definitely knows Dell. Congratulations.",
            "swag",
            "You’re such an inspiration! I’m sitting here making excuses and indulging in self-pity and you inspire me to get out of the rut and try again 💕",
            "You inspire!",
            "Fantastic!!!...Bravo!!",
            "I hope your post will change my life. I screenshot it. Your post is for background photo.",
            "Congratulations OP! You are awesome. ✨",
            "Congratulations! Dell is a great first company! Your work ethic is inspiring.",
            "Inspirational thaks for sharing OP!!",
            "Impressive and very motivating",
            "Congratulations!",
            "Im gonna save this for inspiration",
            "Thank you for this. I am starting a coding bootcamp and I am also a mother of two boys 5 and 2 year old and I have been soo nervous on how will I juggle it all. Very inspiring!",
            "Congrats! Super stoked for you! I have no kids yet, but working full time and going to school at the same time is not easy. Props and congrats again!",
            "I don't even know what to say, I salute you.",
            "Wow that’s really cool. When you got the internship did you have to quit your day job? I’d like to do an internship but, am not sure what to do about income once it ends.",
            "Shit, you go girl. I have one kid and can barely manage. Don’t stress about not being in FANG, with that dedication and motivation, I’m sure you are going to get there if you want to. You have one foot in, everything is going to get easier!",
            "Congratulations! I help my girlfriend with her son and I think that’s hard while trying to be a full time student! This is really motivating to see!",
            "👏👏👏👏",
            "Dell is a fantastic place to start your career. Maybe it doesn’t pay like FAANG but it’s a serious tech company with serious products. You will learn a ton and your prospects after Dell will be amazing!",
            "You are incredible!!",
            "First of all, CONGRATULATIONS with your internship! \n\nSecondly, I have no kids and no excuses but here I am making excuses 🥺😭 time to get back on the grind.",
            "I am so fucking lazy lmao",
            "congrats!!!! that’s absolutely amazing :))",
            "🐐",
            "OP, Reading this brought tears to my eyes just another lady who is older than the average student and have a little ways to go to even get into a Cs degree program. Thank you from the bottom of my heart for sharing this. I don’t know how you functioned on such little sleep 🫶🏼 you’re a champion. What an inspiration! God bless your work. Time to get my schedule in order! 👌",
            "THAT is determination and discipline. Way to go!",
            "Wow, you're amazing. Such a inspiration!!",
            "Inspiring but sounds exhausting.  Great work!",
            "Just so you know this is not easy. . I sometimes had to leave work earlier and couldn't do overtime to get the hours back.. most respect.. you must have a great mother.",
            ".",
            "That's amazing OP.  How long did it take you to get an internship?  Months? Years?",
            "This work ethic…."
        ]
    },
    {
        "post_id": "1b3ubng",
        "author": "culturedindividual",
        "title": "More enrolments than all humanities combined",
        "url": "https://i.redd.it/iswg7m366qlc1.jpeg",
        "score": 2424,
        "num_comments": 343,
        "created_utc": 1709299894.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b3ubng/more_enrolments_than_all_humanities_combined/",
        "comments": [
            "That’s reassuring! I’ll just have to grind leetcode harder.",
            "I'd love to see a source on this, because I'm not aware of any universities where CS majors approach \\~1/4 of the overall student body (unless this chart is counting \"social sciences\" or other groups as either \"science\" or \"humanities\")",
            "It might be inflated, Ik at my school most “CS” majors are actually Information Technology or Computer Networking or even Info systems. Which don’t require much math and have half the programming classes. But at my school its still considered as Computer Science. Most do it because they think CS is easy find out it’s not but with these different concentrations they get to avoid the programming classes and math. Ik very little Software engineering and Computer science concentration CS students at my school.",
            "CS majors will find jobs as easily as humanities lol",
            "We need more fear mongering.",
            "I like the MS paint lines on the graph with no data source",
            "Great job people who shouted \"learn to code\" and all those TikTok and YouTube day in life of SWE posters !",
            "Enrollment != graduation.\n\nWe had 96% total compound attrition.\n\n4% of declared CS actually graduates at my alma mater",
            "It does say degrees awarded which means finished degrees.\n\nI suppose people in cs tend to actually finish their degree maybe?",
            "I looked up the cited reporting, and I cannot find anything remotely resembling this data. Also comparing All humanities major against one major CS, and the disregarding other very popular majors like Business distorts reality. While CS has become much more popular, there are many majors that outpace it. \n\nThe Humanities are in decline because people need to make a living and those majors promise dubious returns.",
            "So degrees in fields with high pay are more popular than fields with low pay.\n\nReally.",
            "Cs is the new liberal arts degree😂. I’ve seen it being said everywhere and it’s basically true at this point. It’s the degree you get into when you don’t know what you want to do with your life.",
            "[deleted]",
            "I mean if growth of degree holders is such a huge issue to you, why dont you just give up? Move to another field? I dont get it, whats the problem?",
            "Oh the humanity",
            "[deleted]",
            "Hey look. Science degrees are also going up! This is a net positive for society, people!",
            "Hippopotamuses produce their own sunscreen with a natural secretion from their skin, helping them avoid sunburn.",
            "People are saying “yeah but 75% drop out before getting the degree” which is TRUE, but it’s also not really a good thing because the ones that DO stick through it are gonna be the harder competition anyways. So either way it’ll be tough",
            "This makes total sense. Computers are more widely spread than ever and the talent needed to maintain them and develop for the future has finally caught up. This is no longer a specialised skill and we are now just digital brick-layers. This is okay and also the natural progression of an industry",
            "The insecurity in this sub is off the charts, yesterday people were scared of outsourcing, now they are scared of new grads ..? What is going on?",
            "You all clearly haven't seen India",
            "In my country there is 110k on CS from total 430k of people who started studies this year and its more than all medical majors combined.",
            "University of Oklahoma is like 0.1% CS",
            "Really? But the dropout rate for this major is higher then any other major so it will even out in the end",
            "Interesting that this chart plots more “CS” degrees in 2020 than have ever been awarded in any single year in the US. And it goes higher from there too!",
            "I checked the majors of one of my math classes last semester and like 30-40 percent of them were comp sci however in my actual comp sci classes first and second year most of them except the really easy courses more than half the class dropped the course. My CS I class at the end of the semester there was 4 kids left out of a nearly full classroom at the start of the semester. I also see a lot of students using chatgpt to do there projects so idk how many will actually follow through with the career choice.",
            "Why is this shocking there aren’t a lot of jobs in humanities. Meanwhile tech is growing and cs is fracturing into a set of sister disciplines (CSci, DSci, robotics, ect.)",
            "Starbucks will surely be short of employees without more Gender Studies majors",
            "I got two friends with CS degrees from two different very nice and reputable colleges and neither of those guys can write code for shit. I don't know what they're learning.",
            "With the high number of absolutely terrible candidates I see on a regular basis during hiring periods, I can’t say anything other than I concur. lol 😂",
            "It could be that this will be the new literacy, computer science, as much as reading and writing is today. It will be common yet needed to live in an evolving world of technology, whether working in the field or not. It doesn't scare me anymore that everyone and their brother is getting a bachelors in CS in and of itself. Just need more jobs!",
            "Yet despite this, there will still be a surplus of humanities majors :)",
            "Enrolling into a program and actually learning from it are two different things. Most people I know who have bachelors in CS have absolutely 0 skillset and knowledge. I bet most of these people will quit the moment things start to get rough in the program. This sub is the same where someone posted that he wanted to quit CS because he found intro to java “Too hard”. Remember, only a few % have that actual skillset in CS",
            "Wow",
            "now show me the same graph but for jobs",
            "Holy cope. It’s over give up.",
            "If you have a passion then great, if you just want money then find a more niche market that has easier job requirements with higher pay",
            "[deleted]",
            "Seems like OP \"doctored\" this up after jumping up his own arse and talking from it.",
            "It will fall, trust the power of the invisible hand.",
            "Who gives a sht about humanities tbh",
            "it helps that humanities stopped teaching classics and started teaching political ideologies",
            "All degrees are going to be worthless soon anyways",
            "Good. There are endless jobs in tech. The humanities less so.",
            "And in 20 years barely any of them will have a jpb because AI will be able to code as well as humans.",
            "Art, language, media... all these are in the process of getting holed out by AI\n\nPhilosophy, history - these have never led to good job opportunities...\n\nPeople are effectively acting in their best economic interests",
            "Good for the world , most of those degrees are less than useless",
            "Bro hasn't learnt about derivatives. It's clear science majors have for nearly a decade surpassed all humanities degrees and a big nothingburger happened",
            "Science is already higher, and for good reason, (most of) those degrees are literally useless.",
            "It’s all good. In a year or two when the job market returns back to normal, all of the hiring anxiety will be memoryholed.",
            "The root cause needs to be addressed, how do u make more jobs available with similar pay across different sectors.",
            "Bro forgot commas towards the end and just started using “and”",
            "This should be posted to cscareerquestions subreddit so all the people who post” I’ve applied to 500 apps, what am I doing wrong!?” can see that it’s just the market and competition.\n\nI mean it could also be their resume, but unless it’s really bad, the market is the main issue.",
            "Gender studies.. holy fuck",
            "Not true as long as I threaten myself to drop out every other day",
            "Question: if getting a degree/working in CS is not worth it anymore, then what is? Genuine curiosity",
            "Well people are saying that Humanities are shit and Stem is the best thing to go now. Kinda buttfucked yourself there.",
            "As it should be lol",
            "can someonje tell me whqat percentage of the white collar workforce is cs?",
            "More and more people will be working for lesser than what they deserve. The money has done its work and it will be better if we see a pattern reversal asap.",
            "Still just a drop in the ocean, the EU is projected to need in excess of 600000 new software developers until 2025, and will only have about 5% graduating from a cs degree during that same time.",
            "[deleted]",
            "good",
            "NO MORE THAN GENDER STUDIES 😭",
            "Where's the line for AI ( or is it inside science)?",
            "that’s because science degrees lead to jobs and humanities degrees lead to hipsters stuck in food service or retail their whole lives",
            "For a long time everyone said 'Go to college, you will get a good job and comfortable life'.\n\nThey believed it because, earlier, it was mostly rich people or smart people who went to college. They had good jobs, but it was because they were rich and/or smart. Not college.\n\nBefore that, it was to 'Get a good factory job, put in your dues, and have a good life'...but then factory work was largely automated and wages went down.\n\nBut college graduates still did better than non-college graduates. And everyone said 'Well, you just need a good major! You can't study art or music, you need STEM'\n\nAnd people flocked to STEM.\n\nBut lots of them couldn't get good jobs. It was tough and competitive because we just didn't have a need for that many workers in lots of STEM. But tech was growing like crazy.\n\nSo then it became 'Well, if you want a good job, learn to code' because coders made a lot and because the market was growing fast.\n\nAnd just like all the other advice, it will end up being poor advice for most people....it's outdated. By the time everyone agrees that X is good, they are really saying that X was good for the people who did it 15 years ago. It's probably bad advice for people starting out now... And at the end of the day, success isn't just about choosing to do the right X. A 'good' salary is always going to be one that is higher than most other salaries. It's not enough to do X, you have to be better than most people also trying to do X if enough people are doing X.\n\nFor better or worse, our society is structured in such a way that most of us won't make a good wage. No matter what we do. Because we define a good job and a good wage relative to other jobs.",
            "The days of specialization being rewarded for CS are over and now it should just become part of standard curriculum.",
            "Anybody else think the number of CS degrees might plummet soon as LLMs etc get better and better at producing code?",
            "r/usdefaultism",
            "Tf does this even prove, wow humanities is a pyramid scheme wow shocker!!",
            "That’s why I switched to a finance degree in accounting, because I have enough credits where I can minor and computer science and my goal is to get a masters in finance and get a job in the investment banking or as a financial analyst but preferably I do want my masters and finance, and with my minor and CS and me knowing a bunch of shit in CS. I can always get a job in CS if I choose to",
            "CS supremacy 🚀",
            "Why is this whole subreddit a bunch of unskilled people desperately trying to bash CS majors? \n\nMore people want to do computer science — the fastest growing industry in America — than philosophy? That’s crazy that must mean computer science is doomed!!!  /s\n\nThe simple reality is we live in a world that increasingly relies on technology so a computer science degree can get you a job in any industry. It’s not just “big tech.” A CS degree is a great way to get a juicy job at an investment bank or defense contractor as well.\n\nIt only makes sense that given it’s versatility it’s the most sought after major and it’s not going to become saturated anytime soon. The current issue is due to the cyclical nature of big tech (make a lot of money, waste a lot of money, cut costs, repeat), NOT an inherent flaw in getting a CS major."
        ]
    },
    {
        "post_id": "1bdfru5",
        "author": "Warat68",
        "title": "How me and my friend finessed FAANG SWE INTERNSHIP",
        "url": "https://www.reddit.com/r/csMajors/comments/1bdfru5/how_me_and_my_friend_finessed_faang_swe_internship/",
        "score": 2425,
        "num_comments": 244,
        "created_utc": 1710295819.0,
        "selftext": "I don't know how we were able to pull this off. My friend who is a complete dunce (can not do fizzbuzz) somehow got an invitation to do the technical interview. He of course having close to no leetcode experience was panicking, this was his first ever interview as a junior in college. \n\nWe devised a plan to cheat the system. I sat next to him as he started the interview. Basic introductions and we move straight into the technical portion. He has no clue what to do, I used chatgpt to get a basic solution to the question and showed him my computer. Being as sneaky as possible he copies it down and spits word for word the description of the solution, taking sips of water to buy time. By gods grace the interviewer was content with that. \n\nThe behavioral was very easy as he bullshitted his entire experience portion from his completely fabricated resume. The interviewer ate that shit up. Realizing we had successfully bullshitted the interview and likely passed we went out and got plastered. \n\n\nHe got the offer yesterday ",
        "permalink": "/r/csMajors/comments/1bdfru5/how_me_and_my_friend_finessed_faang_swe_internship/",
        "comments": [
            "amazon moment",
            "How is bro gonna survive a FAANG internship if he can't do fizzbuzz 😂😂😂",
            "Oh hey, my team had an intern like this. When it came to the actual job, he stepped up, and starting working until super late at night. \n\nUnfortunately, he actually sucked and didn't get a return offer. But it was kinda cool that he managed to cheat the system.",
            "how can you use chatgpt while giving an interview?? 😭 i thought the interviews, specially for the 'big name companies' are held under proper supervision, no?",
            "I know for a fact its amazon, their hiring is so flawed.",
            "Faang 0 exp offer, must be Amazon lol",
            "Make that man pay you a cut. ",
            "This can't be real",
            "https://preview.redd.it/v7jhy17ph1oc1.jpeg?width=493&format=pjpg&auto=webp&s=03cebfb89f7299d3b3199c223828d8931d8e5a21",
            "https://preview.redd.it/8nmtqssrh1oc1.png?width=498&format=pjpg&auto=webp&s=35bdb487fb78c203dc958c5ba8e146f5ec2c4c22",
            "throwback to when someone named sushi cheated on the amazon interview last summer",
            "I worked as a talent acquisition intern once. Let me tell you, there's nothing that makes a laughing stock of a professional as much as a guy trying to google / ChatGPT answers during the interview.\n\nEvery week we'll get a few of these great people who'd give us a good time.",
            "my friend did this for amazon. see u in seattle",
            "do u still need a friend?",
            "Average amazon hire",
            "I fucked up once and hired an Indonesian kid like this... He got the Visa and everything to move to Switzerland. Lasted 3 weeks, then got sent home. Couldn't even do a Hello World. The slightly vindictive owner of the startup was dead set on recovering nearly 10k USD from the guy...\n\nThe kid's nickname was Chuchundra for years after.",
            "I do/did this. I make 410k a year. I hate interviews. Here are more tips:\n\nHave a silent keyboard, have a laptop/desktop setup side by side, tell them you’re taking notes and taking down the main points, and most importantly ASK clarifying questions while the LLM is processing the Q",
            "I had no idea what fizz buzz was so I looked it up…\n\nIf your bro can’t even do that, he’s fucked.",
            "Be careful, my internship for summer did a full background check on my CV through HireRight - contacting all employers for proof of employment and more. I was fine as I didn’t lie, don’t know how people get away with it though.",
            "Amazon",
            "How is it that your friend managed to get an interview from faang while I've submitted like 20 applications to faang jobs and didn't even get an OA?",
            "Enjoy being a shite engineer with that work ethic",
            "Um I'm happy for y'all but this seems kinda wrong ",
            "Shit why didn’t I think of this for the TikTok OA?",
            "I work in a faang and I can guess what happened here. No way they didn’t know but once you are screened a certain level and judging by other qualities a person has HR usually makes the call for you despite your wishes in the loop. I almost exclusively do college hiring and do loops quite often.\n\n Bro will hate it though but maybe he will find a way to work smarter not harder to achieve.",
            "He's gonna get kicked out within the month.",
            "title: \"finessed\"\n\nme: sus.\n\ncontent: \"cheated\"\n\nme: yep.",
            "why not me 😭",
            "Now this is the feel good story I was looking for. Congrats :)",
            "cheating on interview is like fine in the sense that u didnt get caught but won't they background check u and realize ur resume is completely fabricated? good for yall but karma's a bitch...",
            "You interns are dumb asf posting this. You make SWE look bad, and you are just going to make in-person interviewing mandatory. ",
            "[deleted]",
            "FAANG = Amazon",
            "what did the resume look like is it really that easy to just make shit up and they wont double check it?",
            "There’s no way this is real! Op please tell me it’s a joke!",
            "Someone will be tracked down I feel 😭",
            "Yeah not a great idea, cheaters will be found out eventually...",
            "I know I guy who works at Google said he cheated on a FAANG OA. He said he did it because he didn’t understand the wording of a coding question (hard) even though he had a great understanding and practice of DSA.",
            "real nega shit 💪🏿",
            "Tried that with Splunk, my friend fed me the wrong solutions 🤣🤣",
            "When taking fake it till you make it to far. He is dead.",
            "mike ross is that you?",
            "Lmao how’d you get the question typed up on chat got so fast. And was it a video interview",
            "I simply do not believe it 🤷. It is easy to say if someone is reading something somewhere during an interview",
            "W",
            "Lmao W",
            "Honestly your an awesome friend for helping",
            "what was the question ? I don't know why you would do this. You're going to join a team and chances are you're going to be the least smartest guy in the room and worse maybe even a burden.  \n\nThis is really disheartening, I like to code, I experience flow when doing it, I may be committed and pissed off because I have a bug somewhere and before I know it I've spent hours flipping through tabs on my browser, stack overflow, going through docs, asking the AI a million different things, hitting up classmates on discord. \n\nI'm smart I know I am, but I also know there are a lot of people out their smarter than me. Why not just be honest with yourself, that's how you're going to be the best at your craft and how you'll add the most value to whatever it is your working on. That in return leads to monetary rewards that grow as you get better at what you do.",
            "what company",
            "Lol i did this before but before chatgpt was a thing. My friend just helped me do the over the phone test on the computer. When i had to do the final round i looked like an ass. 🤦🏻‍♀️",
            "That’s gonna be a very stressful job when you don’t know wtf you’re doing",
            "Man be my friend",
            "shame cows towering crime liquid fly imagine summer worthless person\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "And, as always, cheating pays off big time.",
            "Luck. Don’t beat yourself up and just keep looking ahead",
            "You dropped this👑",
            "You think youre finessing a big corporation by bsing your way into an internship where theyll make you their slave, definitely",
            "So what’s he gonna do on the job?",
            "This is the way",
            "I know who these guys are",
            "Good luck to you. Some LC problems are very much overkill even for FAANG. But if you literally can't do fizz buzz, what the fuck can you actually do?",
            "Hmmmm…. Don’t think it is real since reading from other screen is easy to tell, especially for coding question",
            "That actually fuckinh works??",
            "“Dunce” I know my people 😭😭😭",
            "So, everyone here is super down to bemoan the market and support people looking, but is cheering someone cheating when there 100% are applicants who didn’t do this? \n\nWeird. Says a lot about a lot of people. This kid is a junior. He doesn’t need it if he has to cheat his way in, there are plenty of juniors in college who can do a fizbuzz. \n\nI guess, cool move?",
            "I am getting seriously tempted to start bullshiting my resumé pretty soon considering how fucking impossible it is to get anything decent in this job market lol",
            "Now you only have to work instead of him too. $$$",
            "People seem to forget what internships are, yes to the intern its a chance to gain pre graduation professional experience, but it's also a test, with the reward being a return offer or a full time position. Im a Sophomore and I can tell when someone sucks at coding from a mile away there are just tell tale signs of people who write garbage quality code. If it's obvious to a student, it will sure as hell be obvious to any manager or any other team members when it takes you ages to make a pull request for a fucking button you got assigned to 2 weeks ago. You got through the front door, but if whatever FAANG company you got hired at is worth their weight in salt they'll weed you out before long.",
            "I hope at minimum your friend bought you a beer, lol",
            "Now I know why so many people complaining why they can’t get a return offer from Amazon",
            "Does....anybody else not see the shitpost tag? OP are you bullshitting/trolling fr or not?",
            "im ngl i can't even hate,,, the system made us like this 😭",
            "Brohhhh. congrats I guess 😭",
            "You have done the smallest and most pathetic thing of all the bad things you could've done.\n\nCongrats. All of your life has led to this moment in which you have peaked as someone that does petty fraud for a living. There is no glory. There is only guilt.",
            "Great and here I am with no call backs",
            "Congrats. This can only get you so far",
            "If this becomes a thing, companies are just going to make in-person whiteboard interviews the norm again lol",
            "My brother has worked at Google for almost 2 years and he has only completed like 3 Jira tickets. He is on a PIP but never gets fired somehow. Your friend can do it if my brother can. Godspeed",
            "&#x200B;\n\nhttps://i.redd.it/6df3c9i81qoc1.gif",
            "That's tight. He will get found out and black listed from future opportunities though. This type of thing is actually a bit more common than you think. Never seen it work in the long run, but best of luck.",
            "if he can learn enough before they get rid of him and have faang on his resume, it might be enough to get in somewhere else. not too shabby",
            "Do you know what a background check is ? :/",
            "[deleted]",
            "OP's response to redditors complaining over the doom posts\n\n![gif](giphy|rvaQRHCzisFeo)",
            "[deleted]",
            "so much cope in the comments LOL \n\nthat is hilarious",
            "wow must be nice having friends. For those who don't have friends to pull this off check out [interviewsolver.com](http://interviewsolver.com)"
        ]
    },
    {
        "post_id": "1cjd2ht",
        "author": "Odd-Personality-1294",
        "title": "Tesla Internship Revoked",
        "url": "https://www.reddit.com/r/csMajors/comments/1cjd2ht/tesla_internship_revoked/",
        "score": 2412,
        "num_comments": 201,
        "created_utc": 1714754102.0,
        "selftext": "Got an Email this morning saying l'll no longer be able to participate for their summer Software Engineering internship after I was given an offer 7 weeks ago. I also had 2 other offers (but they were startups with low pay) so l rejected them after Tesla offered me one with high pay. My internship was about to start from June and was preparing to move after my finals and had spent a couple thousands for housing. This cant get any worse right?\nWhy does this always happen to me Jesus Christ there isn't even much time left to get one before summer now ffs 🤦🏼‍♂️",
        "permalink": "/r/csMajors/comments/1cjd2ht/tesla_internship_revoked/",
        "comments": [
            "Companies when you renege: 😡😤🤬🖕\n\nCompanies when they renege: 😥😎🌈✨",
            "Reach out to the recruiters / hiring manager for ones you rejected .. things changed and you’re keen to pursue the internship. \nYou could be honest and say you had accepted Tesla internship but there has been changes in the program. So now you’re available. Good luck !",
            "Sorry to hear that if you can get tesla I'm sure you have the skills to land something for fall. At least we know not to work for elon companies from now on.",
            "Got invited for an interview there. Of course I responded with yes. Got ghosted after that. Thank you Tesla. \n\nYes I emailed and messaged the person who sent me the invitation, never got a response back. 😍",
            "I heard that they are still paying out interns. Is that accurate?\n\nSucks that this happened so close to summer though. Maybe one of the start ups you rejected is still looking for people?",
            "Why was it revoked?",
            "I got an offer from Nvidia for the summer. I have signed the offer, and got revoked (not based in the US)",
            "This sucks. I did an 8 month internship from January to August. I was going to continue working part time after as well as a big group of more interns coming in for the fall semester. The company announced they were cutting everything. I was lucky since it wasn't a big deal but the fall group never registered for classes so not only did they not get an internship but they couldn't get classes either. The company tried to work with my college to help get the kids registered for something but it was a big mess.",
            "I’m sorry to hear this. I hope you find something soon. This will all work out for you in the end.",
            "> Why does this always happen to me\n\nOh this sort of stuff is happening to everyone.  Corporate America doesn't care about people at all.",
            "theyre doing cuts for his payouts",
            "Im sorry, don’t trust a company maintaining jobs if it’s run by elon fuckin musk",
            "Sorry to hear that man, I hope you aren’t in your junior year rn so you can get another one next summer",
            "You can thank Elon. He revoke it while fighting for his own pay package. It’s in the news.",
            "Go back to the other smaller companies you got internship letters from.\n\nLow pay yes, but experience is key.\n\nIn this industry experience helps you alot",
            "Sorry for that bro… that’s the day a Tesla competitor was born ig",
            "At this point I'd just leave the internship on your resume (Tesla Internship - Cancelled due to macro factors). Why not? You made it through the interview. I would still see it as a plus and know that you were caught up due to Elon.",
            "Elon is an asshole.",
            "My friends did internships with the feds (were taking 2009 though, lol. See if there are air Force bases near you for example:\n\n[USAJOBS Internship Portal](https://intern.usajobs.gov/search/results/?hp=student&wt=15328&s=salary&sd=desc&p=1)",
            "Definitely email the two offers and say your situation has changed and you would be interested now. I turned down a role due to a financial situation and then emailed them 4 months later and they re-offered me the position. Stay formal and polite and the worst they can do is turn you down or ignore the email.",
            "I mean you dodged a bullet. I had applied to Tesla a couple years back. Never got a call, I moved on started a career. They ended up emailing me a year later that they wanted to interview…. What kind of shit is that?",
            "Omg. Never ever cancel.\nNext time accept the 3 and cancel the 2 other a day before your start date.\nSame thing happened to me (with another company) and I went with another option I hadn't cancelled.",
            "It’s all part of Elons big IQ plan. Just pray and wait.",
            "My friend got laid off as an intern from Tesla and got 2 months severance. He wasn’t too sad.",
            "Elon Musk is a jerk.",
            "I would still put out your resume that you were a Tesla intern",
            "From my perspective, successfully securing an internship at Tesla is a great achievement. I'm seeing many struggle to even land one internship, you managed to secure three. It shows your skill and ability to secure multiple offers. You've got the skill to get more offers.",
            "If you google warn notice 2024. You will get to know tesla probably doing layoffs. So probably the team you suppose to get hire their budget got cut.\nDefinitely it’s not you. Hopefully you will find something better than this. Wising you a best of luck",
            "You can sue for the money you spent as a direct result of the offer you received from Tesla. If it’s under $10,000 it will be handled in small claims court in most places. Tesla is unlikely to fight you on this, it’s pretty cut and dry, and $10,000 doesn’t buy them much time when you factor in travel and legal fees.",
            "Dodged a bullet. \n\nYou don't want to keep doing all-nighters as an adult too or looking over your shoulder at CEO trying to make a point using your career as a prop.",
            "Meanwhile you could move to the Midwest and get a warehouse or driving job within about a week, that pays enough to save ~$1000+ a month with one roommate.  Make that about 2K+ if you're working 70 hours.  Or you could get a CDL and be making 60 grand solid within about a year.  \n\nIdk, I had the same sort of caveat hidden pitfalll bullshit happen to me for pursuing CS.  Heck, I was laughed at for even thinking I could *get* an internship, by the engineering career services at my university.  Now, I'm 32 and still behind for having pursued programming as a career.  Bottom line at the end of the day is it's not as in-demand as they told us, otherwise you'd easily be able to get jobs in it.",
            "It might be worth chatting with an attorney to see if promissory estoppel applies here. That's a very significant loss based on Tesla's promises.",
            "I think if you had already spent the money on housing they could be legally liable for the cost associated. Not a lawyer and might be too expensive to pursue",
            "What team were you going to intern for?",
            "What you experienced isn't normal \n\nTesla is an awful place for a career. Take it from ...literally anyone",
            "Tesla plans to layoff lots of people in June, at least in CA. I'm sorry you were one (even though it's not technically a layoff).",
            "Any company that does that does irreparable damage to its pipeline—especially a car company.",
            "Wtf 🫣",
            "Probably realized you use chatgpt like on your other post",
            "I feel like I’ve seen others post about something similar. Were you the only one affected? It is worth giving some news stations a heads up? What BS.",
            "Sorry you got Musked. \n\nTake this as a sign to NEVER work at one of his companies.",
            "I’m sorry, man. This is rough.",
            "I have nothing to say besides I’m sorry to hear this. Are you going to try and recruit for local companies nearby?",
            "Did they explain why? I mean I know things been rough in the tech industry but it’s been for the past 2 year. But why offer in the first place if you are gonna revoke. I’m kinda scared to even apply. It’s already a drought in jr jobs.",
            "For what it's worth, this business of revoking/renegging on internships is what's finally going to get me to sell the remaining Tesla stock I control.    It's dumb, counterproductive short term thinking and also nasty and mean.",
            "Welcome to 2024 batch😃",
            "Sucks man. Not much you can do at that point. I saw another post on here about another guy in the same situation and he talked a whole bunch about having a positive outlook and I thought all that was crap but you just gotta reach back out to the other companies you had offers from and try to find some last minute internships on LinkedIn.",
            "No cap",
            "Forget why. Move on. Get ball rolling again for other opportunities. There is no point overthinking about it. It happens but dwindling on it is not going to help.\n\nMove forward. Start making calls and start applying.",
            "A sharp reminder to remember you're just a number to these companies, and they equally deserve no loyalty. I am sorry its happened to you, hopefully you'll find something else but you're going to have to look for smaller companies and reduce pay expectations considerably.",
            "If you really spent a couple thousand dollars for housing based on their promise of employment there is ground for suing, just saying.",
            "never reject other offers until you are about to start the job.",
            "File for promissory estoppel for the amount you've committed to housing and relocation.",
            "Jesus so sorry for you dude. Any reason why this can happen? Sounds like hell, this can't just materialize out of thin air. There's got to be some logic.",
            "Wow, I’m sorry to hear that. Elon is such an idiot, how much are you really saving by cutting an intern program and reneging on offers. At the very least let it run through this year. Needless to say this is going to come back to bite him.",
            "So sorry to hear this. It’s not about you. Just keep the faith…..you sound like you’re an awesome person",
            "Bruh",
            "Does anyone know if promissory estoppel applies for internships?",
            "Apply to work for the production line if you need a job \n\nFuck the internship",
            "Happened to me too with Meta when Covid hit",
            "They just fired thousands. Tesla is on severe cost cutting mode and interns don't bring any immediate benefit.",
            "Sorry to hear that.",
            "See if you can sue",
            "Apply to BYD to spite Tesla 😎",
            "Brutal",
            "Bud, you did your best and landed two offers which in my opinion is amazing! Good things happen to people who try and have courage to keep going. Move on and keep grinding and hustling!",
            "Which team? Which location?",
            "This whole situation MUST be a wake-up call.\n\nWhere are the news stories detailing how these cuts are affecting our lives?\n\nWhy the heck aren’t the so-called “developer advocates” out there ADVOCATING for students/employees?\n\nIf this was happening in a blue-collar field, the President would be out on his lawn demanding justice. Most of us aren’t making high TCs, but maybe that’s the illusion. Make it make sense..",
            "All that glitters is not gold.",
            "Are you international?",
            "Just out of curiosity, how much were they offering you?",
            "Curious, what the Tesla pay was?",
            "Take legal action? You can actually make a good case for compensation because you actually lost a couple of thousand bucks.",
            "Employment is at will. Just move on.",
            "Knowing elon, im shocked he doesn't make interns pay for the training experience",
            "There’s gotta be more to this story. Why would they revoke your internship? It’s not like they’re hurting for money. Something fishy here.",
            "Elon Musk W, if Tesla was your only good offer, then he would have had overpaid you massively since everyone else say Google, Microsoft, Meta … rejected you",
            "This was in the news last week that Tesla was canceling their internship programs. Do you not follow tech news?",
            "What did you do to piss of the Musk??",
            "Internship at a startup sounds idiotic.. that’d be terrible for both the employee and the company"
        ]
    },
    {
        "post_id": "1bdiyfw",
        "author": "Thethinsmallguy",
        "title": "fuck you devin",
        "url": "https://i.redd.it/eu1w5go171oc1.jpeg",
        "score": 2338,
        "num_comments": 215,
        "created_utc": 1710305062.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bdiyfw/fuck_you_devin/",
        "comments": [
            "CS has become so insufferable with how these cooperations take dumb risks and lose a bunch of money.",
            "isn't this the same startup on that other post with the commenter who did an analysis about their shitty website and even uploaded some 5 gigs of files and a python tutorial to their server XD?",
            "It's a scam.\n\nGo look at the website, shits a gpt clone with worse infrastructure built up in 4 months. Nothing to worry about\n\n\nEdit: \n\nHere someone else looked at their trash and highlighted it better:\n\nhttps://www.reddit.com/r/cscareerquestions/s/6h85Ir9bMM\n\nAlso for everyone who says \"but a founder went to a good school\" yeah so did I, I met people who'd pull an investor scam like this there too. Good school means nothing, nevermind the fact that the CEO just graduated and has 0 industry experience other than a 3 month internship. I'm all for driven young founders, but not when they make unsubstantiated claims like this\n\n\nEdit 2: fucking called it\nhttps://www.instagram.com/reel/C5sgyBXrL0C/?igsh=MWN6bG9kM3lmaDlzZQ==",
            "SWE? \n\n**did Devin have to take calc 1/2/3 and suffer by witnessing the posts made on this sub?**",
            "All I see is a program, nothing legitimate enough to call a engineer.",
            "I hope this startup burns to the ground so badly that it becomes an example to all the shitty companies that want to replace workers with AI.",
            "\"fuck those companies trying to replace workers with tech\" - practicioner of discipline 'automating peoples jobs' when their job is threatened",
            "fuck you devin",
            "nah .. it won't be a bonafide software engineer if it doesn't sleep, play games, or chat on Reddit in its working hours",
            "All 3 cofounders are IOI Gold Medalists.",
            "Guys are we cooked",
            "After everything we have seen, it amazes me people are still like “NAHHH ITTL NEVER HAPPEN”. Ok. Did you think AI was gonna get 70% of the way there and then stop, like that’s it? Did you think we were so special that it could never do what we do?\n\nlol what a small view! I’m ready for when AI *surpasses* humanity. The future is wilder than any of us can imagine I’m sure. When you see TV, think rockets. When you see rockets, think of the universe.\n\nThe current ways of things are just a small blip. What does technology look like in 100 years? “ITTL never replace ME!” lol fucking hell man yall are so smart and so stupid at the same time.",
            "Basically a glorified copilot?",
            "Tons of these agents have already popped up. This one just had some marketing behind it. They are at best a tool and a worst a scam.",
            "Watch prod go down immediately",
            "Creating a successful software product is not only the coding or engineering component. You need to create — or have — a good team to execute a successful product. I doubt very much Devin can handle that part of being a software engineer. Not to mention all the business requirements of the product that are dynamic since they change all the time. A real person is needed here to create an iterative process with the client to define the engineering goals of the product. I think Devin will be a good tool to speed up the productivity of the team, but I don’t think it will replace software engineers, at least for now",
            "Deep down everyone knows this shits gonna turn very bad in future but no one wants to acknowledge it",
            "People keep buying into hype. Even this post is spreading the scam.",
            "![gif](giphy|2S3Aj8OeKtf0c)",
            "I may switch to embedded systems engineering for good  so I won't  be concerned any More Abt Some AI taking my Job",
            "So Devin takes away your job and gets laid. \n\nDon't be Devin",
            "bro literally coded a while loop that sends the last GPT response as the prompt for the next response 💀💀",
            "So funny to see bunch of SWEs turning luddites. Now go back to 1850 and ask for forgiveness to factory workers.",
            "Its a scam",
            "Should have learned to plumb instead of learning to code.",
            "Even if this is legit someone would still have to manage Devin lol but they are definitely trying to eliminate the position so they don’t have to pay people to code but based on what we have we should should have more time before that really becomes functional",
            "Trust me AI will f the big corps asses and ince they are done they will nuke em",
            "These are just low quality imitations of ChatGPT I wouldn’t worry about it",
            "This reminds me of the kung fu panda meme where he yells across the valley to the peacock villain and says \"what is your name\",,,then says \"fuck u Tony!\"",
            "[deleted]",
            "![gif](giphy|2S3Aj8OeKtf0c)",
            "we are cooked",
            "Fuck devin. All my homies hate devin.",
            "What’s funny is thinking that a shitty startup could do this in 4 months and mega corps haven’t even done it with more resources. So easy to see it’s a scam",
            "fuck devin",
            "Good.",
            "the only good thing about this is that atleast some swe interns/people got jobs while building this thing. I can't say to how well it actually works.",
            "You guys think this is a viable career path anymore?",
            "Adding Devin to my resume",
            "Ok I get it programmers wanna replace themselves",
            "It’s so over for you people lolololol.",
            "Years ago we had Theranos. Now we have AI lunacy. How quickly people forget.",
            "Guys I understand your reasoning behind the swe is more than just spitting out code component but with the exponential rate of advancement in the AI space it seems naive to think that relatively soon ai won’t be able to do everything a swe does and more, I’m about to major in cs and this seems daunting",
            "Stop being a luddite"
        ]
    },
    {
        "post_id": "1adexyo",
        "author": "Fabulous_Year_2787",
        "title": "I got the Job!",
        "url": "https://i.redd.it/ahgwon6sa9fc1.jpeg",
        "score": 2332,
        "num_comments": 84,
        "created_utc": 1706480540.0,
        "selftext": "I am thrilled to announce that I have accepted a new position at McDonald's, a globally recognized leader in the fast-service culinary sector, as a Retail Transaction Engineer and Customer Experience Specialist. This role represents a unique blend of technical proficiency, financial transaction management, and human-interaction excellence.\n\nIn this capacity, I will be leveraging cutting-edge transactional technology to expedite and optimize customer purchasing experiences. My responsibilities include implementing precision order processing, utilizing advanced point-of-sale systems, and managing financial exchanges with accuracy and speed. This role requires a meticulous understanding of process efficiency and customer interaction dynamics.\n\nMoreover, I will be at the forefront of customer experience, ensuring each interaction is conducted with the utmost professionalism and efficiency. My commitment to enhancing customer satisfaction will be driven by leveraging data-driven insights to refine service delivery.\n\nThis opportunity marks a significant step in my professional journey, where I will develop skills in technological fluency, financial transaction accuracy, and customer service excellence. I am eager to contribute to McDonald's renowned service standard and to collaborate with a team of professionals dedicated to setting industry benchmarks.\n\nI am grateful for this opportunity to grow and excel in a fast-paced, dynamic environment. Looking forward to making a meaningful impact in the realm of retail transaction engineering and customer experience optimization.",
        "permalink": "/r/csMajors/comments/1adexyo/i_got_the_job/",
        "comments": [
            "Inspiring!",
            "Total compensation 15$ an hour in HCOL area",
            "You got a job to make AI images? Wow!",
            "Congrats! How many LC problems did you solve to land this position?",
            "Cursed LinkedIn post",
            "Cheeseburger engineer",
            "Congratulations",
            "Congrats buddy. Now go make me a fuckin’ cheeseburger.",
            "Can you refer me?\n\nI have an undergraduate in CS, and a masters in blockchain technology.",
            "Dayum, got rejected since they didn't offer visa sponsorship",
            "Commenting for better reach!",
            "When you’re talking to someone older than you at work and they tell you “I also did cs at your age” :\n\n![gif](giphy|J8YpfDX0kvPQNSVGHY|downsized)",
            "congrats!! looks like you're having a good time!",
            "Go you!",
            "Don't make fun of any career.",
            "Wow, I’m truly nonplussed. Congrats!",
            "how was the interview?",
            "At least they respond to my application",
            "Softserve Engineer",
            "Wha…whaaa, What’s for bre…brea…breakfast..D…d..Dad?",
            "Wack Arnold's is tearing this family apart!",
            "![gif](giphy|NnGGHE0muVqpO)",
            "https://preview.redd.it/glgiy9j80bfc1.jpeg?width=497&format=pjpg&auto=webp&s=3923cc92665bbc0677387647d52b2c495314d245",
            "Haha We're fucking cooked",
            "At least no hellcode.",
            "Weird that you used ai for this instead of just googling McDonald's employee",
            "Meh, frontend engineers are not real engineers",
            "Never use utilizing \n\n-1\n📝",
            "There's a subreddit for overcomplicating job descriptions like this... Does anyone else know? I forgot. :p",
            "This an AI generated photo? Lol",
            "My friend just left extremely well paid position to do non-paid startup with his friend. There are still dreamers that don't care about money among us.",
            "By ChatGPT",
            "https://i.redd.it/s3lhs7t0tafc1.gif",
            "Lol",
            "Congrats king!",
            "imagine if in the future you had to solve leetcode to get a job at mcdonalds",
            "You got it made in the shade there!",
            "Wow how many leetcode problems have you solved so far?",
            "Careful, you might find you learn something.",
            "Calvin's got a job.",
            "Suddenly I'm convinced this is the best career I can choose",
            "Nooooo",
            "That’s the kind of enthusiasm we love to see from our corporate bootlickers. Now get out there and be somebody!",
            "Congratulation!",
            "Congrats bro! I'm jealous",
            "I’ll have the Weird Patty McExtra Bun please.",
            "Are you above working at McDonald’s?",
            "Congrats,\nHappy for you ☺️",
            "Post this on LinkedIn! You've earned it champ, congrats!",
            "Junior Consultant (suggest burgers from menu to customers)",
            "Blasting job now get me a pizza",
            "That’s the fucking homelander!",
            "You needed AI to make you a picture of a McDonald’s employee?",
            "Annual performance review is on the scale of 1 to \"McLovin it\"",
            "Is this what it’s come to?",
            "Bro even made the image AI generated, not just the text",
            "McDonalds is a real estate and IP company, they don’t own restaurants."
        ]
    },
    {
        "post_id": "17ox4k3",
        "author": "Captain_MK13",
        "title": "International student, still alive 💪",
        "url": "https://i.redd.it/u679tymkfoyb1.png",
        "score": 2323,
        "num_comments": 207,
        "created_utc": 1699254338.0,
        "selftext": "These are the one just tracked my Simplify, I think I crossed 1200 easily\n\nProfile: Bachelors and Masters in CS, 3 internships, 3 strong projects",
        "permalink": "/r/csMajors/comments/17ox4k3/international_student_still_alive/",
        "comments": [
            "Internationals outside of t5s",
            "Let’s see your resume. After yesterday I’ve learned that people put “dogs” as a skill on their resume so I can’t trust these no more.",
            "1200 unresponsive applications with three internships + projects? Man is this market bad, I’m really sorry about that.",
            "Wow never seen something more relatable than this😞",
            "Current job market + work authorization",
            "Well as an international student I don't mind going back to my country its just that I don't want to go back with crippling debts.....might have to pull a breaking bad if this keeps up.",
            "This is nothing compared to around 6k applications, 15 screening calls, 5 Interviews, 1 offer.",
            "head up king. its so rough this year its insane",
            "[deleted]",
            "Which country? I think that affects your outcome.",
            "not even automated OA's or rejections?",
            "Would Canadians be considered internationals? I’d imagine yea? Or is it slightly easier for Canadians cause of the J-1?",
            "Feel like majority of the sub are international students",
            "been there, done that, good luck man",
            "You are my motivation! Keep going strong dont give up 💪💪",
            "![gif](giphy|YSYkSmLfV74dGCQRz4|downsized)\n\nIts ok you got this!!!",
            "Wow, why is it so much harder for international students?",
            "Will prolly get downvoted but you seem to come from India and there's plenty of opportunities here. If not your ego, what stops you from applying in india?",
            "“Easy to find a job”, they said…",
            "😢",
            "me too. keep it up king, we got this",
            "Riyal.",
            "Didn’t you make any connections during your whole year in the U.S. ? Also if you have three internship experiences, you should have get at least one phone screening. Also on the job applications, you should have said “Yes” to work authorization part because you are authorized to work under OPT and CPT programs. I literally said “Yes” to sponsorship part and got interview a day after sending my application. I would work on my resume a little and say “Yes” to work authorization part.",
            "Same situation :/",
            "Every other post is a gangsta until an international lands an offer!",
            "I feel you",
            "What's the projects?",
            "First off good luck on your search homie, but do you guys manually track with simplify? I’ve got a few hundred apps out there but to update each one i apply for / hear from sounds exhausting",
            "Hang in there, buddy. There should be a burst of sunshine after the hurricane!",
            "🥹🥲",
            "Honestly its hard to believe you put significant effort (1-2 days company-specific cover letter writing) into these applications if you crossed the 1200 mark. Spray and pray does not work in the job market",
            "[deleted]",
            "Message me your CV, I don’t believe this",
            "Sorry to see that bro… market is terrible, but keep applying, that is the only thing you CAN do if you already maxed out your coding skills. \n\nTry applying to smaller companies too and make your applications more quality rather than spam apply ATP. Good luck!",
            "Is this real?",
            "Wow it’s almost as if simplify doesn’t work if number of applications for those jobs that simplify can handle will become bloated! Who would’ve seen this coming",
            "Keep going, bruh",
            "Wal-Mart stay hiring, wont be a CS job tho. Store managers can make a grip.",
            "What are your 3 string projects?",
            "Good",
            "Did you find a job, or did you get deported back to India?",
            "Bro you got anything?"
        ]
    },
    {
        "post_id": "18m1oev",
        "author": "dazzy_rohit",
        "title": "Want to Master Data Science, AI, and More? Dive into this 500TB Treasure Trove!",
        "url": "https://i.redd.it/gqolg8x5597c1.jpeg",
        "score": 2302,
        "num_comments": 296,
        "created_utc": 1702991870.0,
        "selftext": "FREE! 500TB of Tutorials, Books, Courses, & Trainings for Data Science, AI, Cloud & More\n\n\nData science\n\nPython\n\nArtificial Intelligence\n\nAWS Certified\n\nCloud\n\nBIG DATA\n\nData Analytics\n\nMBA\n\nMachine Learning\n\nEthical Hacking\n\nHere is the 🔗\n\n[Google Drive](https://drive.google.com/drive/u/0/mobile/folders/1CgN7DE3pNRNh_4BA_zrrMLqWz6KquwuD)",
        "permalink": "/r/csMajors/comments/18m1oev/want_to_master_data_science_ai_and_more_dive_into/",
        "comments": [
            "Bro casually dropped thousands dollars of materials.",
            "This gotta be illegal I love it",
            "Somebody needs to make a mirror of this before it gets taken down lol",
            "Someone should create a GitHub repo with all this info",
            "Folks over at r/🏴‍☠️ would love this too",
            "This man’s going to heaven",
            "Nothing like representing big data with big data",
            "Where can I even store 500 TB?!",
            "There is no way this lasts, who does the service of saving it outside of Google drive?",
            "Bro bridged the wealth gap",
            "bro what the fuck?",
            "As a self-learning cs starter student, all my knowledge about the computer will root from yours here. Thank you.",
            "Thanks - some of these might be useful! However, I quickly looked through, and I notice a lot of this material is 15-20+ years old. This is a very long time in AI and Data Science, and a lot is missed by not reading current publications.",
            "Will my email get fucked for copying those folders?",
            "Here before the ban",
            "I don't know if I should be amused by people downloading pirated content from a new user or OP is listing his personal info while hosting files",
            "this is cray im so here for it",
            "Blows my mind that more people in a cs sub, no less, wouldn't have a problem with just downloading gigabytes worth of unknown data from a strange link.",
            "imma clone this give me a hour guys",
            "I'm scared to get hacked, is this legit ??",
            "holy fuck thank you",
            "Is this legit?",
            "What the… this is defo getting taken down soon",
            "You legend",
            "Someone clone this",
            "Where tf am I gonna store 500 TB???? God bless tho",
            "I really wanna partake in this but lowkey sketched out ngl, idk if I’m being too paranoid.",
            "Someone give this man some hea-",
            "Gonna have to delete a few pics first to make some room…",
            "It is not nearly 500TB, is it?",
            "FBz scam",
            "seems sketchy 💀",
            "How do you know if this is legit? No virus or anything of the sort?? The guy’s account is pretty new too",
            "500 TB is for clickbait. It is around 13 GB in zip plus a 4.5 GB movie. The Business Intelligence one is flagged as virus by Google",
            "Dude you can’t just drop the link to the google drive……you gotta convert it to base 64 first",
            "Fucking legend",
            "What in here is not freely available on the internet? I'm not asking to discredit this I'm just asking so I know what to download before this inevitably goes down.",
            "Google flagged a possible virus in the business intelligence module. Def download to a burner pc if you’re going to download.\n\nBro is padding the file size with movie rips. There’s a .mkv file in here for a movie from 1993 lmao. \n\nI’m not sure where he got 500Tb of data from, but this is nowhere near that.",
            "I wonder what OP's motivation is for doing this. Kinda sus (and his entire post history minus the first few are also all promoting free materials) but it seems like from the comments here that the link is fine, so maybe he's just a nice lad. Idk",
            "[deleted]",
            "https://preview.redd.it/7f02i8je6d7c1.jpeg?width=1284&format=pjpg&auto=webp&s=79b05689a8e13bf414f0678b7b664ea7be84e5a7",
            "lol gonna download this",
            "The deep learning folder  I can't access it",
            "Legend",
            "Merci Moad",
            "ave 🙏",
            "How do I download all these files?💀 What's the actual size?",
            "Anyone cloned this yet. I don't think I have the time to create 34000 Google drive account? Bro dropped the library of Alexandria for CS and dipped lmao.",
            "I ain’t clicking that shit",
            "500TB  🤡",
            "Thanks this is amazing",
            "Where to start for beginners",
            "i hope u get everything you want in life",
            "Don't be a moron. This is a pure scam data mining",
            "Can you send also web development like full stack and all thx",
            "Thanks",
            "How dumb do I look if I ask if it’s even safe to link I don’t know why, but when it comes to things like this, I always assume the links are full of viruses and malware.",
            "Wow, thanks",
            "bro i love you",
            "I love you",
            "My god ! You just won the internet.",
            "It’s true, i checked and it’s not a scam. Thank you",
            "All of this material is available online",
            "Damn this guy is a hero",
            "Holy crap I should do this. Can I still get certs from it",
            "Thank you for your service",
            "Can you send link?",
            "OP do you mind if I share it on Telegram, LinkedIn, etc.",
            "Sigma Male Spotted. Thanks dude!",
            "Yeah let’s be honest, nobody is actually going through this shit",
            "Mirror?",
            "Can anyone share any resources for NLP? Thanks",
            "Love it \n\nTy",
            "Absolute Madlad. I'm a novice at Computer Science right now and you gave all the resources for me to succeed. I'm thankful for this but I don't think I can get all 500 TB of data though",
            "What the hell",
            "data hoarder sub would love this",
            "Bro what in the actual fuck this is lquid good just too much tho",
            "how the hell do i even save this to my google drive lmao",
            "Wow, thankyou",
            "Following",
            "I'm pretty much sure this will be taken down. If anyone can, create a backup file.  Or better if this is torrented!\n\nBy the way, thanks for sharing this. You've done the humanity a favor!",
            "we love you thank you. you are the greatest",
            "The cheat sheet section is very good. Wasn't expecting a django cheat sheet tbh.",
            "Free???",
            "hello, can i have a link please!",
            "Save",
            "How long would it realistically take to go through all this? Lol",
            "How to save/store this? Any tips?",
            "Mil gya. Aab bas padhna baaki hain.",
            "500 TB is crazy",
            "If everyone commits to a section and eventually uploading it to a torrent file it’s not hard to keep everything backed up",
            "How do we know we went get fked after getting click baited .",
            "Zamm",
            "I was thinking that 2 TB is a max allowed amount. There's 30 TB tho in here https://support.google.com/drive/thread/218140513/need-more-than-2tb-google-drive?hl=en#:~:text=You%20can%20subscribe%20to%20more,Available%20plans%2C%20no%20other%20options.\nBut how is it possible to get 500TB?",
            "This is illegal! I love it! 🥰",
            "RemindMe! 6 months",
            "Not every hero wears a cape. Some help out on reddit",
            "Where is the Ethical Hacking stuff cant seem to find it",
            "Thanks. \nNow I need 500TB of storage",
            "The thing is there already so much resources on the web and its overwhelming to decide",
            "The fact that I don't have the bandwidth and storage to download this makes it more fun\n\nHey king, please keep backing it up!\n\nGod bless you",
            "Uhhhh this is incredible lol",
            "Please send meeeeee please",
            "Thank you",
            "damn...Damn...DAMN!!!",
            "Holy",
            "This guy is a legend",
            "Full of viruses and scripts",
            "Fantastic, thanks 🙏",
            "Not illegal as all of this is already out there",
            "Someone to share it seems that I have miss it",
            "this is crazy",
            "How do we get a mirror of 500 TB of data?",
            "Useful stuff in here for info sec too",
            "[https://github.com/Moado/The-Data-Scientist-s-Toolbox](https://github.com/Moado/The-Data-Scientist-s-Toolbox)",
            "What’s Helwan University doing there 😂",
            "Let's be real most of us aren't gonna give a 2nd look at these files.",
            "u/JustACornellian",
            "u/Adept-Explanation366\n\nu/Dash_Vandelay\n\nu/WannShav\n\nu/Familiar-Divide3214\n\nu/RoofMean5715\n\nu/ThatIndian15",
            "Can I get the link???"
        ]
    }
]