[
    {
        "post_id": "xuve3j",
        "author": "GanonOP",
        "title": "Microsoft freezing new grad hiring for 2023",
        "url": "https://www.reddit.com/r/csMajors/comments/xuve3j/microsoft_freezing_new_grad_hiring_for_2023/",
        "score": 693,
        "num_comments": 163,
        "created_utc": 1664830985.0,
        "selftext": "Found this on another server:\n\nhttps://img001.prntscr.com/file/img001/2QZGvqktQGu9brdbEGrkDg.png",
        "permalink": "/r/csMajors/comments/xuve3j/microsoft_freezing_new_grad_hiring_for_2023/",
        "comments": [
            "[deleted]",
            "Lmao when I was struggling for interns last year ppl told me “new grad roles will be a lot better because there will be less competition”",
            "I wonder if this is for all roles or just SWE. Nice to kinda have an answer on why the recruiting has been so quiet though.",
            "Why dafuq did i have to graduate this year.",
            "my application is still showing “in review” on my portal but i guess i’ll have to assume i’ll get rejected in the next few days",
            "damn just finished my interview today. hope this doesn't affect interns.",
            "Great. I’m so done finding a job rn and I see this. Just checked my portal rejected. I’m graduating in December  that too being an international student",
            "This isn't a freeze, this is normal for Microsoft and happens every year. \n\nThey fill their interview slots first come first serve, and at some point (usually by mid October, so it's slightly earlier this year) they have enough interviews scheduled that they know they will be able to fill their new grad class.\n\nIf somehow they do not manage to hire enough from their existing interviews, they will resume interviews... but that is very unlikely.",
            "[deleted]",
            "Mine says my application was transferred but it's said that for like a month",
            "You guys are fucked. I'm wishing every new grad who's graduating into this economy the best of luck.",
            "Woah Microsoft too, I thought this was the most stable company.",
            "dayum, more and more companies are going to stop hiring. I foresee a lot of new grads would be jobless during the first 6 months or so",
            "They sent me the same email about 2 weeks ago after my first interview. They said even though I successfully passed the interview they don't have any empty slots at the moment. Posted about it on this sub but it made everyone panic so I deleted it.",
            "Yeah I'm dropping out of CS then. Too saturated.",
            "ahh fuck makes sense for me too.",
            "rip",
            "[removed]",
            "Good everyone will work on Dex crypto project",
            "i just had my microsoft phone interview for 2023 summer internship man wtf",
            "welp im lucky to have interned this summer holy shit",
            "No wonder I am yet to hear back at all after my new grad PM phone screen 2 weeks. Havent received this email yet but I guess I will this week",
            "I applied on September 9th for swe new grad position. For now it still says \"in review\". I hope it doesn't change.",
            "Wasn’t getting callbacks anyway",
            "A lot of startups are still hiring. We just hired two relatively recent grads.",
            "Hope they don't this for interns as well :/",
            "Fml",
            "Does this affect regular SWE 1 applications? I graduated this past year (2022) so I don’t think I’m eligible for new grad apps",
            "oof",
            "Should I stay for another semester and graduate in December 2023 then?",
            "Same here, checked today and all rejected :(",
            "Ugh I had my final round 2 weeks ago and was wondering why it was so quiet. I guess this checks out.",
            "Just got my rejection mail for new grad 2023, I applied on 3rd day.",
            "Same. Applied for 2023 NG 1 month ago and got rejected even without an OA. I even have one year non-internship experience.",
            "I also got a rejection email today after finishing Codility OA 3 weeks ago. I was pretty confident with OA result since it was very easy & I ended up passing all test cases but anyway reject 😂",
            "Did everyone applying to new grad got rejected? I just got rejection email today",
            "I received the same email today. Had my first round 2 weeks ago",
            " I’m hoping csa intern roles remain open as they have a shortages of csa roles from what I heard",
            "Has anyone else not gotten rejected yet? Mine still says it’s “in review”.",
            "Damn sounds like there planning something big next year, I’ve got a bad feeling.",
            "We have reached the point of oversaturation for entry level positions fellas.",
            "They are ghosting me after we already signed the offer letter. I hope the won't withdraw it..",
            "Same!",
            "Where did you find this image? Also I applied to business roles and am trying to figure out if this applies to CS or all roles.",
            "tbh good on the interns.",
            "They are on a freeze for most jobs and did a small (less than 1%) downsizing recently due to lower than expected profits. Budget cuts happened in most departments between June and September. \n\nNote: this is just based on what I have read and heard elsewhere.",
            "Economic downturn means less hiring, even for the larger companies.",
            "what is the benefit of this intern?"
        ]
    },
    {
        "post_id": "qgcikm",
        "author": "adgant582",
        "title": "I got a position as the CEO for a FAANG but I failed my CS Class :(((((",
        "url": "https://www.reddit.com/r/csMajors/comments/qgcikm/i_got_a_position_as_the_ceo_for_a_faang_but_i/",
        "score": 685,
        "num_comments": 50,
        "created_utc": 1635272069.0,
        "selftext": "I don't know what to do guys! I'm so lost! I really needed to pass that class or my parents will disown me.",
        "permalink": "/r/csMajors/comments/qgcikm/i_got_a_position_as_the_ceo_for_a_faang_but_i/",
        "comments": [
            "did you know one of the main causes of erectile dysfunction is getting CEO for FAANG but failing any CS class?",
            "[deleted]",
            "Obvs you are a failure. You wont be able to get the A+ and br the zuck? Sorry to tell you buddy but you arent cut out for the industry.",
            "That's okay. It's only CEO. You'd be in trouble if it was CTO",
            "Failing CS is almost like a prerequisite for CEO job, you will do great.",
            "git gud",
            "Consider yourself lucky… I got a position as a test for my CS class but I failed my CEO for a FAANG :(((",
            "Lucky! I didn't get CEO at FAANG (board members asked me to write a hello world from scratch in only 48 hours) and I stilled failed my CS classes 🤢",
            "As somebody who actually failed intro to CS twice because I stopped going and now work at FAANG, this gave me a good chuckle, thx OP hahaha",
            "you were on the right track, just pass the object instead of the class",
            "Unlucko, we'll get em next time",
            "not the end of the world c'mon",
            "All this cuz of the person who posted about making Facebook but failing midterms. They were trying to show that there are things that go bad in their life too, but maybe it rubbed you the wrong way.",
            "[deleted]",
            "Haha another original joke post!! Good shit!",
            "I love this",
            "Cool story bro",
            "these kinds of posts need to deleted \n\nyou think you're being clever and funny, but you're not",
            "CEO as in Chief Executive Officer? You're going to be the CEO of Facebook/Amazon/Apple/Netflix/Google ??? Right off the bat?? How? \n\nTeach me your ways master",
            "This is not funny.",
            "Now this post makes more sense!\nSwwweeett! And congrats!!",
            "I feel you"
        ]
    },
    {
        "post_id": "1ajbye1",
        "author": "SatanicBeaver",
        "title": "I just need to keep applying",
        "url": "https://i.redd.it/46oq2uoqbqgc1.png",
        "score": 687,
        "num_comments": 17,
        "created_utc": 1707122528.0,
        "selftext": "I just need to keep applying",
        "permalink": "/r/csMajors/comments/1ajbye1/i_just_need_to_keep_applying/",
        "comments": [
            "Just when you guys were not looking, I applied to few more jobs.",
            "Bro. Between me and you. I think you need to keep applying.",
            "me after applying to 1 internship and not hearing back in .2 seconds",
            "Day 1 or 1 day",
            "op is down ~2 apps for posting this shit",
            "Keep applying where bro? to these fake job postings, which companies never want to fulfil **:**::::(",
            "Are you applying for jobs because you are unemployed or are you unemployed because you are applying for jobs",
            "real",
            "Real",
            "I just applied to when you guys were reading my comment.",
            "Nothing, I just have to keep applying",
            "so real",
            "Don’t give me hope.",
            "I really think OP just needs to keep applying"
        ]
    },
    {
        "post_id": "1bqy8w5",
        "author": "Resident_Rub_3395",
        "title": "Do you have to be a genius to become a staff engineer at FAANG?",
        "url": "https://www.reddit.com/gallery/1bqy8w5",
        "score": 687,
        "num_comments": 168,
        "created_utc": 1711742702.0,
        "selftext": "I saw this post on LinkedIn where one talks about someone else history how he has become a staff engineer by hard working.\n\nI was curious and looked up his background and saw that the had perfect grades in his bachelors (9.3/10.0) and masters (4.0/4.0). To be able to have such perfect grades, IMHO I think that he indeed must be a genius. \n\nWhat do you think about this post?",
        "permalink": "/r/csMajors/comments/1bqy8w5/do_you_have_to_be_a_genius_to_become_a_staff/",
        "comments": [
            "Hey, this is Raviraj, the person being discussed here. Btw I was surprised to see a trending post about me. 😀\n\nOP, no, I am not a “genius”. I know some of them! Getting good grades requires you to ace those tests and assignments. In retrospect, I knew what I had to focus on.\n\nAlso, to be fair, getting a \"perfect\" grade is overrated and adds pressure. I felt the pressure to not \"fail\" anything. Ideally, experiencing some failures is good as it helps you focus less on the \"grade\" and more on learning.\n\nBtw staff position is a leadership role, so it requires technical and people skills. I have already discussed this at length in the career story I wrote. Essentially, I learned from failures and mentors who showed me the right path.\n\nBy the way, I write about people skills in Tech in my newsletter: [https://newsletter.techleadmentor.com/](https://newsletter.techleadmentor.com/)\n\nAlso feel free to message me your questions on LinkedIn :)",
            "Don’t have to be a genius, but it certainly helps not to not be stupid",
            "A lot of smart people don't think they’re that smart because they’re constantly comparing themselves to smarter people. Most sane people would consider themselves kind of dumb in comparison to Nikola Tesla or Alan Turing. Also calling someone smart in some cases devalues their dedication. It’s the equivalent of dismissing the years of hard work an NBA all star puts in because they are genetically gifted. ",
            "You don’t need to be a genius to get good grades. Just learn from failure, study effectively, and capitalize on opportunities to get extra credit.",
            "A staff engineer is not an entry or even mid level, much less at FAANG... You need to be intelligent, proven, driven and sharp. It's not a positon you get for solving leetcode.",
            "Perfect grades is the “hard work” part.\n\nGenius is dropping out of college to create Facebook.",
            "[deleted]",
            "Everything he said is spot on. Being a genius isn’t the key, being a hard worker gets you way farther. Degrees and gpas get you your first job. Keep in mind a staff engineer you’ll have 10+ years of experience at this point, and no one cares that you got a 4.0 in college 15 years ago, rather they care about how you contributed to your organization and how you made it better.",
            "It is not just hard working. It's having luck with projects, working on your perf review, office politics and so on. \n\nAnd yes, you'll need to be smart too, and not only in purely technical sense.",
            "Is 9.3/10 perfect? What is that on a 4 scale",
            "It doesn't take genius to read textbooks and learn material.",
            "doesn't take a genius to get good grades. Don't fall for that. And making that much also takes a lot of luck. Opportunity and hard work are important, but not without luck. If all you're concerned about is the salary, stop comparing yourself. Someone will always earn more.",
            "I'm at Tech, and quite frankly it's not a hard school, and tons of students cheat during exams, especially in the master program.\nThat doesn't take away his achievements though.",
            "What you need to get promoted anywhere past L5 at those companies is mostly PR skills (knowing which ass to kiss and how to spin your achievements) and luck, it has almost nothing to do with your technical skills and knowledge or “working hard”.",
            "\"To become a staff engineer at FAANG, you have to apply 5 years ago when they actually wanted to hire more engineers\". FTFY",
            "Put another way, you can be a genius and have terrible work ethic and not amount to anything at all\n\nBeing a genius doesn't mean everything is handed to you, you have to do the same shit as everyone else. Maybe you grasp the concepts easier, but you have to actually do the work.\n\nYou can also be a genius and be born a daughter to a poor farmer in rural Ghana with literally zero hope of even receiving an elementary education so there's also that.\n\nGenius doesn't mean shit for success without the drive or the opportunity to succeed.\n\nI hope international students, who are greatly affected by the OPPORTUNITY part can reflect on that and heal their self worth if this bad market doesn't work out",
            "You cannot get to staff at Big Tech with technical knowledge alone.\n\nYou have to get the right projects with scope and influence, and more importantly, your management has to give you credit when you execute on it.\n\nFor every person that made Staff at Big Tech there are probably 100x the number of seniors who couldn't get there for no fault of their own.  They just didn't get to work on the \"high impact stuff\" (like working at Google and shipping a project that's decommissioned 6 months after it hits production).",
            "You have to solve dumb leetcode questions to be at meta. Not necessarily have to be genius",
            "the way i see it, talent is a multiplier; anyone can probably get into microsoft but at differing amounts of effort\n\nat the very least, i don’t like to think about talent vs hard work because if i think abt it too much i psych myself out and give up before i even start 😭😭😭\n\nwho gives a shit about talent? if u r good at ur job and u fit well at the company u apply for u will get in likely. thinking about it won’t change anything no? ",
            "You're not going to get the dopamine from the work to sustain the above and beyond level of that kind of work if you aren't gifted enough to be getting it right with great consistency.\n\nIt's great these guys don't always think they're automatically geniuses just because they're winning, but it's almost a rude type of humility when they don't want to recognize that they are, in fact, quite intelligent.",
            "4.0 at Georgia Tech is wicked work 💀",
            "No you just need to leverage nepotism.",
            "When hiring I ignore grades.\n\nMy context is that I went to a college where at least 30% of us needed.to work and study because the alternative was to drop out of.college.\n\nSo I saw the effect working 20-40 hours per week had on ones grades, no matter how hard you worked * the privileged ones\" had a huge advantage of having those extra hours available week.\n\n\nAnd then having good grades and being good at work are two separate skills ( unlike what idiots in both extremes say).",
            "That college is India where he did his BTech is like one of the prestigious ones in Mumbai",
            "Just the fact that he got into Veermata Jejabai institute speaks volumes about what this guy is capable of. The competition is insane. The hard work required to ace those tests is mind boggling. Once upon a time,  getting in there was my goal too.",
            "BTech from a degree mill in India, Cash-Cow Master in the US (Who tf does a master in the US anyways except for internationals?) and 2011, right at the beginning of the big tech hype. He was just lucky. In today's market he wouldn't stand a chance.",
            "Lol, almost all Indian Students have this grade. Don't stress. Indians are the best LABOURERs. Even You can do it. Just learn the corporate culture and climb the ladder.\n\nPs: I'm Indian. He took 14 yrs to become a Staff engineer lol.",
            "if you think getting a 93% makes someone a genuis, its already too late for you",
            "Life is too complicated that's the answer.",
            "the guy who wrote the post (Ryan Peterman) made it to staff in like 4 years or something crazy",
            "No you don't need to be a genius but you need to work hard and work smart and some elements of luck. Getting to that level requires more than just individual ability. Being at the right place at the right time and having the right skills helps immensely.\n\nSource: Was staff eng at Meta",
            "Smart and intelligent aren’t the same thing. Anyone can become smart, most people that do poorly in college or have a hard time retaining information from their classes typically just have poor learning strategies or time management skills. It can take months or sometimes years to find the best learning strategies. \n\nAlso, if he worked really hard in middle school and high school that would help prepare him for college, especially if he started coding in high school, half my coding classes I’ve taken so far I got A’s in without trying because I already learned the material from the 2+ years of self taught coding a did before college so he probably had previous coding experience going into college which imo makes your life wayyyyy easier. \n\nIdk what he’s college life was like but imo getting tutors, doing study groups and going to office hours helps a lot. \n\n\nSo I don’t think you need to be a genius to do well in school you just need work ethic and proper learning strategies.",
            "Yes or close to it",
            "Perfect grades are generally a sign of hard work and not a sign of genius.",
            "really depends on your definition of genius. staff engineers in faang aren't geniuses but i'd say are definitely within the top 10% of worldwide iq, and perhaps higher",
            "I'm not good enough to have imposter syndrome(or am I?)",
            "FAANG hires \\~1% of the applicants.\n\nYou need to be reasonably smart and prepared to solve medium/hard Leetcode tasks.\n\nBut more than that you need luck. I personally wouldn't waste my time on these companies - they aren't the best places to work and the total comp figures (600k) are misleading.",
            "I have to imagine being smart helps more than it hurts.\n\nAbove that, though, the biggest thing is opportunity. This is what is missing in the world. Being the smartest person alive doesn't mean anything if you're not allowed to use that ability.",
            "It’s true, I’m not a genius, I just work hard, I’m not afraid to ask questions or dive into any part of the stack.",
            "How are grades related to a genius? I would say they suggest hard work.",
            "In my experience anyone who use term FAANG to promote something is a total scam",
            "r/linkedinlunatics",
            "It’s 99% hard work",
            "He got an internship at Microsoft ... that's already better than I could do.\n\nIt's not so much that you have to be a genius,  but you have to really really love what you're doing and be passionate about it and show it .... otherwise you just won't have what it takes.\n\nI'm honestly not that into it. I do it and it pays my bills but once I clock out I don't think about it or do any side projects or any of that shit until it's time to clock back in again. It's just a job for me. It's not a passion.\n\nSo do I have what it takes? No. I don't. And I haven't even bothered to try faang as a result.",
            "I just want you all to know that I happen to receive this notification and checked this r/csMajors and these comments are just so depressing.   It's like you are all playing a really boring video games with these rules around grades/interviews/pay grades/technical vs leadership, etc etc.    Maybe think about what you should focus on?\n\nIf you are in your 20s, maybe you should start thinking about just how far off you are from where you could be in terms of actually having skills to do more than just what little you know how to do.  Focus on actually becoming truly competent and then creating real value in the world. \n\nWhat's the point of playing the this dumb ass game you are playing even if you end up with  a lot of money.",
            "If by genius you mean people like Einstein, da Vinci, Alan Turing etc - well of course you don’t need to be on that level.",
            "https://preview.redd.it/8w3l5g7ioerc1.jpeg?width=643&format=pjpg&auto=webp&s=f5cd84e433cc8c3c5635d25ea14bf6c554261727",
            "I had perfect grades in undergrad/grad. I’m by no means a genius. Grades have little to do with intelligence. It is a very specific ability to achieve results in an academia environment.",
            "It's never been a genius who will get successful in life, someone who did a bunch of leetcode, someone who get full grade in their university. There are plenty of other factors people are often forgotten about.",
            "To be fair, if you think you need to be a genius to get an A, then you don’t need to be worrying about who is and isn’t a genius",
            "I would also point out that you can put literally anything on LinkedIn nobody is checking - and there is a million ways to calculate GPA. Is this person counting all his courses? Just his top 30? Just his last year? Just his major? How hard were the classes he took what was the course load like? What percent to gpa scale is he using? \n\nNot to diminish him at all - he probably worked very hard for where he got and good for him, just pointing out that Linkedin like all social media is a false reality. You can say whatever you want to create the best look for yourself",
            "This guy is actually a friend of mine. Extremely talented and respected amongst his peers. \n\nP.S. 600k is not uncommon for FAANG",
            "Grades have nothing to do with intelligence and everything to do with the amount of time you’re willing to spend lol",
            "Academics tend to be a proxy to general intelligence.\n\nI went to state school and nobody I graduated with works at a FAANG.",
            "“I don’t have to try to get good grades because it’s hopeless. Only geniuses do that. I can be mediocre for the rest of my life and I never have to feel bad about it!”",
            "That guy is a douche, trying to become an influencer. Don’t fall for it and report his posts."
        ]
    },
    {
        "post_id": "smzxb8",
        "author": "Mia_Kalipha_Bf",
        "title": "After failing 7 Final rounds, Finally received an offer from Microsoft SWE New Grad",
        "url": "https://www.reddit.com/r/csMajors/comments/smzxb8/after_failing_7_final_rounds_finally_received_an/",
        "score": 693,
        "num_comments": 79,
        "created_utc": 1644265502.0,
        "selftext": "I will be graduating this May from a no name state school.\nFailed Amazon, Google, Facebook, Hubspot, Deshaw, Doordash, and Asana.\n\nAll these interviews were from Aug 2021- Dec 2021. I used the christmas break to grind very hard for my msft interview by buying Grokking the coding interview. I'm an international student so communication/english has always been one of my weaknesses.\n\nKeep grinding!",
        "permalink": "/r/csMajors/comments/smzxb8/after_failing_7_final_rounds_finally_received_an/",
        "comments": [
            "Great job, Mia_Kalipha_Bf",
            "I’m surprised you didn’t apply to pornhub. Username would check out. Congrats on Microsoft, I’m certainly more than microjealous.",
            "Congrats!!",
            "Bro, I am international too, would love to talk to you for a few minutes. I’m graduating this December. Can I dm you ?",
            "Congratulations! how was the interview process for Microsoft?",
            "Congratssss!! I’m a fellow international student going to MSFT as SWE intern next summer too!!",
            "Congrats my goal is to be a back-end dev at Microsoft but haven't been able to get an interview or OA from them for two years",
            "Congratulations! Don’t be too hard on yourself! From the list, the only company proceeds with interviews for me is Facebook!\n\nAlso, I heard Microsoft will apply for PERM immediately after 60 days so that’s great news ;)",
            "Microsoft is one of the best companies on that least anyways. Congrats!",
            "Same intl student, and got my offer two weeks ago, same as you been grinding the whole winter and finally got paid back. Congrats! And I’ll be living in Redmond too after graduation.",
            "Congrats! Which location?",
            "Congratulations!",
            "Honestly, just failed my first final round and it really feels like being punched in the gut",
            "Congratulations! Please post your anonymized resume for the benefit of the community 🙏✌️",
            "May i ask where we're you going wrong in those final rounds?",
            "congratulations!! May I dm you?",
            "god username tbh",
            "Ugh just went through my interview through the same program two weeks ago. Pretty sure I got rejected because I reversed a string in linear time instead o(log(n)) time. One guy kept asking me about what I was going to write before he'd let me write it, was really disruptive.",
            "Do you have internship experience? Where? \n\nI'm intl' and still trying to get an Internship... feeling more pressure recently",
            "I am an incoming freshman (international). I had a few queries regarding the job market. Can I DM you?",
            "my hero",
            "Congrats! Hard work paid off!",
            "Good job, at least u got that many interviews. U must be very talented",
            "I am an incoming grad student (international). Have some queries regarding the job market. Can i dm you?",
            "Congrats on your new role at Micorsoft! Since you already got into Microsoft, would it be possible if I can pay and co-share the Grokking the Coding Interview with you 👉👈 I want to buy it but it is a little bit expensive for me 🥺",
            "I can feel you",
            "Just wanted to know if you were allowed to use Python during the interviews?",
            "Deshaw for swe?",
            "[deleted]",
            "Good job man!",
            "Congrats, bro! Did you get a say in the location at all?",
            "Congratulations",
            "Woaahh... that resume must be OP! What's it like? CONGRATS!!!",
            "Congratulations! Would you say that buying Grokking the Coding Interview was worth it?",
            "Congratulations! Would you have any advice for Hubspot?",
            "I am also from a no-name school, how were you able to get interviews from all these big techs?  The only interview out of the ones you had so far was facebook, congrats btw!",
            "Congratulations!! I am also international student. Same story.",
            "Man how these international students be getting jobs out here, and imma be grinding and getting shit.",
            "Congratulations",
            "Congrats! Just dm’ed you",
            "Congrats ! Well deserved",
            "May I dm you? I have Microsoft interview soon!",
            "Any advice on how to prepare for Microsoft interviews?? (Phone and final)"
        ]
    },
    {
        "post_id": "s9628x",
        "author": "User1862719",
        "title": "Guy in my class faked his resume and got FAANG interviews and an offer.",
        "url": "https://www.reddit.com/r/csMajors/comments/s9628x/guy_in_my_class_faked_his_resume_and_got_faang/",
        "score": 684,
        "num_comments": 209,
        "created_utc": 1642753537.0,
        "selftext": "So I was talking to a guy in one of my courses about summer internships and how I’m struggling getting interviews and all that. He told me he got an Amazon offer and showed me his resume. \n\nHis resume was insanely good compared to mine and we’re both sophomores taking similar courses. He then showed me his old resume which looked similar to mine(simple projects, school projects, hackathon..). \n\nThen he tells me his projects are all cloned projects off GitHub. He stalked people that got FAANG internships or currently work there and search for their GitHubs and clone projects. He even faked his volunteer experience and school clubs. I was pretty pissed off but just laughed it off with this guy.\n\nHe minimally studied the projects and hoped he didn’t get questioned about them too much for interviews. He got 3 FAANG interviews/OAs and multiple other interviews from mid-size companies. He’s a leetcode grinder so technical interviews or assessments weren’t a problem for him. \n\nNow that he got a FAANG internship, he’s basically set to get better opportunities in the future. He’ll eventually only have internships on his resume and he’ll probably get a return offer before grad. \n\nIf this guy used his normal resume he probably wouldn’t get any of those interviews and would be in a similar situation as me. I’ve been fuming over this the whole day.\n\nAnyone else know of this happening where people fake resumes? And does this happen often where people clone GitHub repos and claim them as theirs?",
        "permalink": "/r/csMajors/comments/s9628x/guy_in_my_class_faked_his_resume_and_got_faang/",
        "comments": [
            "Unfortunately, I can nearly promise that nobody even looked at his GitHub. Your classmate coded in the interview and did well enough to get the offer.",
            "It’s kinda ironic how companies emphasize Leetcode over personal projects which are more reflective of actual software engineering work.\n\nWhile it’s not fair to those who actually put in the work, people that copy projects still get offers because grinding Leetcode is simply a more efficient use of time than building an app in today’s interviews.",
            "Eric liu",
            "The ethical bar of some people on this sub is literally on the floor",
            "He is a true software engineer. He knows where to copy the code from. That’s why he got hired.",
            "Faang recruiters dont look at github.",
            "I wonder how many people who write posts about having imposter syndrome...  are actual imposters.\n\nThey come into Reddit for their dose of “Aww it’s ok, we all feel that way at first”. \n\nLol Jesus.",
            "Don't hate the player hate the game.",
            "I mean most recruiters/hiring committees assume personal projects are tutorial clones or shitty apps thrown together last minute in a caffeinated blitz at 4 in the morning during a hackathon. This is why they are a very small factor for intern hiring, especially at FAANG. \nSchool name, gpa, research experience have higher weight. \n\nThere’s no reason to be angry, it’s just the game. Throw up 2-3 shitty apps, polish them up, and apply your heart out to FAANG and you might get an interview as well.",
            "At the end of the day, there's more to life than working at a big technology all your life. For me, I consider projects as a way to put yourself out there, do greater things rather than just merely getting a job. At this point in our world, innovation is what sets you apart so don't let that bother you and keep doing your things and learning.",
            "Holy shit I wanna be that guy. can u give me his github?",
            "I mean the fact that he was able to pass technical interviews probably shows that he is qualified. Not that I condone doing something like this, but anything to get your foot in the door",
            "If they find out, he'll get fired. You could grief him.",
            "either he will struggle in his role or not cause truly some shit at home CRUD apps will not compare to the training and mentoring a FTE would give before u start the role but i see how it’s unfair. oh well man don’t hate the player hate the game",
            "Now you know why leetcode is a thing - personal projects can be fake easily",
            "I've been at your place too tbh. A guy took a project of mine, made it his own, and got an intern offer from a good company (when I was without a job). I was furious for days :P  \nI personally know a guy who \"**forked**\" (not even clone) other's projects, added it to his resume, and got a Microsoft intern offer which got converted to full-time later. This is more common than you think.    \nI can respect the balls of this guy tho...going to the interview with a vague understanding of the very things that made his resume. As they say, High-risk high reward.",
            "People talk a lot about personal projects but I’ve literally never been asked about them in any FAANG tier interviews. You said it yourself, he’s a Leetcode grinder and he rightfully passed the interview.",
            "Work smarter, not harder! 🧠",
            "He was creative enough to identify a way to get ahead, and thought it would be worth the risk to do so. Did you think to do this? If you did, would you be able to stomach the risk? If not then you really shouldn't be mad. It's like seeing people on wsb earn a lot off a dumb play - if you aren't smart enough or risk taking enough then why are you mad? The other alternative is to continue applying and hope you get a great interview, or work on projects that are pretty impressive.",
            "“Smart boi”, says the interviewer",
            "this sucks man!",
            "Did he fork these projects or just fucking re-upload them under his name",
            "this is the second time ive heard about something like this. the first time was a kid (internet) famous sort of for doing this at a university around me.\n\ntechnically it makes sense for faang since they quiz u on problem solving, but i think it should be a standard now to make an actual youtube video for the project. should help a little bit with the plagiarism.\n\n**edit:** yea the dudes name was eric liu lmao",
            "So, here's the thing.  Some people cheat and lie.  Some people have no problem with it because they don't value being honest and see relationships as an opportunity for gain.  Some people do it but feel severe anxiety over it but are too insecure in their worth as a human being to live up to their own values.\n\nUltimately, the people who are okay with justifying lying and cheating typically also do well behaviorally on interviews since they tend to be manipulative.  This is just one small area they'll have an advantage.  Someone who finds lying acceptable isn't pleasant to have any sort of long term relationship with, work or otherwise.  They're not trustworthy, and social relationships are built on trust.\n\nAnyone who believes you need to lie or take advantage of others or cheat to be successful should consider what it is about themselves they find lacking that they don't think they'll be successful by being authentic and genuine.\n\nSince this is a common thread topic: sure, you can cheat on code assessments and not get caught, but in the end you'll have to live with yourself knowing you couldn't do it on your own.  Sounds like the start of imposter syndrome to me.\n\nSure, like OP's classmate, you can lie on your resume to make it more impressive than you actually are, but then you'll need to cope with the fear of being found out and fired, the fact you as your authentic self couldn't get the interview, and have sacrificed your character for silly ego fodder.  Sounds like another source of potential imposter syndrome.\n\nNo one can take your integrity from you but yourself, but the moment you let it go, you also need to accept you find yourself not good enough and wish you were a better version of yourself that you believe you are unable or unwilling to become.  Just do the work to be the better version of yourself.  It's a lot less work, effort, and stress than keeping up buckets of lies.  Really, anyone justfying this, please seek therapy before entering a long term relationship with anyone other than your laptop.  Campuses often offer free sessions through their clinical psychology programs.  You're just fine as you are.",
            "If he passed the interview then he’s good enough for the job",
            "[deleted]",
            "🥅 and he scores",
            "OP I have been at your place too. For a new grad position though, many of my classmates faked their resumes to get interviews they know how the system works and just took advantage of it. There are some of the classmates who don't even know still any basics of programming. They took advantage of Amazon's new grad interview system which is for now \n\nOA > If you clear all test cases > 30 mins interview on your solutions (All OA answers they either found on internet or asked friends to solve them)\n\nElse > 3 45 minutes interview.\n\nLooking at these few guys who got AMAZON like this. Many others just copied them and did samething and now will enjoy hefty pay + FAANG on their first resume without any doing any internship or projects. \n\nSo, I would suggest you keep grinding, sometimes you start late then others it doesn't mean you wont get it. Time will come for you too. What I will suggest if you think personal projects are the reason then see what others who got interview are doing and try to do similar level projects that way you are learning new stuff + improving your resume and eventually land a FAANG.",
            "Amazon has a high firing rate and PIP rate. See how he does in a few months.",
            "Do recruiters really not look at applicants' githubs? Because if that's the case, I feel like I should focus on making the resume fancy rather than working on custom projects. Plus copy others on github.",
            "lol hard not to get angry with the dude, he was able to prove his worth according to their metrics. Honestly, fuck these companies",
            "issa cold world out there, dude did what he had to",
            "Don't be furious. Sometimes you have to fake it till you make it",
            "What a coward",
            "Just do it",
            "Interesting",
            "tbh, happens more often than not. Don't hate the player hate the game lol!",
            "Don’t hate the player, hate the game 🤷🏽‍♂️",
            " Surely FAANG recruiters are aware that this is a possibility and actively screen for it? I'd hate to think my project had been copied and used by someone like this.",
            "Why are you mad at him? He played his cards right and succeeded.  Shit, i’d probably do the same if I was him too. \n\nHe knew how to gain the system and used it to his advantage.",
            "Yeah I mean you see the people like this all the time. It's unfair but the projects can't really be validated and in most of my interviews, they don't even ask about them anyways. And if they ask about it, they mainly just ask high level questions about design rather than any code questions. To be honest, I think most projects are \"copied\" to a certain extent since original projects which are technically challenging are hard to come across. Either way I agree that it is \"unfair,\" but I wouldn't but any more time into thinking about it anymore. Keep on the grind and good luck!",
            "Sigma Grindset",
            "To be honest... If he was able to pass the technical interviews, it's tough for me to be pissed he had to lie in order to get them in the first place.",
            "You should turn this cheater in. This person needs to face the consequences of their actions, or else their entire career will be founded on lying and stealing.",
            "Honestly, good for him!",
            "Is it really wrong to copy like OPs friend even if you change the subject a bit or add a feature?",
            "You're not going to tell us what he did to help us out bro? 👀",
            "Lol @ all the Asians supporting cheating.",
            "No matter where you are, there will always be con-artists. I know someone who promoted several levels in just a couple of years, and is is now upper management in IT. The person directs a large group of IT people without knowing what the cloud is, and opening help tickets so people can fix the monitor by pressing the power button.\n\nThe person's unofficial advice is to say anything on the resume, because they are never verified by HR where we work.",
            "Yeah I mean it’ll work out for him as long as he hides it well but if he ever slips up and gets caught there’s gonna be hell to pay",
            "95% of my friends \"copied\" or followed along project tutorials to put something in their resume. Imo as long as you understand it and credit the original project in someway then you're good.",
            "He is a leetcode elite and that's all that mattered. He also aced his behavior questions in those interviews.",
            "Know someone that started getting a flood of recruiters reaching out once they changed their location to San Francisco on LinkedIn. (they weren’t actually from SF)",
            "I've gotten a FAANG role before. I can't remember being asked about my projects or classes much. The hiring process is kinda messed rn, especially with everyone doing leetcode.",
            "Bruh if everyone else doing it then you know what to do",
            "Lmao"
        ]
    },
    {
        "post_id": "1c7xu8m",
        "author": "Cute-Moose-4250",
        "title": "Networking is the new prostitution ",
        "url": "https://www.reddit.com/r/csMajors/comments/1c7xu8m/networking_is_the_new_prostitution/",
        "score": 687,
        "num_comments": 108,
        "created_utc": 1713535796.0,
        "selftext": "Obviously, for most, you must network in order to get an internship otherwise you most likely will not get one. It doesn’t matter what skills you got, as long as you can network; you will most likely get the job. So basically, networking is the new form of prostitution. Suck some dick for money. Glaze others for money. In the end, it doesn’t matter the size of your breast, as long as you can suck, you’ll eventually get paid",
        "permalink": "/r/csMajors/comments/1c7xu8m/networking_is_the_new_prostitution/",
        "comments": [
            "Most sane csmajors student",
            "Wait, we are only supposed to metaphorically suck??",
            "New role unlocked - behind a Wendy’s",
            "Somebody give this man a job",
            "I mean if you consider that prostitution then you could compare anything to prostitution",
            "If I had the choice of 6 months of studying LeetCode for the chance of an L4 position at Meta or a brutal gangbang by the Meta executive team for a guaranteed 6 month position I would choose the latter.",
            "True and that’s exactly the reason people who don’t  know how to code have higher chances of getting the job cause most of them compensate their lack of CS skills with their social and networking skills.",
            "You can network much more efficiently if you use the middle out algorithm to give handjobs optimally.",
            "plough rock worry ossified busy zesty tender obtainable continue nine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I knew networking is important but equating it with prostitution makes me think about networking differently, bruh this was too deep",
            "You seem to be really flustered with networking. TBH, I don’t like this networking thing either.  \n\n We all talk against nepotism (getting jobs by being related to someone) but encourage people to network so that they can get a job by knowing someone, networking is good but nepotism is bad.  Nowadays, good grades is not important, good work is not important. I see it in big offices too, all that is working nowadays is how you can package something and present it nicely even if it is a bare minimum work you did, nobody cares to look beyond the surface. Social skills are in trend nowadays, for how long idk but I hope in ends soon so that real talented people get their dues.  I see so many great resumes nowadays having a hard time landing a job and it breaks my heart everytime to see hardwork not getting recognized. I believe that real talent will get recognized sooner or later, just hang on people and keep swimming. The world can’t be that cruel. \n\nI would like to get a job because I am talented  enough not because I know someone.\n\nEdit:\nSorry to all those for networking. I know it’s a sad state the world has evolved to be but the world is not going to take a step forward by people with less skills who can present things better but with people who can actually do the work. It’s time this should end.",
            "Bless your heart 🥹",
            "I guess a blowjob’s better than no job",
            "Actually true. It’s a glazing competition, just don’t forget to spit on it",
            "I'm not sure there's a single career that's less networking reliant than CS.   That isn't to suggest cs doesn't benefit tremendously from it.   It's that CS is one of a handful of fields that you might survive without doing much of it.  ",
            "CS Major when asked to socialise. \n\nOr when a CS Major students learns that cooperation is how many species have survived or progressed.",
            "There has to be a buddy subreddit for CSE people right? RIGHT??",
            "\"Talking to people in my field and making friends is like chattel slavery!\"\n\nCalm down, loser.",
            "Damn bro 😂😂, u really came thru with this one... Had me laughing the whole time...",
            "“You need to meet other professionals and make connections in your desired field”\n“OK FINE, I will start sucking peoples dicks”",
            "There's a lot of alpha in sucking dick in SF through grindr\n\n- a random tweet",
            "How to do networking?",
            "It kind of makes you wonder, do you really know people at all if you don’t know them in the biblical sense? Carnal knowledge is a big deal.",
            "It helps if you understand the OSI model.",
            "Literally, it's 20% merit-based, 80% nepotism.",
            "What is it with today, first I see a post on LinkedIn meming about how to use OnlyFans to get tech jobs, now this?",
            "No prostitution slender under my watch!",
            "You didn't suck it literally. Or.. did you?",
            "I see networking as a group of people that share interests and objectives. It IS NOT posting all day on LinkedIn and send requests all day, it IS NOT going to conferences and being an attention whore, this is pathetic as fck. It IS NOT being the teachers pet because like the latter is pathetic. For me networking is knowing someone in the bar make some friends and coincidentally he works in something you are interested. Even this is more worthy than being an attention bitch.",
            "I mean there's nothing new about it.  It's always been a who you know/who knows you kind of world.  \n\nDefinitely does still matter what's on your resume though.  Sometimes you have to give people at least something to work with.",
            "It's much easier to network if you are good at what you do",
            "Ah yes the classic manic episode categorized by cynicism, delusion and a narrowed view of the world. I’m certain I’ll find you shouting this at me while walking along market street in downtown San Francisco",
            "New?  Do you think people weren't been sucking dicks for jobs in the past?  In fact, the dick sucking being done now is perhaps the least literal that it ever has been.",
            "Always has been",
            "what an NP-complete reduction",
            "Totally disaggree with OP's opinion. Networking is a basic soft skill everyone should have and you should gain it as much earlier as possible in your career. Just be nice and keep in touch with people that has similar interests and jobs with you. Networking is not flattery.",
            "Suck Zuch’s Zucchini and you shall go far - Warren Buffet",
            "Bro you can get internships without networking",
            "csmajors when you have to interact with people",
            "Sad but this is so true",
            "that's the reason why girl with cs major are performing better than their male colleague. It always helps better when you are beautiful and having a 32DDD or higher. It makes you more competent wink!",
            "CS majors realizing talking to people is an essential skill",
            "You are really gonna struggle in your career.  Soft skills are as important as hard skills.  You have to learn to work with other people and not denigrate things you aren't good at/don't like.\n\n\nAnd sure, we all have to work for the man/customers to get paid.  So we are all prostitutes/business people - but I like to think that we are in a place where it is legal, there are lots of protections, we do it by choice, and there are no moral judgments.\n\n\nAnd your misogynism is showing."
        ]
    },
    {
        "post_id": "16zx38i",
        "author": "Bitter_Dance8626",
        "title": "Offer Rescinded due to \"Vaping\"",
        "url": "https://www.reddit.com/r/csMajors/comments/16zx38i/offer_rescinded_due_to_vaping/",
        "score": 680,
        "num_comments": 58,
        "created_utc": 1696449845.0,
        "selftext": "The funniest thing just happened to me and I wanted to share:\n\nFor context, I was given a verbal offer from a company but was still waiting on a few others so I asked to meet with another team member to buy myself some time. The meeting went pretty well, it was with an older woman who was pretty pleasant. I think she didn't understand that I had already received an offer since the meeting was just a carbon copy of my actual interview but no big deal.\n\nI then scheduled a call with the recruiter since I had decided to go with another company, I was going to use this time to reject the offer. I called the recruiter today and she told me that my offer had been rescinded due to the \"use of a vape pen\" during my interview. I was really caught off-guard, I probably should've denied it but I was so shocked that I just started laughing. It's not a huge deal since I wasn't going to go through with this company in the first place but they probably think I'm crazy for vaping during my interview and then laughing about it.\n\nIn hindsight, I was drinking water through a straw lid water bottle which I guess looks like a vape on Zoom??? I'm kind of embarrassed that I didn't try and defend myself but I literally just said \"no worries, have a nice day\" and then hung up LOL",
        "permalink": "/r/csMajors/comments/16zx38i/offer_rescinded_due_to_vaping/",
        "comments": [
            "I've been encouraged to send a follow-up to the recruiter so here's the draft. Thoughts?\n\nHi Recruiter,\n\nI appreciate you taking the time earlier today to talk to me and I just wanted to follow up on our conversation. I think there was a misunderstanding during my interview—I have a straw-lid water bottle that I used which could possibly resemble a vaping device, I've attached an image of said bottle. I believe that somehow Interviewer came to the assumption that I was vaping. I would have gladly clarified this during our conversation but it wasn't brought up.\n\nI do not use vape pens and I would never engage in such behavior during an interview. I didn't mention this during our phone call earlier since I was extremely surprised by the unexpected accusation. \n\nI am not looking to have the offer reinstated. I had great conversations with both Interviewer and Interviewer and I appreciate the opportunity given to me to learn more about Company!\n\nBest regards,\n\nMe",
            "bad culture fit. i should be able to rip the penjamin during daily standup /s (kind of)",
            "My bad I skipped the last paragraph",
            "who tf interviewed you bro, a TSA agent?",
            "A straw lid water bottle looks like a vape to her?",
            "Lol did they not think like, where is the smoke?\n\nIronically I have vaped a lot at work, sometimes had two pens at once, no one cared.",
            "These companies and recruiters are so cringe. Meanwhile they're probably having extramarital affairs and all kinds of High School level drama. Pathetic.",
            "Don’t vape during interview bro /s",
            "You should just email two pictures.\nOne of you drinking with just the straw showing, and then another where you can obviously see it is a cup. No words.",
            "You should've told them it was a straw",
            "Congrats on going to a better place then 👏",
            "okay but to everyone else in this thread, please don't vape in the office. it's the same shit we give to older people and foreigners for smoking indoors.",
            "I’d still email them to explain and maybe show a pic of the water bottle. Only because I’d rather have them making fun of her instead of me I guess.",
            "I really think you should let them know they were wrong. They failed not you. They should know that.",
            "Lmao I had some candidate open their porn folder in an interview once. \n\nDidn't really hold it against him or mention it to the hirint committee. Mistakes happen.",
            "Vape bad, getting shit faced drunk Friday night absolutely okay",
            "[deleted]",
            "I vape in my cube with a smoke detector above me, no gives a shit.",
            "So bong hits are right out.",
            "Fuck that company, you don’t want to work at a shitty micromanagey place anyway",
            "Did they ever respond?"
        ]
    },
    {
        "post_id": "14tesrq",
        "author": "animen_z",
        "title": "just got fired from my internship",
        "url": "https://www.reddit.com/r/csMajors/comments/14tesrq/just_got_fired_from_my_internship/",
        "score": 677,
        "num_comments": 132,
        "created_utc": 1688753524.0,
        "selftext": "I was participating in a data science internship at a company through a program at my school.\n\nWhen I first got there, I was a bit surprised by what exactly we were doing. We were tasked with creating an API, which I thought was different from data science, but my bosses assured me that it was an important step in laying the pipelines for the project. So we create the API for the first few months, which is a few weeks behind schedule and suddenly my partner in the project leaves to go to another internship. The internship I'm doing is a two-parter, starting in the Spring and going through the Summer semester. My partner leaves the project at the end of the Spring term.\n\nAfter my partner left, I was doing a lot more work on stuff I didn't understand and got little work done. I was losing interest in the project and was very confused about what I should do. I felt like quitting since I was being put under a lot of pressure to finish the project by the deadline to present our results plus the stress of taking 3 very challenging summer courses (Algo, Software Design lab, and Programming Langs).\n\nI should note that I was not without blame. Throughout the internship, I made about 3 miscommunications which warranted some hefty emails from my bosses telling me what I did wrong and how to fix it. I should also note, that my bosses were some of the most professional, patient, and intelligent people I've met, so working under them was a great opportunity. No shade to them at all. I just don't think we were a great fit to work together. They pointed out how I didn't understand what Data Science was. I wanted to work at a lab or something with a small team or with a professor, but I think the company environment didn't do me justice.\n\nAn hour ago, they asked me to hop on a call and tell me that they no longer want to continue this internship. I felt like this relieved a lot of stress for me, but I also felt a bit down cause I just got fired for the first time in my life.\n\nTo sum it all up, I got fired because of a combination of lacking interest, losing a critical team member, and an environment I wasn't expecting.\n\nWhat should I do now? Any advice to handle this helps. Thank you.\n\n&#x200B;\n\nEdit: Puncuation",
        "permalink": "/r/csMajors/comments/14tesrq/just_got_fired_from_my_internship/",
        "comments": [
            "The one thing I appreciate from your post is your self awareness. It's commendable that you're aware of exactly what went wrong and you're acknowledging it. \n\nIt's fine that you didn't like your internship. Most of us don't. That's how you explore new fields!\nThe field of Data Science is huge and I'm sure you'll find your fit soon.\n\nKudos OP!",
            "Lol why are people attacking the intern. As long as you put some effort, it is okay to be confused and not know what you’re doing, including even some miscommunication. The company posted the position and by doing that, signaled they were ready to train an intern at a loss (like almost all interns). Especially with this economy, it does suck when a company overestimates their capacity to have interns, but the fault here is really on the company (but I don’t blame them, sometimes it’s unavoidable). OP didn’t really do much wrong (unless those mess ups were like massive)",
            "One thought for the future is that you shouldn't be taking 3 difficult courses while doing an internship, after this I would suggest you not take any courses while on an internship, it's too much to handle and definitely drained a lot of your energy that you needed to be spending on your internship. You'll be okay, at least you got that internship and learned from it!",
            "A big hidden lesson here is to not be too greedy. I honestly don't think taking 3 classes while doing a summer internship is a great idea, esp since the work you put in vs. what you get out is not linear (prob some exp or quadratic curve)\n\nI made that mistake in the past and disappointed some folks. It's important to not overestimate what you can take on, be proactive to prevent yourself from feeling demotivated (by consulting others), and to be relentless with your communication so that everyone's on the same page.",
            "I don’t mean to roast you, but what made you think taking 3 major specific courses with an internship would be a good idea? Sorry, but I think this is the reason you got fired. If you didn’t have those three courses, you could have dedicated your time entirely to the internship, and prob done a lot better. I don’t think this was a skill issue. Anyone whose skilled would still suffer and struggle, given the fact that they have to go home to 3 courses for school. Maybe you had a reason for why you took those courses. Just learn from it and move on. Mainly, learn from the fact that’s summer is purely time dedicated for your internship, and you should never, by any means take a course for university unless it’s an easy general elective that you know for a fact is easy and you could do well in.",
            "Go back to doing your own projects and to your 3 courses that you were doing. API and pipelines is part of data science and data engineering definitely… you learn from your bad work and move on. Losing a team member, you still could’ve done a lot, at-least 50% of the work. \n\nLacking interest, seems like you don’t like the work of a data scientist. Data engineering, analysing, researching, ML is all part of data science. Which API pipelines is part of too. You dont like it? Maybe consider a new path. But mostly, learn from it.",
            "taking “3 very challenging summer courses” along with your internship isn’t the best move",
            "I had a similar program at my university. We'd be placed teams and assigned a company where we'd contribute to one of their internal projects.\n  \nA useful skill is learning how to climb over walls of uncertainty. Our project used new tech that was unfamiliar to us and our superiors. I had to relearn how to do independent research in a CS context and make friends in related communities.",
            "Are you a data science student or a computer science student? The reason I ask is I just finished up data fellowship that started in late spring and our team was a mix of CS and data backgrounds and I noticed the cs students struggled trying to figure out where to fit in and in the end after 12 weeks submitted basically nothing to the project.   \n\n\nWe had to write api's in order to get out ETL pipeline to work and I had hope they'd be more useful for that part of the project since they had bragged about their coding skills. In the end I think the project just wasn't what they were hoping for and since it was a volunteer fellowship they basically just peaced out.\n\nThere seems to always be this idea that if you want to get into data you should do a computer science degree but people neglect to mention that you'll probably also have to learn all the relevant skills on the side in order to be ready. \n\nA lot of data work ends up being more data engineering than it is analysis.",
            "Are you a freshman (judging from the three courses you didn’t take, and the way you don’t understand understand why building a pipeline is important downstream for Data science (albeit it errs on the DE side). If that’s case this is a valuable lesson and practically no downside to it. Learn when to ask more questions, and how to manage your attention/energy.",
            "You are taking three heavy courses and working at the same time.  Was there a clear delineation between your work time and school time ?  If you are supposed to be fully available and engaged during the work day with the company and you have to attend classes at the same time, it is going to be in conflict unless they were evening courses and you could do all the work after hours or on the weekend.",
            "I remember I made a mistake by taking 5 project classes at once. The burnout was immense. Now think about an internship and 3 difficult courses. Not a walk in the park either. The good thing you learned from this is not to rush thing or overwork yourself. If you plan to take a lot of classes in the future then don’t do an internship, but if you plan to do an internship then don’t take any classes. You will be less stressful and more happy. Just don’t forget to take care of your mental health.",
            "What do you do?   Do some self-reflection.    When you're at a job you don't get to just choose and cherry-pick what you want to work on.   Sometimes you have to work on some old and busted O&M code base.  Sometimes you have to work on making some API to have two systems chat with one another.   Sometimes you get to actually do what you want.   But at the end of the day this isn't academia anymore it's the real world.\n\nYou !@#@!ed around and then you found out.",
            "What do you mean what should you do? There's nothing to do, you were fired. You move on",
            "You were taking 3 classes *and* doing work a $90,000/year software engineer should have been doing.\n\nYou shouldn't feel bad about it... you should have gotten a medal.",
            "You do seem self-aware, so that's good. But as someone who's worked in student career counselling, I'll raise two red flags.\n\nYou \"made about 3 miscommunications\" that \"warranted some hefty emails\" from bosses who were otherwise polite and patient.  \n\nCS majors were - among all my university students - the absolute worst at communication,  to the point that many came off as irresponsible, rude, inflexible or just impossible to work with -- and without meaning it or knowing it.\n\nIf was only after I read deep into the comments that I saw that you didn't tell your employers \\*important information\\* about your courses and your missing meetings. The fact that you don't even mention this in your OP is a sign you don't know how to behave in a workplace. \n\nFew interns are fired just for technical errors, bc few employers have very high expectations of interns. Very few bosses have time to write lengthy emails to interns unless there is something off. It was only after I saw \"missing meetings\" that a light went off.\n\nI would take a hard look at whether this was a data science issue, or an issue with your communication skills. And good luck in your future jobs!",
            "Pro tip. Don’t take summer courses while at an internship. You can get credits for your internship.",
            "You fucked up. Learn from your mistakes, whether it be technical or soft like communication, and don’t make them again.",
            "Bruh you know how badly you gotta fuck up to get fired from an internship lmak",
            "You didn’t get fired because you lost a team member, you got fired for sucking and being disinterested",
            "Internships are this way, and so are jobs in general.   Don't think much of it.   My son had an internship where he was blamed for everything wrong with changing daily requirements and he did what he was told.   His mentor stood up for him so he still took the job with the same company but a different site and a new manager where he has lots of colleagues as well.",
            "You decided to take 3 summer classes alongside your internship? wtf were you thinking dude?...",
            "I love how you didn’t throw your managers under the bus. It shows your maturity as an engineer. Probably burned the bridge but you can still leverage the experience and grow as an engineer, especially in communication.",
            "wait so did they tell you it would be a research internship? or what",
            "How do people manage to take a class, let alone THREE classes during a full time internship? Do they just skip every classes?",
            "the full timers don't have any incentive to give you basic guidance. You don't participate in their promotion evaluation. They are only interested in the bigger, shinnier projects and people. I had a very similar experience as you. I managed to graduate early. Now I'm a full time dev at a big company making 6 figures with nice perks. Feel free to DM.",
            "Hey dude don't give up, they should have known that u were an internee not a pro at this, data science is a vast field and you can start from anywhere you find good",
            "An internship and 3 big courses sounds like a completely stupid idea unless you are just that smart.\n\nPersonally don’t see anything wrong with the situation. If you ended on good terms, check and see if you can get a letter of rec for your future internship applications. Just because someone fired you doesn’t mean they don’t like you or don’t want to help you succeed. You and the company just had different ideas and expectations and they just didn’t align.",
            "My dude, this is an awesome failure. Good job.\n\nYou acknowledged where you could have done better, didn't trash your superiors, took responsibility... THAT is how to fail with class.\n\nKeep racking up failures like this one, and you're well on your way to wherever you wanna go. And don't fear them... if the risk of failure is zero, you're not challenging yourself.\n\nIt sucks only a little. If I were you, I would brag my ass off about this in future interviews. \"Man, I took on this one gig, and fell FLAT on my face. It was awesome. Learned SO much.\" \n\nAny hiring authority who wouldn't see the value in such self-awareness is someone you do NOT wanna work for.",
            "Sounds like you were bored and thought the project was asking too much responsibility for an internship role. Did you blow an opportunity many wish the had? Are they taking advantage of interns? Probably",
            "It's cool to realize your mistakes but to be honest, a company shouldn't be firing an intern, especially if you have, what, a month + 1/2 left? You say your colleagues are professional and patient, but hiring an intern and not providing them enough guidance to complete their task and then firing them when they only have 45 more days of work left seems unprofessional and impatient.  \n\nI wouldn't do anything, don't expect a return offer and be happy you got the experience+paycheck. Enjoy the time off as you have the rest of your life to work.",
            "Sounds like they were trying to squeeze out an already established data scientist out of an intern and then got upset that it didn’t magically happen from just throwing it at you fast enough. Not your fault. You getting let go was probably the right time anyway, although, it is always hurtful. The relationship wasn’t mutually beneficial.",
            "> I was loosing interest\n\nYou mean, \"I was *losing* interest\". One thing you could do with the time available to you is learn how to spell in English. I'm not being sarcastic, at all - a large proportion of working in IT is actually communication with others, not programming at a PC, and being able to communicate professionally will be helpful in any field you choose to work in.",
            "If they only told you they wanted to discontinue the internship, I would quit. Don't let them fire you, as that'll come back in a background check. Quitting on your own is the best way. Sorry to hear about this man.",
            "They didn't fire you, you fired them my guy, mental peace is above all, good luck for future things 👍🏻",
            "Wow! Ive never seen a company lean / rely on interns this much. We hire interns at our company and their purpose is to learn about our products and what we do so they can eventually transition into employees. They bring us value in return by doing whatever they can whether that is through development, code reviews, testing, help with documentation, etc. We've never leaned on our interns in terms of them needing to get x done by y date. That's more for junior to senior level dev level.",
            "There is more to this story. You don’t get fired from internships just being incompetent. We had intern who just watched YouTubers play video games and he wasn’t fired. You have to go out of your way to be fired. Like annoying people. Making it harder than if you weren’t there.",
            "I wonder what year and university you’re from, a program that puts you into internships for companies sounds great! Would like to know, thank you.",
            "So, something that jumped out at me immediately is that this sounds like its a data engineering internship, not a data science internship. I have a lot of friends who graduate with Masters and PhDs in quantitative social sciences (econ, political science, etc.) that get jobs with the title \"Data Scientist\" and they, nor I (who have that same overall skillset as them) would not even know where to begin in building an API. Its pretty weird to think that you would have the same person building the API to collect a singular set of data that you would employ to engage in simulation, predictive modeling, etc.  \n\n\nIt kind of sounds like you ended up in the wrong internship tbh - I'm sorry you had that experience!",
            "You're not expected to know anything as an intern. Perhaps you could have raised your concerns about overwork and needing more guidance earlier...perhaps not or perhaps it wouldn't have helped you depending on the personalities involved\n\nYou should take to heart the feedback that your idea of a data science career is different than the reality. I'm a full stack that work heavily with a data science team and they're all python developers and while I influence the end structure of the data based on what info the app needs to consume, they are responsible to transform all incoming data streams according to the business case and will create data pipelines to make the data available to me. I could do that coding but I lack the educational mathematic background to know what algorithms and approach to use to answer certain questions,  (as you know, it requires specific expertise)\n\nIt sounds like you're looking for a position in academia or r&d",
            "They just wanted you to do their work for them",
            "Hopefully you learned your lesson OP, but it’s time to come back more prepared and dedicated. Learn from your mistakes",
            "Lol I have never heard of an internship being terminated, or interns being given this amount of work.",
            "In my scenario, for the most part, not exactly fired but drifted apart for good sake. Things happen, OP....wildly so. And one thing I learned is that as you go deeper and deeper, the core weight, the quintessence inherently comes out and it's time to handle the heat. You will come back no matter what and pursue the gravity that's pulling you back, keeping your sanity intact and not going the downhill. The quirky ideas and explorations you'd like to do cause you went through all of that,...will pay off.",
            "A bit off topic here but ru a fan of animenz by chance? Your name is a big implication",
            "Be an American, get a gun, stalk from office to office.",
            "Just confirm with them the reason, so you have the correct information for job applications. Your reflection shows you have some great discussions points for strengths and weaknesses in future  interviews. Just tighten up the conversation. \nStay in touch with your Manger since they mentioned they'd reach out in a few months. I'm guessing they also realize they were asking too much from a single team intern.",
            "i'm a bit confused why they hired you for data science and put you to work on API development. Data science has a notoriously fluid definition, but does software development get any further from data science than that?\n\nI'm even more confused why they expected enough actual work out of an intern to cut short the internship. Interns might do actual work in which case they might get offered something fulltime, and the company should look for interns who can do actual work in the hiring process, but if the company doesn't plan on its interns being unproductive, it shouldn't be hiring interns. Did they pay you like an entry-level dev or something that would justify these standards?",
            "Read the job description",
            "Did you get your experience letter till the time you worked there?"
        ]
    },
    {
        "post_id": "x95y1b",
        "author": "eiwaaaa",
        "title": "Had my Microsoft interview and mistakenly said google slides instead of PowerPoint. And I don’t even use google slides 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/x95y1b/had_my_microsoft_interview_and_mistakenly_said/",
        "score": 676,
        "num_comments": 90,
        "created_utc": 1662656853.0,
        "selftext": "Update: withdrew my application :)",
        "permalink": "/r/csMajors/comments/x95y1b/had_my_microsoft_interview_and_mistakenly_said/",
        "comments": [
            "I heard that in an info-sesh @ my university some time back, a microsoft rep was like \"So you Google this.... nonono BING\" lol. You're good.",
            "Microsoft interviewer: Why do you want to work here?\n\nOP: I'm a big fan of google slides\n\nMicrosoft interviewer: ..",
            "You should change your major to music after this.",
            "Hahaha I have to believe this is not a big deal, as people are aware there is more than one big tech company out there. You failing the interview just on that detail alone would be pretty dumb on their part",
            "Believe it or not, right to jail.",
            "[deleted]",
            "Literally at the end of the interview. Oh well",
            "See you in Guantanamo",
            "I used to tease a MSFT employee when he would tell me to Google something.  I’d say, “Don’t you mean Bing it”",
            "I said I love their apple watch last year and still got the internship 😆😭 don’t fret",
            "It’s really fine, no one cares",
            "For which role?",
            "Don't worry! This will literally have 0% impact on decision.  \nThey have a list of skills they need to check you on and will write detailed objective report on your past experiences and how you performed on problem they gave you - after this hiring manager will make a decision based on all reports.",
            "Guy enters Burger King: \" Ill take the Big Mac\".",
            "This is equivalent to wearing Nike socks with adidas. You’re lucky you made it out of there alive tbh",
            "Was this for a new grad interview? Or internship?",
            "If it’s any consolation, I said my favorite MS product was “Microsoft Paint” during an interview in sophomore year. Granted I never received an interview from them during college😢",
            "During my interview I accidentally said AWS instead of Azure twice. Still got the internship lol.",
            "I will provide an update when I hear back",
            "You're funked.",
            "Bro fumbled the bag heavy",
            "[Obligatory](https://i.etsystatic.com/30068474/r/il/09c658/3882545442/il_794xN.3882545442_hgmn.jpg)",
            "I work for MS and I can promise you there's no brand loyalty test, lol. My work laptop is a MacBook and a shitload of Azure runs on Linux. As long as you did good at the technical part of the interview you're all good!",
            "If that's the only issue and the rest went okay it might not be a problem.\n\nI flunked my interview at MS when I applied for an XBox graphics engineer position and the interviewer insisted on grilling me with questions about encryption. Bunch a clowns.",
            "CIA is gonna get you any minute now. Sit tight and stay clenched",
            "Don't worry, I was filling out an interest survey for a company called Bluestaq and upon a preliminary scan I saw data analytics and mistakenly assumed the form I was filling out was made by them. On the question asking if I'd recommend them to a friend I wrote a paragraph complimenting how nice the form looked.",
            "Sorry, but since you mentioned it was a Microsoft interview, which I believe is just to test your skills on MS products, you are a bit screwed.\n\nUnless the interviewer was open minded and knew what he or she were doing, you are in a disadvantage.",
            ":')",
            "Can’t blame you man . Google slides is the dominant app to use now lol",
            "I’m gonna be completely honest I did the exact same thing by saying I really like google docs. Still somehow ended up getting hired🤔",
            "I’m guessing this was your first round?",
            "They don’t care. If they do, it’s a garbage team.",
            "F",
            "Better than saying Gucci Slides (;",
            "I had this exact thing happen in my Microsoft interview. I said I really love google sheets …. I mean Excel! Heh\n\nGot hired anyways",
            "Well, you gave it a good try I guess :)  BTW, I use Bing exclusively and I wouldnt touch a MAC with a 10 foot pole.",
            "Update: ended up withdrawing my application cause they were to slow in a decision"
        ]
    }
]