[
    {
        "post_id": "l82zl7",
        "author": "BTTLC",
        "title": "Google vs Bloomberg?",
        "url": "https://www.reddit.com/r/csMajors/comments/l82zl7/google_vs_bloomberg/",
        "score": 685,
        "num_comments": 32,
        "created_utc": 1611951527.0,
        "selftext": "Hi, im graduating in may and was wondering which would be better for my career as a software engineer?\n\nI currently have offers for Software engineer @ Bloomberg and as a Janitor @ Google.\n\n Currently im leaning a bit towards Google, because its got a more prestigious name.",
        "permalink": "/r/csMajors/comments/l82zl7/google_vs_bloomberg/",
        "comments": [
            "What level Janitor at Google? Also TC or GTFO",
            "We really need a cs circlejerk sub, this kind of content is perfect for it.",
            "how did you sweep the floor on their onsite, I think I messed up by sweeping the dust between the desks in linear time when my interview was expecting me to use parallelism (aka a second vacuum in my left hand) 😩",
            "I’d take Janitor @ Google for sure. The janitorial bar is really high.",
            "I would recommend joining Google. Since everyone is WFH, you just have to clean your own house - which might be easier than SWE at Bloomberg.",
            "Is your standup special on Netflix?",
            "Bloomberg bar is really low, stupid kids can get in with just easy questions. I will go with the janitor role, real faang, exclusive, prestige and not risk of getting piped if you do your work in the bathroom.",
            "I think the Custodial Engineer position @ Google would be a much better option & opens more (bathroom) doors.",
            "I think Google is definitely better, especially since they're in California, I hear they have great food at their headquarters.",
            "I’d definitely recommend Google. It’s waay cleaner",
            "😐",
            "Is this a remote janitor position?  \nHow does one clean a virtual office?",
            "You mean a certified professional hygienist at google",
            "Being real here for a sec: if there’s no team matching like my year, your might get stuck working on things you don’t really want at google. There’s also the consideration of tech islands— a lot of googles stuff is in house specific. \n\nPromo is also slow at google (at least compared to fb, not sure about Bloomberg).",
            "Wait.. What? Sorry for being ignorant but you are having opportunity of software engr at bloomberg or cleaner at Google. But as people saying and you wanting that doing job as a cleaner/janitor is better than SWE job? Am I lost or what?",
            "Google for sure",
            "Lmaoooo 😂😂"
        ]
    },
    {
        "post_id": "1ae8tc4",
        "author": "throwaway35328777",
        "title": "My graph for this years internship hunt (feel free to ask questions)",
        "url": "https://i.redd.it/rc34wp1algfc1.jpeg",
        "score": 678,
        "num_comments": 80,
        "created_utc": 1706568819.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ae8tc4/my_graph_for_this_years_internship_hunt_feel_free/",
        "comments": [
            "good ratio\n\ni always see people who get like 5-10 interviews with no offers and are like super focused on fixing their resume... like bro your resume ain't the issue you need to practice your interview skills!! haha",
            "Bro is the other candidates",
            "How come you skipped out on an interview? I can’t think of a situation where attending wouldn’t help in some way.",
            "Congratulations bro. What is your resume be like? What did you add?",
            "What company",
            "Any commonalities between the companies that offered interviews? For example, based on your experience were big companies more likely to do interviews?",
            "When did u start and stop applying?",
            "Can I see your resume?",
            "I glad that you find the one that accepted you, I think I already applying over 1000 times on different places. And not even once got accepted. Any tips for me?",
            "Are you an international student?",
            "Why does no one love me (employers)",
            "How are these graphs usually made? Lol",
            "Just a question, how do you guys, make this graph??? 😅",
            "About the offer you got, was it a dev position?",
            "Congratulations for getting an offer! I wanted to ask that if I came as an international student for MS with no prior internship experience as such where I was paid instead I have 2 virtual internships kinda thingy where I did projects, would I still be able to get internships or do most of them require prior internship experience as well?\n(Considering you are in the US)",
            "Congratulations.\n\nAre the interviews technical? Leet code hard or easy? Did you include a cover letter for each application?",
            "Hi  \nHow you can draw this graph  \nThank you",
            "Congrats OP but I’m always confused when I see graphs like this. Where are there 216 internship opportunities?",
            "I could be dumb but....where are yall getting these diagrams from? which site?  \nDoes it cover all your applications?",
            "What is the name of this website,,i also want to keep my track record.",
            "What did you use to create that graph?",
            "what kind of projects? are you still in school, if yes what year? where did u go to apply?",
            "How do y’all do this?",
            "Mine is same but change that applications to (889) and did not attend (0)",
            "Did not attend💀💀\nI'm sorry I wasn't familiar with your game sir"
        ]
    },
    {
        "post_id": "15pvqxg",
        "author": "thepragprog",
        "title": "I am unhinged",
        "url": "https://www.reddit.com/r/csMajors/comments/15pvqxg/i_am_unhinged/",
        "score": 676,
        "num_comments": 198,
        "created_utc": 1691923659.0,
        "selftext": "I aced a coding interview without saying anything. I pretty much recognized the questions after doing a shit ton of CP in my free time. After I solved all the questions, I just said “is that all you got?” The interview dude just looked at me and said I’m unhinged. W rizz or L rizz?",
        "permalink": "/r/csMajors/comments/15pvqxg/i_am_unhinged/",
        "comments": [
            "Please stop abbreviating competitive programming like that.",
            "Get prepared for another interview",
            "This sub has turned to shit, posts I can see are :   \n1. My CS degree is useful\n\n2. My CS degree is not useful\n\n3. Job Market is fucked\n\n4. There are lot of posts that say Job Market is fucked\n\n&#x200B;\n\nBut your post is worse",
            "I went through your profile. Yep you are UNHINGED my guy. Get that checked out😹",
            "[deleted]",
            "This sub continues to demonstrate to me why so many people can't find jobs after 1+ years of looking. They are actually socially retarded, thinking just doing 800 leet codes makes them pleasant to be around.\n\nPeople forget that when someone is hiring you, they likely are going to have to spend a lot of time with you. If you are an insufferable piece of shit, no matter how smart you are, you aren't going to be hired",
            "L rizz because no one wants to work with an ass",
            "You forgot to walk them though it. They are not looking just for the answer. It’s like ending a math test with just writing “6”. \n\nThey are looking for your soft and technical skills. Ability to ask follow up questions on the problem, walk them through it, explain a complicated thought process, weight cons and pros of alternatives. Communicate in any way. \n\nYou didn’t. It might have come off like a superiority complex or like you already seen the problem before. In either scenario you didn’t play to the audience.",
            "This is an example of what NOT to do in an interview folks. Learn to make people like you so they can view you in a positive light.",
            "Real talk tho, how do you get into competitive programming? I’m thinking about doing it to just get better at algorithms.",
            "I was stuck on the Competitive Programming part for a while...",
            "As a rising junior when I read posts like this the first thought that comes to mind is: \"Are these some of the retards that I will be working with?\"",
            "it’s really ironic how the people calling this post out for social skills are also the ones that can’t recognize basic sarcasm — but i guess their number of upvotes just proves their point that this sub is legit socially awkward",
            "\"Is that all you got?\", Dumbledore asked calmly.",
            "dig through this person’s post history and eventually you’ll find them admitting (the post was deleted, but check the comments) that they’re mysognistic lol",
            "And this is why most folks in this profession aren’t taken seriously.",
            "Probably should have just kept your mouth shut.",
            "Give us an update when you receive the rejection email",
            "Being a cocky asshole in the interview isn't going to win anybody over. You might think you're the best, and sure, kudos for your self esteem, but being a shitty person to work with is not a trait anyone is going to hire for.",
            "These comments man I’m fucking crying",
            "For the love of all that is holy never refer to \"computer programming\" as \"CP\" again.",
            "As a senior this is actually hilarious because anyone who asks leetcode questions is a loser without any real programming skills to begin with.\n\nSo imo he deserved what he got.\n\nYou aren't getting a job tho lol",
            "1. What",
            "You really said that to an interviewer? No wonder why they don't like these new grads coming out of university.",
            "Bruh never say cp again",
            "CP huh\n\n\n\nFBI this guy here",
            "Bro let the intrusive thaughts win",
            "What does Club Penguin have to do with coding interviews?",
            "That’s never happened, redditors just stare at the floor and mumble incoherently",
            "> Market is shit and over saturated due to huge layoffs and high competition.\n\n> people with degree from no name rank 500 community college and 2.5 GPA complaining about not getting jobs after 1000 applications they spammed clicking through using easy apply on LinkedIn.\n\n> people with good portfolio got offers flexing hard or simply lying to farm karma since it’s Reddit, but seriously, I’ve yet to see any graduates with a strongly technical degree, 3.5+ GPA from top 30 Unis struggling to find a junior position even in this market. They all landed somewhere within 1 month of graduating if not prior",
            "mans doing side quests in life smh...",
            "Following to see how this unfolds.  \n\nTbh if the rest of the interview went well and I had an interviewee do this to me I would give a massive recommend.  Then again, I usually am the one dissenting when my coworkers are pushing for a new hire.  Maybe I am also unhinged.",
            "You're supposed to be communicating the problems with them my guy. Being silent will just get you disqualified no matter how fast you solved them\n\nThis is still my favourate post on the sub so far",
            "Doing a ton of WHAT??",
            "CP? Child p-",
            "You forgot to walk out of the room after your line",
            "Slow down on that CP op u don't want to be scaring any future employers",
            "This is wild.",
            "What does cp mean in this context? Every time I see one of these posts I get incredibly confused",
            "Just throwing this out there that people won’t hire you if you’re cringe, no matter how good you are at programming.",
            "you GYATT rizz my friend",
            "You did a shit ton of what?",
            "someone make a cs circle jerk sub",
            "[deleted]",
            "This is a great post.",
            "W",
            "Bruh that's not a flex, interviewers want you to explain your thought process",
            "Talk to women plz 😭",
            "Any courses to start with CP right from the basics ?",
            "What is CP",
            "Yes that comment was especially unhinged. Humility is very important and if you would have handled yourself with restraint and self-control perhaps you would have gotten the job.",
            "“Answered the problems, but bad culture fit”",
            "Stop saying CP for the love of god\nStop saying you ‘do’ CP please",
            "If this isn't a troll, then you most likely failed the interview. \n\nYou are supposed to express what you are thinking/doing to solve the problem so the interviewers know how you think and also how well you communicate.",
            "W post",
            "W king",
            "finally someone based on this sub. bravo.\n\nif you don't get the job though, just be more submissive and talk through your solutions.\n\n&#x200B;\n\nif you get hired you're gonna be on a based team hopefully.",
            "When you have a brain it’s hard very hard to be a lamb yet that is the expectation. Don’t rock the boat stay in your lane even when you able to see the fall out sugar coat everything basically live in your head.",
            "You a cornball",
            "I would reject someone that did this, if it was real."
        ]
    },
    {
        "post_id": "15bl817",
        "author": "Pigglewiggy",
        "title": "My first internship project deployed at the store. Data integration was a challenge but got it done. Just scan product, then label, and voila. All 2000 products. Took 9 hrs to install.",
        "url": "https://www.reddit.com/gallery/15bl817",
        "score": 680,
        "num_comments": 24,
        "created_utc": 1690512257.0,
        "selftext": "Electronic shelf labels",
        "permalink": "/r/csMajors/comments/15bl817/my_first_internship_project_deployed_at_the_store/",
        "comments": [
            "I thought this was a shitpost at first, then I realized those are electronic labels. Now you can apply for a position as a rollout technician",
            "awesome! Would love to learn more about how the tech works",
            "What tech stack did you use",
            "e-ink has so much potential. Congratulations!",
            "Great work. I did something similar for a major retailer. There is a lot of potential here in optimizing the template to provide better info for the store staff and customers. I added stock, delivery availability, customer rating info to our tags.",
            "wow that’s really cool! it isn’t every day that you would get to see your work displayed in the physical world :)",
            "Lil drug …. That could a new upcoming rapper from Houston .",
            "Man it’s gonna get to the point where you pick something up, and by the time you bring it to the counter the price has changed. Cool nonetheless though.",
            "[deleted]",
            "Who else thought this was a shitpost?",
            "Curious what your data model ended up looking like..\nIs this built on a NoSql db of some kind?",
            "Very nice ! This is the stuff I like to see",
            "this is actually wicked haha i thought this was a shitpost but this is awesome"
        ]
    },
    {
        "post_id": "ya5utq",
        "author": "goldenshowerexpert",
        "title": "Flying candidates out to interview is a lost art form",
        "url": "https://www.reddit.com/r/csMajors/comments/ya5utq/flying_candidates_out_to_interview_is_a_lost_art/",
        "score": 677,
        "num_comments": 49,
        "created_utc": 1666389152.0,
        "selftext": "Got flown out for the first time ever for an interview, to Seattle. Business class, and a 4 star hotel with free room service, all Ubers expensed. I feel like an expensive hooker. It's great.",
        "permalink": "/r/csMajors/comments/ya5utq/flying_candidates_out_to_interview_is_a_lost_art/",
        "comments": [
            "Company?",
            "ikr, out of all my interviews only one flew me out to Manhattan. Waterfront hotel, steak dinner, business class flight, (then 7 back to back interviews) but it was great",
            "how do companies do this? dont like 200 people pass the OAs for each company? they fly out 200 ppl?",
            "Wow that’s the goal for next year",
            "As an expensive hooker you've seen the good part, be careful about the other part though. Lol.",
            "\"expensive hooker\" lmao",
            "Big congrats /u/goldenshowerexpert",
            "I was flown out once to a interview except i ended up getting fucked",
            "Business class for an interview? Bro I didn't even get business class while flying out to my internship location lol",
            "[deleted]",
            ">I feel like an expensive hooker\n\nWait til they fuck you",
            "[deleted]",
            "Nothing but the best for a candidate of your expertise.",
            "here I am not even finding places to apply.",
            "Honestly, I’ll take most jobs being remote over getting flown out for free haha",
            "That’s sounds dope man. 👍"
        ]
    },
    {
        "post_id": "11gug7s",
        "author": "Greyhound53",
        "title": "Just pulled an all nighter studying for a midterm to still fail 🤡🤡🤡",
        "url": "https://www.reddit.com/r/csMajors/comments/11gug7s/just_pulled_an_all_nighter_studying_for_a_midterm/",
        "score": 670,
        "num_comments": 163,
        "created_utc": 1677828160.0,
        "selftext": "Getting burned out from this semester fr, felt like i just wasted my time, huge demoralization",
        "permalink": "/r/csMajors/comments/11gug7s/just_pulled_an_all_nighter_studying_for_a_midterm/",
        "comments": [
            "Doing an all nighter might be the reason you failed. I have never performed properly without enough sleep",
            "All nighter ain't gonna work in this major lol, gotta study starting at least a week in advance to be able to get a good grade",
            "You'll get used to it",
            "Discrete math by chance?",
            "I do all nighters to play the new destiny dlc and fail to understand the story. We are not the same",
            "I’m sure you know why you failed haha. Study earlier next time",
            "Lool I’ve been there, done that. CS will break your heart in immaculate ways.",
            "Study every day, not one long night.",
            "I did that too lol. Freshman year I was dumb enough to think I could get away without studying for the second midterm since the first one was easy. I partied the day before the exam and went to bed at like 5 am. I get my test back and I got a 9%.",
            "real clown hours",
            "Spread those hours. A couple every day bro",
            "I have to study two weeks in advance for my programming classes. Thats how bad I am at it. I think i need to change my major lmao. Wish it was as easy as physics 2 and calc 1,2,3. If its hard for you like it is for me, study much earlier to avoid losing sleep. You need that sleep especially in this major. You dont want to burnout.",
            "I’ve found more mental clarity and work productivity by just going to bed at 9PM and waking up at 5AM.  If your class is at 11am, this gives you a solid 5 hours of study before the exam.  \n\nI use to pull all nighters during my freshmen and sophomore years. Now I just go go to bed a little earlier.  I’d rather study with a fully energized brain, than a tired/lethargic brain.",
            "I'm so sorry, man. Looking back, I don't know how I did it. My mental health declined and went to absolute shit during college, but I somehow made it through and my life's literally perfect now. It's the type of shit people dream about especially when they see my Snapchat stories of me \"working\" remotely, meeting performance criteria, clocking out by noon, and going snowboarding for the rest of the day.",
            "All nighters work best for me if I do it two nights before, that way the first day your cramming everything in and the night before the test is just touching up on those knowledge gaps. Sleep and spacing stuff out is better for memory.",
            "You have to really want it. That one all nighter was probably the only time you tried really hard to look at the material. Try doing that at least 3 times a week, per class, during the day preferably. The first class isn't even that bad yet so you are in for a ride if your study habits don't change.",
            "Pulling an all nighter is usually the sign that you're probably not going to do well. I used to do them for the first degree I got and let's just say, my gpa showed it.\n\nI don't know what you are going through in life, but it always comes down to time management. Start as soon as possible. I tend to learn better and get work done more efficiently when I don't feel like I'm pushed up against a deadline. Let this experience be a lesson, and don't feel too bad. Some of us spent 4 years of our lives and way too much money on degrees we never even got to use.",
            "Cramming doesn’t work. I didn’t figure that out until my sr year when I had an “I’m an adult and this matters moment” sleep and study got me from academic probation with an ave 1.9 to a 3.1 . GL",
            "Why do people pull all nighters? Serious question, shouldn't you be studying consistently instead of trying to cram it all the day before? Why would you think that would be a good or beneficial thing in support of you passing?",
            "The night before is for getting a good amount of sleep. You don’t learn concepts by frantically studying in one night, but by spending some time every day on the subject",
            "Start before the night before. Will solve this issue lol",
            "Sounds about right",
            "Yeah I don’t recommend an all nighter… it’s not worth it. You won’t focus properly\nThat’s the problem",
            "I think I failed my Calc III midterm. On the same day that I took it, I went to one of the CS advisors to see if I really need to take the class to graduate.\n\nFrom what I was told, my DegreeWorks has me listed for the 21-22 Catalog year, which states I need 7-8 Math Elective credits... I have 7.\n\nDefinitely withdrawing from that class to preserve my GPA.",
            "If you're at the point of all nighters, you're falling behind. Try to use the night before midterms as *review* instead of cramming. That means planning your time a little better and making sure you have the knowledge after every lecture.\n\nAsk questions and make sure you understand things before moving on with your studies, as so much of computer science builds up on itself.",
            "Yeah all nighters don't work for this major bud",
            "How much did you study before the all nighter lol",
            "You’re not the first and won’t be the last. Happens to the best of us.",
            "Lmao, you gotta study a week advance if you want to at least pass. My brain can’t remember anything the day before a midterm either way. Have the answers inside my eyelids",
            "That really sucks. I’m so sorry. It happens. Maybe the burnout was keeping you from doing well in the first place. It sounds like you need a break and to take care of yourself, pull yourself back together. You can get back up and get back to it. You’ve got this; just not right now. And that’s ok.",
            "fr fr. How has it been this long and the semester is just about halfway done? It's taking everything in me to stay afloat ugh.",
            "It’s okay, I believe in you. Just have a smoothie and you’ll feel all better man",
            "You can do it!!!!!!",
            "Please do not stay up late over a midterm. A midterm is a midterm, not something your life depends on it. I have a Calc 4 midterm today and I got 7 hours of sleep, am I stressed over it? Nope. Don’t get upset over that. But definitely next time give yourself a breather and relax before going into another exam. Good luck, we got this. 👍✊",
            "Keep your eyes on the prize mate, it’ll be worth it in the end.",
            "The trick is to not put yourself in a position where you have to study all night. Study more weeks before the exams.",
            "Even if it’s five or ten minutes at a time, read and study throughout the week. Sleep well the night before, wake up a bit earlier and cram some them. You’ve got this homie. Don’t kill yourself over it though.",
            "You did waste your time, not in becoming a CS major, but in cramming for the test. If you expect to have a career in CS, you will need to learn the basic concepts and then be able to reason and utilize those tools. You don’t learn by cramming. It might work in history classes where 85% of test is a simple brain dump. But how well do you remember the things you “learned” in high school history?\n\nYou’ve got to find a better way to study by starting earlier and then practicing applying the concepts you learned to solve problems.\n\nAlso, get some sleep.",
            "I always make sure to sleep at least 7 hours before exams. Cant function otherwise",
            "It depends on why you failed - were you too tired while studying/taking the exam? Then the all nighter isn't for you. If you just couldn't quite grasp the material, try a different approach, try using practice exams effectively if available, even questions from the textbook that you don't use lol. I've found I study a lot better at night and the extra material I've learned from staying up all night has benefitted me 98% of the time - find what works for you and stick to it.",
            "This. Not targeting the OP but it's never wise to torture your body for your mismanagement.",
            "Bro it's my regular thing now....whenever mid semester exams or end semester exams come.... my sleep schedule will get changed...i sleep in afternoon ...and i study all night for exams...today only I gave computer architecture midsem exam ....professor got no chill ...but performed well",
            "same here",
            "Ain’t that just the way",
            "It be like that… always🥰 welcome",
            "Its ok, doesnt mean youre a bad programmer, or bad at java. You dont need to know all the specifics of java to be good at it; tbh after most tests you probably wont retain much information because its not useful to you right now, if you really need the info you can always google it.",
            "Yeah ive learnt that consistently working for small times is better than one all nighter jump. Sorry to hear you being demoralized but relax and build discipline to do little little daily",
            "It’s better to study in smaller doses to retain information. Study > rest > study. You’ll retain more information that way.",
            "Where does it say you can learn 1/2 semester in one night?",
            "Same 🫶🏾",
            "Same 🫶🏾",
            "Sleep > all nighter",
            "you didn’t pray!",
            "Thats tuff. Happened to me but with math. I spent all day studying for math yesterday then today my brain was completely fried lol. Only knew how to do like half the problems on the test.",
            "Not gonna lie man, If I know I've been slacking I'm not going to cram study or pull all nighter. No point in getting no sleep trying to review half a semester in a few hours. Just remember how you felt failing next time you want to procrastinate studying",
            "Extra hours of sleep >>> extra hours of studying",
            "Skill issue (study skills to be specific)",
            "Damn dawg that shit is rough",
            "Are you sure you pulled an all-nighter or did you dream of it?",
            "Spread out your work throughout the semester and upfront your work.",
            "First time?",
            "You have to do it over a few or couple days",
            "was the all nighter the only studying that you did for the midterm?",
            "All-nighters never helped me in college. If I wasn’t prepared the night before I was already screwed.",
            "It be like that",
            "Skill issue",
            "2 weeks array of time \n\nSpaces repetition my friend",
            "What school do you go to?",
            "I pulled an all nighter, learning 3 weeks of material and did very well",
            "If you find yourself having to do an all nighter, you probably aren’t going to do too well lol. \n\nManage your time better and study earlier. Better to study everyday for like 30 min than to spend 10hrs cramming in one day.",
            "Thats where you went wrong dont study like that.",
            "**Honestly, I usually sleep around 3-4 hours and do the exam, and then get the rest of my sleep after the exam. This is best if you don't have much time left until the exam. With this, you will probably have 80-95% of your original brain capacity and problem-solving skills because you will feel like you at least had some rest through the night and you also got to study the material. Also, eat something before the exam and go to the bathroom. It will keep your nerves down and hopefully remove a bit of your anxiety.**",
            "How much did you actually study before the all-nighter?",
            "Gotta study throughout the semester spread out.",
            "me during comp arch. it's ok failing one midterm isn't a big deal",
            "it happens, just give yourself more time to study for the next one and you’ll be fine",
            "skill issue"
        ]
    },
    {
        "post_id": "nss9qr",
        "author": "teddy_chompChomp",
        "title": "Google offer?!? Holy cow!!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/nss9qr/google_offer_holy_cow/",
        "score": 671,
        "num_comments": 89,
        "created_utc": 1622886636.0,
        "selftext": "Im still in shock!!! Right out of college!!! I didn’t even intern with them before!!!! Oh gosh. Wow!!!\n\nIf anyone has questions about how I did it /interview advice I’d be more than happy to try my best to answer!  I know my few friends had quite a few for me 😭\n\nEdit 2: please don’t take my advice as law. Any advice I give is just coming from my experiences and asking a lot of questions recruiters and engineers. Your school probably has visiting recruiters or engineers too. Just bite the bullet and talk to them. Or your university alums via LinkedIn. They’re just people. \n\nEdit: some questions are repetitive! Here’s some repeated answers:\n\n- I didn’t do a metric ton of leetcodes. I did a couple to refresh concepts, a couple to actually practice something new, studies some concepts on geeksforgeeks, homemade practice problems to familiarize myself more with some topics. Very adjusted towards what I wasn’t familiar with. Yes mostly DSA. Heavily refreshed my big o\n\n- LUCK. With all the talented competition, you’d gotta be in space to think that luck isn’t in the equation.\n\n- please stop asking about TC. \n- no more resumes please.\n- I did not hear back after final rounds until I reached back to my recruiter a few weeks later. \n- I had a competing offer so that did speed things up post-final rounds\n- i didn’t  graduate from an elite/pipeline school. My gpa was about a 3.3 when I applied. I have w’s on my transcript.\n\n- I did not have a referral\n\n- I took leadership with an academic club in my school\n\n- 1 internship with an f500 company, nowhere near being a tech giant\n\n- no personal projects listed. Just major projects done in uni\n\n- iirc onsite problems were like mediums + dummy hard\n\n-  weeks between stages. Reach out to ask about your application status if you’re feeling nervous or forgotten  \n\n- be talkative with ur tech interviewers. They may or may not know the language you’re using. Make sure they know what you’re doing— or trying to do if your code skill doesn’t catch up. Nothing worse than if your interviewer doesn’t know what you’re doing and you don’t finish. Let them know your thinking process.",
        "permalink": "/r/csMajors/comments/nss9qr/google_offer_holy_cow/",
        "comments": [
            "Firstly, CONGRATS! What was the kind of experience you had before? Internships/CO-OPs? How was your interview? Could you run us through the different steps and the DSA questions you got?\nThanks in advance.",
            "nice! What internships, side projects, and # of leetcode questions did you do?\n\nany advice?",
            "First of all many many congratulations that's a great achievement and I'm very delighted hearing this and I don't even know you lol. Anyways at what sites did you practice questions for DSA and I'd love to see your full experience on a seperate post about the interview process the questions they asked what all topics you practiced and how many questions you did and from where . It would be a great help for me since I'm also looking forward for placements starting next semester. Congratulations again and you sir, certainly deserved it.",
            "What uni did you go?",
            "Congratulations \nbut how did they reach out to you i couldn’t get that from the replies\nyou said something about being in their data base \ni’d like to be there too lol",
            "Did you have to code in google docs?",
            "Not sure if this is relevant, or if you can answer this, but:\n\n\\- what language did you interview in?\n\n\\- did you specify a language preference?\n\n\\- the team you'll be working with, did they specify language? Java, Python, frontend stuff?",
            "Congratulations!!!\n\nWas this after google reached out determining interest for positions in seattle/Raleigh by any chance?",
            "Did your recruiter team match you after your on-site interviews or after hiring committee approval?",
            "Did you have a referral when you applied at google?",
            "Congratulations!!!! It’s been 4 weeks since my google interview for new grad role and I’m not getting a response from my recruiter. Have I been ghosted?\nHow long did the process take for you?",
            "Congratulations! Can you...share your resume?",
            "Was your previous internship a faang company, f500, or unicorn?",
            "Congrats!! Hard work always pays off!\nWhen did you apply and what opening did it say when you applied just like “Software Engineer New Grad ...”?",
            "Congrats! How hard were the questions for new grad? I remember when I interviewed last year for an intern positions and I got LC mediums.",
            "Google engineer and interviewer here - the #1 piece of advice I give to all fresh undergrads preparing for an interview is: study your algorithms and data structures. Your interviewers are looking for a broad tool set owned by someone who knows when to apply each tool. Make sure you understand complexity. Also, practice problems coming up with a simple solution first, and then talking through ways to improve it. Professionals rarely get the optimum solution on the first try, we want to see how you can iterate.",
            "TC?",
            "RemindMe! 3 days “check the comments”",
            "[deleted]",
            "Which office location did you get hired at?",
            "Hi, I noticed you talked about keeping communication with your recruiter and how you were already in the candidate database. I was rejected from the STEP program this past school year and so I was wondering what kind of communication you kept with your recruiter?",
            "How in the world did you even get the interview at Google? Seems like the hardest part for Google tbh",
            "[deleted]",
            "Did you do get an optimal solution for every question or did you have any bad rounds?\n\nDid you feel confident after your onsite?",
            "Wait is this for summer 2022? Wtf they already started opening applications?",
            "Congrats  Man, So happy for you!!",
            "Did u have a referral?",
            "Congratulations. Awesome achievement to be very proud of! Couple quick questions:\n\n1—I know you kinda answered this but I wanna clarify:\n\nWas your university MIT/Ivy/Stanford/UCB (tier 1)? UMich, UIUC, UW-Madison, UMaryland (tier 2, yes this is a broad range)? Or Kentucky,Arkansas etc. or something lower (tier 3 and below)?\n\n2—Are you an underrepresented minority?",
            "[removed]",
            "RemindMe! 2 days",
            "[deleted]",
            "What was the TC they offered, and how did you negotiate?",
            "LC count or GTFO/s",
            "What university you graduate from",
            "What resources did you use? \n\nCongrats :)",
            "RemindMe! 3 days \"check comments\"",
            "Thanks for the insight from your replies in this post. 🙂 All the best!",
            "Congrats!! What team did you match with if you dont mind me asking?",
            "I sent you a message.",
            "Do potential employers look at transcripts? Does having W’s on your transcript matter?",
            "Congrats! How long did it take for the recruiter to get back to you after you reached out after the couple of weeks later?"
        ]
    },
    {
        "post_id": "rhqsvf",
        "author": "FrostieDog",
        "title": "What the hell is this",
        "url": "https://www.reddit.com/r/csMajors/comments/rhqsvf/what_the_hell_is_this/",
        "score": 667,
        "num_comments": 142,
        "created_utc": 1639661528.0,
        "selftext": "I'm a [yourmom] who enjoys programming and have programmed since elementary school. Naturally I have decided that I want to go into college next year to major in computer science, as that is what I enjoy. Recently I saw this subreddit and it made me rethink that decision. What the fuck is all this shit",
        "permalink": "/r/csMajors/comments/rhqsvf/what_the_hell_is_this/",
        "comments": [
            "People who live in this subreddit get depressed when they're making 300k salary as a entry-level.",
            "I basically view all internship posts like they are from wallstreetbets. Makes it seem more lighthearted and trollish than legitimate students trying to flex or complain about not getting into a prestigious school or getting an Interview at a FAANG org.",
            "It’s just a place to flex on each other and post a lot of bragging. Odds are you are better off pretending like you never found it",
            "Count yourself lucky that what you actually love also happens to make money. for most people, what they love and what puts food on the table do not coincide.",
            "It’s toxic for sure but the takeaway is get reallllllly good at data structures and algorithms and finding a job that pays 200k when you’re 24 and 300k when you’re 27 is super possible",
            "Summary of this sub: “results may vary”",
            "A bubble.",
            "People here only talk about software engineering for some reason but there are certainly other pathways for a CS major. Computer Science != Software engineering necessary",
            "Imagine not majoring in cs purely for the money, couldn't be me",
            "Nothing wrong about getting a good job with decent money. But I agree CS!=SWE",
            "I mean don’t not go into it just Bc of the subreddit. But I mean the thing is situations vary. I feel like you since you’ve done this since elementary school, you ha e a lot of experience and can start making projects and get a lot of experience stuff right as soon you go into college or even now. \n\nBut for people who just start out and have to somehow obtain all this experience that companies are looking for it does become difficult. Like it’s rlly hard to get an internship, that’s not a lie.\n\nBut you should be fine lol guys like you always take up the intern spots that guys like me apply for ha ha.",
            "Amazon",
            "What about this sub made you rethink the decision? I'm genuinely curious since the first page is people discussing grades vs experience, whether blind 75 is enough for interviews, a shitpost about battle passes, a person asking how they pick a subfield, and a person asking how to pass a hard class. This sub isn't that bad, there's a lot of valuable advice and discussion here.",
            "I mean, you're seeing discussions among juniors and seniors in college regarding post-graduation plans. They are in a totally different stage of life than you are. Of course reading this sub would feel overwhelming. You've barely started climbing the mountain yet you're getting a sneak peak of the terrain 2/3 of the way up. If you were a premed and checked out r/medicine and saw discussions on the challenges of open heart surgery or the drudgery of health insurance paperwork, would you suddenly quit medicine? \n\nAnd this is not a prescription to leave this sub. Just get context first. Sure, there is obviously a bias here toward high-paying jobs after college (like in all profession-oriented communities on the internet), but you'll also find posts oriented toward intrinsic passions in this field. It's a large place, so don't get freaked out. You'll be fine!",
            "What’s the problem? All the top posts right now are company questions or discussions about school or academics. Its December now so the leetcode/interview madness with people obsessing is mostly over. I’m a senior now and this sub basically gave 4 years of free advice that helped advance my career and ultimately get into FAANG. There’s a lot you can learn from those who’ve been here before you as long you take all advice with a grain of salt you’ll be good. And tbh the advice here and on Blind has been substantially better than in real life.",
            "Remember that the Internet is a place where people post strong opinions so you're unlikely to ever get a middle ground. It's not just in CS, but other subreddits also tend to have extreme opinions.",
            "honestly man there’s a lot of money and opportunity in computer science, I’m only a sophomore in college and I can see it.  If you like coding and think it’s cool I wouldn’t let this subreddit stop you.",
            "Take everything you see in here with a grain of salt just like r/cscareerquestions and others. That being said, there are good resources to be found and putting the ego-fueled and Leetcode posts aside, there are genuine good people with lots of knowledge on these CS-based subreddits. Just can't let the trolls and goofs convince you of their delusions.",
            "Wdym this subreddit is awesome",
            "This subreddit is dominated by super money-driven students and over-achievers who talk about their experience with the highly gamified gatekeeping process of landing 6 figure new grad jobs at big tech companies. It's toxic at its worst, and inspiring/movitating at its best, and it's not always easy to draw a line between those two things. A good analogy is a fitness community: where do you draw the line between inspiration, and unreasonable comparison? At what point does comparing yourself to others stop becoming inspirational, and become detrimental to your self-esteem? When does a conversation about meticulous dieting, become encouraging of unhealthy or disordered eating habits? \n\nIt is much the same here: seeing people with high paying salaries, and people who make a lot of sacrifices in order to get better at technical interviews, can be motivational but it can also be terrible for your mental health. The idea that you need to grind incessantly to be successful. The idea that you're a failure unless you make 6 figures. This place is rife with that kinda thing and you need to take everything with a grain of salt and realize that the majority of students don't operate like this, and it's not representative of the real world for most CS students.\n\nIf you enjoy programming, definitely pursue CS. Keep in mind that this sub leans towards a very specific type of student who is trying to land a very specific type of high paying job. There is a huge world out there that much of the conversation here doesn't really apply to. There is definitely insightful and positive stuff posted here sometimes, and it's not all terrible. But really, take it all with a huge grain of salt, and don't compare yourself to others, or their idea of success - it's not healthy.\n\nAnd regardless of career paths, CS can really fun (even though it is challenging) and it is an enriching thing to study in it's own right. Do what makes you happy.",
            "That's what you become as a csmajor :p",
            "Keep going and do not rethink!! You can do this, it’s a lot more fun than you think it is!",
            "If just half the people here took their talents and built something of their own rather than focusing all their time on trying to get a FAANG internship we’d have thousands of new innovative startups.",
            "yeah esp all the shit about t20 and t5 schools and stuff. i just got rejected from a t5 and i’ve been programming since i was 7. shit gets really competitive, so i’m happy (hopefully getting in and) going to my state school for cs",
            "There's another group called something like r/cscareerquestions that's more mellow.",
            "I apologize as this is unrelated to your post but I did not want to spam the sub with a simple question. Is 25 too old to graduate with a CS degree? I was very lost for 3 years after hs but I am really excited to be starting CS next fall at 21. But will I be too old when I graduate?",
            "it's fine, don't worry about it. this subreddit is crazy but almost everyone at school, at work, etc. is normal and nice. I go to a low budget third tier state school and my cs program is still great. I'm not hot shit and I don't kill myself like a lot of the people here. I got a FAANG internship anyways (and even if I hadn't I'd stil have good job prospects because there is so much opportunity in software engineering right now). Frankly they probably don't actually do as much leetcode as they say they do, they are just flexing and trying to gamify their lives. \n\nIf you like it, you should do it.",
            "What specifically about this sub made you go “what the fuck is all this shit”?",
            "No ones telling u to stay here tf if a subreddit is making u rethink a life decision idk what to tell u",
            "It's not worth it😭",
            "I’m in the same boat as you. Got rejected from Stanford last night and currently re thinking my life",
            "You’re literally still in high school, you have a lot ahead of you lmao.",
            "This subreddit actually gave me a lot of motivation and opened my eyes as to the path to get a good job after college. I know a lot of people that just don’t know about leetcode or how this job industry works and this subreddit would help them a lot",
            "“these people only exist on the internet these people only exist on the internet these people only exist on the internet these”",
            "Anyone here trying to get into the web3 space? or in it?",
            "TC?",
            "CS is awesome and fun. I love it, best decision I ever made with the decision to get a second major in path coming in second.",
            "This is not a good subreddit to learn about the realistic cs education scene. If you enjoy programming in hs, you should absolutely continue to pursue it in college. You probably won't get a 300k offer at google after your first year of college (sorry to disappoint). Yes, getting your first job as a dev is going to be super hard. But once you have 5 years or so under your belt, you will be set. Don't worry about getting an internship. If you have the opportunity, of course, take it but don't sweat over it.",
            "I didn't even know about this subreddit before this post LOL.\n\nIf you're passionate about CS, go for it and don't give a fuck about others. I started at 20 without any programming experience and got my bachelor's at 25 (math is hard y'all). 30yo now and still passionate af for everything computers.\n\nThe best part about being in this field is the job diversity and availability. No need to work for a big company although I would recommend it for your first 2 years just to get some introduction to how enterprise works. Anyway, with a CS degree you can choose to go pretty much anywhere you want as long as you put your mind to it.\n\nRN I'm considering going back for a masters in robotics but I am so afraid of facing all the math again lmao (ngl finances will be a problem too but that's another topic)",
            "Ignore this shit show go have a good time in university my dude",
            "This sub is really unrepresentative. I, and many people I know, went to a normal state school, got decent to good internships, never had to grind leetcode, and got FAANG or other good offers upon graduation. (We're all graduating right now, so this was during the pandemic. Hopefully you'll have an easier run of things). \n\nOnly bit of advice, make sure your school is located near a metro with a large tech industry (I'm near Phoenix, and my first internship was at a small Phoenix based company. Without that experience I likely wouldn't have been able to get my subsequent internship / full-time offer). It'll make it a lot easier to get your first internship as you'll have access to a tone of mid to small companies at your career fair.",
            "I'am not in this major but so interested in programming. Is it possible for me to find a job about CS major?",
            "this sub is full of minmaxers driven by ego and prestige (and sometimes asian parents). if you actually enjoy programming just filter this out as noise. this field is lucrative, so it attracts tons of people looking for high wages who don't actually like the work, who a few decades ago would have been satiating their egos in finance or law, etc.\n\ngo into the field and find something cool to work on. it's great.",
            "1) Ignore this sub. It's full of stressed out college students that \\[a\\] have a weird (incestuous?) \"parental bragging rights at all costs\" kink, \\[b\\] have zero real world experience (or at most a summer internship), and \\[c\\] their understanding of the job market is \"either FAANG/Big 4, or VCR repair for the rest of your life, and there's nothing in between\".\n\n2) Both Leetcode and shooting 150+ resumes into the ether are stupid. You are unlikely to get a job that you will enjoy with that method.\n\n3) Get advice from software developer professionals instead. Like, literally find people with the types of jobs you would like to have, shoot them a message in LinkedIn and ask them if they could give you advice/an informational interview. Hint: they will \\*not\\* say \"grind more LC\" or \"throw 70 more resumes out\".",
            "It's a thunderdome, holmes."
        ]
    },
    {
        "post_id": "173x54i",
        "author": "Big_Zookeepergame711",
        "title": "I think I’m going to get rejected",
        "url": "https://i.redd.it/eibpcbkql7tb1.jpg",
        "score": 671,
        "num_comments": 290,
        "created_utc": 1696871354.0,
        "selftext": "Should I just lie?",
        "permalink": "/r/csMajors/comments/173x54i/i_think_im_going_to_get_rejected/",
        "comments": [
            "Reply with my name is Grace Hopper",
            "If you didn't go then you didn't go. Just state you didn't go and then also state how you found out about the internship.",
            "Say you aren’t dumb enough to pay $199 for a virtual event",
            "This isn’t checkmate right? Sacrifice a queen to protect you.",
            "What’s the issue?",
            "Just tell the truth.  Last thing you need to do is lose a job on a lie where you are trying to assume their motives.",
            "is this listing specifically for GHC attendees?",
            "Have you ever attended to GHC?",
            "Which company is it?",
            "You could say you went because a woman you know asked you to come with them since they didn’t feel comfortable going alone",
            "bruh just be honest and if you get rejected who cares. you either went or you didn't go... it's not rocket science 😂",
            "You might be doomed lol",
            "howd you even find that position - i don't see it on the workday website",
            "Thank you for following up. I did not attend any sessions of Grace Hopper in person or virtual.  A few of my classmates did attend and greatly enjoyed the opportunity to network with other STEM majors from across the country. We chatted a bit about how motivating the sessions and environment was for them. I found and applied for this position from a job posting on Indeed job board. \n\n\nNow you've got some points.",
            "Lol I applied to this without attending either and they just ignored me",
            "Just tell them the truth, also if they reject you because of this it would be illegal, since that would be rejecting you based on gender",
            "Textbook discrimination",
            "This is very weird",
            "Yes, say in-person. \n\nAnything other than that is just going to hamper your chances of getting in",
            "Did...did we just found the reason for the influx of males (sex, not gender) attending GHC? So it was corporations all along!",
            "One of Workday’s core values is Integrity… worst thing you could do is lie about whether you went or not…",
            "LMAO new application filter just dropped. Turns out all those guys who went to the event were smarter than the rest of us all along. Unfortunately, I think your only option now is to answer honestly and just accept the auto-rejection.",
            "They’re trying to reduce the number of candidates by adding a barrier. Anyone that didn’t attend is auto-rejected.",
            "As fas as they know, you are non binary. The only requirement to attending GHC was be female or nb. Being female requires you to be born with female gametes.\n\nBeing nb just requires you to have androgynous pronouns and identify as such. Like literally just say you’re nb and go with it.\n\nI know it sounds silly. But we live in a clown world\n\nEdit: Reddit is pretty funny. This reply was +5 then -7 now +4.",
            "I identify as Grace Hopper",
            "Just say yes. If it might increase chances for an offer then why not lie",
            "Yes in person my crush and I went on a date.",
            "I got no idea about cs major and the competition.\n\nIm not from the USA nor western countries. Im from Thailand. So I have no idea about the events and so.\n\nPlease fill me in!",
            "You most certainly will if you don’t respond.",
            "The comments on this prove there are a shit ton of stupid \"smart\" people. \n\nFfs dude, answer honestly and let it go.",
            "Say you attended Irl they have no way of checking. The schools probably wouldn’t answer that question",
            "Wait do folks think this is about sexism?\n\nIt’s 100% that going in person is a crazy strong signal that you’re careerist and trying to seem “professional”, which they want; and that it basically tells them if you’ll fight RTO mandates or put up with lack of flexibility.",
            "As a reminder, if youre elite talent, you dont need a space just for your group bc the rest of the competition doesnt matter. If you’re not, this will piss you off. So good job, you just outed yourself for being a mid. \n\nThe other thing is, the ppl complaining about needing an event just for themselves are also not diving to take low end jobs. Theyre always goin for the goldman sachs and faang jobs. You simply just want priority access to the best opportunities and are willing to punish those that had nothing to do with past injustices of others all while trying to work for companies that previously have actually participated from the poor behavior you rail against.",
            "[deleted]"
        ]
    },
    {
        "post_id": "192xuva",
        "author": "None",
        "title": "Duality",
        "url": "https://i.redd.it/dlm9oy983jbc1.jpeg",
        "score": 669,
        "num_comments": 25,
        "created_utc": 1704855677.0,
        "selftext": "Was scrolling my feed and just thought it was funny these two posts were right next to eachother",
        "permalink": "/r/csMajors/comments/192xuva/duality/",
        "comments": [
            "Comparison is the thief of joy. But a person has to pay their bills and feed themselves too.",
            "Those two problems are actually related.\n\nBecause it’s so hard to get a job, employers can treat employees like shit, and they can’t leave, because it’s hard to get another job.",
            "People with internships right now are worried about return offers for 2025, lol",
            "Grass is always greener on the other side",
            "There have always been and there always will be the same percentage of winners and losers. Happy foxes and sad sacks.\nFat cats and starving dogs in this world. Yeah, there may be more of us today than there's ever been. But the percentages-they stay exactly the same.",
            "I was looking for a job and then I found a job…",
            "I have neither",
            "Everything is skill issue",
            "Fr, both of em sounds so entitled. Nobody owes them anything. So what that they cannot work in tech or make “day in the life” there are always other options, you don’t have to be in tech. Even a fast food worker is a job, blue collar jobs are still much in demand. Just cuz you majored in CS doesn’t entitle you a six figure salary or high pay internship."
        ]
    }
]