[
    {
        "post_id": "14ln1s4",
        "author": "qtcandlering",
        "title": "I feel so guilty and awful (rant)",
        "url": "https://www.reddit.com/r/csMajors/comments/14ln1s4/i_feel_so_guilty_and_awful_rant/",
        "score": 664,
        "num_comments": 115,
        "created_utc": 1687990843.0,
        "selftext": "I had an interview today for a fall internship, but I got this interview through my dad’s connections. They don’t even have an intern position, they’re willing to make a position just for me. I was asked to come in for a technical, and I feel like I just did awful, since I let the nerves get the best of me. I usually don’t get this nervous but 1. it was my first in person interview. 2. I feel like i’m letting my dad and his connection down as they really did vouch and try hard to get this opportunity for me. I feel so horrible for letting them down. I have already cried alone. Why did I have to get nervous !!!!",
        "permalink": "/r/csMajors/comments/14ln1s4/i_feel_so_guilty_and_awful_rant/",
        "comments": [
            "when you drop in fortnite and get a gold weapon in the first chest, take it. if you don't, others will and they'll do the griddy on you. we live in a jungle, don't hesitate.",
            "Take advantage of what you have. No shame in that",
            "People use their connections to get ahead, that's just how life works. It might be unfair but that's just how it is. \n\nHowever, I would say your situation is actually better than most cases of nepotism since you're not actively taking the opportunity away from someone else - you had that position created specially for you. You're getting special treatment but it's not necessarily at a disadvantage to anyone else. At least, that's how I see it. \n\nWe'd all do it if we had that available to us. Just make good use of it!",
            "I don’t know why everyone is talking about the nepotism angle, that’s clearly not what you’re upset about. You seem to be more upset that you did poorly and you think you’ll disappoint people. \n\nInterns aren’t expected to be good. You have no experience. I’m sure no one is disappointed or upset with you. My first ever interview was equally terrible. It was actually so bad that when I drove away I accidentally ran a red light because I was so busy thinking about how shitty I did. \n\nAll that to say, don’t worry, it happens to everyone and no one is mad at you.",
            "Ur fine nepotism will save you",
            "Don't feel guilty, life is hard. But remember to keep quiet about it. No one needs to know",
            "In fortnite you don’t quit the match because you get bad loot, you keep grinding to get that victory royale.\n\nStay out of the storm bro ☝️",
            "I wish I was a nepo kid. No shame in that. Life is hard enough. Good luck",
            "Loool you should be happy you have nepotism on your side at least, maximize your next opportunity",
            "Agree with people saying to take advantage of what you have, but please work hard in the internship. \n\nNothing worse than someone who has been given an opportunity from connections and doesn’t give a fuck about it. Had a few people on my internship team who were children of some exec/manager wankers and they worked like 1 hour a day and made excuses for every mortal thing, it was extremely frustrating knowing someone else in their position would be grateful and put in effort.\n\nBy making this post it sounds like you’re not taking the opportunity for granted so you’ll be fine.",
            "Did you guys replying even read the post? They feel guilty not for \"nepotism\" but for doing poorly on the technical and potentially letting their dad down and the company for going out of their way for them...",
            "Imma be honest and say i too had a nepotism interview that my parent was really hyped about. I ended up not getting it, they actually ghosted me even after i asked for an update. I got another one on my own later. I am happy that now ppl couldn’t just look at linkedin and see i was a nepotism kid. Another Bright side is you have plenty of time to work on your interviewing skills.",
            "Everyone has had some bad interviews. It's a skill like any other, and you need to practice. It's okay, don't be so hard on yourself. If you have school friends, you should give each other practice interviews.  You can even do it over vc during the summer.",
            "Man I'm in a similar situation my dad's half connection recommended me to a start up and I just quit today after a couple days because of another (better for school and money) job offer. The team was super nice and I loved working there and i feel like a dick for quitting.",
            "Here is my interview tip from my 45+ years in the work force. The way I relax and stay cool in an interview is to tell myself that it does not matter if I get the job or not. I don't have a glib attitude, I just relax and remain authentic. I have never NOT gotten a job I was qualified for.",
            "I know it probably doesn’t help, but you’re not wrong\nGetting internships is hard, and you may have blown a big chance, that’s the bad news, good news, you can keep going, you still(probably) have the qualifications for other internships, so apply to a bunch and don’t mess it up on the second go through. Learning experience, then jump back in",
            "I mean honestly if you talk to your dad and the other people involved to get a second chance at it they'd probably respect you for it and let you try it again.",
            "Homie, you’re young and inexperienced. Flubbing an interview is a right of passage. If the company holds nerves against you when you’re inexperienced then that says a lot about the company.",
            "Don’t feel too bad man, I was in a similar situation but my brother told me before my first interview \n\n“don’t worry about how you do or think we have any expectations, just do ur best”\n\nObviously I still was scared that I’d let him and my family down and I didn’t think I did that great in the interview but I still got the position \n\nA reasonable company/manager wouldn’t expect an intern to know all that much anyways I don’t think. You’re there to make mistakes and learn. Even if you don’t get the position this time, you’ve gotten another experience with interviews and you’ll be better prepared for your next one even if it’s just a little bit.\n\nYou did something, that’s more than nothing",
            "Who cares if you did terrible? It’s an interview, your first one in person at that too. Relax bud, just move on. The hussle doesn’t stop",
            "Nothing to be ashamed of. Give your best. This is networking. I'm an International student and I would even do an unpaid internship even though I'm running low on my money for the right experience.",
            "Nepo bby",
            "1) connections are the only way to get jobs and meritocracy does not exist \n\n2) At least you tried, you may still get the job anyway and you won’t know till you hear back and I think you will. Until then don’t sweat it. A good faith Failure is better than not even attempting, or worse going into the interview high on meth with your dick in one hand and gun in the other. Just know it’s not that terrible",
            "Don't worry about this. University career centers will actively encourage you to reach out to family members to get opportunities. What you're doing is pretty standard.",
            "Just remember to stay humble when nepotism saves you and your terrible CS interviewing skills lol",
            "Don’t feel bad. Feel grateful. God has blessed you! Make the most of this opportunity.",
            "Not everyone is born equal in this world. Just be blessed with what you have and do your best.  My gf got her internship thru her dad and I'm proud of her. She didn't even have to interview, but she works hard for her course and her career path.",
            "Nepotism is so based. I'm literally working hard so one day I can use my connections to help out my kids.",
            "Character growth 😤",
            "Well even with your leg up you still fucked it so don't feel too bad",
            "Ugh stfu 🥸",
            "If you keep in mind the advantages you got in life when judging others, there's no problem with taking those advantages. But if you start judging people and saying shit in the spirit of \"pulling yourself up by the bootstraps\", you'll be an asshole. Take advantage of the connections, don't be an unappreciative asshole to others.",
            "The world is run on nepotism, thats just how it is",
            "That’s the white privilege people talk about that allots benefits to white people via intergenerational wealth and networking. You’d do well not to squander the opportunities given to you and to stay humble with an air of gratitude.",
            "Then revoke the offer. Unless you don't really feel remorse at all and all you want is attention",
            "If they already created an opportunity for you, you'll continue to fail upwards through Daddy's nepotism and connections.   It's fine.  You'll be a program manager in no time asking people about JIRA tickets",
            "ur a nepo baby and thats ok!!!",
            "You'll probably be alright. Every interview I think I did bad I end up getting the job lol",
            "You sound like you were not prepared",
            "Agreed with everyone else! Finding jobs and opportunities is like 85% networking and who you know. This is no different.\n\nIf it makes you feel any better this isn't some high level management position. It's just an internship, and while it likely won't change your life, it will make it easier, so take it without regret.\n\nI prided myself on finding my first job without connections. It was shitty and was a stupid thing to be prideful about because they laid me off in a RIF 2 years later. \n\nI found my new job with family connections and I love it. I have grown so much and feel very appreciated. Even though I used to get some jest from trolly coworkers about nepotism, my boss (unrelated to my connection) has been quick to snip it in the butt and stands by my excellent management and performance with little prior experience (they threw me to the fire with little training) Just do your best, work hard and own your mistakes (everyone makes them).\n\nWelcome to the real world and best of luck!",
            "Find one thing that you can learn from the experience. If you grow from it, it's a win no matter what.",
            "If you genuinely are that awful, you won't get the position no matter if you got the interview yourself. Well, it might be that he only got you the interview? It's not like he got you the job, this is just the job interview?",
            "Always take the opportunities, never feel entitled to them.",
            "There are so many jobs where it doesn’t feel like you’re really earning the money these days that it leads us to heavy consumerism and self doubt to get rid of what we feel we don’t deserve. \n\nTake the position and kill it. Use it to help you rise up the ranks and then pull others up with you. You can be the reason other people who might not have the same opportunities as you do otherwise can have them. You can take a nepotism type situation and turn it into a communal good if you move past being upset about it existing in the first place. \n\nIt is frustrating to see these systems in our society but dwelling on it won’t change its existence. If it wasn’t you it would be someone else in due time.\n\nGo out and do great things in life, and find ways to lift up others around you while you’re at it",
            "Nepotism is only bad if you don’t benefit. I’d rather have nepotism than not for early career head starts. Shut up and be grateful, there’s no shame in a support system. You’re lucky someone likes and respects your dad enough to help him help you",
            "Dude it’s fine, they won’t hold it against you. Do well in the internship and prove to them that you’re good enough to help them. Sometimes you just need to get your foot in the door. Who cares how you do it? Same thing is happening to me.",
            "Don't let the imagined (or not imagined) opinions of others bother you. Seize every opportunity handed to you. Work hard so you can find ways to work smart later on. And understand that a lot of people get nervous during interviews. Getting an interview right takes practice and a little bit of luck.",
            "Haha it’s completely normal to get super nervous, especially for your FIRST interview! Just keep doing them and you’ll get better. Trust.",
            "The people I know who’ve told me that they think they did awful in an interview had job offers from the company they interviewed with anyways. So you may think you did bad, but in their eyes you might have did just fine.",
            "bro just quickly fail 15 to 20 times more, which happened to me when I switched to programming from Accounting/Finance background, and you'll be much closer towards success.  Keyword: keep interviewing with minor improvements each time",
            "Daddy will fix it",
            "I went to a welcome party where everyone in the room with me for about 12 people to a good company and every single person knew someone in the company including me. It’s the way. The job market is tough if they give you an offer take it.",
            "Nah man don’t worry about this take the opportunities you are given. You got this. You will get this internship.",
            "I got my first CS / programming job through an acquaintance. I felt no guilt, just slightly bad for not having met his expectations and having lied slightly about my experience and expertise.\n\nHe fired me after 6 months. I built my first desktop app on my own, for a university cafeteria. It was to do with stocks, products, sales etc. \n\nI built that in 3 months with the knowledge and commercial experience I received in those 6 months. \n\nLater on, I had an issue I could not solve, so I called him. He helped me with some complex SQLs and 2 months later he called me back to give me a second chance.\n\nHe said that he didn't expect me to build an app on my own, least to say with that complexity, etc, and he also gave me a raise.\n\nSo....yeah. Take it and build on that, prove them that you deserved the chance and help them as well in the process. At least that's what I would do.",
            "What nerves, is it being on video? The personal questions? The technicals?",
            "Speaking from some experience: using connections to get an interview is a fine and normal thing. When you get to manager make sure you make an effort to seek people without connections and give them a chance. Nepotism is the norm not the exception. \n\nThere’s another concern here which is that you’ve somehow embarrassed the people who got you the interview. I want to assure you that happens all the time and isn’t a big deal. If you’d taken the job, refused to do work and quit in 3 weeks, then it might have reflected poorly on your family/connections. But “yeah we gave the kid an interview and he blew it” isn’t a problem, they gave you a chance to work on your nerves and no one wasted hardly any time on it.",
            "U may suck but at least u are aware of it. Dont give up",
            "Don't worry! It'll be ok! Shit happens",
            "Hey man its ok!! Send them an email thanking them for the interview and if u can remember what they asked you, that you think you failed  on, maybe send them the correct answers now that your home and not nervous. At least it shows you know how to do the problem if given time. Tell your dad exactly what you told reddit! He might give you a hard time but acknowledge the fact that you know you could’ve done better. Shit happens! If your still in college then its deffinetly ok man, I’m two years out of school and sometimes struggle with basic technical stuff off the top of my head, so no way they should expect someone still in school to know everything, even if its a question they consider easy. Take it as a learning experience to kill the next technical interview you get. Good luck homie you got this!",
            "It’s ok! make sure you make the most of this opportunity/internship. It’s alright some are lucky to have such support others not so much. That’s just how life is. Be grateful to the universe and your fam and give them(work) your best.",
            "I don’t work in this field, I own a business in IT, but I can tell you having that kind of mindset is exactly the type of people I like to have. From a management position seeing that you already acknowledge your mistakes and know you can improve on it is a set of skills a lot of people don’t have. If I were you I’d let them know you didn’t do your best but your confident in your ability to improve. Companies like people that are willing to always improve in their expertise and a internship is meant to be exactly that. Good luck!",
            "No harm in taking advantage so hope you don’t cry over that! \n\nFirst interview? I was hard af on myself, bombed at least 3 before really getting the hang of it!",
            "Hey i needed this. :)",
            "\"  it was my first in person interview \", if you do something for the first time and don't succeed, you didn't  fail - you tried/explored. If you keep not succeeding for the same reasons you did for the first time, repeatedly, then it's a problem."
        ]
    },
    {
        "post_id": "18d3np1",
        "author": "supremeIs",
        "title": "Got an internship offer at my dad's company. Don't know if I should accept.",
        "url": "https://www.reddit.com/r/csMajors/comments/18d3np1/got_an_internship_offer_at_my_dads_company_dont/",
        "score": 662,
        "num_comments": 210,
        "created_utc": 1701978083.0,
        "selftext": "As the title says. I don't know if I should accept. I know the whole time I will feel the urge to prove myself, everyone will think I'm a nepo baby etc. It's a pretty well-known software company and it would be a fantastic opportunity people would kill for, it's just I don't want to be a nepo baby. I wasn't interviewed by anyone that works for my dad, I will be working in a completely separate department. Should I still accept, I only have two days. I am still waiting for a few other companies to get back to me, but it's unlikely I will secure those job offers especially considering how bad the job market is.",
        "permalink": "/r/csMajors/comments/18d3np1/got_an_internship_offer_at_my_dads_company_dont/",
        "comments": [
            "Those of us without neoptism options would kill for your spot. Take the job, survive 2 years, and use it as a stepstool to get to the next job.\n\nGetting a job, esp as a young person is WAY too hard right now. Take it",
            "At the end of the day it’s just an internship. Even if some people call you a nepo baby, so what? As long as you are hardworking and proactive I think it’s ok",
            "[deleted]",
            "Just accept it for now. And if you get a better offer, pick the better offer",
            "I’d like to also add that your Dad didn’t work his butt off for you not to have this opportunity. This is what hard work is meant for. My daughter will be a nepo-baby because I hustled. That’s that. Appreciate your parent for their hard work",
            "As long as you come in first day charged to get shit done, people will respect it more than anything.\n\nSource, worked adjacent to a director and their kid, kid was definitely talented and didn't flex their parent for any reason on the job. They got shit done and were a general pleasant time to be around. Director too. Overall, just don't put it in people's faces for any reason and keep your palms open.",
            "Take the offer",
            "Take the offer, but one day, pay it forward.",
            "I wish I could be nepo baby, just take it.",
            "enjoy follow rhythm ossified fanatical jeans unused selective slim piquant\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Lmao all of tech runs through referrals and nepotism if u have the skills to go along with it 😂",
            "I personally wouldn’t care about someone being a nepo baby in my team as long as they actually brought value so I’d say go for it the experience would be great for you",
            "who cares what the people think, i wish i had some nepotism to help me. you said yourself you didn’t get any help, you don’t owe anyone an explanation for your opportunity",
            "Had a kid at my internship who’s dad was high up. He did fine and was smart, no one thought less of him to the best of my knowledge.",
            "Do it. I know a nepo baby and he got a Google SWE interview (not STEP) as a Freshman because he nepo’d at Coinbase in HS",
            "Your next job won't know that you worked at the same company as your father.  You are being given an opportunity.  You should take it and be thankful.",
            "give it to me bro, since you don't seem to want it",
            "Who gives a shit, will be great in your resume. Just take it.",
            "Don’t care what people think. Many people would kill for that opportunity, don’t let it go to waste. Experience is valuable.",
            "Lmao who cares what other people think. This world is unfair, take the opportunities you have available.",
            "If you don’t have any offer just take it",
            "nothing wrong with it. do what you gotta do.",
            "Take it",
            "Does the opinion of someone who calls people \"nepo baby\" even matter anyways?\n\nTake the job.",
            "Who gives a fuck about it people think the only reason you got it is nepotism. That’s how the world works. People would kill for that opportunity don’t be foolish. Take the job.",
            "Why feel guilty? This is the power of following in your parents footsteps. Are you a nepo baby? Who cares. In this economy you need every advantage you can get. You can bet your ass your competition will. Crush the internship, make your dad look good in the process, and enjoy being able to have lunch together",
            "Nothing wrong with being a nepo baby.",
            "if you have a leg up in the world just take it",
            "The world is chock full of connections and relationships and networking you'll never know anything about.  Stanley Zhong is all over over the news for working at Google after getting rejected at a bunch of super reachy colleges (not news) and having good options open to him.  His dad works at google.  What a shocking coincidence.\n\nUnless you're sitting on 2 offers, yes, take it.  And be ready to hit the ground running when you get there.",
            "Do it. Doesn’t matter what others think.",
            "Absolutely take it. There’s nepotism everywhere and although people can have understandably mixed feelings of the morality of familial nepotism, the market is awful and you’ve got to look out for yourself. Also over my few internships (I’m 2 years out of college now) I’ve seen the majority of interns had a connection at the company, half of the time it was a family member (I was one of them). And in my experience people don’t know or care who your connection was (especially at a big company) or presume you’re any less qualified because of it. AND you’re in a different department, that’s a bit better than my situation was lol. \n\nAt least those were my thoughts then I re-read and saw it’s a well known tech company!??? That honesty changes everything(in a good way) like even if it was way sketchier like your dad was your manager id still take it if I were you. Good experience at a good company will boost your resume so much and probably be the main thing that lands you at your next internship/job that’s even better.",
            "Take the job, and prove yourself.",
            "Accept it. Oftentimes in large companies that is the norm. I applied under a different last name to a different department at my moms company too. no one will think you are a nepo baby unless you are horribly incompetent.",
            "Just take it but work your ass off",
            "By “dad’s company” do you mean company your dad owns, or company your dad is an employee at? Bc those are two different things lol. Don’t worry about it, just be grateful for the privilege that you have.",
            "Join the company, work your way up as you learn the family business, take over from your dad and make the company greater than ever. You or your children can then run for POTUS. Why take the detour working for someone else and start from scratch again?",
            "You should be glad that your parents have worked hard for you to be in this situation, no need to feel ashamed",
            "i have feeling you’re going to take it anyways but tbh i wouldn’t blame you in this economy take it anyways",
            "Mate, take it. Unless your dad is literally your boss/bosss boss/direct coworker. $5 says plenty of your future coworkers got in through connections. Take the opportunity, get it on your resume and be able to escape the clutches of this dreadful Reddit",
            "Nothing wrong with taking a nepotism job.  Just be open about it, as long as you're not bragging nobody will care.",
            "Your first and only problem is giving two cents about what others think! Take the job.",
            "Take it, who cares what other people think. Most people that judge you are jealous of you! I personally think as long as you work hard and don’t brag about anything, people won’t care",
            "Why don’t you use your mom’s surname to be in that job? You obviously don’t need the money, so you don’t have to starve while learning.",
            "life is hard enought you dont need to make it harder.\n\nif you really wanna make the world better, take the chances you have, and help those around you that didnt have as much luck.\n\njust be mindfull of the advantage you had when comparing your life with others, offering advice and voting.",
            "Networking is legit. It's kinda like nepotism. We all use it, or would use it. \n\nTake it and use this to move up. \n\nReminder that the market sucks rn and you don't want to be swimming in it.",
            "Just do it just pay it back in the future .",
            "In this market and economy? Take it and ignore the haters.",
            "concerned ancient retire library adjoining subtract wipe physical scale juggle\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Dude just take it, yes you are never going to beat the nepo baby allegations, but like man it is what it is. I would KILL for an internship right now",
            "It’s interesting how nepotism is so negatively viewed in western culture. I’d say it’s ingrained into eastern business culture, and openly so.",
            "accept it and use NEPOTISM to move up",
            "Take it and pay it forward.",
            "People will judge you for “having it easy” but they would gladly accept the offer in your position, I always say to myself, a majority of people have different opportunities, whether it be better education , good family, social skills, money, less traumas, etc. , don’t waste the opportunities that life gives you, and don’t feel bad!",
            "Who cares, the world runs on nepotism and who you know. So many people get hired because someone recommend them. Take the opportunity and see what you can make of it",
            "How is your dad?",
            "if I were in your shoes, I'd take it. but I'd also keep in mind for the rest of my career what a pivotal role luck played into my success. I'd say, don't be a butthole or push other people down wielding your accolades/this internship if you don't know what other people's privileges were. \n\nIf people were honest of their privilege, honestly, I'd carry much more respect for them. It's the hypocrisy of nepo-babies who brag about their hard work and downplay their positive circumstances or luck that makes them so disliked.",
            "this is so wack, am i missing something? it’s not like anyone will know your dad is the owner right away? unless you actively make it known or something?",
            "Turning down a job because you think people will see you as a nepo baby is such a nepo baby thing to do.\n\nAccept it, learn from it, use that experience to show that you're truly qualified for the next job to apply for, if that's something you end up wanting to do.\n\nJust think of it as being given a learning experience if you don't think you are truly qualified. If you do think you are truly qualified, being a nepo baby doesn't matter. You're able to do the job you're hired for.",
            "Don't be dense. Take the internship.",
            "Take it. I envy those who have opportunities like yours w family. If someone treats you poorly, they’re just an asshole, and those are everywhere. The fact that you’ll have an internship on your resume means so so so much",
            "Stfu",
            "The real question is… will they say it to your face?",
            "[deleted]",
            "Take it if it’s the only/best offer you get. Any internship is better than no internship. People get internships through others all the time and you would not be the only one, it’s literally how companies operate. Also, you don’t need to tell others you got there through your dad you can just keep that to yourself and no one will judge. Even if they know somehow, then so what? Lots of people are hired through referrals.",
            "just take it and keep applying. Worst case you have an internship, best case you can apply without the worry of not having one. I doubt your dad will blacklist you if you decline his offer later on",
            "How high up is your dad?",
            "why dont you train to take over your dad's company instead",
            "Can you actually do the job? I'd it actually in your wheelhouse? If they give you actual work, it'll be a real deserved job",
            "You messed up being born in a privileged family. Your dad should have known what’s best for you.",
            "I wish I was a nepo baby. Take it. Most people would do the same if they were in your shoes.",
            "Nepotism to me is more 'my son is now your ceo', not 'i let me son have an internship' : the scope is very different",
            "Take the internship, don't let it go to waste, and don't let other people make you feel bad for getting a unique opportunity.",
            "It’s all about who you know. Your dad being at that company just saved you the extra step of having to make that connection. Nothing wrong with that!",
            "Accept and then become ceo",
            "Fwiw, we've had kids be interns at my firm and no one has treated them differently.  In fact, our best ones were kids of employees. Not because of pressure or anything,  just , I dunno,  they always worked out. Don't overthink it. Work hard and respect everyone.",
            "Anyone discussing nepotism in good faith doesn't immediately have a problem with someone just because they were able to use it in their favor. The problem comes when you go on to become successful and deny that it gave you a leg up in life.",
            "Regardless if you take the internship or not, you will still be a nepo baby, you already got the advantages, instead of trying to sell the make it out the mud story to others, take the silver spoon you have been given, there shouldn't be a shame in having a good life set up for you.",
            "You should",
            "Take it.",
            "> I don't want to be a nepo baby\n\nAlready are.\n\nTake the offer.",
            "everybody who never had this option would use that opportunity if they could",
            "Can I have your skin if you don’t want the job?",
            "The world is run by nepotism. Take advantage of your connections",
            "Personally I don't think nepotism is something to be ashamed of as long as you are honest about it and prove that you can work as hard as everyone else. At the end of the day most people would do the same thing for their kids if they were in a similar position.",
            "If you don't have other options, just do it. \n\nThen you'll have it in your resume and will help you to find other opportunities in other companies.",
            "Just do it no one is really built on their own efforts. You didn't will yourself into existence. Prove yourself by working hard",
            "Just an \"internship\" for few months, Accept it! Why not? Working in different department, even if it is in the same department, I would take it.  Think about how your resume will benefits from this internship, not where your dad works!",
            "Don’t feel guilty about your advantage.",
            "Take it, and do a great job. Nobody minds a nepo baby who actually works hard.",
            "You not taking the job, is being a nepo baby. Another engineering student and myself are in discord discussing how bad the market is, please take the job lol",
            "GET IT. use the opportunity you have",
            "Take the offer. Life gives few advantages. Take every one you get.",
            "YES ACCEPT IT BRO",
            "Unless you want to be unemployed, take it.",
            "I have a similar mentality to you, except it's that my dad wants to get me a job at his workplace. I have never had an internship or job. It just feels like such an unfair shortcut. I don't even really feel competent enough to get a job there. Most people think we should just abandon our morals and take the easy route. I think it's because so many people in this industry get autistically obsessed with money that they will do anything for a pay raise. I'm not in immediate need of a job, living with my parents with few expenses, so that's definitely a part of my mentality. Call me crazy but I would honestly rather work at walmart than use my dad to get ahead.",
            "Just own your nepo-babytism",
            "The economy is not doing well enough for anyone to worry about pride right now.  Take it.",
            "Yea take it. Fuck what others think about nepotism",
            "Networking is what you should call it. If people can utilize their LinkedIn connections, you should be fine with utilizing family connections.",
            "Big difference if “my dad’s company” is a place that he founded / is top executive vs “place where my dad also works”…",
            "Life is hard enough as it is. Don’t try to make it harder on yourself when you have a good thing coming.",
            "Just do it until you get a better offer somewhere else lol",
            "Nice",
            "If you don’t accept it someone else will. You get nothing in life for being “the good guy”. Accept it.",
            "That's how the real world works, take it.",
            "Don’t ask stupid question, nepotism baby !",
            "Why would you apply for the job to only turn it down the last minute? Take the job, do your best, and polish up your skills. People will always have something to say about everything.",
            "No worries! Those other companies will definitely get back to you, and you’ll get a job elsewhere on your OWN merit.\n\nNow, if you really want to prove yourself not a nepo baby, give me the internship! I will take your place and I promise not to disappoint your dad.",
            "If Elon Musk can take emeralds and tell people he came from a middle class family, you can take an internship at a tech company.",
            "This is how every other engineering discipline works.",
            "Bruh, the whole world runs on nepotism.",
            "Take it. Its internship and you will take experience towards your other jobs. Most of internships are received through networking anyway. If you will feel like being a nepo baby affects you there then you could choose to not ask for a ft job there after internship. However its fantastic start and will look good on your resume. Also to get more self sense you can apply for few internships and go on interviews. It will give you a useful experience that you dont have right now being fresh unexperienced and potentially nepo baby",
            "Take it, that nepo baby bullshit is just that. You’re either good at it or you’re not, find out.",
            "Work with your dad. It's a cool opportunity with your family. Idk about you, but I would give pass to people who are immediate family. Third aunts cousin nepo babies are different lol.",
            "Your offer should be rescinded for asking such a dumb question lmao. In what world wouldn’t you take an internship offer, unless maybe you have other offers.",
            "Refuse and offer me the job instead pls",
            "Yes.",
            "yeah you probably feel embarrassed or whatever but understand the job market is a shitshow rn. take the offer if you don't have any other offers.",
            "Yes go for it , why not? You got it on your own :)",
            "If you are in different departments and got interview by people who don't work directly with him, I don't see a problem. Life is about taking advantage of the opportunities we have. (In the most morally way)",
            "I’ll take it if you want to pass on it",
            "Take it dude. Don’t worry.",
            "You can give it to me if you don’t want",
            "Get over your insecurity and accept it.",
            "I've always thought that nepo babies who recognize their privilege and use it to excel and uplift others are a lot cooler than nepo babies who pretend they aren't fortunate and try to \"prove themselves\".\n\nLike the other commenters said, take the opportunity. It's rough out here and you can use whatever step up you have to make the ladder more accessible for others down the line. Literally the only thing turning down the offers does is shoot yourself in the foot for... what? So that others don't judge you for being a nepo baby? C'mon OP.",
            "I was in the same situation as you for my first internship and even I didn't want to be seen as a nepo baby and was skeptical about taking the offer. \n\nBut trust me it was the best experience ever and I would have regretted it if I didn't take it up. I gained invaluable experience and was a part of an amazing team.It was the best internship ever.",
            "Is the organization large enough where not everyone knows your Dad? If so, I wouldn't worry about it. But at the same time if you're hired, I'd disassociate yourself from your Dad when you're at work.",
            "If you don’t care about how others perceive you and  perfectly okay with the prejudice (on reasonable grounds) you’ll deal with as everyone will know you didn’t earn the role like them, it was handed to you, then why not. \n\nLook, the market sucks. Why not get your dad to use his network to connect with you a company that’s hiring, so at the very least you’ll get an interview. And if you’re a decent engineer, you’ll get through the interviews. I don’t know, I would have some boundaries on exactly how much help we should take from our wealthy and successful parents. We should use their help but at the same time, we want to prove ourselves, solely on our own individual merits. So it’s a balancing act. \n\nFor wealthy rich and successful people, their greatest asset isn’t the money or success really, it’s their network. If my mom was, idk, the ceo of a startup valued at 1BB, I’m sure she can prob get me interviews anywhere I wanted, with virtually no work experience. Would I want that? That’s another question. I def wouldn’t want to start my career working at her company, riding her success without anything to show for it.",
            "Just take it and be thankful for your opportunities in life, maybe when you’re older you can pay it forward",
            "dude i’m 24 been through college have had a career job since, had 3 internships 2 at fortune 50. in my experience If someone’s parent had an in at a big tech and DIDN’T get their kid an internship it’d be weird lmao being a nepo kid is one thing when your job is important and/or you’re unqualified but at your level that’s something every professional adult should be looking to offer young adults they care about take ts put it all over your resume and try and land something you think is cool on your own next summer",
            "Take it. Even if he somehow played a role in getting you a job (how?), the whole point of working hard is to provide a better life for yourself and your children. If you really feel that guilty about it, pay it forward someday. Take a chance on a new grad from a less impressive school/ less fortunate background someday.",
            "Dont be an idiot take the job ! people are literally starving to death for an opportunity...humble yourself and stop worrying what people think...you are grown now this aint high school its life....my 99 year old grandma told me that once and it stuck with me !",
            "this is your life bro. anyone would take this opportunity. even if you were a nepo baby, there’s nothing wrong with that as long as you’re hard working. it would be a byproduct of your dad’s success.",
            "Yep do it. Anyone else in your shoes would do the same. This is your way in. I’d go for it.",
            "These thing has been going on for time in memorial, what different with you is that you know your privilege, and you are aware of ethical implications. Which is why I think you deserve this position. Go for it!",
            "Just take it Mr. Musk Jr.",
            "There's nothing wrong in taking a job in your Dad's company. Imho it's not a nepo-baby if you're going into an appropriate role (junior dev, dev kind of role). If Daddy dearest is straight making you junior VP of X, then you might have a bit more to prove.",
            "Absolutely take it! I understand your reservations but in this economy it would probably look more snobbish to turn down such an incredible opportunity. I assure you your dad wouldn’t want you to loose valuable experience and opportunities just because he happens to be successful. Take the opportunity, work hard and most of all, don’t think so far into it!",
            "Don't be an idiot, take the job. \"Nepo baby\" or not this is a great opportunity in a harsh time for newcomers for you to kickstart your career",
            "Don't worry too much about this. You don't have to prove anything to anyone but yourself. Our duty in life is to do the best with what we have, so don't dwell too much on it.",
            "I wear my nepo baby dress loud and clear. I’m proud of what my parents did and I work hard to make them proud of me too! Take it OP",
            "can I be your brother?",
            "you're stupid if you don't take this job",
            "Why would anyone even know you are his son?",
            "I got an interview and entry level place where my  Dad worked. After I knew the team well enough I asked if they were annoyed because I came with my Dad working there. \n\nThe reply was, “Well, we did wonder if you’d be someone who thought they didn’t have to work. But as soon as you came and were friendly and worked hard, it was completely cool.” \n\nVery few people have an issue with someone who comes and makes their best effort and isn’t an entitled dick.",
            "I was a \"nepo baby\" before I got into cs. My dad was a director at a pharmaceutical company and got me an interview in a completely different department and I got the job. My dad's \"enemies\", if you will, used me to try and hurt him. I was set up to fail from the very beginning and was fired about 8ish months in and those people used that to try and humiliate my dad. We were all able to move on and find much better jobs but that time in our lives was pretty dark for me and my parents. I have younger siblings and whenever any of them approached college graduation my mom always heavily discourages anyone getting a family member a job in the same company.\n\nSo yeah your fears aren't unfounded based on my anecdotal experience. Office politics is nasty. I advise having a conversation with your dad about this. Although, I guess in your case it's an internship which is a temp position so it's probably not that relatable.\n\nBased on this though, if I was in your shoes I'd still accept the position given the job market. Just find out with your dad the state of office politics.",
            "Take the opportunity, prove urself by ur performance during ur intern. Nepotism sucks becos their incompetence, and that’s all",
            "Take it. Losing out on opportunities because you're scared of what people will say is a bad move, especially in this economy. Use it to get experience if nothing else, it'll come handy next job. Make sure you make the best of it.",
            "Bro, who cares? just take it",
            "Sure, take it. Just don't start bragging about coming up all by yourself when you've clearly had a leg up in your career.",
            "Just work hard and provide value for the company. At the end of the day, a lot of famous tech leaders are nepo babies or just mad rich.",
            "Take the opportunity, you shouldn’t feel bad that your father set you up for success. Any father would be proud to provide that for their kid\n\nJust pay it forward, do a great job and add value to other",
            "Take every advantage you can. Life is tough enough and  none of us get out alive",
            "Just follow these steps and you will be fine:\n\n1- Accept the internship\n\n2- Swallow your pride and ego and deal with the nepo-baby thing \n\n3- Make the most of the opportunity\n\n4- Build your Resume \n\n5-  Move on to trail your own path.",
            "“Don’t wanna be a nepo baby” dude I work hard so that my kids can all be nepo baby that’s kinda the point of being rich. Don’t sweat it just help out others less fortunate than you along the way.",
            "You should accept it and push the nepo thoughts to the back of your head. The key is to take it, and don’t act like a nepo baby and do really well. Do better than people would expect.\n\nWe live in a world where connections and help and a dash of nepotism are needed. It’s always been like this, people just are more outspoken about the nepotism. \n\nAnd I’m saying this as someone that got every job on his own. Once I got within a company, my reputation took care of the rest. But holy hell that foot in the door is hard.",
            "Don’t except it. Give it to me instead",
            "Fuck the noise",
            "How do you think they got there? If they’re haters anyway & couldn’t blame you getting the internship on being a nepo baby, they’d blame it on you sleeping your way in. Unless you’re a guy, then idk - but they’d find something and run with it. Just milk the experience for all it’s worth & don’t take it for granted.",
            "Nepo baby it lol\n\nPeople shit on nepo babies because they (and I) are jealous.\n\nGiven half a chance I would nepo baby my ass out. \n\nBesides often times being a nepo baby doesn't mean you are like a little lordling in the company, it just means you get more chances and opportunities that others don't get and will be given more leniency when you make mistakes. \n\nBut it is your dad's company so he can make the choices he makes.",
            "Take it",
            "Grab it with both hands and be grateful",
            "I’ve been in a similar position. The main thing is if you take the job just stay humble and recognize that you are a nepo baby but that doesn’t mean you can’t prove yourself as a hard worker. I know a few people who got jobs from their family and will still make fun of others for not making much money and it’s just so distasteful don’t be like them.",
            "I interned at a company my mom had a higher up position in (In a different wing of the company but still). People can call you a nepo baby but in reality using a connection even your parents is how a lot of people get internships.",
            "Most ppl don’t fully “earn” their jobs nowadays they get in through connections. Enjoy your internship my guy",
            "Go for it, it is your future not the ones calling you a potential nepo baby. and guess what nobody will care in the future as long as you got the experience and knowledge under your belt.",
            "This advice applies regardless of what company you go to or how you got there.  If the position has value to you and you are capable of doing the work, take the internship.  People get in the door for all sorts of reasons.  Set yourself up for success.  Once you are in the door, prove your value.  You should not rest on your laurels or connections.  You should always strive to do your best.  If you don't know, ask.  If you received help, let it be known.  Good team members and management learn to work with people and share the credit.  They also own up to their mistakes and try not to repeat them.  In the end, it's what you make of the opportunities and how you feel about it that matters. Nepotism may get you in the door, but it won't make you successful.  That is for you to do.\n\nDon't discount what you may have learned sitting at the dinner table or in the room with your parents as they recounted their day at work or mulled over some issue.  I know that I learned a great deal from my parents sitting at the dinner table and sitting in the room as my mother and father talked about their day.  Some of it was how to handle company politics, some of it was about an industry that I had no interest in, ...  regardless, I listened, asked, and learned.",
            "Every single person in my welcome party at a tech company knew someone who worked there- it is more common than you think. Take the opportunity.",
            "Don’t take it, you’re right it will look bad. Give the position to me instead win win",
            "Stop worrying about what people that don’t pay your bills think.\n\nThe reality is A LOT of people have jobs that someone helped them get.\n\nThere is no shame in that.\n\nThe shame is paying attention to certain social media and their toxicity.",
            "I work full time at the same company as my dad. He’s a high up on the marketing side. Yea putting his name on application helped get my resume to the top of the stack but it def didn’t get me the job.",
            "You have our permission",
            "It's okay to take help when you need it. Hell, even when it's the best choice with no strings attached, just don't be an asshole. I only consider somebody to be a shitty nepo baby when they're clearly flaunting it, and/or being smug about it without anything to prove for it. or maybe even abusing their power. We all start somewhere, and like many people have said, if they had the opportunity they would take it.\n\nLife is hinged on luck in so many ways, it can be hard to admit. Don't throw your lucky situation/break away. Do it for the people that can't, but give back when you can when you're making your big bucks. You sound like you're self-aware, and a good person that cares about equity. It's okay man :)",
            "I think there is nothing wrong in nepotism. That is literally you're unfair advantage, make full use of it. Fuck the people who say it's not right, because it's only out of jealousy.",
            "Take the internship dude. Being lucky is not a bad thing."
        ]
    },
    {
        "post_id": "12yb04a",
        "author": "college-throwaway87",
        "title": "Just when I had lost all hope...",
        "url": "https://www.reddit.com/r/csMajors/comments/12yb04a/just_when_i_had_lost_all_hope/",
        "score": 661,
        "num_comments": 68,
        "created_utc": 1682405235.0,
        "selftext": "I FINALLY GOT AN INTERNSHIP OFFER!!!!!! \n\nMany months ago, I found out that one of my favorite startups was offering a data science internship. I had been using their app for over five years ever since they first launched and their mission is near and dear to my heart, so I applied immediately. I was super excited and enthusiastic when they got back to me asking to schedule an interview. Unfortunately, the interview didn't go as well as I would have liked, as even though I made a good personal connection with the interviewer due to my interest in the company, I was super nervous and messed up on some questions. My interviewer told me he'd get back to me soon if I am selected. \n\nMany weeks went by and I didn't hear back so I assumed I got rejected. However, I thought it would be worth a try to follow up, so I sent a brief follow-up email a month after the interview. Didn't hear back from that either. I continued applying to other companies but after hundreds of applications, I got only rejections and a handful of interviews/OAs that also ultimately ended up in rejection. Even after RippleMatch supposedly \"matched\" me with a company and told me that they wanted to proceed with an interview, that company emailed me afterwards saying they had actually rejected me and wouldn't be interviewing me! Like many other students trying but failing to get an internship during this year's brutal internship cycle, I became despondent. \n\nLast month, after getting my winter quarter grades back, I thought it might be worth a try to send another, better follow-up to the startup I'd interviewed with to let them know that I took and received in A in the database management systems class at my school, especially since I'd learned a lot of stuff that was relevant to the role. I knew the chances of it working were very low but tried anyways and put effort into the email to show that I was still passionate about working at the company. \n\nDays passed by with no response, so I just accepted that I wouldn't get the role and would have to try again next year. Since it's so late now and internships are drying up, I started making alternate plans about what to do in the summer and prepared for the worst. Then finally, a week after I had sent my last follow-up, my interviewer responded to me and told me he'd like to schedule \"a brief chat.\" I got my hopes up, but just a little because I knew that \"a brief chat\" could just be a codeword for rejection. \n\nFortunately, rather than rejecting me, the interviewer just asked me about what new things I've done over the past months since we last spoke and asked me when I could start. At the end of the call, he welcomed me to the company and said I'm hired for the role!!! I'M SO EXCITED!!!!! They're really flexible and letting me start after my finals are over which is nice because my university ends a lot later than most, and the internship is gonna be abroad in-person!!! That's a dream come true for me since I really wanted an in-person experience and it would be so cool to spend the summer abroad.\n\nSorry for the long post haha, I just got the offer an hour ago and all my family and friends are asleep so I just needed to tell someone about the good news. And I wanted to talk about the importance of following up and not giving up on your dreams. As dire as the situation for internships may seem rn, there is always hope.",
        "permalink": "/r/csMajors/comments/12yb04a/just_when_i_had_lost_all_hope/",
        "comments": [
            "Congrats dawg",
            "I like your enthusiasm haha, congratulations!!",
            "actual fucking w,  congratulations 🎉",
            "Congrats, good see good news others as well. \n\nIn Cyber but just received office placement is official have given me a spot at the Cyber department.",
            "Congrats on the internship offer!!! It's so awesome that you've landed your dream internship with a startup that you've been using for years! And even though the interview didn't go as well as you hoped, you didn't give up and persisted with follow-up emails, which ultimately paid off. And to top it off, the internship is in-person abroad! That's seriously amazing. Thanks for sharing your story and reminding us all to keep pushing towards our goals even in tough times. Good luck with your internship and have a great summer abroad!",
            "This is the way",
            "Congratulations",
            "Congrats! Where abroad is it?",
            "Hi Congratulations ! You mentioned that \" internship is gonna be abroad in-person\". Which country you belong to and what is the name of the company which offered this abroad internship ?",
            "Congrat dude",
            "Nice job!",
            "Omg congrats!",
            "Congratulations to you",
            "I am so happy for you.",
            "YESSSSIR 🙏🏼",
            "Congrats, Way to be persistent for something you wanted.",
            "Gg",
            "This is so wholesome :) Hard work pays off! Congrats OP",
            "Congrats!!",
            "congrats !!!",
            "OMG CONGRATULATIONS!!! OP W",
            "That's how winning is done!!!\n\nPower to you, OP! 👑",
            "PAWWWWWGGGGGGG!",
            "Congratulations! You deserve it!",
            "Whoop whoop! Congratulations🎉🎉",
            "Congratulations 🥳",
            "Congrats!",
            "congrats!! \n\nDo you think your follow-up emails were all read? Like if you didn't send those additional follow-up's after the email and after your quarter grades, you would not get the offer?",
            "LETS GET THIS MONEY BABY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "You killin it dude",
            "Congrats!!",
            "congrats",
            "Good for you mate!!",
            "Happy for you king",
            "Huge W, congratulations man!",
            "Congratsssss\nI'm also looking for data science/ml internships\nCan you please tell me what you think got you the offer?",
            "Love this for you !!",
            "[deleted]",
            "Congrats! :)",
            "Congrats! And wow, I love your persistence! As the saying goes: when there's a will, there's a way :)",
            "Super happy for you! 🥳",
            "Good job chief",
            "Congratulations, I’m going to be a DS major at UCSD and this post gives me a lot of hope!",
            "Congrats!! you deserve it.\n\nAs a new grad SWE already disillusioned with my job, your post reminded how hard I worked to get where I am now. Maybe I won't give up quite yet.",
            "Awe CONGRATULATIONS!! Hope you have a great timee",
            "You def go to ucla right, I know exactly what class you’re taking about",
            "this is so wholesome holy shit congrats",
            "Congratulations!! Much success to you going forward!",
            "Hell yeah man congratulations!!!!",
            "You’re a walking W right now. Cheers bro!! Congrats on the internship.",
            "[deleted]",
            "Big things coming your way",
            "Congratulations on  your offer. What's your opinion of ripple match btw. Would you recommend it? Thanks!"
        ]
    },
    {
        "post_id": "lvti6x",
        "author": "FitOffer9396",
        "title": "I’m a foreign student and this is why I won’t be returning to Google this summer",
        "url": "https://www.reddit.com/r/csMajors/comments/lvti6x/im_a_foreign_student_and_this_is_why_i_wont_be/",
        "score": 660,
        "num_comments": 83,
        "created_utc": 1614658203.0,
        "selftext": "I can't stand feeling like I'm being taken advantage of. My work and that of other Mexican students is being severely disregarded with Google's low salaries for interns working from Mexico.\n\nI'm happy to announce I've decided not to return to Google after evaluating their revised remote offer and deciding their compensation is a disrespect both to my work and skills and those of fellow students.\n\nLast year, one of the changes that we had to accept if we still wanted to work at Google was a compensation adjustment based on the cost of living in our country. It's worth noting that in 2020 Google made this adjustment while other tech companies that were still offering their program remotely didn't make any adjustments and paid the exact same amount they would've paid had the program taken place in the US, whereas Google paid about 10% of the original amount to its Mexican interns. Note that the interns have the exact same skills and knowledge as their US counterparts and that they performed the same work as well.\n\nIn other words, Mexican interns were only being paid 10% of the compensation while having the same skills and doing the same work just because they were located in another country. I've even worked at Google in the US before the pandemic and received their American salary, so it doesn't make sense to me that they're underpaying us this much because we'll work from somewhere else. The appeal of working at a place like Google vanished for me after reflecting on these facts. Because let's face it: even though it is an interesting company where you can do good work, there are a ton of other places where you could also improve your skills and learn new things, more so when salary is not a deciding factor.\n\nI won't give any specific numbers, but the salary of a Google intern is about 3 times the median personal income in the US, while the salary of an intern in Mexico (with the same skills and knowledge) is slightly under the median personal income in Mexico.\n\nI know for a fact that there are other companies paying the same or even a better salary than Google, some of which are Mexican, so for me it makes more sense to support a local company by working there at the same or a higher salary than working at a giant corporation that is literally underpaying me.\n\nLet’s not forget that not even the pandemic could stop Google and they’ve become even richer than before, so I don’t see why it wouldn’t be valid to make this kind of criticism. This is not a war against Google, it’s just a demand for more equality and fairness. I’d love for this to reach the people at Google who make these kinds of decisions so they could question what they’re doing.\n\nI know most of the people in this subreddit might be American, but if you're from another country and Google is also underpaying you, raise your voice! Demand more equality and fairness. I will personally work at another company that pays way more than Google.",
        "permalink": "/r/csMajors/comments/lvti6x/im_a_foreign_student_and_this_is_why_i_wont_be/",
        "comments": [
            "10%??? as in, if internship pay is 30,000 you get 3,000 if you’re in mexico?!",
            "It’s not about cost of living.  Vancouver BC interns are getting half Seattle salary.  The COL is nearly identical between those two cities (except for healthcare coverage).\n\nIt’s because they can.   They looked up internships with a closed border and noticed that Canadian and Mexican internships only required them to pay a small amount to reach the 90th percentile (or whatever their target) for SWE interns.",
            "I agree with you in spirit, but unfortunately almost all companies already did this even before the pandemic. Other than Zurich for some reason, it seems that all Google locations paid signficantly less than American locations. Having said that, it is interesting that Google is paying below average wages even by Mexican standards. That seems super weird and new.",
            "Seems pretty trash of Google to do this.\n\nJust curious - are there any large US companies in Mexico that have not done what Google has done (reducing total compensation to match country's cost of living)?",
            "some king shit in this post 👑",
            "Same thing with Microsoft... salaries are going to be “by Mexican standards”... they don’t even want to disclose them yet, but we know they will be low. Also, they don’t even know if they’ll be able to lend us laptops. I love Microsoft, but this is sad 😢",
            "Same shit happens in India, and not just with Google. It still hurts that a person with the exact  same skills, ability, energy, experience, etc will be paid like 5% cuz they were born in the wrong country, but that's life I guess.",
            "\nItsbkinda frustrating working at a big tech and seeing you are making 1/10 of your peers salary and sometimes doing 3x times the job lol",
            "[deleted]",
            "😩🙌🏽🙌🏽 absolute king/queen behaviour I APPLAUD YOU \n\nThese companies need to fucking REALIZE that they aren’t only fucking with our value but we are PISSED Microsoft, Facebook, Google all these SHIT companies need to value the interns the same otherwise we’ll fucking walk\n\nOn another note, these companies are crap, if you’re from Canada/Mexico heed this and look at how they will treat you, you are worth less than your American counterparts for doing the same fucking work! Don’t be docile, be pissed this is bullshit so standup for yourself",
            "[deleted]",
            "[deleted]",
            "They’ll sponsor your work visa and pay a competitive salary if you move here though.",
            "10 fucking percent???8",
            "Micdroppp 🎤",
            "[deleted]",
            "Yeah, I get your point but you kind of messed up here. I would’ve taken the offer and looked for a way to get an internal transfer to US or Canada. You’re an intern in Mexico, be humble.",
            "it’s the way the system works and how businesses operate under [redacted]. IF they can find a reason to pay you less, they will. To increase profits, costs have to be cut somewhere. You’re highly qualified and are doing the same work if not better quality and still being paid less? Chile... smh. It’s not right and it’s not fair.\nHeck almost no one working for a company is ever paid 100% the fruit of their labor. Even on LinkedIn, interns brag about projects saving or bringing in millions of dollars while only being paid 21k for the summer. \nIdk maybe we should like ... u—[redacted]",
            "Big tech sucks ass. go out and get what you're worth friend, you don't deserve to be undervalued by dicks like google.",
            "Sorry gotta down vote you til u throw up some actual numbers",
            "[deleted]",
            "Make this a blog post and share it on social media and tag google. May be linkedin. This needs more discussion around and is worth voicing out. \nThis is not a new thing and legally they can do this but in spirit , this is bad. \nSo i would highly encourage you to share it more public forum than here. Even if you make it anonymous.",
            "[deleted]",
            "I think the policy is to pay at the local cost of labour, not the cost of living.  The idea is to compete against other places you might work where you are.  Sounds like they nailed it, since they are at the median income.\n\nPerhaps the smart play for you would be going to another US tech giant who hasn't adjusted their local intern pay yet, then you could transfer to the states.",
            "Where are you interning this summer then?",
            "Wow this is absurd. Thanks for sharing this",
            "I'll be honest, had no idea google even took people from Mexico, News to me. an intern making medium personal income doesn't sound that bad to me..it's an internship, not supposed to be a job to provide for the family with, it's a learning experience that for some professions isn't even paid... This post feels very entitled but to each his own, if you think you are worth more get in there and earn it damn it! Best of luck friend",
            "Fuck Google",
            "> It's worth noting that in 2020 Google made this adjustment while other tech companies that were still offering their program remotely didn't make any adjustments and paid the exact same amount they would've paid had the program taken place in the US, whereas Google paid about 10% of the original amount to its Mexican interns.\n\nBullshit, at least Microsoft and Facebook did it too",
            "Which is why a lot of international students choose to work in USA because fact of the matter is the companies pay more here (pre tax I guess). Then USA is mad that so many people are immigrating but if companies just paid their employees equally irrespective of location they’d actually get them to be loyal. I think Microsoft is one company that does do this but I’m not sure.",
            "Mexicans should be grateful for the honour to work for google /s",
            "[deleted]",
            "I wonder if people are going to start using fake addresses or drop boxes for remote work so companies don't try to stiff them.",
            "How do we overcome this? Should we marry a gringuita? What do?",
            "For the love of God, kids: don't work for free."
        ]
    },
    {
        "post_id": "15tyz9z",
        "author": "aheze",
        "title": "Interning at Apple without going to college or doing LeetCode",
        "url": "https://www.reddit.com/r/csMajors/comments/15tyz9z/interning_at_apple_without_going_to_college_or/",
        "score": 656,
        "num_comments": 110,
        "created_utc": 1692304654.0,
        "selftext": "I just finished interning at Apple so I wrote this up. It's kind of long, but I hope it clears some stuff up about LeetCode and Big Tech. I see you guys posting about grinding questions all the time, so maybe this will convince you to do something that's more fun and actually applicable.\n\nI also posted this on Substack [with images](https://aheze.substack.com/p/getting-a-job-at-apple-without-going) if it's easier to read. \n\n* Learning To Code\n* Prior Job Experience\n* How Apple Found Me\n* The Interview Process\n* The Internship\n* Big Tech\n* College\n* Conclusion\n\n## Learning To Code\n\nI started coding back in 2019. I wanted to make apps, so I bought Angela Yu's [Udemy course](https://www.udemy.com/course/ios-13-app-development-bootcamp/) on iOS development. I checked out some books from the library — [Sams Teach Yourself iOS 9](https://www.amazon.com/Application-Development-Hours-Teach-Yourself/dp/0672337673) was really helpful, even though it was outdated and for iOS 9. I also bought Matt Neuburg's [iOS 11 Programming Fundamentals with Swift](http://iOS 11 Programming Fundamentals with Swift) as a reference, but it was extremely technical and so I set it aside.\n\nI followed Angela's course for a couple months until I got halfway, then got straight to work building my own app. I called it **Find**.\n\nLots of people talk about getting stuck in \"tutorial hell\" — watching endless courses and tutorials while being unable to actually apply what they learned. I was able to avoid this by jumping right into the app dev process — I'd code until I didn't know what do and then search up a solution. I wasn't worried about efficiency or the \"best way\" to do something — you naturally learn this stuff after doing it for a while. Angela's course was useful for getting started, but to get a good grasp at what you're doing, you should be building projects.\n\nAnother thing that helped was Stack Overflow. It's been kind of dead ever since ChatGPT showed up (and also the community is not at all friendly for newbies), but I'd still recommend [making an account](https://stackoverflow.com/users/signup). You'll be able to ask questions, but more importantly, you can answer other people's questions. \"Learn by teaching\" as they say.\n\nAnyway, it's 2023 now and Angela's course is outdated :( so I'd recommend starting with Paul Hudson's [100 Days of SwiftUI](https://www.hackingwithswift.com/100/swiftui) or [100 Days of Swift](https://www.hackingwithswift.com/100). But again, the tutorials are just for starting out — don't waste your time in tutorial hell and get right into building.\n\n## Prior Job Experience\n\nI didn't have much going for me besides my side projects. I worked at [Hyper](https://hyper.online/), a startup working on VTubers for iOS. I got the job via Twitter — Aaron (the founder) saw me posting my side projects and noticed that I liked anime in my bio.\n\nBesides tech jobs I worked at Rubio's Coastal Grill and was a cashier at Marshalls.\n\n## How Apple Found Me\n\nRemember my Find app? Someone on the Photos team at Apple saw it and DM'd me on Twitter. [Link to screenshot](https://imgur.com/a/1D8QXJ5)\n\nI had been posting about Find on Twitter for a while. Here's the [promo video](https://twitter.com/aheze0/status/1579305528018497536) that I posted for the v3 update. Here's an [animation](https://twitter.com/aheze0/status/1573753632549281792) I made for the onboarding screen and a [swift package](https://twitter.com/aheze0/status/1574616440941948928) that I published.\n\nI think it's worth being active on Twitter — even after Musk's takeover, there's a lot of tech bros and industry people there. People will see your stuff and reach out to you. You'll get opportunities that you otherwise would have missed out on — for example, normally you need to be in college to apply to Apple, but I was able to get around that.\n\n## The Interview Process\n\nIn November 2022 I went to Apple Park to talk with my would-be manager. We had lunch and walked around the campus.\n\nWe talked about what a role at Apple would look like, and decided an internship would be good (since I still wanted to go to college). I remember that my manager specifically pointed out that he didn't care about where I went to school or my GPA — he said something like \"it only matters what you can do.\" That day I also met one of my future coworkers, who gave me some tips on improving Find's scrolling performance.\n\nIn February 2023 I went back to campus to meet the rest of the team. I talked with another manager about old age, college, and kids. It was really chill, but this was probably the behavioral assessment — they wanted to make sure I wasn't some complete weirdo.\n\nThere was no LeetCode or technical interview. I signed the offer letter in March.\n\nObviously, this wasn't your normal entry-level big tech interview process. I asked some other interns about their experiences — most people had a coding problem (one of my friends got two-sum, the first question on LeetCode) and the personality interview was more important. But I'm sure that at a higher position, for full-timers, there's plenty of people who get recruited and get fast-tracked in the process. There's nothing stopping you from taking shortcuts or a different pathway when applying for jobs. Do something different, like DM'ing the lead for the team you want to join. Make them *want* to hire you, and the interview turns into a free tour of HQ, lunch included.\n\n## The Internship\n\nWorking at Apple was more work than I expected. I thought I'd be going in, having lunch, then leaving. I saw vlogs from people at Meta showing off the rock climbing wall and bowling alley that they had right in the office. My friend from Google was talking about how she had a couple meetings per day and the rest was just free time.\n\nWell, not at Apple. I was there from 8 to 8, to catch the shuttle. Before my intern presentation I was working up until 12 (but that's on me and my bad time management). You had to pay for breakfast/lunch/dinner and even the gym ($18/month). The prices were fair, but it's not like the free food and stuff you get from the rest of big tech.\n\nIt was really fun. I was doing what I'd been doing for several years, but this time I was getting paid. I met some really cool interns and people from the design team who were absolutely cracked.\n\nWe had free corporate housing (got to be 18+ for this, so my friend actually had to live with his cousin) in this brand-new complex in Mountain View. The doors had smart locks on them that seemed cool, but were always broken. There was a hot tub on the roof complete with pool table and everything.\n\nAbout the work, I was there from June 5th to August 11, so my time was relatively short and I had to cram to finish my stuff near the end. The corporate structure was definitely way different from what I was used to, but it's well managed and gets stuff done. If you get the chance, Apple's really worth checking out.\n\n## Big Tech\n\nWhen I browse this sub there's so many posts about LeetCode, DP (dynamic programming, not double penetration), FAANG, etc... there's people sharing tips on how to \"crack the interview\" and people saying \"the best approach is repetition.\"\n\nI feel like people are so fixated on LeetCode and all these other coding questions that they're forgetting that this is just one path to getting a job. There's plenty of other ways that aren't as hard and don't require hours grinding over some dumb problem. Is it really worth grinding so much? Studying the most advanced Data Structures and Algorithms that you'll easily learn just from building? And after getting the job, are you even going to use the stuff that you spent so much time practicing?\n\nBut it's true lots of companies now just use LeetCode as their main differentiator in hiring. We can thank Google for this flawed hiring process---asking the same boring, time-consuming questions that test for proficiency in a roundabout way. Is it a coincidence that Apple was the only Big Tech company that didn't do layoffs?\n\nThe LeetCode craze is a real problem in the field. Sometimes it feels like all the high-paying jobs require it, and as a result we see all these people burning themselves out over useless questions when they could be developing their skills organically.\n\nEventually I think Big Tech and the rest of the industry will move away from LeetCode and shift to project-based interviews. They might give you a take-home assignment and you can show them how applicable and relevant your skills are. But until then, I'd recommend working on cool side projects and doing stuff that matters. You'll become irresistible :)\n\n## College\n\nI'll be going to college in September, so I can't speak much on it yet. I just know that it's not necessary and even not applicable for some roles, like iOS dev. So don't stress if you didn't learn a thing.\n\n[How do I fix my career? I'm a Software Engineer who learned northing during college](https://www.reddit.com/r/cscareerquestions/comments/15swcy4/how_do_i_fix_my_career_im_a_software_engineer_who/)\n\n## Conclusion\n\nSo that's how I got my job at Apple without going to college or doing a single LeetCode question. But I'm not saying that you should drop out or stop doing LeetCode completely — you need college for stuff like ML research and you need LeetCode for backend. It's just that I see a lot of people just trying to get a job — any job — in tech, and they constrain themselves to a specific role or profile. That's definitely not the play in this horrible job market.\n\nThanks for reading!",
        "permalink": "/r/csMajors/comments/15tyz9z/interning_at_apple_without_going_to_college_or/",
        "comments": [
            "This is a very rare experience lmao\n\nEveryone else reading this, get back to leetcoding",
            "That’s a super cool path and it’s awesome that someone headhunted you like that, but I think you have a ton of survivorship bias here. This type of thing is very uncommon and not a feasible path for the average person, so I wouldn’t criticize people for trying to take the normal path to this type of career. What would have happened if that specific Apple employee with that level of power didn’t see your post?",
            "With all due respect, great job, but I don't think anyone here wants to be lectured by someone not even in college yet about how leetcode isn't that important and to simply just build an app and pray you get DMd by an apple employee lmao",
            "Congrats but exceptions are not examples",
            "How wild haha just read like your post on LinkedIn",
            "Cool\n\nNobody should take this story as advice for themselves though",
            "[deleted]",
            "Awesome post! It's cool to hear stories like this.",
            "[deleted]",
            "Very impressive app and video you made for it",
            "I know people who has built an operating system or a programming language who haven’t got offers like that. You should get lottery tickets",
            "So that’s what DP means..",
            "Too bad you’re getting downvoted. I am near the end of my college experience, but my best jobs and internships have come without a ton of intense technical interviews, and nearly always through networking on/offline. \n\nI still think leetcode is important. But I certainly think more people should be thinking outside the box like you’ve described. Build stuff, publicize it, dm people you interested in working with, dm recruiters, etc. \n\nI for one am happy to see this kind of content on the sub.",
            "Holy god I have so much to catch up on. I have no idea how the heck you built what I just witnessed. Any tips? What was the evolution of your coding?",
            "jobless mfs on this sub so salty lol ... they love leetcode bc they don't have the vision to actually create something of value independently and would rather be a mindless leetcode corporate automaton ....",
            "Another based take as usual from u/aheze",
            "I do think there’s some luck involved, but it is very true that if you want to get a job at a big tech company, you should do way more than leetcode. Leetcode ain’t gonna give you a good resume. It ain’t gonna help you network. It ain’t gonna make your interviewer like you. Leetcode is just to get you over the barrier of “ehh this person is technically competent”. And if you can prove that you’re competent through other means? Yeah the leetcode barrier is gonna be a little lower.",
            "Luck plays a very important factor.",
            "this is proof guys that making a *useful* and unique personal project is the best way to learn and to show off your skills",
            "[deleted]",
            "now touch some grass. when you're successfull be humble",
            "From what I read, Apple is a FAANG exception.  They don’t seem to have the same sociopathic tendencies as places like Amazon.  It looks like they invest in finding talented well-rounded people instead of leetcoding robots. I also don’t hear about stack-ranking at Apple.  OP took some initiative and it paid off.",
            ">they wanted to make sure I wasn't some complete weirdo.\n\nMe: I'm a reddit moderator\n\nApple: Get out!",
            "What's the difference between find and other picture apps?",
            "So...basically \n\n...\nAre you telling me that there's a CHANCE to work in the IT environment, and, get a good pay by not having a bachelor or master degree? Are you sure????",
            ">(dynamic programming, not double penetration)\n\nThanks for clarification.",
            "PLEASE add a sort by size feature, I just seen your promo video and see many of these have now been added to IOS. How come they didn’t add sort by size?",
            "Survivorship bias",
            "Oh Shit I follow you on Twitter! You’re hilarious and talented. Keep it up 👏",
            "i follow u on twitter, proud of u bro!!!",
            "Good job my guy, you did it, you picked a topic, learned it and did imo an amazing app that demonstrated your skills. And good for Apple to use that app as a technical interview, at the end of the day all a technical interview is a demonstration of your skills. Congratulations dude, hope you land the position when you graduate!",
            "There are about a million different paths that might lead someone to land a big-name tech job. I wouldn't say however, your path is very realistic for the vast majority of people. The fact is, almost every ambitious new grad or CS student with no work experience is pumping out personal projects to impress a recruiter. That is just one aspect of the process, to get you past the resume screen. Beyond that is the technical interview which nowadays is going to be some ungodly dynamic programming problem that a third-year CS student isn't going to know what to do with.",
            "Nice post, finally something nice to read amidst all the stupidity going on in this sub",
            "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: iOS 9 Application Development in 24 Hours, Sams Teach Yourself (7th Edition) \n\n>**Company**: Books\n\n>**Amazon Product Rating**: 4.0 \n\n>**Fakespot Reviews Grade**: A\n\n>**Adjusted Fakespot Rating**: 4.0\n\n>**Analysis Performed at**: 03-14-2020 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/ios-9-application-development-in-24-hours-sams-teach-yourself-7th-edition) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
            "I don’t think this is as rare as most of you think. I talked to an employee at google and he told me “we hired those who can show they know what they are doing” grinding leetcode does not show you know how to code, it shows that you can remember the answer to leetcode problems and this is honestly a waste of time. \n\nBuilding an app shows you know how to code and posting it on the apple/play store is even a bigger achievement and this is what attracts employers. The day an age we live in is all social media based. Use that to your advantage to display and post what you know. Build that app, start that side hustle and if it’s good enough you will get recognised for your work. That’s what happened to me and I an a full stack software engineer at Amazon. But took hard work and importantly PATIENCE. \n\nBest of luck to all of you. \n\nHappy Coding !",
            "Lol, everyone on this sub disagreeing lacks creativity which is an important skill for a developer.\n\n  \n\"survivorship bias\"\n\n&#x200B;\n\nLMFAO.\n\n  \nPEAK COMEDY the doubters and haters, you're smarter than 99% of the people who are talking down on your experience. It's a skill to be lucky.",
            "I can see why ppl are critical of this approach but u can def take away stuff from this as well. Thanks for posting!",
            "Hey, fellow Apple intern with a similar-ish kinda story (didn’t write any code in my interviews, mostly talked about technical things and my apps). Glad to hear things went well for you and that my experience with Apple’s intern interview process wasn’t a one off!",
            "Finally some quality content.",
            "oh shit hey andrew I love your twitter posts"
        ]
    },
    {
        "post_id": "zbxw1o",
        "author": "None",
        "title": "Wear glasses to your interviews!",
        "url": "https://www.reddit.com/r/csMajors/comments/zbxw1o/wear_glasses_to_your_interviews/",
        "score": 666,
        "num_comments": 83,
        "created_utc": 1670120665.0,
        "selftext": "I am blind as a bat and wear contacts but about 2 months ago I ran out of contacts so I resorted to wearing my glasses again. I got lazy and never went to go pick up some more but this was a blessing in disguise. The past 3 interviews I have passed the first two rounds with mediocre solutions to technical problems. I thought it was weird that suddenly I started getting further along in the interviewing process until I made the connection that my glasses was giving the interviewers a sense that I was smart.\n\nA quick google search confirmed my suspicion that glasses make anyone look smarter. Moral of the story is grab any pair of glasses and put them on before your interview and wait for the offers to roll in.\n\nHope this helps!",
        "permalink": "/r/csMajors/comments/zbxw1o/wear_glasses_to_your_interviews/",
        "comments": [
            "bruh",
            "🤓",
            "I have 3d glasses, bet I will look the smartest man alive",
            "I’ve always suspected this was the case and started wearing glasses to interviews specifically for this reason.\n\nPeople are idiots with biases",
            "Ironically, I have noticed the opposite effect. No luck when wearing glasses, but more luck when wearing contacts. I have a very strong prescription, so that could be why.",
            "Before I changed careers to get into SWE, I waited tables for over a decade.\n\nI had a co-worker who used to wear 0/0 glasses because it helped him to compartmentalize work from personal life. The job entails being friendly to strangers (basically acting), and it gets kinda weird sometimes because you're presenting as yourself. So this was my coworker's way of basically having an alter-ego, so it felt more like getting into character at work. Sometimes he would even use a fake accent. Hilarious but also kinda sad.",
            "I wear glasses every day because I'm black, lol. \n\nGlasses are my weapon against implicit biases and it works! I sense people see me as less of a threat and more of an actual person when I have my glasses on. \n\nI have 20/20 vision. I only started wearing glasses cause they're cute but kept wearing them when I noticed.",
            "Nobody tell OP the secret of walking around with a clipboard or folder and pretending to know what you’re doing. OP will be unstoppable",
            "Can’t stand wearing glasses and looking at monitor :/",
            "[deleted]",
            "Finally a bias that works in my favour!",
            "It’s the same reason influencers wear glasses when doing their “mental health awareness” videos though they’re not reading.",
            "Heh my first round of interviews and first few years of working I wore only contacts because I thought they were more professional. Then I forgot to renew my contact prescription in time so wore glasses to work. I got multiple comments about how wow I look so smart. Now I just wear glasses all the time because they're easier and I'm lazy and apparently the contacts I thought made me look more professional actually made me look dumber.",
            "I did the same thing, switched from contacts to glasses back when I was interviewing. It seems to give the impression that you are a more \"serious\" CS person.",
            "Gonna go pull my Oculus out",
            "Or, you got better over the 2-3 months of interviewing. It’s not only about finding the optimal solution, but also how you present your solution. Guess glasses didn’t made you smart enough to realise it.",
            "I’m pretty sure I should get rid of my glasses and start wearing contacts because I look better without them.",
            "I don't have glasses or contacts but I always assumed they would make employers find you less appealing because you also fit the stereotypical nerd with no game and no showers.",
            "lmao..",
            "This is stupid.",
            "Metaverse?",
            "Bro don’t spill the beans!",
            "Time to go Clark Kent.",
            "You must have been wearing your glasses when you came up with this.",
            "The psychological advantage is always important",
            "This has to be a joke. Is this copy pasta?",
            "Do i look smart?",
            "Not sure if this would work when applying for a management / lead role, probably the reverse applies…",
            "He cracked the code",
            "See what you did? Now we are going to lose our advantage...",
            "Shades?",
            "Brrruh wtf kinda advice is this."
        ]
    },
    {
        "post_id": "qpjw2f",
        "author": "XXX_BigBoi69",
        "title": "I got Amazon, Optiver, Capital One, Wells Fargo, Ford, & Instructure intern offers! Here's my statistics and salary details",
        "url": "https://www.reddit.com/r/csMajors/comments/qpjw2f/i_got_amazon_optiver_capital_one_wells_fargo_ford/",
        "score": 657,
        "num_comments": 336,
        "created_utc": 1636396370.0,
        "selftext": "**Amazon:**\n\n\\- 2 Online Assessments, 1 Final Round Technical Interview\n\n\\- $57/hr\n\n\\- $2000/month housing post-tax\n\n\\- Flight (2 Way)\n\n**Optiver**:\n\n\\- 1 OA, 1 Behavioral, OA Review, Final Round (1 Technical, 1 Systems Design)\n\n\\- $91/hr\n\n\\- $15,000 Sign-On Bonus\n\n\\- Corporate Housing\n\n\\- Free Breakfast + Lunch\n\n\\- Flight (2 Way)\n\n\\- In-Office Barista\n\n**Capital One:**\n\n\\- 1 Final Round (1 Technical, 1 Case Study, 1 Behavioral)\n\n\\- $66/hr\n\n\\- $6,000 Post Tax For Housing\n\n**TikTok:**\n\n\\- 1 Online Assessment\n\n\\- 3 Technical Interviews\n\n\\- $47/hr\n\n**Wells Fargo:**\n\n\\- 1 Final Round (1 Behavioral)\n\n\\- $40/hr\n\n\\- $2,000 Post Tax For Housing\n\n**Walmart:**\n\n\\- 2 Online Assessments (1 Behavioral, 1 Technical)\n\n\\- 1 Take Home Project + Live Demo\n\n\\- 1 Systems Design\n\n\\- $35/hr\n\n**Ford:**\n\n\\- 2 Behavioral (2 Separate Interviews)\n\n\\- $26/hr\n\n\\- Corporate Housing\n\n**Instructure:**\n\n\\- 1 Online Assessment, 1 Final Round (1 Technical, 1 Behavior)\n\n\\- $28/hr\n\n\\- Remote Work\n\n**JLG Industries**\n\n**-** 1 Behavioral Interview\n\n\\- $22/hr\n\n\\- Corporate Housing Provided\n\n&#x200B;\n\n**Application Statistics:**\n\n\\- Applied: 508\n\n\\- Rejected: 154\n\n\\- Assessments: 45\n\n\\- Interviews: 16\n\n\\- Offers: 9\n\n&#x200B;\n\nI am a second-year CS Student at UC Davis. I have no prior work experience. I am still waiting to hear back for 19 assessments and am in the final rounds of interviewing with Walmart and Oshkosh. I will update once I’ve gotten the results.\n\n&#x200B;\n\n**Update:** Got offers from both Walmart and Oshkosh (JLG Industries). I also got TikTok! Updated everything above :)\n\n&#x200B;\n\nIf you have any questions for me feel free to ask. I’ll try my best to answer as much as I can.\n\n&#x200B;\n\nEdit: I got a lot of requests to see my resume, so I've linked it below. I didn't have any work experience so I just shared a lot of projects I had done.\n\n&#x200B;\n\nEdit 2: Added updated job offers\n\n&#x200B;\n\nResume: [https://imgur.com/QH1uhA7](https://imgur.com/QH1uhA7)",
        "permalink": "/r/csMajors/comments/qpjw2f/i_got_amazon_optiver_capital_one_wells_fargo_ford/",
        "comments": [
            "508 applied, 45 assessments, 16 interviews over the course of a semester. Respect, can't even be jealous. You are a certified grinder.",
            "Damn you heard back from Optiver being a 2nd year at a non-elite school with no prior experience. That’s pretty insane congrats.",
            "[deleted]",
            "Rip your inbox 😂",
            "MF goated",
            "Hi. Congrats. Im in 2nd year too but u are so good far from me. Could I see your resume? I want to ty to be like you.",
            "[deleted]",
            "That’s wild you must’ve had some real quality projects",
            "[deleted]",
            "How did you structure your resume?",
            "curious what the system design round at Optiver was and if you prepared for it or not and how",
            "Damn bro.. all big name companies.. as a second year too.. u should be proud of urself dude! Keep it up!!",
            "Capital one pays in the 60s now? No wonder their interviews were much harder this year",
            "WTF is Optimer? Never heard it before, but 90 dollars per hour, free housing, a lot of benefits, and 15000 signing bonus for an internship? Go for that.",
            "Was the Amazon offer from the propel program? If so, how did you prep for the interview and was it?",
            "Hey! Thanks for sharing. I’m an econ major at Northwestern just added cs major in my late sophomore year and feel its too late for me to get into the game. Is it possible to dm u on how to prepare efficiently and anything I should know of. Thanks a lot in advance",
            "how did you find 500 companies to apply to? did you use [levels.fyi](https://levels.fyi)? did you browse linkedin/indeed?",
            "$15,000 signing bonus for a summer intern???!! This is insanity!",
            "[deleted]",
            "I’m a full-time MANGA employee making $59/hr in the Bay Area…wtf take the Optiver offer and start with a whomping salary once you graduate. Congrats!",
            "Capital One really trying to attract the top talent with that intern pay it seems, which is interesting. \n\nAre you leaning towards any offer in particular yet?\n\nPersonally if I were you I'd go with the Optiver offer. You're a second year so it's a good opportunity to see if you would want to work in HFT. And if you decide you don't like it, the consensus seems to be that HFT -> tech is much easier than the transition from tech -> HFT. And also the pay is insane lol.",
            "Damn you're god",
            "This is absolutely insane. I'm willing to bet of the 150+ companies that outright rejected you? Less than 5 of them were better than Optiver lmao. Congratulations man. I hope you enjoy the time you get to spend as a young HNWI because the revolution comes and we have your head!\n\nEDIT: Revolution, not relocation.",
            "Holy shit I didn’t know interns could make way over $50/hour. Damn stud, good job",
            "[deleted]",
            "Congrats! Did you do Optiver Quant or SWE?",
            "Hey the link for the resume isnt working, can you update it. it would really help",
            "Doesn’t optiver auto reject 2nd years?",
            "can you send your resume again? the link doesnt work",
            "idk if you will see this but for wells fargo what program/role did u apply for? was your process just one final round, which was a behavioral or a behavioral and a final round",
            "Capital One pays more than Amazon? I am surprised. Which role is this?",
            "Wtf is corporate housing",
            "Good work, you've done well. No need to flex tho.",
            "Thank you for sharing this. Good luck!",
            "Congrats ! How long did it took to hear back after capital one final interview?",
            "Whats the difference between a case study and behavioral?",
            "What’s your major and what are the titles of the positions",
            "Resume ?",
            "Congrats. You're done with walmart final round?",
            "Congratulations 🎊",
            "[deleted]",
            "Damn you're god",
            "Did you just do a basic ass application for these things? Or did you do some networking/career fair/know a friend at the company?",
            "holy shit $90/hr as an intern, nice",
            "Hey could I get your resume too? I'm really impressed by the offers you got as a second year student. Congrats!",
            "What classes, books, or online resources did you use to study for Optiver? I got bodied by the final round",
            "OP should add their resume to this post (and censor all personal info)",
            "Congrats man. What’s your GPA if you don’t mind me asking? Did you sacrifice a lot of your school work to apply to positions and work on side projects?",
            "Are you 2023 grad or 2024? I’m pretty sure that Optiver only accepts 2023 grads. But maybe  you’re too OP and they decided to take as an outlier",
            "mind if you PM resume you used for all the companies you applied for ? Also, mind asking how did you ago about preparing for interviews from scratch ? ( also gotta ask it, what was your leetcode count ? )",
            "[deleted]",
            "For Capital one, how long did it take to get written offer after the phone call from recruiter?",
            "Wait you get a sign on bonus as an intern?",
            "90 an hour holy shit? Is this normal? Are interns really making this much?!?",
            "By chance do you have the list of companies you applied too? Also, how many of these companies did you apply through reference. I’m so happy to see a fellow cs major do SO well with an internship! You will achieve great things my friend!",
            "\"A web scrapper\" -> \"A web scraper\"?",
            "LIL BRO GOATED\n\ncongrats \n\nI’m thinking about jumping from FAANG to HFT. let me know how optiver goes?",
            "Did you have any cs/programming experience in high school because goddamn that is impressive to learn more in 1 year than I have in 4 years?",
            "Wow. Solid offers! Congrats",
            "Amazon housing is also post-tax\n\nSource: former intern",
            "Is it too late to start applying lol",
            "Remind me! 2 weeks",
            "wow, your stat is pretty detailed. I visited UC Davis in the summer of 2018 intended to come back in 2019 for my Ph.D. But eventually, I decided to go to Australia. Congratulation on your results.",
            "We have very similar resumes I just can’t let code this is some fucking bullshit",
            "[deleted]",
            "Sorry if you already answered but what city?",
            "When did you apply to optiver?",
            "[deleted]",
            "This is super late, but congrats! Those are some insane offers. As someone who’s just getting into the internship scene for the first time, are there any tips that I should  keep in mind? Also, I’ve noticed that a lot of applications want you to list your past employments. Do you think what you list here matter a lot?",
            "💯",
            "500+ application, only get 4 interviews 1 offer here. 120 email rejections.",
            "Would you mind sharing a list of those you applied to?",
            "Did you accept Optiver?",
            "Which one did you end up choosing and how do you look back at that decision?",
            "How did you decide?",
            "Dam that's amazing! Congrats man :) I really hope to at least learn from the projects you've done. Link doesnt work for resume btw, pmed you!",
            "Dude, you did amazing",
            "Congrats! Hi, are you a rising sophomore when you applied for those internships?",
            "Hey! I stumbled across this post and was curious where you found so many internships?",
            "Thats still awesome after 2 years. What played a major role Networking or Resume ?",
            "I got assessment from Tiktok im in my second year too, but optiver seems out of league ! Can u share projects u made in undergrad"
        ]
    },
    {
        "post_id": "15tsxmm",
        "author": "Leader-board",
        "title": "New DEI, UPS and \"job market is bad\" posts are banned until further notice",
        "url": "https://www.reddit.com/r/csMajors/comments/15tsxmm/new_dei_ups_and_job_market_is_bad_posts_are/",
        "score": 656,
        "num_comments": 155,
        "created_utc": 1692291029.0,
        "selftext": "This is after many complaints about the overrun of diversity, equity and inclusion (DEI) and posts about gloom and a bad job market. And I have to agree - a post or two is fine (and that's how it used to be) - but this is clearly well above what's considered reasonable. There are many existing threads for those wishing to discuss about them.\n\nHence **new** posts have been banned from these groups without prior mod approval - see rule 14 for the full details. A few others have been locked.",
        "permalink": "/r/csMajors/comments/15tsxmm/new_dei_ups_and_job_market_is_bad_posts_are/",
        "comments": [
            "I agree, the politics of DE&I won't be solved in this channel.",
            "Jesus Christ 🙏🏼",
            "TY",
            "Thank you.",
            "I think some of the backlash in this thread perfectly highlights some of the issues with DEI. Too many people taking this as some sort of stance on racism or diversity by the moderators, when in reality it’s an attempt to clean up the posts in this sub and get them back to being on topic. diversity is good but when you walk around looking at everything through that lens you start trying to say things are racist or “anti-diversity” when they really aren’t. \n\nGo look at other subreddits for different degree majors, they actually have content about the degree instead of an internship/job market/DEI circlejerk like this sub is. I rarely ever see threads on here talking about programming outside of leetcode discussion, and even then barely anyone talks about actual code or methods. This subreddit has garbage content since I joined it 3 years ago. I wanted to talk about programming with other CS majors but all I get is “ANYONE HEAR BACK FROM GOOGLE” or “IS 500 A GOOD CODESIGNAL SCORE??”. \n\nAnyone who thinks this is a bad change is out of touch with reality and has their judgement clouded by the piss poor content this sub has been churning out for the past 2 years",
            "Thank you, shit was annoying",
            "thank god, i mean it was funny for a while, but it was starting to turn into a shitposting sub, tho i would like to see r/csMajorShitposting ;p",
            "Thank you.",
            "THANK YOU",
            "Finally lol",
            "I agree that the latest wave of DEI discussions wasn't healthy for this sub.  But I think you could define \"until further notice\" to something like 3-4 months. This will reassure people on the \"temporarily\" aspect of this rule.",
            "TL;DR Grow up, CS people.  Make this a sub worth reading.",
            "ban thepragprog and we’ll be good",
            "Thank god. I don’t even follow this sub but every time I see it now, it’s just bitching about reverse racism and job market bad.  I know people are feeling the market right now but the market was extremely inflated because of the covid bubble.  Jobs exist for plenty at the 80-100k range for new grads and we need people to understand that just because you don’t make it to google doesnt mean you’re done.",
            "thank god",
            "bedroom jellyfish possessive crime crown strong marry placid six frighten ` this message was mass deleted/edited with redact.dev `",
            "That’s what we do here though. Someone makes a post that gains a ton of traction and then we get a couple hundred copycats. Really that seems like the standard experience for a lot of subs.",
            "GOD IS GOOD finally enough with the crying",
            "Agreed, tired of seeing people blame their unemployment on DEI, very entitled rhetoric",
            "finally a reddit mod that isnt greasy and out of touch",
            "Thank you",
            "Thank you!!!! 🙏🙏😭😭😭",
            "What about discussing the job market as a result of DEI for UPS? Does it all cancel out and become allowed again",
            "I understand, but don’t necessarily agree with this. We want to allow people to understand that they’re not alone in their thought process and struggles.\n\nBanning all of these posts seems like a way to make everyone feel like the problem doesn’t exist or that they’re the unskilled / exception.\n\nWhat is your mitigation plan for this?",
            "Fina-fucking-lly",
            "Excellent",
            "Finally OMG",
            "How did reddit reach a point that 99% of posts are just reposts of the same topics from the previous week over and over and over and over and over and over.\n\nIf you are that uncreative or obsessed with piggybacking on others' karma ideas, that probably explains why you have such a hard time finding a job.\n\nJust saying. It's pathetic. Success in software development requires both creativity and brain-power. If you can't figure out how to get thumbs-ups without riding someone else's coat tails, you have neither. Go join r/antiwork or something instead.",
            "Reddit (or at least this subreddit) is not the place to be arguing and posting memes and igniting arguments about DEI and the “skewed” job market. Not all of the posts were bad, but it was getting out of hand. No one’s arguing about “Let’s talk about this Google question” or some shit to the same degree, so those posts are not gonna get banned.\n\nBlame the people who wanted to ruin the actually meaning of the posts for everyone. ✌️",
            "Thank you!",
            "Boo. Mods are suppressing anti-racist sentiments.",
            "[deleted]",
            "Thank GOD. Half of those posts are tone deaf or just so uninformed it’s insane",
            "The gods have spoken. Please stfu if you disagree.",
            "The fact that there are many posts regarding this means something. It means people are struggling with this, and need answers/helps. \n\nThis topic is also relevant to CS. Because not everything about CS is Leetcode, OA. It’s interesting to see the mods of this group (like many other pro-DEIs) dismiss people’s concerns like this.\n\nTurning on oppressor mode?",
            "🙌 YESS",
            "Kind of disgusting the number of people attacking DEI and going into racist rants as a scapegoat for them not actually being good enough to get selected for a school/internship/job.",
            "Ban Harden slander",
            "Look through the accounts of those shilling that crap, none of them have anything to do with CS.\n\nIt's an organized troll brigade, and a pretty piss poor one at that",
            "Thank the lord",
            "Finally \nJesus Christ",
            "finally",
            "I am incredibly happy for this",
            "[deleted]",
            "Affirmative action is forced racism. Don't let the truth die out",
            "I think giving people a true sense of CS is needed. Not so much the UPS type stuff, but showing some honesty about how hard it is to get into the field.\n\nMaybe a separate sub is a good idea.",
            "Finally.. this sub was losing its relevance i was starting to think it was just full of Indian H1B hopefuls where the content is mostly filled with irrelevant third world bs.",
            "Censorship is never the answer. Horrible take.",
            "THANK YOU SO MUCH",
            "[deleted]",
            "Diversity is not allowed at csMajors. Got it.",
            "Too be honest, this sub is trash but this stuff still shows up in my feed. If i were the guys just trying to vent, i would leave and watch this sub die. It'll be nothing but the guys who tell you to settle for 30k smelling their own farts and the pretentious crew that want to talk about linklist when they get paid to make a check mark on a website.",
            "[deleted]",
            "Thanks mod sir",
            "I saw this after I made my post. Basically I wanted to say I'm more angry about sports admits and legacy students at top colleges than DEI. Fix those two things, and you probably won't even need DEI.",
            "Thank You!",
            "massallah 🤩",
            "THANK YOU!",
            "I, and many of us, appreciate!",
            "Hire the best coder.  Rest is the same as the virus infecting Silicon Valley - layoffs galore."
        ]
    },
    {
        "post_id": "18zxh51",
        "author": "suenolivia",
        "title": "Internship Application keeps getting better",
        "url": "https://i.redd.it/93ybjxc4vsac1.jpeg",
        "score": 658,
        "num_comments": 30,
        "created_utc": 1704538173.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18zxh51/internship_application_keeps_getting_better/",
        "comments": [
            "Stop applying to this shit and they will stop posting it",
            "240$ per month, whopping 3k$ per year.\n\nThat remind me of my salary as an intern 15 year ago in Poland which was still slightly higher.",
            "Easy Apply sucks dick",
            "Something about this is somehow more insulting than an unpaid internship",
            "Fastest way to escape the Matrix",
            "is this just delegating upwork projects?",
            "That’s minimum wage bro",
            "Name and shame? Fuck this place",
            "Just don’t apply dawg, have some self respect",
            "Nah that ain’t even minimum wage",
            "Is this like a Remotasks thing? I feel like a lot of people are looking for things like this where you work whenever you can and get paid for it, and it's not a bad arrangement at all.",
            "You guys getting paid?",
            "So paying you below minimum wage",
            "Link please 😭(ik this is worse, but i need some or other internship(I'm broke af))"
        ]
    },
    {
        "post_id": "xa8361",
        "author": "TranslatorAway9891",
        "title": "Just received an offer from Microsoft. Hardwork finally paid off...!!! Here is my prep journey + compensation. Hope it helps.",
        "url": "https://www.reddit.com/r/csMajors/comments/xa8361/just_received_an_offer_from_microsoft_hardwork/",
        "score": 652,
        "num_comments": 93,
        "created_utc": 1662761493.0,
        "selftext": "I was working in IT for 5+ years, but felt that I was not good enough for a FAANG company. Though the dream of FAANG was still in me. But I was never able to stay committed towards my LeetCode grind. I would prepare for 1-2 weeks, and then stop my prep for few months. Every time I would try to start again I would feel like I am back to square one.\n\nBut it all changed on January 2022, I found that my wife was pregnant with twins. And that was a great motivation that would change everything.\n\nI devised a strategy to prepare more efficiently and stay committed to leetCode grind and achieve my ultimate goal of joining FAANG.\n\nFirst of all I created a list of top questions asked by top FAANG companies. Then I started solving them, and decided that I will make videos of their solutions and put it on youtube. Hence I started making leetcode solution videos. Made a promise to myself to solve 2-3 questions per week.\n\nIt was tough at times to keep up with full time IT job, a pregnant wife and I had to drive uber for 15-20 hours per week to make some extra money so we can handle the financial situation. On top of all of that I had to learn extra skills to solve and understand leetcode, plus make decent quality videos.\n\nBut as the saying goes, \"Tough times don't last, tough people do\" and I kept the hustle going. I would make videos at 5:00 am, or 11:00 pm. Whenever I got some extra time.\n\nAs a result now I have solved over 85 Leetcode problems, made videos on them. That helped me clear interview at Microsoft, and landed myself an offer. The interviewers at Microsoft loved the fact that I did that. One of the interviewer saw my video before my final interview, and my recruiter told me that they loved my dedication.\n\nHere is the list of the most asked FAANG questions I solved. Hope it helps some of you.....!!!!\n\n[Most Asked Questions for FAANG Job](https://docs.google.com/spreadsheets/d/1hzP8j7matoUiJ15N-RhsL5Dmig8_E3aP/edit#gid=1377915986)\n\n&#x200B;\n\nLocation: Toronto, Canada\n\nLevel: 61\n\nTC: 184K\n\n\\#FAANG #microsoft #leetcode #tech #technicalprogrammanager #softwaredevelopersalary #microsoftemployees #engineering  #software  #swe  #tech",
        "permalink": "/r/csMajors/comments/xa8361/just_received_an_offer_from_microsoft_hardwork/",
        "comments": [
            "My takeaway: \nGet a girl pregnant=>Get motivated to grind LC=>Get an awesome job offer\n\nCongrats btw, well deserved!!",
            "Dang now I have to find a wife and 2 kids",
            "Damn brother you had a full time IT jobe, drive a Uber for 20hr than learned new skills while solving leetcode and making YouTube videos while you also had to take care of your pregnant wife... Now that is some hard work but I need to ask did you had any time to your self? For relaxing or enjoying a hobby? I don't know if could be sane without some free time to myself",
            "Congrats!!",
            "Congrats! How long was your grind?",
            "Congrats!!! \n\nAlso, can you put the link to the comments, I wanna save the doc",
            "[deleted]",
            "Congrats OP, can you disclose the questions that were asked in the interview??",
            "Excellent job brother, just remember you are practically amazing for being able to pass FAANG after just 85 questions so you very well deserve it. Been subscribed to you for a while!",
            "Congrats! Stupid question but what does TC mean?",
            "cad or usd for tc?",
            "that’s amazing, congrats!!",
            "Congratulations!!!",
            "Congrats!! Very inspiring!",
            "Congratulations 👏",
            "Congrats! And all the best to you and your wife with the twins!",
            "Congratulations man",
            "Congrats OP!! This may seem irrelevant but how old are you and do you think age is a factor in the selection?",
            "Huge congratulations. Inspiring us all.",
            "Heartwarming and inspiring to hear this man! Awesome work!",
            "Aye congrats!!!",
            "Congratulations! Such a lovely story. Made my day!",
            "That's a good offer for Canada. Congrats!",
            "Congrats! Good luck at your new job!",
            "Congratulations! Saved the links to your video! Thank you so much for sharing!",
            "Congrats! How many problems did you do a day and what else did you do to prepare for interviews?",
            "What classes did you take? Career? And what school did you do to",
            "I really don't understand how people like this are so productive 24/7.",
            "Congratulations 🎉 really hard work.",
            "Thanks for the extensive notes and those vids looks awesome? I was wondering what your educational background was and what position you applied for? I’m currently in the same situation but not sure what to specialize in.",
            "Respect your grind! 💯\nSuper happy for you, mate!",
            "do u mind me asking what your base is?",
            "Congrats! Respect to your perseverance",
            "Congratulation! Thank you for providing the motivation to continue the grind!",
            "congratulations!!! this awesome!!",
            "Congrats and thank you for sharing the link!",
            "Do you have a CV template by any chance? I am really curious how it looks. Thanks",
            "Happy for you, do you have advise for someone like me that not good at problem solving and just starting to practice data structure?",
            "This is awesome congrats! But also Microsoft isn’t a FAANG?",
            "Man congrats. Finally your hardwork pays off",
            "I’m so happy for you :) congratulations on hard work paying off!!!!!",
            "Is your TC in CAD?",
            "Congratulations on both the job and the pregnancy. What an awesome way to start out fatherhood.",
            "Congrats!!",
            "Welcome onboard 😊",
            "Congratulations! Did you have non-coding rounds as well? Like tech rounds or system design rounds? Did you prepare for those too?",
            "This isn’t the right approach if you want to work for a large software company. \n\nForget all these variables like: “leetcode”, “FAANG” as they are pretentious. \n\nIf you want to work for a software company drop the current things you know and start from scratch with current technologies and just write good code. \n\nThat’s all that they want",
            " Congratulations! May I ask what is your background?",
            "This is amazing! 👏👏👏",
            "Also was in a similar situation but got hired at Amazon and not Microsoft. Spent 3 years as a dev at another company and then my wife and I had our first kid.  This changed everything and pushed me to be better in all areas of life and motivated me to try my hand at FAANG. Been working at Amazon for almost 3 months now :). Congratz!!!!!",
            "That is amazing! I just started MCIT and have been struggling with the software development and discrete math course but I am going to try to stick it out. Like you said, \"tough times don't last, tough people do.\"",
            "Congratulations mate, thanks for sharing and being so open. Guess your family is proud of u as well :)\n\nBut the real question is: will you still be driving uber? XD"
        ]
    }
]