[
    {
        "post_id": "1avjaeh",
        "author": "davlumbaz",
        "title": "I hope Workday will bankrupt faster than the freefall speed of my sanity after a job posting redirects me to Workday.",
        "url": "https://www.reddit.com/r/csMajors/comments/1avjaeh/i_hope_workday_will_bankrupt_faster_than_the/",
        "score": 658,
        "num_comments": 63,
        "created_utc": 1708440257.0,
        "selftext": "HELLLL FUCCCKJNNG YEAAAAAAAH GIVE ME MY 3169TH ACCOUNT FORM A COMPANY THATNIW DILL JEVER EVER HEAR FROM THEM AFYER YLALLIYK GBR AUSE YEAR IS 2024 ERVERYONE AND THEIR MOTHERS ARNEFUCKING SOTFYWARE ENINEEERS YEAH THANKS FOR HEKLHONG ME INMY CAREEER WITH this 3169 TH ACCOUNTYNOUVMTOTHEFFUJCERS",
        "permalink": "/r/csMajors/comments/1avjaeh/i_hope_workday_will_bankrupt_faster_than_the/",
        "comments": [
            "Yeah, I don’t understand why we can’t just have one account and fill it out once, then apply using that account.",
            "This post pretty much sums up the mental state of every last one of us applying for jobs.",
            "Even as students, we could probably make a website than workday. It is garbage imo.",
            "I have more workday accounts than stars in the sky at this point",
            "HELL YEAH BROTHER",
            "You should apply to be a SWE at workday and fix the problem",
            "I actually applied to be a SWE intern at Workday to hopefully fix the problem down the line. But I got rejected :(.",
            "This. I hate any sites that redirects me to workday.",
            "Sounds like a business opportunity, who wants to start?",
            "Damn I hate when a good post comes up about job seeking because I see like 60 other kids immediately in the same boat. Yall tryna make a startup company or some shit",
            "FUCK WORKDAY!",
            "If you want atleast some of your stuff get filled please use Simplify extension.",
            "sanity of the average cs major in 2024",
            "Reminder that this is a tech company that pays engineers 150k to make this bullshit  ",
            "Puzzled that this is so confusing to people on this sub.  Workday is one of the largest SaaS ERP vendors in the world. Their only real competitors are Oracle and SAP. They are a $6B company with solid profit and annual growth. The ATS module is a small part of Workday's offering.\n\nOne of the fundamental design criteria for any enterprise-level SaaS is that each customer's data MUST BE isolated from all of the other customers. That means that the account that you create for Workday customer A (chock full of PII) must be unreachable for customer B.\n\nThis issue of multiple job seeker accounts does not bother Workday nor their customers.",
            "I sincerely hope that all the commenters here are students, because one glance at the Workday URLs (and subsequently UI) should've made you realize why Workday isn't a singular platform.",
            "I might be in the minority that loves applying on workday. The alternatives are icims which isn't that bad or a company made page which is always the worst fucking hell trying to apply",
            "how many accounts do we have to create bruh 😮‍💨",
            "so true bestie",
            "Bro use simplify. It’s so easy"
        ]
    },
    {
        "post_id": "150f5hh",
        "author": "GamerFelix",
        "title": "When the company finally gets back to you… 2 years later",
        "url": "https://i.redd.it/prlvnojff5cb1.jpg",
        "score": 653,
        "num_comments": 17,
        "created_utc": 1689435603.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/150f5hh/when_the_company_finally_gets_back_to_you_2_years/",
        "comments": [
            "Damn I bet you were really counting on that for the past 2 years, my condolences man😩",
            "“This isn’t the end, though! If a position opens that closely matches your skills and experiences, we may contact you as we have new positions open all the time.”\n\nI must not be the only one who hates these. I’m okay with “you are not selected” don’t give this bs motivational energy.",
            "Fuck Walmart, those fuckers reply after 3-4 months even for the job of a cashier.",
            "Imagine being hired for a different role and working at Walmart at the time of receiving this email.",
            "I seen ibm do the same thing thats crazy",
            "As a walmart associate this embarrasses me....",
            "Finally due to the slowdown, they have got the time to go back and process old applications.",
            "What'd you expect? It's walmart 🤣",
            "This reminds me of the time MIT rejected me when I didn't even send in an application",
            "The recruiter was just going out for a quick minute to pick up some cigarettes and milk.",
            "The more I apply for jobs the more I'm convinced that it's 3 kids standing on top of each other's shoulders in a trench coat running the company."
        ]
    },
    {
        "post_id": "wkc54r",
        "author": "Rhystery",
        "title": "We should make a reality TV show of people trying to get into FAANG",
        "url": "https://www.reddit.com/r/csMajors/comments/wkc54r/we_should_make_a_reality_tv_show_of_people_trying/",
        "score": 659,
        "num_comments": 43,
        "created_utc": 1660072877.0,
        "selftext": "Kinda like fboy island",
        "permalink": "/r/csMajors/comments/wkc54r/we_should_make_a_reality_tv_show_of_people_trying/",
        "comments": [
            "This thread is not conductive to the subreddit. Locked.",
            "[deleted]",
            "I'd watch, but it would be the mainly grinding leetcode.",
            "would be a pretty short series",
            "It would fail. This is why Silicon Valley spent most of the time talking about the money or getting funding for the \"Algorithm\" and less time about sorting linked lists",
            "that would require social interaction between the competitors",
            "Jesus some of you guys need to chill out and go have fun",
            "A really bad movie on this is The Internship (2013) where Vince Vaughn and Owen Wilson become Google interns.",
            "*cuts to a bunch of dudes and one(perhaps even two) girls sitting under the shade on beach, grinding leetcode, browsing their college job boards, linkedIn and reddit, for hours*\n\n*the monotony is occasionally broken by then getting an email from a place they applied to*\n\n\"YA'LL I MIGHT OF GOTTEN ONE\"\n\n*it ends up being an auto rejection email, everyone goes back to what they were doing*",
            "This would be the best fucking idea lmaooooo",
            "Netflix would give an offer for the show before they'd give one to any of us",
            "This sub has become an accumulation of people hating on others for getting into FAANG while they send out hundreds of applications and get no responses for apparently \"no reason\".",
            "Asians with no social skills On an island… coding under a tree.",
            "It just be a bunch of Asians running around with parental pressure..",
            "This is a great idea 🤣🤣",
            "Main characters is Asian",
            "Imagine if it were an anime",
            "Feel like if I was in that I’d volunteer and then procrastinate/watch YouTube for many following episodes",
            "i would totally watch this LMAO",
            "You'd really have to make it with dry humor like the office",
            "I'm down for being a cameraman for this!",
            "My life as a tv show"
        ]
    },
    {
        "post_id": "n6vdi1",
        "author": "pepeman931",
        "title": "Have you ever got so excited to start a project whilst going through exams but can't find the motivation when you are actually free?",
        "url": "https://www.reddit.com/r/csMajors/comments/n6vdi1/have_you_ever_got_so_excited_to_start_a_project/",
        "score": 656,
        "num_comments": 32,
        "created_utc": 1620383272.0,
        "selftext": "During exams I always get super excited about a new topic, or some project and I begin to plan out my time even before finals. \n\nHowever, my excitement fades and now that my exams are over my brain is trying its best to stay distracted from what I want to learn.\n\nI honestly don't know what is wrong with me. Why can't I fucking focus on this project and actually complete it. Trust me it isn't that the project is not that interesting but maybe its because I'm just lazy.\n\nI really really want to make the most of my free time now. How do you guys stay focused?",
        "permalink": "/r/csMajors/comments/n6vdi1/have_you_ever_got_so_excited_to_start_a_project/",
        "comments": [
            "I’ve been a programmer for 30 years and I still don’t know. When you figure this out, let me know",
            "It just common behavior across people under pressure to do any sort of tasks. \n\nDuring exam season, in comparison to the dreadful studying and reviewing for tests, practically any other topic you come across is going to be more interesting and provoking. \n\nThen when you are done with exams, you are now comparing those new topics to the enjoyment you get from, say, going on a vacation or just watching youtube in your bed. \n\nPlus, the under the surface technical aspects of those new topics that you didnt realize during that brief excursion is gonna create a steep learning curve and bore you--in comparison to all the other fun instant gratification you can get during summer. \n\nIm guilty of this everytime... lol",
            "I call it escapism",
            "So it wasn't just me then.",
            "Yep. I think for me it comes down to burning myself out during the semester. I spend a lot of time on school work and learning material on a deeper level. I also try to spend time learning “personal” cs stuff not related to classes.  Plus work. So once the semester is over I’m pretty burnt out, plus I have to catch up on life and being an adult",
            "[deleted]",
            "It's not about motivation imo, it's about discipline. You need to push yourself and force yourself to work on the side project. Don't go too hard, or you'll burn out. Get into the groove of half an hour to an hour a day. Make it a personal goal. You can do it!",
            "I just keep track of them. Usually the issue is that I can’t think of things to do when free time happens, but when my brain is overloaded with finals and stuff, it’s working hard and thinks of similar things I’d rather do. I wrote down some of those ideas in my phone notes and then when the time came I had something to do. The motivation is harder to explain because usually it’s just something I want to do. Like last summer I wrote a C compiler, and I just wanted to do it. Right now I’m doing some unreal engine projects and I just really like doing them and don’t have an issue sitting down for hours to do stuff on them.",
            "I spend a good amount of time just learning how to be productive and optimize my time whilst working.\n\nBest resource I've found so far is Cortex (podcast). start out at episode 100 and 101",
            "Nah, you're not alone. I'm still trying to get motivated to learn Typescript over the past year. Lockdown has really thrown my motivation and thoughts into a blender.",
            "I think this happens to everyone lol. Your so excited, got a great idea , a great plan but then it comes time to implement it and it’s a little daunting. I think the hardest part of a project is that first few lines of code. It’s hard to imagine where to even begin.",
            "Bruh same",
            "See, I don't have a problem with being productive... It's what exactly I'm being productive with that's the problem.\n\nNeed to study for exams? Actually, I think I'll research that business idea I've been working on instead...\n\nAssignment due tomorrow? Time to clean the house.\n\nNeed to work on the app you've been building for a business you recently started? Time to do some other work on the other business you also recently started...\n\nIt's like I only want to work on the least-pressing task.\n\nBut anyways, I'd recommend looking into the Pomodoro technique. I use it while I'm working, and it seems to work quite well.\n\nYou could also think about doing some kind of positive reinforcement (I.e. I can go take a walk after I finish X amount of work, etc)",
            "I get excited whenever I write assembly code like in x86 or in risc-v",
            "Same exact thing happens to me",
            "this, i started a simple project about a month ago. i made really good progress on it then started to make the gui and got caught up with so much schoolwork and tests that i just dropped it. now that the semester finally is ending maybe i can start working on my projects before summer classes",
            "Yes.",
            "Same happening right now. I m in the exam phase RN XD."
        ]
    },
    {
        "post_id": "19e13hp",
        "author": "__NotAnAlt__",
        "title": "Amidst the doom and gloom; my search for a job in CS straight out of school",
        "url": "https://i.redd.it/8t6wiqzvn9ec1.png",
        "score": 649,
        "num_comments": 60,
        "created_utc": 1706049140.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19e13hp/amidst_the_doom_and_gloom_my_search_for_a_job_in/",
        "comments": [
            "https://preview.redd.it/tg7l9x4qp9ec1.jpeg?width=1170&format=pjpg&auto=webp&s=78fe59ded6decd98b271380bbe47360260f559d0",
            "&#x200B;\n\nhttps://preview.redd.it/ur1q5unf4bec1.png?width=678&format=png&auto=webp&s=68c83a6cd2fffd328161a44812f4bec4140f2e00",
            "bro got a job in CS (Customer Service)",
            "What's your job title?",
            "bros flexing 3 janitor applications",
            "this nigga got a janitor position at faang",
            "What is your job title/role? I see your other comment, did you just graduate high school?",
            "Did you have previous internships?",
            "What school did you go to?",
            "Faang janitorial staff",
            "fake and gay",
            "What'd they test in the tech interview?",
            "What's your title? There's a world difference between getting an IT  Desk Support position out of high school vs a Software Development role",
            "How do you create these images?",
            "What’s the scope of your job? Congrats on the offers!",
            "Fuck yea dawg",
            "Ay finally someone who did well. Redditors won't believe the world isn't unfair and that someone is better than them no matter what happens so this might not be the place for you xD",
            "Posts like this keep me reminded that this subreddit isn't even a tenth of what's actually going on in the world. Thanks for the motivation.",
            "Bunch of bitter arseholes here. Grats op.",
            "Happy for you Op!!",
            "These comments reek of salt lmao, congrats op",
            "Congrats man. Don't let the negative nancies yuck your yum.",
            "What good candidates look like lmao. Bunch of noobs can't get jobs ",
            "Gpa?",
            "What was the personality test result 😅",
            "I like the DNA spline going on lol. Congrats!",
            "Feel like this data doesn’t deserve a graph",
            "Drop resume",
            "cute",
            "Congrats op!",
            "Op might not only just be a janitor, he could be an internet janitor",
            "You for sure are Zuck's son.",
            "Riyal ( I was the hiring manager)",
            "@op what’d you use for the graph?"
        ]
    },
    {
        "post_id": "18osk8y",
        "author": "Big_Zookeepergame711",
        "title": "Internships have too high expectations now",
        "url": "https://www.reddit.com/r/csMajors/comments/18osk8y/internships_have_too_high_expectations_now/",
        "score": 652,
        "num_comments": 96,
        "created_utc": 1703289462.0,
        "selftext": "We all know how competitive this market is but this is insane. I thought internships were supposed to be entry level but most companies want students with past internships.\n\nI follow a Tesla recruiter on Linkedin and I see her reactions on my feed. Data analysts and Pm intern positions are literally being given to masters students with 3-4 industry YOE plus having 2-3 past internships. Is it actually over for the average joe when applying to bigger companies?",
        "permalink": "/r/csMajors/comments/18osk8y/internships_have_too_high_expectations_now/",
        "comments": [
            "gotta start in high school now i guess.   \n\n\nI can't wait in 10 years when child labour is back",
            "It’ll only get worse",
            "To me to whole internship situation in the US is weird. In the netherlands we have mandatory internships in our 5th and 8th semester. Theres no point getting an internship in your first 3 semester if you do not even understand basic concepts of coding.\n\nAn internship is supposed to be a learning experience, but the truth is that the 3-6 months of internship is not long. You want basic knowledge to get the most value out of that time. \n\nWe never recruit internships with less then 2 years in college/uni because we would have to literaly sit next to them and pair program for the first 3 months or let them take 5 times longer to achieve something.",
            "What do you mean you can’t grab an apple with your butthole in record time (we’ve done this before to candidates)? Well I guess we’ll give you a LeetCode hard to solve in 30 seconds….can’t do that either? I’m sorry, your not qualified for this unpaid scripted cold call sales internship…",
            "Lol the market is actually this bad 😂😂😂",
            "There's only a limited number of internships available, yet all over social media I see people continuing to tell others that the only worthwhile major in college is CS, so why wouldn't it get hyper competitive? We are doing it to ourselves everytime we post a video to show off",
            "I believe the correct terminology would be “joeover”",
            "Think of it from the company’s perspective. If you could hire an experienced candidate for the budget of an intern, why wouldn’t you? They would be more likely to hit the ground running and make an immediate, positive impact on the team, leading to a better return on investment. And given the market, more applicants intuitively means companies can be more selective",
            "Maybe it really due to the recruiters have a lot of choices. A month ago,  I was told from one of my interviewer that they are intresting on me even I only had one internship experience. and I saw that they hired people without any previous internship in the past (they pay the minimum wage). But at the end, I got denied and I know someone who have two internships experience got the offer.",
            "Not necessarily. I know undergrads (sophomores, juniors, seniors) with only 1 past internship experience got Tesla internships.",
            "If there are  1,000 applicants looking at an entry level position. Would you rather take the guy with almost no experience or the guy with 2-3 years of experience plus a 4.0 GPA and has grinded all of leetcode",
            "I don't think this is really the case- companies want to attract potential strong employees from early on in their academic journey, and it can be worth it to hire frosh/soph interns without the expectation they'll do much to have them in the pipeline for later on when they have stronger skills",
            "This past year reminds me a lot of outliers from Malcom Gladwell.\n\n**One key takeaway from this book is that success if often being at the right place at the right time.**  I am starting to sense that this tech gold rush of the last decade was the best place to be, and now that door is closing in the same way that law was the best career several years ago or oil barrons in the gilded age.\n\nGetting an entry level job is getting tougher, no doubt about it, and the door is closing fast, unless there is growth in employment in a similar field (maybe AI?).\n\nGood luck fellow students.",
            "Supply and demand baby. As a business owner what would you do: If there are 10,000 SWEs with some experience that just got laid off from META, Google, Microsoft, Spotify etc….. and looking for a job, would you consider someone just in college for anything ? \nI believe the 10,000 is just being conservative. It sucks for the new graduates and I hope the tech economy gets some sort of boost.",
            "Joever for the average joe",
            "It's because theres a lot of students now that have experience, the top 10% of my year had 3 -4 YOE even during the second year. I was also on that band as well. \n\nIt's extremely competitive, and entry roles are over saturated.",
            "why do you have to work at a bigger company? most people's first internships are not big names",
            "https://preview.redd.it/46cdthwd028c1.png?width=512&format=pjpg&auto=webp&s=c31c9f3d51574b09c7a165a7badd42d5fd7dc083\n\nIt is what it is",
            "Wait until you see the entry level job market",
            "You don't **have to** land your first internship or grad role at FAANG or any super hyped startup straight away. \n\nAnother path is to work at smaller companies where there is comparatively low hanging fruit by just implementing the basics, simply because no one there has done it before. You acquire a ton of fundamental knowledge and experience. Once you have that experience you can still apply at FAANG or w/e if you still want to, it'll be easier.",
            "Yes. It’s due to more people joining the field, and a market correction after COVID. Years ago, top 5-10% of candidates got internships. Now, only top 0.1% (seriously, look at the application:hire ratio) get positions, so it’s more competitive.",
            "📝 it’s so dumb fr",
            "Some are just in to scout people near graduation to recruit people near graduation. Intern at my school were all managed by the school and companies had to apply through the schools system.. youd see if they wanted 1st, 2nd or 3rd interns. There were a lot looking for 3rd only.",
            "Maybe it’s because internships were traditionally for juniors in college where they had taken more advanced classes. What do y’all think?",
            "It was never a good time for an average joe, but I agree, that's my impression also - interns are generally pretty useless for a company outside of hiring/marketing, but it seems that right now companies actually hope to accomplish things using interns and are trying to hire more experienced folks than I remember a few years ago. \n\nOn the flip side - master students need internships too :)",
            "masters aimed internships are regular jobs, classified as internships due to certain universities giving you credit for ur masters classes type shit.",
            "By internships you mean internships at the most well known companies.",
            "Welcome to the real world",
            "I mean the good news is we're entering into a prolonged labor shortage\n\nThe bad news is we're entering into a prolonged labor shortage",
            "For a lot of companies internship is becoming shorthand for “temp position we can pay you less” so you get some master’s student doing higher level work part time and/or during the summer instead of paying full time employees (incl benefits) to do it.",
            "You know what the bar is at Tesla, you can go after it, or whine online. There are hundreds, of other companies out there where the bar is lower. Go after one of them, Tesla next year. This is no different than it’s ever been. If you want to work at the highest paying company, you need to bring more to the table.",
            "Companies could say the market rate for interns is too high.",
            "It is what it is. You aren't owed a job, so better do what it takes to be competitive.",
            "[deleted]",
            "The solution is simple. Git gud"
        ]
    },
    {
        "post_id": "kegk23",
        "author": "ScholarRoutine8694",
        "title": "Reminder for all CSers to take a deep breath",
        "url": "https://www.reddit.com/r/csMajors/comments/kegk23/reminder_for_all_csers_to_take_a_deep_breath/",
        "score": 655,
        "num_comments": 47,
        "created_utc": 1608148634.0,
        "selftext": "Everyone!! People with internships, people without internships, people who failed a course, people who got straight A's. Please, PLEASE, take a second to relax, take a deep breath, and remember how tricky the field of CS can be. Particularly during this bizarre year, give yourself some friggin props for what you have done. You've made it this far, and that's enough. <3",
        "permalink": "/r/csMajors/comments/kegk23/reminder_for_all_csers_to_take_a_deep_breath/",
        "comments": [
            "gonna enter hibernation after finishing this database final",
            "taking the rest of week off after my last final tomorrow to just be in head empty, no thoughts mode",
            "Have my final interview for internship with Amazon in the next two days. Been very nervous despite of spending lots of time preparing since I failed them last year.",
            "Taking a week off of CS, Mathematics and playing Jazz Trumpet after finals are over tomorrow.",
            "Just had my computer ssd in disc drive fall out while in backpack.. corrupted all files. took it to trusted shop, and they said may as well buy new one. All my files 500GB worth gone. So many school and personal projects, guides to myself, etc -_-\n\nI’m done with coding till next semester",
            "[deleted]",
            "I just graduated yesterday with a Master's, don't even feel like it, but will try to take it chill! 😊",
            "When your professor assigns homework that’s due the week after break starts 🤦‍♂️",
            "I graduated Friday and man, I’ve been completely shut down since 🙃",
            "Thank you for this, it can be very enriching to stop for a little bit and realize how far we have walked.",
            "Tomorrow after my final, I'm fucking driving as far away as I can. This quarter has been brutal.",
            "I’m about to get boofed by my comp organization and architecture exam final tomorrow.",
            "Thanks man, but I haven’t gotten far enough, the grind must go on even after finals",
            "Great reminder! I made it out of discrete math alive and with a B- thanks to a lil curve. I still haven’t stopped to breathe.",
            "Don't stop at one deep breath, take 30 and you'll feel much more relaxed.",
            "I pushed away from my desk and decided to be ok with a B+ in Calc 1.",
            "needed this.. thank you!",
            "I just finished my first semester of CS!!",
            "I am switching majors after this so I am chilling bruh",
            "needed this",
            "This helps not at all."
        ]
    },
    {
        "post_id": "1ancxw5",
        "author": "Available-Elk-4251",
        "title": "Got an Offer for Meta E4",
        "url": "https://www.reddit.com/r/csMajors/comments/1ancxw5/got_an_offer_for_meta_e4/",
        "score": 653,
        "num_comments": 155,
        "created_utc": 1707558883.0,
        "selftext": "* International Student (Will be graduating this summer. May '24)\n* Had 2 years of exp before coming for Masters.\n\n The whole process took \\~3 months\n\n**How did I apply?**\n\n* Searched for the keyword \"meta is hiring\" on LinkedIn, where I found a post from a recruiter. Fortunately she mentioned her email in the post. I then mailed her and got a call the very next day.\n\n**Why did the recruiter even reply to my email?**\n\n* I suppose the timing worked out perfectly. Meta had just begun hiring for E4 roles, and I might have been among the few who stumbled upon her LinkedIn post (which had only 7-8 likes). Since not many people reached out to her yet, she probably noticed my email.\n\n**Tips :**\n\n* Avoid commenting \"Interested\" on posts that already has tons of comments. Instead, focus on finding posts that haven't gained much attention yet.\n* Seriously, don't comment 'Interested' . It's of no use.\n\n \n\n**Interview format (E4 level)**\n\n* 1 Tech screen : 2 LC Medium/Hard questions.\n\nYou'll only be invited to the virtual on-site after passing the tech screening\n\nVirtual On-site\n\n* 1st round : Coding ( 2 LC Medium/Hard questions in 45 min )\n* 2nd round : Coding ( 2 LC Medium/Hard questions in 45 min)\n* 3rd round : System design\n* 4th round : Behavioral round\n\nFinally, team matching process. Team matching may take longer for general applications, up to a month, but for specific skill set roles, it's usually faster.\n\n**How long did it take for my team matching?**\n\n\n* I didn't have to go through team matching. Surprisingly, while I was in the process of interviews, an engineering manager from Meta reached out to me through LinkedIn and he had no idea that I was already in the interview loop. We had a call after he reviewed my resume. I got team matched even before the interviews.\n\n**Tips :**\n\n* Trees and Graphs are must. You ll get at least one question on this.\n* Meta doesn't ask DP\n* Solve last 6 months meta tagged leetcode questions. But you never know. One of the coding questions I got was completely new. No concept like bfs, dp etc involved. Logic based.\n* You are not allowed to execute your code in the interviews.\n* During the coding interviews, it's really important to come up with the best answers for each question they give you. If you can't solve one or provide the most optimized solution, it's going to hurt your chances of securing an offer.\n\n**Tips for behavioral round :**\n\n* Follow STAR method strictly.\n* Mention some impactful and quantifiable work. ( Ex: Introduced an optimized scheduling system, leading to a 20% decrease in administrative workload, saving approximately $10,000 in operational costs annually. More elaborative though )\n* These are some great tips from a former staff engineer at Meta : [https://www.reddit.com/r/leetcode/comments/179j96a/behavioral\\_interviews\\_matter\\_too/](https://www.reddit.com/r/leetcode/comments/179j96a/behavioral_interviews_matter_too/)\n* There's also a whole blog from the same person : [https://www.hellointerview.com/blog/story-crafting-101?utm\\_source=reddit&utm\\_medium=social&utm\\_campaign=story-builder](https://www.hellointerview.com/blog/story-crafting-101?utm_source=reddit&utm_medium=social&utm_campaign=story-builder)\n\n* Prepare for answers to general behavioral questions beforehand. Make sure you have atleast 2 answers for each question. (I panicked and mistakenly used a different answer to a question but was still relevant. Therefore it's always better to have at least 2 answers for each question)\n* If you have 0 work exp, mention your projects and internship experience.\n\n**System design** :\n\n* The only guide you will ever need for system design : [https://github.com/donnemartin/system-design-primer](https://github.com/donnemartin/system-design-primer)\n\nResume template I used :[https://www.overleaf.com/latex/templates/resume-template-by-anubhav/dhmkrwtksdgy](https://www.overleaf.com/latex/templates/resume-template-by-anubhav/dhmkrwtksdgy) \n\nI'll continue updating this post with more points as they come to mind. Feel free to ask me anything in the comments. (The feeling is unreal. I hope everyone gets to experience this)",
        "permalink": "/r/csMajors/comments/1ancxw5/got_an_offer_for_meta_e4/",
        "comments": [
            "What did you say to the recruiter? Did you reach out before or after applying? Also did you add it in a note to connect or was like a LinkedIn premium inmail",
            "This sounds really really hard lol",
            "Were the asked questions straight out of the leetcode tagged questions? Did you sort by frequency?",
            "Firstly, Congratulations! 300k as an international is INSANE🎉🎉\n\n\nI have a few questions for you:\n\n\n1. Did they even ask a single question about your previous work ex? If yes, what did they look like?\n\n\n2. If one decides to directly apply to a job posting, what would the timeline look like? For new grad, the openings are posted in September of the previous year, right?\n\n\n3. I too have 2 years of work ex, so I would be applying to E4 as well. When do E4 roles open up? Do they have a rigid timeline like the new grad openings?\n\n\n4. Any tips for the mail content while drafting one for the recruiter? \n\n\n5. My previous work ex is in web dev. I believe you said you had your's in app development, which I believe is relatively more niche than web dev. Any tips for applicants with web dev work ex?",
            "Meta is trash. They failed me on the interview because one interviewer wanted me to code in C++. I told him I didn't know C++ and I never claimed I did. It wasn't on my resume. He looked at me like I just wasted his time and I know he's the reason I failed.",
            "Congrats! As an additional DP I was asked BFS in my Meta screening for E4 :)",
            "Helpful thread here congratulations.",
            "Congratulations fam!! Meta E4 here happy for you",
            "Tc,",
            "How in depth did they go for your system design? I have my E4 onsite in a few weeks and I feel woefully underprepared for system design but everything else feels fine.\n\nedit: also, it took 3 months?? my recruiter wanted me to close the loop faster lmao so from application to onsite it is around 1 month for me.",
            "What resources did you use for the system design interview?",
            "Hey OP. Just went into team matching yesterday as well. I am also international with 2 yoe. Mind I dm you?",
            "I’d like to get a better description of your profile if possible.\n\nSchool rank?\n\nWere those 2 YOE at a tech company?\n\nWhat kind of projects did you do?\n\nI’m a domestic student currently doing an online MS at T10, have 1 YOE at small non-tech company, and have zero projects. I would probably only get interview for E3 with those stats.",
            "👏👏🎉🎉",
            "Congrats!",
            "I’m genuinely stoked for you and I appreciate how down to earth you are in all of your responses. Thank you for all the advice and congratulations once again! Kick ass and take names!",
            "Congratulations!",
            "Grats man! I currently work in a faang/faang adjacent company and failed the meta interview because I didn't prep enough since my last faang interview 2-3 years ago.",
            "DAMN so 5 rounds in total practically? That’s fucking crazy… (im switching to business)",
            "Do you thinn you are able to share your anomynized resume?!",
            "Interested!\n\n[dickandballs@gmail.com](mailto:dickandballs@gmail.com)",
            "It shows that you worked smart and hard for this. Thank you for sharing the abundance of great information that you did and congratulations!!",
            "Congrats! And thanks for the detailed post",
            "I am an international student with 3 years of experience. I also interviewed for E4 role. After my interviews went well, the recruiter said that the feedback is positive and then later he said that I won’t be eligible for the role because the role needs the canditate to be at least 9 months out of college. My interviews were good and the feedback was also positive. \n\nI am surprised how you got the role. I was thinking this policy is across the company.",
            "TC or GTFO",
            "I'm in the same boat as I graduate in May. When did you apply? it's just Feb right now and you got an offer? I heard that they ignore you if you can't join right away",
            "What programming language did you use in your interviews?",
            "This is not for the new grad role right?",
            "how did you get past team match",
            "Was your experience outside US a FANG adjacent company",
            "What 2 years of experience did u have before this? Were they big tech? Recognizable companies?",
            "Congratulations 👏👏👏",
            "Congrats Boss 🎉 👏",
            "How hard were the hards",
            "Thanks for the info! I haven't had a coding interview yet but I have one scheduled for the near future. Can you tell me what is the expectation for such an interview? Like, do they expect you to find the optimal solution and code it perfectly or do you think it would be fine to just find the optimal solution and write the code that has most things right?",
            "Congrats Op, which country is the role based in, and were you already in the country before applying for the role ?",
            "You sound like a nice person. Glad you find an offer at meta.",
            "Great post. Did you have a ton of internships under your belt during your bachelors?",
            "RemindMe! 3 months",
            "[deleted]",
            "Wish I was in college already, I start around September and currently a Senior in HS still.  \nPeople are saying that Meta are currently rising their jobs and I can see that it's working.",
            "First of all congratulations on the offer, second I want know what type of app you created? You mentioned it had over 5 million downloads which is quite impressive.",
            "Question about system design I guess: Did they expect you to name specific technologies you were going to use? For example did you specifically have to name drop Kafka/Kineses/ElasticSearch or somethign like that? Or did more generic descriptions of message queues work",
            "Hi, did you come up with optimal solutions for all 4 problems? I just finished my onsite yesterday. I solved all 4 problems but one of them wasn’t optimal. Wondering if that would hurt my chance."
        ]
    },
    {
        "post_id": "18b6rik",
        "author": "EitherAd5892",
        "title": "Rejected by McDonalds",
        "url": "https://www.reddit.com/r/csMajors/comments/18b6rik/rejected_by_mcdonalds/",
        "score": 648,
        "num_comments": 85,
        "created_utc": 1701761677.0,
        "selftext": "Unemployed new grad and  applied for a job at McDonald’s burger flipping position. Manager outright rejected me after the interview when she said I’m too over overqualified for a cs degree. Btw I have 2 swe internships. Even fast food chains won’t even hire cuze you too qualified. For those of yall out there with 0 internships are fucked. Fast food ain’t even hiring yall. About to apply for janitorial roles at a school in the meantime. Also been grinding leetcode and up to 50 hards done now. Also applied to 600 apps and 4 interviews of which 3 were scam. 1 interview ghosted me. Yall 2024 grads are so fucked.",
        "permalink": "/r/csMajors/comments/18b6rik/rejected_by_mcdonalds/",
        "comments": [
            "if u rly r applying to flip burgers, dont mention ur degree at all. They dont want anyone threatening their job title. theres no way u alrdy dont know this tho?",
            "You need to tailor the resume to the specific job posting. \nOtherwise you get screened out before having a chance",
            "McDonald’s doesn’t want you because they know you’re going to bail the second you get another job. No notice, just gone. And they’re in the fast food industry, which means they already have a higher turnover rate than average, so they want people that are going to stay for a while, because that improves reliability and efficiency.",
            "Shitpost",
            "Construction always needs labor and the pay is decent while you job hunt. Might even snag an IT role at a large general contractor.",
            "I got a referral to Burger King, but could not pass the technical.\n\nI have a 4 part interview with Wendy's starting tomorrow, wish me luck.\n\nIf I cannot get into the big restaurants, I might just have to job hop.",
            "Please have the courtesy to add a shitpost tag at least!!",
            "https://preview.redd.it/d2pz62xrsg4c1.jpeg?width=320&format=pjpg&auto=webp&s=3be6c22636474124b9bb5b4c729566c16407590d",
            "No way this is true lmao y’all got me scared as shit how is this possible are all new CS grads just unemployed?",
            "Same been getting rejected for retail roles I might drop my degree and internships",
            "Bro I actually got ghosted by McDonald’s for a SWE role (after phone interview)",
            "Yeah when I apply to warehouse jobs, I have to remove all my cs school stuff",
            "Dude, if you want money asap, I’d recommend starting uber, door dash, you make double for what you make at fast food which is minimum wage. Sad to hear that companies won’t hire you, but make connections with people, that’s your best bet to land a position in coding.",
            "You need networking. Get someone to refer you to mcdonalds. It’s all about networking",
            "Get yo negativity away from me",
            "Honestly, if you can’t even get a job at a fast food place then there is something wrong with your social awareness or how you present yourself.",
            "It’s joever",
            "all the comments missing the obvious shitposting lmao",
            "Idiot",
            "very disrespectful of you to shit on a job you don't want, won't stay at, will take away from someone who DOES need it and will stay at, because a business owner (they are franchises you twat) doesn't trust you\n\ni wouldn't hire you to flip burgers, or code, either",
            "Mcdonalds is not gonna tell anyone their over qualified, hahaha cap.",
            "November/December tend to be a hard time to find anything. Most budgets are settled, interviewers, managers, and recruiters are taking time off, and major projects are scaled back and put on hold until people come back. It's hard to say what will happen with the tech market next year, it's always unpredictable. In January if you haven't yet make sure to reach out to mentors/managers on linked in from your internships, let them know you're looking for a role and that you appreciated the learnings you got with them. Politely ask if they have any leads. You might get a referral that way.\n\nBut if you really need something to bridge the gap don't automatically look at minimum wage jobs. That CS degree makes you way too overqualified for those and the managers know that you're a temp at best if you get hired. The CS degree could be an asset if you were to apply to trades jobs, data analytics, tech support, IT, manufacturing, etc. Get creative.",
            "I hate Mcdonald's rejection email. Stop your templated email bullshit.  \n\n\nThe competition for this role was high and you were among a number of very strong applicants. We’ve decided to move forward with other applicants but appreciate your interest in McDonald’s.",
            "Bro if you are manager of the burger flippers would you hire a CS graduate who’s gonna leave your ass in a couple months and waste then time training you?\n\nIt’s an efficient algorithm bro. You known this. 😂",
            "The problem is that you didn't bother to tailor your resume for the particular job title. They can tell you applied cynically out of frustration. You should send a cover letter explaining your situation and explain, respectfully, why you are interested in pursuing the fast food industry.",
            "🧢",
            "i tried to sell my kidneys on the black market and was rejected for being overqualified",
            "You are giving your degree and internship on burger flipping application? Not completely surprised you are unemployed. Didn’t they teach you to tailor to resume? What do you think it means?",
            "Bro are you serious? Obviously you're noting going to be hired in an entry level position at McDonalds.\n\nThis post is insane.",
            "They only hire h1b for new grad",
            "If you want to get a fast food job, then during your interview present like a fast food person.  Easy.  Not nice to say the 2024 grads are f'ed.  They might be better off than you.  Would you hire a brand new shinny grad, or some rando sketchy janitor?",
            "I’ve had to work a few jobs in food service and retail to make extra cash and I give a different resume without my tech work and I’m always successful in getting the job this way",
            "Just don't put on there you have a CS degree they don't knew to know if you have a better opportunity that you will quit for the better. They want people with no leverage. But you do that's what scares them to hire you.",
            "Try doing some projects like homemade burgers, or maybe contribute to some open cooking competitions. You need to prove that you can cook and deal with customers.",
            "You messed up applying to work at the franchise.  You need to apply for a corporate role which they are looking for talent, same with Walmart, Target, and Best Buy.\n- https://careers.mcdonalds.com/jobs?page_size=10&page_number=1&keyword=software&sort_by=score&sort_order=DESC\n- https://careers.walmart.com/results?q=&page=1&sort=rank&jobDepartmentCode=00000159-75a2-d286-a3f9-7fa2bac60000&expand=department,brand,type,rate&jobCareerArea=all\n- https://jobs.target.com/category/technology-and-data-sciences-jobs/1118/67611/1\n- https://jobs.bestbuy.com/bby?id=career_area&content=corporate&career_site=Corporate&spa=1&s=relevance&r=&q=software&l=#all_jobs_search\n\nStop spamming jobs and actually make sure you are qualified for the job, then cater your resume for the job.  Look outside of where you live and be prepared to move if needed if you do not live in a hot zone for talent.\n\nSomething you may not know but I'll just post this here as someone that has built the tech to screen applicants at scale.  If your resume is not catered to the job, there are many triggers, signals and other filters we put in place to auto trash the resume so it is never seen by the recruiter or hiring manager if it falls below the required minimum threshold for what is being looked for.  The more resumes we get the more data we have to train on great, good, mid, poor, and horrible resumes for the talent that should get the job and those that should not get the job.\n\nSo do not just slam your resume to places, but look at the job, do a full self-assessment of your actual capabilities and only if you would potentially do at least a good job apply.  Anything less, and you should move on.  This will reduce your stress, give you higher response rates and get you into a job that you might actually be a good fit for.",
            "Whats the deal with leetcode on this sub? Yall put that in your resume or is it just preparing for interview test/house work",
            "I lowkey miss cutting pizza at Little Ceasars. I think I will do that for a few months when I have plenty of time after working my dev job. I finally understand why Lester Burnham from American Beauty quit his desk job to flip burgers.",
            "Technically by your definition, the 0 internships people are better off since they can atleast get a job at McDonald’s",
            "troll post?",
            "Damn this is crazy",
            "A janitor who knows how to code. Sounds cool to me.",
            "I've been rejected for several positions for this reason, am grown, have grown bills to pay. Currently serve at a comedy club down the street from me but even then they were concerned. IT job literally said I was a top pick but because of the degree they're going to move with someone else because they don't want to train me up just to leave later in the year. I legitimately am thinking of just not mentioning the degree anymore but idk how tf I explain all the gaps I've had the last six years.",
            "dawg you went into one of the most saturated markets at one of the worst time after rounds and rounds of layovers in the industry, it's not just you it's everybody and anybody trying to get their foot in the door right now"
        ]
    },
    {
        "post_id": "qmywr9",
        "author": "chickyban",
        "title": "GOT AMAZON!!!! This is someone who did not get a single offer last summer",
        "url": "https://www.reddit.com/r/csMajors/comments/qmywr9/got_amazon_this_is_someone_who_did_not_get_a/",
        "score": 650,
        "num_comments": 54,
        "created_utc": 1636072061.0,
        "selftext": "YOU can do it. I was YOU. I'm not talking to anyone that has been a smug brat for a million years thinking about HYPSM or FAANG or whatever and scoffs at 150k offers because \"Oh it is not a unicorn thou\". Im talking to people that were in the fucking mud, like me, working at a fucking chicken place last summer. I could say a million things to help you but what i would like someone to have said to me then is \"you have to want to do it more than you hate being rejected\"\n\nCheers to everyone! CS is a ticket to the moon and we need to be aware of how lucky we are to love it (or at least be able to do it).",
        "permalink": "/r/csMajors/comments/qmywr9/got_amazon_this_is_someone_who_did_not_get_a/",
        "comments": [
            "Congrats. And thank you for passing on encouragement. Now do a little dance if you haven’t already.",
            "Congrats, friend! As an older student who's worked crappy job after crappy job, I'm always miffed at people in this field who scoff at $100k salaries.",
            "Disappointed. You could have worked at McDonald’s instead",
            "Lets goooooo!! and by chicken place could it be chick-fli-a? if yes then you honestly downgraded :p",
            "\n>we need to be aware of how lucky we are to love it (or at least be able to do it).\n\nThis is so profound in my opinion. To love it, and to be able to do it.\n\nCongrats on your offer my dude.",
            "Bro I literally solved the technical problem and the engineer said I got it and got a rejection email yesterday",
            "I AM you. I did not any offers last year, but this year I finally got Amazon. it feels so good man. LC grind really paid off.",
            "Congrats! Can you please share the resources you followed? \n\nPlease share some insights of your journey as well. Things like \"I wish I knew this earlier\".\n\nThanks ion advance. Cheers!",
            "Never having to work in a kitchen or drive-thru again was the goal, now it's a reality. I would miss out on so many fun weekends having to work and do homework. Seeing my friends slack-off because they \"knew someone\" and had their groceries and rent paid was painful, but I could care less now in hindsight.",
            "A sincere congratulations! 🎉 Here’s to the next chapter!🍾 \n\nThis non-traditional military vet in his 30s needed to see this today!",
            "Nice, I got Amazon too! Got the student discount and everything!",
            "Man, looking at these sort of posts always makes me feel so inadequate. I am happy for you, OP\n\nWould you mind telling us your journey? What the interview process was, etc.?",
            "Congrats!!!!",
            "Congrats!!!! Any advice for a sophomore?",
            "Let’s gooo!!",
            "Congratulations man ! Would u mind giving me some advice? I am a freshman now and want to apply next year to all the shit I can including faang ones, I guess my biggest concern is actually getting the interview 🤣",
            "congrats!!!",
            "AAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHH",
            "congratulations!!",
            "Now tell me how to get it with a poor English",
            "Congrats!! 🥳 I am happy for you! 🥲",
            "Congrats!! 🥳 I am happy for you 🥲 good luck in your internship or job!! 🍀💗",
            "I needed this, thanks!",
            "PogU, welcome to the company! I think you'll really enjoy it here :)",
            "Congrats!!  🥳 how does it feel? What other things have you learned from this experience? 💗",
            "Yayy congrats! Just got an offer too :)"
        ]
    }
]