[
    {
        "post_id": "xyfdjv",
        "author": "Hard_Work12",
        "title": "Take care of your mental health and stop comparing yourself to others",
        "url": "https://www.reddit.com/r/csMajors/comments/xyfdjv/take_care_of_your_mental_health_and_stop/",
        "score": 653,
        "num_comments": 41,
        "created_utc": 1665190912.0,
        "selftext": "I kid you not but for those of you who are seniors who are about to graduate and searching for a job and in school full-time, please take care of your mental health. Stress can take a huge burden on your mental health especially when you are dealing with school and job hunting at once. Also, don't compare yourself to your peers. I know it sucks to hear your friends or people you know get return offers from their internships and make 100k salary or whatever and if you compare yourself to them, you will feel like complete crap and distracts you from accomplishing your goals. Also, don't go on Linkedin unless for good reasons like networking or job hunting because it can also feels discouraging when you see posts with your peers announcing job offers when you have nothing at the moment. Always keep your head up, keep working hard, and stay focused. At the end of the day, I truly believe you can get to where you need to be if you put in the work and focus. It may take longer for some but just play your own game.",
        "permalink": "/r/csMajors/comments/xyfdjv/take_care_of_your_mental_health_and_stop/",
        "comments": [
            "The only person you should compare yourself to is your past self.",
            "Lol honestly it's kind of hard to accept your subpar. Growing up a loser, school was the only thing I was good at. Problem is, CS attracts the most brilliant minds so it will make a slightly above average person look like a dumbass.\nWell, it is what it is.",
            "also OP: SWE intern @ JS, Prev. @ Google DeepMind, Uber, Meta",
            "Yeah, this is good advice. I felt the imposter syndrome hard (still do) all through my first three years. Finally got an internship and then an offer, which was a huge relief.  Now I’m trying to undo all the habits and harm done dealing with the stress of it all. Just started therapy 3 weeks ago. Talk to counseling services at your schools, your tuition already pays for it. I’m trying to become a normally functioning human being again, and not just a functioning addict on the brink of collapse, before I begin my career next year. You can’t control what happens to others, so try not to let it stress you out. Comparison is the thief of joy. Your degree is valuable and you will find a job. Stay safe",
            "I get sad for a second seeing my peers get microsoft, space x, or in general starting off their careers as software engineers. But people really do be built different and I just need to accept that. Gotta put in the work I can and go from there. That's what makes me accept it and be happy",
            "Getting a job > my mental health. Or I'll end up homeless lol",
            "Yea this is great advice as a new grad I definitely get that imposter syndrome from time to time, but if you're putting the effort in to learn, study or whatever you'll get there. That thought keeps me sane and helps me re-evaluate goals. Plus having some hobbies outside of software, no matter how cool whatever you're working on is, after a certain TC level a job is a job you do to sustain your lifestyle unless CS IS your passion",
            "Excellent advice but my fellow freshman on this sub trying to get the first internship this applies to you guys too. Absolutely do not get discouraged if you dont get one this year. Just do the work and if it doesnt work out, hey you just have the advantage of experience when you apply next year, when much more companies will actually consider you. And if you did get one as a freshman, I'm literally so proud of you.",
            "Also wanted to add some advice on physical health. Please workout 3-4 times/week or more and stop eating junk food and eliminate sugary goods to boost your confidence and self esteem. There is a recent spike in cardiac arrests among young lads, the primary reason being a poor lifestyle.",
            "(1) Believe in yourself \n\n(2) Winners Focus On Winning Losers Focus On Winners",
            "needed dis today dawg",
            "Another thing I would highly encourage is to not get hung up on grades or gpa. I had a fairly decent (3.4x) gpa from a decent school, but was too upset and embarrassed to put it on resumes. However, I quickly realized nobody cared. Not 1 bit. Nobody asked, and it was never required for any of my applications (And I ended up securing a job at a faang+ company!)",
            "Nah, that HRT offer ain’t coming itself",
            "The second person I told about my return offer was my therapist. We did it together <3",
            "Worst thing is, realizing how much school name helps. I know everyone would deny with this, and I agree that after first internship it doesn’t matter much. However, I have friends who has virtually no experience, sophomore, get past the resume screens at Amazon. While, I have a part-time experience on my resume but get ghosted.",
            "Sorry no can do",
            "As someone out in the workforce and easily beating all his peers, the people I've met in this subreddit show so much more promise than the morons I went to college with.",
            "sorry thats how i live",
            "No",
            "I’m about to metamorphosize",
            "Certainlt. Comparison is the killer of joy. Everyone has a different path.",
            "Currently working as a teacher while my friend working at FAANG, they told me to apply as they consider me smarter but I have delaying due to fear of rejection and stuff. I probably should just go for it but the anxiety of OAs and all the interviews have stopped me from. Ty for post cleaning my mind a bit",
            "Standardized testing and expectations grown by media seem to fuel ideas that are not really everyone's cup of tea. I for example couldn't give the slightest about university grades, but those are what I'm forced to get.",
            "Sucks when you are the lowest one",
            "Thank you for this! I find myself getting more anxious than normal since the semester started, and it’s hard because I’m having all these questions like what job do I want or where will I be in a year from now or how much time should I dedicate to an assignment, etc. it’s def difficult to stay focused but it’s reassuring to know that I’m not alone.",
            "I have a rule that every time I compare myself to someone really good I have to also compare myself to someone really bad."
        ]
    },
    {
        "post_id": "qoiekg",
        "author": "None",
        "title": "Stop Bitching About Your FAANG Offers Not Being Prestigious Enough",
        "url": "https://www.reddit.com/r/csMajors/comments/qoiekg/stop_bitching_about_your_faang_offers_not_being/",
        "score": 648,
        "num_comments": 86,
        "created_utc": 1636264659.0,
        "selftext": "\\^\\^\\^",
        "permalink": "/r/csMajors/comments/qoiekg/stop_bitching_about_your_faang_offers_not_being/",
        "comments": [
            "Wait, people cry about getting Facebook??",
            "While we're at it can we stop hating on new grad offers under 6 figures",
            "And here I am dropping one of such prestigious roles because role offered sucked. I rather take a meaningful role from a \"peasant\" company where I can learn. I learned money will come with experience. (Note: \"peasant\" company is any non-FAANG company according to this toxic thread).",
            "I’m about to leave this sub if I hear any more about FAANG. Good fucking lord a small tech company with a good work life balance is enough for me.",
            "[deleted]",
            "The majority of these people either end up hating their role, or they can't stop chasing that \"prestige\" and are never happy with their role because there will always be someone at the same level with a better offer at a more prestigious company. Really unhealthy.",
            "I just turned my offer down from Apple and canceled my interviews with Facebook to accept an offer at a much smaller, energetic, and accepting company. I worked at Apple as an intern and while it was an amazing experience I couldn’t imagine being there any longer. Take the lower pay in exchange for a company who values your well-being and work life balance. The majority of people at these FANNG companies are stuck up land only care about their paychecks.. Couldn’t be me 🤣",
            "Am I just missing these posts?",
            "After graduating a few years ago, this sub was just funny to scroll through every now and again, but if that's the state it's currently in than it's too toxic to even laugh at. Some of y'all need to reevaluate",
            "[deleted]",
            "I never really get this… are all of these people living in Cali and New York? In my city it’s really really unlikely to get over 100k straight out of school it can be done but 70k-80k is a GREAT salary that most people would be happy with",
            "It's all relative.",
            "People have different goals in life m8. FAANG doesn’t offer the particular tech I want to work on while interning, so I focused on other tech companies. Others join and then leave as L3/4’s because they realize that they aren’t making any impact there.          \n\nAs for ranting about prestige, I’ve literally never seen anyone here complain about the prestige of a FAANG internship aside from Amazon. If you decided to write this entire post as a reaction to some random single guy complaining about FB, 🤷‍♂️",
            "I can’t understand people that enjoy working there. They are fucking data miners that don’t respect user’s privacy",
            "Man I can't even get an interview LOL",
            "Dumbass kids. This tendency to constantly chase clout and prestige will be the end of this field.",
            "FAANG jobs are for plebes 😒. Come back to me when you have a better one",
            "Y’all need some peanut butter",
            "This 👽☝️",
            "Isn’t it MAANG now with Meta?",
            "Has anyone interviewed for Google London?\nDid you get the job? How's the work environment?"
        ]
    },
    {
        "post_id": "q2t2bp",
        "author": "SiciliaDraco",
        "title": "My freshman dumbass accidentally applied to Bloomberg's new grad position and got a phone interview LMAO.",
        "url": "https://www.reddit.com/r/csMajors/comments/q2t2bp/my_freshman_dumbass_accidentally_applied_to/",
        "score": 650,
        "num_comments": 54,
        "created_utc": 1633552972.0,
        "selftext": "Thank god this recruiter was understanding and let me switch to intern.",
        "permalink": "/r/csMajors/comments/q2t2bp/my_freshman_dumbass_accidentally_applied_to/",
        "comments": [
            "Really, what the fuck did u put on your resume bro?",
            "[deleted]",
            "slight flex",
            "[deleted]",
            "Hey! I'm a returning intern at Bloomberg! Send me a DM",
            "Homeboy really just negotiated a demotion",
            "Consider it good practice for interviewing? \n\nAlso, niiiice!",
            "Consider it good practice for interviewing? \n\nAlso, niiiice!",
            "I have interview day after tomorrow and am already anxious (:",
            "Wait bloomberg intern opened when?",
            "This is some next level flex bruh",
            "What level of mastery is this?",
            "R u a minority?",
            "same experience lol I applied to 5 new grad positions just for fun and got 4 interviews. whereas I get maybe 2 interviews of 100 intern jobs",
            "imma doing this intentionally now heha",
            "At that point I would just go for it lol\nFuck school, I already got a job at a huge company 😎",
            "“Accidentally” I’m gonna start doing this 😭"
        ]
    },
    {
        "post_id": "9rqd3s",
        "author": "still__unemployed",
        "title": "Last year I got ghosted and rejected everywhere. This year I got my shit together, made a github, did side projects, won some hackathons, and applied to over 80 different companies... Here are the results!",
        "url": "https://www.reddit.com/r/csMajors/comments/9rqd3s/last_year_i_got_ghosted_and_rejected_everywhere/",
        "score": 649,
        "num_comments": 38,
        "created_utc": 1540602253.0,
        "selftext": "I still have no internship, but now I also have crippling depression. ",
        "permalink": "/r/csMajors/comments/9rqd3s/last_year_i_got_ghosted_and_rejected_everywhere/",
        "comments": [
            "its funny the way you said all this but its really not funny.  Im sorry buddy but keep on keepin on.  I think if you keep trying eventually someone will give you an opportunity.  And even if its no ideal or what you want i would take it.",
            "At least you still have your sense of humor. ",
            "That was... anticlimactic.",
            "F",
            "[deleted]",
            "LMAO I was expecting a feel-good inspirational story but thx",
            "Amusing but disappointing. Just like my penis.",
            "damn son really had me going there.",
            "See you forgot to do 900 Leetcode problems while doing all of those and having crippling depression. /s\n\nFuck the current interview process",
            "Wasn't expecting a punchline in this sub.",
            "Need to know where you are applying, where you live, where you are willing to move, and how you resume and cover letter look. If you're not afraid of the cold the twin cities of Minnesota has an unemployment rate of 1.5% for computer science major jobs.",
            "Yeah I know this feeling. Got my shit together and it wasn't enough.\n\nDid you get interviews?",
            "In case you aren't shitposting, where in the process are you getting stopped now?",
            "Hahahahaha same :( I feel you bud ",
            "Ahahahahahahahhahahah\n\nCan you show your resume ? ",
            "r/me_irl",
            "You must be doing seriously something wrong. ",
            "me too, thanks ⚰️",
            "i cri :'(",
            "Lol, I was thinking to myself, oh I'm going to hop on this and say \"username doesnt check out\" and it'll be funny. RIP lol.\n\nUsername checks out.",
            "Do you have your degree? Where are you applying (area)? ",
            "Apply to more companies! ",
            "Realistically how old are you?(school wise)",
            "How well do you know C? C++? C#?  \nAny experience with Linux?",
            "If you won some hackathons there's no fucking way you don't get an internship",
            "> applied to over 80 different companies\n\nIsn't that your issue? You're still like every other loser, hosing everybody with your resume. Companies don't give a shit.\n\nGo talk to people. Get them interested in you. Pump up your soft kills. There's so many incompetent developers out there that have a job; you're better than them, so if you don't have job yet, you're doing something wrong.",
            "wow you must be the worst interview in the history of interviews "
        ]
    },
    {
        "post_id": "1cfogmx",
        "author": "Purple_Guarantee2906",
        "title": "Chat are we cooked",
        "url": "https://www.reddit.com/r/csMajors/comments/1cfogmx/chat_are_we_cooked/",
        "score": 645,
        "num_comments": 179,
        "created_utc": 1714358906.0,
        "selftext": "Found this on r/cscareerquestions:\n\nGoogle just laid off its entire Python team\nhttps://www.freepressjournal.in/business/for-cheap-labour-google-fires-its-entire-python-team-report\n\nHacker news post about this: https://news.ycombinator.com/item?id=40171125",
        "permalink": "/r/csMajors/comments/1cfogmx/chat_are_we_cooked/",
        "comments": [
            "Man I wanna get laid too 😩",
            "Do they still a have Java team and a C++ team?",
            "The only time CS majors get laid is when they’re getting laid off😭",
            "We are being replaced by AI, Anonymous Indian.",
            "Btw the “entire python team” is 10 people lmao",
            "What does \"Python team\" even mean. Is it the ones who are developing Google Client libraries in Python, is it those contributing directly to python releases, Google is such a massive company that these firings could be bad wording for reshuffling engineers around",
            "Entire team is 10 people?",
            "Tf does Python team even mean that shit sounds too broad.",
            "They probably meant those group of people who were more interested in the python's (snake) physical characteristics,etc instead of working in python language. /s",
            "Cooked to medium rare",
            "Not sure why you guys have to ask anymore, yes, CS is cooked.",
            "Did you even read this clickbait junk? Less than 10 people... How many employees does Google have? Lol",
            "Is this real? ",
            "Article looks like it was written by ai then re-translated four times. It’s also super vague and cites twitter as a source",
            "Fuck Python, all my homies hate Python.",
            "“Chat are we cooked” \n\nYes, you are cooked",
            "Productivity gains from AI are making the current work force worth more. Eventually, that gain will normalize and companies will get back to hiring ",
            "lol as I’m doing grow with google python automation course lol",
            "time to learn a trade boys ⛏️",
            "Sundar is destroying Google",
            "> This as the complicated system of Artificial Intelligence is written in the sophisticated Python language.\n\nWhat is this article on about?",
            "How is the best and most loved language professionals were laid off?",
            "Been fried",
            "Bout damn time",
            "I hope they spared the Scala team!",
            "I heard that anyone who ever even glimpsed at Python code and remembered any of it was laid off. Basically it was like that SCP that goes berserk when you look at it’s face. Same deal here but with Python code. \n\n/s (just in case)",
            "Just great",
            "Sheesh--I've certainly done my fair share of Python over the years! Guess I should be glad I'm not at Google?  😆",
            "Having read some of the API documentation for Google python libraries, i would say this is not a huge loss tbh.",
            "I think they wanna fire them for their snakey behaviour 🐍",
            "How many people tho?",
            "what the fuck just happened? I can't believe",
            "Webdev is dead get into embedded",
            "Time to switch majors for y'all freshmen 😂😂😂😂 there will be no jobs when you graduate"
        ]
    },
    {
        "post_id": "15vtaa7",
        "author": "Economy_Departure_77",
        "title": "I hope that all of us gets jobs",
        "url": "https://www.reddit.com/r/csMajors/comments/15vtaa7/i_hope_that_all_of_us_gets_jobs/",
        "score": 647,
        "num_comments": 91,
        "created_utc": 1692483240.0,
        "selftext": "Title. The market hasn’t been good but I hope that it will improve and I really hope that we all get a job after graduating. All the best guys!!!",
        "permalink": "/r/csMajors/comments/15vtaa7/i_hope_that_all_of_us_gets_jobs/",
        "comments": [
            "I had a whole anxiety attack when being told by manager I wasn’t getting a return offer due to headcount. Super worried atm barely any new grad positions",
            "I’m in my second year and I might need to change my field….I really don’t want to work this hard just to not be able to get a job.",
            "People are going to get a job eventually if they ain’t crazy. However it might not be the job they wanted but just doing it for a living.",
            "bro was trying to make a sweet post and you nihilist-esque mfs are talking about how you hope people are wiped from tech and how some will have to work in retail. unreal ☠️",
            "Just remember that graduating in a recession means you will be put at a permanent disadvantage for decades to come: https://siepr.stanford.edu/publications/policy-brief/recession-graduates-long-lasting-effects-unlucky-draw\n\n&nbsp;\n\nThis will be shown when there are 3 years of new grads competing for a reduced number of entry level positions next year, and will keep getting worse until the number of cs majors drop off (will take at least 4 years for this to happen)",
            "With the job market, I just hope to win a lottery jackpot lol. I’ll open my own start up",
            "I graduate next spring, hoping the market is in better shape then ❤️",
            "Thanks for some kind word. My parents think I am playing games or watching shows on my laptop when infact I am rubbing my head against leetcode.",
            "I want everyone to have to work at Wendy’s with me",
            "It won't get better, especially this year. +10% new grads every year in CS with decreasing number of job openings. This will only cascade into next year with 2023, 2024, and 2025 grads competing for the same entry level positions. I expect lots of unemployed CS majors forced to work retail in the next few years",
            "[deleted]",
            "I hope not. Really need to flush those who don't belong in this field for the betterment of my own career.\n\nDownvote me all you want but end of day, this field just can't sustain this exponential continuous influx of candidates. Supply and demand. Something's gotta give. Higher supply brings a higher pressure to lower pay and/or more toxic work life balance.",
            "Everybody gets jobs.\n\nNow, it probably won't be doing what you want to do.  Or the way you want to do it.  Or at the money you want. Or in a location that's ideal.\n\nBut that's life.",
            "needed this thansk",
            "Only way to get a job is by setting yourself above others. Highly competitive market. Some will get jobs, some won’t :/ but we can all hope and wish the best for others.",
            "Thanks for the kind words. We all need that type of positive energy right now! :)",
            "Is not there lot of job openings? I guess market is getting better. Correct me if I’m wrong here!",
            "No",
            "I hope that not all of us get jobs so I can work 3 jobs at once and get burnt out within 6 months",
            "WAGMI",
            "Recent new grad here, applied to an internship that was posted within the hour and it already had 200 applicants. Do I end myself now or later",
            "We can do it! ~_~",
            "nah go work as a janitor",
            "[removed]",
            "Haven't gotten a job in tech, even worse I have no internships which is my fault.",
            "so is this expected to go on the entire decade? has the degree become too bloated to be a good pick"
        ]
    },
    {
        "post_id": "11w05wi",
        "author": "MrBurtMacklin",
        "title": "Want to get ahead of the curve: What should I do this summer?",
        "url": "https://www.reddit.com/r/csMajors/comments/11w05wi/want_to_get_ahead_of_the_curve_what_should_i_do/",
        "score": 648,
        "num_comments": 46,
        "created_utc": 1679265358.0,
        "selftext": "I’m currently a sixth grader in middle school and I’m planning my career into HFTs and potentially managing a hedge fund someday down the line. \n\nIn order to set myself up for HFT or FAANG jobs, what programming skills should I learn in this upcoming summer, and would any of you guys recommend any jobs/internships/research that I should do?\n\nI’ve already completed about 20 LC hards and finished Numerical Linear Algebra and Advanced Probability and Statistics but I feel this won’t be enough for me to get into HFTs.\n\nI’ve won a Putnam prize and I’ll be getting my CFA next February (I fear a bit too late 😰)\n\nPlease help me out!",
        "permalink": "/r/csMajors/comments/11w05wi/want_to_get_ahead_of_the_curve_what_should_i_do/",
        "comments": [
            "If you're in sixth grade and you haven't had an internship at Google yet then I doubt you'll ever have a successful career",
            "If you give me your parents' credit card numbers and their 401k info I hear that'll really get you far ahead of your peers in CS",
            "It’s already too late. At age 7 you must have already built a computer, then a language for. Then make an ide with that language. Then finally you must have already written the compiler for your language using your language. \n\nAll that should’ve been done before sixth grade. You are already behind. Your best bet it to quit and become an artist.",
            "[deleted]",
            "So, shitpost Sunday, then?",
            "Dude... I was legit on about \"Man not another one of these...\" until I read sixth grader. Reminder that today is sunday hit me immediately after.",
            "one day an actual 6th grader will make this post",
            "Chick fil A is 🔥",
            "[deleted]",
            "It’s time to network your ass of by contacting all your friends to hang out and go places and have fun and be a kid cause you’ll have your college years to be overthink about your career. Relax you already one upped everyone on this sub",
            "Just give up AI has doomed computer science!",
            "Robotics summer camp helping less privileged kids. Want to stand out from the rest early on? Do shit like that.",
            "You should’ve asked this question 5 years ago in 1st grade bro, I’m sorry but you’re WAYY behind.",
            "The place I work for won't even look at a new prospect unless they were coding directly out of the womb! Smack, burp, produce a function! Good luck, kid!",
            "I know this is a shitpost but I just finished going over resumes for HS interns and it’s scary how much these kids have on there. Sure it’s all superficial and not incredibly in-depth material they’re exposed to, but damn it boggles my mind how these kids have/make time for this stuff instead of what we did as kids growing up.",
            "I really don't like the fact that a teenager genuinely interested in Computer Science came onto this subreddit, asked for advice, and got clowned on. Could you guys think of putting yourself in his shoes? At a time as formative as his, the possibility he is dissuaded from computer science entirely from a reaction like this is pretty nontrivial.",
            "I won the Putnam on vacation the Summer between third and fourth grades. You're better off applying to med school so you have a trade to fall back on.",
            "6th grade???? Go have fun bro",
            "My dumbass is not able to figure out if this is real or just sarcasm.",
            "get a life and touch some grass..",
            "Go back to Recess",
            "🤣🤣🤣🤣🤣🤣",
            "In all reality I think the return on investment to going hard on leetcode will pay off immensely. When you’re tired of that pursue a passion side project that you’re genuinely interested in",
            "It's great that you've already completed a lot of LeetCode hard problems, as well as studied advanced math topics. For programming skills specifically, I would recommend focusing on languages like Python and C++, which are commonly used in finance and high-frequency trading. Additionally, it would be useful to learn about algorithms and data structures, as well as machine learning and artificial intelligence.\n\nAs for internships or research opportunities, it might be a bit early for you since you're still in middle school. However, you could look into coding camps or summer programs that focus on computer science and finance. You could also start networking and reaching out to professionals in the field for advice or mentorship.",
            "Sixth grader ? Damn",
            "damn- i wonder if this is someones dad figuring out the path for their child",
            "Do calculus and  linear algebra",
            "Udacity has a good algorithmic trading course— it requires a pretty sturdy internet connection though.\n\nIt mostly relies on python but I imagine in the real world HFT it world be better to implement in c++ as it’s probably going to be faster in executing trades.\n\nI don’t work in either of those fields but I did take the class and found it extremely useful!",
            "By the time I was in sixth grade I learned how to make penis jokes. If you can’t manage this by the end of the summer, you might not make it. ☹️",
            "If you haven’t handcrafted a cpu yet you already failed"
        ]
    },
    {
        "post_id": "17m29j5",
        "author": "creepy_hunter",
        "title": "Sweetest offer you could ever see 😭😭",
        "url": "https://i.imgur.com/00lLdL4.jpg",
        "score": 646,
        "num_comments": 29,
        "created_utc": 1698927752.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17m29j5/sweetest_offer_you_could_ever_see/",
        "comments": [
            "[sad emoji]",
            "Sorry to see this, [Applicant's Name]. I'm sure you will find a much better [Position Name] job in the near future.",
            "Is this ChatGPT generated or what 💀",
            "[deleted]",
            "Hey GPT write fuck off professionally",
            "what a \\[slur\\]!",
            "Wow! I'm so grateful to be considered for the position of \\[Position Name\\] at \\[Your Company/Organization Name\\]. I am very passionate about the company's mission of \\[Company Mission\\] 🤪",
            "I got one of these after four rounds of interviews. Shit’s brutal.",
            "“careful consideration”",
            "I see no offer. Only a [insert adjective ] rejection. Btw, which company is this?",
            "I truly had heart ache reading this... one more time.",
            "task failed successfully",
            "They’ve stopped using “unfortunately” to get around any automatic filtering (including mental ones done by a human). Nice try!",
            "That’s why I don’t apply for jobs anymore because of that.",
            "Bro applied for Aperture laboratories",
            "Ironic",
            "Dear [Recruiter's Name],\n\n*whose\n\nSincerely,\n\n[Applicant's Name]",
            "It's a template. I've received a number of them from different employers.",
            "On the bright side, this shows that once you do get a position, you too can just GPT all those little emails you gotta send!",
            "They even didn’t give you any feedback about why the application was refused.\n\nSo it’s just another useless formality, the only utility is that it may be more comfortable to hear from.",
            "\"Dear applicant, eat shit and find someone else to bother\" is what I got from that",
            "ChatGPT Headass",
            "https://preview.redd.it/13xds7rwxdyb1.jpeg?width=1284&format=pjpg&auto=webp&s=d24491d6baec94d071d98fbb6cae116d3698daae\n\nDid you reply professionally as i did 😂?"
        ]
    },
    {
        "post_id": "1b8bg78",
        "author": "CaptainVickle",
        "title": "Just pushed my first changes as a LinkedIn intern!",
        "url": "https://www.reddit.com/r/csMajors/comments/1b8bg78/just_pushed_my_first_changes_as_a_linkedin_intern/",
        "score": 647,
        "num_comments": 30,
        "created_utc": 1709759668.0,
        "selftext": "This is such a big milestone for me as a Software Engineer Intern at LinkedIn. Never thought I would make it this far in life.\n\nUpdate: Got fired 😢",
        "permalink": "/r/csMajors/comments/1b8bg78/just_pushed_my_first_changes_as_a_linkedin_intern/",
        "comments": [
            "This has become a common way for me to know which sites are down",
            "linkedin is down, what a coincidence lol",
            "Does this subreddit not get bored of the same jokes",
            "As a (now former) Meta intern, just start packing your things now.",
            "Same old joke. But funny",
            "What a coincidence, I pushed my changes to prod at reddit.\n\nFeels good!",
            "Apply to meta next. They need people with your expertise.",
            "this made me giggle",
            "Congrats! Now the next thing is to make sure your change runs fine in prod and not breaking anything.",
            "Yawnnnn",
            "WWWW",
            "Is that why it stopped working?",
            "Linkedin servers got too hot and caught fire. Hence the outage",
            "Lmao",
            "Are you working as a Winter intern there?"
        ]
    },
    {
        "post_id": "16zhro8",
        "author": "HypocritesA",
        "title": "\"School name doesn't matter\"",
        "url": "https://www.reddit.com/r/csMajors/comments/16zhro8/school_name_doesnt_matter/",
        "score": 647,
        "num_comments": 214,
        "created_utc": 1696408515.0,
        "selftext": "Which clown came up with this bullshit? Go to any top tier company on linkedin and check which schools their employees came from. \n\nYes, school name matters. Stop lying to people.",
        "permalink": "/r/csMajors/comments/16zhro8/school_name_doesnt_matter/",
        "comments": [
            "School's reputation matters a LOT for your very first job (if you want good TC in a good company), after 2-3 years pretty much no-one cares (certain companies in Europe might care tho).",
            "Have you ever thought about the fact that people at top schools are more motivated on average and therefore actually look for opportunities?",
            "Having interviewed many hundreds of applicants for startup and FAANG roles, I can tell you that you're confused. I've never once, not has any other interviewer on any panel I've ever been on, looked at the school name. \n\nPeople from top schools do better for the same reasons they're at the top schools to begin with. We can have a lovely debate about whether that's fair or not, or due to aptitude or money or connections, but it's not the name. It's the aforementioned snowball effect. \nL",
            "Is this a survivorship bias though? Maybe students who attend those schools tend have better work ethic and drive so they put in the work to get into better companies? Maybe it matters for resume screening or connections but in any other way I don’t think so. Pretty much any no name school can have people who get into “top tier companies”.\n\nAs a personal experience, I go to like a top 80 ranked uni  and got interview at google. If I can get a shot anyone can, trust 🤣",
            "the question is more \"matters how\"? reputation, networking opportunities, education, research?\n\nfor education, no it doesn't matter much at all. but reputation and networking a lot",
            "People only say that on subs like a2c. Not csmajors. \n\nEven then school name doesn't matter that much a few years down the line imo.",
            "Never mattered for me. Nor anyone I know. Having a degree in general mattered. But never where from and I have worked at 3 of the big companies.",
            "Graduating 2024, 4 internships total, 2x FAANG, 1x Big Bank, 1x small startup company. Non traditional student who went to local cc then transferred to local university ranked ~100. School name has never been an issue for me.",
            "The reason why it matters is due to campus employment oppurtunities. Good companies go to hiring events at good school simple as that. That doesn’t mean there wont be any exceptions tho.",
            "HMM, well I went to a small state school in New Mexico. I've worked as  researcher at the very bleeding edge of quantum computing, worked as researcher in in computational perception, worked in autonomous sensing, now work as a principal engineer at a start up.Make lots of money, and done/worked on things most software engineers will never get to do.\n\nBesides that I also had a job for a few years where I was a software developer but also got to spend part of the year as a field seismologist. What that means is I got to travel to dozens of countries and every continent. Helped run experiments/been to mt erebus and the south pole.\n\nDidn't hinder me one bit. Literally no one gives a shit what school you went to after your first job.  \n\n\nAlso having hired many many juniors. Where the went to school wasn't even something I looked at.",
            "That’s true, but you know what matters more than the school name? Graduating debt free.",
            "Depends on your country too I guess. I've had people who strongly believe that stance and question my decisions for dropping out of a course that provided me with straight masters (b.eng cs, m.sc tech entrepreneurship), 1 year overseas to berkeley, sv & zhejiang, all on scholarship), for an approx t5 sch worldwide (still within that country). Others who strongly believed I made the right choice, not because of sch name, but because of the rigour for online assessments",
            "Feeding bad advice to reduce competition that's some high IQ game plan   \nIgnore the bad advices they don't want you to succeed school name is the difference between getting in to interview or even getting the role and people otherwise they were the exception and exception doesn't rule against the majority common",
            "I go to a T5 school and I don't think there's a huge advantage when it comes to big tech. But, I got so many opportunities (through clubs or profs) that I wouldn't have gotten if it wasn't for my school.",
            "I work at faang as a SWE after graduating from WVU with a 2.3 GPA. School does not matter. GPA does not matter.\n\nYou probably have a bad resume or are bad at interviewing if you think school is your limiting factor.",
            "Over the years, I interviewed hundreds of new grads into FAANG software engineering roles. Not once have I checked what university did they graduate from. In fact, we’re instructed to hire people strictly based on their skills, so I usually don’t open their CVs to avoid getting biased.",
            "Eh. I think it can give you a leg up, but I don’t think it matters *that* much. I went to CC for two years and recently transferred to a small no-name state school. I have 4 internships under my belt, and I’m actively interviewing for companies like TikTok and Nordstrom.\n\nIf you work hard, you work hard. :,)",
            "You know how many times I’ve looked at a resume and saw xyz school and put the student on a pedestal over another? 0. Do you know how many times I’ve discussed with my peers where they went to school, 0. \n\nWhat employers really care about for a new grad is, do they have some experience (probably the most important) and are they a nice person. \n\nThis industry is full of a lot of “I’m better than you” types because they went to xyz school or have been programming for x number of years. And those types are the people I personally filter out the second I see any indication of that mindset. Because at the end of the day learning to code a loop is the same whether you went to Harvard or some no name state school.\n\nSure there are places that value xyz university, but for most dev roles who cares.",
            "It matters as a new grad, but like the other guy said, it won’t matter farther down the line assuming you get experience overtime.",
            "People in 2021",
            "Are you trying to get into a quant firm which pays 400-500k as a new grad? If so, then yes, school name matters. But if you go to MIT or Stanford and you end up with a FAANG job, then does it really matter? You might have had an easier time landing a FAANG job but you spent a lot of time grinding to get into the school. And ultimately you ended up in the same place as other schools. So in that case, does school name matter? Not really.\n\nBasically, if you want to be at the top of the top and work in trading making 400k salary right out of college, yes, school name matters. Otherwise, no - especially considering after college it's going to be extremely hard to break into quant even if you went to a top school.",
            "It still doesn’t matter that much. Search up any mid school + computer science and you’ll get results for students who interned at or worked at a smattering of good companies right out of college",
            "I still have no idea why this sub comes up in my recs, but as someone who's been in the industry for 7 years now... your school means fuck all.",
            "School name matters but it’s not as nuanced as it seems at that time… either you go to one of the most well known schools or you dont. Paying more for a random private school is likely a waste of money if there is a good public program.\n\nThe best draw is having a well known company as a past employer period. if entry level (0-2 YOE)  a well known school name helps. After, you may be more defined by your experience.",
            "in the fintech/quant industry, there are many firms that give OAs (admittedly very hard ones) to everyone who applies. There are also many ways to not get screened by the other firms even if you go to a rly low ranked school. \n\nOne way is through competitions like company sponsored hackathons, datathons, etc. Another way is doing something cool in undergrad, like getting a research publication or building a cool project specific to the industry. Another way is through things like an icpc or putnam score, high enough codeforces rating, etc.\n\nAt an easier uni, putting the time in to get these things on ur resume should be possible. The only difficult thing is not having a group of tryhards around u pushing u to be a tryhard as well.",
            "If school names matter I wouldn’t be employed making a boat load and enjoyable work! I went to UC Riverside (aka UC Rejects lol) and it’s my job too",
            "School name matter to a degree, but anyone who says they can’t make it into the market because they didn’t go to a prestigious school is just looking for an excuse to not look inwards.",
            "I work for a software company and have had talks with the hiring managers about what they look for. Each new hiring manager and has said they don’t even care about GPA.",
            "As someone who went to a 90+% acceptance school, it's because these students aren't actively looking to get hired at FANG companies. They're perfectly contempt with local companies or working for the government. That doesn't mean they're not capable of working for top companies.",
            "we should all attend the most prestigious, most expensive schools to learn %98 of the same thing some p00r SOB is learning. damn p00rz",
            "relax buddy.",
            "victim mentality",
            "I’m an executive recruiter I can assure you that my clients don’t give a shit.",
            "Barely. My buddy did a coding boot camp and made $200+ on his first job. No college experience.",
            "School name matters yes! Just because of the bs reputation, nepotism and money they have been paying to your favorite school ranking websites to stay on top. You’re getting taught the same material at no name schools. Many colleagues and friends in my field (SWE) have been in F500 companies and the ones with the strongest skills are you guessed it no degree holders that are gifted from the start.",
            "I got a job after 2 months from graduation this year and I went to a public school. I’ve seen tons of people claim they went to a top school and still don’t have a job. Anecdotally, I am doing better then a top school graduate who didn’t get a job.",
            "Because it doesn’t…? They are less people from state schools in big companies bc state schools let EVERYBODY in, emphasis in EVERYBODY, hence the few good people, the ones who put in the effort, end in top tier companies 😐 There are literal alumni from my state school working at GOOGLE. Man, you are entitled and have a narrow mind…. People like you discourage great students in state schools with amazing potential.",
            "Honestly it doesn’t matter after like your first 1 or 2 jobs. I went to CMU.",
            "For getting your first job, school name is everything. I know incredibly talented engineers with multiple FAANGs at no-name schools who have to fight for a single interview, and I know engineers who coast by at top CS schools and get personally recruited solely based on their school name.\n\nFor any high school students reading this, or undergrad students contemplating a Master’s, grind your ass off and take loans to get into a top CS school. It is worth it and you will easily pay off the loan with the jobs available to you.",
            "It’s funny how people will say “oh it’s only for your first job”, that is just not true, going to Harvard doesn’t become any less impressive",
            "I would argue that school name and reputation is all that matters.  Second would be interview practice.",
            "Put it this way. Two people with the same experience and skills. One comes from Harvard, another comes from a no name school. In all situations, the kid from Harvard will be chosen. Schools do matter. Not going to a well known school automatically puts you at an disadvantage",
            "If pursuing a masters degree, school only makes a difference if it's too 10",
            "What school do you go to OP",
            "School name doesnt matter. If You are an owner.",
            "Yeah my school is like T200 but it’s a HSI so the pipeline into good companies is there, school name isn’t everything",
            "Well school name definitely matters but it's not end all be all, bt you would've have to put extra efforts 8n order to get the same opportunity that students from teir 1 school get.",
            "The name of the school, maybe. The connections, hiring pipelines, and cultural drive to get good internships and new grad positions of top schools is what really makes the difference.",
            "I agree. I go to a t5 and I feel like the environment in my school puts me in a place where I need to grind. But ultimately it just boils down to hard work",
            "I do see people from no name schools at top tech companies. For sure it's less though. In top tier non faang like linkedin I do see more non ivies. \n\nThe question is: are ivy league grads getting these positions because they went to a better school or because they are better candidates?\n\nOutside of the 8 ivy league and a few choice schools I doubt it makes a difference. I'm not in faang, but I know when I'm reading resumes I'm not looking up your school's ranking. If it's not in ivy league or like Carnegie Mellon, I'm not even going to know if the school is good or not.",
            "Oh it definitely does. Going to a Top 50 college matters a lot especially if you want to be able to relocate.",
            "I can tell OP didn't go to a good school because they ignore selection bias.",
            " Correlation is not causation",
            "Or those students tend to also be more motivated and definitely more motivated by “prestige”. I work at a faang and yes there are a lot of grads from top schools but there are also grads from schools I’ve never heard of before. It can matter if you use it right but it can also not. It matters less than you would think honestly",
            "The right perspective is this:\n\nOver the course of a 30+ year career, your lifetime earnings, highest ranking job title, and working environment are very weakly predicted by the school you attend.\n\nFor the first job (2-5 years, usually), your school gives you the network and the brand recognition to get more interviews. Notably, doing horribly in a top school won't get you interviews. I knew lots of CS undergrads at Duke who couldn't get interviews and bombed them, graduating with 0 offers.\n\nFor the next job, your first job gives you the skills and experience you will be leveraging to get your next offer. Companies want to see that you graduated from a school and took programming classes, but will take the best employee who can code well, regardless of school name. Technical interviews are actually a boon in this regard, since they can separate a lousy coder who attended MIT from a great coder who attended a school no one's heard of.\n\nAfter that, the fact that you graduated only kind of matters. A self-taught superstar programmer who makes it 6-10 years in the industry has skills that speak for themselves. I know many incredible, $150k + salary mid and senior devs who never set foot in a top tier school. Any competent programmer that has grown to mid or senior level is so dramatically more valuable than a new grad that educational history is more for a background check than anything else.\n\nNow, a student who is a mediocre programmer with middling grades and poor technical interview skills will get more shots at interviews than a good programmer from a school with less renown. But school name stops mattering very quickly.",
            "It matters but not in accordance to us news. I think Carnegie Mellon and Georgia tech mean more than a place like WashU where I did my undergrad",
            "It *might* help you get into a pipeline to get your first internships and jobs.  However, what people don't know is that companies have pipelines into all sorts of colleges and not just the top ones. They like the diversity, and have found great talent everywhere.  It *might* provide a richer experience with more clubs, undergrad research etc.  That assumes you take full advantage of them.  And if you graduated from one of the very top schools *and also are a rock star*, some people might give you some added cred along the way.  In some silly ways it might still be used, \"this is Tom our VP of Engineering, I think he went to MIT as well...\"  Oh, bias for PhD programs is still a thing so if you are thinking about that path prestige is still important.        \n\nBeyond that and 1-2 jobs, **any added benefit all goes away so that is also true too**.  \n\nEveryone has their own story to tell on why it does or doesn't matter which are anecdotal.   \n\nRankings are argued about, but maybe no more so than Forbes' most recent one.  Still worth looking at since they tried to cover this question with a larger datasets.  And yes, on average, graduating from certain CS schools pay out more.  So if you trust their data sources, then the answer from a statistical standpoint would be, yes it does matter.  In some cases, a lot.      \n\nThe problem with this is that no one is the \"average\".  If you suck at a great school, you still suck.  If you rock at a great school, you rock.  If you rock a*t a less than great school*, you also rock.",
            "There was a study that showed that people who got accepted to Harvard and didn't go had the same incomes etc as people who did go. \n\nPeople in CS subs are something else, constantly consumed by self-pity and a masochistic need to think that everything wrong with your life is out of your control. You can keep convincing yourself that there's no point in trying because of this random reason, but even if you had been accepted into Harvard or Stanford, you would have found yet another reason why you shouldn't try hard because it's all stacked against you anyway.",
            "Opinions on UTRGV?",
            "School name matters a little.\n\nThe only thing top schools are good for are the connections you make while there.",
            "Smartness is correlated with top school and top companies, but not a causation. I sucked at Reading and got fked in SAT, but I work at relatively top company. On other hand, you can get into top school with $, legacy, bulls\\*\\*\\*ing on essays, leadership crap, sports etc. but none of those work when a leetcode hard is thrown at your face.",
            "I mean so much research shows the biggest predictor of success is where you place in your class not what school you went to. I would wager if you went to a ivy and drowned vs went to a stay school and excelled you'll likely be better out of state.\n\nThere is also a survivorship bias. There are lots of CS students that switch degrees in a ivy out of STEM who may have graduated with STEM if they were in a state school.\n\nAt the end of the day its important for internships and entry level and if you plan on your school being the best thing on your resume🤷‍♂️\n\nEdit: classic gladwell talk on this https://youtu.be/7J-wCHDJYmo?si=bebhAGgPlOuV1CrP",
            ">Go to any top tier company on linkedin and check which schools their employees came from\n\nreally massive bias here.\n\nthe most motivated students usually end up at top schools and later top firms. is it the school or the student? if you think it's the school, then check out the median compensation out of college for nearly all their majors-- it's garbage.\n\ncoming from a top school definitely helps, no doubt about that. i went to a community college and interned at faang + a trading firm. the reason why you don't see students from these schools is because nearly everyone at a community college/noname school isn't very motivated and pretty stupid. just like you.",
            "Not always. Two of my friends graduated from no name small state college and got hired by Google as entry level out of college and another one is in Facebook right now.",
            "For the first job yes, for internships yes. After 1-3 years of pro work experience. You could have gone to community college in Kansas. That being said if you went to a prestigious school and the hiring manager/ other senior devs went there maybe there’s a slight push in your favor. Or some firms are only known to hire from tops 20s. But for you average person it doesn’t matter too much",
            "Sounds like survivor bias. I am trying to not being harsh like a dick here but honestly with this mindset you can’t go anywhere.",
            "From my personal experience, it depends. I think in the US and Canada first school might not matter for really large companies as a swe since they have to filter out 99% of the applicants based on very arbritary and set rules. It will give you an advantage in some companies that pay well on your first job. Barely anyone asks about your degree after your first year of working and no one has asked me about my degree and I only have about 3 and a half years of experience.",
            "I don't go to a target (T50) but got interviews at basically all the most prestigious tech companies and a few Quant companies like JS and Cit. \n\nDoesn't matter after 1 good internship.",
            "Well highly motivated and intelligent people are more likely to go to top schools. But how can you be sure they are hired because of the fact they went to a top school or that they were simply hired because of fact that they were hard working and intelligent?",
            "Massive copium + survivorship bias",
            "Spoken like someone whose never had a real job before",
            "Unless you go to Waterloo, the school name hardly matters. I know folks from UC Berkeley that are still unemployed months after graduation and folks that got FAANG offers from Cal State East Bay. It’s on the individual on how many side projects they grind and how much they practice Leetcode. This isn’t like Law or Business careers",
            "UK peeps how is Anglia Ruskin University? Doing my L5 Diploma through SAM Caribbean LTD and after that I’ll do my Bsc and Masters through them. I’m asking because I’m not in the UK yet so I wouldn’t know.",
            "lol dumbfuck people going to top tier schools will just be grinding more than everyone else. Name matters to a degree but only for your first job after that nobody gives a fuck",
            "Idk man mine hasn't helped me at all",
            "Me when I tell OP that correlation does not equal causation (he did not pay attention in intro to stats): 🤯🤯🤯",
            "Wrong. They dont care about cs degrees. Only portfolio. Its a waste of time otherwise",
            "The people who say school reputation doesn't matter go to shitty schools hahah",
            "*sponsored by [top tier school]",
            "Funny.\n\nWhen so many low quality, cheap foreign workers on H-1B from india, from questionable schools, rejecting American candidates from Top 25 US CS schools, you still believe school name matters?\n\nDon’t kid yourself."
        ]
    }
]