[
    {
        "post_id": "1cjw0hy",
        "author": "dd0sed",
        "title": "At this point, the only logical thing to do is accept 2 offers and then renege 1 in May",
        "url": "https://www.reddit.com/r/csMajors/comments/1cjw0hy/at_this_point_the_only_logical_thing_to_do_is/",
        "score": 643,
        "num_comments": 64,
        "created_utc": 1714813315.0,
        "selftext": "After all this Tesla shit, there really is no reason for anybody to only accept 1 offer when companies will pull shit like this. If I ever get an offer from Tesla, you bet I'm accepting another one alongside it. Bitch ass company/CEO.",
        "permalink": "/r/csMajors/comments/1cjw0hy/at_this_point_the_only_logical_thing_to_do_is/",
        "comments": [
            "I always did this. I even cancelled an accepted offer just 2 days before my first day, after I already went trough the full background check process. Once I quit after just 2 months into probation. \n\nAlways do what's best for your career. Companies also do what's best for themselves.",
            "The problem is getting 2 offers",
            "Agreed. I know someone who moved for a job and nearly wound up homeless with his family because they waited until he moved to reneg on their formal offer.",
            "Tesla is special. Most companies are purely selfish, Tesla is one of the few that is openly pathological",
            "Not a problem if I don’t have an offer :)))",
            "This should always have been done even in a good market. Something something single point of failure",
            "I had 4 offers on hand. Declined them because I was assured that my offer would not get rescinded as I was a return intern at tesla and interns are a worst-case scenario. I regret not doing that shit so much rn bruh",
            "this is what i did the past 2 years. the thought of my only offer rescinding before the start scared me so much man",
            "Lol OP thinks he'll get 2 offers",
            "This is what I did with my full time offers. Accepted two offers, dropped the one I didn’t want two weeks before the start date, don’t regret it",
            "wait you guys are getting offers?? fuck",
            "I think that's the right move, but it's worth considering that in a kinda saturated market you're taking away a position from someone else by doing that if neither company pulls the offer",
            "Calm down bro. Relax it's just an internship. More will come \n\nThat's why we should never commit to companies no matter how big.\n\nLots of people live their whole Life just to working in faang.",
            "If Tesla is doing this its so bad. But why be an ass to another company that might be better?",
            "I can't even get a internship so take this with a grain of salt. You shouldn't stoop to the levels of companies that do this. This just creates a situation where companies will be more hardcore on new interns and just screws with people on a waitlist. To be frank we all know how Elon acts (especially him bragging about downsizing Twitter) and there was always a risk that his companies would do the same."
        ]
    },
    {
        "post_id": "usseds",
        "author": "amzn-throwaway-cs",
        "title": "There’s no way some people still blame ‘diversity hiring’ for their lack of a job/internship",
        "url": "https://www.reddit.com/r/csMajors/comments/usseds/theres_no_way_some_people_still_blame_diversity/",
        "score": 646,
        "num_comments": 285,
        "created_utc": 1652924846.0,
        "selftext": "Just started my internship and I’m the only girl on a team of 30 people; I’m the only girl on my whole floor. I really expected things to be different at a large tech company, especially at their headquarters, but I guess not. It’s really disheartening looking around a room and seeing no one else like you.\n\nBut the small percentage of people in this sub and in this field in general that say they can’t get jobs because of diversity hiring or that minorities have it so much easier??? That’s so clearly untrue when there’s one of me and 29 of you. If it was really that easy to get hired to such a high paying job wouldn’t everyone do it? I’m also really struggling to understand how the diversity initiatives that so many companies have are failing so miserably.\n\nEdit: I’m not necessarily saying that there should be an even split of men and women in the field; I also understand why there isn’t an even split. I’m saying that it’s absurd that some white / Asian men and those overrepresented in the field act like the only reason they aren’t getting jobs is because they’re being discriminated against (because they think companies always favor minorities over them); if this were true, workplaces would be a lot more diverse than they are.",
        "permalink": "/r/csMajors/comments/usseds/theres_no_way_some_people_still_blame_diversity/",
        "comments": [
            "I taught a coding class recently and 1/3 of the class were women but 1/3 of coders certainly aren’t women.",
            "[deleted]",
            "This sentiment is common in finance too.\n\nSome rich kid immediately gets a position out of undergrad saying \"meritocracy\". The meritocracy isn't real, Uncle VP Rob got him his job but everyone is convinced that the real reason they didn't get it is because the company they want to work at hired their 2nd brown woman in 8 years. \n\nIt is not based on the color of your skin or the contents of your character, its based on who you know.",
            "I was the only female intern at my last internship (out of 15 interns) and I'm gonna be the only female on my team (granted my team is only 5 people) for my upcoming internship. However at my first internship we had 3 or 4  female devs, and they were really good at what they did. As in a lot of people spoke highly of their work and they were high contributes. I think seeing them do well gave me a boost of confidence and put me at ease. This was out of 40-60 people I would say developers so the percent was small. I think people that claim diversity hiring is the reason they can't get a job are just looking for an excuse. No one wants to admit that they lack qualifications or are a poor interviewer. Although on the flip side I do think more women are entering the field.",
            "the diversity initiatives are pretty sht for internships, its mostly hbcus getting them. for the rest of us its not that easy I had to send 500+ apps and I did the neetcode 150 to acquire my internship",
            "It’s just guys being salty they can’t hack it and looking for excuses\n\n_Why haven’t I got a job or internship? Is it because I need to improve my CV or my interviewing technique? Nah, it’s those damn diversity hires!_",
            "Yeah ppl be complaining meanwhile I'm over here scrubbing my ethnic sounding last name from my resume and deploying a duplicated portfolio site to AWS with that updated name.",
            "My company is not large by any means, but in the entire engineering/tech building I am the only girl. Plus I'm an intern, not even a full time employee. They have 0 full-time women in engineering, just a single intern. I agree with everything you said.",
            "Honestly i'm baffled by how cancerous the diversity assumption has gotten, esp. around young dumb guys going through their cynical phase.",
            "Some of you people are stupid, have you looked at the statistics yourself? More than 3.3% of CS students are girls...",
            "I can't believe how many people here are doubting whether any discrimination is happening or claiming that the discrimination is happening to cis men.",
            "I was the only minority in a room of 70 people. I complained because it felt extremely weird and unsettling. Suddenly we got 4 more.",
            "Absolutely true. Also note that male majority in this industry is not established because companies prefer(ed) men.",
            "I think it’s easier to get an interview as a girl. Passing interviews is the same regardless of gender, and the actual job is probably easier if you’re a dude (because it’s easier to fit in.) \n\nThat said, my experience at google was that there were a good number of women. Probably 25-30% of people I interacted with, which also matches the percentage of CS majors that are girls ime. A lot of the more senior people (my teams tech lead, a tech lead on an adjacent team, and the director of several related teams) were also women. Your 1 in 30 is a bit of an anomaly.",
            "Yeah I'm like the only woman in my class lol will probably be like that when I start my internship soon",
            "Companies are also starting to result in better performance on a more diverse workforce, really interested to see how more and more companies will start to adopt future changes.",
            "[deleted]",
            "There should be only skill based hiring lmao",
            "My startup has a super small dev team with half of it female. Everybody was super driven by the mission but pay was kinda bad.",
            "The treatment of minorities in interviews and in the field is very very very bad. It has gotten worse with all the hate of soulless morons like jptrsn, faux, etc. Doing this for decades and the bigotry and hate so many ignorant green entitled clowns have is absolutely assnine and deserving of furious anger.\n\nAny engineer reasoning over women should be immediately written up. Ego clowns have no clue how vile their behavior even is.",
            "You all need to pull yourself up by the bootstraps and ask your dad to call around to get you a job. SMH my generation is full of lazy kids nowadays",
            "guess you haven’t taken your stats course req yet",
            "You’re going to get nastiness and jealousy if you’re well at something. Smile at the haters and enjoy your success - they hate that!",
            "Racists gonna race.",
            "We hire based on skill alone. We just don't get that many female developers apply to positions in the US. Now,  our offshore teams are probably 25% female. The female devs I have hired are all awesome. It makes me wonder if the average and below average female devs self select out.\n\nHowever hard we try and hire female developers in the US we are constrained by the applicant pool.",
            "I know you're right that a lot of folks inflate the impact of diversity hiring. That being said, theres a word for you're trying to say. It's called anecdotal evidence.",
            "Diversity hiring doesn’t exist. Big tech has no hiring quotas, they hire everyone who is qualified. There is no possibility a white man who passes all Amazon tech interviews doesn’t get the job. \n\n\nThe reason there are almost no women/non-Asian POC in big tech is because of they way they do interviews. Generally they do an OA and phone screen round. People who get past this OA in 70-80% of cases are from T25 CS programs, and T25 CS programs are almost entirely comprised of White and Asian men. T25 CS programs are almost entirely white/Asian men because women are encouraged from birth to not pursue stem, and other minorities have been redlined into shitty school districts by racist housing policy. Asians avoided this to large extent because the Asians who immigrated to the US in almost all cases came from elite, highly educated backgrounds within their own countries.\n\nSo basically yes, there are reasons other than “men are smarter 🤪🤪🤪” for why big tech is comprised entirely of men from 2 demographics.",
            "We can't judge if your statement is accurate in the slightest without knowing what was the ratio of male to female applicants. It is quite possible it was under 3%",
            "It depends on the job really, my office I was the only guy on my team full of different women. Some jobs attract different genders more.  Tech generally is a guy thing I dont even personally know any women intrested in it. Lets say you got a job at a clothing store, it would be mostly if not all women.",
            "[deleted]",
            "I agree. I think the case majority of companies still hire more guys the girls (which I believe is mostly related to man/women ratio at CS degrees). If some guy has a problem getting a job and claims it's due to diversity hiring, they are most likely using it as a lazy excuse. I guess there's always a small chance they desperately want to work only for that one particular company, where such issue actually exists, but this isn't the norm.",
            "Engineering and science are overwhelmingly men and things like nursing are overwhelmingly women. Just let people pick what they like ffs who cares about diversity.",
            "\"and seeing no one else like you.\"\n\nGender isn't the only think \"like you\". It's the most superficial and easy to spot characteristic.",
            "We do not have a 1:1 ratio in terms of men and women in the population. We don't have that perfect split in CS programs. This number has steadily increased over the last 20 years and has resulted in a natural increase in the number of women in the workplace. So how is it possible to achieve that 1:1 ratio in the workplace without discriminating against men? The number of men who are interested in pursuing cs is far greater than the number of women who feel the same. The workplace will not be balanced until we encourage more women to study cs. There are so many international students in this country who fight tooth and nail to immigrate to this country, study and get a job against all odds. Do you see them complaining? If you are not from the US, do you think it is easy to fit in anywhere? The cultural and individual differences in a workplace is a fascinating thing. You don't need 10 slightly different versions of you in the workplace to get along with people and make friends.",
            "Personally, I dislike \"diversity hiring\", for several reasons:\n\n* I believe in raw merit, period. If I fail, I don't blame it on \"diversity hiring\"; I blame myself and use this failure to improve.\n* These programs don't even do the basics properly. For instance, I once looked at a \"diversity scholarship\". The eligibility criteria was so vague - they wanted \"members of underrepresented groups in technology\". What does that even mean? People with disabilities? People of colour? Someone from Mongolia (or a place underrepresented in tech)? Like I actually think some are self-opting out of these things because they wouldn't know if they were eligible.\n* I think they are missing the point. It's not colour that counts. From the ones I've seen, a poor white boy would not be eligible for the majority of these programs (at least in the UK), while a rich, well supported black girl would be. Who needs the support?\n* University admissions (again for the UK) handle this better, as instead of using things like race and stuff, they normally use criteria such as POLAR quintiles (how poor where you live in comparison to the country) and how well your school performed in GCSEs to decide who should be eligible. Is that perfect? No. But I think it handles the situation I gave above better.\n* The presence of these things gets us these arguments - on one side the ones not eligible complains about \"diversity hiring\" - while on the other side, the ones who deserve to get the role being accused of being a \"diversity hire\". It's not good either way.",
            "Personally I think there should only be skill-based hiring. However, more than half of the interns are female at the place I'm interning at. Tbh I didn't even notice until I saw this post, but all of them are more than capable at their positions.",
            "OP the number of people from each background isn't relavent, what is relevant is that companies objectively make it easier for URMs to get hired. If you are debating that you are delusional or a liar. \n\nhttps://imgur.com/a/B3qndjk",
            "[deleted]",
            "The reason it’s mostly men in tech is very simple and has nothing to do with hiring quotas: women are not going into this field nearly as much as men. Check the data on it if you don’t believe me.",
            "i don’t understand this diversity hiring at all. before you start spam downvoting me because of difference of opinion, id love to understand. if less women choose this field or even engineering in general because they enjoy it less and some other reasons, why are they getting put on a pedastool? since they are way more women teachers than men and more women nurses than men, why dont we have diversity hiring in those areas for men as well?",
            "People actually diverse hire in here? Guess I’ll be fine.",
            "I need karma lol",
            "I do not think it is about employees not hiring women but women not interested in tech I guess, which is sad cause women bring a different perspective to solving problems and design that men do not. In my final year Digital Logic class, there were 3 women out of 250 classmates. At graduation the % of women totaled only 2% of the entire graduating class of 2022. That means out of ~4000 students who graduated only ~80 of them were women and ~3900 were men. One thing I noticed about my female colleagues at the digital logics class was that even though there were just 3 of them, they outperformed almost the entire class, am not saying they were better than everyone solving problems but they got better marks than the rest. When it came to projects and brainstorming ideas, boys came up with the solution way faster(maybe it was a numbers game, more boys = higher chance of getting better ideas) but when it came to putting in the work to study for tests, women were more consistent. There were also classes in my undergrad where there were no girls at all 100- 250 students all were boys",
            "I lost an internship to my friend. She is a minority female. My gpa is 1.2 higher. I am better at literally everything. Tell me how she got the job and not me? I am definitely not ugly, I perform great in interviews, I have a great resume. I ended up getting an internship for 20 more an hour at fortune 500 company but it very much is a real.",
            "I'm on a 33 person team and 7 are men. Maybe you shouldn't use one experience to judge every situation... Especially when you're an intern who's not gotten around much.",
            "“It’s so disheartening seeing no else is like you” - what do you even mean by this? How the hell does gender even matter when it comes to being able to do your job? And what’s wrong if all the other people who got hired are males?\n\nIt’s almost as if you are saying employers should not hire any males because they are male. This is an extremely low-key misandrist post."
        ]
    },
    {
        "post_id": "tqgpwn",
        "author": "frootbeer",
        "title": "If this 27yo single mom can do it…",
        "url": "https://www.reddit.com/r/csMajors/comments/tqgpwn/if_this_27yo_single_mom_can_do_it/",
        "score": 644,
        "num_comments": 30,
        "created_utc": 1648494356.0,
        "selftext": "…so can you. \n\nToday I finished my first full stack feature for a fintech internship. I did it! It took me a really long time, but I learned so much.\n\nYou’re not too old or desperate for pursuing a cs career or going back to school. I didn’t even know I wanted to pursue this until a couple years ago when I realized I just can’t become a lifelong server hating my life. \n\nI dropped out of high school, had a child at 19 with someone who’s turned out to be an addict, and it took me 9 years to complete my AA that I started as a junior in high school. I have felt like a failure so many times, but I’ve never let that be the final story I tell myself.\n\nGet out there and learn from anyone you can, especially those that give advice for a living - advisors, career counselors, etc. \n\nApply for internships. Work on your resume with someone in the field. And don’t stress about having a ton of projects under your belt - I literally don’t have time to have a “side hustle.” Use school projects and learn how to talk your way through them.\n\nI’ll probably feel like an impostor again soon when the next challenge arises, but every step I make towards my goals I’m learning to stop and relish in it and add it to my memory that I’m doing just fine. \n\nIt’s going to be ok! Go for it!",
        "permalink": "/r/csMajors/comments/tqgpwn/if_this_27yo_single_mom_can_do_it/",
        "comments": [
            "Nice, keep it up, you got it! Attitude is most important :)",
            "Wow. Same life. 27 single mom. Ex was an abusive addict. Also dropped out at 17. Finishing my AA and starting my BS in CS next semester. Thanks for this",
            "Not to discredit traditional students, but man is it impressive to see people going back after experiencing major life events! Very impressed, that kind of motivation will take you a long ways. Congrats!",
            "Congrats! It sounds like you have come a long way. I'm 26 years old and my last job was at a call center, I've never really had a \"professional\" job in my life even though I have an associates in accounting. I needed to read this today, because while I try not to doubt myself, its really hard to see myself in a professional position making \"real\" money (anything over $20,000 annually). I'm taking my first class towards my computer science degree this semester and I'm very excited to begin this journey. To success, my friend!",
            "Proud of you!",
            "Yo! Great job! I just turned 30 and graduated from a coding boot camp in 2020 and am just now finishing my freshman year of college for my associates in CS. Working part time as a software developer at a small music store in my hometown and looking for internships over the summer. I low key feel like a failure at my age, but I know that’s just comparison trying to rip me off. Lol I know this will pay off in the future. Thank you for sharing it is inspiring!",
            "That’s soooo inspiring, op! Thank you for sharing ! And so happy for u :)",
            "Respect 🙏",
            "**I'm so proud of you**.\n\nI know first hand how hard it is to do this. I got pregnant at 18, had a child at 19, and in that same year went to college. I am 24 now and graduating this May. Countless times I've stayed up until the sunrise doing homework because night time was my only free time. I've been eternally exhausted. I was falling asleep during my Calculus II final. I cannot stress how hard it was to not give up at times. My twin sister has passed away, my partner suffers from epilepsy, my father died, and I have worked the entire time. It's a hustle and the system assumes you're a young kid with all the free time and lack of responsibility in the world -- but for so, *so* many of us, that is not the case. I got an internship at State Farm last summer and just accepted a job offer. \n\nI love seeing this. You got this, mama. Thank you for sharing.",
            "Thank you for your post. 30 year old divorced mom of two here and slowly making my way through the major. Someday I’ll get that internship and degree.",
            "Inspiring.. when did you start studying/working on getting to where you are?",
            "amazing !!",
            "I can relate to being a re-entry student parent. Thank you for sharing, it's motivating.",
            "as my favourite professor used to tell us, \"You go girl\"",
            "Saving this for later because I feel like an imposter all the time. Thank you! I’m so proud of you. You make me feel empowered",
            "Thank you! As freshmen who is going to be 23 soon. I needed this. Thank you.",
            "How much does it cost for the feature?",
            "Love you mom!",
            "Congrats! Great to hear!",
            "Thanks for the motivation! I’m proud of you 💕",
            "Such an inspiration",
            "Thank you so much for sharing this! Your story is super inspring!",
            "WOW! This is incredibly inspiring!!",
            "I love this. Thank you for your inspiring story, it will be a source of inspiration for us all."
        ]
    },
    {
        "post_id": "yvbbgh",
        "author": "Glittering_Plan3610",
        "title": "I GOT AN OFFER",
        "url": "https://www.reddit.com/r/csMajors/comments/yvbbgh/i_got_an_offer/",
        "score": 642,
        "num_comments": 50,
        "created_utc": 1668457091.0,
        "selftext": "I GOT AN OFFER IM SHAKING AND CRYING RIGHT NOW.\n\nINTERNATIONAL SOPHOMORE FIRST INTERNSHIP +125 APPS",
        "permalink": "/r/csMajors/comments/yvbbgh/i_got_an_offer/",
        "comments": [
            "YAYAYAYAYYYYYY!!! Congrats, dude! You so deserve this. I'm so proud. Sending you lots of positive energy :)",
            "Well done from a fellow F1! I will be making the same post sooner or later!",
            "Only 125 apps? International? Duolingo? No prior experience? Plus sophomore? You are definitely cracked buddy. Congratulations!",
            "WAY TO GO MAN!!!! POP OFF 🥳🥳🥳",
            "Congratulations!! Make sure to celebrate your huge achievement :) international sophomore in THIS cycle?? You're cracked!",
            "W",
            "Congrats! I’m a U.S. junior and applied 293 times , 3 interviews so can’t imagine how cracked you are",
            "125 apps damn",
            "Congrats!!!",
            "congrats!",
            "Congrats! First one is always the hardest!",
            "YESSSSIRRRRRRR",
            "Congrats! Hard work pays off",
            "YES SIR",
            "Congrats!!! :D",
            "Congratulations! Pouring one out for you!",
            "BIG DUB",
            "wow! congratulations!!",
            "W",
            "W congrats, now fuck offf XD haha jk",
            "fucking A man!",
            "let's gooooo",
            "SO HAPPY FOR YOU!!",
            "LET'S GO!!! I'M SO PROUD OF YOU MAN :D",
            "Congrats!!!!! I hope you love it and learn a ton!!",
            "Congratulations! Where is it",
            "Congrats it only gets better from here!",
            "Huge congratulations! Hope to share in some of your amazing luck! 😍🎉🙏🍀💪",
            "Congrats, its a lot of hard work",
            "Congratulations. Always negotiate. Even if you only squeeze em for a couple more bucks, it's a couple more than what you had.",
            "My man",
            "JEEEEZZZZZ NICELY DONEEE",
            "Let’s gedditiittttit",
            "Thats absolutely AMAZING! congrats my man! Im at about 150 applications and 0 callbacks so send some of that luck my way as well ;)\n\nYou're among the few people giving us hope this season. We're proud of you!",
            "slayyyy",
            "Congrats & way to go!",
            "Congrats!!",
            "CONGRATULATIONS AND WELL DONE. WELL DESERVED. GOOD LUCK. WAGMI.",
            "Plot twist - its for a housekeeping position at motel 6.",
            "Congrats dude!!!"
        ]
    },
    {
        "post_id": "xjbwq4",
        "author": "iHammmy",
        "title": "Optiver: $137.50/hour Internship, $10k sign bonus",
        "url": "https://www.reddit.com/r/csMajors/comments/xjbwq4/optiver_13750hour_internship_10k_sign_bonus/",
        "score": 638,
        "num_comments": 150,
        "created_utc": 1663687857.0,
        "selftext": "https://www.levels.fyi/internships/\n\n\nThis is fucking insane. Imagine earning $83k in 3 months as a 20 year old",
        "permalink": "/r/csMajors/comments/xjbwq4/optiver_13750hour_internship_10k_sign_bonus/",
        "comments": [
            "They are top 1% of 1%",
            "It’s a 10-week internship and the $137.50/hour includes the signing bonus. But yeah that’s a lot of money.",
            "Stuff like this skews my opinion so bad lmao... like in my area of the US $25/hr for internships is seen as a super high value lol and then I see this!!",
            "Imagine making 1k a day… as an intern",
            "Prereqs: 99th+ percentile skills and accolades in cs+math",
            "[deleted]",
            "If you have the skills to be successful in this role you were never going to worry about money anyways",
            "I applied to this a couple weeks ago and they said my resume was impressive, but they were looking for people graduating in 2023. 😭 They said they'll keep my resume on file  \n\n\nDid anyone else get this response? I'm worried it's just them being polite.",
            "But then again getting into optiver is hard af isn't it?",
            "This is both exciting but stressful cause I have an Optiver final round coming up and if I actually get the offer that would be insane.",
            "No there's nothing insane about it when you consider how much revenue software engineers make for their company and how few people actually want to do/ are competent at their job at those levels.",
            "[deleted]",
            "Worked in the industry last summer and will be working for a competitor after graduation. To explain some of the crazy numbers, often intern salaries at prop shops are just prorated base salaries for new hires (sometimes experienced people have the same base too). So you end up with\n\n150k base -> 12.5k/month for interns (DRW/IMC/2S/... last summer)\n\n175k base -> ~14.5k/month for interns (Citadel/Akuna/Desco/... last summer)\n\n200k base -> ~16.6k/month for interns (JS/HRT last summer)\n\n250k base -> ~20.8k/month for interns (this is Citadel's latest offer)\n\nAnd then sometimes there is a signing/perf bonus to further entice interns.",
            "I did the behavioral for Optiver and thought I killed it. Hurts to see this post after getting rejected…",
            "quant firms are on crack interview and salary wise",
            "Sounds about right.",
            "Holy shit",
            "They all compete with each other. The rest of the firms are gonna offer similar rates. I remember last HRT added a 10k signing bonus, Jane Street did the same and called interns who accepted to tell them about the bonus.\n\n&#x200B;\n\nEdit: Just checked Jane Street they upped intern pay from about 98 to 124.",
            "These firms hire so few people relative to the applicant pool. It’s almost pointless.",
            "There’s prolly like 10 positions available lol",
            "In just 2 weeks they’re making more than what most interns make all summer. Shit even after a week.\n\n\nDoes anyone know what the interview process is like? The bar is obviously high but how high can it get lmao.",
            "What in the hell could they possibly be looking for in an intern to offer that kind of pay?!? .... wow.",
            "No thanks - never again would I interview with Optiver. I was chased by their recruiters for an entire year before I finally said okay and took the stupid hacker rank test after being told it would solely be used to determine how I think and to shape further discussion. What I ended up getting was a mail that explained I scored too low for a human to even look at my free form section at all, thus they wouldn't be moving forward. Let's look at the FOUR questions on the entire exam that was used to make that determination... Expected right answers have a \\* next to them and my answers are in parentheses. I'm happy to share the entire PDF they sent me as my \"assessment\" along with a forwarded copy of the mail that they explained those four questions resulted in them not assigning a human to review the rest.\n\n&#x200B;\n\n  \nQuestion 1: Multi-Threading...  \nAlways makes a program run fasterMakes a program easier to debug  \n(\\* Can help to take advantage of multi-CPU architecture)  \n\\*Can help to make a GUI more responsive  \nExplanation: I failed this question because I didn't choose \"Can help to make a GUI more responsive.\" Firstly, I'm not a GUI developer - at all. Secondly, go tell a Python developer that using threads will enhance the performance of his PyQt GUI... Third, this is so specific to implementation and most GUI's will not have any advantage from introducing threading.  \n\n\n&#x200B;\n\n  \nQuestion 2: You have a single-threaded algorithm running on an Intel Core i7 3.10Ghz / 4.10 GHz (turbo), 4 cores/8 threads. What would help optimize the speed of this algorithm?  \n\\*Switch off as many cores as possible  \n(\\*Switch off hyper threading)  \nSwitch off CPU core isolation  \n(\\*Switch off power saving)  \nExplanation: This was marked as wrong because I didn't select \"switch off as many cores as possible,\" which is purely an implementation-specific answer. . I manage a build that has literally 40+ scripts which launch in a single go every one hour on the dot that maintain various aspects of the OS and configuration management in a highly regulated environment. Flat out disabling all other cores in on the box other than the ones specific applications are using would result in those administrative tasks potentially landing on the core that latency critical apps are on and taking time away from them on the scheduler. Sure, we can use CPU isolation, nohz\\_full and task pinning - that's a given. But then the question of what cores those non-application-specific threads are going to run on arises. However, you’ll notice my statement here is absolutely use-case-specific, as was the expected answers. I won't even get started on how memory interleave being enabled or disabled (NUMA for the simpletons who made the test) would potentially change the field here as well.  \n\n\n&#x200B;\n\n  \nQuestion 4: You want to copy a complete home directory from one Linux machine to another. What commands could you use to do so? Note there are no mounts from one machine to another.  \nxcopy  \ncp  \n\\*rsync  \n(\\*scp)  \nExplanation: I got this marked as wrong because I chose only scp and not rsync. There's a reason for that, though. While not every box (including my own) will have rsync on them - show me a host that has OpenSSH but no scp...\n\n&#x200B;\n\n  \nQuestion 5: UDP Datagrams...There are two computers both connected to the same Ethernet switch, one is sending UDP datagrams with an incrementing sequence number and the other is receiving them. The receiving application's logs show not all datagrams are being received (but most are). What are possible causes?  \n(The Ethernet switch is delivering packets in a different order)  \n(\\*The sending application is trying to send at a rate higher than the network can handle)  \n(\\*The receive application is taking too much time processing datagrams)  \nThe operating system versions on the two computers are incompatible  \nExplanation: This was marked wrong because I chose \"The ethernet switch is delivering packets in a different order,\" aka out of order packets. While the question details that \"one is sending UDP datagrams with an incrementing sequence number\" - UDP does not have sequence numbers, retransmissions or any other verifications implemented at a protocol level. This is entirely up to the application to implement these specifics. If sequencing is implemented, what the application does with it and how it uses that sequencing is entirely implementation-specific. And I have personally tracked down and identified problems with data gaps in applications because despite having implemented sequencing at the application layer, a developer chose to discard entire transmissions if the sequencing was determined to be out of order. Don't even get me started on the crazy things I've seen developers do with where and how they decided to implement their own timestamps on multicast messages.\n\n&#x200B;\n\n  \nSo, the above is what resulted in me receiving a response indicating that they would not proceed further with discussions with me nor would anyone review the part of that ridiculous pre-screening \"test\" that took the absolute most time-investment, the free-form sections. I took the time to spend hours away from my family time to complete this garbage on the understanding that it would be used as a discussion point \"to understand how \\[I\\] think\" - and instead, I got handed a numerical score showing that I only scored 33 of 165 possible points and thus I'm too technically inept to have anyone speak to me. And then I'm also told good luck in my search... A search I wasn't embarking on.\n\n&#x200B;\n\n  \nThis gives me the impression that their hiring managers have far more important things to do than their job of identifying talent, and have instead chosen to offload that responsibility to algorithmic candidate selection. I wouldn't be surprised if they eventually just start having people interview with ChatGPT.\n\n&#x200B;\n\n  \nThank you, Optiver, for wasting both of our time - multiple times. It won't happen again.",
            "This is insane ✨✨✨",
            "Wtf they doubled their intern pay from a couple years ago",
            "[removed]",
            "People doing internships earning more than my hourly rate, damn that hurta bro",
            "still not close to what Alexandr wang was making at 20",
            "It's also doing the devil's work in a probably very unbalanced environment. They pay you to shut up and work 80 hours a week in making financial markets more unequal and make billionaires richer. But yeah, kind of a good deal.",
            "Damn, and I’m not even making 1/3 of that, as a full time swe 🥲",
            "I love that Reddit believes anything on a web site that confirms their bias.\n\nI just added a salary to the site. Look it up for me: Cincinnati Milacron, Senior Software Security Engineer, $193K/annually with 6% annual bonus. \n\nTotally made-up. The site didn't even ask for my email address or any proof that I was not a bot.",
            "Is levels worth your time?",
            "The internship is probably reserved for the CEOs kid",
            "[deleted]",
            "Any suggestions before apply?",
            "Wtf I didn’t know signing bonus was for interns too",
            "Wtf",
            "Are these types of positions ever WFH? Most I’ve seen are either full time in the office or hybrid",
            "Lol, I doubt my salary per anum is gonna be so much :(",
            "Yo do they prefer candidates from different country ?\nLike im indian can i get a response if apply?[Have 2 Backend developer intern Experience and 1 Swe intern experience in resume]",
            "This may just be cope , but the pressure for this type of pay is also much higher than other places",
            "Is this for swe or trader? How much is it for swe if it’s different?",
            "What to do to bag a job at optiver"
        ]
    },
    {
        "post_id": "173hrho",
        "author": "Comprehensive-Let480",
        "title": "Unfortunate internship experience at Google",
        "url": "https://www.reddit.com/r/csMajors/comments/173hrho/unfortunate_internship_experience_at_google/",
        "score": 645,
        "num_comments": 106,
        "created_utc": 1696821238.0,
        "selftext": "Recently finished an internship at Google and it was a bad experience ngl. \n\nTeam had shitty WLB and office politics. People constantly messaging each other well after work hours. They wouldn’t even keep it subtle, my boss would directly ping people at 8, 9PM lmao (not regarding ppl on-call). Was required to go to office two times a week when literally none of my team would go in lmfao, I think I met two teammates in person \n\nWith the office politics, it seemed a lot of people at the company were starting to distrust upper leadership (according to company-wide surveys). People were also rightfully and openly upset about the lack of bonuses and salary freezes.\n\nMost of the other interns I knew (we were at a smaller satellite office) were working probably 60 hours a week near the end of the internship. Some of the friends I made were going into the office on Saturday AND Sunday. I really didn’t want work to comprise of 80% of my waking hours so I just phoned it in instead of burning out completely for the last couple weeks. I didn’t get a return offer and neither did any of the others that I knew of, which was pretty shitty in my opinion.\n\nI know things aren’t amazing in the tech industry but this gave me a bad impression of FAANG, I didn’t even bother asking for an internship return offer lmfao. Hopefully other people’s experiences were better this summer",
        "permalink": "/r/csMajors/comments/173hrho/unfortunate_internship_experience_at_google/",
        "comments": [
            "Similar experience w Microsoft lol, these freshmen can keep dreaming but this stuff can happen",
            "A bunch of first-years in this thread acting like all FAANG’s are sunshine and rainbows and they all drink coffee and play pinball machines all day.",
            "Idk why so many of these Never FAANGers are doubting your experience. This is the reality of Big Tech rn, less workers, more work.",
            "kinda believable based on what I heard/saw from other companies, but I don't have any connections at goog. If anything though google seemed to have one of the better internships out there.",
            "Had a very similar experience at a FAANG that I had heard to be chill. My friends at Google, Amazon agreed that it was definitely more intense this years then prior",
            "Big companies tend to have lots of politics all around, its not a FAANG thing. Small companies can also have a lot of politics and can be way worse because theres no place to hide from the toxicity.\n\nI’m sorry your internship experience wasn’t good, the manager and team are probably not in a good place to mentor interns. I took interns a few years and every time it was very important to me that they received all the mentorship, opportunities and feedback that I would give to any other hire. \n\nInternships can be hit or miss unfortunately, would just focus on trying to learn as much as possible and networking aggressively.",
            "Why do you think people get paid more there...?\n\nIt's not all rainbows and shit....it's actually a blessing you discovered early.",
            "Had similar experience with Amazon PV last year, I don’t think FAANG should really be the goal tbh, I’m trying to get into Bloomberg rn, I hear the culture is really good(but once you quit Bloomberg you can’t go back lol)",
            "Proof that every big company is team dependant, no matter how good. I had an Amazon internship and everything (wlb, manager, team..etc) was amazing.",
            "it’s team based, don’t take this as the general standard at all these companies. sure some orgs/teams will be like this but not all. go intern for yourself and find out rather than go off someone else’s word.",
            "That's unfortunate.\n\nI interned at Google this summer as well, and had a really great experience!\n\nYou mind me asking your location and if you got a return offer?",
            "Unfortunate indeed.\n\nA lot is team-based too. If manager is messaging that late it should only be done with explicit expectation you won't necessarily get to it until the next day.\n\nUpper leadership will always make some decisions you don't agree with and say some things that are out of touch. Try not to let it get to you. Try to do the things that make sense for your service. Try not to be too cynical about it either--being positive and unresentful is a superpower too.",
            "I had a somewhat similar experience this summer! I think I def. agree with the comments about culture and the lack of trust, job mobility, and flexibility at Google in general (at least rn). I think the experience also highly depends on the team you're with. It was def. a very interesting experience for me, but I have to say, it wasn't at all like the influencer videos haha. Anyways, I hope you have a great rest of your day!",
            "As always everything depends on the team and director. Although median FAANG is going to be better than median most other places it can always go in both directions.",
            "What team? I'm in team matching and would like to avoid this PA 😂",
            "\"I didn’t get a return offer and neither did any of the others that I knew of \"\n\nQuestion: Did they explicitly state that no return offers were given? Because none of us know for sure, and I'm talking about people lining up all the way from August 4th end date.",
            "Had a non technical contract position at Spotify and it was very similar. The politics were insane.",
            "Just chiming in to provide an alternative perspective to people in the comments. \n\nI had an amazing experience, had one of the best times in my life. Remember, people will only post these things when they have a bad experience. The silent majority may have had a good experience.",
            "All of these things are sadly well known realities of FAANG",
            "It's crazy how people said FAANG were overstaffed but everyone I talked to during my internship at AMZN seemed to think there weren't enough engineers and it was evident by the amount they had to work",
            "Welcome to Corporate America. Don't let them catch your slippin",
            "I'm glad that I've never heard back from FAANG and was hired by an unicorn.",
            "Damn that’s crazy thanks for sharing!!!",
            "\\> Was required to go to office two times a week  \n\nOh, the horror.",
            "yeah I have heard the same!",
            "same experience at Zon. but I was compensated extremely well and still had better wlb then while grinding at school n worried about recruiting so no complaints lol.",
            "Paid more = whipped more\n\nNow get back to work!!!!\n\n/S",
            "![gif](giphy|uUIFcBwloJdElEoez0|downsized)",
            "How many lmfao and lmaos did you clock in a day with the free food and other dozens of amazing amenities while you learned from the largest tech company in the world? How horrible to have to go into an office two days a week! Absolute slave conditions.",
            "Either you had exceptionally bad luck or you are just trolling.",
            "Nice shitpost 🥂",
            "1yr account first post no comments, a bit odd",
            "   \nu/Comprehensive-Let480 Out of interest, what interview questions did Google ask you about when you applied for the job?",
            "[removed]",
            "Totally agree! I was a different FAANG and experience was somewhat similiar. I was also a freshman so I thought they would be lighter but no. The other intern on my team seemed to also have a difficult time(They deleted his project the week after he left, I think he didn't do well though). My manager was good as let me de scope the project quite a bit. However, my mentor was awful, literally spent no time helping me and only was upset at me because I wasn't able to learn 100 new things at once. \n\nMy team seemed to also have similar issues but wasn't from my manager. They just had a lot of work and knew that they had to do it even if they were up at 8pm posting CRs.",
            "There is always a skew in work hours so if you are lucky you, will have 40 or less hours work weeks. If not, it's going to be 60 no matter what company you go to.\n\nIt all really depends on the team and the product you are working on. This is not specific to FAANG, it's just how the industry is.",
            "What do you expect? It costs money to have full-time employees. Do more with less. Are Google and Microsoft even expanding anymore? Did you do more work than full-time employees?",
            "What PA were you in at google?",
            "Similar experience with a fintech company. Really bad micromanagement and manage-outs. Saw people making slides instead of actually doing anything useful. Did not get a return offer which is not necessarily a bad thing, since most people tend to jump to big names after 3 years. Really frustrated about it.",
            "I interned in the mountain view office and I had none of the issues that you brought up. It was stressful and I had lots of work to do, but I didnt have to pull OT or come into the office. I guess it kinda does depend on the team and location tho :/ That really is unfortunate for you",
            "I'm glad my internship experience was amazing. It was with a small subsidiary company with a tight-knit team, amazing WLB, and fully remote.",
            "Same with Tesla here bruh. Shitty WLB, worked for 65hrs a week mostly",
            "We’re in one of the most uncertain economic and political times of the past 20 years and you’re bitching about salary freezes and work life balance\n\nWhat are you expecting",
            "Had a similar WLB at Microsoft but I kind of loved it because the team was very supportive and no one seemed to have a problem. One reason was also because teammates were spread across the world with different timezones.",
            "Sounds like you got you unlucky with your team, sorry to hear that. It’s been a tough market for interns and new grads at G, which is making it super competitive for the limited spots. I doubt this will ease up until Q1 2025, according to director in various orgs. There are still a lot of good teams with good mentorship and wlb, but those teams usually don’t have openings :(",
            "The current set of FAANG leaders inherited really great companies. Everyone can win in a bull market. I'm personally not confident that any of them will come out better over the next 4 years. Quite the opposite.",
            "Wait till you here the horror stories at Amazon.",
            "We could have told you that without you needing to intern",
            "That seems like pretty good wlb to me. 60 hrs a week is pretty normal if you get an actual project and 3 months to do it. Same with most places that are successful. I'll work 60-70 one week and then 40 the next just depending on what's on for the sprint.   \n\n\nFor interns specifically, we would usually give them a project that should be \\~10 days of work and give them 3 months to do it and the ones that finished it within the month got a return offer and we let them have fun. But the last time I worked with an intern on a team, we gave him the workload of a junior, and he handled it like a champ but it was because our manager and all of us knew 2. of us were getting let go in 6 months looking at our revenue numbers, so there was no time to have anyone including interns dicking around. Great kid, and he got the return offer but was let go afterwards as part of the downsizing.",
            "Hmm imo this is an anomaly with G teams. When you get an offer, you generally are able to team match when you get to interview teammates. See how long engineers stayed with a particular manager generally tells you how toxic a manager is. Some engineers in my team stayed with my manager for 10+ years."
        ]
    },
    {
        "post_id": "14yv3yj",
        "author": "iketaco",
        "title": "Stay ahead of the curve with new internship/new grad postings!",
        "url": "https://www.reddit.com/r/csMajors/comments/14yv3yj/stay_ahead_of_the_curve_with_new_internshipnew/",
        "score": 644,
        "num_comments": 172,
        "created_utc": 1689279136.0,
        "selftext": "For my last 3 recruiting cycles, finding internships has been a tedious process. I am either really late applying for a job posting or have to manually sort through postings to see what I actually want to apply to.\n\nSo this summer I've been working on a project to solve these issues with the following features:\n\n1. Get notified RIGHT AWAY when there's a new internship/new grad posting\n2. Have top internship/new grad postings all in one place where you can easily sort through and filter to find exactly what you're looking for\n3. Integrated salary data to job postings, so you know exactly what they pay!\n\nIf you're interested, please check out the site [sweintern.com](https://sweintern.com/)!\n\nThe job postings are collected from [Pitt CSC](https://github.com/pittcsc/Summer2024-Internships) and [ReaVNail](https://github.com/ReaVNaiL/New-Grad-2024) \\- so if you have any new job postings you find, please add them there and contribute to the community!\n\nThis was a fun personal project I've been working on for the past month and would love to hear your feedback / what yall think of it! \n\nPS I hope yall like the UI, it took forever to make 🥲",
        "permalink": "/r/csMajors/comments/14yv3yj/stay_ahead_of_the_curve_with_new_internshipnew/",
        "comments": [
            "Well done on this site, the filtering UI is clever.",
            "Holy this is amazing what year are you?",
            "please add this to your database thanks:  \n[https://github.com/AlanChen4/Summer-2024-SWE-Internships](https://github.com/AlanChen4/Summer-2024-SWE-Internships)",
            "Wait this is actually so cool what",
            "This project is really cool. As a rising sophomore, it’ll be extremely helpful to have notifications sent straight to my email. Do you plan on maintaining this in the future or is it more of a side project?",
            "The UI is pretty cool! It would be nice if there are updates for EMEA postings too (if there are GitHub aggregator repos for that, of course).",
            "Great job on this. Mention this project on your resume. Simple and it solves a good problem",
            "bruh that ui to search and sign up is actually so creative",
            "What languages did you use?",
            "Very neat, great job!\n\nEdit: and thank you!",
            "That is so cool!",
            "Does the database include internships from fall winter or spring quarters?",
            "can you send a confirmation email when someone signs up ?  this way we can make sure if the email ends up in 'spam' folder, we can whitelist the email address you are sending from. thanks. great job. super useful.",
            "GOAT",
            "ui is fantastic. props to y'all fr!",
            "amazing !  Can you make the 'postings' screen show everything  so that we can avoid clicking 'show more' many times ?",
            "That registration form is awesome 👏",
            "Do you know of something similar for FT new grad roles?",
            "Amazing idea! My only question is will these internships become more easy to apply to and therefore competitive because of the site?",
            "It would be appreciated if a “location” filter was added.",
            "This is absolutely fire! Lmao\n\nI am going to sign up right away. Sick UI",
            "!RemindMe 3 days",
            "Any plans to make it open source? It would be cool if we can make PRs to add job postings.",
            "[deleted]",
            "I used to use https://apptrack.tech/ for 2023 postings which was a similar service, but it seems its no longer being maintained so this is perfect for 2024. The filtering is also a big improvement; although how are you getting the data? Levels.fyi?",
            "Well done thanks",
            "Very well done",
            "Sick!",
            "You answered this already but I just wanted to say thanks for some sort of commitment to keeping this up. I am a incoming freshman so it will be a year at minimum before I even consider doing an internship and this would be amazing if it was still online in 1-2 years! You are gunna be a hero around this community haha",
            "Amazing UI, thanks for this, well done! 🛐",
            "The ui is intriguing. How did you come up with it?",
            "bro this is so sick! great job",
            "You sir are officially a hero! 💪🏾",
            "this is great! looks hella fun, keep it up",
            "This looks great! What was your tech stack?",
            "Wow, simple, sleek, a banger",
            "Does it include postings in the UK?",
            "This is so cooool. Thank youu",
            "This is so amazing what",
            "Bro you should do something like this but for all majors \n\n-a civil engineering major who would rather die than have to sift through internships paying $12 an hour",
            "This is great. The project will be a great addition to your resume too. \n\nI'm going for my masters program in Europe this winter. Could you please add Data Science related internships in Europe too? What kind of sources will you need for it? \n\nIf you choose to make the project open source, I'd like to contribute.",
            "This is sick!",
            "Amazing!",
            "This is so sick, wish there were Canada ones too",
            "How long did this take you to get it up and running?? This is amazing. Suppose I want to make something like this, how would I even start?? I do t have the knowledge for this yet.",
            "Site's looking really good!",
            "This is only for the US.",
            "This is amazing!!! Will this also include fall/spring term internships!",
            "This is really cool. Leaving acomment to boost this.",
            "Very well done! How is the search so instantaneous??",
            "[deleted]",
            "UI is just awesome bro! Great job!",
            "Are you running the website and the database in cloud? Can you please tell the steps in hosting/setting up the website? Cost ? Thanks",
            "When does new grad January 2024 intake start?",
            "[deleted]",
            "Hey, thank you so much for this! It would be super helpful if new grad positions from various sources can also be added to this! Thank you for your effort!",
            "What in the name of genius-ness🥺",
            "you are amazing",
            "Hello, I have a related project I’m working on and am thinking maybe if we could collaborate we could make something super cool. Please check your DMs, I’ve messaged you.",
            "Would be great if you could add a filter for role (SWE, quant, etc.) when signing up for notifications! Awesome work!",
            "just heard about your site in our school's disc server, nice work! u/iketaco",
            " Would be great if you could add a filter for location of job / remote jobs when signing up for notifications! Awesome work!",
            "Is there a way I can filter by location?",
            "Would also be great if we could select instant notification vs daily notification (all postings for that day consolidated in one email) when signing up for notifications!",
            "Already got two  great listings sent to me. Amazing site! Really looking forward to August when recruiting season gets in full swing.",
            "Soo cool",
            "hi, nice work! I signed up but I am wondering, is there any data leak vulnerability in your site? since I signed up, I started receiving emails from all of these random scam people lol idk if its just me.  \n\n\nthe job emails from you have been helpful though but just wanted to let you know",
            "Hey I signed up but am not getting any emails. Did I do something wrong? 🥹",
            "awesome!",
            "is [sweintern.com](https://sweintern.com) only for grad in US ?"
        ]
    },
    {
        "post_id": "q4p2vc",
        "author": "Spycii",
        "title": "Accepted an offer, this sub and r/cscq is soooo misleading",
        "url": "https://www.reddit.com/r/csMajors/comments/q4p2vc/accepted_an_offer_this_sub_and_rcscq_is_soooo/",
        "score": 638,
        "num_comments": 118,
        "created_utc": 1633798165.0,
        "selftext": "I accepted an offer as a software engineer intern at McDonalds! They pay $30 an hour, in Chicago (from Chicago so it works out). I didn’t go through any coding test, hackerrank, code signal nothing. I just showed that I’m chill, normal and willing to learn and it worked. I also received an offer from Progressive Insurance as a Software Engineer intern but declined. Of course these aren’t FAANG, but it’s a decent internship. Those who are struggling to find any internship, keep trying! Just because you didn’t do 200+ leetcode or you can’t solve a lc hard dp, bst, bfs, fps, moba, dps question doesn’t mean you can’t find a decent internship. Make sure ur resume is good and keep applying! My pms are open, if anyone needs some guidance.\n\nEdit: I believe this sub and r/cscq are misleading because I have been discouraged for not doing 200+ leetcode, or not knowing random algorithms. I did not have to do a single leetcode to receive this internship.",
        "permalink": "/r/csMajors/comments/q4p2vc/accepted_an_offer_this_sub_and_rcscq_is_soooo/",
        "comments": [
            "Yea alot of people forget that non-tech companies hire software engineers too.",
            "Here is the simple way of looking at it:\n\nGood personality + no leetcode can get you a good paying job. \n\nGood personality + leetcode can get you a stupid good paying job. \n\nMost people forget making $80,000 is still a lot of money for a new grad, only because they compares it to the 150-300k salaries some people get.",
            "Congrats OP. In real world software engineering, it doesn't matter if you're good at LC hards, or stuff like Knapsack, rain water trapping algorithms, etc. \n\nLC only helps you see the doors of some Big Ns, and that's not the end of life. Software engineering is a very very vast field, and ultimately solving LC problems is next to irrelevant in the bigger picture. Keep learning new development concepts, build new softwares, learn version control and your life will turn differently. \n\nSource: I've worked in the industry for ~2+ years, including at a Big N.",
            "Do you get free fries?",
            "[deleted]",
            "Where on earth do you guys apply to these? I’ve applied to maybe 200-300 now and haven’t even gotten as much as an interview.",
            "Small percentage of CS jobs pay stupid money. Large percentage of people posting on Reddit are people who got stupid money offers. The whole industry pays fine but don't be discouraged from the selection bias on this subreddit. That is not to say one shouldn't salary negotiate, job hop to get better pay jobs though",
            ">Edit: I believe this sub and r/cscq are misleading because I have been discouraged for not doing 200+ leetcode, or not knowing random algorithms. I did not have to do a single leetcode to receive this internship.\n\nNobody's gonna dispute that this subreddit is leetcode-obsessed, but I have serious doubts that this is an accurate portrayal. People actively being condescending or gatekeeping, ala \"if you don't do 200+ leetcode you're worthless and will never get an internship\" are rare, going by the reports I see.\n\nPlease post some examples, because if what you say is true, then it's a big problem that we have to address. It's one thing for people to be obsessed with leetcode for the companies where it's actually necessary, that's a natural and mostly unavoidable outcome given the self-selection in the subreddit's demographics -- but it's another thing to spread misinformation that you need to grind eternally for *any* internship.\n\nAnd keep the reports coming of anyone doing the above, or otherwise actively gatekeeping or insulting others.\n\nedit: it's also worth noting that, for the purposes of internship attainability, [the OP has had three coding internships before this one](https://www.reddit.com/r/cscareerquestions/comments/pjp3pt/how_many_internships_should_i_have_as_a_new_grad), which by itself is generally going to be a big boost. I point this out because the vibe in the post seems to be \"getting an internship isn't that hard\", and while they may well be true, I don't think you can necessarily use this particular case as an example of that when they have so much previous internship experience.\n\nHonestly, I feel like OP should've disclosed that in their post.",
            "where did you find this lol\n\nI've never seen a mcdonalds listing in my life and I've done extensive internship searches 4 times by now",
            "I jus landed an internship with Siemens and wasn’t really asked anything technical. A lot of these places are just trying to find likable people willing to learn and work hard so they can train them themselves. Was told this by multiple companies.",
            "Will you get paid in cheeseburgers tho",
            "Yea many non-tech companies have interviews that don’t do leetcode. For Vanguard, they asked me an lc easy and mostly cared about behavioral. Even companies like JP Morgan that pay like 100k have easy interviews or you can get the offer from code for good. While these companies don’t pay as much compared to Faang, Big N, and Faang, you are getting still money at the end of the day and you always have the opportunity to work your way to Faang. Sure, you may not get to a high-paying salary quickly but once you get there then it doesn’t matter.",
            "Does McDonald’s actually build any software? I be talked to a couple people in their Silicon Valley mcondalds labs teams and they actually do a bunch of interesting nlp work but I remember hearing their main chicago offices just hire outside consultantcy to do their dev work. \n\nDef ask your recruiter to clarify your role and make sure it’s not some nine technical work",
            "\\>you should do XYZ to get into top tech companies\n\n\\>hey guys I got into mccdonalds and didn't do XYZ, you guys are misleading",
            "You have to remember this sub is made up of the top 1-5% of CS students. The average CS grad doesn’t have any internships when they graduate. Nobody is saying you HAVE to do leetcode to get an internship, you just need to do it if you want to intern at a top tech company (which many people here are aiming to do).",
            "You had 3 swe related internships bro.",
            "Congrats! I don’t agree with generalizing the entire subreddit because I’ve seen little bit of everything, but I agree there’s a general sense of being overwhelmed by these claims that you need to do 400+ leetcode or something like that. Regardless everyone’s experience is different",
            "You don't need leetcode medium or hard if you are not trying to get into FAANG. Also applies to Full-time roles. But do you wanna get paid 70K or 150K as a new grad. That is the difference between being good at Leetcode hard vs not.",
            "[deleted]",
            "Congratulations on the offer, they have their cool global restaurant out there. Usually when people are giving internship advice here they're talking about FAAMG/Bay Area companies and nothing else",
            "On a similar vain thats how I got my NASA internship. No leetcode, no red-black trees, I just showed them i was willing to learn and they got me.",
            "> I didn’t go through any coding test, hackerrank, code signal nothing...\n\nThis isn't to say it does not happen. People here like to exaggerate though as if they will be asked hard questions everywhere. My first developer job I got asked 1 simple coding challenge and then everyone we interviewed we asked them 1 simple coding challenge. My second job, I got asked 1 coding challenge.\n\nWhen I interviewed at Facebook, I got asked 6 coding challenges on the whiteboard, 1 hard one.\n\n> I have been discouraged for not doing 200+ leetcode, or not knowing random algorithms.\n\nYeah the only people who give a shit about that to the extreme are those applying at FANGs. I've probably only ever solved 3 leetcode problems, but 100+ Swift coding challenges from a book (easy to some hard).",
            "Had two interviews over the summer for internships this semester, both of which did not involve any coding assessments/leetcode. They went over a couple of my projects, asked me questions about them, and overall just asked questions to see how much I knew about stuff. Didn’t get the offer for the first one, second one gave me an offer and I’m currently interning there. Probably only sent out around 15 applications and got those 2 interviews. \n\nOn the other side though, it’s a smaller company and I would really like to experience working for a larger company (not FAANG, but something cool) so I’ll probably have to get started with some leetcode for next summer perhaps.",
            "I didn’t have to do LC in my interview, my TC is 140-150. It’s all luck and connecting with the right people at the right time",
            "Never did a leet code problem. Been working in for over 20 years. I think I could learn them. I got through my algorithms courses in college. I respect the skill to learn them but I haven’t needed to because of my prior job experience. There are lots of jobs out there for competent and friendly programmers.",
            "Ya you don't have to do any of that... If you don't care about making a lot of money.",
            "Just to share my own experience; I had to leave CSCQ when I was searching for an internship and job (and I would have left this one, too) because it was actively harmful to my mental health. What's the old saying? Comparison is the thief of joy? You know what you need to do. Apply apply apply, grind leetcode if you feel it helps you, go to career fairs and hand out your resume like a mad-person. My internship was from making a good impression with folks from a local software company at a career fair on campus. My first (and only, so far) post graduation job (which took six months of full time effort to get, by the way) was literally a posting I came across on LinkedIn and applied to. No networking was involved, I never once made leetcoffee, there were not multiple rounds of interviews. Sometimes even CS jobs have a more traditional apply, in-person interview (mine was with 3 people), phone call: \"We'd like to offer you a job!\" structure. Just because all anyone ever talks about on this and the CSCQ subreddits is the hyper intense FAANG style interview doesn't mean everywhere is like that. I'm not making FAANG type money, but I'm doing alright, and with how new I am, it's only going to get better.",
            "How did you get an interview? Because I was applying for internships for almost a year before getting an entry level dev position at a software development company. Most would just reject me immediately before even giving me a phone interview.",
            "I'm also from chicago. Where did you find the job posting? Also what kinda role / skills were they looking for?",
            "depends on what your expectation is. \nyou can say that you don't need to grind LC to get an job, someone can also claim that you don't even need a degree for getting a decent job.\n\nAs a software engineer, best scenario is you want to work for pure software companies or work at trading companies for money. basically choose btw respect or money. \n\nif a company can't tell the differences between IT and software engineering or just group then together, then those are the type of companies you want to avoid. because one day you will have to fix printers or being called the computer guy.",
            "Hey congrats on your offer! I honestly didn't know LeetCode existed until I started browsing this sub and cscq. I try to remind myself every now and then that there's more to life than working for a top tech company",
            "Where did u apply for the software engineer position",
            "I agree. I got hired in an industry that I never even considered to have programmers involved. Nice salary and didn’t get have to grind coding problems or anything of the sort. I think many would be surprised about how many companies actually have use for people that can write code besides the massive companies.",
            "Did you have any kind of coding test or a segment of technical questions?",
            "You put into words what I've been thinking myself. \n\nMaking that kind of money in the Midwest is nice!",
            "What’s cscq",
            "Are you really so lazy that you would rather work at McDonald's than solve 200 LC problems?",
            "How was much was the Progressive offer?",
            "How did you recieve a SWE internship without leetcode? I’m sorry but this sounds like a diversity hire.\n\n/s",
            "I know this was posted 2 years ago, but that's awesome! I'm interested in applying. What were your duties at Mcdonald's? \n\nI'd like to have a general idea of what I'll be working on, whether it will be a project, etc.",
            "Hello! How was the process after you submitted your interview like?"
        ]
    },
    {
        "post_id": "ytrpj6",
        "author": "anzuurin",
        "title": "For those who want to give up on the grind…",
        "url": "https://www.reddit.com/r/csMajors/comments/ytrpj6/for_those_who_want_to_give_up_on_the_grind/",
        "score": 641,
        "num_comments": 37,
        "created_utc": 1668313587.0,
        "selftext": "I saw someone online say this and thought I should share:\n\n“If you knew with 100% certainty that you only need to receive 20 more rejections before you got that one acceptance letter, would you still be sad over getting that rejection?”\n\nMost people would say no. Remember that this is all part of the process, and maybe you’re just 1, 5, 10…etc rejections away from that one acceptance email.\n\nYou got this. Don’t give up.",
        "permalink": "/r/csMajors/comments/ytrpj6/for_those_who_want_to_give_up_on_the_grind/",
        "comments": [
            "This kinda reads like an ad to get people to keep gambling after they have lost but I understand the sentiment haha",
            "Always remember: 90% of gamblers quit a week before they would have made it big.",
            "That's awesome and inspiring bro.  I'm going to post this on my LinkedIn page",
            "Yesterday someone posted that he got rejected from a company which he didn't apply, does it count?",
            "It's insane that having a college degree is not enough to get a job. You need internships, projects, previous experience, good connections/networks, and so on; just to land an entry-level job. These are unfair requirements for people who don't have the resources to succeed. There needs to be a complete do-over for job hiring. And even after getting a job, you're probably going to be out of a job when the economy is shit (Like right now). The STEM field jobs (or all jobs in general!) need to have unions to stop this unfair job market.",
            "I literally gave up. Gonna do masters while I wait for this shitshow to be over. If any of the new grads believe they can land a job these days, they are either a beast or delusional.",
            "[removed]",
            "I’ve failed my past two exams, I’m honestly considering giving up. Maybe this isn’t for me. 😔",
            "Load of crap."
        ]
    },
    {
        "post_id": "r1clov",
        "author": "shravanslays",
        "title": "My Amazon recruiter blinked approximately 17 times every minute during the interview. Does it mean I got in?",
        "url": "https://www.reddit.com/r/csMajors/comments/r1clov/my_amazon_recruiter_blinked_approximately_17/",
        "score": 634,
        "num_comments": 24,
        "created_utc": 1637780795.0,
        "selftext": "She was blinking an average of 17 times every minute. Once my interview was done, I looked up the internet about Morse code and it looks like the blinking decodes to, “Welcome to FAANG.” Does it mean I got in? Can I have hopes?",
        "permalink": "/r/csMajors/comments/r1clov/my_amazon_recruiter_blinked_approximately_17/",
        "comments": [
            "Did you count how many breaths she took? Did you count how many seconds her pauses were between each word? Do I need to say more?",
            "I'm sorry to be the bearer of bad news but Welcome to FAANG is 14 characters long, so blinking 17 times would mean \"Not Welcome to FAANG\"",
            "She was probably surprised by how weak your solution was",
            "did she lick her lips ? If she did wants to have sex with you.",
            "These posts are too accurate..",
            "I somtimes also blink 'too much', but only when my contact lenses are drying out / had them in too long",
            "Depends OP. Did you blink back 17 times? I hope you didn’t. Not blinking back shows you’re capable of the “Disagree and Commit” leadership principle. If you blinked at all during that interview you have gone against the important principles at Amazon, and unfortunately will be transported to the “Interview Reject” warehouse (with 2-day Prime shipping, ofc).",
            "You are so funny! Hahaha",
            "This subreddit used to be really helpful, but for the past year it’s been all Amazon jokes. Do people really find this funny?",
            "LOLOL absolutely, you're as good as hired.",
            "Hurr durr shitpost is shit......",
            "Hmm\n\nhttps://youtu.be/sMMpYiiuEMc",
            "People that blink too much creep me out. I know it's a nervous tick or something but it you blink more than 10 times every minute I feel like you're going to stab me in my neck between blinks",
            "He was actually trying to signal you, “Help me!” In Morse code.",
            "*Writes a machine learning algorithm to predict hires based on blinks*\nNope sorry you didn’t get in :(",
            "Hahaha this is gold!!!",
            "Join their metrics team. You will be valued",
            "Cs threads are something , I was wary of doing bridge course but yall make it look interesting 😂",
            "Hate to break it up to you but it must be 18 times per minute. You're almost there though. Better luck next time"
        ]
    }
]