[
    {
        "post_id": "1ce4iwr",
        "author": "Typical-Individuall",
        "title": "If internships don’t count as experience, what the fuck are we supposed to do to gain experience for an entry-level job?",
        "url": "https://www.reddit.com/r/csMajors/comments/1ce4iwr/if_internships_dont_count_as_experience_what_the/",
        "score": 633,
        "num_comments": 123,
        "created_utc": 1714187898.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ce4iwr/if_internships_dont_count_as_experience_what_the/",
        "comments": [
            "Best option is to do internships with the goal of getting a return offer after graduation. Then stick with that job for a few years to gain the experience required.",
            "Make sure your Dad or Father-in-law is in the C-Suite,.",
            "Apply anyways. You miss every shot you don't take",
            "[deleted]",
            "Internships are experience and anyone who says otherwise is just gatekeeping. Any company paying you to code is experience.",
            "They are experience.\n\nJust not “years of experience.” ",
            "If you're an undergrad join a research lab and preferably one more related to your interests. It helped me and my lab mates a ton. Some companies will specify that internships dont count as experience and they are looking for YOE outside of internships I know amazon does this. Internships are often very different than a full time role and companies realize that. It's like riding a bike with training wheels and typically the intern project you work on has low cost/risk associated with it. The current market is a big factor too, theres a lot of experienced people out there. Best bet is trying your hardest to get a return offer from your internship",
            "You have to be born with it yo",
            "Holy shit this subreddit is so obnoxious. You people should stop using abbreviations.",
            "It's not black or white. Like most things outside of academic life.\n\nInternships don't nominally count as experience but the reality is more nuanced. Where you did an internship, what you did there and your ability to demonstrate and explain skills you've learned there matter. There's such a large variance in internships that they don't automatically count as experience. \n\nInternships where you have an opportunity to learn, build and be challenged and practice work like conditions is still the best way to learn what a job requires, be more qualified for jobs, and set yourself apart from other candidates. It's also a good way to get return offers (though not guaranteed)",
            "You need to create apps with 100k concurrent users and build a successful startup on the side. It's not a big deal!",
            "For my second job with \"almost 0 experience\"  I put over 3 years experience on my cv.\n\n6 months internship almost 2 years part time a 6 months contract. Im not gonna cheat myself.",
            "Funny thing is, they ask for 5+ exp when you are fresher but once you are above certain age limit, they will say they are looking younger (read cheaper) candidate.",
            "As a current Senior Software Engineer: Internships absolutely count as experience lol",
            "A lot of companies nowadays are unable to provide proper onboarding and training to fresh grads. So they don't hire fresh grads.  \nIf they are still capable of training, they hire interns, train those, and possibly keep them, so no need to hire fresh grads from elsewhere. They have their own pipeline.\n\nThat said, for any jobs that are actually open for fresh grads, you do have a big advantage. They just seem to become rarer these days, as companies kicked out seniors and no longer have enough staff for training.",
            "Yeah, it’s bullshit. Every “entry-level” job asks for 2-3 YOE. I’ve seen some even asking for 5+. Sorry I can’t compete with the people who keep getting laid off from FAANG.",
            "They do count as experience. Just not professional experience.",
            "Actualy  you asked a great question.I am in this situation like you.",
            "Make a God app that sells big and wait for them to acquire you /s",
            "Nowadays the tech market sucks. Before companies would train you but now they want you to have all the skills since day one, ymmv.",
            "Internships 100% count as experience. What are you smoking? \n\nI learned WAY more from my internship experiences than I did from my 4 year degree. It played a huge role in my landing a 6 figure job out of college, and it helped me get quick promotions when I did start working.\n\nTo be fair, my internship was year round, 20 hours a week during school, and 40 hours a week over summer & during school holidays. And I did do that for about 2.5 years, which definitely provided ample time to grow.\n\nThat said, even a summer internship should leave you with valuable experience. Definitely worth more than a semester of college.",
            "Sorry to tell you but that „lack of experience“ excuses are bs and only mean they didnt like you.",
            "who is the dumbfuck saying it doesn't count as experience? lol",
            "Internships absolutely count as experience. Your personal projects count as experience.",
            "OSS, for one.",
            "I got this interview for a summer Tech LTE, I'll take what I can get if I do get it.",
            "Keep applying, Certifications and Projects(which you have done yourself and can explain to a layman).",
            "dude some recruiters can even state that this Harvard degree is bullsh\\*it",
            "Why wouldn't they count? They're professional experience.",
            "Mention it as yoe anyways. You miss 100% of the shots you don't take. \nAlso ask the company you interned at for a return offer.",
            "They do count for experience. My company considers 2 internships( summer ) as one year of experience.",
            "Bullshit",
            "Internships definitely count. Who do you think is most likely to get a job between two fresh grads where one has no internships? There was a huge difference in how fast people found jobs with vs without interns when i graduated... During the hiring craze of 2020. Imagine today, it has to be more significant.",
            "Just lie on your resume… or stretch the truth.",
            "Entry level jobs are those that don't require experience. If it requires experience, it's a non entry level job that just pays poorly",
            "Do longer internships. I did one for 12 months and it was great! Worked on problems with other engineers, nobody gave me “easy tickets”, and I actually got to say that was a full YoE. If you can do 8-12 I think that’s absolutely worth saying you have 8-12 months of experience. \n\n4 is too short just because it takes a long time to ramp up.",
            "They count as experience to new grad positions, but beyond new grad they don’t count anymore for a majority of companies",
            "ever tried lying? If you had a software dev internship for a year, just say you were a software dev. Its just a checkbox for the recruiting team to check off to send your resume to the hiring manager anyways",
            "It counts as experience and hiring managers 100% consider it but it’s not the same as having a full time job for a full year.",
            "Would starting your own company and doing some freelance projects count as professional experience that could be leveraged to get a position? Even if the projects were small, like a website for the local library or a food-ordering app for a hot-dog stand. ",
            "Lie",
            "Just lie lmfao \n\nIf companies are going to start pulling this outrageous bullshit, just fucking lie. Buddy buddies with a coworker and use them to lie, or just find a friend and just use them as your reference. \n\nIf companies are allowed to lie and say that actual legitimate experience doesn’t count as experience, then it’s time to do the same",
            "Bah I don’t give a fuck. Did I spend time working? Yes. Did I gain industry knowledge? Yes. Then it fucking counts as job experience.",
            "Who says internships don’t count as experience? I’ve never heard this\n\nIt may depend on the company and what you do at your internship but if you can articulate what you did at a 3-month internship, it usually definitely counts\n\nThere’s a reason students really want internships—for experience. Yes it pads resume but it also teaches you experience that will help you at a full-time role",
            "I did ugrad researxh",
            "Don't be catastrophic.  Internships do count as experience.  Different companies have different hiring standards.  One company might have a policy of basically not hiring interns at all, that doesn't mean every company does.\n\nA lot of the issue right now is that interns are competing with non-interns for the same roles, because a lot of non-interns have lost work recently.  It's going to be really hard to compete as an intern with someone who has more employment experience than you do either internship or not.  Intern experience is also definately lower value than fulltime employment experience because lots of companies don't really take training interns as seriously as they take training fulltime employees, because interns cost them SO much less.  But that's not the same as saying the experience \"doesn't count\".",
            "Internships don’t count as experience? Says who? I count my internships as experience. And I will absolutely add those years on my resume.",
            "I wouldn’t even let them know I was an intern. I personally think any type of experience counts. So I’ll just put that company that I’m interning at as a “contract work” lol.",
            "Network, network, network. You can avoid most of the nonsense in the hiring cycle by getting a good referral or by having someone vouch for you.",
            "I think people are overthinking this. When companies say internships \"don't count as experience,\" they're not saying your internships will be ignored. They just want you to apply to the new grad positions, rather than the mid-level or senior positions. Otherwise new grads will see a job listing for a mid-level position requiring 2+ years of (full-time) experience, and think they're qualified because they did 2 summers of internships. Telling you not to count internships is just a way to standardize terminology so that everyone is talking about the same thing.",
            "https://preview.redd.it/4e8rif28b8xc1.png?width=1169&format=png&auto=webp&s=097beecbc5ea60acd3dd6ade377cf8007498dbc2",
            "https://preview.redd.it/v9yzs59qb8xc1.png?width=597&format=png&auto=webp&s=f87914ed90e474fd5f126f507e4bdfcd9f726373",
            "Unfortunately internships are not very useful other than a demo of the work culture. You don't learn anything by shadowing and you are not getting full training. Handling small menial tasks is not experience.  \n\n\nYou are expected to apply for entry level even if you don't meet the requirements. The job reqs are there to try and thin the pool of applicants and filter out unconfident and timid employees. \n\n\nBe confident network with people while you intern. Write cover letters and tailor your applications to all entry level positions.\n\n\nDon't be afraid to ask questions during a job interview, especially if it's coding related, they are going to want to see how you bounce ideas. Make sure you are extremely familiar with your data structures. Or at least know how they work at psudo level.  Understand which data structures is most optimal.\n\n\nAlgorithms is a big part of CS the course isn't enough. Make sure you study it thoroughly outside of class. Most importantly make sure you have projects outside of work and school so that you are always problem solving. Even if you don't intend to get a programming job.",
            "Enlist/commission",
            "Screw internships guys, contribute to a bunch of open source projects and then show you github as a resume. Doing this will get you experience while you are in school.",
            "Since when does experience doing something not count as experience doing that thing?\n\nDon’t let potential employers redefine language.",
            "They do… who said this",
            "I don't know what people in this thread are talking about. They do count a experience, professional experience. The only time they may not is with Sr or higher positions.",
            "Network",
            "What happens when u do 6 month internship then 6 month full time , does that count as 1 year of experience ?",
            "If you haven't got ur USA PR, then go to gym everyday and fall in love with someone.\n\nIf you got it/citizen, then this is your vacation time. See interviews as practice and routine. You either spent it with anxiety or went crazy",
            "Ask your dad ?",
            "You use your internship to get an entry level job. Isn’t that how it has always been?\n\nAn intern’s level of responsibility is not the same as a junior developer, say, because the demands are different:\n\n1. Intern takes very light duties that are not as beneficial to the company, if at all, and they will only be staying for a few months so it doesn’t make sense to invest in training and patience.\n2. A junior dev is expected to remain with the company and develop in their career. If they are good it is worth it to invest time and energy to ramp them up and give them more demanding tasks to make them of greater value to the company over time.\n\nYou see the difference there? Interns are not the same as juniors so are not considered the same."
        ]
    },
    {
        "post_id": "11dm76s",
        "author": "Interesting_Nail_843",
        "title": "Fellas, it finally happened.",
        "url": "https://www.reddit.com/r/csMajors/comments/11dm76s/fellas_it_finally_happened/",
        "score": 627,
        "num_comments": 92,
        "created_utc": 1677530361.0,
        "selftext": "I sent out around 100 apps and got a couple interviews, made it to the final round of one and just signed my offer. $30/hr and honestly I would've taken anything because I need the experience 🤣\nI'll be a back end developer, this is my first internship!!!",
        "permalink": "/r/csMajors/comments/11dm76s/fellas_it_finally_happened/",
        "comments": [
            "Congrats!!! Now take some time off and spend time with your friends and family and doing things you enjoy.",
            "30 is a lot for a first internship. Good stuff bro.",
            "Congratulations! Next time it'll be easier with internship experience on your resume!",
            "lets fuggin go!!!!",
            "Any chance we can compare resumes? I have almost 300 apps and nothing yet. I’m worried I’m doing something wrong.",
            "Congrats dude!",
            "Congrats! Glad to hear not all CS majors are suffering.\n\nYet I can’t help wondering how interns are getting paid $30/hr when graduates like myself can’t even find jobs for $20/hr.",
            "Congrats! :D",
            "Congratulations",
            "30/hr is very good, congrats",
            "u say that as if $30/hr is trash",
            "Congratulations. Les gooooooooo",
            "Congratulations! $30/hr is above the US National average! \n\n(According to jobted, $53,490/year is the US National average as of 2023. This is $25.71/hr assuming 40hr/week, 52 weeks/year)",
            "Congrats! I started applying yesterday, 66 so far, 1 rejection, 4 invitations to \"assessments\". I'm having some intense imposter syndrome lol",
            "The issue with CS majors is that everyone expects a high comp for an INTERNSHIP. No other field pays their interns unless it’s a Co-op.\n\nInternships are meant to gain experience, not money.",
            "[deleted]",
            "Congrats!!!",
            "First of all,  congrats! The “I would’ve taken anything” is truly a vibe 😂",
            "Congratulations!!!",
            "Congrats!",
            "Congrats 🎊",
            "Congrats, another step toward something better.",
            "Congrats man!",
            "What month and year are you graduating?",
            "Congrats man that’s awesome! Definitely not bad for your first gig you make more than most of the population",
            "Yo. Can we compare resume too?",
            "Congrats bro, even without that type of pay it’s a great accomplishment. Time to relax and reset💯💯",
            "Congrats!!!",
            "Congrats! If you don’t mind can you say what company and describe the interviewing process?",
            "LETS GOO",
            "I remember the relief I felt when I got my internship this time last year. Kick back and enjoy the rest of your stress free semester",
            "congrats bro, just a question since im new to computer science job world and all, do we apply for internships while studying or after we graduate ?",
            "Congratulations, man!\n\nGood to see some hopeful posts about self accomplishments. I really hope this internship works out for you!",
            "by any chance are you Kumar K 's mentee?btw congrats!",
            "$30/hr seems too good to be true but the hell. Congrats!!",
            "Awesome! Congrats. Do you mind sharing what tech stack you'll be working in?",
            "How did you land? did you do any projects? Did you have high gpa or attending prestigious college? What languages and tech skills do you have now?",
            "Congrats! It took me 300 apps and some final rounds before getting something",
            "Congrats on breaking in 👏",
            "30/hr is amazing, esp for your first internship. congrats",
            "Congratulations bud!",
            "Where did you mostly apply? And how many jobs did you apply everyday? Did you put a lot of efforts on the cover letter for each of them?",
            "What programming langauge(s) would you use for backend development?",
            "Congratulations my friend 🎉, now celebrate 🥳",
            "Congratulations. I am in the same boat hope i can keep up the spirits and continue applying",
            "That’s awesome! Congrats!"
        ]
    },
    {
        "post_id": "ywdtw4",
        "author": "Sotam1069",
        "title": "I GOT INTO GOOGLE!",
        "url": "https://www.reddit.com/r/csMajors/comments/ywdtw4/i_got_into_google/",
        "score": 631,
        "num_comments": 138,
        "created_utc": 1668556792.0,
        "selftext": "I am a sophomore and I just got my STEP offer!! I grinded so much for this im so happy rn. I even failed physics because of my leetcode studying. \n\nIf anybody else got accepted I would love to connect with you!",
        "permalink": "/r/csMajors/comments/ywdtw4/i_got_into_google/",
        "comments": [
            "Out of curiosity, is there not a hiring freeze at Google? With so many companies, I forget which ones are hiring interns",
            "Congrats!!!! If it makes you feel any better I failed my Calc midterm to get in.",
            "[deleted]",
            "I failed my algebra midterm and haven't got in.",
            "Congrats! I did step 2 years back, and it’s gonna do wonders for you :)",
            "What kind a cracked stuff fid you have on your resume ? And what's your LC questions category breakdown.",
            "CONGRATS!! I didnt get google but failed my math exam to get tesla lmao",
            "Congrats!! This is the news that Ive been wanting to see, always gives me hope when seeing people are doing well 😊",
            "W",
            "Is STEP actually “getting into google”? I always thought it was just a program opportunity for you to get a better chance of actually getting into google",
            "YAYAYAYAYYAYAYYYY!!! Congratulations. I am so happy for you. This is so huge!! I'm celebrating your success over the internet! :)",
            "Congrats you’re set!",
            "Congrats!",
            "show resume? IM A FRESHMAN this year and i want to get in next year",
            "Can you share the interview process?",
            "Do u go to a target school?",
            "Congratulationsssssss",
            "so happy for you!!!! saw you in multiple threads im really glad you got the offer congratulations 🥳🥳",
            "just got my step offer yesterday as a sophomore as well congrats :)",
            "Congrats",
            "What was your timeline like?",
            "Congrats!! Very proud of you",
            "When did u apply?",
            "Huge W!!",
            "Huge congratulations! Hope to share in some of your amazing luck! 😍🎉🙏🍀💪",
            "Do you think failing a class is gonna hurt u at all in the long run ? I never even considered failing a class in order to grind for interviews bc i just assumed it would hurt my gpa so much that i wouldnt be able to land an internship/job",
            "💯",
            "CONGRATS!! I didnt get google but failed my math exam to get tesla lmao",
            "[deleted]",
            "Congrats!!! :D",
            "Congratulations!",
            "Congrats dude. Any way you could share what your GPA is or if GPA mattered when applying? I've heard conflicting advice about if companies look at GPA.",
            "congrats!! how much leetcode did you need to know?",
            "What kind of projects or other things did you have on your resume that you think got you attention or was discussed by the interviewers?",
            "Ayeee congrats!",
            "Congrats! I got my STEP offer last year around the same time. It was a great experience.",
            "CONGRATS BRO!!!!!!! I am also a sophomore doing STEP this summer!",
            "Fuck you and congrats!",
            "congratulations - hope you have a great summer at Google!",
            "congrats! are u accepting it?",
            "Welcome!",
            "I wasn't trying to flex broo I promise!!!!!!",
            "y is this upvoted? who cares",
            "Good luck. You’ll need it.\n\nhttps://www.theregister.com/2022/11/16/tci_fund_google_cut_costs_waymo_compensation/",
            "That's awesome, congrats! Did you have any relevant internship, research or work experience on your resume?",
            "omg congrats! did u apply in freshman year too?? what was the interview process like? and most importantly, what about the pay?",
            "Congratulations! 🎉🎉🎉\nI'm a FTE at the mountain view campus. Feel free to PM if you have any questions.\n\nHope to see you around some day",
            "Congrats!! All your hard work paid off. Is the google step intership online/remote?",
            "Congrats and fuck the haters boi 💪"
        ]
    },
    {
        "post_id": "196y8nk",
        "author": "FreshPrinceOnline",
        "title": "I'm a sophomore so still got a chance right?",
        "url": "https://i.redd.it/9wx03oa6sicc1.jpeg",
        "score": 631,
        "num_comments": 33,
        "created_utc": 1705287835.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/196y8nk/im_a_sophomore_so_still_got_a_chance_right/",
        "comments": [
            "You can't get an internship, I can't get accepted into University 😎",
            "I am tired of the worry, I am tired of the grind, I want to switch major but it’s too late",
            "bro keep applying, i got my internship 4 days before the due date",
            "I’m in the same boat cuzzo",
            "I'm done with this shit bro I'm switching to firefighting",
            "Yeah but we all can have los pollos so life is good",
            "most companies only hire seniors anyway so don't worry",
            "Fr fr",
            "Sophomore Here !!!"
        ]
    },
    {
        "post_id": "syav0g",
        "author": "None",
        "title": "Cheated on Coinbase OA, just got an offer. What should I do?",
        "url": "https://www.reddit.com/r/csMajors/comments/syav0g/cheated_on_coinbase_oa_just_got_an_offer_what/",
        "score": 632,
        "num_comments": 207,
        "created_utc": 1645494149.0,
        "selftext": "Hello,\n\nI cheated on the Coinbase OA, blatantly. I looked up what they ask on LeetCode Discuss, knew the exact questions and so I wrote up answers in LeetCode Playground and just looked at my other monitor to type them into the OA. 100%.\n\nI got to the phone round; this time, I did not cheat, but I knew what they were going to ask and prepared beforehand. Pass.\n\nOnsite round, same thing. I did not cheat, but again knew what they would ask. And they did.\n\nJust got an offer. The offer is $140K + $50K stocks. I don't feel bad about knowing the phone and onsite questions, personally, but I do feel bad that I just blatantly copied to pass the OA. I could have even taken the time to learn the problems they ask, but didn't because I felt lazy.\n\nAm I morally obligated to decline the offer?\n\nEDIT: For those asking how to find the questions, go to leetcode.com/discuss and search Coinbase under Interview Questions and Interview Experience tabs (allegedly).",
        "permalink": "/r/csMajors/comments/syav0g/cheated_on_coinbase_oa_just_got_an_offer_what/",
        "comments": [
            "I’ll tell you exactly what you need to do, listen close. I need you to loan a brother 50 dollars man maybe 100 if you’re a real good dude I’ll pay you back I swear.",
            "Take it and run, congrats",
            "That guy didn’t delete the post but deleted his profile?",
            "[deleted]",
            "Technical interviewing is a so dumb. If you can do the job no one will care. The ability to do leetcode barely translates to an actual job.",
            "Companies don’t operate on morals",
            "decline the offer so that i can apply and get your job",
            "if u dont take the offer imma personally come and beat ur ass. morals are a poor mans trait (i disagree 100% with this but it applies to this situation)",
            "[deleted]",
            "Nah bro, decline it and take a job offer for 40k instead. /s\n\nLike what did you expect us to say? Congrats, I guess.",
            "I cheated too to get to final rounds. Gotta do what it takes. Don’t hate the player hate the game.",
            "[deleted]",
            "I wouldn't have even made this post to be quite honest. A lot of people here will scorn you, but you hustled the system. I'm pretty sure it was Bill Gates that said he'd rather hire a lazy person to do a hard job because he will find an easier way to do it. Hats off to you. The whole interview process is bullshit to begin with. All that matters is if you can do the actual job in the end.",
            "How did you know the phone and onsite questions?",
            "Bro how many engineers does coinbase have? You may want to delete this. That’s a tiny ass company",
            "Posts like these are soo irritating. Humblebragging and trying to present themselves as this morally good person by pretending that they're so consumed by guilt that they're considering declining the offer when they would have probably accepted the offer already.",
            "Yea decline the offer. I know u won’t",
            "Nah, what you did would probably be considered as normal interview prep for most other candidates. It’s not your fault they didn’t change up the questions.",
            "Googling a solution is actually more in line w what your job day to day will be like 👍",
            "The only thing more cringe than cheating on an OA is making a post bragging about it & asking if you should decline the offer.\n\nTell me ur 21 without telling me ur 21",
            "y’all really stay stressing about your morals lmao",
            "I’m jealous. How did you cheat?",
            "Short answer no. Longer answer, it's important to understand that this is a critical flaw in the cs interview process. At best leetcode questions show them that you've memorized the question and answer. It's not an actual display of skill or knowledge. You never claimed one way or the other, and in real life you would have the answer on your second monitor anyways. There's no real world situation where you need some DS&A knowledge that you couldn't look up. Take the offer. You're not the first person to do this and it's very likely it's almost expected.",
            "Why even post this I’m sure u gonna turn down 190k cuz some random redditors told u to",
            "That wasn't cheating, that's just playing the Leetcode game (which is a dumb game we get forced to play) smartly, and being prepared. You won't even need to Leetcode again on the job, from now on you'll be doing *actual* software engineering. Congrats, for goodness sake don't decline.",
            "Deleted this fucking post, actually it’s too late. You’re going to ruin the gravy train for everyone.",
            "Man! You're awesome for even considering this (might I also add a little stupid). Listen up closely \"No one in corporate world truly cares for you\". This is not a knock on any company or anyone, it's the way world is. You got the offer and you have the job. Go and improve the platform and get some bitcoins in return.",
            "Take what you can, give nothing back.",
            "why would u even cheat if you thought u were morally obligated to decline the offer",
            "Take the offer dude. Stop overthinking it",
            "Take the offer. Chances are the interviewer himself did not know the answer to the question. Take it.",
            "you did the primary task of all SEs: find the answer online. the offer is all yours, take it",
            "Absolutely not\n\nBtw can I see your resume? A brother tryna get into coinbase",
            "can u code like in general? software development in a job goes beyond more than just doing leetcode. so if you can do your job well, that is what will matter more.",
            "Stay quiet about this and do not do it again lol.",
            "Uh maybe not blatantly post it to online for the world to see? Maybe?",
            "Say you're already working for coinbase. Your boss puts you on a new project. You do some digging and find an open source project that contains tons of code you can use for the project your boss assigned you. This saves you and your boss time/money. Do you go tell your boss you should be assigned a different project because you found an online resource that did most of the work for you and that isn't fair? Absolutely not. It's called being efficient. This isn't school anymore. Morals don't matter in business. It's all about efficiency. You used resources online to achieve your goal. You'll be doing that in your career all the time. Congrats on the new job!",
            "Honestly, in real life scenario, and you don't know something, you look it up to solve your programming issues. You just proved you have the ability to find the solution to a technical problem, and you passed the interview and stuff. You're good, I wouldn't worry about it. Take the offer if it is where you want to work.",
            "Are you for real ? People are dying trying to pass in any way possible, you pass and complain. Just take the job and delete the post.",
            "You should decline the offer. You’ll never live with yourself. Do you really want to go to bed making 140k a year BUT knowing you cheated on an OA? Smh id kill myself",
            "Who cares, just perform at the job! Enjoy\n\nJust be sure you didn't cheat on resume and skillset)",
            "Bro take that shit. Fuck it.",
            "Lol... You need us to make you feel better and tell you you didn't do anything wrong? \nIf you didn't want the offer or if you felt just as bad as you're propelling then why do the phone and on-site interview?",
            "their fault ez money",
            "Cheating to get to the final round is absolutely acceptable IMO. I bet ~50%+ are cheating on OAs. IMO OAs should be open resources and ask questions that can't be directly looked up anyways.",
            "There's a lot of excitement about interview questions, but in the end we all know interview questions are stupid. If you can somehow get past that stage then good on you.",
            "You played the game and won. Now celebrate",
            "Nice job prepping. Enjoy your money.",
            "I don’t think looking up the questions they ask beforehand on a well known interview prep site is cheating…",
            "There's no problem with knowing the questions and answers ahead of time - back before leetcode there were interviewing books / technical books that did precisely the same thing. (Years ago, I prepped for interview questions by skimming Meyer's Effective C++ which was reliable in telling someone what to do in coding scenarios). Failing to prepare is preparing to fail.\n\nThe real question is if you are screwing yourself by taking a job that requires high competency when your own skills may be limited to memorizing leetcode, a useful yet perhaps limited skillet. \n\nHere's my take - if you can burn the candle at both ends, you'll be fine i.e. work hard during working hours and perfect your craft in the evening / weekends. If you can get a mentor at Coinbase, even better. Perfecting your craft can range from working on your own projects, learning other engineering disciplines (DevSecOps & IAC / data engineering / networking  / cloud platforms / etc.) Even if you start behind, grinding will get you ahead of your less motivated peers in no time.",
            "Don't decline. Pay it forward.\n\nOne way you did pay it forward is to write this post. So that more people know how to deal with the shitty experience that is interviewing.\n\nAnother way to pay it forward is to go ahead and refer a shit ton of people to Coinbase, mentor younger dudes/gals and help them with their career. \n\nTake the money you earn and do something good to the world. Or better yet, buy something nice for your parents, or whoever you are grateful to.\n\nDecline this and you are just another sad fuck crying in the corner with minimal impact (positive/negative) on the world and people around you.\n\nFinally, congrats!!! And remember to protect yourself, don't let this post come back and bite you in the future because people find out who wrote it.",
            "The only thing an interview is doing is trying to gauge whether you'll be good at the job.\n\nIf you accept the offer and you aren't a good fit. No big deal, you can quit or they'll just fire you.\n\nIf you accept the offer and you are a great fit because leetcode and the bullshit interviews seen all over the industry are bullshit and hardly applicable to the position. Then fabulous, who cares about some dumb interview.",
            "Fake it til you make it",
            "So you’re saying you prepped ahead of time and had a reference with some possible answers for the phone round? And you did the other ones normally? You honestly just got lucky, they could have changed that questions the first round.\n\nTake the damn job! The phone round is mostly a screener and a lot of your job is going to be using other peoples code in some form or another. Software development is not about writing new code 100% of the time. \n\nIf it’s going to eat you up, pass on it 🤷‍♀️",
            "all yours, brothar",
            "Fake it till you make it. You made it now try your best. Congrats",
            "number one rule of interviews. Dont snitch on yourself. Get the job",
            "You mean you prepared well and passed the interview? Congrats 🍾",
            "This is pretty normal,  you did interview prep and got lucky seeing a question you saw before. People buy leet code premium to get list of company tag questions to do exactly what you did but are often not lucky. I got lucky a few times and some of the time not.",
            "Just coming back to this now and well...Coinbase..",
            "you beat the system they thought would work. shows how stupid this type of interviewing can be. take the offer!",
            "Applying to coin base as we speak 🏃🏿‍♂️",
            "You’d be surprised how many people cheat on these stuff everyday. This is a rat race not for the faint hearted, do what you gotta do to get to the top",
            "FANNG is the biggest scam out there, an look how far they made it. Nothing wrong with scamming/cheating. Just don’t get caught :)",
            "Cryptocurrency is morally bankrupt anyways. Your'e doing nothing wrong",
            "What do you mean by you knew what they would ask. How did you know(just curious)",
            "I mean, unless you’re worried that you can’t do the job, just take the damn job. Even if you are worried, you should also take the job and find out whether you’re qualified or not for real.",
            "Take the offer brotha. You passed the onsite and phone so they obviously think you are qualified. I think you are qualified too no cap go get that bag and congrats on a great start to your career",
            "Don't decline. If you aren't good enough, you will be cycled out so it all works out in the end.",
            "You are showing off...\n\nI was always thinking coding test should be the best interview scheme to pick potential candidates until I did an interview with pure BQ questions. It changed my mind. BQ questions are not as bad as most people talked about. IMO, I'd even think BQ questions are slightly better than pure coding test. It may choose the engineers best for a company's culture.",
            "This post makes me sad. Cheaters make it hard for people with integrity. It's not an even playing field. I didn't expect so many sociopaths.",
            "Just take the job and stop being retarded by posting it on reddit",
            "You are totally wrong. Decline the offer and give it to another one who truly deserves it if u have morals",
            "One way to look at it is that you prepared well. 🤷🏼‍♂️ if you can do the job, congrats.",
            "It’s called preparing, not cheating. Have fun and enjoy the offer",
            "If I were you, I'd decline the offer and work somewhere more modest. - someone who got ghosted by Coinbase",
            "lol bro you have to do what you got to do to win. Don’t listen to the people that say you have to walk a straight line. Sometimes its fine to deviate from the line.",
            "I don’t get it with you guys and this wannabe goody too shoes mentality. You better take that offer",
            "Damnnnn, don’t feel guilty!!!  Maybe other people just didn’t cheat as good as youuu \n\n\nThe $140k + 50k will give you company omg \nYou can sleep with cash bills around you ahahahah",
            "Haha no one is going to tell you to not accept the offer. Take that offer and make good use of it. Sometimes you just get lucky.",
            "This isn't a movie where you are the lone man with integrity in an evil world. This is life, and you need money and a job and now you have both. \nThe company has almost certainly lied to you already about something important.",
            "It is not your fault for being well prepared.",
            "Look, i understand that you feel like you didn't earn it. But it is how it is. Get that bag and run",
            "Keep the job and pay me 10k hush money. This isn’t advice this is blackmail. You have to do it",
            "Hate game not the player",
            "No. You played the game. You can. But you probably have other things to feel bad about. This isn’t one",
            "Take the money. Great job kid.",
            "I wish I can get this offer as new grad!",
            "I’m trying to be like you. What type of projects are on your resume",
            "At this point I'd just go with it - especially since you passed the phone / on site.\n\nThere are many devs out there how just memorize LC questions and then write them down in interviews and get a job that way.",
            "I got ghosted after flunking the OA so at least you aced the OA",
            "Where did you find they’re questions?",
            "Yeah you cheated but let’s be honest how many times has someone missed out on a job they are perfectly capable of doing well because of these leetcode questions. No cheating is the way to go through life but if there was ever a forgivable situation this is it. Congrats on the offer",
            "No, why would you ever decline?? You won",
            "Anyone else have the same experience ?",
            "you shouldn’t feel bad for cheating in a system that doesn’t punish cheaters",
            "super shitpost",
            "This is how I know crypto is a sham and just hires anybody",
            "Where can I find out what those questions are.. asking for a friend of a friend (me)",
            "When did you apply by the way",
            "I cheated on my google oa, and phone call and got offer lmao",
            "Congrats, sounds like you’ll be like 100% if all developers that reuse code from stack overflow on a regular basis.\n\nGet your foot in the door, most of the time that’s all the break you need to succeed. Trust me when I say if it doesn’t work out coinbase won’t care, they’ll just fire you and move on. You’re taking the risk taking the job, not them. Make sure you prioritize saving an emergency fund, you should be able to live for 6+ months on that $. Then who cares? You worked at coinbase, that alone will open doors to more job interviews later in your career.",
            "Charge it to the streets",
            "Congrats! 👏🏾\nWe love to see it",
            "prep is part of the game",
            "None of us would be mad, dude. This is like the “would you slap your friend for $1M” joke. We’d be mad if you *didn’t* do it. Now take the W and kill it. Congratulations :)",
            "If your not cheating your not trying.",
            "Yeah you should decline the offer and tell them your cheating. Now that I told you whats the right thing to do, would you do what I said though?",
            "John wick",
            "Nice use of resources",
            "I think you should be as honest with them as possible and admit to copy pasting but also that you could have likely learned it. Just be honest.",
            "If you know what you’re doing and can do the job don’t feel bad.",
            "NO",
            "You did your research. Other candidates are doing the same.",
            "Congrats on the new job op. That’s it congrats",
            "Morally it’s your call. To *get on my high horse*, I don’t cheat, and I don’t like when others cheat.\n\nBut I get it. At the end of the day, it’s a software engineering job, not a Leetcode job. And since those OA questions were on the discuss page, anyone had the option to look the questions up. The onus is on the company to mix up their questions (like Google, for example). \n\nIn a sense you did accomplish a form of problem solving — and if you could do so without messing up — it’s all yours. \n\nNow, if you can perform the job they ask at a relatively good level, then did the company really make a mistake? The real question becomes if you can prove your salt at Coinbase. If you can, then the company legitimately does not care if you cheated on the OA’s and on-site interviews.",
            "The fact your finesse worked is inspiring to me, in the sense that anyone can get a shot, given they apply themselves by any means necessary. Thank you for sharing op.",
            "Completely made up story.",
            "umm take the job and delete this post!!",
            "You are going to be silent. That’s what is up. Delete this.",
            "Send everyone who comments on your post 1%,of your TC or else an innocent dog gets it! 😅",
            "Take it and hit my DM yo I need a job",
            "learn them now",
            "Tell them I solved all the problems for you and that they should hire me instead.",
            "When did you apply and when did you receive the OA ? Like how many days apart?",
            "How did he know what questions were going to come?",
            "Was it new grad?",
            "Coin base is a shithole company",
            "No, no need to feel about that. They probably knew already that the problems they asked leaked. Otherwise, they would’ve asked different problems everytime.\nSame for companies like Amazon, Microsoft,…",
            "I’d delete this post before deleting my account",
            "Give yourself a pat on the back",
            "Dude, you did your HW, research, and prepared. I see nothing wrong. OA is just for them to weed out applicants. Passing phone and onsite rounds without cheating means you deserve the offer. Congrats.",
            "Best part is, how did you anticipated what's gonna ask?\n\nMaybe your analytical skills are commendable, keep it. You totally worth it."
        ]
    },
    {
        "post_id": "m7fbjk",
        "author": "smellslikekeenspirit",
        "title": "I got into Personalization at Spotify 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/m7fbjk/i_got_into_personalization_at_spotify/",
        "score": 636,
        "num_comments": 82,
        "created_utc": 1616028897.0,
        "selftext": "This is a backend/data engineering internship. Just wanted to share because I was almost on my way to feeling dejected due to how tedious internship search can get. Also, I can help those with upcoming interviews!",
        "permalink": "/r/csMajors/comments/m7fbjk/i_got_into_personalization_at_spotify/",
        "comments": [
            "Congratulations!!!",
            "Dream internship :( happy for you OP!!",
            "Congratulations!! FAANG is not everything. Spotify is a great product. Top class.",
            "[deleted]",
            "Congratulations!",
            "Damn congratulations OP! I remember telling my friends last year that if I would work at any company it would be spotify, and then still haven’t heard a response since applying hahaha. So insanely amazing for you OP, all the tough work must have been worth it",
            "Big congrats! I just got rejected at the final stage of an interview today (at Bytedance). I hope I'll manage to find a great internship like you did! :)",
            "How did you prepare for the leetcode? I’m starting out not sure where to start",
            "Congratulations OP!!",
            "Yay!!!! Congratulations! All the best with the journey!",
            "As a girl just starting w cs (first year student) i feel so proud and happy🥺🥺",
            "sick, hopefully I'll see you there in a couple of years 😄!",
            "Wowwww congrats. U will do great",
            "Congrats! What was the interview process like?",
            "Congratulations OP!!! I hope you have a great time there 😊",
            "Congratulations OP!!!!!",
            "luvv to see it OP\n\ngratz",
            "Awesome man you motivate me to keep searching and grinding thank u",
            "CONGRATSS!!",
            "NICE!!!!",
            "Spotify is going to be the Netflix of music and podcasts.\n\n2025 it will be called FAANGS",
            "Congrats, Spotify is my end goal lol",
            "Can you share how you personalized your resume and what you included ? Thanks and congrats",
            "What location is the Spotify job in?\nCongrats!!",
            "Awesome job OP, I'm glad that you pushed past the rejections to get this sweet dub :)",
            "Congratualtions!!! Man this is amazing...Really wanna try for Spotify once I graduate.",
            "Congrats!!! That’s awesome!",
            "Gratz! How was the interview like?",
            "that's amazing, congrats!!! 🎉",
            "First off, congrats!\n\nSecond, they should hire you for the \"paying artists reasonably\" internship.",
            "Congrats !!",
            "That’s incredible, congrats!",
            "Congrats! Spotify is so good. Honestly people should just remove amazon and call Faang as Fangs with s as spotify.",
            "Congrats! That sounds like so much fun.",
            "The problem with working on music streaming service is that, potential users usually don’t have the drive to switch from what they’ve been using. Spotify, for example, is drastically lacking behind in terms of J-pop and C-pop. Its lyrics function is also unbelievably mediocre.",
            "Fuck Spotify and all it's data harvesting practices",
            "Sweden?",
            "[deleted]",
            "Congratulations! :)",
            "How are you liking it and is the compensation satisfactory compared to the other tech companies? Thanks!"
        ]
    },
    {
        "post_id": "1b5yqbb",
        "author": "jacobmalon21",
        "title": "My friend (23F) Makes Fun of Me (23M) Everyday",
        "url": "https://www.reddit.com/r/csMajors/comments/1b5yqbb/my_friend_23f_makes_fun_of_me_23m_everyday/",
        "score": 632,
        "num_comments": 91,
        "created_utc": 1709517100.0,
        "selftext": "My friend has been making fun of me for a long time. Even recently she said she would end friendship with me if she does an internship at a better company than me this summer. \n\nThis past week, she found out that she got SWE internship at Netflix. She also got offers from Uber, Google, Meta, and other companies. I, on the other hand, was luck enough to get a somewhat decent internship from Apple. Now she is constantly making fun of me because her hourly pay is more than mine ($63/hr vs $50/hr). She said that she can give me one of her offers (higher hourly rate than mine obviously) to make sure I can keep up with her. She also said that, if we dated, she would be the man of the relationship since she brings more bread to the table (although I bring Apple).\n\nEvery other guy (5) at school is trying to be her friend. Each of those guys got an internship at Citadel, Jump Trading, Optiver, Akuna Capital, and Radix Trading respectively. Should I just accept my failure and tell her to end the frienship? Or should I accept my punishment for being shit this recruiting season and let another guy be her friend?\n\nOh and she said she can't have her reputation be ruined by being friends with someone like me. \n\n&#x200B;",
        "permalink": "/r/csMajors/comments/1b5yqbb/my_friend_23f_makes_fun_of_me_23m_everyday/",
        "comments": [
            "Guys please read flair first",
            "The moment I read \"female friend\" I knew this was a shitpost. Average CS student has not spoken to a female in more than 3 years.",
            "She wants to peg you so bad bro",
            "Ur done buddy it’s joever no friend for u",
            "NTA just add a semicolon somewhere in the code",
            "Weird apple flex but ok",
            "She's absolutely right about you. If you are not making 500k a year at a top quant firm, don't have a CS degree from MIT, don't have a lambo and doesn't own a $10 million house, then you should just quit already. /s",
            "That’s a nice wet dream. Offers from all of those companies? Not in this economy.",
            "she is apparently in love with you",
            "🥇?",
            "Smash, next",
            "This has to be satire",
            "Bro it’s not that deep she’s clearly hitting on you. You gotta read the signs. Also you both got into FANG and are the .1% so don’t be dissatisfied at 50/hr lol",
            "u have an internship at Apple lol the pay doesn't matter it's the experience",
            "So glad I saw this was a shitpost before reading lol",
            "Hi everyone. I'm the OP's friend. I have realised how damaging my taunts have been. I'm sorry.  OP haha! You'll never be as good as me! Suck it!\n\n\n/s",
            "she's a tsundere",
            "hashmap",
            "This is a reddit post",
            "where is \"/s\"?",
            "Aw man I think you should cry about it. Boo hoo 😢",
            "She is trying to get herself accepted. I'm sure deep down she feels like a loser. (Even if she is not aware of it). She should definitely get help from a psychologist. And yes, end the friendship, no good will come to you from someone who wants to drag you down.\n\nI understand that she sincerely wants to bring you down. If you are in a better position than her, she will get mad and try harder to bring you down. \n\nSTAY AWAY FROM HER!\n\nOoh fk it was shitpost. You trolled me nice lol",
            "What kind of problems do u have - you guys,is this sth to worry about??",
            "Just saying: r/MachineLearning is way better than this subreddit. People actually discuss good content there.",
            "Average rom com anime plot",
            "Mfs downvoting the funniest comments. I had to scroll all the way to the bottom to see the funny ones",
            "Tf … 🤣",
            "You and you're friend are showoffs...hence i believe you guys have good chemistry",
            "Why you acting like a child who's in primary school ?\n\nGet over her and get some new friends...\n\nOr \n\nLearn to roast someone who roast you in friend circle.",
            "She seems like a sucky friend.",
            "What???? Who cares bro, if I land and internship that pays over 25 an hour I’m happy. I make 25 now and don’t work in tech, it’s all about breaking in!",
            "omg 😭 I was wondering who tf is getting so many job offers at once 😭",
            "Sorry mate what is a female?",
            "I think she’s a tranny dude",
            "Just hit the gym, pretend you don't give a shit and she'll throw her body at you. I did this the other day and it's working fine so far.",
            "You don’t need enemies when you assume such people as your friends and you are responsible for your suffering just bcoz someone has and is a cun* cannot downgrade you … I would have smashed the shit out of her by now …. Fuc***ng Bi***h",
            "What the fuck? Lol",
            "Please find some who respects you!",
            "Everything about this post makes me angry.",
            "Just tell her she’s the diversity hire, that’ll make things even and then tell her you don’t know if you can be friends with a diversity hire.",
            "buddy tell her to fuck off and walk away from her toxic ass.\n\nno relationship with people like that will ever be healthy or positive",
            "tell her she's a woman and any idiot could get those positions if they were a minority in a field that goes after diversity, especially gender diversity",
            "She sounds like a fucking bitch. I’d end that “friendship”.",
            "Congratulations on being a simp. Dude wake up and move on from from her , she's a parasite whom you should avoid at all cost.",
            "Me: making 20$ bucks as a student developer 😬",
            "I’ll be your friend and I’ll give you my 100$/hr  job at Nvidia",
            "You’re gonna crush it as an apple genius!",
            "God damn I just want to get any offer ",
            "Follow her home, she loves you",
            "Sounds like a plot to an anime",
            "now it's our duty to make fun of you until you realize she is not worth it. BE A GOD DAMN MAN",
            "how do you get such good internships, are you intl?",
            "Nothing good will come from this “friendship”",
            "If both parties involved aren’t Indian then I don’t know what’s happened to society",
            "Oops that's my kink",
            "Channel your inner Steve Jobs and tell her, \"Stay hungry, stay foolish... and stay away from me!\" 🍔🃏",
            "lol this was a blast back to 2015 when internships were good haha",
            "Well it’s important to accept our own reality. Yes, you should end the relationship or lie. You can have a loan to rent a Lambo and show here who rules. What could go wrong?",
            "OP has already accepted his punishment. \n\nHis post is tagged as shitpost."
        ]
    },
    {
        "post_id": "jv9swn",
        "author": "Aquill98",
        "title": "Is anyone just really freaking tired.",
        "url": "https://www.reddit.com/r/csMajors/comments/jv9swn/is_anyone_just_really_freaking_tired/",
        "score": 625,
        "num_comments": 74,
        "created_utc": 1605544317.0,
        "selftext": "Between school, work, internship/job-hunting and navigating everything through this pandemic. Does anyone just feel exhausted and depleted. Like I need just a week of just listening to music and mediating to recharge.",
        "permalink": "/r/csMajors/comments/jv9swn/is_anyone_just_really_freaking_tired/",
        "comments": [
            "Thanksgiving week is coming - do it :)",
            "I’m just exhausted from school. 0 motivation anymore. Last week I went through the five stages of grief over a CS assignment that had me questioning whether or not I should stick with CS. I’m more stressed than ever but more dedicated to this path even though I’m going to fail the assignment. I’ve waited too long to pursue CS which is really what I want to do so I can’t let one bad assignment determine my worth on this path. I need a break for sure.",
            "you literally took the words straight out of my mouth :(",
            "hi man! you got this :) praying ofr you",
            "My school cancelled fall break. Thankfully, we had ice storms that closed campus for a week so that was a nice little break.\n\nBut next semester is going to be worse. They're cancelling our spring break too which means there are no holidays at all next semester.\n\nTake some time off, though. I've been trying to grab days here and there but I've decided I'm not doing shit Thanksgiving break. I've got 1-2 more assignments to get done before that can happen but it'll be so nice.",
            "Yes I feel very tired, feels good to get it out there. \n\nWe’ll pull through. \n\nWishing you the best mate.",
            "[deleted]",
            "Got on my work computer today and typed my address instead of my password so I’m feeling it too.",
            "I don't remember the last time I was this exhausted. I feel like I'm starting to lose my damn mind. Woke up this morning and it took me almost an hour to remember my own name or even where I was.",
            "I used to think things are tough only in developing countries (m frm india) but its worldwide now. We're in this togather mate. Having 3 tests tommorow earliest at morning 6 am 😓",
            "Honestly, I feel defeated. We all have to juggle so many things at once. Work, assignments, studying, social life, job hunting/internships/ lectures. I’ve gotten to a point where I wake up and just feel instantly sad. I just want to lay in bed all day and do nothing. None of my past hobbies interest me anymore. If I’m relaxing a tiny bit I feel so stressed because I should be doing homework or studying but I just can’t anymore. I hope I can recharge during winter cause I don’t know how I’ll be able to make it another semester if I don’t.",
            "CS is literally the definition of burnout. But you got this!!!! Our hard work is all gonna pay off",
            "I have to spend like freaking 14-15 hrs every balancing this.  It's so tiring, and after going through all the LC grind, coursework and projects, etc., when you see companies don't even see your resume and keep sending those rejections. It hits hard man.",
            "If it makes you feel any better, I've been in school for four years now and I still haven't received my bachelor's. It's been a mix of living conditions, abuse, moving to a new state, family, being slow. And believe me it has taken it's toll numerous times whenever I try to pick myself up and go back to it. Honestly I don't even know why I'm trying since I'm failing at everything. Best of luck to you with your success though.",
            "Yea last weekend. I chilled, played videogames. Even though all these important, its not more important than you health.",
            "Well it's very tiring and stressful but do not give up!",
            "If it weren’t for my geneds I’d be a lot better off mentally this sem. But a full research paper (in fuckin enc 1102) and shitty physics teacher just coupled with everything has made me feel so exhausted",
            "I just feel like I want to sleep for a week straight and want to do nothing",
            "yes",
            "Yeah... I’m a new father",
            "I’ve been home since March. I was due to graduate this month.",
            "it's all a grind, working, working for someone else.",
            "Unlucky me, between battling stress, depression and sux at Math 1201. I feel exhausted and unmotivated. Withdrew from CS1101 twice and thinking of withdrawing from Math 1201 as well.",
            "Grind through the pain",
            "Feel exactly the same!",
            "same here",
            "Go ahead! You need recharge, do it.",
            "I really feel u and it is refreshing to read this kind of post out of achievement bragging posts in CS sub. U know u are not alone, job hunting has been full time job as well and it is exhausting",
            "Yeah, I am very tired. Physically burnt out",
            "Yeah. I started school and literally can’t do it. Pretty bad considering it’s online for a computer science program but I just need that personal human interaction a classroom provides. The online classes are so stagnant I couldn’t learn. I’ll wait until classrooms are back open to go back to school. I picked a shitty time to go back. No one knew the pandemic was coming though.       \nFor now I’ll just work and practice self care.",
            "deadass. i feel mentally and physically exhausted all the fckin time. esp bc i have health complications. i always think about how i’m wasting my life away doing hw / studying nonstop. why can’t professors/jobs make shit easier for us",
            "I've applied to 20 plus internships and havn't had one response., so it all feels like a waste of time. hours and hours of work. nonetheless, I have to keep applying.",
            "i have finals this week and honestly im just not feeling up to it",
            "Yup. Kinda wonder how long school thinks we can stare at our computers. I've got remote tutoring work, friends and family I can only connect to remotely, hobbies I can only do online, and then schoolwork which is done online. I'm averaging 12 hours a day on the computer according to what my mac says. Before this thing it was 4.",
            "Man, I 100% agree. It appears most of us are of similar opinion. I’m just trying to trudge along and finish strong until December. My school starts thanksgiving break literally the Wednesday night, so pretty much no break since programs take multiple days to efficiently do. For my fellow brothers and sisters, you all got this. It’s trying times for sure but in the end we will get that sweet relief of winter break!  If not only for a day or perhaps a week, we shall rest and ease our minds at  last. Lol, wishing everyone a strong ending for their semester wherever you all are and don’t forget!!!! One assignment doesn’t define your intelligence or ability to pursue Computer Science. It’s all about trying the best we can and learning what we can to keep moving forward.",
            "This is probably like 90% of this subreddit atm, mě included. Tough times",
            "Facts",
            "[deleted]",
            "I can relate",
            "Between studying, coding, projects, tutorials, internships, you can’t forget you need time to rest your brain or it’ll blow up yo",
            "Thanksgiving break (4 days, I'm unwinding). Even crazier thing is I have an interview when I come back from break so I'll have to try to focus on that also in the technical aspect at-least.  \n\n\nEDIT:\n\nJust try to keep going man, it's tough but we'll make it out the mud soon."
        ]
    },
    {
        "post_id": "qr7qql",
        "author": "owlwaves",
        "title": "Unpopular Opinion: Leetcode has lifted thousands of working-class students to middle class",
        "url": "https://www.reddit.com/r/csMajors/comments/qr7qql/unpopular_opinion_leetcode_has_lifted_thousands/",
        "score": 623,
        "num_comments": 97,
        "created_utc": 1636588403.0,
        "selftext": "I have seen so many posts on r/cscareerquestions recently about how leetcode is not the most effective way to gauge applicants' ability and thus we need a more \"fair\" system. \n\nHowever, I have to disagree. Leetcode is perhaps one of the most pro-working-class hiring system that has lifted thousands of working-class students to move up the social ladder.\n\nNo other industries (besides engineering) have given working-class applicants the opportunity in the field than the tech industry and thanks to leetcode, applicants with very little to no experience can break it into the industry. \n\nIf you think the tech industry is unfair, it is because you have not worked in different industries before. For instance, in the finance and law field, your pedigree matters which weeds out students from a working-class background. If you want to work in politics, it is near impossible to even work as an intern if you did not attend one of the top 10 universities. (That's why most politicians are rich and I have yet to find a single politician from a working-class background)\n\nHowever, because of leetcode, no matter your background, you have to go through the same trial, which gives equal opportunity to both poor and rich.\n\nSo really, IMO if you are against leetcode then you are in a way contributing to this anti-working class atmosphere.\n\nKeep Leetcode! POWER TO THE WORKING CLASS",
        "permalink": "/r/csMajors/comments/qr7qql/unpopular_opinion_leetcode_has_lifted_thousands/",
        "comments": [
            "Good argument, but the world doesn’t end at FAANG. There are tons of companies that don’t even ask leetcode questions. This sub is very biased.",
            "It has the potential to lift working-class students into the upper/middle class in the same way the SAT has potential to lift working-class students into the upper/middle class. Sure, it is possible (and there are plenty examples of it happening), but in the end we still see the privileged students being able to grind leetcode / study for the SAT simply because they can afford to do so. I agree that leetcode is a great opportunity for working-class students to get a great job after graduation, but for many of them grinding leetcode is not an option.",
            "[deleted]",
            "Being anti-leetcode is anti-working class? Holy hell that's a stretch. Being anti-leetcode is being pro-interviews that actually determine a candidate's ability to do the job and not waste their time. Leetcode is one of the worst parts about being in this industry.",
            "its oversaturated with leetcode machines",
            "It's not like leetcode is the only way to gauge a candidate's technical skills though. You could just as easily test ones knowledge of best practices and patterns/paradigms which are in actuality going to be used way more often on the job. People aren't anti-leetcode because they want to get in based on their connections, they're anti-leetcode because they want to be tested on their ability to actually develop systems rather than memorize and implement algorithms. \n\nPersonally I like leetcode but I think there's too much emphasis on it. One should keep their algo skills sharp AND ALSO work on projects that teach them how to build larger software systems.",
            "Just because LC is better than whatever criteria are used in other industries doesn't mean it's the only available tool to \"FREE THE WORKING CLASS FROM DICTATORSHIP\".\n\nAccusing people of \"anti-working class\" behavior because they think that LC sucks is fucking stupid.",
            ">things are bad in other industries so you can't critique this industry\n\neat a dick sandwich",
            "This is \"Hitler drank water\" type thinking lol",
            "I actually agree with this. Coming from a non target school leetcode has equalized the playing field in my opinion for people like me to have a shot at these high paying tech companies. I think I’ll be the first millionaire in my family just on the fact Im entering the tech industry and being smart about how I interview and navigate my tech career.",
            "Upper middle*\n\nMiddle class doesn't earn $100k+.",
            "By \"working class\" I assume you mean people who have to work to put themselves through college, meaning that not only do the people you're describing have to a). go to class and grind homework to pass classes and retain scholarships, b). have to join clubs / do side projects to beef up their resume (can't just put 'leetcodes real good' on your resume), c). actually go to work for 20+ hours at some soul-crushing job, and now d). grind hours of leetcode problems.  And that's ignoring the fact that most people aspire to have lives outside of the cycle of grinding for school/resume/money/interviews.  If I had to pick one element to remove from the cycle to make the \"working class\" CS experience better, it would absolutely be leetcode.  It's not a binary choice between leetcode and elitism, just ask a homie about shit on their resume and maybe ask how they would go about approaching a technical problem that comes up often at the job/internship they're applying for.",
            "> That's why most politicians are rich and I have yet to find a single politician from a working-class background\n\nUhh. Bernie Sanders, Bill Clinton, Harry Truman, Chuck Schumer, Rudy Giuliani, Raphael Warnock. I get what you're saying but there's a lot of politicians who didn't come from privileged backgrounds.",
            "The reality is that Leetcode will never replace quality education. I mean, sure it can help anyone to pass the data structures and basic algorithms screenings, but that's pretty much it. Try going for hardcore software engineering like distributed systems, low-level programming/firmware, compilers, graphics, AI/ML, etc. without a solid CS foundation and you are set to fail in your job.",
            "I got into tech vs. other fields because it felt like the only field that you received recognition and pay based on your abilities, not based on your clout and how much you kissed ass (I'm probably wrong in some cases). I came from a shitty school (below state level) and managed to still strike the interest of a multiple big companies.\n\nI was at an internship event for a different company that was in supply chain (I was one of the few tech kids there). I noticed every student being interviewed in marketing, finance, accounting, sales, etc all came from top schools and were all in fraternities/sororities. Me and the few other tech kids joked about it since it seemed all we had to do was prove we knew the TCP/IP stack and were familiar with Azure.",
            "To me it doesn’t make sense why companies use leetcode when they could make actually relevant interview questions, right? If I was hiring for my own CS startup I would be asking coding questions that pertain to their job and responsibilities. What’s the motivation for leetcode instead? (I actually am uneducated on this and would like to know, not just trying to push an opposing point)",
            "Just because you pass a technical question doesn’t mean they will hire you. Being good at leetcode doesn’t make you a good employee, it doesn’t make you a good coworker, and it doesn’t make you good at programming. Being good at leetcode just makes you good at leetcode. It is a good indicator but nothing else.",
            "Such a brain dead take bro. I really gotta unsub from all these compsci academia subs lol, tired of 3rd year *students* thinking they always know what’s best for the industry.",
            "If theres one thing that Leetcode doesn’t teach you, it’s maturity, and that’s very evident in this post.",
            "Leetcode is anti-working class as it puts too much emphasis on grinding problems.",
            "Wrong, if you went to a cheap college, they don’t teach dsa that well, or cover all topics, so you won’t be able to solve leetcode problems.",
            "That and Gayle McDowell writer of Cracking the coding interview, real OGz",
            "The absolute state of OP and this entire thread. Yeah the title is agreeable, but the follow-up is just someone shitting on your chest. 1/10 would ghost.",
            ">have yet to find a single politician from a working-class background\n\n[Raphael Warnock](https://en.wikipedia.org/wiki/Raphael_Warnock#Early_life_and_education)\n\n[Bill Clinton](https://en.wikipedia.org/wiki/Bill_Clinton#Early_life_and_career)\n\n[Rudy Giuliani](https://en.wikipedia.org/wiki/Rudy_Giuliani#Early_life)\n\n[Randy Bryce](https://en.wikipedia.org/wiki/Randy_Bryce)\n\nYou are right that there are few politicians from working-class backgrounds - but they do exist. \n\n>However, because of leetcode, no matter your background, you have to go through the same trial, which gives equal opportunity to both poor and rich.\n\nOn paper, yes. But you have to realize that while there ARE students from working-class backgrounds who are able to get good jobs, you do have to understand that there *isn't* an equal opportunity. Many working-class students have jobs to try to push themselves through college, especially in the US where education is a commodity and work takes a lot of time, which is more likely to detract them from grinding out leetcode unlike middle/upper class folks who can afford to do that. \n\nLeetcode is done because companies have a ton of applicants and want to reduce overhead on hiring. However, that doesn't mean that it's the best solution because a) it's NOT equal, and b) In the end you dedicate one interview to whether or not you can double-rotate-invert-breadth-first-underscore a ternary tree for an unrelated position most of the time.",
            "Agree 100%. I owe my internship to Leetcode. I just can’t believe that such a powerful site is available to everyone for free. It’s amazing when you think about. Doing a few dozen Leetcode can take you from unemployed/making low wages to making 100k. I really hope companies continue to use Leetcode because it’s easily the most reliable and fair system for assessing candidates.",
            "Who let the sociology major in?",
            "I don't understand this sub's obsession over leetcode. I have done...less than 20 leetcode problems and had no issue getting multiple FAANG offers. Just understand the problems, learn to problem solve very well, get good at communication skills, stop memorizing the solutions, and you'll do fine.  \n\n\nIf you're doing 200+ LC questions and still having issues during OAs then you need to focus on problem-solving, not the solutions.",
            "your argument is like the Gao Kao or indian Jee is a blessed exam since it lifted thousands of poor people into college.\n\nstfu\n\nleetcode isnt a selection test. its a rejection process.",
            "While I disagree that being anti-leetcode is being anti-working class. I also disagree that having a job and other responsibilities keep people from grinding leetcode. If you have the time to be on Facebook, Reddit, or YouTube, you have the time to do something that could further your career. It is a question of priorities. You either temporarily prioritize learning something, or you don't. Half a\\*\\*ing it is just hoping for the best.",
            "Didn’t know the working class wasn’t included in middle class",
            "yup",
            "Being \"pro-working-class\" isn't the same thing as being fair. We could have a system where people who come from relatively poor backgrounds get the job, no questions asked. That would be very \"pro-working-class\". It wouldn't be fair. \n\nThe basic problem with LC is that it doesn't accomplish the basic goal of any candidate selection process: selecting the best candidate for a given position. It's laziness on part of the employer. The fact that some candidates are being rewarded for said laziness isn't much of a defence for the system.",
            "This",
            "Counterpoint: it's actually tied to inequity.\n\nIt turns out it's not lifting up working class, but allowing privileged kids to hire tutors, spend thousands on boot camps to practice, etc.\n\nIt's actually more akin to the SATs, which studies have shown numerous times, are benefitted by those who can afford the time to practice. Which is why they're being dropped.\n\nPlease don't spue this, it is unequivocally a falsehood\n\nEdit: sorry, but this really is what's happening in practice whether or not you like it 🙄\n\nWe're engineers. You can have an opinion, but when real world data doesn't back that opinion you have to change it.",
            "Most of the Leetcode problems have little to no practical use cases. Anyone can prepare for a couple of months on Leetcode and clear interview. Leetcode is not the most effective way doesn’t mean that it should be scrapped. \nFrom my personal experience, I’ve seen worse performance on the job from people who got selected through slogging leetcode problems than people who don’t even know what Leetcode is.\n\nYou should change your heading from “unpopular opinion” to “idiotic brag”",
            "Leetcode is important, but should be one of many (equal important) factors. For any high tech company , I am sure the majority employees cannot even pass intern leetcode assessment. Does it mean they are not qualified for the job/work? The answer is no. \n\nIn general, leetcode is unfair game and not everyone could have time to play. Better use the time to learn more during college",
            "While the trial is the same ignoring everything some have to do to even get there is ignorant. It’s not anti working class (WTF is that even?) to point out that background does matter and will influence people being able to get somewhere. The prep involved, the time involved, the money involved, the study materials, the education even from the basic building blocks of problem solving taught in elementary school can screw someone. Tech has lifted up many but many are weeded out still. And trying to declare everyone is just ignorant on other industries if they disagree with you ridiculous.",
            "I would also argue that other paths lift people out as working class just as much, leetcode/cs is just a quicker path compared to law school and med school. Also accounting, auditing, cyber security, investment banking are other bachelors degree level jobs that have a similar outcome. While this is true I wouldn’t credit cs as the ‘One’ that magically lifted people into middle class. Everything takes work and there are other options and lucrative fields. Not saying you disagree but again I think it needs to be said that this isn’t the one be it all solution",
            "This has to do nothing with leetcode inherently- leetcode is a product of the conditions of the system that allow for this class mobility you're speaking of. These conditions are the massive demand for tech workers, where there aren't enough roles that can be filled through the prestige/nepotism you mention. \n\nHow many investment banking interns/capitol hill politician interns are needed compared to software engineering interns?\n\nIn fact, it's the well-off person who has enough time to sit on their ass all day solving leetcode problems, afford a leetcode premium subscription, etc.",
            "Here I like to draw the analogy to China's college entrance exam. Does it level the playing ground and has huge role in social mobility? Yes. Does it produce pedants and overfits people with rote memorization? Also yes. You are simply gauging the same thing through two different and often opposing perspectives that each holds merit on their own. Reiterating one side, especially the voice of which is no where near the minority, does not add ANYTHING to the existing conversation.\n\nEDIT: What the actual F is that last line.",
            "Knowledge is power , knowledge is wealth",
            "Honestly, shut the fuck up",
            "👽",
            "This",
            "Gonna preface by saying that I'm all for giving people more money and not caring so much about their background.\n\nTelling people that them thinking leetcode is unfair is just because they haven't worked in other industries is unfair. Leetcode isn't fair solely because other things were \"more\" unfair...that doesn't make any sense. This may be more fair, but it isn't perfectly fair (good luck finding anything perfectly fair). People don't stop at \"better\", people seek \"best\", and best depends on how you're looking at it, and people look at it differently.\n\nI agree with leetcode allowing people who work hard to learn to recognize patterns and communicate solutions a substantial increase in chance that they'll be able to enter this industry, this is good. There's no need to overdo it by discrediting what others say which is also valid - that's all.\n\nOh boy and that ending.",
            "If you know your code DS and algorithms and CS theory well enough, then you should know some leetcode."
        ]
    },
    {
        "post_id": "fzh63j",
        "author": "tiffanyreddit",
        "title": "I study CS at Stanford -- nobody talks about failure",
        "url": "https://www.reddit.com/r/csMajors/comments/fzh63j/i_study_cs_at_stanford_nobody_talks_about_failure/",
        "score": 622,
        "num_comments": 106,
        "created_utc": 1586635337.0,
        "selftext": "I made a [video](https://youtu.be/3UhHvHZ1Bow) being honest about how difficult the major is.\n\nI'd love to open up a discussion about your experiences with challenges/failures studying CS.",
        "permalink": "/r/csMajors/comments/fzh63j/i_study_cs_at_stanford_nobody_talks_about_failure/",
        "comments": [
            "Something I try to keep in mind is to never compare my chapter <insert #> to someone else's chapter <insert #>....often times in the beginning we tend to compare ourselves to someone who's been studying and practicing these concepts for years, then get discouraged when we fail and watch them succeed. We all fail, it's the best teacher.",
            "It’s really difficult to see people not seem to struggle while every finals season I feel like I’m going to fail every class and I seriously consider dropping out. \n\n\nMath/CS/physics seems to have a serious fetish for genius, which makes failing, not doing well, struggling etc etc all the more difficult. I have had so many classmates who don’t need to study, don’t need to take notes, can skip classes and get A+’s. And that’s ok, good for them. But it does make it hard to not be a genius. \n\n\nIt is important to talk about how the degree can make you cry. I’ve been there, and will be there a few more years. \n\n\nThank you for the video, and stay strong!",
            "I had a data structures project due the same week as 4 midterms (midterms on M/T, project due W, midterms Th/F). I submitted something that basically didn't work and cried for 30 minutes afterwards. Got a 38/80 on it and for the rest of that semester and even after it, my confidence was shot. My friends would tell me to start personal projects for my resume, but all that I could think about was how I didn't know enough to start one -- I even considered not majoring in CS anymore. What really brought my confidence back was getting coding challenges and eventually interviews for internships, and after getting my first offer in October (which I decided to take), I realized that if I could somehow land an internship with two shitty half-done Android apps listed on my resume, then I wasn't as stupid as I thought I was. \n\nThis past semester I've been getting random bursts of inspiration here and there that compel me to open up my IDE and just start coding (I made my boyfriend wait half an hour to take me out because I had an idea for a Discord bot, lol) and I've been embracing Google for learning things I don't know and even showing me code examples that I can work off of! I hope these random motivation bursts continue through the summer so I can have something substantial on my resume when I start interviewing for next summer :D",
            "I really related to this video! I think only my family knows the amount of times my CS major has made me cry. None of my classmates/friends in CS talk about this and I feel like they are all in a competition where I’m just somewhere far away pretending to get things. I’m learning that it’s ok to fail and try again and staying away from the people who ONLY  brag about their accomplishments and don’t show me their human side.",
            "Stay strong friend!  I have failed many many many times! I am not smart but I have the willingness to succeed and I believe that is what matters most in college.  Now I am six classes away from graduating.\n\nHere are a few examples of my failures.\n\nFailed classes\n\nFailed an internship interview multiple times \n\nFailed project developments.\n\nWhat I did to overcome these failures:  by quoting batman begins lol \"why do we fall Bruce?  So we can learn how to pick ourselves back up\"",
            "There's a reason CS programs are difficult to get into. They're even more difficult to complete.",
            "Oh, this is a great topic to discuss. My school went pass/fail for this semester AND waived grade requirements for majors (ie you can pass with any grade except an F), but I’m still struggling with my classes. I’m sitting at a 45% in Discrete Mathematics, and there’s basically no hope that I’m going to be able to pull that up. I’ve been beating myself up about it.\n\nI’m at a public school and the majority of my fellow students just seem so amazing—they’re ahead on projects, watching lectures on time, doing all their homework, etc. One of my friends turns in our homeworks the day they’re assigned; he spends like 3 hours, tops, where the same assignment typically takes me 5+ days. \n\nI’m only a sophomore, but I’ve been debating on if this is the major for me. But I’m already almost 30, and I don’t have the time or money to change my major all over again. \n\nIt’s depressing, but I just keep telling myself that everything will be okay if I work just a little harder.",
            "Wow!! As someone who is majoring in CS at a mid tier university, I always thought that the quality of teaching would be better at top universities and hence it would be easier. But now I know everyone struggles.\n\nPersonally, after my freshmen year, I just decided to try my best and not care about the grades. While I do strive to do the best I can in exams, I’ve come to the realization that those exams DEFINITELY don’t judge my skill. \n\nOne important thing that many people, especially the college education system needs to realize is that not everyone is capable at learning at the extremely quick pace that universities operate at. As a result, those who can’t make those connections in time struggle a lot. Until the education system changes, these struggles will continue to be there. \n\nThank you for sharing your struggles, and good luck!! You can definitely graduate and do well in life!!👍\n\nP.S. you’ve earned yourself a subscriber😁",
            "[deleted]",
            "Thank you for making this! I struggled through the major and when I didn’t pass a class, a friend at Stanford reached out and admitted she hadn’t passed a few cs classes. I was so surprised because I thought she seemed so perfect—it was very humanizing and helped inspire me to keep pursuing the major.",
            "Something I learned through my Junior year was to not compare my success to other's. Everyone is going through school at a different pace and that's okay. That doesn't mean you can't see others success as motivation.\n\n\nAlso, life is sometimes not fair even if you do everything right.",
            "Looks like everyone has that one phone call at least once in their CS journey. I'm not gonna pretend to be some macho dude, but I cried to my Dad after bombing my first CS exam. My parents never went to college while other kids came from the Bay and were programming since they were 8, it did not feel good to know that I was gonna be curved against these people lol. It can seem like you'll never catch up to some people, but remember that college is a super artificial environment and is not always a mirror that represents you accurately.",
            "fuck jake wtf",
            "Do you think that this has anything to do with the psychology of social media in our generation (carefully curated photos and stories, making people look \"perfect\" without flaws)?\n\nI think some college environments just don't address failure in a positive way. It's like social media, where you only hear about people's accomplishments and not their failed projects or lost internships. But we lose out on a lot of opportunity when we don't talk about failure. Failure is essential because it means we are pushing ourselves, but it's crucial that we are supporting each other and giving encouragement when it happens. Smart people fail and keep failing until they start to win, because they are determined to accomplish a goal. Thus, being open about our failures (and how we made them) helps everyone make better decisions and get advice from other people who have made similar failures or overcame them.",
            "Wow, huge props. In an age of social media where everyone posts only the very best versions of themselves, it was incredible to watch such a real video like this. Thank you.",
            "I haven't watched the video yet because I know I'm gonna resonate with it and become a sad sponge  \nBut hell, it's even harder being a female in CS class because you feel like you need to prove yourself even more than others. I hope you get the hang of it soon, I'll be here trying too.\n\nThanks m8",
            "Imagine all of the same stress but WITHOUT the grade inflation. \n     - the UC system",
            "[deleted]",
            "I have two questions for you??\n\n1) What are you after??  What career do you want that will be the prize when you graduate \n\n2) Did/ are you passing the class or classes.",
            "I understand the feeling, but I always try to look forward even when it sucks. Yes, comparing yourself to others whom are better isn’t often ideal, but I don’t think it can be helped. It’s a competitive field, but you should definitely keep going forward. I always compare myself to my friends and my cousin who works at fb. It makes me feel so discouraged and want to completely drop out. I try to look at it as motivation as a goal that I’ll soon reach. It’s really difficult mentally to keep up, so once in a while give yourself a break. Tell yourself you’re doing great and remember the only person you should be competing with is yourself.",
            "Discrete Math is currently eating my lunch. I may have to take it again. If I do it’ll be my only class so far that I’ll have to do that.",
            "Out of curiosity, which class did you fail the midterm in? Also, how much CS experience did you have going into college?",
            "I had the exam same phone call you did in this video during my first semester... It honestly hit me really hard as I said almost the exact same things you did about being focused and still coming up short. I'm glad you found a way to finish the week on a positive note! Times can get tough but hard work and perseverance will always lead you down the right path. Thanks for sharing!",
            "\"It is possible to commit no mistakes and still lose. That is not weakness, that is life\"\n\n-Jean Luc Picard",
            "Wow that was relatable. Subbed.",
            "I’ve never touched CS until this past summer. I was in medicine prior to the bachelors in CS that I’m now pursuing. CS is hard, but it’s not near as difficult, soul sucking, or a drain of both my time and social life as medical school was. I’m only taking 3 classes each semester while working part-time though, so that probably has a bit to do with it. If I was taking 16-17 credits I probably couldn’t handle them all being CS or math.",
            "One thing that’s been helping me get through the hard times and regain my focus is that the things that are worth doing are often difficult. Hard work pays off. Loved the video!",
            "Hmmm... haven’t heard of duck syndrome before, but it describes me pretty well honestly.\n\nGreat video, hope everything works out! :)",
            "Hey man, this shit is hard. People don’t talk about negative results as much because it’s way more exciting to talk about your accomplishments. \n\n My undergrad experience was a lot of struggling, but at some point I kind of stopped caring about results and grades, and started to actually enjoy what I was doing. I think you can do really well if you find intrinsic motivation, and the field is broad enough that I’m sure most people can find something they love, or at least really vibe with. It doesn’t have to be hardcore theory, I mean you might be really good at design or UI/UX. If you are, run with it!\n\nI hate to see people be unhappy because they feel like they’re stuck doing something they don’t want to do. \n\nI had this inflection point when I took compilers and rendering, where I realized that the work I was doing was actually cool, and I didn’t care what grade I’d end up with in the class because just being able to learn the material and say “I know that” was enough to leave me feeling satisfied and accomplished.",
            "Damn this was a good video , did u end up passing the final? If u did can u share what you did differently?",
            "I read the description to your video. Seems like duck syndrome is the norm at Stanford (matches up to a comment I saw about Stanford under MIT Confessions on FB). You need to act like your chill, even when you're struggling to stay afloat. At my uni, everyone complains, but somehow you need to be able to prosper. CS is difficult, no shit, I'm technically an ECE major, it's also heccin hard. I have fucked up many a prelim during a few of my spring semesters at my uni. Had one semester with 3 C's on my transcript.  But it's okay. We all reach our goals at different paces, but there will always be a way. Good luck!",
            "Great video. I'm a rower as well btw! I enjoyed your vlog on Stanford Lightweight Rowing.\n\n #LightweightsRiseUp",
            "Yeah, I feel that. I was coding years before college, and my degree plan is still kicking my ass. Biggest pain in my ass right now is being required to learn x86 Intel Assembly. My professor doesn’t know how to teach online (which we’ve been forced into), and all the content feels tedious, especially when we’re forced to just recreate things we could do in C, but worse. It’s hard to find outside resources for learning it, so we’ll see how that goes. Good luck to all the other CS majors out here right now lol.",
            "tl;dr Read bolded sentences. \n\nNot sure what year of school you're in, I think you mentioned the failed midterm was your first midterm but maybe I misinterpreted that. Anyways, you're right; CS is a difficult major but don't ever think that you need to switch majors. **In my opinion, if CS is the degree you want more than any other degree, switching would be giving up. Never give up.** \n\n**Failing exams happens to all of us. You can fail midterms and hell even finals and still get A's in the classes in some cases.** I'm pretty sure most schools have curved grading scales for CS and probably other difficult majors as well. That's probably why kids still have 4.0s lol. \n\nAlso, tests and grading for CS theory courses has been a terrible experience for me. I've answered test questions with textbook definitions verbatim and had those questions marked as incorrect even though they were correct. The case for these courses is that the professors have strict grading rubrics and TAs don't want to give you points if the answer doesn't exactly match the rubric (even if it's right) because they don't want to have to explain why they gave points out to an answer that wasn't the exact rubric answer. **My point is this: your grades don't always reflect your ability or what you know.**\n\n**My advice for dealing with kids like Jake is don't.** Consider them as gone and prepare to pick up those student's responsibilities with the help of your contributing team members. This avoids conflict (which I hate), and gives you that much more experience. Also, you can be sure that your project will be how you and your contributors want it to be because you won't have to worry about crappy code from the slacker in the group. The kid will benefit with the grade, but in my opinion, **you have to ask yourself if you'd rather deal with the conflict and force a crappy teammate to work with you and give you crappy results OR get the grade you want and deserve.** \n\n**I appreciate your video.** CS is a quietly competitive field so it's nice to see a post that isn't a braggadocious success story.",
            "One thing you need to realize about all STEM subjects is that they are tough not because you are dumb, it is because you need to change your way of thinking to more abstract principles which more often than not conflict with your perception of what makes sense to your unconditioned mind.\n\nI remember my first months with programming, it was an absolute nightmare - I understood practically nothing. I even recall struggling with the notion of loops! But since then I got my CS degree which wasn’t easy and have worked for, and still am working for, some of the best tech companies as a developer.\n\nCS demands sustained determination, and when you persist long enough you realize that it’s not so bad after all. Hang in there, it’s worth it!",
            "CS is like 95% grit, pain, suffering, determination and 5% flash in the pan genius lol",
            "I tried to kill myself.\nNow I graduated.",
            "Something I also wish I’d known is there’s a limit on how many times I can repeat a course (they count W’s).  It’s just a bunch of gatekeeping garbage meant to keep power/wealth in the hands of the elite.",
            "Man! I studied languages in highschool. Got good grades and was told that I'd make be good at it in college. My smart-feeling add got tired of it and I went CS in college. My smart-feeling ass turned to complete donkey and I failed my Calculus 101 20 times(at least). In Italy you can take the classes' exams as many times as you want until you pass them. The thing is some classes block your advancement to other classes. You can take them but you cannot do the final exam until you \"unblock\" the others. Long story short, I got stuck many times. I was in my third year but I still had classes from two previous years to complete. Many time I thought that maybe I was wrong to go CS that maybe I'd be a good interpreter by now. I cried many times. Felt that I didn't belong there that I made a wrong choice and took more than I can chew. But then at some point I faced my Calculus fear. It was make it or break it. \nI got C on it but fuck! I just unblocked all other classes and exams! After Calculus I passed 4 exams in a row in 2 months! I went on that streak until my graduation day! I of course had several C,b and As but that didn't matter in the end. I made it to the end. In my thesis defense, I got the commitee's ears all for me and they listened to my 7 minutes defence. I got compliments on how good I did and the graduation committee asked my if I wanted to stay to pursue my masters while working on the continuation of my thesis. I said no because I wanted field experience.\nI spent so many days lurking in what I could not do. How others were better, how different it could've been if I studied languages. I accepted my failures and changed my point of view. A C is not a failure but a small step towards the end. Failing is ok but always learn from them.",
            "I mean why don't you just abuse TA hours? Lots of your friends probably do XD. Kids straight up turning up at hours without having even read the handout LOL. EDIT Ok you went to them in the video nice!\n\nEDIT: Watched the video saw it was about a midterm. \n\nHeres what I do to have been doing to be doing well above average for every CS class I have taken at Stanford for the past 4 years.\n\n1) Go to lectures (or watch them live in the current situation)\n\n2) Take notes on my iPad.\n\n3) That night write notes from all the days lectures aesthetically.\n\n4) Day after read aesthetic notes again.\n\n5) Rinse and repeat but also reread notes from previous lectures and highlight shit before step 3.\n\nSpaced Repetition. Spaced Repetition. Spaced Repetition.\n\nBonus: Start any assignment day it was given out.\n\nSource: Senior at Stanford.\n\nRegarding group projects in the case where nobody other than me has any experience. I basically carry them myself and assign subtasks relative to the aptitude of each of my other group members so everybody feels like they are contributing. As you have experienced even at Stanford there are people who don't try.",
            "If you think college is hard, boy do I have a surprised for you. Life is fucking harder",
            "I’ve had to withdraw from linear algebra twice. I have no idea how I’m ever going to pass that darn class ;-;",
            "One think I want to bring out is that the more early you have had exposure to CS, the easier the classes are for you. Just think about how much easier your first sem classes would be if you had taken them as a sophomore level student. Those brilliant students are not smarter than you. They just have more experience and have spent a lot more time coding and doing math than you.",
            "Thank you so much. College is hard. It's really fucking hard. I'm a sophomore right now studying computer science and Statistics. School along with jobs and money and social problems and trying to find time to do the things you love doing is So.Fucking.Hard. So thank you for putting this out there, because it's important. We'll get through this just fine. Don't worry :) Alright now I gotta finish an algorithms project lol.",
            "I'm currently at City College in San Francisco finishing up my last CS courses (before I transfer to a 4-year) while working full-time as an IT Engineer at the moment and I gotta say I totally resonate with what you mention in your video. A few months ago, I encouraged myself to be more social and vocal about these matters with my classmates in these classes because I'm sure as hell we're not the only ones feeling this type of way. I've met students who are in your shoes and my shoes but we're both here because of our drive. We've busted our asses to get to this point in our lives and it's ok if our best is not the best. Success does not have an expiration date, failure does.",
            "Oh man. @OP I am aware. \n\nA friend of mine went there. I didn’t realize that people would jump from the bell tower.\n\nStanford actually, really, truly does have a problem with expectation management and the “what else / what now” questions that can come up. \n\nDouble-whammy: make it through with a PhD from there and THEN face the also-unexpected crisis of “AAAAGGGGggghhhh ... ahhh ........... ... okay, I’m done. Now what?” Suddenly having your all-consuming work end, even if it is because you’ve passed defense, is a bewildering and strange thing to deal with.",
            "In my CS program, in nearly all core classes, the norm was failure.  Tests were designed to be so difficult that most of the class failed without a curve.  It made the geniuses really stand out, which is I guess why they did it?  It was absolutely brutal and took a long time to not feel like an absolute failure.  The only way we could tell if we were actually failing the class would be comparing grades with classmates.",
            "I couldn't get past differentials and so I switched majors from cs to something else.  Math kicked my butt.",
            "University physics made me cry. Not symbolically; literally it made me cry. There have been other times where I felt defeated, upset when I couldn’t do a programming assignment, exhausted etc. \n\nWe just need to keep pushing through. CS is not an easy degree. We got this :)",
            "Really liked your honest view!",
            "For all of my classes I gave myself a pass, “go for an A, but if you get a B that’s okay”. For some of my harder classes this modified to, “go for an A, but if I get a C that’s okay”. \n\nFor my cs classes specifically, however, I’ve given myself an additional pass to “fail”. And what I mean by this, is really to be okay with being wrong most of the time. \n\nWhen I started programming at 24 - shortly before college - I second guessed myself all the time because i was so used to learning low-skill or intuitive subjects with relative ease. I hadn’t done something this challenging before and while that was invigorating because there was so much room to grow, it was also an uphill battle that left me wondering day-in-day-out if I was cut out for it. Before going through this, I tended to like the things that took me minimal effort and that I was good at. For some reason, even struggling to do so, I liked programming. Not getting it right a way was a humbling experience because here I was before college, looking at my peers in swe roles thinking that all they did was go to school, get a cs degree, then get a swe job. Naively I thought, the degree was the ticket. Not putting in effort outside of class, Not building side projects, Not doing a bunch of LC, Not learning most of this on your own time. \n\nNow that I’m a cs student, I see that the degree alone doesn’t get you in. I must also learn on my own. I use school as a platform to boost my learning outside of school. Specifically for cs classes, I might not get the best grade, but I go in with the intention that I will practice the lessons I learn here. I don’t care as much about some paper test, unless it’s data structures or any algorithms course, as I do about getting a good understanding of how things work under the hood so I can go do it myself.",
            "I study in a fucking unranked university(due to circumstances), and I always solve MIT and Stanford exams it's not that hard (keep in mind my education is not that great)",
            "Nobody talks about failure as most people here assume people will be successful in their job hunt, not even considering people failing at actually acquiring their degree. This is implicit in the subreddits name. It assumes that you are currently a cs major. Typically if a cs major fails they switch majors.",
            "I always hate when ppl cry on camera. Like u need attention or what?",
            "Nobody cares.",
            "Jake can suck my big fat cock.",
            "I think this failure is part of your success story, I've had a lot of success in my CS career at Stanford but I've also had a lot of failures. Obviously, I am not a LinkedIn \"thought leader\" so I never talk about these things with anyone other than with my very close CS friends. Overall, its just the way life goes and your success will come with persistence even when it feels like you've failed at everything. Didnt get a CS major? Didnt get an internship? Your career could still likely be equally satisfying at the next CS person. Plus the bar for success at Stanford is so high by reinforced bias as is."
        ]
    }
]