[
    {
        "post_id": "10j04xv",
        "author": "steezy2110",
        "title": "It’s okay to not work at FAANG/HFT out of college.",
        "url": "https://www.reddit.com/r/csMajors/comments/10j04xv/its_okay_to_not_work_at_faanghft_out_of_college/",
        "score": 625,
        "num_comments": 96,
        "created_utc": 1674437030.0,
        "selftext": "Hey guys and gals. I’m a senior at a state school not known for academics. Our CS program is nothing to write home about.\n\nAfter a fun internship, I got a new grad offer at a top 50 Fortune 500 non-tech company. Fully remote, in an LCOL area. TC isn’t crazy, but my company is relatively immune to layoffs and my WLB is fantastic. \n\nIt’s not FAANG. I don’t make 200K as a new grad. But I got a job, I’m a software engineer, and I work for a great company. \n\nFor everyone panicking about “o noooooo I can’t get a 200K FAANG job in this market where 100K people have been laid off and I’m worthless and I’ll never make it bsjilsmtjfjckw,” don’t panic. Jobs and internships are definitely out there. As long as you land somewhere, you’ll be perfectly fine.\n\nFAANG will always be there, but there are other companies out there as well where you’ll still make way more than the average household in the US, even in LCOL. \n\nBe happy, don’t stress, and keep working hard. If you land a job/internship this year, you’ve got one over thousands of other students in the US.\n\nGood luck to all!",
        "permalink": "/r/csMajors/comments/10j04xv/its_okay_to_not_work_at_faanghft_out_of_college/",
        "comments": [
            "only on /r/csmajors is a positive post a shitpost and a shitpost a positive post",
            "If it comforts you at all I took a F500 non-FAANG offer and I feel like I’m being overly compensated for the amount of work I put in. I might regret saying that in 3 months, but for now it’s a pretty sweet remote gig. I can’t imagine a top tech company would function the same where I can fit in a game of COD during work hours.",
            "LOL everyone knows it's okay because FANNG aint hiring now.",
            "It's funny that getting into HFT or big tech is some sort of standard. Not everyone is going to get into big tech early, but everyone can be a software engineer or whatever in their respective tech fields. Enjoy the process; there's no rush. Everyone starts somewhere.",
            "I can't believe people on this sub have deluded themselves to the level where is has to be said. How on earth can you live such a sheltered life where you believe <100k immediately out of college is unacceptable? It's genuinely baffling.",
            "Bro, take whatever u can @ this point. The economy’s shit… have u not been seeing what’s been going on?",
            "I think if you attend a decent school where the competition is much higher, then not getting into a faang or HFT means you’re below par, which is going to be a lot of pressure and mental stress.",
            "I think the reason lots of people stress and are annoyed that they couldn’t land FAANG or HFT, is because their resume and their skills and work ethic are good enough, but life hasn’t been fair to them. It sucks seeing people you’re smarter than and work harder than get lucky with FAANG while you got unlucky with life and the economy. Lots of people work extremely hard to get their resume to where it’s at, and definitely deserve that high TC out of college. Sucks to work extremely hard all these years but get fucked and end up getting the same result as someone who never had to work that hard. So that’s why lots of people are annoyed they didn’t get what they wanted.\n\nBut yes, those people who don’t work hard or don’t have great resumes complaining about not getting FAANG are extremely annoying, and should not be complaining.",
            "The fact that this even needs to be said is funny",
            "are you fucking serious",
            "Which company?",
            "FANNG overrated. Just work at a company you like with cool people doing awesome things.",
            "ngl with all of these layoffs happening i don’t think i want to ever work at one of those FAANG companies",
            "Are most internships in this field paid? I’m new here, leaving healthcare for (hopefully) computer science but I’m sick of working for free. I had to pay tuition for a YEAR while I worked for free to get my degree.",
            "FAANG or bust.",
            "TC or GTFO and also great copium\n\nEveryone knows it's okay to not work at those companies because most of the CS majors aren't working there even in the covid boom lmao \n\nYou don't have to justify yourself by making a shitpost",
            "There are numerous businesses and industry sectors that provide profitable and gratifying job prospects. When investigating alternative career options, it's critical to take your interests, abilities, and values into account. You shouldn't feel compelled to choose a particular career path just because it's viewed as desirable or prestigious.",
            "The fact that this has to be said is worrisome. So a good number of people have this mentality? I mean yes CS-natured jobs deserve high pay but anything above 80k is good for a fresh grad.",
            "This. \n\nI didn’t get a job at a FAANG company, but, I do make good money, WFH, I can afford to live where I do + fun money, and my company is incredibly unlikely to lay people off. We are currently at no risk of laying off folks, and in general, they would cut higher up bonuses before laying people off. \n\nI don’t make 200k tc, but I still make a good base and bonus, and I’m not going to need to look for a new job. Which is honestly a much greater value at this point than a bigger TC package. \n\nThere are so many other jobs out there that pay well/have good benefits/learning opportunities outside of FAANG. While jobs at a FAANG company can set you up for success, that doesn’t mean there aren’t plenty of other good jobs outside of it. And you can always get into one of those jobs after you gain some experience :) \n\nBest of luck!",
            "these posts are so redundant",
            "“Top 50 Fortune 500” lol, the title gymnastics people will do to validate their company.  But yes people do over focus on the 200k big tech comps.  Plenty else out there.",
            "shitpost",
            "Congrats. I like the jobs which will never have layoffs..",
            "shitpost",
            "ITS MONDAYYYY",
            "Honest question: how to you know your CS program is nothing to write home about? I'm very curious what the metrics are.",
            "What's the TC, gang?",
            "I would put the \"not\" somewhere else in that title. But then, sometimes it feels like moral scruples are something only a late-careerist like me can afford.",
            "Yeah. But how do people actually think that if you don’t work at FAANG whatever other job you have isn’t good… what about companies like Boeing, Spotify etc lol",
            "I'd say don't work for a HFT unless you have a ton of industry experience in systems programming and can start churning out quality code as if you're a 3 YOE dev, otherwise you'll be chewed up and spit out.",
            "I’m a Senior Engineer I went to State College and barely held on to a 3.0 gpa. It doesn’t matter where you land. For your first three years, work your 8 hours and then spend a few hours honing your craft by reading documentation and other people’s code. Work on side projects. Work hard for 3 years and then hit the open market",
            "What is HFT again",
            "Careful.  That kind of attitude gets you downvoted with the “FAANG or bust” crowd.  ;)"
        ]
    },
    {
        "post_id": "xlrr6p",
        "author": "ItsYaBoyChipsAhoy",
        "title": "It helps to remember that people have been doing this longer than you know it existed",
        "url": "https://www.reddit.com/r/csMajors/comments/xlrr6p/it_helps_to_remember_that_people_have_been_doing/",
        "score": 626,
        "num_comments": 26,
        "created_utc": 1663921881.0,
        "selftext": "Sometimes I’ll see someone (sometimes irl, mostly online) with tons of knowledge about compilers, cracking cryptography, netsec etc and I’ll be impressed and be like dang why am I not as knowledgeable. Then I’ll see their age, and some of them have been programming longer than I was alive. A few will be my age though but it’s mostly much older people. \n\nThen I’ll see some people I’m in a class with, who have just wrote their first personal project for the first time. And I’ll be like dang how are you a senior and you haven’t done that yet. Then I’ll remember I’ve been coding for 8 years, of course I have more experience.   \n\nThe point is, we’re all on our own journeys. Comparison will happen, but it’s grounding to remember that. Just 3am thoughts",
        "permalink": "/r/csMajors/comments/xlrr6p/it_helps_to_remember_that_people_have_been_doing/",
        "comments": [
            "thx brev",
            "Comparison is the thief of joy 🤩",
            "This is me right now.. it’s my first year in CS (well going into second) and I’m a junior since I was in biomed for 2 years. I’m so behind of everyone in class, and I have an OA with a big tech company due soon. I feel like I’m gonna bomb it, and when I attended a practice session everyone who spoke solved it so fast and perfect.. I couldn’t even solve the easy",
            "Yeah I have a [blog post](https://blog.torchnyu.com/2020/10/20/the-karate-kid-is-bullshit.html) about this that compares tech skills to The Karate Kid. Basically people think that skill progression is like the movie. You get a crash course on karate from a mysterious mentor for a few months and suddenly you can win a tournament. When really it's more like you train for a bit, lose a bunch of tournaments really badly, then maybe, just maybe you start getting bronze and silver medals and then maybe if you're really good you get a gold occasionally. \n\nTranslating that to work, you can't expect to gain so much knowledge and get a job after only a few months. People work at programming for years before they get fancy jobs. Sure, some people do genuinely get big N jobs with little experience, but I don't think you should feel *bad* if you don't get it. And unless you're really working hard at programming, you won't suddenly get better than others.",
            "I know this might be just me but I have always found learning about compilers and netsec so damn complex, whereas the people who already know about these subjects were born in a generation where the breakthroughs were still happening and the underlying technology wasn't that complicated.",
            "One day it will be a baby with those credentials lol 😂",
            "This is me a lot of the time with this sub. \n\nI’m a non-traditional student. I come from a low income background. I’ve had to work throughout most of my twenties and wasn’t able to go to college right out of high school like most of the people here. But I’ve always, always wanted to learn to code. \n\nI’m 31 now and working on my degree. I feel so far behind most of the posters in here. There’s 20 year olds here getting interviews at Google, and here I am struggling through easies. \n\nI try to tell myself that a lot of people in here knew what they wanted to do long before I even thought I’d have the opportunity to do it. I’m a little behind, but that’s okay. The door’s not closed just because I’m a little slower.",
            "this is every software engineer :-)",
            "yeah fr when I see this sub or others it can feel like Im behind but I didn't start coding til college so I'm glad with how much I've accomplished in 2 years.",
            "things we tell ourselves to not feel bad"
        ]
    },
    {
        "post_id": "wcwjqn",
        "author": "onaplane55",
        "title": "How to get an internship?",
        "url": "https://www.reddit.com/r/csMajors/comments/wcwjqn/how_to_get_an_internship/",
        "score": 624,
        "num_comments": 43,
        "created_utc": 1659295182.0,
        "selftext": "Hello! I turn 10 years old in September and I’m going into 4th grade. I was wondering how I can get an internship? I read that Google and Jane Street are great places to start. I’ve only been able to solve one leetcode easy with help from my dad, but my resume has many “kid of the week” awards and my very own Hello World project. I know those companies aren’t that hard to get into but I was wondering what else I can do.",
        "permalink": "/r/csMajors/comments/wcwjqn/how_to_get_an_internship/",
        "comments": [
            "If you don’t go to a T10 Elementary school you’re out of luck",
            "Ask your teacher if you guys can have a pizza party, then ask your fellow 4th graders if they can give you a referral for a tech company. Once you've asked, make sure you all grind leetcode and finish all the hard problems within 4 hours on the website, otherwise, you won't get an internship.",
            "Honestly you’re kinda late to the party. I’m in third grade interning at Jane Street. I’ve been leetcoding since I was in the womb.",
            "Shitposts out in full force today",
            "You probably only know 1 language. You should try to do a Hello World in every language.\n\nprint(\"Hello World) Python\nconsole.log(\"Hello Word\") JavaScript and TypeScript\nWrite pvsm then sout(\"Hello World\") for Java\necho \"Hello World\" for Linux\n\nThere you go, you are an expert in 4 languages and Linux.",
            "I really love what this sub turned into holy shit",
            "I’ve never used leetcode and still clutched the interview, you’ll be fine! Just be curious and read. You should add “Kid of the week” to your award section in LinkedIn and your CV",
            "I was in kindergarten doing lectures at MIT. You literally might as well quit.",
            "There is only one answer\nGrind leetcode",
            "What's ironic is that this dude made a previous post asking if a freshman internship is important",
            "You're 10 and only in 4th grade? When I was your age, I already got 2 doctorates and an offer to be CEO of Google. I don't think you have a chance right now.",
            "You are way too late",
            "Are you talking about “sesame street”, right?",
            "Learn Lolcode, there's great demand. Get a milkshake and grind leetcode day and night. Add those \"kid of the week\" awards to your LinkedIn and Indeed profiles, you'll have a better chance at getting an interview that way. Also I recommend Cocomelon for interview preparation. Best of luck.",
            "Try tks https://www.tks.world/ or, better yet, a 100k CCO position https://www.narcity.com/toronto/candy-funhousethis-chief-candy-officer-job-pays-100k-a-year-heres-what-the-ceo-says-youll-be-doing",
            " saw the shitpost tag but wouldnt surprise me if it was a legit post also.",
            "This is either a hilarious troll, or someone living in India 🇮🇳",
            "Post your resume, anonymized, and I'll look it over",
            "Ask your teacher to help round the classroom, and train you in some coding or technical skills",
            "Just delete this sub lol",
            "Do some maths problems from 12th grade. You'll get more confident. Ask your father to work on those too.",
            "On the whole I think you're doing okay. Your resume actually reads like what your average 15 year old would be able to show, so you might want to calm your horses a bit instead of over promising. Job interviews might ask for exact details on how you solved a problem, so you should memorize the solution to that leetcode easy really well, and you better be able to tell them how exactly you went about debugging your Hello World project. Make sure the tests are running okay and that your documentation is up to scratch. Bonus points if you automatically generate the documentation from the comments in your code.\n\nAll in all you have a solid foundation, so I wouldn't be too worried. Just make sure you grind pyturtle so you can maybe do advanced things like drawing a spiral.",
            "Working on that 5 - 10 year experience requirement already I see.",
            "Make sure to master Hindi and Mandarin"
        ]
    },
    {
        "post_id": "18oldbl",
        "author": "Calculator5329",
        "title": "My 2023 Internship Search",
        "url": "https://i.redd.it/ypsp3ibv1w7c1.png",
        "score": 625,
        "num_comments": 89,
        "created_utc": 1703269247.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18oldbl/my_2023_internship_search/",
        "comments": [
            "Never back down never what?!?",
            "chop birds soft ad hoc work axiomatic nippy encourage shrill alleged\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I applied to 400 and have received only 1 interview till now. That too when i have 2 years of work experience",
            "Nice!",
            "Exactly in the same boat and ghosted after the interviews.",
            "Damn I'm sorry dude :/",
            "On the bright side your stock portfolio is up 43%",
            "What college are you at?",
            "I started a site to report companies who ghost applicants - sharing in case you want to report them: https://ghosts.fyi",
            "International?",
            "Dude, you are doing something wrong. I know it sucks to say this when most people will be saying \"I'm sorry\", but you should change your strategy.  \nBased on your comments, you don't have internship experience, and you are a senior in college.  \nI don't have internship experience as well, I'm a freshman in a community college and I managed to get an offer for 2024, and secured an offer for 2025, both in big companies, I also interviewed in 3 more good companies.   \nI applied to 100 internships, but from the time I secured the 2 offers I had only received answer from 40 companies.   \nI'm not saying this to discourage you, but I like to be frank, there has to be something wrong, because no one needs to apply to 450 jobs, even 100 felt like a lot of applications for me, and I started applying to some random stuff at some point. It's a waste of time and resources, and you probably should have been allocating those more wisely. That's probably why things are not going well with the job applications, I bet between those 450, most are random companies, old job posts, super competitive linkedin jobs, etc...   \n\n\nI wish you good luck, that you find an internship. It's not over yet, and a lot of companies are emailing me saying that they will be reviewing candidates on january-march. I saw a lot of internship job postings that opened on december. But now, before applying, make a good resume, yours is not good, if you want help with that, message me.  \nIf you end up not finding an internship, use the rest of your university semester to make a very good project, that actually challenges you, a complex system, something that impresses. Also, try to work on projects with other developers, this is recommended because it's an actual experience, way better than personal projects, and it can be through open source contribution as well. I didn't have team experience, just 2 very good personal projects, which I could elaborate very well about them, and that was what made me get the offers. From your resume I don't know if your projects are not complex enough or if you just are not elaborating well about them, and I think it's the second option.",
            "Ain’t no way you applied to 451 and only 2 interviews. Either your resume is not good or you have no good experiences",
            "My resume, for those interested: [https://imgur.com/Q5SLsqt](https://imgur.com/Q5SLsqt)",
            "If you submit 451 application in a year, so more than one a day, are you putting genuine effort into each of them or just peddling the same copy-pasted CV and personal details?",
            "inb4 im homeless and under a bridge living in a box 📦",
            "Looks like you might have to improve your resume. I would be happy to take a look at and give you a constructive feedback.",
            "Same here bros",
            "What does OA mean? I was thinking Offer Accepted but then the 5 doesn’t make any sense.",
            "I think people should also include their resumes so others can understand and possibly learn 🤷‍♂️ I think it’s be pretty cool",
            "And people still are normalizing this, we really need to ask ourselves how the f we have to be unemployed for so long and read that you have to keep going and just keep applying online.",
            "What is the software used",
            "Lol 420 lol weed lmao. Jokes aside, keep it up! You’re bound to find something eventually",
            "I’m 0-6 on application today alone … it’s been rough",
            "yet cs majors still think they can make bank when they cant even find jobs",
            "What platform is this to track applications?",
            "Hey what tool do you use to make this graph?",
            "numbers don’t add up, there’s one application left 👀",
            "Something is up here. Of course the market is bad - but this little noise for such a large amount of applications suggests poor skills or a poor resume. Don’t let the bad market cause you to believe this is normal/okay. \n\nThis isn’t at all the hammer in the already bad emotions the state of the market causes. It’s to let you know that sometimes we accept bad results if we think they are normal. \n\nMy tips are -\n\nHave LinkedIn activity so if a company views your profile they can see you discuss your projects, achievements, etc.\n\nTailor your resume. Most interviews I got were ones with tailored resumes. Move their desired language to the front of your languages list. Include new/different bullet points to highlight a skill that aligns and even change out different projects. I had multiple types of resumes (SWE, Data, IT) and each of those had multiple versions IE  for data science positions I had: data science, data engineer, and machine learning resumes.\n\nObviously make sure your resume is good IE layout, word choice, scalability, etc.\n\nCold message alumni from your school that work at a place you applied, or if there’s no alum just message someone with the same position. Now don’t just beg for a referral. Briefly introruce yourself and say you really want to work there and wanted to ask them a couple questions to prepare for an interview. If you seem genuine and personable 9/10 times they will refer you without asking."
        ]
    },
    {
        "post_id": "18f75d2",
        "author": "liquidInkRocks",
        "title": "Finally got an offer, it's WFH, pay is good, but",
        "url": "https://www.reddit.com/r/csMajors/comments/18f75d2/finally_got_an_offer_its_wfh_pay_is_good_but/",
        "score": 625,
        "num_comments": 123,
        "created_utc": 1702225463.0,
        "selftext": "It's COBOL. I don't even know what that is. I looked it up and I still don't understand what I would be doing. The company has some apps that need to be patched and some that need to be ported from JavaScript to this COBOL thing. They have all this client-side code and I am supposed to port to COBOL on a 'mainframe.' I have no idea. I thought my OOP and LeetCode experience would amount to something but this company has, like a text editor and a command-line interface and tons of this COBOL code running somewhere. I visited their home office and there are these terminals to use. I would have to learn it on my own, they will pay me full salary to learn it because no one teaches it very much any more. They seem to like me because I know some C but I don't think the C in COBOL really means the C in C, does it? \n\nDo I take this? There's no other offer on my horizon. *I have so much debt.* ",
        "permalink": "/r/csMajors/comments/18f75d2/finally_got_an_offer_its_wfh_pay_is_good_but/",
        "comments": [
            "JavaScript TO cobol holy shit\n\n![gif](giphy|D62wUmR3sX2DsZJ9t1)",
            "Playa you’ll be in for a hell of a job. I’ve seen the best of men crumble and cry like babies when facing off COBOL.",
            "If you take it and master it, you will have a job for a lifetime. All the COBOL developers are going into retirement",
            "Mainframes is good bro. Very few have the knowledge, so they won't expect you to move mountains. You can take time to learn it.\n\nI guess as you don't have any other offers you shouldn't let this go...",
            "Is this truly shitpost? Anyways,\n\nC in COBOL does not mean C. It stands for common business oriented language.\n\nSimilarly, Fortran stands for formula translation. \n\nThese are 2 old languages and the abbreviations means something, newer languages don’t really have any abbreviation (Java, Python, etc).",
            "I did Cobol ... did NOT enjoy it.  It's just too old for me.\n\nBut knowing Cobol.. there is a massive job in banking. You would set.",
            "Take it. Why do you think you can afford being picky?",
            "Well if you know one programming language, it wont take so long time to learn another. You can make it for sure.\n\nWorst case you just query copilot or GPT-4, and of course RTM.",
            "Nah, it’s not like C. Its pretty much only used for finance and administrative stuff. I’m only an intern so i can’t answer your last question, hopefully that cleared it up a bit! https://www.reddit.com/r/cobol/comments/kias9h/is_cobol_still_in_use_what_field_is_it_used_for/",
            "We going back to the 60s!",
            "COBOL is an old language, designed to be somewhat English like. It is procedural, rather than OO. Although OO COBOL exists I have never once seen it.\n\nThere is a mountain of COBOL code out there, likely more than any other language. Popular in banking and insurance in particular. You'll find that maintenance and integration will fill your days. Constantly tweaking the code to keep up with legislation and business changes.\n\nDepending on the culture you'll find the company risk averse, and yet having very little in the way of test cases. Almost everything is based on institutional knowledge, which is leaving the company rapidly. You'll have to own it and grow quickly. It won't be pretty but it is well paid. FWIW I loved the challenge.\n\nAlso every single company I know of is trying to shed this workload, so expect to be constantly being asked to do more with less and dealing with outsourcing. I was told the same thing 25 years ago and it is true and yet here I am preparing to retire in the next 5 years because I saved hard and made hay while the sun shone.",
            "DO IT! NO EXCUSES, FIGURE IT OUT. There are so many legacy systems that are still using COBOL, and their average ages of developers are in their 50s. If you can do whatever it takes to learn COBOL, you can write your own ticket/paycheck. 10-15 years from now those guys will have passed on or retired, and the companies still using COBOL won’t have any developers that can work on their systems. That’s where your value sits. \nBlue Cross Blue Shield is a big one. They’re so big that they can’t afford to refactor everything in their system to newer languages, hence why they still use COBOL. \n\nJust watch. The demand for developers who know COBOL will rise in the next 10-15 years, probably just as much as SWE has blown up over the past 5.  Our Uni had 1100 CS students (undergrad and graduate) 5 years ago, and now we’ve got well over 1200 CS undergrads and like 600 CS graduate students. If you can learn COBOL, you could very well be set✊🏼",
            "Pretty sure COBOL means you have to brink your own drinks?",
            "lol you should try stand up comedy",
            "I heard cobol is hell but now that you have the offer might as well give it a shot with the help of gpt and the Internet to learn. You can always quit later or apply to other things while you're banging your head against a wall",
            "The good side is that the company is not going to want to let you go",
            "You should take it. Is probably more fun than doing webdev anyway. Learning languages is done quickly once u get to use them 40 hours a week. Use cheat sheets and chat-gpt (also ask for source of documentation!) when starting out. You'll be fine.",
            "Homie got a job with 0 COBOL programming experience.",
            "Here’s the thing- if you can get good at it, you’re in a damn good spot for a specialized position. Sure, slightly less opportunities but less and less people are learning COBOL and many legacy mainframes will continue to be running COBOL for a while. If you don’t mind the work, might really not be too bad- just certainly will have a tougher learning curve at first.",
            "COBOL was the AI of its day, it was so simple any it was going to make programmers obsolete, and anyone could write business logic. Of course that panned out about as well as 4GLs making programmer obsolete in the early 2000s.\n\nYou'll have fun in COBOL. We forget that the things we like about languages have been around forever, and COBOL is no exception. It's not any more complex or special than anything you've written in before, and it's a  of a lot less likely to be insanely than your aversge Javascript spaghetti. Even the largest of legacy horrors is tractable a little chunk at a time.",
            "Definitely take it without a second thought. The fact that it is a rare language and niche sector of Software Dev, will make you valuable to the company and other people as you gain experience. They know you don't know COBOL, but obviously saw something in you which made them think you would be able catchup and do well - after all they are PAYING you. So if they don't doubt you, why are you doubting urself? Also, keep applying for other jobs if you don't like this one, atleast you'd be getting paid and have job security. It is a very rough market buddy - you should be proud of urself. I am proud of you! God bless.",
            "You’re about to learn some really interesting, old school, highly marketable skills. Take it! You can always do something else later if you don’t enjoy it.",
            "That sounds amazing!\n\nCobol is a dying art and if they will genuinely teach you, then you'll be making immense money as a contractor.",
            "I would take a 30k paycut to work remotely. Fuck it dude, take it. My current job has us doing bullshit in ADA. Who cares? Get the job and pay the bills and chill remotely, and look again in another year after you have experience on the resume.",
            "I have a friend with no degree making mid 6 figures because banks infrastructures run on obsolete code that no one knows anymore and everybody is to afraid to change... And changing it would cost billions.",
            "u re so funny",
            "Feels like a troll post",
            "Job security",
            "I'm working a similar job, but we use PL/1, COBOL's obscure lil bro, and REXX. You'll get used to it but be prepared to work with dinosaurs as colleagues (pretty nice though, there's a lot of knowledge you can gather in a pretty short amount of time) and feel like some sort of code archeologist when you try to resolve some bug in a 45-year-old program that nobody has touched in the past 20 years. And yeah, pay is well above average and it will only get better.\n\nYou can also be absolutely certain to find a well-paying job with this no matter how the rest of the tech sector fares.",
            "On the good side, once you learn cobol, you’ll be one of the rare devs that know cobol. If ever someone needs a cobol dev, they’ll pay a pretty penny.",
            "I used to wish I was in your position. COBOL experience is guaranteed job Security to some extent. I found a good job elsewhere otherwise I'd be all in with you",
            "COmputer Business Oriented Language iirc. One of the earliest computer languages. I'm guessing the old guy that knew cobol retired and the company didn't plan through and get someone else trained and now problems are starting to pile up.",
            "Some company just hired you to do COBOL (WFH) and you don't even know what COBOL is?  \n\n\nDamn.... I want that gig, I know AS/400, JCLs, RTS and such.",
            "So you think the letter C from the COBOL acronym is the actual C language, you interview with this company, and they offer you a job?\n\nEdit: my dumbass self didn't see the shitpost tag",
            "That’s sick as heck. Dope first job.",
            "how u got an offer but dont know how to do the job?",
            "Fake and gay",
            "You will stay with COBOL until 60.",
            "C in COBOL definitely does not mean C lmao. That said you’re in for one hell of a trip. I currently work on migrating COBOL applications to the cloud, and there’s some wild stuff out there that we take for granted with modern technology.",
            "Take it, the company sounds nice so you won't suffer until the bad market passes. And maybe you will like cobol and mainframes.ans find your calling.",
            "I would take COBOL. You can easily learn other stack online but not COBOL, and it is very in demand due to fast processing speed",
            "Hot damn dude. You could be set . . .",
            "You could become wealthy beyond your wildest dreams.  COBOL programmers are dying off like fruit-flies -- not because COBOL causes cancer (as far as we know), but because of old age.   \n Many of the core financial systems in North America run on COBOL code written in the 1960s (and most recently changed because of Y2K concerns).  On the other hand, OOP and even recursion hadn't been invented yet, so be prepared for the mindless drudgery of explaining things to a computer that's so dumb it can't grok UNIX + C.",
            "Enjoy!",
            "Is COBOL really here to stay? Are banks not moving away from it?",
            "they’re PAYING you to LEARN. you crack COBOL you are set. hard work for sure but barely anyone knows it so you will be in demand very soon.",
            "Go for it!!! keep us updated!!!",
            "if this is real, then this is the biggest rollercoaster drop type shit i have seen in my life...\n\n  \nhang on tight me boi....",
            "How in the hell did you land a job that you have no experience in? COBOL is nothing like C so buckle up i guess.",
            "????????????  \nif it is COBOL to js I would understand but \n\nJs to COBOL???\n\nThe company trying to go back to 1990s",
            "You must take the job. No doubt about it.\n\nYou have no experience. You have no better offers on the horizon. You have debt.\n\nBut I'd setup a game plan to get yourself onto a different track than COBOL within the next couple of years.",
            "You'll be rich if you can master it. The banks are built om it and everyone that wrote the shit is ready to retire",
            "Porting from JS to COBOL interesting decision you should suggest switching from IDEs to punch cards to",
            "Come On Bro, Oarsome Language. That's COBOL",
            "Genuine question, how did you get a Cobol job without knowing what it is?\n\nIt's my understanding that Cobol is an extremely niche domain nowadays with only a handful of experts that get paid big bucks to maintain...?",
            "don't take it bro, if you choose this path, then it's for life working with old boring techonlogy in the same banks,insurance,credit cards comanies   \nif you can find something with a normal programing langauge, you better find it even it will take you extra 6 months.",
            "I've been told COBOL is a secure and cushy job. Good job security because barely anyone uses it. I'm sure many others have pointed this out but it's an old, old language used only by government equipment from like the 80s I think? It's just massively deprecated and only used because those old machines are using it.",
            "Lolz. I learned COBOL on a mainframe back in the late 80’s. Madness.",
            " Taking the COBOL job could be a unique opportunity, especially if it's the only offer you have right now. It's rare to get paid to learn a new language, and COBOL skills are in demand for legacy systems. Plus, understanding older languages can give you a unique perspective in tech. If you're up for the challenge, it might be worth giving it a shot!"
        ]
    },
    {
        "post_id": "o9zx9x",
        "author": "uw-police",
        "title": "Well lads, I've peaked.",
        "url": "https://www.reddit.com/r/csMajors/comments/o9zx9x/well_lads_ive_peaked/",
        "score": 623,
        "num_comments": 18,
        "created_utc": 1624936787.0,
        "selftext": "[https://imgur.com/a/eIlX5uN](https://imgur.com/a/eIlX5uN)\n\nWhere's all the FUNGALMASS offers @???",
        "permalink": "/r/csMajors/comments/o9zx9x/well_lads_ive_peaked/",
        "comments": [
            "why it's me the FUNGALMASSQWERTYUIOP I'm sending your offers now",
            "What is FUNGALMASS?",
            "This is the way.",
            "420 next??",
            "That fucking rules.",
            "Nice one",
            "why not 69 commits too",
            "Inspect element bruh.",
            "You don’t have to do any work to get art like that, there’s scripts you can run to generate it automatically"
        ]
    },
    {
        "post_id": "1bogw4i",
        "author": "Kid_Mop",
        "title": "Job Offer(it’s not over)",
        "url": "https://www.reddit.com/r/csMajors/comments/1bogw4i/job_offerits_not_over/",
        "score": 622,
        "num_comments": 94,
        "created_utc": 1711481900.0,
        "selftext": "Just got a postgrad offer as a 3.2 GPA, with a BS in CS doing network automation for Verizon making 73k base salary. I had no internships and I’m pretty proud. It’s not over for us boys. I’m graduating this May ",
        "permalink": "/r/csMajors/comments/1bogw4i/job_offerits_not_over/",
        "comments": [
            "Congratulations!",
            "Me going on my 600th application and waking up with 10+ rejections everyday. Congratulations!!",
            "What was on your resume?",
            "Congratulations! It is a great opportunity.",
            "Nice m8",
            "Congrats!!",
            "what uni you went to? also did you do any projects outside class work?",
            "Congratulations 🥹🎉🎉🎉",
            "What kind of work goes into Network Automation? Is it SWE?",
            "Can i please dm?",
            "congrats.",
            "E muh be niiiiiiii",
            "Congrats!!\n\nWe would have been coworkers-ish, but VZ sold my company lol. \n\nI know the stack/area you’ll be working in probably/possibly, there’s a lot of room to shine if you keep working on your skills.\n\nGood luck, and ever onward, ever up!",
            "I appreciate posts like this when the average joe doesn't post nearly as often as the loud minority complaining about the market.",
            "Congratulations!!!",
            "Congrats bud, 1 yes is all you need and the rest is history!",
            "Verizon is goated fr. It was so cooked for me u til they stopped ghosting me for 6 months.",
            "Can you paste the JD in the reply?",
            "Can you describe your resume? I have applied to Verizon before as well for their internship but I got rejected. I’m a sophomore majoring in CS.",
            "Heck yeah, congrats man.",
            "UTD Student? I’m in a similar situation",
            "Congrats!! I still have a couple years left but this gives me much needed hope after all the negativity.",
            "Congratulations",
            "[deleted]",
            "Congrats! What’s the location?",
            "Congrats man",
            "Congratulations!!",
            "congrats my man! what job site did you use to get the job?",
            "I insinuated it's easier said than done to just breath, chill, whatever the comment was implying simple.",
            "Also what was the interview process?",
            "can i ask about the salary?",
            "Congrats bro !!",
            "Congratulations !",
            "Goes to show that it's 99% luck",
            "Nice. My friends who just got a help desk position also are getting 72k. Sounds like helpdesk is the way to go eventually I see helpdesk paying more than swe"
        ]
    },
    {
        "post_id": "qbfvrv",
        "author": "wuon",
        "title": "I asked my interviewer if he watched anime… and made it to the next round xD",
        "url": "https://www.reddit.com/r/csMajors/comments/qbfvrv/i_asked_my_interviewer_if_he_watched_anime_and/",
        "score": 618,
        "num_comments": 29,
        "created_utc": 1634663064.0,
        "selftext": "Ok so like yesterday the funniest thing happened. I was having a technical interview with a startup and was exhausted from doing technical interviews this season. I had been working on an open-source project called chrollo (you can see it on github [here](https://github.com/wuon/chrollo)) and basically built it over the weekend after finding a bash based version of it. In a nutshell, you can watch anime… from your CLI xD\n\nAnyways, the whole conversation happened while exchanging formalities where he had asked me what I did over the weekend. I really didn’t want to do another coding interview so I just YOLO’d it and asked if he watched anime. When he said “yes” I knew it was time to take a shot and unload my weebness.\n\nI ended up spending the next hour talking about the tool I built and demoing it to him. He seemed to really enjoy it and was interested on how I scraped the information + streamed the video. Because of our conversation, we didn’t have time for the coding problem and it just left at that.\n\nA couple hours later, I got an invitation to move on to the next round! I found it super refreshing that some companies don’t always require a coding challenge. Although showcasing a project doesn’t work for every company like the Big N, it was super cool to see my local startup moving forward with me even though I didn’t do their coding problem.\n\nWell, at least they know I watch anime...",
        "permalink": "/r/csMajors/comments/qbfvrv/i_asked_my_interviewer_if_he_watched_anime_and/",
        "comments": [
            "[deleted]",
            "you do realize that you demonstrated more technical aptitude over that conversation than would fit into a dozen leetcode mediums, right?",
            "this is pretty neat wtf",
            "you got skillzz bruh",
            "Really really cool.",
            "Hilarious, but congrat, the project is impressive.",
            "relevant dependency name [https://github.com/Wuon/chrollo/blob/6c286e610e5d456ae7444685ce113a26c74ee4d0/src/index.ts#L3](https://github.com/Wuon/chrollo/blob/6c286e610e5d456ae7444685ce113a26c74ee4d0/src/index.ts#L3)",
            "Damn, that's a really nice story.\nBtw, I can't help but notice u mentioning Nintendo at the bottom. Did u try applying to Nintendo?",
            "👽",
            "Hey, great job on the project and on the interview progress! This project is super inspiring. I wanted to ask, how did you learn all the tools necessary to build this project? And how do you know how to combine all the elements together? I'd like to build something like this from scratch and would really appreciate any input you could give. Once again, great job and hope you get through the interview process and land an offer!",
            "Awesome! Interviewers are people too, so it is always great to find someone with a shared interest. I've been able to talk about videogames and instrumental music in some of my interviews.",
            "Cool project!"
        ]
    },
    {
        "post_id": "18jw9m1",
        "author": "InTheKurry",
        "title": "Looks like we're still on a downward trend...",
        "url": "https://i.redd.it/0wf40rhw0p6c1.jpeg",
        "score": 619,
        "num_comments": 93,
        "created_utc": 1702748296.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18jw9m1/looks_like_were_still_on_a_downward_trend/",
        "comments": [
            "Able to see 2015-2020 year? Maybe we’re just going back to normal slope.",
            "Why is everything relative to Feb 2020? This seems like something where it would be pretty easy to just plot it as # job postings/ month",
            " lucky ass mfs (like my friend) who graduated in 2021-mid 2022 from a mid state school, no internships, no projects and managed to land a near 200k remote role and never got laid off",
            "damn i missed graduating 2022 by one yr",
            "As soon as I graduate, it will go below 0.",
            "This is what happens when we have both an increase in SWE supply and decrease in SWE demand.\n\n**Why SWE Supply Increased:**\n\nPeople need to realize that with high compensation comes high competition. Getting into med school is incredibly competitive because people want that doctor/surgeon pay. Well according to 2020-2023 TikTok, YouTube, Instagram, etc., CS has a higher pay, better WLB, and less barrier to entry. It's obvious why supply of SWEs is going up.\n\n**Why SWE Demand Decreased:**\n\nCompanies had lots of money during COVID years. Companies spent frivolously and overhired software engineers. Companies no longer have the same kind of money because COVID was a global phenomenon that altered the markets in a way that cannot be replicated. They can no longer afford to hire as many software engineers.\n\n**TL;DR** \\- Things aren't going to change. Lay-offs will decrease, but breaking into the field will be as hard as it is now, and it's only getting harder each year as more people graduate. CS is still an incredible valuable degree though, as there are lots of other non-SWE CS fields that are great careers.",
            "It looks like the downward trend is mostly over, actually. Looks flat.",
            "Meanwhile there are still senior devs in here, out of touch with the market, claiming just gotta “work hard” and you’ll get a job just like that.",
            "It's Joever",
            "damn, i thought the market was getting better..",
            "Damn that’s hella demotivating, I just got into computer science and was thinking of getting a degree in computer science",
            "Who’s hiring in december? Sure, job postings are going down at the end of the year but I think they’ll go back up once budgets start opening up",
            "Graduating in 6 months and could not be more terrified.",
            "cs majors when they realize they can just go outside instead of making doom posts",
            "More like going back to the norm",
            "welp Im going into CS next year. maybe things will be better (or significantly worse, but a lot can change in 4 years!)",
            "Thank gawd i just secured my offer on the last week of school ~~~ of college 💪🏿.",
            "With the Fed becoming dovish prior to the election year, I think we're going to see steady growth again starting in 2024.",
            "If you look at the very end, isn't it literally just turning upwards? Why don't you also look at trueup graph? They had it turning upwards 2 months ago",
            "Or… Indeed is in a downward trend?",
            "I'd say it simply goes back to normal levels. The world was not ready for the pandemic, so, when shit hit the fan, companies had to find a way to keep money flowing. And that solution was making everything online, which means hiring more CS people.\n\nNow that the pandemic is over, and that the required positions are already fulfilled, the number of job offers decreases, alongside the need for workers in the CS field.",
            "I think next year will continue the downward trend. More layoffs.",
            "Skills issue",
            "Bottoms in hopefully",
            "[deleted]",
            "grind harder",
            "it's because of the pandemic genius",
            "We need the lifetime",
            "0888888",
            "Eugh. Trying to get a cs degree cause it’s genuinely my passion but this is kinda demotivating. My genuine dream is to work a software dev job but seeing this shit is scary. I try to remind myself having an actual passion gives me an edge over those just in it for the money but I’m still very scared of being jobless out of college for a while",
            "That’s crazy😲"
        ]
    },
    {
        "post_id": "17k1lqn",
        "author": "evrythingsirrelevant",
        "title": "I got an offer! Here’s how I did it",
        "url": "https://www.reddit.com/r/csMajors/comments/17k1lqn/i_got_an_offer_heres_how_i_did_it/",
        "score": 619,
        "num_comments": 71,
        "created_utc": 1698694540.0,
        "selftext": "Thought I’d provide some advice in everyone’s job search, specifically Entry Level/New Grad. I’m not an expert, just saying what worked for me. \n\nI had been applying since April this year for entry level full time software engineering positions. I probably did 50+ applications per week since then. I was still in school throughout the summer and didn’t have time to leetcode. But I noticed the interviews were never like leetcode, more like CS trivia. Therefore I created a Techinical Question CS trivia study guide as well as writing down all the common Behavioral Questions and reviewing everything before each interview. Never got any offers and was getting depressed and broke.\n\nOne day I was on a date looking out at my city’s skyline at night and realized that all the company’s in all the skyscrapers did NOT post any jobs on any job board I was on. I then, immediately after the date, went on all of their company career sites and every single one had entry level software engineering jobs posted! One company happened to be the largest employer in my state and had around 5 entry level software engineer positions posted!! All of the companies were healthcare, banking, and consulting industries which is probably why they have money and time to invest in New Grads, try to aim for these industries!\n\n I couldn’t believe it and applied to all of them. 2 weeks later they gave me an offer I accepted 😊 which was one of the best days of my life tbh. Anyway, just wanted to not only share my success story but also provide some insight on other ways to job search. Sometimes the answer is right in front of you the whole time.\n\nEDIT: Just wanted to add that I accepted an offer from a healthcare company and even renegotiated my salary to a number I’m happy with! \n\nThe key takeaway I feel like is just apply to companies that don’t post to LinkedIn Jobs, Indeed, etc cause then you have A LOT LESS competition. I remember I was interviewing for a medical device company via a recruiter reaching out to me. Then they posted the job everywhere and ghosted me..\n\nIf anyone wants to know my Technical CS Trivia Questions, they were literally just basic OOP and Python questions. The behavioral questions were also just basic ones you hear all the time. Having everything written out with your answers helps ALOT when preparing. After many interviews, I simply became very good at answering them and I think the company was satisfied enough to just give me an offer almost right away without any follow up interview which is unbelievable! ",
        "permalink": "/r/csMajors/comments/17k1lqn/i_got_an_offer_heres_how_i_did_it/",
        "comments": [
            "Here are the google docs. I obviously left out my personal answers but provided some advice on how to answer them. I would just skim these before interviews. If I got asked something not on them, I added to the list after the interview and moved on.\n\n  \n[Behavioral Questions](https://docs.google.com/document/d/1jUoJXllbLk7SF9GO6BU6HtXG4xusMF7RekndhFvotfw/edit?usp=sharing)  \n[Technical Questions](https://docs.google.com/document/d/1ae7beSNLmzt77dqwdpaQAqUR_H7p3g7axKL1scxR4vA/edit?usp=sharing)",
            "Congrats 🍀🍀🍀🎉🎉🎉",
            " That's truly impressive! Congratulations! Could you kindly consider sharing the collection of your Trivia questions and the list of companies you've applied to if, by any chance, you've recorded them in an Excel spreadshee t",
            "Congrats and even more applause for sharing your tips!",
            "U willing to share the cs trivia + behavioral question doc?",
            "Congratulations! Your hard work really paid off! And thanks for linking the questions too! I’m hoping I can join you in celebrating soon.",
            "My company has been struggling to fill entry level positions for at least 5 years now. It's a great company to work for BTW. I enjoy my job. They don't push hard on the job postings either",
            "Congrats and ty for the links! I thought this was satire at first when I read “date”",
            "OP is an absolute saint for sharing such a gem",
            "Brother OP can you guide us on how to search for these companies?",
            "Let me guess epic systems",
            "Can you pls dm me the list of the companies you applied to?",
            "OP please send me an anonymized resume!!",
            "Are you going to join immediate? What holds me back from applying to entry level jobs is that they will require immediate joining, whereas I graduate in May 2024.",
            "Time to go on a rooftop date downtown now lol congratulations and great advice. Ty for sharing your docs, you’re amazing!!",
            "congratulation-。\n\nWondering how other industries be like,are their graduates reaching out,sending as many resumes as CS?a bit frustrated dude…",
            "Great post, thanks for sharing the study guide!",
            "Nice",
            "👍 Hell yeah",
            "How do you suggest finding such companies? I DM’d you too",
            "Did you have internships beforehand or because it was non tech they were more into your skills",
            "Thank you for taking the time to share your experience the great tips💕",
            "Hey could you please share how you find list of the company in specific industry?",
            "how do u know which comapanies to search for and stuff",
            "Thank you king."
        ]
    }
]