[
    {
        "post_id": "wm8efq",
        "author": "None",
        "title": "GUYS I GOT THE OFFER😭😭😭",
        "url": "https://www.reddit.com/r/csMajors/comments/wm8efq/guys_i_got_the_offer/",
        "score": 621,
        "num_comments": 32,
        "created_utc": 1660268225.0,
        "selftext": "I got an offer at my dream job and I reallly can’t believe it. If I met someone with my job 4 years ago, they would be my hero. \n\nThank you all for the knowledge, discussion, insights, and opinions. I come from a family of teachers and this sub was invaluable to me learning CS and how to navigate the tech job market. Thank you so much ❤️❤️❤️\n\n\nEdit:\n\nSorry to leave it hanging there. Job is new grad with  a sports company someone mentioned in thread. 110 base, 25 sign on,  7 bonus, and some relocation and long term stock grants to put first year TC around 140",
        "permalink": "/r/csMajors/comments/wm8efq/guys_i_got_the_offer/",
        "comments": [
            "Congrats! Give us the deets!",
            "You really gonna say this and just leave us hanging like that lol. Let's see the details. What company and what was the journey?",
            "Congratulations!! You deserve it! Nobody but you know what you went through to get it!",
            "congrats. you deserve it",
            "Gz nubnub",
            "Ser you dropped this 👑 \n\nCongratulations 🫶🏿",
            "Incredible work, incredible dedication for all these years, you’re the man. Now time to spray champagne all over your bedroom",
            "Congrats! I got offer at my dream job as well just today. I am happy for all of us who put in the hard work and are at the position where they wanted to be.",
            "Congratulations!!! Wish that for everyone here ♡",
            "Need more details 🤔 don't leave us hang here 😊",
            "Congrats, I wish one day I'll be able to work with OnlyFans like you.",
            "Congratulations! I hope it’s everything you imagine and more. How exciting!!",
            "CONGRATULATIONS BUD!!!",
            "Congratulations on your dream job buddy!! . i'm still thinking about mine :) .",
            "Congrats king 👑 time to ball out 🕴",
            "Tell the company and ur salary",
            "Great! All the best! Let us know the company too!!",
            "So proud of you! Congratulations!!!"
        ]
    },
    {
        "post_id": "uva837",
        "author": "Stunning-Tower-9175",
        "title": "*Update* A talk I wish I could have with myself 6 years ago, for those who are blowing off their career and grades",
        "url": "https://www.reddit.com/r/csMajors/comments/uva837/update_a_talk_i_wish_i_could_have_with_myself_6/",
        "score": 613,
        "num_comments": 44,
        "created_utc": 1653223445.0,
        "selftext": "[Original post](https://www.reddit.com/r/csMajors/comments/swe27f/a_talk_i_wish_i_could_have_with_myself_6_years/)\n\nJust wanted to provide a quick update that if you’re like me and you never turned things around, **it is still not too late.** Tech is such a forgiving field compared to others.\n\nI have been studying outside of work this entire year for about 10-20 hours a week. Leetcode, system design, behaviorals, mock interviews, all that jazz. \n\nI had many setbacks: a Facebook hiring freeze, a rejection from Amazon and Google.\n\nTomorrow I start my first day at Microsoft and I couldn’t be more thrilled! I found a team that seems really great to work with and I think it’s gonna be a good product for my career growth.\n\nI feel like the moral I learned here is that if and when you’re ready to change something about your life, the world is waiting for you. Considering how many great tech companies there are, if you’re willing to put in the work for a few months you **will** get in somewhere. It’s a numbers game. Be patient, work hard, and live a balanced life and you will make it.",
        "permalink": "/r/csMajors/comments/uva837/update_a_talk_i_wish_i_could_have_with_myself_6/",
        "comments": [
            "I completely wasted the past 2 summers now I am doing leetcode learning aws and system design and i got an internship for this summer",
            "I remember reading your original post and helped in way I could never imagine. After I started caring less about my GPA and started dedicating more time on learning and understanding my CS classes my GPA improved by relation. Also career fairs and putting yourself out there, got me an internship.",
            "Lol I had your original post bookmarked and been looking at it every now and then as a reminder.\n\nGlad to know there was a payoff for all the self reflection and work you did.",
            "Inspiring mate. Little behind myself for various reasons. Thanks for your willingness to be open and share your experience. Best of luck going forward.",
            "Thanks a lot for that kick in the ass OP - a dude who probably plays a little too many video games",
            "Thank you for your original post and the reminder post. This is going to help me a lot as a freshman. \n\nAlso, all the best for your new job at Microsoft and keep us updated about the job and things to know about it as well.",
            "Congratulations OP! I’m 25 and I feel like I have wasted a lot of time in my life. I remember your original post. And the line “stop wasting too much time over a doomed relationship “ hit me hard.  I’m trying to get a balanced lifestyle too! I hope I make it one day. Congratulations again buddy, you’re a real one.",
            "7 and 8 from your original post were things I definitely did not do my freshman and sophomore year and I regret it",
            "Just read your original post, excellent advice!",
            "Congrats on the new role! I remember your previous post and refer to it from time to time whenever I need a motivation boost.",
            "Damn going to be junior here. Tried bunch of other stuff that didn’t workout. Hope to kill it using this post. Thanks OP!",
            "Could you go into depth about how you prepared?",
            "Where was this when I needed it in school??",
            "Salary?",
            "Hey OP, I'm a freshmen who already did pretty much everything in your list. Just wondering, is it too late to get an internship since summer already started?",
            "An addendum I think you should consider adding to your original post is this: have fun. I think a lot of us tend to get caught up in the serious nature of getting an internship/job, classes, side projects, LC, etc. that we get burnt out or get lost in why we are majoring in CS in the first place.",
            "i needed this"
        ]
    },
    {
        "post_id": "wyf9dl",
        "author": "harrywang_fish",
        "title": "I hereby announce my retirement from this subreddit",
        "url": "https://www.reddit.com/r/csMajors/comments/wyf9dl/i_hereby_announce_my_retirement_from_this/",
        "score": 610,
        "num_comments": 81,
        "created_utc": 1661535361.0,
        "selftext": "I got a full time offer! 95k + 15% bonus in Chicago. Definitely not Faang money, but still amazing salary for new grads. Bye y'all.",
        "permalink": "/r/csMajors/comments/wyf9dl/i_hereby_announce_my_retirement_from_this/",
        "comments": [
            "Retire from Reddit and social media and get a life. You’ve earned it. Congratulations. We’ll follow you soon",
            "Congrats!",
            "30k over the average single earner income in the US and it’s only your first job out of school. Congrats and good luck!",
            "I hope to one day make this post lmao",
            "We will watch your career with great interest",
            "Do you graduate in 23?",
            "4 time world champion vibe",
            "chicago is fucking amazing, it’s imho the best city in the US when factoring in cost of living. congrats!",
            "Grats",
            "Fantastic! How big of a company would you say it is? I'm not sure why but I keep avoiding smaller companies worried they might not have modern best practices and that Id pick up bad habits but that's probably a stupid thing to worry about.",
            "Congrats!\n\nWhat do you think was the most important factor in getting this job for you?",
            "Haha it ain’t faang haha /s. \n\nAnyways congrats bruh enjoy Chicago!",
            "Congrats!",
            "Congrats!!!! Can’t wait to say the same one day hopefully soon lol",
            "Dang, that's a lot of money for chicago. Nice!",
            "you'll be living like a king with that kind of money in Chicago. congrats.",
            "Good luck",
            "Ooh awesome job!!",
            "Congratulations sir :)",
            "Bro congrats",
            "Another Chicago boi 🔥🔥🔥",
            "Congratulations man!",
            "Congrats bro! I'm Comp Engr got offered $86k + 5k sign 5% annual target bonus in Chicago OR Houston. I took houston real quick!!",
            "Omg congratulations! If you don’t mind me, can I ask you a couple questions about how the process of how you landed this job?",
            "Leetcode at all?",
            "It takes effort, commitment, sacrifice and balls to pull that off, leaving social media is no small task.. congratulations",
            "[deleted]",
            "Oof, most everything I’ve been seeing here in Illinois is like $50-70k.",
            "What company is in Chicago mind I ask? If u dont wanna say it what industry is it? Tech? Fintech?",
            "[Well... Bye.](https://www.youtube.com/watch?v=i0BTdo6qGwo)",
            "congrats!"
        ]
    },
    {
        "post_id": "okjkix",
        "author": "OneGold7",
        "title": "F I N A L L Y i got my first internship!!! I'm starting next week!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/okjkix/f_i_n_a_l_l_y_i_got_my_first_internship_im/",
        "score": 610,
        "num_comments": 41,
        "created_utc": 1626316477.0,
        "selftext": "I'm so excited. I've been applying and applying to countless internships since I started college. I was just about ready to give up. I probably would've been done applying to internships if I hadn't gotten this one after the interviews. It's a small company in my home town (also small, lol). It's close enough for me to walk to (but I don't even have to do that, with it being completely virtual now).\n\nAnd it all happened by pure chance. My dad saw the sign for the company on a walk, and aske the head of recruiting if they had any internship openings. She said they don't normally do internships, but to send my resume anyways and they'll see what they can do. So I gave him my resume, which he sent to her, one thing led to another, and here I am! My resume isn't even anything special. I only have a 3.3 GPA, no projects on my resume. Only other job was as a dishwasher for 8 months. I don't know what they liked about my resume, but hey, I'm not complaining!\n\nAlso, I'm going to be paid $25/hr! I was hoping for $20, but would've taken literally anything, so I'm really happy in terms of compensation!! I'm really hoping I do well, maybe even well enough to get a full time offer at the end! Last semester (really, the past 3 semesters, but this spring especially) has been absolute hell for me between the pandemic, isolation, depression, anxiety, all that good stuff. I was feeling completely hopeless and suicidal in May. But now things are finally looking up for me!\n\nI don't mean to brag or anything, I'm just really happy that I finally have an internship and don't have to worry as much about being able to find a job after I graduate. I just hope that someone in a similar situation to me sees this and realizes that there's still hope, even for us average people",
        "permalink": "/r/csMajors/comments/okjkix/f_i_n_a_l_l_y_i_got_my_first_internship_im/",
        "comments": [
            "Take your dad out for a lunch/dinner with your new $25/hr paycheck :) gratz and gl",
            "Holy shit, that is amazing!!! Congrats OP! People need to learn from you, not fucking youtubers who want to sell you a class for $120/month.",
            "[deleted]",
            "yay!! very excited for you, you're gonna do great :))",
            "Congratulations OP!\nsounds like your journey is just beginning, \nYou got this!",
            "Congrats! 25 per hour is amazing, is that as a SWE or another role?",
            "congrats man! happy for u fr",
            "Congrats brodie!! Work hard, good things will come from this. First experience is always the hardest.\n\nCheers!",
            "Good shit bro, congrats!! :)",
            "That’s sweetest thing happens to us, shitty students. Keep it up, wish you luck!",
            "Did it buddy congratz!!!",
            "Woah wow great ! Congratulations OP. Hoping I get something too for next summer",
            "Hell fucking yes let’s goooooooo",
            "great news man, goodluck!",
            "CONGRATULATIONS!!!!✨✨🎊🎉🎉",
            "Aye congrats! Fucking proud of you!",
            "Congrats! Are you a junior?",
            "Congrats! Is this for summer or fall? Summer is half way over so assuming fall?",
            "Congrats man!\nA piece of advise for you: work your ass off.\nDon't let that opportunity go to waste, work hard, learn stuff from people there and on your own.\nTry to think out of the box, ask questions and don't be embarrassed to keep asking until you understand, always try to think if things can be better (often people choose to do thing a certain way because they are used to it, so someone new can give new perspective).\n\nYou got your chance, work hard for it to be meaningful, or else you would have only you to blame.",
            "I have a question if you don’t mind answering. How is it possible to get the internship without any projects? Not to discount your accomplishment, but it’s kinda surprising. On the other hand, congratulations!!",
            "Hey that's always good to hear! I'm glad you found an internship and through this I can tell you're very excited/content for this new opportunity. You got this!!",
            "Waah! That's such a wholesome post dude. Wish you all the best, keep rocking!",
            "Congrats!",
            "GOOD STUFF OP!!!",
            "Congrats, now work your ass off and make the most of your experience.",
            "Well played my g, let us know how it goes.",
            "Jesus walks us through the wilderness, not around it. I’m glad you’re finally seeing the other side of your storm. You’ve got this! Best of luck with your internship and remember: everything that happens to you is just to refine and mature your faith!",
            "yo congrats, bro i'm so jealous.\n\nI accepted an internship with like 16$/h beginning in a couple months and I got to pay fucking rent and fucking be there once a week with 1h commute. FML.\n\nWhy did no one else respond to me. I applied to one other local no name company and they didn't even bother to respond. They just said they'll be looking at my applicatoin. i panicked and just accepted the company i had my first interview with.",
            "Did you have any programming experience prior college"
        ]
    },
    {
        "post_id": "1alhnay",
        "author": "Trying_Trader",
        "title": "I'm literally shaking right now. 3 years of applying and I finally get a FAANG internship. Don't give up, your shot will come!",
        "url": "https://i.redd.it/tv5hxyhx39hc1.png",
        "score": 617,
        "num_comments": 129,
        "created_utc": 1707349951.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1alhnay/im_literally_shaking_right_now_3_years_of/",
        "comments": [
            "Congrats you sexy fucker",
            "Zon",
            "Here's my resume if anyone is interested: [https://imgur.com/a/2nCKXqB](https://imgur.com/a/2nCKXqB)",
            "Congrats my husband",
            "Congrats! Top tier school? Give us some stats bro!",
            "congrats man, I say that with as much happiness for you and as much pain for me as possible ❤️",
            "Welcome to the club",
            "Congrats",
            "YOOOO",
            "I love you for posting",
            "Congrats!!!!!!",
            "It’s tough but you got it! Congrats my man! All the best!",
            "Congratulations!",
            "Congrats!",
            "Congrats",
            "you forgot TC bro",
            "Welcome to the club",
            "Congratulations, just a question how did you get the UI that tracks job applications?",
            "You dropped this, king: 👑",
            "Zon?",
            "CONGRATULATIONS!!! Delay is not denial!!",
            "Congrats man ‼️‼️ would you mind giving tips regarding your resume or dm/share it if you don’t mind ?",
            "[deleted]",
            "Any tips on how to connect with hiring managers/recruiters on LinkedIn? I feel like my LinkedIn is subpar so I haven’t tried cold messaging.",
            "US?",
            "m cvl\"",
            "woah!!! kudo's for you stamina! I'm 4.2 year's into applying still havn't really got any thing",
            "What does OA mean?",
            "What you used to do after applying to job in those \"job-applying\" years ?",
            "Why’s everyone want a FAANG job when they’re the ones constantly getting laid off",
            "I have one question if your interview went too well! then what are the chances that you will get an offer?",
            "what is OA?",
            "[deleted]",
            "how to creat this graphe",
            "Im applying for a masters\n\nDont even have 3 years to spend, im doomed arent i 💀",
            "what’s the app called that you use to keep you updated on your status? the one from your image that you posted?",
            "I get rejected every time after an OA even though I solve all of them.. what could be the reason?!!",
            "Bro congrats!!! Can you tell us about your interview prep pls",
            "How did you practice talking out loud and explaining your thoughts during technical interviews? Do you have a formula/tips for them?",
            "What app did you use to make the graph?",
            "Wow u even got to decline one that’s crazy congrats!!!!",
            "i’m going to drive into a tree now"
        ]
    },
    {
        "post_id": "15qinbc",
        "author": "WildcatLadyBoss",
        "title": "All these comments about UPS and I’m over here just 😂🙄",
        "url": "https://www.reddit.com/r/csMajors/comments/15qinbc/all_these_comments_about_ups_and_im_over_here_just/",
        "score": 615,
        "num_comments": 97,
        "created_utc": 1691982678.0,
        "selftext": "Former UPS driver here (left because of a personal injury sustained outside of work) \n\nLook, I realize there are a lot of jokes bouncing around here but for the few that think jumping into a UPS driver position is an easy breezy alternative \n\nThe job is no fricken cake walk. Drivers earn every bit of that 170k package through blood, sweat and tears. Literal blood, sweat and tears. UPSers are working 24/7 to get those packages delivered. Lifting upwards of 100 lbs at a time, managing ever changing and difficult delivery scenarios and working through any type of severe weather you can imagine. UPS does not care how cold/hot/icy/rainy/shitty it may be. You’re not going home at night until that package car is empty, and only if there’s no other drivers that need help after you finish. Drivers sacrifice a LOT of their personal time and work/life balance is virtually non existent until you reach the top tiers of seniority. Kiss your family goodbye over the holidays, you will have no time to do anything but work, eat while driving and hopefully get a little sleep at night. The job is hard on your body and it takes a really strong minded person to take this up as a career. \n\nI’m just sitting back and laughing at all the comments I see lately. A lot of people think they can handle that job given the paycheck, but I can promise you, more people tap out within the first few months than you could ever imagine .",
        "permalink": "/r/csMajors/comments/15qinbc/all_these_comments_about_ups_and_im_over_here_just/",
        "comments": [
            "I used to work at a UPS Store. \nOne of the drivers got 17 stitches on his hand \n\nlike what lucrative business are these cs people talking about",
            "[removed]",
            "My Dad works for UPS. I also laugh at people thinking they can hop into UPS easy peasy. From what my father has told me, you have to spend years working there part time getting paid only a bit more than minimum wage before you can even get offered the package car job. Even then, be prepared to physically destroy your body and have no work life balance. Many part timers refuse to even take the driver job due to how intense it is, even with that massive raise. Even then, less than half the people make it to that point with plenty quitting the part time job within the first week or even day. Also, that $170k number isn't even accurate, that number includes health care as part of the value. Actual salary is more in line with $110-120k.",
            "Software engineers whine and cry about a job having horrible work life balance if they have to work more than 45 hours a week.  They’d never make it as ups drivers lol",
            "Avg CS major would walk off shift halfway through from all the lifting and walking",
            "Wait… CS Majors who will end up sitting at a computer for 8 hours a day think being a UPS driver is an easier job? 😂",
            "No one is serious about quitting to become a UPS driver",
            "Higher UPS wages helps everyone.",
            "Reminds me of a thread of someone wanting to rage quit tech to get into accounting saying, \"I'll just get the CPA\". Yeah just pick one up at the CPA store, lol.",
            "And I thought UPS stood for Uninterruptible Power Supply.",
            "So what's the hiring loop like for UPS driver?  Do you need to memorize questions on theoretical physics for box drops?  Find a way to calculate the angle to throw a package so it lands right on the doorstep in O(n) time?",
            "Drivers make around $49 an hour. The balance of that $170k comes from including medical, dental, vision, vacation days, and retirement benefits. \n\nMy last job paid me $100k a year but they calculated it at $136k total including benefits.",
            "The equivalent of me , a former UPS driver thinking I could just quit , take some coding classes and be a SWE making 170K + just like that. Takes years of seniority and grind to get that top rate.",
            "Huge respect for delivery drivers, including and especially UPS. I don't know how all UPS workers make it through the holidays.",
            "I observe this sub because it's entertaining to see young people freak out so much about... nothing. While there are a few strongminded people here, there's a lot of people who are going to flame out doing *whatever job* they end up doing. It goes without saying they can't handle a job that is constant work, constant movement and little flexibility to live their little digital lives.",
            "It's wild.  You get paid money to do things that other people do not want to do.  Otherwise, why are you being paid?!?!\n\nIf you get six figures for something, it's going to be hard work that sucks.  Folks who love SWE work might have their blinders on, but every other person is going to complain about stress, deadlines, irate customers, heated meetings, illogical guidelines, impossible talks, angry peers, etc.  Just as the UPS driver is physically injuring themselves making deadlines and lifting packages half their weight in inclement weather.",
            "I don't get why people are pissed at UPS drivers getting paid more and not pissed at their companies not paying them enough.",
            "There’s just troll posts lmao. If they did become one they’d hate it, doesn’t look fun",
            "100% it’s not even 170k it’s 120k plus benefits and boy do you deserve it. Physical labor is the pits!\n\nIf anything you need this pay PLUS better conditions.",
            "I agree with the point of this post. I'm in Australia and working on the mines is a big thing here, you can earn 100k easily without a university degree.\n\nBut it's exhausting work and you destroy your body.",
            "Having just worked in the warehouse, I agree 🤣. Hey man, let them switch to UPS. They'll realize they will regret it on their own. Even with the benefits and seniority system, UPS has a high turnover rate for a reason",
            "My mom worked part time at UPS to put me through private grade school. She said that was one of the most intense jobs she ever had and that if I fvcked up my ways after high school that is on me, but she will still hunt me down and make me suffer.",
            "[deleted]",
            "Real",
            "I worked as a package handler in high school. Good luck going from sitting infront of a computer for 8 hours to constant movement for 8 hours.",
            "This is why you get an education...\n\nSo you can complain about your job being hard when the real tough shit is right outside. Delivery drivers and construction workers are tough mother fuckers.",
            "This is why I will only work for USPS! The &35k salary is worth it to support my country and its postal services.",
            "I worked a winter temp position and yes I couldn’t agree more",
            "Wildest was the guy on twitter confidently saying robots could deliver packages, he estimated that [UPS drivers deliver 5-10 packages an hour](https://x.com/jason/status/1688995625344618496?s=46). \n\nGenuinely fascinating how people who got rich selling intangible products have no idea how the physical world operates.",
            "this recent turn from cs to ups has been really funny for me as a a cs grad who used to to work for UPS. i worked as a delivery assistant for a summer and it was always my backup job, it was never easy work but the benefits were crazy and it was always my plan to rejoin UPS if the whole CS thing didn’t work out, now everyone’s blowing up my spot lol.",
            "And in CS you'll get 170k working from home 30 hours a week...\n\nI'll stick to cs",
            "You have to drive and carry a few boxes it’s not that deep",
            "I would like to be an iOS Dev for UPS. I would give it a SwiftUI makeover.",
            "For 170 I’ll do it",
            "The guy who post said they drink while on the job concerns me 😒",
            "Everyone likes to dramatize. UPS workers dramatize as well. \n\nI have noticed that those who complain do the least amount of work.",
            "Delivering packages is hell on the body. Wouldn't have started in tech if I never worked at a warehouse and delivering packages.",
            "[deleted]",
            "Appreciate that, but why deliver my shipment to a different address in a different zip code"
        ]
    },
    {
        "post_id": "16lqvss",
        "author": "None",
        "title": "I feel like programming has consumed my life",
        "url": "https://www.reddit.com/r/csMajors/comments/16lqvss/i_feel_like_programming_has_consumed_my_life/",
        "score": 611,
        "num_comments": 100,
        "created_utc": 1695029772.0,
        "selftext": "Today I was helping my father fix an inflatable that he suspected had a hole in it and asked me to scan every inch of it for the hole.\n\nI started at one side and kept moving my hand over every inch of the inflatable to see if I could feel the hole when it occurred to me “this is totally like a brute force approach to this problem I’m scanning through every inch to see if I could find the value of “hole”. Then I thought since this is also like a linear search where I’m iterating through every inch/value of this problem until I find the desired value = “hole”.\n\nI then started thinking if there’s a more efficient algorithm for this and considered binary search. “Maybe I should start from the middle and look at both sides to see if the desired value is in one or the other half? No that doesn’t make any sense”\n\nLater today I also typed in is x ordered or is it unordered and I started thinking to myself it would be more time efficient if I typed in “is x ordered or not?” Since that would use less chars and therefore be able to be typed faster, it would make it more time efficient and o(n) since the more characters(input size) there is the longer it takes to be completed.\n\nI’ve been studying data structures and algorignms for weeks and after I finish writing this post I’m gonna study some more. This is way cooler than partying bros 😎😔",
        "permalink": "/r/csMajors/comments/16lqvss/i_feel_like_programming_has_consumed_my_life/",
        "comments": [
            "Just like every other weekend, this is another sad case of a CS Major not finding a hole.",
            "I bet you leetcode at the gym",
            "What’s the most efficient way to shower?",
            "I wish programming consumed more of my life.",
            "The way I would approach it is by gradient descent. As you approach the hole, pushing against the inflatable becomes easier, since air can escape easier in response to applied pressure. It’s gradient descent applied to a surface (ie: the surface of the inflatable)",
            "Touch this 👇\n\n![gif](giphy|0IGRygDt5cMP2Q0Jmu)",
            "Bruh",
            "I'm gonna feel bad for these people once they get to the real world and work a job. \n\nCollege is also about fun, every engineer I talked to at my internship told me to really enjoy school because once you start working you have less freedom. \n\nExplore! You will be coding for another 50 years, you will never be 20 again and able to run, skip, climb, go join clubs, party with college friends to the same extent with the same freedom.",
            "Or you know... put it in a water bucket and see where the bubbles come from.",
            "Part of a technical college education is to breed obsessiveness. The ideal corporate worker is someone who keeps themselves up at night fixated on problems.\n\nMy last year as an EE major I literally couldn’t think about anything except electronics. \n\nIt kinda fades when graduate and find a healthy 9-5.",
            "Wait until you start thinking about lockless concurrency while you're driving around in your car.",
            "Who let you cook?",
            "Not sure if this is a troll post or not. But if you truly think this post is cool, then I suggest you go outside, touch some grass and have a new hobby. Preferably outdoor hobbies.",
            "There was a question to do binary search and count the frequency of elements but it failed every time atlast i gave up maybe you can do it",
            "I gave up reading this half way through.\n\nI just want to say, pour water over the tire. You'll see the leak.",
            "Honey the new r/csmajors copypasta dropped",
            "Well did you switch to the efficient way then? Because holding it in a tub of water will show you the hole within seconds.",
            "Honesty mind blowing that you had to study algorithms to discover that typing less is more efficient than typing more...",
            "Or you could just use water to find holes instead of going on an obnoxious rant",
            "You'll be dreaming about code and algorithms next.",
            "Couldn’t you put the inflatable in a water container and see where the air bubbles are coming from? Or is said inflatable to big",
            "👏👏👏",
            "Nobody told you that you can inflate the tire and keep it submerged in a tub?  Every hole becomes super-apparent and there's no guessing or messing about involved.",
            "The thought of doing something that will require slightly less typing is already inefficient. The time it took to think about that and choose the “shorter” one you could have just typed the first one that came to mind",
            "So…. Was there a faster way to find the hole? Don’t leave us hanging here",
            "There’s few actual responses, but yes I’ve noticed my general thought process thinking about things has changed. No, it’s not because you have no life and all you do is code (unless that’s true). Being in school and also coding outside of it, you’re naturally going to be spending 6-8+ hours a day thinking about this stuff. Patterns of thought will be changed and you should absolutely embrace them",
            "Don't worry, this is perfectly normal.",
            "I wish i had this problem.",
            "Senior SWE here. For all y’all uni students, seeing the world through programming will hinder your life and also your career. Problem solve first, programming is one of your tools but don’t be a hammer that sees everything as a nail. What makes a great engineer is knowing the tools to use.",
            "Did you find the hole?",
            "This happened to me a few times.  Mostly when I was still in Uni, but also for a few years after, when I was working.  \n\nTwo examples come to mind.  \n\nFirst one: my dad was a Uni Prof (engineering), I disappointed him and went into CS ;-).  Anyway, on Xmas when I was home, he had to mark tons of final exams.  And he asked me to sort them - I dunno why exactly.  Anyway, I was in like 2nd year CS I think, so sorting algorithms and their complexity were fresh in my mind.  I sorted them by student ID - I think i used bubble sort.\n\nThe second one, was I think 3rd year.  I had an assignment to write a Roman numeral calculator, in assembly; MC68k I believe - I know, I’m old.  I can’t remember what class it was for though. Anyway, I spent a few days just writing (and re-writing and fixing and debugging) assembly.  And for a few days afterwards, when I dreamt, I could only perform actions in my dream using assembly instructions.  Took me forever to get the elephant off the house …. :-)",
            "I used to bartend during school, and at night I’d mentally use sorting algorithms to order the credit card slips by transaction number. \n\nAlso, you could shorten that last bit even further to just “is x ordered?” 😏",
            "testing comment feature",
            "How about pump it up and hear where the air is coming out? With hearing you can check more area in once than with touching it with your hands. When you transfer it to algorithms, you get less iterations in your loop which increases the performance, but you need additional code to pump up the boat.",
            "You're beginning to believe\n\nhttps://giphy.com/gifs/HBOMax-morpheus-laurence-fishburne-at-last-YKFR0dauxYEzJA8J6U",
            "Pro Tip: Don't apply the same logic to find a hole in girl. You will save yourself some embarrassment",
            "- error hole not found\n\nsudo make hole",
            "… you think you’re efficient when you’re not. “is x ordered” is the exact same question as “is x ordered or not”…",
            "I think about traversals while I go grocery shopping",
            "There is a book on this titled: \"Algorithms to live by: The Computer Science of Human decisions\" by Brian Christian and Tom Griffiths. You should read that, you'll enjoy it.\n\nHere's the link: [https://algorithmstoliveby.com/](https://algorithmstoliveby.com/)\n\nI would say, don't think too much about \"efficiency\" though IRL unless the task is really that gruesome, you're gonna end up taking more time thinking about making it efficient than you would've if you just started working on it.\n\nUsing a word or two more or even a whole paragraph more to convey your message isn't a bad choice if the message needs to hold that much gravitas. \n\nThis is true while programming too, Try learning APL or BQN, you'll know what I mean in less than half an hour.",
            "this guy does not job.",
            "You gotta find a way to balance the rest of your life otherwise this gonna just make u absolutely miserable",
            "spray with soap water.   What's the cs equivalent?",
            "Very passionate about math, this shit is so true"
        ]
    },
    {
        "post_id": "1be2upc",
        "author": "Big_Zookeepergame711",
        "title": "Just be 3x FAANG intern before college to get a job bro",
        "url": "https://i.redd.it/cjz2ahdh26oc1.jpeg",
        "score": 608,
        "num_comments": 69,
        "created_utc": 1710364060.0,
        "selftext": "Getting High School internships might be the new norm/meta now.\n",
        "permalink": "/r/csMajors/comments/1be2upc/just_be_3x_faang_intern_before_college_to_get_a/",
        "comments": [
            "Lmfao if you don’t have internships by 7th grade, it never began",
            "I wish I knew about this in high school",
            "Next thing you know, kids gonna have to get internships before middle-school, otherwise they will become unemployed 2 decades later.",
            "My first summer job was writing software for the F-35, I finished high school with 3 internships give up now nerds",
            "Getting highschool internships has always been a good idea.",
            "Lol as a high school senior I just literally applied to this as well as the Jane Street AMP program. Is there any other companies specifically taking high school seniors?",
            "Well, high school internships aren't something new, especially for engineering. I worked for a local electronics workshop, helping with maintenence and making back in the day.",
            "Only for those who live in Redmond I think. Wanted to apply in hs, but like yeah",
            "Bro I wanted to apply but there was a location restriction",
            "The hilarious thing about this overoptimization is that it’s all geared towards your first job, because it doesn’t mean anything following that. And guess what? Nearly everyone gets the chance to interview at Google or wherever, and whoever can pass the technical rounds will get an offer. Your resume is almost meaningless once you get the onsite. \n\nI mean it sounds fun too, but let’s be real, that’s not why everyone is salivating over it.",
            "I was born with an acceptance letter",
            "Yes you gotta start'em young. Learn logic gets at bedtime\n\nhttps://computerengineeringforbabies.com/",
            "I don’t even want to aim for FAANG anymore, I just want a nice and stable WFH job",
            "Weak. You better start doing dynamic programming while half of you is still in the balls to have a chance.",
            "Step 1: live in Redmond (the global headquarters for Microsoft)\n\nStep 2: nepotism \n\nStep 3: ???\n\nStep 4: profit $$$",
            "foking crazy",
            "The military offers tons of HS internships that aren’t hard to get if you’re involved in ROTC or have any knowledge of programming.\n\nI did Naval Research Lab’s SEAP program in HS for 3 summers. Made 20 ish per hour.",
            "Lol if this was posted in India there would be 28000 applicants",
            "Why does everyone in the profile pictures of “see who Microsoft has hired for this role” look at least 32? I thought it was for HS students?",
            "I get it, you know cause it’s good for college apps as well as having business connections before you graduate but like bro it’s like I don’t want to do internships in fucking high school",
            "National Labs has a first come first serve Super Computing internship for “rising freshmen” (read high schoolers)…many other such programs go unfilled because very few people that age dare to even apply.",
            "“new”. some high schools in europe have mandatory internships as part of their curriculum since… ever.",
            "Not getting FAANG internships out of the womb? It’s joever 😩",
            "Can internationals apply? 😁",
            "They've already fucking closed the application lmao",
            "I find it more telling that the see who has done this before is all women? So like discriminatory? Microsoft is one of the biggest offenders at reverse discrimination and then putting all the workload on the white men lol",
            "Isn't that child labor???"
        ]
    },
    {
        "post_id": "18f77lf",
        "author": "RazDoStuff",
        "title": "Name and shame: Citi",
        "url": "https://www.reddit.com/r/csMajors/comments/18f77lf/name_and_shame_citi/",
        "score": 612,
        "num_comments": 34,
        "created_utc": 1702225640.0,
        "selftext": "Scheduled an interview for a week after I got the initial email. The interview was only 30 minutes long with a mix of behavioral questions, technical questions, and “logic” questions (?) I joined the call and the interviewer was 5-6 minutes late. I was a little annoyed because we only had 30 minutes to do the interview, 5 minutes wasn’t really too bad. \n\nThe guy immediately asks me if I have a GitHub, and I tell him I do it’s on my resume and just looks so visibly uninterested. We then start the behavioral part where he asks me questions and he looks so uninterested and inattentive whilst he just kept staring away from the screen towards a window. It was clear that he was just being impatient. \n\nWe start the technical portion and he is still just looking away from the camera from time to time. It was really questions surrounding OOP and general programming questions. But immediately after, we start the “logic” portion of the test. He asks me a question about probability and I am certain i have the answer right but he tells me I am wrong. I took a few seconds to think about it and then he says “Let me just answer this call and I’ll let you think about it”. This man’s answers another call WHILE we are in our interview. I can see him visibly frustrated and just talking to another person probably on Teams. I just give up on the question and just tell him that “I am not sure” as I pretty much just wanted to leave. Why do an interview if you were going to be so dismissive, uninterested, and then answer a call during an interview? The interview was so short and he still just pulled a dick move. Obviously got rejected. Didn’t want to interview again there anyways. Ridiculous.",
        "permalink": "/r/csMajors/comments/18f77lf/name_and_shame_citi/",
        "comments": [
            "it feels good seeing more and more of these name and shame posts",
            "I've also had a horrible interviewer with Citi, whenever I got asked a question he'd quickly brush it off and say you don't know okay and smirk, next question - like barely giving me any time. Besides the last time they said I passed an interview and they said they'll contact me to schedule the next, never did - 6 months later got a rejection email",
            "damn seems like ur interviewer was just horrible. i’m sorry. i personally had a pretty good experience interviewing for citi tho",
            "Seriously what’s wrong with these interviewers ? Even if you don’t want to be there , at be a decent person and focus on the interview. It’s like these dudes have a stick up their ass",
            "[deleted]",
            "I love these name and shame posts",
            "Had a bad experience with Citi as well, scheduled 2 interviews for the next day, which I wasn’t free for, asked to reschedule and got ghosted",
            "was your interviewer an old indian uncle",
            "IMO Citi has the worst tech of any bank I’ve used and this post shows a glimmer into the organizations building those systems 😩",
            "Yeah fuck Citi. Met a recruiter at an event who was interested. Instead of having me apply to a few positions and speaking to those recruiters, what they did was make an email chain with a singular recruiter for a specific position, who didn't respond to me for a month and a half (with follow ups) until finally they say the position has already closed. And the initial recruiter is now saying that most of the other positions are closed too.",
            "Better to fail out then unknowingly enter in and be underpaid and have no future lmao. Citi, like most other banks, will pay software engineers literal pennies for decades of experience. If you're going into banking, join a hedge fund. It's harder but the pay will reflect that. To put it into perspective, Citi pays like $130k/yr and like $3000 bonus if even for what would be like Super Senior Engineer 10+yr exp.",
            "Given the current market, not long after shall we see every single company’s name in name and shame",
            "good shit on naming and shaming, can’t wait to do my own post when i’m over with the recruiting process.",
            "It’s a horrible firm to work for now. Poor leadership and just micromanagement. Most people don’t even know what is happening at Citi. They just make up some work to act like they are working on most occasions. It’s a terrible firm to grow your career. Run away",
            "That sounds like a really frustrating interview experience. It's not only unprofessional for an interviewer to be distracted and disinterested, but also disrespectful to you as a candidate. Answering a call during an interview is definitely a red flag about their work culture. It's their loss, though. You deserve a company that values and respects your time and skills. Keep your head up, and good luck with your future job searches – you'll find a better fit soon!",
            "drop his name",
            "They’re slugs as well cut then some slack. poor things",
            "HR people have no idea what the cs is, let alone to be capable to pick the right candidate",
            "Sorry!!",
            "I had the same experience with Mondelēz International. freaking clowns man",
            "One of the largest banks, they probly get a ton of ppl - might explain why but still sucks. sorry",
            "Fick then",
            "Is this referring to Citibank?",
            "I would email the interviewer of his behavior, that's what my friend did and they gave him another opportunity to interview.",
            "I last interview with Citi 5 weeks ago, still waiting on a offer or rejection"
        ]
    },
    {
        "post_id": "15s5x0e",
        "author": "Comprehensive_Bet920",
        "title": "CS majors who complain about diversity have unbelievable victim complexes",
        "url": "https://www.reddit.com/r/csMajors/comments/15s5x0e/cs_majors_who_complain_about_diversity_have/",
        "score": 615,
        "num_comments": 870,
        "created_utc": 1692135450.0,
        "selftext": "CS majors complain about “diversity hiring” and programs designed to benefit underrepresented minorities like it’s going out of style. Those people, who are passing the hiring bar, are not why you aren’t getting past interviews. A large number of programs  designed to uplift minorities are generally just providing mentorship and interview prep which you can get anywhere if you look for connections. For example, your school. Things like GHC where companies attend that are looking to increase the number of women in software engineering are not getting unqualified women. They can pass the hiring bar. Some programs, like ColorStack, which are more selective, partner with companies for internships. But you have to apply to get into those. And the people who apply that aren’t in those programs aren’t being affected by the company’s partnership with a third party. Otherwise they would just reserve applications for those in the programs they partner with.\n\n Companies want to increase the number of underrepresented demographics in tech because they value diversity. When you’re lamenting about how terrible it is that these programs exist, you’re telling on yourself in a major way that you don’t care whatsoever about diversity in tech. And for people who say it should be income based, not race based, plenty of FLI programs exist for that exact reason. The goal of companies is to increase the number of certain demographics in tech because they’re historically underrepresented, and companies value diversity. Diversity in income/background is included in this (which is why these FLI programs exist). And minorities make up *such* a small number of tech applicants . They’re not “stealing” your job. \n\nAnother major complaint is that it’s unfair that minorities have access to programs designed to increase representation. But the tech sector is *still* so sparsely populated by black, Latinx, Pacific Islander people and women of any race that clearly, these programs aren’t having a monumental impact. And you’re not failing every interview you’ve gotten because some unqualified minority stole your spot.\n\nThen there’s the anecdotal stories that people like to throw out which they insist prove their point- about how their female/minority classmates are objectively worse than them and how they didn’t pass an interview or couldn’t get a job but their female/minority classmate did. To say that without having spoken to the same interviewer that you had when interviews are *so* variable is insane. You could say that about anyone. And, as a note, there is a factor of companies *wanting* diversity because diversity leads to innovation. People with different backgrounds and experiences are important to success. So when you have a severe lack of people with certain backgrounds, it makes sense you want to seek them out. \n\nIf women become over represented in tech, it would make sense to prioritize hiring. If black people become over represented in tech, it would make sense to end the programs designed to bring more in. But that’s not the case right now.\n\nAlso, a lot of you guys have horrific social skills and are likely extremely abrasive or unpleasant in the behavioral section of your interviews. Factor that in.\n\nEDIT: There is one point being brought up repeatedly which I didn’t originally address- and that is how these programs are for under represented minorities, but do not generally include Asian people. I figured that would be obvious as to why. The programs are for groups of people that are under represented in tech. Asian people are over represented. These programs are designed to get more people from groups that are not present in the tech sphere into tech. If anything, it proves that these DEI initiatives and AA are not here just for the sake of minorities, and that they are specifically designed to increase the number of under repped tech applicants. Now, an argument is also being made that it’s unfair if Asian people from overwhelmingly one ethnic background are being represented, but Asian people are still being considered as over represented despite this. That issue lies in how the US defines race and is a much deeper issue- but I wholeheartedly agree that it is an unfair categorization of way too many people.",
        "permalink": "/r/csMajors/comments/15s5x0e/cs_majors_who_complain_about_diversity_have/",
        "comments": [
            "I’m Mexican and I have yet to see another Mexican SWE. I’m assuming we’re terribly underrepresented. It does make sense though considering half of my cousins decided to become construction workers or roofers.",
            "Given the fact about half of the people on this sub think Leetcoding and FAANG is all that matters in this stage of CS, it explains the lack of social awareness.  If you can't have a casual conversation with your interviewer and connect with something, you're doing something wrong.  I connect over many of the things in my background before we get into the interview, Legend of Zelda posters, Star Fox figures, D&D minis, My piano, a shirt I'm wearing.  They're there for part of the interview to make sure you're a person, not a code monkey.  If you're blaming a diversity program, you're probably insecure enough to toss up a red flag about your own personality, not just in behavioral but also in the tech.",
            "One of the biggest issues in this field from my own experience is immigrant groups mainly hiring their own subgroup even within a country. This isn’t exclusive to any race. I’ve seen teams where the manager is a mandarin speaking Chinese person and the team is predominantly mandarin speaking employees. I’ve seen teams where the manager is an Indian who speaks telugu and most of his team speaks telugu. I’ve seen teams where the manager is Russian and most of the team is not surprisingly russian. The list could go on and on.",
            "This thread is reminding me that a lot of the world is still unconsciously racist lmao",
            "I am a woman. I got a FAANG internship in collage. I did practice interviews in the CS room 3 times a week for 3 months! I told everyone I was looking for \"training partners\". It was usually me and a TA who was happy to help. A few times other guys would come in and they would be bad at the first few and then leave. By the time interview season came around I crushed. The men my year said it was because I got a scholarship to go to Grace Hopper. A bunch literally would not work with me on projects because they said I had a unfair advantage because of my gender.Like of course no one is gunna hire you when the woman working her ass off succeeds and you act like someone else's hardwork means you are being discriminated against.",
            "Every day I’m subscribed to this sub and others I’m glad I left CS after seeing the toxicity in all my CS classes",
            "These comments are so fucked dude. The fact that my own peers will probably see me as lesser than them is starting to get to me. I'm just trying my hardest to get out of poverty. I still have to work just as hard and I also have applications in the hundreds.\n\nJust because you see a scary brown dude at your job doesn't mean I \"took yer jowbs\" it's not like they belong to you.",
            "i think the argument for economic diversity has stronger ground to stand on than racial diversity.",
            "Didn’t the Supreme Court shut down affirmative action for colleges?",
            "Somehow African Americans and Hispanics from USA are considered more diverse than Asians from Korea, China, India, Thailand, Singapore, Vietnam, Indonesia, etc. Very cool putting all people in the whole continent into one stereotypical category “Asian”. At this point, the whole diversity hiring is just self-congratulatory racism.",
            "It’s Latino/Latina, stop trying to change our language.\n\nOn top of that I’m not necessarily against the programs, but seeing the stuff some managers post on Blind and other places make it very clear that they will hire even if you’re nowhere near the level you should be and deliberately pass on competent people. Regardless of whether it’s based on race or gender.",
            "\"There are so many diversity hires!!!\"\n\nThen you look at a company and see 2 minorities in a sea of 100 white/Asian men lol. Please be fr.",
            "1) These hiring practices ensure equality of outcome at the expense of equality of opportunity, which is just morally wrong in the first place. You are sacrificing other people’s lives. Might as well enforce diversity hiring practices on the NBA because black people are over represented. Let more Mexicans and Asians in!!!\n\n2) Nobody is saying anyone is unqualified. Why is that such a common counter argument? The issue is there are way more qualified people than open positions, and having an edge just because of race shouldn’t be the answer",
            "The reason CS has less blacks/Latinos is because there is disproportionately less of those people doing tech. \n\nMaybe promote tech and give them more resources instead of give them a hiring advantage.\n\nSomething else that is discriminating are referrals. Not everyone is born with a family and friend network of valuable connections",
            "Encourage programming for young underprivileged kids. Do that and you will undoubtedly increase the diversity in cs. Giving anyone a leg up in a hiring process is the wrong way to go about it.\n\nSide note for everyone crying “racist”. It’s not racist to advocate the same standards for everyone, it’s common sense.",
            "I mostly agree but where did you get the \"companies value diversity\" from?",
            "equity is what you want. good just people want equality",
            "Kind of like the pot calling the kettle black, isn’t it? I’m confident enough in my skills that even when I have a disadvantage when it comes to “diversity” quotas, that I can still prove my merit and get a job (which happened). But it’s a bit hypocritical for you (a champion of victim complexes) and people like you to be talking about anyone else’s victim complex lol\n\nHopefully you can leave this petty sh*t behind when you get into the industry. It’s a great career and provides a great life. And no one gives af about what color your skin is. It’s all about the value you bring as a computer scientist/software engineer. Grow up.",
            "“The goal is a company is to increase the number of certain demographics in tech” \n\nNo? The goal of the company is to make profit. You get this by hiring the most competent for the job. I don’t care if they are straight, gay, male, female, white, black, Asian or Mexican. It seriously does not matter, what matters is that the best candidate for the job. \n\nAbout 4% of CS majors are black. Why the hell should a company hire 20% white, 20% Asian, 20% Hispanic, and 20% black and 20% mixed? If you do the simple math then you will have a vast majority of under qualified black people in the role. That’s not racist, that just what basic statistics would tell you if you know how to read a bell curve is and assume skill level is normally distributed. You’ll run out of all the competent black developers and be left with incompetent ones filling roles. If you’re okay with that then that’s a different argument. Company isn’t a charity hand out, it’s a business to make money.",
            "ugh what a gross thread",
            "How all the ppl complaining feel is exactly how all minorities have felt for hundreds, if not thousands, of years..\n\n“How come *they* always get chosen first? How come *they* always get priority? How come *their* word is always taken over mine? How come *they* get more opportunities and favor and respect?”",
            "I feel black pilled on this topic. Getting laid off over and over just shows me that the top priority of a business is their bottom line and will jerk off and virtue signal how not evil they are and will turn their back on you as soon as shit hits the fan. They can do all this diversity hiring all they want but I know they actually don’t give a shit.",
            "Unpopular opinion but this diversity thing is kind of a slippery slope. Should we fight for equality or equity? Merit is important but so is helping people at a disadvantage. We will never truly find that good balance.",
            "I love watching this USA shitshow from far abroad",
            "Fuck you, racist.",
            ">diversity leads to innovation\n\nDiversity in the way people think and solve problems lead to innovation. It shouldn't be attached the amount of melanin in one's skin.",
            ">And, last I checked, Black techies get paid roughly 10% less.\n\nLink? Also, a disparity in the median income between various groups =/= discrimination.",
            "What’s wrong with hiring the most competent person for the job regardless of what they look like? I genuinely don’t understand.",
            "I have definite problems with how companies IMPLEMENT diversity hiring.  In 20+ years in the field, I've always been active in hiring because I have a vested interest in who I work with.  I don't care about their gender, race, religion, age, orientation, etc.  However, at multiple fortune 500 companies, I was told to ask easier questions to women and non-whites/Indians.  One of the best engineers I worked with was never viewed as an engineer by upper management, but only as a black man.  A bonus point on their hiring numbers.  It's really disgusting how many people in this field think that the underrepresented groups just can't code.  If people didn't have those notions, we wouldn't even need diversity hiring.  All of that is to say that I agree with diversity hiring, but most companies aren't doing it in a way that is logical or helpful.",
            "These idiots simultaneously think \"companies only care about profits\" and \"companies mostly hire based on diversity\".\n\nLike no dude, A means that B is false -- they have to hire the (perceived) best if they want to make money.",
            "[removed]",
            "Do you even work in the industry? Have you ever written a single line of code in your entire life?\n\n>Also, a lot of you guys have horrific social skills and are likely extremely abrasive or unpleasant in the behavioral section of your interviews?\n\nYou say as you insult a whole bunch of complete strangers, and assume that an objection to a hiring practice which **LITERALLY** institutes racial preferences is, itself, a racist. Do you think it's opposite day?\n\nWe just got done with the Supreme Court striking down diversity policies in Colleges because they violate the 14th Amendment. Let me do you a favor and cite a quotation from the majority opinion:\n\n>Eliminating racial discrimination means eliminating all of it. Accordingly, the Court has held that the Equal Protection Clause applies\n“without regard to any differences of race, of color, or of nationality”—\nit is “universal in [its] application.”\n\nThe initiative you are endorsing *is* institutionalized bigotry. **FULL STOP**.",
            "This is just a giant rant essentially gas lighting us into believing that modern day racism is okay as long as it’s against the right groups in your mind.",
            "Dude just discovered affirmative action lmao. Which has been ruled to be unconstitutional on the grounds  of.... You guessed it. Discrimination.",
            "I feel you mean good and come from a genuine place of care for people but what you are saying boils down to - DEI hires as as qualified as anyone else and just get an extra nudge to help them get hired and people who do not like DEI hires are unpleasant, unqualified people with horrific social skills.\n\nAs someone involved in hiring/training for software engineering jobs in a Fortune 500 company all I can say it - I wish that was just so but at best you are misinformed. I'm not sure if company I am involved in is just too draconic on this DEI thing but there are certain DEI metrics/quotas that need to be met that impact your bonuses and chances of promotion on a personal level and on a regional level these metrics impact how much support your location will receive from global in terms of helping you grow / expense internal projects / pool for bonuses/training etc. So everyone tries to hit those metrics and it really does get absurd I feel at times - for people who tick our boxes we have so many funnels - special bootcamps, lower interview standards, way higher chance to higher interns for full time positions even if their performance during internship/bootcamp was not good etc. And what is the end result? Do we get the benefits of diverse backgrounds and opinions that enhance our deliveries? Maybe, but we also have a lot of people who are underperforming from those DEI funnels that fail to be independent/productive more than a year after hiring (in addition to being extremely hard to put on PIP / fire due to negative impacts on metrics), we have special positions created that really are not needed to put our DEI hires etc. We also have some great and diverse people that are exceptional developers and that would not need this lower bar for hiring and DEI quotas. The idea that the solution to people being underrepresented is to shovel unqualified candidates into positions where they are a net drain to team productivity and struggle themselves is just puzzling and does not improve the perception of those groups in the industry at all.",
            "[deleted]",
            "[deleted]",
            "Nobody likes being discriminated against, nor should they be.\n\nAlso, obvious brigading.",
            "i'm in an ultra underrepresented group in tech and hate efforts for diversity and inclusion. race shouldn't appear anywhere on an application to prevent... you guessed it! racism! and neither should gender, sexuality, whatever.\n\nif blacks aren't applying as frequently as asians and whites, it shouldn't be a surprise that you won't find many blacks in tech. if asians and whites consistently outperform other groups in these hard sciences, it shouldn't be a surprise they dominate the workforce.\n\nback in highscool, i watched most of my asian friends with perfect ACTs, literal dozens of AP classes, and loads of extracurriculars get rejected from top schools over a few objectively underqualified students... just because they were POC.\n\nif you think that's a victim complex, you're genuinely retarded.\n\nwe have the data. schools have been admitting students from different races on different metrics. and the same is happening here.\n\nwhy is this a crazy take? why is it problematic to hire based off merit? why are we fucking over hardworking students for the sake of diversity?\n\ni'm honestly thankful that i'm not asian or white, because i can't imagine dealing with this garbage.",
            "Oh boy you really got em cooking ere",
            "This post is bullshit and y'all know that.",
            "Fuck all this BS about different backgrounds and experiences being important to success. Why doesn't this apply to mf sports or other areas? And it absolutely is unfair - if a non minority changes their exact resume to be for a minority or woman, they get an easier path to getting a job. Meaning they are absolutely competing on an uneven playing field that's easier. \n\nYou can argue it's ok that it's unfair, but don't come up here with this bs acting like it's \"passing the hiring bar\" in the same way.",
            "agree so hard lol. the complaints are just pathetic. if they feel like this imagine how their minority peers feel? many of them will be ok in the long run. they just feel the need to put down others because their current status agitates them. many comments just reek of thinly veiled (sometimes not even that) racism and misogyny. and the posts that even get hundreds of likes. why i stopped looking to this sub for anything valuable. it’s really full of many privileged men/boys that whine abt things not being handed to them for once",
            "Initiatives should be based on poverty",
            "Companies don't value shit apart from \"expected profit\"",
            "What a nice convincing argument until you realize that they actually lower the hiring bar for the so called under-represented minorities because of their own lack of competitiveness. You want to keep things fair? Start by not giving one group an unfair advantage. They have a right to become good software engineers? everyone has access to internet. Oh and I'd probably classify as the same minorities you are talking about if I were in the US which I am not. You guys need to stop fighting racism with more racism",
            "Like bro, if after failing interview after interview after interview and getting no offers you still think the small drip feed of minorities are to blame, you’re just delusional",
            "Regardless of what you say, prioritizing equality of outcome over equality of opportunity is wrong. The most qualified should always be selected regardless if they’re black, white, brown, purple or like it up the but.",
            "Just wanted to tell OP that you’re right and the comments are full of cope. Most people in CS are not like this.\n\nSigned, a CS Master’s haver and PhD candidate",
            "People complaining about diversity hires fail to understand that minorities are often not hired initially due to sexism/racism/xenophobia/etc. People with traditionally black names in the US end up not being hired when a equivalent CV with a Western European name would be hired. Sexist or racist hirers end up not hiring minorities due to their prejudice.\n\n\nIn addition, there will be multiple minorities trying out for that spot so even then, it's whoever knows their stuff that ends up hired? Divirsity hiring is the first step to an equally represented field.",
            "https://www.supremecourt.gov/DocketPDF/20/20-1199/222325/20220502145522418_20-1199%2021-707%20SFFA%20Brief%20to%20file%20final.pdf\n\nPage 36 has the admissions stats for Harvard by race/academic score. \n\nBeing Black gives you roughly a 5x-10x higher chance of being admitted into Harvard compared to asian/white applicants with the same academic score. Being Hispanic is a roughly 2-5x higher chance.\n\nIt's absolutely this bad at many tech companies. \n\nI doubt this convinces OP or people who think this sort of stuff is ok. Anyone who reads this and had just assumed that it was only a \"slight advantage\" should know that it's a truly massive advantage. \n\nDon't let anyone ever try and tell you that \"it's good for X minorities\" either. Companies/government lower the bar so they don't have to actually invest heavily into making minority communities better in terms of education. \n\nIt's much easier to just admit 80% of black applicants than it is to invest millions into their communities so they can reach their diversity goals without having to compromise their interview process.\n\nOP and people who agree with the current status quo for diversity hiring are just regurgitating shitty politician/corporate talking points that keep them rich. Pretty clear that OP has some wacky external opinions when they say that people who disagree with him have horrific social skills and are unpleasant.\n\nEdit: obvious thread brigade is obvious.",
            "I would really like to not be discriminated against solely because of the color of my skin. That's what people complaining about \"diversity\" initiatives are talking about. I just want a fair shot.",
            "Why should diversity even matter? If an Asian and a Black person are applying for a role, then the better candidate should get it. Not some bs quota rule to create \"more diversity.\" You could have a black guy growing up in the whitest neighborhood, what \"diversity\" are you getting from them? Or vice versa, and now you are missing this \"diversity\" that is so desired.\n\nDiversity is just a gimmick by corporations to show that \"Hey, we do care about minorities!\" But do they really? If minorities suddenly became a liability, would most companies care to keep them? Why are we allowing for these factitious attempts at diversity?",
            "While some of that is true, I know plenty of people that are involved in the hiring process that will not hire white men past a certain number because they are trying to boost diversity. Company policy, not their own bias.",
            "Middle eastern and asian people get fucked by this diversity shit. How is it fair that they have to try so much harder and be so much better to get the same opportunity as others. op you are what i despise in wanting equity over equality",
            "If you honestly think companies value diversity in any way other than a tax break and public image, you’re on fucking crack",
            "I agree. Though you might get downvoted considering the demographics of this sub, I agree with you completely on this.",
            "We can make the argument about professional sports. Why aren't we valuing diversity of the NBA?  Why does every industry need to be balanced by racial groups? Using racial groups for hiring criteria is wrong and illegal, stop the BS. I work in FANG and we are told to give easier questions to minority candidates. During the feedback session we are told by HR to grade the minority candidates easier. This is just plainly wrong and illegal.",
            "You talk like a cuck",
            "[deleted]",
            ">are looking to increase the number of women in software engineering are not getting unqualified women. \n\nI demanded a department transfer just a couple of months ago because the company hired an Engineering Manager with no degree, no experience in software or engineering, and no experience in management - And this is at one of the largest tech employers in the country.\n\nNeedless to say she was shitting the bed from the getgo and throwing anyone she could under the bus to cover her ass. When I brought receipts for her gross incompetence to upper management, I was told I should have been working harder as her right hand man to get her up to speed & pick up the slack in the meanwhile.\n\nI'm sorry but no, it's not my job to teach her the fundamentals of how to do her job and it's certainly not my job to do her job - and I defy anyone to tell me that I wouldn't have been asked if she wasn't a female POC. I would have been more than happy to train her if she had come in at a junior level instead of management.\n\nNobody was more vocal about this than the women on the team (To wit - the team is 45% women, I hired most of them myself and they have all blossomed into *excellent* engineers) who understandably feel she is actively undermining them.\n\nWhile the issue is overblown and often used to scapegoat for other issues - it is *absolutely* a thing that does happen from time to time.",
            "[deleted]",
            "I don't mind them. *Easy* competition as they don't got it between the ears.\n\nThey're the ones already beaten and easy to beat.\n\nNobody who's that good at what they do is genuinely bothered by diversity.  \nThey're part of the *real* competition.\n\nIt's a big world out there with really smart people coming from all parts of it - and they want the top jobs. If you don't like that, then choose another field because chances are you won't make it.",
            "Tech used to have a lot more women and minorities until the H-1B program exploded after Y2K.  Mostly young males from Asia are now the dominant group, making up sometimes 70-90% of CS grads and marginalizing other groups because of cultural biases and an emphasis on rote memorization skills, thus the leetcoding obsession.  This is a group that is self-selecting with its own cultural baggage (castism, misogyny, racism) and it will take a lot to break this pattern.  This cohort has now moved into the hiring roles and tend to want people like them as colleagues.  We will have to implement a program of identifying bright women and minorities at the grade school level and put them in STEM educational tracks to deal with this.  Otherwise they will always get weeded out by the groups that took Calculus in 6th grade.",
            "Ok DEI recruiter. Move on. We know you’re just trying to protect your job.\n\nThe whole fuss here is that people aren’t getting interviews. When this is the case, giving interviews to someone simply because they are a minority is what pisses people off. Or, you send an OA to the minority person and then move them onto the next round while the other person is ghosted. This is what pisses people off.",
            "I see many people in this thread downplaying diversity, when companies want diversity is because lead to better desicions, for example one woman could suggest a feature for an app that would save stay at home wife a lot of time that no matter how smart is the white guy it would never come up with, the companies do everything for revenue so you can expect diversity brings money to the table,if it wasn't the case they would stop doing.",
            "Bro you lost me at underrepresented minorities.",
            "A lot of it is thinly veiled racism and sexism combined with an entitlement complex. As you mentioned, if minorities were really taking all the jobs, then they wouldn't be underrepresented, now would they? These small-minded losers just want a scapegoat, so they target specific minorities.",
            "Victim complexity is something which exists in everyone. \n\nAt the end of they day, it's how we cope up with it asap and permanently. If you're a CS major without a job, you failed yourself. \n\nAs a CS major, we can go into anything. Content writing, documentation writing, Dev, tech support etc. Anything which pays the bills. So it's time to diversify the \"range\" of jobs you apply to.",
            "I just think those programs are immoral.\n\nIt's not that I feel they provide adequate competition or are taking up my interview time.  I could and have passed interviews my entire life as if they were nothing.\n\nFor reference I am a self-taught foreigner.  I came to the USA when I was 4 years old.  I was raised in the ghetto.  My family's first dinner table was a door on top of two trash canisters.\n\nI know anecdotal experience isn't objective data and I concede that point.  That being said my lived experience tells me any asshole with an internet connection, time, and inhuman persistence can do what I do.\n\nI've worked for banks, big tech, startups, and all sorts of other shit and never have I encountered what I would deem as a restrictive amount of racism or sexism.\n\nSo my opinion is these programs aren't required.  My other opinion is if you think the diversity hires are taking your spot you are delusionally wrong.\n\nAs a leader in the company I work for now I would sacrifice a small child to Satan for competent engineers.  I don't care if you are fucking purple and from the planet shmushmu. If you can convince me you can actually build things without being fucking retarded about it then you are making 200k plus.  \n\nThe end.\n\nAnything short of this would be ludicrously stupid on my part.  I haven't met a hiring engineer that feels differently.",
            "> They’re not “stealing” your job\n\nThis is my biggest pet peeve with people who support affirmative action. For every job or college admission a less qualified person takes, there exists a more qualified person that doesn’t get the spot. Stop pretending like it doesn’t work like that.",
            "Diversity hiring will destroy CS if it doesn't get under control. We should only hire folks based on skill, never gender or race.",
            "yea sometimes it's much but other times it's just how things work. Our manager wanted at least 1 female engineer to backfill a role, and we passed up on quality male candidates to get more female employees to up our diversity numbers. She was still a great candidate and I loved working with her but we did prioritize her cause of her gender. If we didn't have that priority would we have hired her? Probably not. Was she a good hire? Yea. You can have win/wins in these scenarios. The only one that loses is the the person we rejected cause he was a guy, but I'm sure he's fine",
            "[deleted]",
            "The problem most people have with DEI initiatives isn't the \"diversity\" in and of itself. It's the act of /privileging/ minority candidates over other equally qualified candidates.",
            "I do not have the time to go through all these comments, but judging by the length of the comment section, you are clearly not seeing things from our perspective as well.  When the system does not favor oneself, it is easy to see the flaws.\n\nThe problem is not diversity hiring, it is the underrepresenting of majority demographics in tech.  White men have had it good for awhile, so because of this, I have to work harder than my peers to be seen.  Okay, not that big of a deal.  But that is not where it stops.  \n\nCompanies try to hire equal amounts of men and women for instance.  That is obviously cool, right?  Our perspective is no, but why?  The percent of women in the degree is far, I mean, FAR less.  The hiring rates should be based on that to make it fair.  That is what I mean.\n\nAs an example, Lockheed Martin gives out 200 scholarships a year, and good ones.  ($10,000)  However, look at their stats.  https://lockheedmartin.com/en-us/who-we-are/communities/stem-education/lm-scholarship-program.html\n\n- 60% underrepresent racial group\n- 24% LGBTQIA+\n- 49% women (I am actual okay with this number here honestly)\n\nA white straight guy looks at this and says, well, I should not even bother, even if they are highly qualified.\n\nBut the big thing is, if you have a degree, YOU HAVE A DEGREE!  Why are we still pushing for over representing minorities because of cultural problems beyond this point?\n\nTLDR:  \nLook from our perspective.  White guys are constantly told they picked the wrong color and sex at birth when it comes to hiring, school applications, scholarship choices.  It happens non stop, all day.  It really gets exhausting being told I have white privilege when I see otherwise all day.",
            "If 3% of applicants are black, 3% of talent hired should be black. If you argue against that, you're lying to yourself to claim that it is not putting others at a disadvantage. \n\nThe solution to the problem is to target improving childhood education for lower income areas, which are primarily black dominant at the moment. Increasing the number of black applicants to universities and workplaces is the only fair way to solve the problem.",
            "> Companies want to increase the number of underrepresented demographics in tech because they value diversity. When you’re lamenting about how terrible it is that these programs exist, you’re telling on yourself in a major way that you don’t care whatsoever about diversity in tech.\n\nI dont care whatsoever about diversity in tech. Why would I?\n\nDiversity brings only conflicts, from different error-cultures, leadership cultures, communication cultures, etc. I will always prefer to work in a homogenous team, because it minimizes conflict and is smooth sailing with competent people for the task we want to accomplish.\n\nPlease explain to me how having indian or black or hispanic people increase \"innovation\" in tech. It does not.",
            "stocking lush quicksand disgusting squeamish pocket nippy cable enjoy slimy ` this message was mass deleted/edited with redact.dev `",
            "This sub is filled with little losers every time you see anything regarding diversity you see these kids saying legit racist things to cope they didn’t get a job. They think when a company wants diversity it means they will force a diversity quota which is illegal. And the reason they did not get a high paying faang job is because they must have given it to a black person or a woman. It’s legit scary seeing how quick some people in the Asian community will turn on minorities the moment that they are treated like white people and not given a tiny bit of help",
            "I have first hand experience of diversity hiring. Shut up, stop making excuses. I only got through rounds and received an offer after I stopped applying to companies which prefer diversity. \n\nYou truly have no idea how it feels to see a dumbass (college project partner) get into Walmart labs. I helped her clear the OA. I have nothing against her, I have everything against the system.\n\nShe's an extremely nice person, however I would unalive myself if I ever have to work with her. I say this to her face all the time and she agrees with me. I don't blame her, I respect that she took advantage of the system as we all should. There was a bit of jealousy initially but then I realized that I shouldn't be mad at her, she's only looking out for herself. \n\nWe should collectively stop applying to companies who prefer diversity. At least, that's what I did and I'm grateful I did that. Blame the game, not the player. \n\nHowever, stop pretending it doesn't matter. It does matter to those who sacrificed their entire college life and just kept grinding.\n\nLook out for smaller companies, no name companies, mature startups, etc. They don't give a shit about Diversity. Stay away from MAANG. It's an infectious disease. Ultimately, if you want to work on the backend like me, the best shot you'll have is to go for companies that process a lot of data. \n\nYou'll never encounter a massive scale like MAANG but there's no need to know everything. And bonus points, you won't have to be near MAANG-tards. I say this because while there are some extremely smart people in MAANG (obviously), most of the people came there as a goal. It will suck working with pompous people like that. \n\nI'm currently in a late stage startup and I'm loving it. I'm not as highly paid as MAANG but I'm happy here and I'm learning a TON. I'm hoping to apply to EU companies later for a better WLB culture. Never MAANG.",
            "In conclusion, stop bitching and just work hard.",
            "I don't think that it's specific to CS. IMO it is sadly very \"common\" that people find scapegoat/excuses for their own failures. It is a way to cope with reality.\n\nIt just happens that the \"woke agenda\"/\"deepstate\"/\"global elite\"/\"jews\" are easy scapegoats.  \n\n\n\"I am the smartest person on earth, I even learnt how to make a BFS algorithm in lolcode from youtube, and they dared rejecting my application?? This must be the woke agenda at play!\"",
            "What a stupid post. “Diversity” doesn’t have any value. What has value is the value each candidate brings to the table based on their skillset. Forcing diversity only detracts from hiring the best person for the job",
            "[removed]",
            "Idk bro you should never be a victim. But aren’t we encouraging victims when we lower the bar and say “hey, hey apply as a POC (but only some POC, East Asian POC isn’t part of the definition).” My understanding of this shit has fallen into obscurity. I actually have POC friends and all that stuff but it’s so strange how we designate some people to be POC victims and others aren’t. Next thing you know everyone’s a victim, so this has always been a nagging thing. Social referendums like this have done nothing but encourage those in society to lose accountability. And at the end of the day this is just the arena of American politics. You’re not more woke or more morally upstanding for caring about POCs get this out of your head. You can uplift them without feeling this weird sense of moral superiority that you feel like you need to be right out of white guilt or whatever. Just do it because you’re kind and if you can’t then look after yourself first. Life is too damn complicated to look after POCs because if you’re a POC life is hard. If you’re a privileged white male, life is still somewhat hard. But damn the moment you say here’s some pieces of bread you feel like the savior, the hero, the big man, the head honcho. Go feel however you want doesn’t make you right.",
            "Hot take.\n\nWe in the industry don't owe you a job.\n\nWe only care to find the best person to fill out the team.\n\nWe don't care that you can program in C using just VIM and a magnet. We have plenty of senior Devs who don't even need VIM.\n\nMany of us in the industry knows that monoculture and group think are antithetical to innovation.\n\nThis all smells just like what Incels/Nice Guy say.\n\nIs it fair, probably not. \n\nBut I really don't care, as long as my team meets deadlines and we don't have production going down.",
            "Another privileged diversity pariah attempting to prove his/her/their/xer worth in the industry... you'd make a good politician",
            "I don't like how this sub has gotten with the discussion on diversity hires. Frankly, the toxic discussion on this will change nothing and has made this sub a worse place to be in.\n\nI personally disagree with how many tech companies try to recruit more diverse cohorts, but I think it's something I can have a good-faith disagreement with others about and is not something I think we should be making a major fuss over. There are a lot more unfair things about tech recruitment then our friends at the Women in Computing club getting the opportunity to chat with a recruiter interested in diversity occasionally. It's not 100% fair, since there are a lot of asian and white guys who had to overcome lots of circumstances to get into CS but are treated as atypical applicants, but I see why it's there and I don't think the intention is to be racist or sexist.\n\nI hope we can stop talking about this and just agree to disagree. This discussion is convincing nobody, changing nothing, and stinking up the community.",
            "Most of what you say is true, but I would prioritize skill over diversity at workplace. Diversity should be and is being prioritized in universities and I agree with that. When everyone is equipped with same acess to education and resources, priotizing someone for something they were born with or had no control while hiring doesn't seem really fair .\n\n Not saying women at GHC are unskilled or bad, but you are telling me it is OK for recruiters to ghost me after good experience and successful interviews or OAs because I was a man, while my peer gets an offer because she attended a girl only conference?\n\n\nEfforts to uplift someone shouldn't come at a cost of someone else's opportunity and hard work. \n\nIn short, the irony of today is everyone is promoting inclusivity by making things exclusive",
            "W take on this",
            "[deleted]",
            "[deleted]",
            "Blaming diversity hiring vs being opposed to diversity hiring are too completely different things. I don't have any hiring issues. But the idea that racial/color/whatever diversity is somehow beneficial to business in itself flawed is my argument.\n\nSee this is the problem.\n\n\\>People with different backgrounds and experiences are important to success. So when you have a severe lack of people with certain backgrounds, it makes sense you want to seek them out.\n\nThis is a load of bullshit. We should make decisions based on a pure thinking framework like physics/logic/mathematics. Not introduce bias based on some human's experiences. That is ridiculous.",
            "So glad someone finally intelligently addressed this"
        ]
    }
]