[
    {
        "post_id": "1bkkt86",
        "author": "Beautiful_Surround",
        "title": "This is who we're competing against. (and still losing)",
        "url": "https://i.redd.it/cwmtvd95urpc1.png",
        "score": 2302,
        "num_comments": 218,
        "created_utc": 1711063470.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bkkt86/this_is_who_were_competing_against_and_still/",
        "comments": [
            "This guy is a psychopath lol but I expect nothing less from blind.",
            "A startup would be the one company size where you wouldn’t get away with doing nothing, and does he explain why he gets fired so often or why there’s massive gaps in his resumr",
            "Probably iOS Developer, we had one in our team",
            "I would buy his course",
            "This us fake",
            "Dudes winning life",
            "People on this sub are not competing against the people on blind, who are experienced engineers.",
            "Met a developer during the pandemic that had a cushy $150k salary at a decent software company but  _also_ contracted himself out to two other companies on the side for a higher salary. He was only 100% committed to one company, and doing the bare minimum at the other two for the extra pay (three companies in total).\n\nApparently it took them around 18 months to let him go but by that time he had already gotten paid an additional $450k from those other two positions during that time, making it a highly valuable business decision.",
            "And here no one is even interviewing me  😭",
            "Man’s winning in life",
            "What is Google status?",
            "sometimes going on blind is worth it for gems like these, too funny",
            "The tech world is surprisingly small. If this post is true at all, it'll backfire pretty soon. Hopefully he's been stashing away a good chunk of money.",
            "This post is probably a scam itself. Word of mouth travels quite fast, and he would start failing on reference checks.",
            " I recently came across this troubling story of someone exploiting their position at startups.",
            "What the hell is Blind?",
            "And here I am, switching careers from trying to become a software engineer to preparing for my ground classes to become a commercial pilot 💀.",
            "I don't understand what's he doing? So he worked at Google apparently and using this to get jobs at startups doing nothing? Right? Wouldn't he have gaps?",
            "This is fucked up on so many levels\nBut karma is a real bitch\nYou get nothing for free",
            "I know some people are like \"haha hell yeah\", but this kind of shit ruins remote work for everyone else. Remember that after these companies get burned hiring dogshit remote guys like that, they're going to be FAR less likely to hire fully remote workers in the future.\n\nNobody should be cheering this asshole.",
            "We should learn from him, dude is enjoying his life.",
            "imagine believing this",
            "You shouldn't even believe this without proof, and surely not waste time worrying about it",
            "Hmmm I would be worried that my reputation would catch up with me way before my savings would be considerable enough not to need to work again.",
            "It feels like Eva AI virtual gf bot development is going on the same way.",
            "What the actual fuck?!?",
            "What most current googlers appear to be doing too in fairness.",
            "I’m reading this in the primeagens voice",
            "🤣🤣🤣🤣",
            "bro found a loophole",
            "Like he have worked for Google for some time, and he uses that to impress employers?",
            "Sounds more or less not real",
            "This pisses me off so much,I’ve had plenty of experiences working with people who put in the bare minimum, steal credit etc and seem like they can just coast their way into other jobs as soon as it doesn’t work out. Meanwhile I wonder why I’m working my ass off while I watch this going on around me",
            "He's a psychopath. He can afford all that but being a cheap stake. 4 hours per week is bare minimum  means he can be sold contributor at 20hours per week effort. And would have had esops as well.  Psycho nut job",
            "Huge win if true. Most startups fail pretty soon so it seems surprisingly safe, techbros ain't the smartest bunch aa employers",
            "Take what you can. Give nothing back.",
            "Bait used to be beliavable ",
            "This will catch up to him pretty soon, I'm sure.",
            "So we’re to believe this guy who, if he’s telling the truth, is a self proclaimed liar? 🤔",
            "I find the amount of pearl clutching in here about this scenario way funnier than the idea of someone actually doing this.",
            "This wouldn’t be a huge issue if the pay for Computer Science jobs wasn’t very high.",
            "oh hey it's my coworker!",
            "What does it mean by Google status? Legit former google employee?",
            "People believe anything",
            "Definitely rage bait, this is just not possible",
            "Dumbest shit I’ve ever heard. Nonsense.",
            "They haven't patched this exploit yet??",
            "Ruining remote jobs for all of us",
            "Let’s be honest, you think a lot of people are in tech because they love it? Nowadays people are in it for the money. They just tolerate it. It’s a way to make money but we can’t be mad at this guy. 🤷🏾‍♂️ startups don’t know any better sometimes.",
            "I hate this. I would join a startup and actually work.",
            "Good for him ngl.",
            "https://preview.redd.it/2vjz38jscwpc1.png?width=1124&format=png&auto=webp&s=61484875ddcaf01d2fc7bfa264f7a2ae580496e2\n\n💀",
            "I see people talking about gaps in this guy's resume. Can anyone share this guy's resume?",
            "This post is probably a scam itself. Word of mouth travels quite fast, and he would start failing on reference checks.",
            "W him if true"
        ]
    },
    {
        "post_id": "18pbmua",
        "author": "Icy-Assumption9881",
        "title": "0 applications, the internship grind pays off",
        "url": "https://i.redd.it/ilnuwe56738c1.png",
        "score": 2260,
        "num_comments": 44,
        "created_utc": 1703355751.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18pbmua/0_applications_the_internship_grind_pays_off/",
        "comments": [
            "for context the company (not my dads) I interned at this year liked me enough to offer me an internship for next year too :D",
            "Really the ultimate sankey tbh",
            "give me refferal",
            "I’m in the same boat. Extremely thankful for the opportunity and to not have to go through the application process.",
            "Internship conversion is the best way to get a full time offer",
            "![gif](giphy|AdFadead94vkXpP8Em)",
            "Thats how my career started. 4 job offers before finishing college. 1year later moved in internally. Covid graduates ate good back then.",
            "Mine looks like this too. It’s not faang but it’s still over 30/hr and I love it. Kind of wish I did get higher tho",
            "🥹",
            "how many internship applications did it take tho",
            "Same boat here! Not prestigious or anything, but an internship is an internship in this market, congrats!",
            "your dad’s company doesn’t count",
            "This is the way! Grind in your sophomore or junior year and that might just land you a full time role",
            "Same here. I did QA last summer for a company and busted my tail to show how hard I’m able to work and how bad I want a job with them. I made it a point to work harder and bring more results relative to all the other interns. They sent me my offer letter for another internship (Software Dev this time) in which they’ve given me a $4/hr raise. I went ahead and accepted it, so I’ll be interning for $25/hr next Summer. \n\nThey did, however, offer me a part-time job while I’m in school for QA automation, but I respectfully declined to pursue some freelance work. My buddy and I have now built a mobile app for a local vape shop. \n\nDuring this next Spring semester I will be building a real estate photography business as my exit strategy for the 9-5 as either a SWE or QA Automation Engineer with that company. Some people are gonna think I’m absolutely crazy for just working for a few years before I quit to continue scaling my own business, but I’m not too keen on the long-term idea of making someone else’s dreams come true and visions come to life instead of doing that for myself. Of course I will quit once it makes financial sense to apply my efforts and focus into furthering the growth of my own business. Gotta think about my family and building generational wealth, and working with a salary limit over my head all my life just isn’t something I see as a smart move, at least for me.",
            "Sick graph bro",
            " Wow guys look at this rolls Royce over here",
            "😔",
            "but how many applications did it take to get than internship : ^)",
            "I did the same thing, less than 5 applications in career fair and got 1 internship, now they are gonna give me a return offer. Congrats",
            "We need a resume tour bestie",
            "How is your dad?",
            "Imagine if someone made a Sankey diagram with one data point and it’s just the one job they applied for"
        ]
    },
    {
        "post_id": "1c4sctv",
        "author": "TheColorDarkGreen",
        "title": "One email pretty much summing up why networking at career fairs is important",
        "url": "https://i.redd.it/2o0hh45vjouc1.jpeg",
        "score": 2210,
        "num_comments": 56,
        "created_utc": 1713202918.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c4sctv/one_email_pretty_much_summing_up_why_networking/",
        "comments": [
            "There are two types of people:\n\n1. Those who can extrapolate from incomplete data",
            "I have no idea what I’m looking at",
            "translation: someone OP networked with looked at 3 job postings for OP (the req XXXX's) and got OP in the hiring loop/interview process for one of the postings.",
            "Any career fair is going to have at least dozens of people looking for a job at any position. Most of the time they don’t even appear to be looking and would not check your resume until you mention the magic word they’re looking for. Unless you’re saying how you networked, this is useless.",
            "Be careful though, sometimes there are people penciled in for roles and they need multiple interviews as a part of due diligence. This specific example may not be the case but remember that for your career down the road. I made the mistake of going for interviews for roles that were not really a fit just because someone got a hold of my resume and reached out.",
            "Do people really not know what this means? Man…gg",
            "Drop the rizz tricks cmon",
            "what did you do/say in the career fair to network exactly",
            "Hi          ,",
            "i remember a careers fair in computing and engineering building where they were only looking for mechanical/aero engineers, but not software ones :D",
            "What does this mean how is this significant",
            "wtf does any of this mean OP. I have no idea what I’m looking at"
        ]
    },
    {
        "post_id": "1afme1s",
        "author": "Fabulous_Year_2787",
        "title": "CS grads paying off college debt in 2019 vs 2024",
        "url": "https://i.redd.it/9o19sdvo2tfc1.jpeg",
        "score": 2181,
        "num_comments": 145,
        "created_utc": 1706719957.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1afme1s/cs_grads_paying_off_college_debt_in_2019_vs_2024/",
        "comments": [
            "there's a guy in r/cscareerquestions whose perma answer to new grads struggling is to just join the military 💀",
            "That's pretty dope you get a nice side table and a plant and a wooden table for your mobile setup in the military.",
            "This reddit:\n\n\n\"Just apply to military contractors, they have such easy application processes\".\n\n\n*applies to 100+ military contractor positions over 2 recruiting seasons, never gets anything*",
            "defense companies are getting harder but all things considered they're still a good option in this job market",
            "Btw no disrespect tho those who serve in the armed forces or did. Just trying to find a way to jokingly highlight the current job market for us RN.",
            "Jokes aside working cyber defense for the military is a very rewarding career path especially when you get out with a clearance.",
            "When CS in your diploma stands for Counter Strike",
            "As someone who already did that life and got out.. I would rather look for jobs for 5 years than re enlist.",
            "https://preview.redd.it/rzht1zot4tfc1.png?width=370&format=pjpg&auto=webp&s=d8d0b0ed2acfb791014ad81839dd029b495cbfc0\n\nBeing consumed by Mark Zuckerberg's true form is certainly one way of getting into Meta, might consider this route tbh",
            "How are people making money in counter strike?",
            "Sucks for those who are medically ineligible to join.",
            "keyboard go brrrrrr",
            "thank you generous country for allowing me to further educate myself and provide more intellectual capital for my country! I will repay you for this great honor by dying for oil for you!",
            "I feel bad for you CS majors as I think the career was oversold to you (and other STEM majors).  In my HS graduation class of 350, there were three of us majoring in CS, and a few more in EE (and all were males, no females).  I graduated with a BS CS from a US B level engineering school in the late 80s and had multiple job offers from really good companies before graduation.  Companies were hiring as many CS, EE and CE grads as were available - everyone in my circle had a job IIRC in either software/hardware product development or IT.  This was before offshoring became commonplace.  Now as an engineering manager the majority of my hires need to be lowcost offshore resources.  It comes full circle though, FWIW, I'm now at the age where if I lost my job it will be very difficult to get a new one due to age discrimination in the tech industry.  You have no experience and I have too much, or I don't \"fit\" into the culture of 30 somethings.",
            "CS is the new gender studies",
            "[deleted]",
            "When you have to debug the missle flight tracking at 8 and the strike scheduled at 10",
            "I just graduated from Rutgers with a BS in comp sci and am currently going through the officer selection process for the army lmao. Will be looking to do Intel or Signal (IT). I wanted to do cyber as an officer, but apparently that’s direct commission.",
            "For public state attendees and alumni, what’s the debt looking like for some of you?",
            "Just read this https://www.efinancialcareers.co.uk/news/the-fintech-boss-who-received-20-000-applications-for-five-jobs-it-s-sad",
            "Is this AI generated? This is a dope pic!",
            "National Guard is pretty good tbh. I have all my college paid for and a good amount of money. Barely affects my school, I have a 4.0",
            "I was already in the military. I'm just using my GI Bill now.",
            "Wait what’s happening 😭",
            "Those soldiers arent Obese enough to be american",
            "Well US is made for creating  wars sooo",
            "Sadly the military doesn’t sponsor foreigners",
            "The left image is such a vibe. I want an office like that lol",
            "I was actually searching for a civilian job in the military/government, but the ones I found said an ABET-accredited CS degree was required. Mine wasn’t.\n\nIt was an absolute gut punch.",
            "“We gOt the greEn light, you’re going to waRzOne. Grab your resumes and referrals, you are up in 3. Rules of engagement is simple, click apply to all posts.”",
            "r/hardimages",
            "if i didn't have to lose 59 lbs to be eligible to sign up then MAYBE and that's a big maybe lol",
            "17A and 17B are not bad Army MOSes to go for. Free top secret clearance and usually come with bonuses.",
            "RECRUIT GET DOWN AND GIVE ME 20 LEETCODE ALGORITHMS !",
            "Currently serving in the US Air Force reserves and a CS major, I’m tryna get into the cyber career field it’s dope or space force. It’s honestly cooler to me than just working big corporate (which I do not mind) but something about cyber intelligence draws me in lol.",
            "If you need experience in IT the military isn’t a terrible option, at least to get in for a few years and build experience. I’ve worked with veterans who worked on IT/communications systems and they’re some of the most knowledgeable and disciplined devs I work with.",
            "Jokes on you, I can't join military due to medical stuff, so I'm fucked either way (2023 grad)."
        ]
    },
    {
        "post_id": "1alfqwt",
        "author": "MrAvatin",
        "title": "Devastated",
        "url": "https://i.redd.it/1flqylzqp8hc1.jpeg",
        "score": 2174,
        "num_comments": 175,
        "created_utc": 1707345163.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1alfqwt/devastated/",
        "comments": [
            "damn even mcdonalds is rejecting people nowadays",
            "They wanted 5 years experience in keeping the ice cream machine operational, but unfortunately you only had experience with soda machine touchscreens.",
            "https://preview.redd.it/34mahk7kb9hc1.jpeg?width=1179&format=pjpg&auto=webp&s=9374a7462cf724c46fa876ec3146862469cd543b\n\nDude at least they rejected you from an Engineer position. After 5 months looking for a DS/MLE position (I have 4.5 years of FAANG experience), I am looking for ANYTHING that give me money in any position, and they still reject me…",
            "They went with someone who specializes in Mc++",
            "My boy couldn't even get a job at McDonald's.",
            "I guess we aren't lovin' it after all 😫",
            "“Hi”",
            "McRejected",
            "McDevastated*",
            "...but we've got a burger flipper role that we think you'd be perfect for! ",
            "As a former consultant who has seen people working for McDonald’s you should be glad. Their codebase is worse than you’d think and filled with bugs. My coworkers working for them  used to laugh out loud and I would ask them what was so funny and they would show me some dumb shit lmao.\n\nEven Darden had a better codebase",
            "You should take this back to your high school and rub it in the face of the high school teacher who told you that you would end up working at McDonald’s your whole life if you don’t go to college. “See! I can’t even get a job at McDonald’s with my degree”",
            "I’m convinced none of the application process makes sense. \n\nGot rejected by local companies and big tech and then got multiple interviews at NASA and hired into Pathways… \n\nReality isn’t real anymore for CS it seems",
            "At least they didn’t put salt on the wound by telling you “sorry you didn’t make the cut, here’s a free frosty with your purchase voucher.”  From Wendy’s 😭",
            "I got rejected by Wendy's.",
            "At least u got an email",
            "Is an engineer 1 what they call the fry maker?",
            "Try down levelling to Line Cook",
            "McFucked!",
            "not succeding in things is the default state of life, only those who persevere through failure will see victory, CS is a great career choice, keep working, try to differentiate yourself with new skills, and you will succeed.",
            "This is the nicest rejection I've seen so far",
            "You will get alot of these in life, keep going…",
            "https://preview.redd.it/h50wkafk4ehc1.jpeg?width=1040&format=pjpg&auto=webp&s=083a94db1747499de0b52f3ba29a0727e2d8497e\n\n🫡",
            "The worst part is having to remember this every time you eat at Maccies from now on",
            "I mean their software seems to be working good so I guess they won’t let just anyone in",
            "Hey at least they got back, most of the times they never do for Me",
            "Can't believe they actually said \"you were among a number of very strong applicants\".. seems like a self-esteem booster to me!",
            "So",
            "This is corporate speak for, \"They never even looked at your shit. The AI sorting bot trashed your shit the second it was received.\"",
            "Only McDonald’s.",
            "I got this 3 weeks ago",
            "Welcome to the boat.",
            "Hi",
            "I wouldn’t want to work at a company that supports n4z1s so you dodged a bullet",
            "I got this earlier too LOL, at least they think I’m “very strong” 😀",
            "McDam",
            "I truly think this is the most humbling",
            "damn……\n\n\n\nFREE PALESTINE\n(stay mad losers)",
            "Would have been an interesting role",
            "MS Explore rejection just hit after I saw this post :(",
            "Imagine making an inspirational movie in todays times and seeing 1000s of these rejection letters only to find the one that accepts you",
            "Waiting on my own rejection email.\n\nI wanted to work for them just so I could fix their shitty app. God it's awful and slow.",
            "Got an internship offer  there. Process was easy low key",
            " I received the same response lol 😭🥲🤣 \n[McDonald's response ](https://i.imgur.com/eaPmUHZ.jpg)",
            "Tbh the formula to sneak into a company like this is to work in the actual store, apply for the tech programs through the internal employee job portal and it will boost you crazy. This was exactly how I got an internship at a huge retailer in my first year of college.",
            "Applied for a McDonald's security engineer position was met with the same end",
            ">and we hope you’ll continue to explore future opportunities with us! ~~(as a crew member)~~",
            "u know the world's going downhill when fast food even rejects u",
            "I've been an swe at Google and I'm an SDM at Amazon and I was still rejected without an interview from McDonald's.",
            "I have five letters for you \n\nT.E.S.L.A\n\nApply there",
            "Why work for a clown when you can work for a king .",
            "Not even a “Ba-da ba ba bye 👋”.",
            "I'm not lovin it",
            "Applied for wrong one. Choose \"Sanitation Engineer\" instead of just Engineer. Need to be more niche to lower competition.",
            "A professional is someone who gets rejected way more than accepted. If you are darn good, the ratio generally is 1 acceptance per 10 rejection.\n\nIt is a matter of growing up I suppose. What is best for you might not be best for them and vice versa so.. yeah.\n\nOver last 21 years of my career - so many times I have felt this feeling:\n\n1. Oh I must get in there, that is the ONLY way forward \n2. Only after years having the same feeling for another opportunity \n\nSo.. things change, things move, things are like a cycle.\n\nCharaibeti. Move, and move and move forward.",
            "There's more than skillset involved.",
            "Competition is insane!",
            "Dodged a bullet there tbh. McDonalds is awful to work for",
            "Hey OP,\n\nI applied to a cloud role at McDonald's and was rejected. I also applied to the local joint and they kept rescheduling me for an interview. I had to withdraw my application to the local joint after the nth reschedule and I saw their lunch rush. In short, don't beat yourself up and use this as an opportunity to reset expectations and to take some time out to breathe and thank the heavens that you don't have to work for such a company.",
            "Is this what they mean by cs graduates working at McDonald’s?",
            "I applied for an EM position with them recently. Despite my resume practically matching the job description and more years of experience than they required I was still rejected. Recruiters at big companies have zero clue what actual qualifications look like.",
            "![gif](giphy|S2CBV8jQtSl5m)",
            "This kind of reminds me that I need to see if Victoria's Secrets is still hiring in my neck of the woods. With a little luck I can do some database stuff and say I work with the models.",
            "To program at McDonalds you need to own a Big Mac.",
            "the vibe is in McShambles",
            "McDevastated",
            "I have so many of these rejection letters. I even stopped collecting them and started deleting them since I had so much 😂😭",
            "An email without the candidate’s name ? Can MCDonald’s be this rude?",
            "DM me if you wanna move to Cincinnati",
            "Bruh💀💀💀. Same thing happened to me last week after interviewing for a line cook job. I have a masters btw",
            "Why?",
            "Got rejected from a developer job at Wendy’s a few weeks back. Reject letter included a coupon for a free Frosty.",
            "Get yourself a Happy Meal Supersized to ease your pain",
            "They look forward to rejecting you in the future too!  Good luck!",
            "They want you to apply to their Gastronomic Operations Engineer I role",
            "Check ur dm",
            "McDevestated.",
            "Boeing is hiring a bunch of software engineers",
            "McDonald’s hires engineers? Lolz",
            "Mcdevastated?",
            "They need to be hiring some designers to fix their damn kiosk UX."
        ]
    },
    {
        "post_id": "iw34c9",
        "author": "auhea",
        "title": "Just failed another coding assessment ❤️✨",
        "url": "https://www.reddit.com/r/csMajors/comments/iw34c9/just_failed_another_coding_assessment/",
        "score": 2164,
        "num_comments": 115,
        "created_utc": 1600558544.0,
        "selftext": "That is all",
        "permalink": "/r/csMajors/comments/iw34c9/just_failed_another_coding_assessment/",
        "comments": [
            "Thanks for a realistic post in the midst of all this subs inflated success rates.\nDon’t give up and on to the next! Proud of you.",
            "Same homie, and it counted for two companies. f codesignal 🥰",
            "One of my friends recommended me for a backend position. I took the opportunity and they gave me an assignment for 1 week. During that week my friend messaged me telling that they already hired some else...\n\n4 weeks from there I continued to add features to that project and I'm learning a lot of stuff. I also met a new friend and we are going to build a frontend part for the application too.\n\nSo my advice is to keep improving yourself and success will come. Take care!",
            "I'm really worried i will fail many (if not all) OAs and there will be no companies left hiring. And i am not even talking about FAANGs, at this point, i just need a new grad job with a decent salary thats all. Am i being too worried?",
            "i failed Stripe, Roblox, IBM, and Citadel",
            "Don’t worry I’m in the same boat, last semester really messed me up with the whole half baked online classes thing but keep trying and you will get it.",
            "good on you for actually doing them though. I can barely get myself to do the coding assessments lol.",
            "And here I am getting rejections even after I passed all test cases in OA's :(",
            "Where do you guys find the job postings?\nI've been sending it everywhere I see, passing all the OAs and still getting rejected.",
            "Just got rejected with a referral and without an interview 💃",
            "I was a CS major at OSU back in the day and the first day in C+ class there was like 100+ students, full auditorium. By the end of the semester there was like \\~20. They weeded everyone out in the first year, not saying it's your first year or anything but perhaps its the case. \n\nI had a lot of hard nights, bad grades, feeling lost and defeated as a freshmen. I was lucky that I got help from friends but even with the help I felt a bit accomplished for even making it to the end. I of course expected a D or so after all my failures. \n\nWell the teacher curved everything and I ended up with a B+. I had already changed majors figuring I'd never make it. I guess all I'm saying is keep at it and work hard, ya never know how things work out.",
            "Me too, OP. I think I've failed like 5 by now. It scares me because this is pretty much the first step in the interview process, but I have hope that if I keep going and keep practising, then something at some point might turn around :) Hustling hard gets you somewhere. I really do believe that. Gl :) you got this!",
            "On to the next!",
            "dude here i got rejected from amazon, goldman sachs and deutsche bank all in the final round because they thought (from my cv) that I will take up masters after undergrad instead of joining their firms after the internship. life's shitty as hell",
            "preach!",
            "I'm about to join you tomorrow :'((( but you will be okay!!! Growth mindset you are definitely capable and we're with you!!",
            "Me too :’)",
            "I’ve failed quite a few coding assessments. Been ghosted from 3-4 companies after completing all the questions with all the test cases. \n\nReading all the positive comments in this thread is really motivating and helpful in this depressing situation.",
            "Same bro",
            "Hey me too homie. Feel pretty shit about it but there’s tons more to come.",
            "You've probably heard of it but I just bought this book called \"Cracking the coding interview\" and so far, I'm impressed. \n\nWorth taking a look.",
            "I'm really glad when I was learning to code I had things I wanted to learn how to do and goals I wanted to accomplish rather than periodic arbitrary fencing I needed to leap.",
            "I’m about to fail another coding test💜",
            "A post in this subreddit I can relate to ✨",
            "I say yeet if a company asks for CodeSignal 💀",
            "Happens. \n\nI remember we had to do breath first, depth first search for data structures and algorithms analysis that was tough. Also we had to do some luck base games and stuff like programming a card game. \n\nI failed three programming classes and graduated and I have a job you can do it man all you have to do is just be really persistent and study. Office hours helped me a lot.",
            "Within the past 4 months I’ve failed tests at Akuna, IMC, DRW, Optiver, Publicist Sapient, and that includes multiple different positions at some of those firms. I’m truly just overloaded with course work that I have not been able to focus on preparing for these interviews. Often times I’ve had exams and other stuff due right around the due date for the assessments. It’s really annoying, but you just keep on applying. Sometimes I feel like a RAT scavenging for food. We’ll succeed eventually !!",
            "At least you know how to code lol",
            "gg unlucky -leafy",
            "Hang in there bud",
            "Same",
            "Dang it. Me too!  \nBut we gotta keep going!",
            "Thank you. Same with me",
            "What overall percentage of companys don't do leetcode style questions? Asking for a friend",
            "The real question is how did the rest of the class do?",
            "Same, failed mine earlier this week ❤️",
            "On to the next! This learning is future money in your pocket (and I hope, if you are struggling with finances right now, as I am and a lot of us are, this thought motivates you!!)",
            "Take time to correct what you got wrong and understand why you got it wrong. Thats how you improve.",
            "Me too and it was 100% my own fault, now I know it hurts even more when you know you suck...",
            "Not a CS major, but had a coding assignment for a position at an automotive company. Failed miserably. Realized that my basics are not strong. Got a book on C++ working on it.",
            "It’s all a numbers game, go on as many interviews as possible. You’ll get better",
            "I failed my Microsoft coding assignment recently. They missed out on a good one.",
            "How do you FAIL one? Is it just failure to not able able to reach 100%? \n\nIs codesignal asking leetcode hards or some shit? so many people are hating on it",
            "I just failed a take home assignment. What is the expectation for a mid level Dev anyway? I deployed the entire thing to eks and a front end to heroku. After all that to just get rejected. Damn that sucks balls man. 😭😭",
            "Even Bill gates would fail a code assessment these days it's just a way of saying no.",
            "No worries, for the Ford assessment I straight up just typed “I can’t do this, thanks for the opportunity” 🤣",
            "."
        ]
    },
    {
        "post_id": "168ch7z",
        "author": "Just-Morning8756",
        "title": "It’s a damn shame",
        "url": "https://i.redd.it/yj8x59tpgwlb1.jpg",
        "score": 2157,
        "num_comments": 165,
        "created_utc": 1693685554.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/168ch7z/its_a_damn_shame/",
        "comments": [
            "Shit man I don't need $150k, just let me get a job.",
            "Remove “paying 150k” and this is accurate",
            "Fresh grads on this sub when they don't hear back from Google or Microsoft: **I'm a failure, the entire rest of my career is ruined.**",
            "Actually guys what can I expect? I learn lots of stuff outside of the program of the uni, had some freelance jobs, and it's like 2 years till graduation. What salary range can I expect(in general, without specific parts of the industry)?",
            "I'll take 60K but I haven't even found that.",
            "Bro what, y’all better not take 60k. I literally make 75k as a non technical admin. You are all worth 85k out the gate. You know more than you think and have a lot to contribute. Don’t frame your expectations to the cruelty of a tight job market",
            "They say go on LinkedIn and spam for referrals",
            "WOW an actual good meme from this joyless sub.",
            "Also don’t forget to blame the immigrants and women for taking their jobs. Who’s next, I wonder? Maybe some certain groups of people that have been historically used as scapegoats for everything.",
            "I applied to a 30k a year job, still got rejected.",
            "I wish I could grow a beard like that lol. Mine is always patchy it sucks.",
            "people like me, people like you",
            "When does CS realise the ship has sailed and CS isn't the money making major anymore? God-knows what is, though....",
            "It's pretty satisfying watching all the CS Majors crying about the job market after they've spent the last 5 years bragging about how anyone with a CS degree can walk into a 200k a year job\n\nWelcome to the real world now your bubble has burst",
            "[deleted]",
            "WHAT THE WORLD’S COME TO\nFOR PEOPLE LIKE ME\nFOR PEOPLE LIKE YOU",
            "Do you even get interviews? 💀",
            "Why is it hard for fresh graduates to find jobs after college? I mean... doesn't the college provide you with placements in companies? What expectations do companies have from us?",
            "Wrong they come on this sub to blame minorities but when someone asks what projects they’ve done on the side besides get a degree they go radio silent.",
            "Strawman. Its more like theres not even 40k",
            "Are these salaries gross or net?",
            "I can’t find ANY job other than McDonalds",
            "Seriously and they jump straight to we will never get a job ever instead of getting scrappy and looking for any opportunity until the right one comes up.",
            "pretty good song tho",
            "[deleted]",
            "Is this from my post lmao.",
            "This one did",
            "If I got a $50K offer, I’d be more than happy",
            "I just want a job in my field, is that so hard to ask.",
            "Yeah that's for mainly HCOL.",
            "[deleted]",
            "High expectations 😆",
            "Comparison truly is the thief of joy - someone with a $91k offer",
            "Have you seen inflation and the housing market? 150k isnt that much anymore"
        ]
    },
    {
        "post_id": "1chk43v",
        "author": "Ambitious_Goat_001",
        "title": "Harsh Interviewer: Just bombed an interview so bad 😞",
        "url": "https://www.reddit.com/r/csMajors/comments/1chk43v/harsh_interviewer_just_bombed_an_interview_so_bad/",
        "score": 2160,
        "num_comments": 256,
        "created_utc": 1714563939.0,
        "selftext": "I'm dead💀\n\nAt the beginning of the interview he straight up told me \"you are in for a rough ride\". I just laughed it off, I thought he was joking.\n\n2 coding quizzes. Both LC medium, first one had a hella amount of edge conditions. But I aced it. In the second quiz, he said \"now this is where we'll know who you really are\". It involved just some common sorting algos..but I run into some errors and he said I can't do it and that he understands. \n\nI even tried to engage him in my thought process but he seemed not interested.\n\nSo we had a short conversation afterwards and from that, I can tell they won't be moving forward with me.\n\nBro he didn't give me a peace of mind, the whole time he made me feel I wasn't good enough 😭\n\nIf he's here, I just have one question for you man, why?? 😭\n",
        "permalink": "/r/csMajors/comments/1chk43v/harsh_interviewer_just_bombed_an_interview_so_bad/",
        "comments": [
            "Rollercoasters were originally designed as a concept for a high-speed method of delivering mail between cities.",
            "Sorry to hear that. He doesn't sound like a good interview or coworker to work with. Imagine you did get a job in that company, and you will need to work with this individual on a day-to-day basis.",
            "You're in for a ride 🤓. Now we will see who you really are 🤓",
            "\"you are in for a rough ride\" lol who the fuck even says that?",
            "All the best interviews I’ve had did the exact opposite. Why would you want to embarrass or insult a potential new member of your team? You don’t need to do that to determine if they are a good candidate or not. \n\nThe good news for you is that your next interview won’t be as bad as that one",
            "If an interviewer told me I was in for a rough ride I would deadass just end the call. A sadistic interview process is about as alarming as red flags get.",
            "Cringe interviewer. Send him this thread and tell him to read the comments. End your message with \"You're in for a rough ride.\"\n\nTo the interviewer: shame on you.",
            "I had a similar interview for where I am now but from a nicer guy I guess as I work here now lol\n\n\nCTO said we are going to do the small talk bit first and if they like me we will do the tech bit \n\n\nAt the start of the tech bit he said we will start off slow \"and the ride will get rough\" but followed up with he doesn't expect me to be able to answer them all, he wants problem solving and thought process on how I will look for answers to problems I don't know \n\n\nWas a surprisingly fun interview,\n\n\nJob before was like, what's a switch, welcome aboard ",
            "I wonder if these interviewers actually do their jobs or do they grind leetcode all day?",
            "Imagine being this elitist for a job create imaginary lines of code in an imaginary virtual world to fuel the cold dead machinery of unfeeling capitalism.\n\nYou wouldn't want to work with a narcissist like that anyways.",
            "Dudes like \"Here's some zero real world issues, solve em. If you can't do these few niche issues that I doubt you'll see outside of an extension or library that's already developed, Then you can't do this job because you'll figure out I can't do this job either. \" Dude also sounds like the type that gets really upset when people post questions to stack overflow. \n\nI'm glad I went to the network side. SWEs have the most asinine hiring process 9/10 times. \n\nWhat do you call a SWE that can't code? Manager.",
            "Name and shame.",
            "Sorry to hear about your experience. But the interview comes across as a jackass. Anyone who makes you feel devalued is not worth working for.\n\nI wish you all the best in your future applications. Just keep on going.",
            "You dodged a bullet, believe me. Don’t look back and try your luck elsewhere! Interviewers should treat you respectfully and build you up instead of putting you down. What a clown.",
            "Why all this for an entry-level job?",
            "I had this interviewer who asked me if the \"t\" in a python boolean is capitalized. When I told him yes he was trying to convince me that it wasn't. Saying stuff like, \"Are you sure? Is it?\" \n\nI was thinking this guy was a dick and I don't want to work with him.\n\nIs it though? 🤨",
            "The second some utters \"you are in for a rough ride\" I am turning into 4 dimensional object and I transfer myself out of that conversation into incomprehensible plane of existance. What the hell is wrong with these egomaniacs?",
            "Sounds like you dodged a bullet",
            "Sometimes interviewers are on a power trip, sorry you had that experience.",
            "report them",
            "I remember at the end of one my interviews, the interviewer said to me afterwards, \"I get that you have a passion for learning, but I find it odd that you don't seem to know much about computers.\" He came off a bit harsh that it stuck with me. This was an interview for a student internship at the help desk for the county. Fast forward over a year later, I interview for a full time position with the same guy and landed the job. Later I learned he had no clue about computers. He was the manager. Don't be hard on yourself. Everyone starts at the beginning and honestly, I appreciated the harsh words because it motivated me to better myself for the next. Good luck and keep going, it'll get better!",
            "He’s a very insecure person",
            "I don’t know your situation enough to know how much you needed that job, but I can confidently say you would have been miserable working with people like that",
            "You are also interviewing them, if 30 minutes is too hard to handle imagine working with that guy.",
            "IT jobs: The only place where interviews are tougher than the actual job",
            "The candidate that gets selected for this role will either be one of the boys, or exploited beyond reason. They will get the best benefits and possibility of high paying salary. All work, no life. Answering to everything and tasked with all of the problems. You might love the line of work… but it won’t love you.",
            "Buddy. You aren’t missing a thing lol. I’d the interview was that wack imagine how actually working there would be.",
            "Imagine having that attitude as someone who works in tech. Yikes 🤣 you dodged a bullet my man",
            "Bro speaks like he’s the joker, consider it a dodged nuke OP.",
            "Unfortunately interviewing is 90% luck and 10% skill regardless of what people on here might say.",
            "Sounds like you didn’t bomb the interview, they just don’t want to hire badly enough, or the engineer is gatekeeping.",
            "He sounds like he has no social skills and doesn't know how to interview properly. Nobody with two brain cells would EVER tell a candidate, even jokingly, you're in for a rough ride. Anyone with even an ounce of empathy for other human beings understands that interviewees are stressed enough without making it even worse. What a dickhead.",
            "How many of you actually have let code style problems you have to solve at work? \nAll while under pressure, without the internet to assist and your future at said job depends on how close you are to solving the problem.  Working roughly an hour of course.  \n\nLegit question.",
            "Good lord. Why do you guys normalize this behavior. \"Now let's find out who you really are\"... and asks about sorting algorithms.\n\n\nThis guy thinks he's recruiting people to hack the Gibson.",
            "interviewer think he's sans",
            "Do you remember what the problem was?",
            "Some interviewer are just like that and we can’t do anything. I remember once I had a interviewer who asked me questions on stuff that I don’t know and had clearly said upfront that I don’t know these topics but given time I can learn them but guy was hell bent on asking questions on that topic only.",
            "Probably the only time where this interviewer has some sort of power over other people in life and enjoys abusing it, while in private life hes a little pantyshitter",
            "Tell the recruiter. They want to know if interviewers are turning off applicants.\n\nAlthough, “you’re in for a rough ride” may have been said to try to lighten the mood and relate to you rather than be a threat.",
            "I don't know how others feel about this, but if I'm made to feel like shit during an interview for a role, I would be relieved if they rejected my application. How the interviewers treat candidates during the interview tells a lot about the work culture. No?",
            "This happens all the time. Engineers don’t like interviewing people. I have friends who are great engineers but fail everyone they interview because they’re a harsh grader.\n\nYes, that persons social skills are not great. They are probably good at writing code though. \n\nSorry you went through that. It’s not personal, if it were - the interviewer would probably have had more empathy.",
            "Keep trying",
            "Dodged a bullet there bro. Don't worry.",
            "Idk im pretty new to being an engineer but why do ppl not say who they are interviewing for or where they workv",
            "Saying “now this where we’ll know who you really are” is so pretentious lol. Guy is a douche, hang in there you might be surprised on how you did",
            "hurry dependent deliver support innocent wasteful adjoining towering wise arrest\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Sounds like power tripping, one day I will fire everyone of these guys when I have my own company.",
            "Simple. The company isn’t in a hurry to hire and has plenty of choices. They didn’t really care about hiring you in the first place. It’s like someone attractive on tinder with thousands of choices and can afford to be rude to some of them.",
            "I mean, if you have their name and where they work OSINT these days is particularly powerful and can be used to ruin narcissists lives.",
            "What LC was the first question that you aced",
            "Wow, that sounds like a terrible asshole to work for.",
            "You don’t want to be closed to that kind of animals anyway 😂",
            "Luke felt the same way on Degobah",
            "As much as that sucks, sounds like you dodged a bullet. Nobody writes code the way this interviewer tests for it.\n\nKeep your head up. Get at the next one 🤘",
            "Tbh you dodged a bullet and if that’s how the interview went then the actual job is gonna be hell. You’ll be better off somewhere else!",
            "You dodged a bullet, good job",
            "Sorry you went through that. Holy fk the interviewer sounds like a twat.",
            "Imagine looking to join the team, and already during the interview you understand that's he's playing against you",
            "What an ahole. Take it as a blessing and find a better place to work. Imagine having him as your boss or coworker.",
            "that's so cringe\n\nand I hope he reads this comment because he needs to know he's someone I would never want to work for or with or even have on my team as a subordinate",
            "Don’t let it bother you. This doesn’t define your self worth. Keep trying 💪",
            "Why do people feel like they need reassurance from their bosses or interviewers? If I’m not doing well I rather hear it and how I can improve rather than hear lies about how I’m good.",
            "Wtf why bro show up like nba scout talm bout “let’s see what your made of” gtfo you should’ve just left as soon as that hoe ass punk opened with that bs",
            "I've had an interviewer tell me that I would never go anywhere in life. He was very wrong but it was the worst interview I've ever had.",
            "Drop a note to the recruiter. I'm sure his manager would like know who your interviewer really is.",
            "Dodged a bullet.",
            "He’s not him tho",
            "Another case of the interviewer being a social reject ",
            "I fucking hate these kind of people. You know we not gonna use this bullshit in the job right?\nI once left a interview in the midway because of these kind of comments.",
            "Was probably Bloomberg they have shithead interviewers",
            "Fckem it is very interesting that when the men has power they become cruel animals. He probably had issues in his life. Fck corporate world. I started to hate it all after working a few different companies every one is sneaky especially managers all they care is their end of the year performance points they will end you in a heartbeat. I wish that I could produce something and sell it live in nature I dont want new phones cars big houses or anything is it possible?",
            "Name n shame",
            "I’m ngl you should’ve just laughed in his face when he tried that corny ass “you’re in for a rough ride🤓🤓” shit",
            "Seems like you dodged a bullet. \n\nRemember that an interview goes both ways.",
            "they are programming sorting algos in the company? because why the hell would anyone ask that bulshit. an interview should contain some relevant questions and not some random bulshit which is already solved in every programming language",
            "What organization was this?",
            "Would not want to work there anyway, dodged a bullet.",
            "The fuck? You had to code im the call? Like they didn't email you the exercise and give you a couple days deadline?\n\nWhere did you apply? Fucking Google? lol\n\nAlso the guy sounds like a cuck.",
            "I've been a software engineer for 6 years. Your interview has no bearing on whether you'd be good as a software engineer.\n\nI use all kinds of tools to solve problems, including search engines, Stack Overflow, AI for explainers, and my teammates. No one stands over my shoulder and demands to know my thought process as I work through those issues.\n\nEvery company thinks they're FAANG. Most of them are MySpace (Awesome site, but not rocket science.).\n\nYou dodged a bullet. \n\nGood luck in your search.",
            "I feel like this is still possible that u passed. I have had interviewers tell me that i was getting a tough question in a way that acknowledges its difficulty and takes that into consideration",
            "Honestly congrats bro - sounds like you dodged a bullet",
            "90% of the “problems” with CS are actually the problems with giving sniveling losers even a modicum of power along with the prestige of doing something that’s seen as “hard”,  “valuable”, and “exclusive”",
            "Which company is this?",
            "Yea no thanks.",
            "😵",
            "Interviewer showed us who they are. They are in this for boosting their own ego instead of screening in. I'd have inclined towards hire if a candidate solved one LC medium and was thinking clearly about the second one. Chin up OP. You dodged a bullet there",
            "I had an interview once where they hit me with the curveball, and when I asked him what I thought of my answer, he replied with, \"Why are you asking me? It's your code.\"\n\n\nSometimes the interviews just go like that ",
            "Cause they already got someone else in mind. You are just there to pad the stats.",
            "Look at it this way. You won't need to work with a prick.",
            "I know that not getting a job is a bad feeling, but you get to avoid working for a really shitty company with a terrible culture. As a rule, if your interviewer sounds like they  are reading off of a rejected script for a James Bond movie, you don't want to work there. Normal people try to ease anxiety during interviews.",
            "I had an interviewer like that at PayPal, but I couldn’t understand their accent on the phone and I think it made them upset. One of their 4 didn’t show up at all, one was rude as fuck. The others seemed to be solid interviews. \n\nOh well, probably dodging something worse there",
            "Don't worry, you wouldn't want to work with someone like that anyways. I had a boss that was kind of a punk like this, and it did not go very well. I wish he had not hired me.",
            "The interviewer has main character syndrome. I would run away as fast as you can.",
            "Wouldn't say you bombed the interview but the interviewer bombed it. Who would ever want to work with someone like that? Good riddance.",
            "Which company were you applying to?",
            "I don't understand why these kinds of interviews happen.  It's a waste of the interviewer's salary.  Why do companies let people do this kind of shit?",
            "i bombed a coding interview once cause i’m not into grinding leet code and mf goes “you are not ready. this is such an easy question.” I didn’t read the prompt correctly cause i was nervous and have dyslexia but like mans didn’t have to word it like that 😢",
            "Was the interviewer Indian?",
            ">he made me feel I wasn’t good enough \n\nThis is gonna come off very dickish. \n\nBut it’s probably because you were not good enough. ",
            "Dumb. As someone with 15 years of experience in the industry, you don't want to work with such people. That is just out of control egos and delusions of grandeur.",
            "Wait till realize how many people woulda crushed that interview. Don’t sweat it, keep pushing",
            "The first job is always the hardest to get with CS. Honestly a lot of interviewers act this way, but I tend to find that it shows how you'll be treated as an employee as well. There's a lot of shit to muck through,  honestly it's inevitable that you'll run into a few like this while looking for a job, or hey even making some small mistakes or bombing an interview with a nicer interviewer. It's completely understandable, but it won't matter at all to the next company you interview with and they'll never know. It's not a moral failing to make a small mistake in a high pressure environment, they're just a dick. Good luck!",
            "How they treat you during the interview is most likely how they’ll treat you on the job. I’d say it’s a bullet dodged",
            "Wow, that interviewer sounds like a dick.  They aren’t supposed to antagonize you.  He should not be conducting interviews, and I would really worry about the company culture.  With the market what it is, a job is a job, but still, sounds like it could’ve been a miserable place to work.\n\nI would be half-inclined to send an email to his boss about his lack of decorum.",
            "I hope you will not take this to heart. I know from experience how difficult it can be to avoid judging yourself in such situations.\n\nThis individual was a bully and intentionally wanted to hurt you. He may have tried rationalizing that his behavior was for the good of his company, but that does not make him right nor you wrong.\n\nI try my best not to think about these situations, except to use them as a motivation to keep studying and practicing.",
            "Doesn’t care about your thought process?? That’s the most important part. Shit interviewer.",
            "Moves pawn. Chess app: “Now this is where we’ll know who you really are.”",
            "I had an interviewer tell me, \"doesn't matter, the guy who solved it didn't get hired either\" when I couldn't solve a problem lol",
            "I am sorry you picked that field. Good luck.",
            "Lmao was he here???🤣🤣🤣🤣",
            "Honestly sounds like a dickhead and a crappy coworker. Wouldn't be surprised if people don't wanna work with him and pushed him to do the interview as a way to spend less time working with him",
            "Interviews like that are a general reflection on the company/department as a whole. You likely dodged a bullet in a probably very unhealthy tech bro work culture, with a guy who probably quotes more than he talks normal sentences....\n\nThe money doesnt matter if every work day is gonna be miserable.",
            "Sounds like you more dodged a toxic ass company and interview…..",
            "That kind of coworker can make your life way more miserable",
            "What position are u applying to .. just wondering",
            "Wow what a dick. Well, at least you don't have to work in a place where people who start interviews with cringe like \"you are in for a rough ride\" are in positions of power.",
            "You didn't bomb an interview: you dodged a bullet.",
            "Which company it was?",
            "imagine everyday you start your working day with: “ it’s gonna be a tough day for you. Let me see if you can last this month “ :))",
            "Just a terrible interviewer. It happens.",
            "Interviewers are often very egoistic and imagine they are teachers conducting a viva exam. They need to understand that interviews are not examinations and they are not in a position of power just because they are taking the interview. Usually, the same person would be a peer after joining the company.   \nAnd when they apply to your company, you would be the interviewer. \n\nInterviewers also don't realise that it's a 2 way street and even employees are interviewing companies to see if it is a good fit. \n\nI have also found that such egoistic interviewers are usually low rated programmers who are trying to hide their inadequacy. \n\nI once had an extremely egoistic and unprofessional interview from Twilio.",
            "What kind of sorting algos? Did he ask you to code a sorting algorithm like merge sort?",
            "I think you would not be hesitant to give the employer's name and country based on, so they would get a good lesson from that.",
            "Man, that sounds brutal. Sorry you had to go through that. Some interviewers really need a chill pill, you know? It's like they get off on making people sweat. But hey, props to you for acing that first quiz! That's something to be proud of. And seriously, sorting algorithms? That's like Interviewing 101 stuff, not a make-or-break moment. Sounds like he was just trying to flex his power or something. Keep your head up, though. One bad interview doesn't define your skills or worth. On to the next one, my friend.",
            "Elitism and complex of superiority is rampant in senior IT guys",
            "You just met a weirdo who likes abusing new job seekers. I met a lot of them when getting started. \n\nYou probably wouldn’t want to work for someone like that anyways.",
            "My friend had an interview for a Facebook internship. He's wicked smart (potential to be top of his class at a t20) and he started out the interview with something like \"I'm very excited to be here\" and the interviewer replied with \"Oh we'll see.\" During the questions as he was explaining his thought process the interviewer was getting frustrated and started barraging him with questions like \"That's completely wrong. Do you even know what you're doing? What's a stack. Explain a stack to me right now.\" What's strange is this interviewer was based in Russia (idk if Facebook has employees in russia? I originally thought it was some sort of outsourced recruiter). Despite this, he made it to the final stage of 2 other FAANGs and revieved an offer from another.",
            "It means either the interviewer was feeling insecure and therefore wanted to \"rattle\" you so that he feels good about it (he himself will fail to solve that problem under similar circumstance; sadist psycho) or they have already chosen another candidate for the position  but creating a record of rejection for other candidates by asking them questions which cannot be solved in limited time (unless the person has already seen the problem and memorized possible solutions).\n\nModern-day interviewing practice, esp. with LC questions is a complete BS as the ability to solve LC problems (either by memorization or mental shortcut) does not translate to building better software.",
            "I failed a fizzbuzz if it makes you feel any better.",
            "Bro I thought “csMajors was referring to “counter strike majors” and I was hella confused",
            "Terrible interviewer. Tech interviews can easily be tanked by bad interviewer leaning into some minutiae the interviewer knows that the interviewee does not. That’s usually some ego/maturity problem of the interviewer still needing to feel they are smartest guy in the room.",
            "Sounds like when a professor brags about how 80% of their students will fail 🫠",
            "cs majors seething is better than any cup of coffee",
            "I interviewed so many people. Never have I ever made them uncomfortable or undermined them and there were a lot of incompetent ones. On the contrary I always tried to help them out and give hints and try to push them towards a solution when they're stuck. In those situations its most important to hear their thoughts process and communication skills than anything. This guy who interviewed you was an incompetent asshole imo. I wouldn't be surprised if he couldn't solve that question he gave you himself if he was put on the spot.",
            "I would have invited 1-1 LC challenge knockout if that interviewer is so harsh and arrogant. OP, good riddance!! You will not sail but fly !",
            "Interviewer is a asshole but you do need to make sure you know how to do some basic sorting.  Keep practicing OP it pays off.",
            "I would email recruiter about your experience\n\nThat is not professional in the slightest and do not think he should be an interviewer. ",
            "Welcome to tech. You’re going to run across narcissistic assholes on a regular basis. You wouldn’t want to work there. Consider yourself lucky, use it as an opportunity to come back and better prepare for those kinds of questions on your next interview, and keep moving forward.",
            "I've done a lot of interviewing. I always tell candidates \"this is not a high-stress workplace, and in the interview, my job is to help you be the best you can be.\"\n\nIt's a shame that so many interviewers take the opposite approach, as if the (tech!) job will require you to work in a hostile environment constantly under super high pressure.",
            "Interviewer thinks he’s in an anime 🤓🤓",
            "You could have asked him let’s ride together 😂😝😂",
            "Not joking - reschedule. Pretend your internet is choppy / you can’t hear and get another interviewer.\n\nPeople don’t realize this hack and it works. It’s a good defense against bad interviewers like this. I’ve been on the other side for a while and wish ppl were more empathetic instead of passing on their traumas.\n\nIt’s harder to do in person but for phone screen you can.",
            "You never know",
            "Bro eats 10 satans for breakfast",
            "If it were 2021 or earlier they would’ve selected you.",
            "Its okay. If its your first, welcome to the club. Otherwise, best of luck for the next!",
            "Haha. Relax man. Not all interviewers know how to conduct an interview. Some of them are there just to satisfy their ego what they are better than the interviewee. And some are just sadists who love to see others fail. \n\nChin up. You did great. Don’t let a bad interview get in the way of your next interview. Best of luck.",
            "The best luxury being at the end of your career offers is the ability to tell these people exactly what you think about them. But imo, you should do that anyway and end the interview immediately, then tell the recruiter what happened.",
            "Probably experienced this kind of treatment as a child, now projecting on you and other candidates. Sorry. That sucks. When I interview, I like to acknowledge how stressful it can be to go through a coding exercise while someone is watching your every keystroke. I would not want to work with your interviewer.",
            "What a weird power trip some people have made over others. When I interviewed someone once, I was just as nervous as if I was being interviewed",
            "I've worked in places where people had similar attitudes, and they were not places that I'd want to work again.",
            "The interviewer was definitely a NPC from RPG game.",
            "Tbh I would’ve probably left. Idk why some interviewers like to come off intimidating",
            "It's not a bad interview. Expect the same in future.\n\nIn a standard multi-round interview, some rounds are harsher than others, these interviewers are to test how you respond to stressful situations. On a daily basis, they are not necessarily harsh people."
        ]
    },
    {
        "post_id": "197edan",
        "author": "xiventi",
        "title": "I got rejected by an internship without interviewing and I saw this message at the bottom of the rejection email. What a way to lessen the pain.",
        "url": "https://i.redd.it/1ja4hbwp2ncc1.jpeg",
        "score": 2137,
        "num_comments": 79,
        "created_utc": 1705339780.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/197edan/i_got_rejected_by_an_internship_without/",
        "comments": [
            "\"To ease the pain\"\n\nhttps://preview.redd.it/phhgcgh9mncc1.jpeg?width=523&format=pjpg&auto=webp&s=2b33d599fd17ee7b642876780fb8c7c962bf9c45",
            "i must be a hater at heart because this would have pissed me off even more",
            "\"To ease the pain\", trust me startup bros ur not that important lol",
            "I'm more annoyed that they're assuming I'm \"in pain\" because of their rejection. I see the humor in it but I'd change the language. \n\nMaybe, \"We will keep your resume on file for future opportunities. Please have this photo of a cute puppy as a token of our appreciation for taking the time to interview with us.\" Or some shit like that... also I'd change it to a kitten lol",
            "It really is a cute dog",
            "Imagine thinking you’re that important that you have to “ease the pain” for a rejection email. Woulda been one of my 13 reasons ngl",
            "Did they seriously trademark \"Not Like Other Startups\"? And there really is no good way to reject someone without risking hurt feelings so I wish they'd just stop trying with the animal photos and just give some good actionable feedback or something",
            "\"that dog eating you alive would ease my pain\"",
            "![gif](giphy|mBvUaCuDPEXNnIk2NK|downsized)\n\nIm ONE HR mail away man",
            "Looks like my dog when he was like two or three month old.",
            "This isnt comforting the intention behind it wasn't “this will ease the pain” it was more of a “look we are so nice and better than the others we treat people that we rejected  better”",
            "Yeah, those entitled snobs, „we are not like any other startup „ I bet in 2 years they are not around",
            "I got rejected from all my interviews..😭",
            "What a way to passive-aggressively grind salt in a wound.  If they seriously think this is cute and not insulting, they are delusional.  And if they let this kind of shit fly in their office, I can’t help but feel like you dodged a bullet.",
            "What is word turning too!",
            "hobbies treatment uppity familiar fanatical cake ad hoc quicksand drab sharp\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I love dogs and this still pissed me off...",
            "The wording doesn’t land well. Almost cocky and presumptuous.",
            "Nah this is funny af",
            "my pain is eased :0",
            "we can we please say back to them \"bold of you to assume i'm disappointed\" and come back with their reply",
            "I'm probably the only person who'd see this as a nice gesture",
            "Send them dog shit. \n\n\"I'm not like other rejected candidates.\"",
            "That’s messed up",
            "I mean at least it shows in some way they sort of care that rejection sucks. Plus it IS a cute dog. I can’t say how I’d feel personally to get it because it would really depend on a lot of factors. \n\nThe “not like other startups” is supposed to be funny, especially with the TM. I personally think it is. They understand that all startups think they’re not like other startups.",
            "Why the TM? Seems like a marketing thing.",
            "I'm allergic to dogs, I wouldn't apply a second time.",
            "But hey at least you weren't auto rejected by some algorithm, on the bright side.",
            "What company was this? We ride at dawn boys!",
            "Rejection is better than regret",
            "I like it the ^TM makes them seem self aware.",
            "Aww so adorable",
            "what an ugly dog",
            "Haha!! This is epic.",
            "R/notlikeotherstartup",
            "If that happened to me I would start a rival startup and copy their tech just to get back at them.   \n\n\nfr I would be so pissmald",
            "Pain has not been eased. Execute rage.py.",
            "So stupid",
            "They’re just trolling us at this point.",
            "Honestly, this is some shit I would do.... sighhhh i'm such a fucking millennial business owner.",
            "You are a Hello kitty fan without telling us"
        ]
    },
    {
        "post_id": "s5gi86",
        "author": "Different_Expression",
        "title": "No they’re not a diversity hire, you’re just a racist",
        "url": "https://www.reddit.com/r/csMajors/comments/s5gi86/no_theyre_not_a_diversity_hire_youre_just_a_racist/",
        "score": 2101,
        "num_comments": 808,
        "created_utc": 1642353542.0,
        "selftext": "So this post is largely inspired by [a recent post about Tech tiktokers](https://www.reddit.com/r/csMajors/comments/s4u0jk/what_do_you_think_of_the_tech_influencers_on/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf) in which the tiktoker jameslyonsswe was brought up as an example of good/non-exploitative tech tiktokers in the comment section. \n\nSome things to note about jameslyonsswe: \n\n- Graduated from Stanford \n- Got his first internship in the 10th grade \n- Interned at NASA during highschool \n- Got an associates degree while in highschool\n- Worked as a researcher at Stanford\n- Currently works as a SWE at Airbnb\n- Apparently completed 400 leetcode questions in 6 weeks \n- is Black \n\nOne of the commenters under the thread mentioned that they weren’t really a fan of jameslyonsswe because he seemed like he was just a diversity hire and didn’t seem particularly talented. \n\nAs a black person in tech who has similar accomplishments to jameslyonsswe (but honestly not Stanford-grad-and-NASA-intern-in-highschool level), I’m no stranger to the diversity hire comments but I quite frankly don’t give a fuck about them and I’ve always dismissed it as a mixture of racism and jealousy. I’ve always known I’m more accomplished than the average cs student and my resume speaks for itself. However, reading that commenter’s posts in the thread sparked something inside me for some reason. \n\nI realized that if people on here are willing to dismiss jameslyonsswe as a diversity hire, it’s a symptom of a much deeper issue of blatant racism and hatred. At this point you must just view all black people as inherently inferior in order to justify that mentality and I would just like to say in the most honest way possible that there is something deeply wrong with you. The black people in tech that you come across are not the problem, you are. You’re a racist. \n\nSo if you would like to continue living that way, good luck and enjoy being broke and bitter &amp;lt;3. \n\nIf not, here’s a few questions to ask yourself in order to figure out whether someone’s a diversity hire or if you’re just a bigot (it’s most likely the latter) : \n\n- If their race, gender, sexuality were switched to straight white/asian male (i’m adding asian men to this because asian men make up a large portion of tech workers relative to their population in western countries. i’m not dismissing all the hardships and discrimination faced by the asian community. I will always be an ally to asians), would  they still seem like a diversity hire?\n\n- Are there any prejudices you might have about an element of that person’s identity? \n\n- Do you have any role models with a similar identity to that person? If not, is there a reason? (are you likely to dismiss everyone with a similar background to this person as unqualified?)\n\n- Do you know enough about them and they’re background and accomplishment to even make an accurate assessment? (the answers is probably no). \n\nIf you answered yes to one or more of the questions above you probably have an issue. \n\nIt’s 2022 guys, this type of thinking is frankly ridiculous and i’m especially disappointed to see so many asian guys sharing the same mentality. As fellow minorities in western countries we share an understanding of what it’s like to be discriminated against and shouldn’t perpetuate that.\n\n\nEdit: Wow, what an experience. I’ve never had a post this “controversial” blow up like this. Here are some takeaways i got. \n\n- A lot of people on this community are kinda dumb. Judging from the really immature or blatantly irrelevant responses i got I would say their reading comprehension and argumentative skills could definitely be improved. But alas, it’s impossible to win an argument with a stupid person, so i had to give up in those instances. \n\n- The tension between black and asian students is definitely a delicate matter. I noticed a lot of the comments I made in defence of black students were automatically seen as disses towards asian students. I’m not sure why that was but I did find that interesting. however, there was no point in which i was trying to say anything offensive towards asians. \n\n- I stand by everything in my original post and i think the reception of this post is reflective of the dissonance a lot of non-minority CS students have about Affirmative Action and American race relations as a whole. Educate yourselves and stop being a piece of shit towards others : )\n\n\nEdit 2: Thanks to everyone who’s been PMing me. That’s really sweet but I just wanted to say it’s completely fine. Like I’m not really taking any of the negative comments seriously so don’t worry! I was also mostly expecting this reaction to my post based off other comments in this community.\n\nEdit 3: Holy shit, jameslyonswe made a tiktok about this!!",
        "permalink": "/r/csMajors/comments/s5gi86/no_theyre_not_a_diversity_hire_youre_just_a_racist/",
        "comments": [
            "Asian checking in here. Anyone who thinks diversity hires are taking all the jobs now needs to look at the *actual stats* companies post annually about hiring (the detailed packets, small text at the back, not some headline/pretty chart). Take Google for example, last I checked going from 2014 to 2019 *NEW* Black technical hires went from like 2% to 3% of all new tech hires. Overall workforce representation barely moved. Asians jumped up from like ~36% to ~50% of new tech hires.\n\nJust search up “___ Company Annual Hiring / Diversity Report”. A lot of companies don’t even post because it doesn’t look favourable / doesn’t align with all their talk about DEI.\n\nPeople who are frustrated, I understand job hunting can be extremely demoralizing, especially when you’re looking at your very first internship while in college. Hang in there and try to be kind to others.",
            "I have a black friend who is a software engineer. He got an internship at Microsoft freshman year and he got in through one of those minority focused recruiting programs. \n\nNow you could argue that gives him an unfair advantage or whatever, but when he actually started the internship a lot of his coworkers were openly racist to him. His team lead mismanaged their project and then put all the blame on him at the end of the internship. He got a return offer but ended up declining it due to how he was treated while working there.  \n\nNow he is searching for a full time job, and despite having a Microsoft internship on his resume, a stellar GPA, a good college, and other relevant experience, he is having trouble getting a job or interviews. He applied at my company and didn’t get hired, and I am a worse applicant than him in basically every way. \n\nI’ve seen his resume, it’s good. He’s very sociable and confident and would do extremely well in behavioral interview. I can only think of one reason why he is being given the cold shoulder a lot of the time and I think you know what it is. \n\nWhen people talk about these diversity programs, they seem to forget that they exist to OFFSET the bias that exists in the tech industry. It isn’t an advantage, it is to offset a disadvantage. Racism is alive and well in tech.\n\nEdit: thanks to everyone reaching out with job leads! My friend actually just got a job offer that they plan to accept",
            "> I will always be an ally to asians\n\nWhat's your position on Affirmative Action policies that increase the bar for Asians?",
            "I don't think it's fair to tell anyone they are a diversity hire because there are so many factors at play other than race.\n\nHowever, if any claim is being made it is that some races can are put to a lower bar. At Harvard, for example, the average SAT of admitted African Americans is 1420 while 1550 for asians. (source:[https://www.thecrimson.com/article/2018/10/22/asian-american-admit-sat-scores](https://www.thecrimson.com/article/2018/10/22/asian-american-admit-sat-scores)/). This is similar for some other colleges, and for STEP, FBU, Dropbox Launch, Uber STAR, and explore, those intern classes are 70%+ minority.\n\nIn many cases, some of these people would have accomplished those things regardless of their race. But the data says they are put to a lower bar, that's it. I hope this didn't come off as racist. In fact, I think a lower bar would be justified in cases where one had more hardships to overcome than the other.",
            ">a mixture of racism and jealousy\n\nSomething I learned being a CS student is most people are just never going to clap for you. Everyone here is just insecure, desperate to get theirs and looking out solely for #1. People who are more accomplished or have the things they're obsessed with (like a FNG role) are an identity/security threat so their lizard brain will try to find any cope it can come up with to not feel inferior and justify why that person doesn't actually deserve that (\"that person is just a diversity hire\"). The fact of the matter is, student communities are inherently toxic through a mix of immaturity, desperation and having an uncertain place in the world and everyone trying to claw their way towards getting theirs with a lot of competition.\n\nScreaming about how women and minorities have it easier just seems like a larval stage a lot of these dudes go through when they're brand new to CS and have put in 10 apps without success. The only solution I've ever found to this is to shut it off and go on being successful. What does NASA Stanford Google guy have to be mad about? Nothing. You don't need the approval of a bunch of whos on Reddit. The people who are actually qualified and have the power to determine who deserves those opportunities said yes.\n\nNone of this is really related to your points about racism but personally I'm just really done with the opinions of social media whos about who deserves what. Sorry whos, Google and NASA said yes. Die mad about it.",
            "If you're Asian you will know how disturbing the diversity hire or admission hurt your opportunities. we all human and just have one brain and two hands.\n\n\"Asian men make up a large portion of tech workers relative to their population in western countries\"\n\nThat's true. And they have the highest bar to get accepted/job offer. \n\nPS: I am not rampanting, I will do the best no matter what race or group.",
            "[deleted]",
            "🍿",
            "If Harvard admitted students based solely on the applicant scoring in the top decile of an \"academic index\" (=test scores + HS performance), the racial/ethnic composition of its freshman class would be expected to change as follows:\n\nWhite -6%\nBlack -94%\nHispanic -82%\nAsian +108%\n\nSource: https://samv91khoyt2i553a2t1s05i-wpengine.netdna-ssl.com/wp-content/uploads/2018/06/Doc-415-2-Arcidiacono-Rebuttal-Report.pdf",
            "Let's be honest: diversity hires do exist, which makes it hard for truly talented black people to convince people they are indeed talented. It sucks I know",
            "Lol. I just like how you said \"fellow minorities\" as if you're trying to get some tribal affliation being minorities in what I am assuming is the USA. I have yet to ever get that sort of treatment from AAs irl here in the states (I am an ethnic Mexican) and usually seen as a threat. \n\nMan I hate the ethnic tribalism of the USA.",
            "You're not an ally anymore the moment you've put Asian guys in your premises. Enjoy climbing up the stairs in your virtue signalling journey.",
            "[deleted]",
            "Yes I agree. Claiming someone is a diversity hire when you know nothing about them is likely thinly-veiled racism and also a result of their massive insecurity and jealousy. \n\nI’m a white guy. I wish I had your accomplishments or those of the individual that you spoke of in your post. But I don’t. \n\nAm I jealous? You bet. But I get that some people are just naturally better than me at certain things. And that’s ok. But you won’t catch me chalking up your success to a “diversify hire” in order to make me feel better. \n\nCongrats on your accomplishments and well done.",
            "The thing with being Asian is that while you might not be labeled as a “diversity hire”, having all these achievements would just seem “normal” to be honest. Everything in this post makes a lot of sense to me and I fully support it, but I dislike seeing Asian as having the same equal chances as some other races because that really is not how it works.",
            "so weird how CS majors have crippling imposter syndrome yet the worst type of god superiority complex literally no inbetween",
            "Minorities have to prove themselves at work just because others think that they are a diverse hire and are not capable of doing the job. I really wish this way of thinking went away...",
            "Lol people who say “diversity hire” are definitely as you said: jealous, racist, or both. No company is willing to hire an incompetent engineer just to show their diversity. If they hire you, it means they liked you and think you can do the job. Keep doing big things, and let the haters hate.",
            "I feel like you're entire post is a strawman argument. People would be wrong to say that jameslyonsswe in particular is a diversity hire because he clearly is not. His achievements stand up on their own and he wouldn't need his \"diverse\" identity to give him a leg up over others, but many people clearly do. If you take a sample of people on LinkedIn that have gotten prestigious SWE jobs at non-trading firms, you'll find that on average, underrepresented minorities have far fewer achievements as opposed to non-urms in terms of things you can do without any internships (personal projects, GPA, CS research, programming contests, etc.). If you look at trading firms, you will see that they hire almost no underrepresented minorities, and the ones they do hire are as smart or smarter than the rest. This would either indicate that trading firms are racist, or that these SWE companies are practicing diversity hiring for their entry-level roles and some people really are there because of their ethnic background. I'm on your side though. It is a shame that the image of smart individuals gets ruined by diversity hiring practices because they happen to be a URM.\n\nEdit:\n\nI'm an Asian male. I don't think I'm biased by jealousy as I have found a decent amount of success with my internship and full-time job applications. I just think that it'd be wrong to say that \"diversity hires\", i.e. people who wouldn't have made it to their position with the same family financial background + qualifications if they weren't a race that is considered underrepresented in tech, aren't prevalent.",
            "[deleted]",
            "I think in a perfect world a company would hire anyone who fits their needs regardless of skin color. If that meant the whole staff ended up mostly or fully of one race you can rest assure that it wasn’t racist and just the best candidates.\n\nHowever, systematic racism is still a huge problem wether people like to admit it or not. An office full of white guys might not have all been the most qualified because they passed up on some intelligent colored people. The whole point of diversity hire is to combat this ingrained systematic racism. Not all companies are racist, some do hire fairly and theoretically wouldn’t need a diversity program. But unfortunately there is no what to prove that in today’s world.\n\nAs morbid as it sounds though, I do think it’ll get better once the boomer generation is gone. Just considering the time period they grew up in and many of them still hold offices or cooperate positions.",
            "It’s hard to break into the high-paying side of the CS field. When people see someone else do it, I think there are a couple neurons that fire here:\n\n* why did they get in and I didn’t?\n\n*now begins to feel self doubt and needs a coping mechanism*\n\n* what do they have that I don’t?\n\n*notices they’re black*\n\n*remembers all of the comments about how CS needs to become a more diverse field and the fear they experienced of being pushed out*\n\n* resort to falling back on previously experienced fear to explain their lack of competing success with the more successful.\n\nIt’s a mindset of fear. It most certainly can and frequently does stem from bigotry, but those people’s thought processes can be more complicated than that.\n\nSource: am white straight man, once felt that way, realized that I’m wrong.\n\n\n\nEdit: I’m actually going to clarify why I felt how felt and why I realized it was wrong before I’m seen as a bigot.\n\nI’m white, but I grew up in a very liberal area, with a liberal family. There are people of all races that are in my family. Based on my circumstances, I had never witnessed racism against non-whites in any substantial way. \n\nI dated a black girl who lived in a poor area in the city (I lived here myself at one point). Extreme racial prejudice is a part of very recent history, and we are now in a time period of recovery. A black man and woman in the 20s were not given the same opportunities, and as a result, 100 years later, many families are stuck in poverty. The girl I dated believed she couldn’t afford college, and was planning to be a waitress for her entire life. I personally never saw me “not being able to afford it” because I was willing to take out loans (even though we made no more money than her family did). This is the biggest reason why colleges are so overwhelmingly white.\n\nIn college I heard about the issue of diversity in college, and I believed it was an issue, but I did not have first hand exposure to racism. \n\nWhat I realized after my first internship in a republican area is that racism is still very real. \n\nThis was my realization:\n\n* it’s true that sometimes a recruiter may be tempted to choose a black woman over a white man who is equally qualified sometimes, for the sake of improving their numbers.\n\n* it’s more likely that both candidates would get an interview and they would choose the one they vibe with the most.\n\n* it’s also true that sometimes a recruiter might be less tempted to choose the black woman over a white man based in internal prejudice.",
            "Your title says it all: \"No they're not a diversity hire, you're just a racist\". Sadly true. \nThen, alongside the seen large number of people who absolutely lack basic reading or comprehension skills (as you pointed out in your edit in response to yet more dumbf☆ckery) it becomes glaringly clear that we are indeed still living in a society where our fellow human citizens actually believe that they are superior. Pathetically true. \nIf you or someone you know thinks this way, it's a case of racism, yes. But also something else which goes too often missed and is not spoken of nearly enough. And that is both the sheer stupidity and deep mental illness  one must have to truly believe such a nonsensical notion of being in any way \"superior\" to others based on being born. \nI understand environmental factors, that racism and bigotry are taught. However, that is simply not an excuse. I grew up with racism being shoved down my throat; Everywhere I went from School to Church.  Everyone I knew from my own beloved Family members to friends and neighbors. \nBut even at a young age I knew that it wasn't right. It felt off, not okay. I dreaded the rhetoric and in listening to it I wanted the floor to swallow me up. Even at 5 years old I knew that the Adult's jokes were cruel. I Loved my family. I adored my Grandmother. But I still distinctly remember the emotional and physical discomfort whenever talk of other people, people we didn't even know, were being labeled, or joked about, or the ludacris \"lessons\" aka warnings I'd receive.\nI always felt an unsettling icky knot in my stomach, a lump in my throat, my heart would suddenly feel too heavy for my body.  \nAnd as I grew, so did my mind. And my friend circle. And my life experiences; Getting out of that town, moving to bigger cities, traveling, learning and adapting to various cultures. Living.\nIf I had stayed in that town I would have gone crazy with boredom, but not crazy enough to become a Racist A-hole. In short, there is no excuse. ZERO excuse to be an idiot who wants to be superior. GTFO of here with all that.",
            "Morgan Freeman in an interview rightly said that racism starts with people referring each other as White/black man.\n\nThat's absolutely true. I'm not from the US but I've always wondered why it is such a norm to specifically mention someone as black or white? If I were a black person, I would not like people calling me black - not in a derogatory sense and not in an acceptable way. Adding black, white, asian etc., forcefully puts you under a tag which good people may avoid but racists may end up abusing. So why don't we just get rid of those tags? If someone specifically asks which ethnicity a person belongs to, then we can mention that.\n\nAnd regarding the diversity hiring, I feel it's not how it should be. People should be educated with all the privileges given if required. But it should always be based on need rather than race. There might be a white person sleeping on the streets who would want his kids to study, this person is more deserving to get any help rather than a black kid staying in a healthy neighborhood. Hiring should always be based on merit which will negate all the possibilities of 'unfair' hiring as some would feel. Due to this, even the deserving candidates would have to carry around their resume to prove their worth every time. Diversity hiring is just a thing to increase inclusivity but it all comes down to racism which starts with tagging people with black/white/asian labels.",
            "how can you have similar acomplishments as this guy and use a fucking tiktok. if you are an old person who takes social media seriously dont worry about those comments because they are probably written by 14 year old kids who wants to be an hacker when they grow up and they think they are being cool by being racist.",
            "While I agree with most of your points and I do think that a lot of people calling others diversity hires are mostly a result of jealousy, but what the industry and quite frankly institutions are doing are not exactly helping with that aspect. \n\nI think most ppl who get hired are most definitely qualified or appear qualified for the job, not because of their race and gender. However, it is worth noting that minorities (except asian ofc) are given extra hiring opportunities. So there are DIVERSITY HIRING OPPORTUNITIES, but not much diversity hires. You will see a lot of intern programs that outright say it is for colored minorities, etc. Career fairs with FAANGs that only black, latino or specific genders can attend. \n\nWhether that exactly is fair or not becomes a personal opinion. I personally believe extra opportunities should be only given to those from harsh backgrounds, such as low income, single parenthood and first gen college students (which most African Americans, and colored minorities do fall into those category). Giving extra opportunity just because of one’s color or gender is not fair as the example you have said, someone could have already achieved a lot, such as going to Stanford or coming from a wealthy background even tho they appear to be a colored person. This actually not only introduces inequality, but hurts minorities who truly need help. If you look at Minorities at Ivy Leagues, a lot of them are from wealthy families. The same happens with the intern programs. But ofc, how you view these opportunities are up to you. \n\nBut I will make a final note. Calling someone a diversity hire without any basis, is absolutely racist. But whether one views the extra opportunities such as the ones I mentioned given to minorities are fair, is a whole different story. Plz do not confuse the two, and the latter, whether you think extra opportunities given is fair or not, should not be viewed as racist opinions.",
            "A lot ARE “diversity/inclusion”’hires though. Don’t sugarcoat it.",
            "“Poor kids are just as bright as white kids” ~ guess who🥰",
            "I'm a Colombian woman and I studied Physics for some time but did not graduate. I was a minority, 90% were male. I had to work harder to show to my peers that my value wasn't on my body, but on my brain.\n\nNow, I'm studying CS in the USA. Do I care that I am a minority? No, because I know that I'm going to have to show that I'm worthy of a position or a grade. \n\nThis country has a weird thing with races/minorities in general. I just see people, different personalities and opinions, but just people. I will treat them in the same way that I want to be treated. \n\nAm I concerned about how the future looks for me? No, because independently of my origin I know that I am a good worker. \n\nBe nice to your peers, be nice to everybody. Before making criticism about the world, it is a good idea to start looking inwards... Maybe the problem resides there.",
            "James is literally the nicest guy on tiktok - I’ve commented on his posts many times asking for some help on some leetcode stuff and he replies every single time",
            "The fact is women and men having different pipelines on interview",
            "He also made a LinkedIn post!  That’s why I’m here!\n\nExcellent post, by the way.  I had a project manager that I worked under for the past two fall seasons (mid-July through mid-January), and had some of the worst experiences in my career during these projects.  Since he’s black, I had to give it a long, hard think as to whether race had anything to do with it before I spoke up about the difficulties I was having, namely a lack of communication, review notes on my work that lacked merit, and long turnaround times when I submitted work for review, which wreaked havoc with my workload and managing other projects.\n\nTaking the time to think things through, being objective and making sure that I also considered if I would have the same reaction if this person was white was critical as well.  I will not complain unless the issues have merit, and I wouldn’t call anyone a diversity hire.",
            "I am a black female founder and decided to start my own company after realizing how out of place I would always feel at large tech start ups (did two technical internships at google and that was enough for me). If any engineers are looking for a job DM me and I am happy to see if we can find room for you on my team.",
            "I am glad you brought this up.\nI have thought the same for awhile now but I haven't heard it as well explained as this post before.",
            "Well said 👍🏽",
            "Just dropping in as someone who has had their own hardship in finding employment. It can be difficult, I saw all 5 of the female friends I had made in my degree program during university get placed. Two of them I had  helped study for classes I had already taken and having worked with them on projects I know I was on pretty equal footing with them in terms of skill. Just about the only thing I don't know is their interview and application process. \n\nAll that said, I know first hand that it can feel demoralizing just trying to get an interview. Seeing a pattern like that it can feel like others have an easier time. Those feelings can turn to resentment and you can look for something to blame.",
            "Diversity hire is not here to take your job. Places hire people that can still do the job, not for fun. They both interview the same. Companies don’t have diversity hire questions waiting in their back pocket. And like the reading above, some diversity hires are very experienced and talented, and they feel like they have to be because well they don’t want to be called a diversity hire.",
            "lol yes many ppl are diversity hire though…. Personal experience working at big MSFT. It’s baaaaaaaad",
            "I work in a big tech company and we do have diversity-hire quota every year. I can assure you the hiring bar is never compromised for full-time positions. The company is not stupid. Every hire is a fully qualified individual no matter their race or other diversity factors. In fact, I have worked with many brilliant black engineers in my career years.",
            "100%. From my understanding, the minority communities have a tougher time breaking into any educational space, much less the higher paying careers. So the odds are already against them even making it to the interview stage in the first place. Often they’re held to higher standards than non-minorities because for some reason they’re made to represent their entire race / ethnicity / gender / sexual orientation which is extremely unfair.",
            "I have a question for you fellow redditors that think every black person is a diversity hire.\n\nIf you think thats true then why dont you apply for jobs and say you’re black since its so easy? I’m also curious on your take about employers not hiring people with “foreign-sounding” names\n\nTake Google for example, why is it that 50% of their workers are white, 42% Asain, 6% latino, and 4%black? Clearly, more white people are being hired so what’s the issue? Or are you just racist? \n\nAnd what about April Curley, an ex-google recruiter, who claimed Google did not hire from HBCU’s because their bar was lower?\n\nHave any of you even thought for a second that maybe a minority candidate was more prepared and more qualified than you? (Yes, I know...shocking) \n\nIm genuinely curious why your mind goes to “ahh, it’s because their black” when someone gets accepted?  Yet you dont do that for other races? \n\nNo matter how I look at it, it seems to be sheer jealousy at knowing that a person of color can be better than you.\n\nEdit: If you’re capable of downvoting then you’re also capable of providing an explanation.",
            "Another virtue signaling post about diversity hiring?",
            "The only reason I maintain a 4.0 GPA is because I feel the need to prove to racist students that I’m “competent” enough, because anything I accomplish in industry will be scrutinized being a black dude. In their eyes I’ll never be good enough but wtv 🤷🏾‍♂️ can’t do much about it. Oh yeah btw POC solidarity doesn’t exist and never existed lol, studying CS confirmed that for me.",
            "My sister is in a category that would make her a \"diversity hire\" but only if she discloses it. She is already very talented and smart, and she doesn't really want to disclose her diversity, but she knows that disclosing her diversity would likely help her get better internships. It's an interesting dilemma.\n\nI wouldn't want to refer to anyone as a \"diversity hire\" anyway since no one really knows the conditions of one's employment.",
            "I think it’s mostly just jealousy tbh man. The other day I was having a conversation with my brother who dropped out of college and openly admitted it’s cause he didn’t wanna do the work, was unemployed for most of his life, and at most took a few online lessons on Python. Safe to say he never made it in the tech industry. Then he goes onto say that it’s so hard for a straight white man like him to succeed and our younger cousin, who is a straight white man but also a fucking genius when it comes to computers, is fucked once he enters the job market.\n\nNo man, our cousin is gonna do fine cause he actually knows wtf he’s doing. Does being a minority help you get hired? Yes, I’m not gonna pretend that’s not a factor. But it’s cause women and racial minorities get treated like shit in the workplace and, also, they are STILL MINORITIES. They still make up the very small minority of the industry so how can you even say they’re making it impossible for you to get a job. Bottom line is if you know what you’re doing, you can get hired somewhere. If you’re clueless, no employer’s gonna touch you with a 10 foot pole. People are always gonna look for the easiest excuse when they realize they aren’t where they want to be in life, and in the tech industry the easiest excuse for many people is the diversity hire.",
            "[deleted]",
            "[deleted]",
            "I’m just starting to learn coding etc to better myself and take care of my daughters and ur post has giving me the push I need cause I’m a black man and i have a friend who’s black and works with tech and he’s having second thoughts on working in the tech field because of a bad experience he had from a couple of racist remarks made to him.  Your post has giving men fuel to continue my education and to push forward I’ll email ur post to my friend who’s kinda of down cause he was forced to leave his job because nothing was done about his situation when he confronted his supervisor.. thank u for ur post",
            "Minorities have to work twice as hard to prove themsleves to some non-minorities who doubt their intelligence. For those types of people it still isn’t enough.\n\nI’ve seen this happen in healthcare too, doubting Black & Asian medical professionals just because of their race and downright refuse care from them until a white associate with the same credentials gives the exact same care. \n\nIt’s really sad. It blows my mind how this happens across workplaces.",
            "[removed]",
            "[deleted]",
            "I agree that you shouldn't accuse someone of being a diversity hire without any knowledge of their background or proficiency. If your only evidence is their race, then that sounds like a racist judgment.\n\nHowever, I find it deeply ironic that in this thread, there are people that want differing standards for different races who are accusing the people who want equal standards of being racist.",
            "I have two degrees and am about to complete an MBA, have worked in 4 countries in different roles. Two of those are in tech. I also happen to be black. I got my big break in tech because I was driving Uber while job hunting and my passenger took a chance on me. \n\nBy the comments of many on this thread, they would probably see me as some diversity hire, despite the fact that the Uber rider who championed my resume and got me in could clearly see the talent on there, and not necessarily the skin. \n\nThere isn't anything I have in life that I have not earned through far more hard work than my peers who don't look like me. If you can't get in and you think it's cos of \"diversity hires\" like me, then you better go suck a lemon or use your privilege to get a startup funded...",
            "Thanks for the posts. Everybody has biases, and these kinds of posts help me keep my biases in check. The worst racists are the ones who claim they don't have any biases and are completely objective.",
            "Speak the truth king. felt all of this.",
            "Bar is lower for targeted minorities and females to a lesser extent. That doesn’t mean every target minority wouldn’t have passed standard bar but some def get in due to the lowered bar. \n\nDiversity hiring helps certain races and hurts the chances of others. However, it could possibly be beneficial for society in the long run even if it could be considered a racist practice as it gives preferential treatment to blacks. \n\nDon’t get defensive, facts are facts",
            "With the talent shortage in CS in the US, companies can’t really afford to be racist. It’s not like a non-technical industry where a manager can be racist and just hire someone else. Right now I’m hiring anyone who can pass a screening code question and case study regardless of their race. I would say tech is the most representative of talents in the industry (only for Americans because visas issues exist). It’s like the Olympics, fastest times win regardless of race.",
            "Non-black CS students will literally treat race/gender like it's a stat boost it's so weird...if anything they're probably getting rejected because they applied late and no one saw their application",
            "This post is crying “I’m a victim!”.",
            "The way I see it, even if I was a diversity hire, I'm still better than almost everyone at my school when it comes to coding. I even started the leetcode club at my Uni, I'm a TA in algorithm&analysis... So even if I'm 3.5 from a school nobody cares about, I still know I'm pretty fucking awesome. And I'm very Black.\n\ntldr IDGAF, I'm still a good hire regardless. If anyone around me wanted to believe I'm inferior, then I have already put them in their place.",
            "OP, you are so brave to post this in this subreddit. It was pretty obvious to me that most of the replies would be defensive instead of introspective. Don't let the bigotry get to you too much ✊🏽",
            "One of the first life lessons you learn as a young black person is that life is not fair. \n\nSo whenever I see or hear non-black people complaining about affirmative action or diversity hires I just have my self a good chuckle, and wish I could rub it in more somehow.",
            "I always found it funny how the CS kids who complain about being required to take “useless” classes for their major like sociology and African American studies are the ones who bring up shit like “diversity hires”. \n\n🤦",
            "As a black person perusing tech it really is disheartening to hear about this kind of stuff, but validating to know that others feel the same way and have had similar experiences. This means a lot to me thanks so much!",
            "Also the people who benefit from Affirmative Action the most is White Women. 🙄",
            "I really appreciate the info you’ve shared here.",
            "Ironic how these people argue that it sucks that they are viewed inferior to their peers because their peers assume they got the job because of their race/gender, and they support diversity hiring, which strengths the sentiment among people. You cant have it all and against diversity hiring!=racist.",
            "I don’t get why ppl so pissed at “diversity hiring”. The reality is no companies get fucked from hiring minorities “at a lower bar”. Y’all too obsessed with your personal achievement.",
            "These comments are more atrocious than expected.  CS+Math majors, AA and Latino studies minor here. It's always the one trick ponies calling others diversity hires. 🙄",
            "Idc what race u are or how u got to do it. If the jameslyonsswe notes are accurate that’s dedication and hard work. Regardless of color he’s a stellar applicant. It’s easy to see why people would openly want to dismiss achievements that prob rival their own. Def racist to think color got him those achievements.",
            "[deleted]",
            "Preach 🙏🏻👏🙌",
            "I think a lot of Asians share that mindset b/c of assimilation/insulation to keep the heat off of themselves. It’s sad. I also notice Asian devs get treated drastically differently than white devs on teams I’ve worked on. I’ve also been the only black guy on my team(s)",
            "It is worth mentioning here that black job-seekers have markedly different job networks than white job-seekers. [Pedulla & Pager 2019](https://journals.sagepub.com/doi/full/10.1177/0003122419883255) analyze racial differences in job *network access* (the leads that job-seekers receive through their social networks) and *network returns* (the benefits that job-seekers gain by leveraging information in their social networks). The study finds that black job-seekers experience significantly fewer *network returns*, meaning that even though white and black job-seekers use their social networks to find jobs at equal rates, the social networks of black job-seekers are less effective in assisting them to find jobs. One limitation of this study, however, is that it is not specific to the tech industry, and the results may not generalize.   \n\n\nGiven the history of segregation in the United States, it is not surprising that black and white job networks differ in their effectiveness. Furthermore, a [report](https://www.payscale.com/compensation-trends/referrals-hurt-diversity/) from PayScale found that referral processes disproportionately benefit white men (likely driven by the social network effects mentioned above). The report states, \"If you have 100 referred employees, 44 of them will be white males, 22 will be white females, 18 will be minority males and only 16 will be women of color, holding constant industry, location and other relevant variables.\" Referrals are a crucial component of many tech companies' hiring processes, and companies should consider either eliminating or restructuring their referral processes to encourage greater diversity among applicants.   \n\n\nLastly, there is some evidence to indicate racial and gender bias in hiring in the STEM field. Specifically, [Eaton et al 2020](https://link.springer.com/article/10.1007/s11199-019-01052-w) finds \"Faculty in physics exhibited a gender bias favoring the male candidates as more competent and more hirable than the otherwise identical female candidates. Further, physics faculty rated Asian and White candidates as more competent and hirable than Black and Latinx candidates, while those in biology rated Asian candidates as more competent and hirable than Black candidates, and as more hireable than Latinx candidates.\" However, this study focuses on slightly-above-average candidates but other [research](https://www.pnas.org/content/112/17/5360) finds that gender bias favors females when examining exceptionally well-qualified candidates. Additionally, this study was conducted in the context of academic research, and it is possible that the findings do not generalize to an industry-focused context.   \n\n\nI have seen several comments which argue that programs meant to prioritize underrepresented students (i.e. Microsoft Explore, Facebook University, Google STEP) unfairly lead to hiring decisions on the basis of race rather than merit, fueling the \"diversity hire\" narrative. There are 3 points worth highlighting here.   \n\n\nFirst, if it is your belief that applicants ought to be hired on the basis of individual merit rather than group membership in a particular race, it would still be highly inappropriate to participate in mocking others as \"diversity hires\" given that you know nothing about their performance in job interviews that led them to be hired in the first place. If it is wrong to use race to hire someone, it is equivalently wrong to use race to denigrate someone when you do not actually know whether their race played a role in their hiring decision.   \n\n\nSecond, I believe the morally appropriate compromise (that balances individual merit with the general desire to increase diversity within tech) is to utilize first-generation low-income (FGLI) status as a condition to enter such diversity-oriented programs (i.e. Microsoft Explore). FGLI is racially neutral but will disproportionately benefit members of racial minority groups simply by virtue of the fact that a [greater percentage](https://firstgen.naspa.org/files/dmfile/FactSheet-01.pdf) of minority groups are first-generation low-income. Furthermore, I would argue that students from FGLI backgrounds necessarily display great merit (even if it does not manifest on a resume) by pursuing their studies in spite of the obstacles that they face as a result of having fewer educational mentors and financial resources.   \n\n\nThird, companies such as Duolingo have also [experimented](https://blog.duolingo.com/diversity-at-duolingo-why-its-important-to-us-and-the-progress-weve-made/) with additional methods for increasing diversity among the intern pool. Specifically, Duolingo extended the application time period to later in the season, target schools with diverse computer-science student bodies or computer science organizations. Therefore, even if you do not support programs which explicitly consider status in a underrepresented racial/gender group, there are other hiring policies that appear to contribute to greater diversity in the computer science profession.",
            "Good post. Don't know why its being downvoted so much",
            "These people have no idea what it means to be black and trying to break into big tech! \n\nDuring one of my internships interviews, the interviewer told me he was surprised I could solve the question because he usually give the same question to senior engineers\n\nBlack people like myself have to work twice or 3 times as hard.\n\nIf you’re black and you’re work or intern at big tech, know that you’re twice as qualified to be there!",
            "Yeah but the reasoning goes that how many of those things (Stanford admission, NASA internship, Airbnb job) did he have a lower barrier of entry for by virtue of being black? That’s what people wonder. You see tons of top universities and top companies have programs that provide an easier way in for blacks, latinos, and women. Everyone knows this. These groups aren’t held to the same standards",
            "Agreed 100%. At the end of the day everyone needs to pass the same hiring bar. Some people on this subreddit will never understand it.",
            "The fact that how this sub behaves is the testament to why attempt to combat racism, let it be effective or not, should still exists. Every non-white person’s accomplishment in this job will be brushed off with reasons corresponding to the person’s racialized group and it’s pathetic.",
            "This stuff makes me glad to be south american, because down here there's racism but not towards brown people, so that's one less thing I need to worry about. In north America being brown would definitely put me at a disadvantage. Sometimes it's good being down here.",
            "This comment section is the absolute worst and just shows the prowes of how much work needs to be done within tech to fix it. None of these online spaces are for it because it brings out all the racists, mongrols and misogynists of all colors on reddit/tiktok. I'm sorry OP that these people seem to have the gual, as I've also been seeing and subjected to the same shift in the indudstry also. These tech companies are literally being sued all the time for discrimination, yet champion themselves as woke. Like the others said find allies in all forms, find your own niche, and no need to get affirmation from cesspools like reddit/tiktok. You are already brilliant in your own way, so lead off of that, and associate with people of that caliber.",
            "Ill never understand a boss, who hires based on looks, rather than qualifications, that sounds so counterproductive.",
            ">\nOne of the commenters under the thread mentioned that they weren’t really a fan of jameslyonsswe because he seemed like he was just a diversity hire and didn’t seem particularly talented.\n\nSo, this is all about perspective. From my POV, he very much still is a diversity hire, despite the fact that we can estimate him to be quite above average. Why is this? Simply put, there's a Princeton study that says being black is worth about 230 SAT points when it comes to college admission. The average black SAT at HYPSM is about 1340 while the average white SAT is about 1570. In percentiles, the average black SAT is 90th percentile and the average white is 99th percentile. So, if we consider these accomplishment to be Ivy League intelligence + hard work, and then factor in his advantage from being black, we can estimate that his IQ is about 120, i.e. 90th percentile, whereas a white person would have to have an IQ of over 138, 99%+, in order to achieve enough to be allowed to intern at NASA in high school and so on. While his achievements are impressive, I can predict that his intellectual output is only going to be in the 90th percentile, which actually could be surprisingly bad for a programmer. I'd like to see more data on what the average IQ of a programmer is, but I have seen that about 12% of the population can code to some degree, 2% do it full time, about 16% can do calculus, and a similar percent have some job that boils down to working with their brain. This makes sense, this is roughly everyone who is +1 SD IQ and it's a big reason why some many black people struggle with poverty. The economy priviliges intelligence. Anyway, we might venture to guess someone with a 120 IQ is going to be about average as a SWE. I found someone leaking some private data [here](https://old.reddit.com/r/learnprogramming/comments/2ue71p/what_iq_do_you_need_in_order_to_be_a_programmer/co7m3ax/) more or less agreeing with this assessment, so yeah. We have other posts about how the bottom 20% of people who get hired are basically fakes or can't do fizzbuzz and I believe that --- especially in this economy with the diversity mandates we have. Statistically speaking it's highly probably that diversity hires are strongly overrepresented in that bottom 20% of programmers who basically harm codebases more than improving them. So what we have when we see this tiktoker is probably a rare example of a black programmer who isn't in that bottom 20%. In terms of white/asian programmers though, he's probably average, based on the statistics. Looking at his tik tok sort of confirms this for me, he just looks like another white \"midwit\" to me, with dark skin. I see a tiktok, YA, Python, leetcode, no sign of 140+ IQ genius like [here](https://www.gwern.net/) , [here](https://scottaaronson.blog/) , or [here.](https://kirkegaard.substack.com/) \n\n>\nI realized that if people on here are willing to dismiss jameslyonsswe as a diversity hire, it’s a symptom of a much deeper issue of blatant racism and hatred. At this point you must just view all black people as inherently inferior in order to justify that mentality and I would just like to say in the most honest way possible that there is something deeply wrong with you. The black people in tech that you come across are not the problem, you are. You’re a racist.\n\nIt's not about \"inherent inferiority.\" Black people are better than white people at running, football, basketball, etc. Does that mean I think white people are inherently inferior? Whites and Asians just happened to evolve to be better equipped to program computers, which happens to be economically in demand right now. The reason why people get upset over diversity hiring is because it discriminates against whites and Asians based, allegedly, on the false notion that evolution stopped at the neck. The job market is very hard for whites and Asians because they're always hired as a last resort after all of the minimally qualified blacks/hispanics/women/others are picked up. \n\nAnyway, the rest of your post seems to be pretty much filled with ignorance and hate for Asians and especially whites.",
            "America is so divided and full of hate and racism",
            "So you work for a FAANG or tier 2 company? Because If you lack the Stanford degree and the NASA internship I don’t really see the comparison. Lol jk, just shitting on you. \n\nBut yea, if you have a CS/EE degree from Stanford you’re the cream of the crop. Def not a diversity hire\n\nAlso discrimination is harder ( but obv not non existent ) in big tech. You either write the algo with the optimal time complexity or you don’t. There’s only a single right answer ( you may get there diff ways, but if you need to solve in O(m+n) or something and your algo does that you got the right answer ). I’m lukewarm on the issue. I think companies should go entirely off whiteboard and take home assessments. That would eliminate the racism wildcard",
            "Diversity hires do exist. My friend's company hired a dogshit employee just because of his appearance. It does happen. The question becomes when to recognize someone as a diversity quota hire or as a hire based on qualifications. Equity and equality of opportunity cannot coexist. Equality of opportunity means just that. Equity means quality is overlooked for outcome. For example, nobody complains that NFL and NBA teams need to be more inclusive to non black players. The sports world practices meritocracy. The best of the best get the starting jobs. It should be this way in the business world as well. Lastly, I would take all these racial anecdotes with a grain of salt. Just because some rando on reddit says his buddy was racially discriminated against doesn't mean there isn't more to the story. \n\nIf you want proof of forced diversity and racial quotas, just watch tv. Almost every single commercial these days has a POC cast. It doesn't bother me, obviously, I'm just simply pointing out that racial quotas and hires do exist. It's not always racism.",
            "What happened to filing a lawsuit for discrimination",
            "What's his tiktok page?",
            "Now I'm not saying there are no racist people out there, but blaming it all on racism is the easy thing to do, it gives easy answers, requires no actual mental work, and it reinforces victim mentality (when that exists in the first place). \n\nBut I would suggest looking up what Thomas Sowell has said on the issue, or Walter E. Williams.",
            "It's hard to take the resume of any woman or minority seriously when you can't prove they were never offered any of those positions for their actual talent.  Not to say they necessarily lack it, but not to say they necessarily have it either.",
            "Do you believe genetic characteristics should be factored into hiring processes? Yes or no.",
            "[deleted]",
            "Tfw when you are only just now finding out that Asians *also* look down on black people.",
            "all of his accomplishments could be attributed to the fact that he is black and that it is much easier for black people in tech. also, doing 400 leetcode problems in 6 weeks isn't an accomplishment."
        ]
    }
]