[
    {
        "post_id": "s7uv7h",
        "author": "watercolor_",
        "title": "I bombed an internship. Now I have an interview with another company, but the interviewer is my manager from the old internship. What to do?",
        "url": "https://www.reddit.com/r/csMajors/comments/s7uv7h/i_bombed_an_internship_now_i_have_an_interview/",
        "score": 610,
        "num_comments": 116,
        "created_utc": 1642612023.0,
        "selftext": "I was completely useless during the internship. I fluffed up my internship experience on my resume. Wondering if I should cancel the interview because I already have a job.",
        "permalink": "/r/csMajors/comments/s7uv7h/i_bombed_an_internship_now_i_have_an_interview/",
        "comments": [
            "Give us an update once you do it, cause I’m dying to hear how this turns out.",
            "It means your manager also “bumped “ previous company. So it’s ok :-)",
            "Fake mustache? 🥸",
            "LOL that's some rowdy luck.\n\ntbh it may be awkward... But he left that company for this one for a reason? You can ask him what made him switch and what he like about the new place?  There may be an opportunity there to discuss how this internship may offer things the other one didn't?\n\n\nThere may be a chance that he's just interviewing you and you may end up on another team anyway?\n\n\nIt's awkward but just go for it.",
            "Do the interview just for the laughs. If it goes well, great! If it goes south, ask the manager why they left the previous company.\n\nFor all you know they'll say something like \"I didn't feel like I was doing meaningful work\" and that might change your mindset of being completely useless, maybe the uselessness came from the top?",
            "Pull a Nike and just do it. Worst comes to worst, you don't get the job. No matter what, you get some valuable experience out of it.",
            "Gaslight him and say you weren't ever his intern, were on a completely different team and this is your first time meeting him. If you do it confidently enough you'll convince him",
            "Just do it",
            "Don't cancel it. In the worst case scenario, it's awkward as hell and nothing comes out of it. There's no harm in going forward with it.",
            "Don't step on their dog.",
            "DO IT. Might be funny",
            "In all seriousness you tell the recruiter that you’ve had a prior relationship with the interviewer and request a new one, citing the conflict of interest.",
            "It’s impossible to bomb an internship. It’s like bombing a breathing contest. Extremely hard to lose",
            "RemindMe! One Week",
            "following",
            "lmfaoo",
            "Please please please make an update post lol",
            "What exactly happened with your internship to make it not great?",
            "I dont think the interviewer typically sees your resume. I've never had an interviewer see my resume at companies with >10 people.",
            "Isn't this a conflict of interest? I'm who to contact, but it sounds like something that's not allowed.",
            "Since no one asked- how is your relationship with this manager? This matters a lot.",
            "Sink or swim OP. Interview with him. Was your failure at the last internship to do internal personal issues or was it a junk work environment? Consider your prior experience at the last company so the two of you can talk about it. You might find yourselves more connected than you expect.",
            "Just do it. If you turn down the interview, you have 100% chance that you failed. If you do do the interview, you still have a chance of passing.  The manager already saw your resume, knows who you are and agreed to interview you. If your old manager thought you sucked, he couldve just told hr to pass on you without wasting his or your time.",
            "I think you just entered \"that episode\" of a 90's sitcom my friend, enjoy",
            "Any update mate?",
            "This is pure gold kdrama energy. pls go through with it cuz you already have a job.",
            "OH MY GAWWDD YEAH DO IT KING!! 😂😂",
            "here is my advice: go on any interview you are offered *if you actually want the job*, regardless of whether you think you are going to get the job. Crazy stuff happens. You never know. Your old boss might just think the whole thing is funny.",
            "Just do it and be 100% honest with them.\n\nUse it as a learning experience. say you've grown since then and realized how useless you were.",
            "Here's my take:\n\nThe manager clearly knows who you were, he probably saw your resume during screening and still opted to interview you. It might be worth interviewing and seeing how it goes, maybe your manager from your old job is sympathetic to how your internship went at the old place and thinks you had potential and might do better here.\n\nWorst case: extra interview experience, a fun story to tell and no harm no foul.",
            "This is a conflict of interest. Email HR immediately and tell them that the judgment of the manager might be skewed and biased. They will assign you to another interviewer.",
            "What a rare situation have you got yourself into XD",
            "RemindMe! 5 days",
            "Gg hf",
            "Take the interview. Explain where did it go wrong.",
            "People who hire interns know that interns are very green and have no idea what they are doing. It’s a place for you to learn how much you don’t know. You probably didn’t bomb as badly as you think, and since some time has passed, you can certainly communicate how much you have grown professionally and personality since then.",
            "Serious question: how does one bomb an internship?",
            "Nah don’t cancel and go with the interview. Even if you didn’t too well in the previous internship and the manager knows, try to show in the interview how you’ve improved since he/she last worked with you.",
            "It means your manager is looking for revenge. Please interview and let us know how it goes.",
            "How do you bomb an internship? I’m kinda scared for this summer then lol",
            "Go to the interview and say \"Hello there\", and continue like normal. \n\nIf he brings the resume lies up, just say \"the dark side is a pathway to many abilities some may consider unnatural\" and if he gets pissed at some point on the interview repeat \"so uncivilized \" until not able to keep repeating. \n\nBeing serious, I would try to glare over it, if impossible there's a chance to salvage it, I mean, he did switch too. Just don't bury deeper your pit, or cancel it outright.",
            "Just curious, how exactly did you bomb it? Was the tech stack unfamiliar and/or really hard to learn? Were the features you were supposed to implement too complicated? I haven't had a formal internship yet so I'm scared of bombing one also.",
            "Own up, take responsibility and say how much you learned from the mistake.",
            "Do the interview so that you'll have either a really weird story of how you got a job there or a funny laughable story of how you got rejected. You can tell your grandkids XD",
            "RemindMe! One Month",
            "GG\n\nJust do it\n\nIf u really have conflicts, ask the recruiter to reschedule and likely it would be someone different.",
            "Similar situation",
            "[funny nose and glasses ](https://m.onfancy.com/fuzzy-nose-and-glasses-classic-disguise.html?gclid=EAIaIQobChMItuTO_afA9QIVhhXUAR0ngAo5EAQYAyABEgLkWPD_BwE)\n\nDude I got you covered ^ \n\nWorked for me anyway",
            "RemindMe! 4 weeks",
            "if you really bombed your internship, your company would have fired you in the middle of your internship. Otherwise, it means you were okay. So don't worry and def do the interview",
            "Ur Chilling, Go in there and fire the boss.",
            "Lol you’re hilarious! 😂🤣🤣 are you being serious though ?",
            "Why do you think you bombed the previous internship?! What happened?",
            "OP it's been a week where is the update",
            "Update pleaaaaase",
            "Dude no update?! Wtf"
        ]
    },
    {
        "post_id": "zrwd0d",
        "author": "erinthefatcat",
        "title": "GOT AN OFFER!!!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/zrwd0d/got_an_offer/",
        "score": 610,
        "num_comments": 58,
        "created_utc": 1671646860.0,
        "selftext": "Literally best Christmas gift. Been applying since September with a mixture of ghosts / rejections after OA / first round. It’s a marathon not a race and it’ll all be worth it guys so keep grinding.",
        "permalink": "/r/csMajors/comments/zrwd0d/got_an_offer/",
        "comments": [
            "W",
            "CONGRATS!!!",
            "Congrats, when did you graduate?",
            "[deleted]",
            "Congratulations!",
            "How often did you get ghosted or \"we have decided to move forward with other candidates\" responses after applying? \n\nI'm looking for internships and I've applied to probably a few dozen companies, but I either get no response or the reply that I wasn't selected for an interview, and I'm just trying to keep my head up and keep working on projects and learning so I'm ready for an interview when it comes",
            "Which company",
            "Congratulations! Which company is it if you don’t mind sharing?",
            "LET'S GOOO Enjoy your holidays!!!",
            "YAYAYAYYY!!! So proud of you !! You are so deserving of this. I am confident you are going to crush it at your future opportunity. Sending you lots of positive energy :)",
            "Congrats!\n\nI’ve Been looking since October for a remote position and just had (another) final interview today. \n\nSweating bullets and crossing fingers tonight!",
            "Common u/erinthefatcat W",
            "Congrats!",
            "Nice stuff",
            "W",
            "Is this for summer ?",
            "Congrats!",
            "Congrats",
            "KILLER! Congrats!!!",
            "W",
            "Congrats!",
            "YOOOO CONGRATS!",
            "Congratulations!!\n\nAnd thanks for sharing the good news.",
            "CONGRATS!!!",
            "LETS GOOO! congrats man🎉",
            "Congrats!!",
            "Congrats",
            "W",
            "KING",
            "W",
            "Congratulations",
            "Let's gooooo!!@ Congrats!!!",
            "Congratulations!!!!",
            "congrats! well deserved, and it seems like you've really grinded for this",
            "It really is the best Christmas gift, congrats!\n\nAnd I know how you feel as I was offered a  software dev internship in Dec. Excited to start working but also nervous.",
            "W!!!",
            "Congrats buddy!!!!",
            "Was it from a bank ?",
            "No bragging",
            "Bravo comrade",
            "Congrats!!!!",
            "Biggggg congrats, that's awesome!",
            "Congrats!! I'm a new grad searching for a job too and now you've inspired me! Good luck! I'm sure you'll do amazing!",
            "Just imagine if every person instead of participating in this rat race just stopped grinding leetcode. Companies would be forced to get rid of horrible leetcode practice."
        ]
    },
    {
        "post_id": "1amnt9b",
        "author": "VictorChen1",
        "title": "A Comparison of Last vs This Year's Application Cycle (Ex-FAANG)",
        "url": "https://i.redd.it/w32kpvi97khc1.png",
        "score": 603,
        "num_comments": 66,
        "created_utc": 1707484246.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1amnt9b/a_comparison_of_last_vs_this_years_application/",
        "comments": [
            "Bro is really THE other candidate companies move forward with",
            "4 offers out of 6 interviews is pretty damn good",
            "How did you accept 3 offers? Are they for different internship timelines?",
            "“About to apply” is crazy lmao",
            "Dude you need to drop your resume",
            "Companies with no intention to respond to job applications truly do need to be regulated harder, this is so disheartening",
            "2 offers from 5 applications is the wildest ratio I’ve ever seen",
            "sable merciful lunchroom badge vast cable telephone light tart chubby\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I'm sorry but I want to know what app or website is this? I also want to track my job application.",
            "Guy's hes got a BS already and is getting a masters or already has it. Don't compare yourself if you're still undergrad, especially if you aren't even a junior yet",
            "Where did you apply ???",
            "3 accepted offers ?",
            "Where did u accept",
            "How do you track all these applications? what tool do you use?",
            "What app do y'all use for this, serious question",
            "[deleted]",
            "You accepted three? Are you planning on cloning yourself?",
            "Bro tracked about to apply and website bugged 😭",
            "I’m so screwed",
            "last year I had to do 300 applications. This year I did less than 100",
            "Good"
        ]
    },
    {
        "post_id": "whuyxe",
        "author": "TourDVP",
        "title": "A question for Google interns",
        "url": "https://www.reddit.com/r/csMajors/comments/whuyxe/a_question_for_google_interns/",
        "score": 612,
        "num_comments": 34,
        "created_utc": 1659810724.0,
        "selftext": "Do google interns still get the ‘Intern’ propeller hat? I need some motivation rn and your boy is a material girl 💀",
        "permalink": "/r/csMajors/comments/whuyxe/a_question_for_google_interns/",
        "comments": [
            "yeah",
            "\"your boy is a material girl\", someone give this man an award please",
            "this post was kinda wholesome OP",
            "WHAT\n\nThis is incredible",
            "yup  lol. Absolutely atrocious. The backpacks they give are pretty great though.",
            "They do but you’d never catch me in public wearing it",
            "Yes! if youre lucky it will say \"intern\", but sometimes you get the less cool \"noogler\"",
            "This is the kind of post we needed to see!",
            "Lowkey want one. Idc about my age",
            "Hahaha. I just looked it up. Yeah undergrad interns are definitely the “babies” of any company.",
            "your boy is a material girl\n\nI am confused what this means OP\n\nEdIt: I get it now . I am a dumbass",
            "Yeah! I wore it to the office and people couldn’t decide whether they wanted to shame me for wearing it or respect the boldness of the drip.",
            "...",
            "They do, sometimes you might even be able to get a Noogler hat."
        ]
    },
    {
        "post_id": "16nr24m",
        "author": "honestbitchnosorry",
        "title": "Zillow has decided stop hiring SWE from the US. Hopefully this is not a trend",
        "url": "https://www.reddit.com/r/csMajors/comments/16nr24m/zillow_has_decided_stop_hiring_swe_from_the_us/",
        "score": 605,
        "num_comments": 191,
        "created_utc": 1695230642.0,
        "selftext": "Heard from my friend working at Zillow that their CTO has announced they will stop hiring SWE from the US, and all the headcount including backfill will be hired in Mexico, except the highly skilled jobs such as applied scientists will remain in the US. \n\nIt looks like the explosion of computer science / SWE around the globe has allowed the higher ups to save money. \n\nWhether they will succeed is another topic. Companies had tried that trick many years ago outsourcing jobs to developing countries but failed. But will they succeed this time? Considering we have used to working remotely and the infrastructure for remote jobs has matured. As long as they can speak English and do their jobs, this decision doesn’t look good for many high paying SWE in the US.",
        "permalink": "/r/csMajors/comments/16nr24m/zillow_has_decided_stop_hiring_swe_from_the_us/",
        "comments": [
            "A Zillow summer intern here. Here's some tea: as far as I know, no dev interns were extended a return offer this summer. Management brought up the news to our intern managers today. I talked with a bunch of interns in a group chat, and none of 'em have heard a \"congrats\" (including me and another guy who got exceeded expectation assessment). During my 12 weeks there, my team added 2 senior devs from Mexico.\n\n&#x200B;\n\nIdt this trend will continue since most companies are pushing for RTO policies nowadays, and collaboration + morale are never the best in half-remote, half in-person teams. Zillow is one of the rare ones that remain completely remote after the pandemic, so that justifies their decision. I doubt if it's going to be beneficial in the long run though bc collaborating remotely is really hard, not to mention different work cultures/values.",
            "Good luck to them if so.   \n\n\nI've hired people from other countries. It is *hard*. Even contractors, knowing the cost to drop them is lower, it is hard to find someone even reasonable, let alone good, if there is any real cost savings to be had. And if you want fulltime (and the presumed loyalty and ownership that implies) the risk is higher all around. And even if they speak English pretty well, if they're not fluent, there is a disconnect there. There usually is a cultural difference too that plays out in various ways.  \n\n\nBut all of that implies the thing; if someone is good enough to compete with US devs, they...move to the US. Even with all the layoffs here, there are still massive pushes for H1Bs (for a similar reason; that visa sponsorship is worth a lot, and companies can offer below market wages), because of people who want to move here to work. There are more good devs in the US than any country you can hire more cheaply, and the culture tends to lead to better outcomes for companies (for both good reasons and bad).",
            "You get what you pay for",
            "Not enough high quality devs (yet) in Mexico/latin america for this to become widespread IMO.\n\nAs far as outsourcing to eastern euro/Asia, companies lose a lot of agility.  Zoom was handed a huge opportunity in 2020 and basically did nothing with it.  IMO a big reason was they outsourced all development to China and couldn't iterate fast.",
            "yep I just talked with someone and they don't have an intern program for 24",
            "[deleted]",
            "The problem with outsourcing is that the outsourced workers have even higher turnover than the non-outsourced software engineers...",
            "Zillow management almost tanked the company a couple of years ago by leveraging billions of dollars on real estate based on their housing price model which really was just Facebook's open-source Prophet time series forecasting library. I trust they are making an equally wise move here too.",
            "The biggest hurdle I’ve seen is the English language. The h1b visa holders here are fluent but not native and the ones overseas have a totally different culture from the ones over here. One can read a technical spec and discern the country it was written in and believe me the most difficulty that people have is with the native American-English speaking authors/documents.  Zillows estimates are notoriously low anyway so who needs them.",
            "They've probably not worked with devs abroad enough to know that it really is not that simple. For a wide variety of reasons.",
            "Looking at the actual Zillow job listings board, this friend might be over exaggerating atleast according that.  Sure I see a number of Mexico telework jobs posted 5 days ago, but I also see remote domestic swe jobs posted 2 days ago.  All positions seem to be at senior level.",
            "Might be, I was checking out some FinTech jobs for cybersecurity (what I do) and literally every single one of them for CME Group and ICE were based in south India. That’s probably one of the most idiotic things I’ve ever heard of and if anyone wants to make some easy money I highly recommend [redacted]. These major financial institutions will probably have some serious security problems in the next couple years.\n\nThis is gonna be an industry trend for a while.",
            "Zillow also bought up a shit ton of house the last few years, jacked up the prices, and are now in trouble because they can't sell the houses at the inflated rates. This is probably an extreme cost saving measure, one of many, so that they don't file bankruptcy in the next few years.",
            "American companies should outsource management and the C-suite. It would save and incredible amount of money.",
            "Shame on them, outsourcing American jobs",
            "The most talented people are on US soil. Let's see how this goes. For Boeing it was just a plane crash.",
            "Assuming this is true, this is precisely why everyone should unionize.",
            "Any company that does this I think should be made to pay higher taxes. You don't get to reap the benefits of the largest market and basically have most of your workforce outside the country. At that point, you should be considered a foreign company imo. Make it so costly that they're basically paying in taxes the money they could've spent on American developers",
            "If most of the US based SWEs quit and go do some gardening for a few weeks I bet suddenly they could get the company to change their mind.",
            "I got a verbal offer from a start up rescinded because the CEO decided to follow this this trend right after the hiring manager decided to give me the offer. Feels bad man.",
            "Ha. \n\nAs someone who lives in South Korea (the 13th largest economy?) they're in for a rude awakening. Even though countries like South Korea are advanced economically, and socially, culturally many things are out of date. \n\nOne thing I've noticed is front end coder here still code websites like they looked 20 years ago. I kid you not. Outside of major conglomerate companies like Samsung, all medium to small companies here have websites that look like they stepped out of 2003. \n\nAnd they charge 10s of thousands of dollars for these websites. And Koreans pay it because it's normal. \n\nThere are so many apps and services I use here that are still coded using outdated technology that Westerners are abandoned long ago. But Korea is very slow to catch up because they can still make money but not updating anything. \n\nI know Japan is also like this. \n\nSo I can only imagine how bad it will be at less developed countries than Korea and Japan. Americans don't realize how many countires value image over actual ability. \n\nKoreans, for example, value the appearance of being competent over actual competency. So you regularly encounter people that have no business doing certain kinds of work because they are incompetent in it. Despite possessing some paperwork that says they are qualified. And if they are older than everyone else, no one is allowed to say anything. \n\nSo you literally have incompetent doctors with outdated skills sets still practicing medicine and patients are responsible to find someone more competent. \n\nSo I wish them luck in less developed countries. They will find a lot of yes men but not alot of people that can actually deliver the end result. Because these countries, to some end, think you should be understanding to their disorganization and incompetence to some degree because it's culturally acceptable where they come from. And rules and standards are flexible in their minds. \n\nWhich is *not* the American way. \n\nI also read somewhere that these companies end up having to have US developers fix their code because peopke from other countries will follow zero coding conventions making the code unreadable. \n\nAnd I wasn't surprised.",
            "&#x200B;\n\nhttps://preview.redd.it/v5d95wvlvipb1.jpeg?width=1235&format=pjpg&auto=webp&s=50d7f3c0c38a3e40022786b701959d5c07b7de87",
            "Have you ever compared the cost of a developer in the us and around the globe and also the quality of the education in CS?\n\nBecause the US has a lot of top ranked universities in research but education level is pretty mid and a lot of outsourced devs are really good and really cheap… can’t say it applies to India tho",
            "eh i wouldn’t worry. top talent still wants to be in USA 🇺🇸 🦅",
            "This has been a thing forever.  The problem with bargain hunting for SWE is that you get what you pay for.  In general the folks that are really good are already good enough to immigrate to the US or work at prestigious companies locally, why would they bother working for peanuts at an American firm?  Then… the pendulum swings back.",
            "HAHA.  I've seen this movie first hand AT LEAST twice over the past 20 years. When a major company tries to offshore their entire development team their thinking is always \"hey, they speak English, so everything will work out fine.\".\n\n Every time I've seen it happen projects collapse and eventually the company, if it survives, comes to its senses and brings at least some of their development onshore.\n\nZillow is fundamentally a software / technology company that has outsourced their software development.  Their only chance is to hope that they have enough market share to survive and no new competitor comes along to eat their lunch and innovate faster than them. Because make no mistake, the speed at which they can execute on innovation will dramatically slow down.",
            "They're going to learn reeeal quick WHY we hire US engineers. When you have non-tech people outsourcing tech people from outside the country, the code quality becomes absolutely trash, just absolute negligence, and the money they think they saved on cheap developers ends up down a well when they're taking 4x the hours to complete their work because of absolute negligence. Also makes customers unhappy when they experience tech issues and have to talk to people from outside their culture who have no stakes to solve their problems.\n\nI'm not saying there aren't quality developers in other countries, but I am saying you aren't going to find them.",
            "Well the US government really needs to do something if this starts to become a trend. Especially due to Covid, companies have gotten a taste of the remote work, and they can do this for many other jobs too. I’m a US Citizen, so I need some priority over others.",
            "Lyft is doing the same. Stripe cut pay and started hiring new grads in Bangalore.\n\nThat’s smart.",
            "[deleted]",
            "Good luck! Hiring overseas hasn't worked for the company I'm a part of.",
            "I work for a company that hires contractors a lot from Ukraine and South America. I am not going to lie, these devs are top-notch and speak great English. US devs should be worried about this. These devs also have no need to move here either, they just adjust their work hours and the time difference hasn't been much of an issue. At this point, the government needs to put limitations on hiring outside the US. It's not fair to American citizens that we lose jobs because it's cheaper to pay laborers outside of the country.",
            "This isn’t happening they are just setting up a pretense in Mexico City. Most big tech companies will do this. Offshoring has been talked about but decades now and it has still not been an issue for a reason",
            "I am not sure why everyone thinks US devs are such a cut above the rest of the world. I have been working on distributed teams for years and many of the best devs I have worked with are from outside the US. Companies who don’t look at a global talent pool will struggle to compete over the long term.",
            "I hope they start looking to Canada. They can pay us less than U.S peers and we’ll work just the same, operate in the same time zones, and speak the same language. We don’t need $140,000 USD for a comfortable life, about $90,000 USD up here is pretty solid. \n\nYo Zillow come to Canada 👌",
            "I think companies underestimate the advantages that people in the US have over the majority of countries, in my home country something like having a computer was a luxury, and using platforms like AWS (besides impossible for political reasons) would be very risky, because at the minor fail you are in the hands of Amazon support team. But I think Americans also overestimate themselves,they should invest a little more in pre-college education, because education is kind of too easy compared to more academic focused countries, in other words I think that the US is not producing enough brainpower, is just exporting it,and long-term this can cause that more companies start outsourcing to other countries.",
            "So many people in this thread are throwing mud on non US developers, and are so wrong.\n\nThere are many good software engineers outside the US. I would agree the US has the majority of experienced and staff+ talent, but at the senior and below level places like Mexico and Argentina have very capable and good developers.\n\nHow do I know? I've been hiring and working with amazing people all over the world for the last 15 years. Notably, two companies I worked for were SF bay series C/D unicorns. One had engineers on four continents. I currently work with a significant amount of South American engineers. Brazil, Argentina, Uruguay. Great talent and people. They are building distributed backends handling significant scale. Not trivial work and requires a lot of deep technical knowledge. One person I'm working with is also a computer science professor at a local university in their home country. There are very smart and talented people outside the US.\n\nThere are downsides, but its similar to any distributed remote team environment. People need to be great communicators, particularly in an asynchronous way. The two specific downsides to international developers I've seen is 1) bridging work culture differences and 2) US market knowledge. As an example of 2, I saw a startup in a specific domain (say, US tax software) locate their development team in Europe, and then faff the product itself.",
            "Overestimating your talent is never a good thing. US has the highest concentration of talent in the world but other countries are not far behind. More often than not, SWE is just grunt work which can be easily done by any competent engineer around the world.\n\nGoogle, Amazon, Microsoft and other big tech companies have been hiring outside the US for a long time. What makes you think it won't work for Zillow?\n\nAcknowledging this is the first step in ensuring you think about how you can upskill yourself and avoid this situation.\n\nFor example, if you're a normal backend SWE working with python, postgres, Redis and some message queue, try to think how you can upskill yourself, possibly dive into cloud ops etc. \n\nIf you're a frontend engineer, try to get yourself more into developing cross native platform development.\n\nBeing confident is one thing but being delusional is another thing. Good luck 🤞",
            "I worked as a contractor IT for a staffing company making $17/hr. I was sent to do IT work like cable management, monitor installation, etc.. in major tech places like Salesforces, Apple, etc... I noticed that most of the workers in those places are indians, I think they are all H1Bs. It's cheaper to hire these people because you can pay less and make them work more. Also, in my local news showed a tech company laying off many programmers because they got AI to do the work.",
            "There must be some Indian guy in management pushing this idea 💡 so that he can hire his uncle and nephews who couldn’t get H1B visa",
            "Context:\n\nI work at a Mexican multinational as a data analyst / data scientist, this is my first job.\n\nI'm a UNAM CS dropout, studied there from 2020 - 2022 but got very bored and left when I got a job offer, nevertheless, I'm getting a degree soon-ish (November 2024) through passing a knowledge test (given that I don't fail the test of course).\n\nI get paid a very very very low amount by US standards (like 7,500 USD annually), but I'm honestly living a decent life, I share rent and expenses with my father, and if I got a raise (some of my peers are earning up to 17,000 for the exact same job I do) I could live a very comfortable life, and start saving for a mortgage downpayment and/or retirement.\n\nNow, I have no idea how good people in CS in the US may or may not be, perhaps you are actually multiple times as good as I am, I don't know, but let's say you could do the work me and my 3 coworkers do for ~15k annually.\n\nCould you live comfortably in SF with 60k? in Austin? in NY?\n\n30k? Even in bumf*ck nowhere, could you live in idk ... Albuquerque, or Tulsa (is that a city in the US?) for 30k?\n\nCould you rent a nice apartment in a decent part of the city for $500? Or buy a luxury apartment in the nice part of the city for 420k?\n\nCould you commute daily for $5 or for as little as 60¢? (if your home and your job are near a metro station, the metro costs $5 MXN which translates to 29¢)\n\nI also have never lived in the US, so I don't know for sure if any of these are possible, but I feel the folks of r/LateStageCapitalism would tell me no.\n\nAnd maybe my lifestyle is worse than the poorest people in the US, again, I can't be sure.\n\nBut all in all I feel the cost of living is soooo much cheaper here than in the US that even if you need 4 of us to do the job of a single one of you, the greedy corporate overlords might still end up hiring here.\n\nI'm reading what I wrote, and it came out sounding angry(?) That's not my intended tone, but English is not my first language, I'm sorry, I wish I could earn double my current salary flipping burgers, and I'm sure you would love to pay a third of what you do for rent, but we can't, and I think if we were angry we should be angry not at each other, but at the system that oppresses all of us.",
            "I have also heard a certain 800 lb gorilla is doing the same for the majority of its openings....maybe it's time to call my Congress person and complain about it.",
            "I don’t understand why everyone in the comments thinks that this is new. Big tech has been hiring from countries like India and Poland for a while now. And they are still there. Microsoft, Amazon, Google, stripe and even tesla now…\n\nI realise mid/small size companies won’t last hiring from other countries because they don’t have enough experience to understand what kind of talent to hire.\nBut zillow is a pretty good sized company….Them and other companies that are expansive enough can make it work outside the US",
            "[deleted]",
            "That explains why their app is shitty.",
            "Wait… hire in Mexico, or hire Mexicans?",
            "Nobody will be able to compete with US talent for new software development. They’re likely sending maintenance dev work to them which you don’t want for yourself anyways",
            "Good. The people in Mexico need jobs. Hope it continues",
            "My company started to hiring SWE from Mexico.",
            "Companies have tried this and have failed miserably I doubt this is true tbh. It does seem like they are hiring rn in Mexico City would not be shocked if they just opened an office there to try and get into the Mexican market. Zillow for the most part only works in the US rn",
            "Even if the absolute best devs are in the US, for a company like Zillow in a market like this, the devs they will find in other countries are good enough for their business needs, wouldn’t be surprised if it becomes a trend",
            "If your company has had bad experiences with non-US devs not being up to par with US devs, then your company needs to revise their hiring process. If non-us devs were so far behind, then many big tech companies wouldn't even exist outside the US.",
            "I don't think companies are any more stupid than people smoking copium here. Project management side of things are more in demand than code monkeys in the US. Outsourcing is bound to happen.",
            "Unless there's an official source citing this.....",
            "Why wouldn't it be a trend when they can hire cheaper SWEs overseas? It just makes more sense to limit the amount of onshore swes and raise the number of offshore ones, to save on labor costs, etc, and herein lies the problem with SWE in general. It is easier than most other jobs to ship overseas",
            "It's fake news.",
            "off sourcing to europeans would make a lot more sense",
            "Well y’all kicked the guy who kept the jobs in the US out of capital  P position couple years ago with a retard .",
            "lol had our CTO who came from zillow try this more so on pressure to cut costs. Hired 5 devs from venezuela/columbia and tried hiring 5 more. We had the entire team quit in less than 3 months due to small timezone and language barriers. As well as them just not being as good.  \n\n\nProceeded to backfill like 10 roles and fired all the south american devs. Good luck zillow, shit has been getting worse for years and it's gonna get even worse somehow lol.",
            "It's hilarious because the post right above this on my feed was someone from outside the US asking if they can expect a US salary if they're being recruited by a US company.",
            "I mean...this is exactly what the CEO is thinking...it's Zillow. The app pretty much does what it does and owns the market. There's not much innovation to be done. What problems are left to be solved? Maintenance gets shipped offshore and a much smaller innovation team stays in the US. If Zillow faces a real competitor it can spin back up again, but it gets more profit just by releasing SWEs and cosating.\n\nThis is what happens to companies that aren't *really* tech companies. Zillow is real estate and it kinda won. Exactly who is it competing with and why do they need top tier talent to beat them? Redfin? Hiliarious.\n\nI don't think this is a tech trend so much as it is an end-stage capitalism trend.\n\nCompanies that were built 10 years ago to 'disrupt' the market succeed, gobble up all competition and go into rent seeking mode. The end game of companies like Zillow and Uber are not to develop software, but to fuck over last-generation competitors and slam down monopolies Google/Facebook style. As companies move onto the 'raise prices and strangle' stage, they'll ditch their tech corps as a cost center. After all when you own the market, do you really profit by improving your software?\n\nTech is tech. If there are too many monopolies, let's fucking 'disrupt' politics and anti-trust those fuckers into the ground.",
            "The bubble is gonna burst now or later bro. Companies en masse deciding to outsource something that can be remotely done like SWE was a given since the whole thing started.",
            "Just l2code advice is dead.",
            "This comes and goes in cycles. Companies that are scaling rapidly always eventually seek to move to ERPs and then offshore to save money. Sleeper cells in the company which typically are well funded will slowly build up onshore shops until it's \"too big\" or \"less profitable\" then they do it again",
            "Everyone saying overseas devs are of the calibur of US devs are delusional. If that were true, Google would fire their entire US workforce and just outsource it all.",
            "Sounds like a wake up call for us in tech to unionize",
            "Guess what I’m going to do if I can’t work as a software engineer in the US? I hear ransomware is very lucrative.",
            "I’ve been telling many that software engineering in the USA is dead for new guys entering the field. Stop wasting your money."
        ]
    },
    {
        "post_id": "g0r2oa",
        "author": "Desperate-SWE-Intern",
        "title": "Pornhub internship interview process?",
        "url": "https://www.reddit.com/r/csMajors/comments/g0r2oa/pornhub_internship_interview_process/",
        "score": 604,
        "num_comments": 78,
        "created_utc": 1586810152.0,
        "selftext": "So I was anxious with my internship search process and started mastrubating, right before climax I realized I didn't apply to single porn companies for an internship. I'm curious to know what's the interview process for internship in companies such as the PornHub, XVideos, YouPorn and xHamster (aka The Big4)?\n\nMy background:\n\n\\- 3rd year student in a top 5 uni. in the EU\n\nI'd like to know:\n\n\\- Perks\n\n\\- Compensation\n\n\\- Interview process",
        "permalink": "/r/csMajors/comments/g0r2oa/pornhub_internship_interview_process/",
        "comments": [
            "\"right before climax I realize I didn't apply to single porn companies for an internship.\"\n\nI'm DEAD. We all know right before you climax is when your greatest thoughts happen",
            "lmao the Big 4",
            "Lmao, I have no idea if you are serious of not but I happen to know a few things about Mindgeek's day-to-day (A classier name for PornHub).\n\nDevelopers do not actually see adult content in their daily routine, although I suppose that could happen given a strange enough bug. Their pre-prod/dev environment uses cat videos instead so there's that.\n\nAs for the place itself iirc they are a PHP place with the usual perks you would expect for a software developer in Canada. Feel free to look them up on Glassdoor, they are almost always hiring.",
            "As desperate as I am for an internship, I am not applying those Big 4. I wouldn't be able to tell my parents.",
            "Well one of the perks is nsfw is sfw.",
            "Idk what its like in the EU, but for MindGeek Montreal my offer was $26CAD/hour, 35 hours per week. This is kinda low tbh, since most Canadian companies pay for 40 hours of work per week (and all my other offers were higher, like $30/hour average). No perks right now, it's all remote anyways but maybe there would be perks after the pandemic?\n\nThe internship interview was really easy, some whiteboarding. Some culture fit questions, but nothing related to design or architecture. I used Go and I think they were looking for Go developers, so I heard back within an hour.\n\nBackground: also a third year student, I go to a well-known Canadian uni.",
            "THE BIGGGGGGGGG 4",
            "[deleted]",
            "this post literally made my day",
            "lmao, upvoting for visibility. I'm curious, too",
            "ngl I've had the same thoughts of what it would be like getting a internship at Pornhub, would love to hear about more information",
            "According to glassdoor, pay and perks are low in Canada, haven't seen much from Cyprus or Romania",
            "10/10 shit post.\n\nThe ‘biiiig’ 4",
            "Bro im fucking dead xD",
            "Imagine you spend three years in a good uni to build a meaningful career, then you end up working for Pornhub lol",
            "What in the actual fuck did I just read?",
            "*stroke* *stroke* *stroke* *stroke* EUREKA! *stroke* *stroke* *stroke*",
            "This thread has been cross-posted (without declaration) several times.\n\nhttps://old.reddit.com/r/cscareerquestionsEU/comments/g0snhx/pornhub_internship_interview_process/\n\nhttps://old.reddit.com/r/cscareerquestions/comments/g0s863/pornhub_interview_process/\n\nhttps://old.reddit.com/r/csMajors/comments/g0r2oa/pornhub_internship_interview_process/",
            "Username checks out",
            "You sure wanna make your resume...hmm whats the word?....*interesting*.",
            "Not sure if you’re serious or not, but I’d like to work there as a massively-scaling problem. \n\nSomeone I knew worked at one. Their language/stack was Ruby on Rails, in part.",
            "# \n\nhello",
            "For some reason I want to see your resume with that experience on.",
            "Mindgeek is where you want to apply",
            "You forgot to mention xxnx! How could you?😭😭😭",
            "I wouldn't seriously recommend working at such a place, I can only imagine it would be a black mark on your resume, you'd have to keep it out of your work history in the US and like, wasting experience like that is killer especially as a new graduate.",
            "any updates ?",
            "Experience update?",
            "What are the big 4?",
            "LOL",
            "do  \"the big4\" recruit for a remote (international) internship?  i guess it would be fascinating fo working in adult entertainment industry"
        ]
    },
    {
        "post_id": "19d6gjy",
        "author": "Opposite-Classic8873",
        "title": "1MINUTE REJECTION....",
        "url": "https://www.reddit.com/r/csMajors/comments/19d6gjy/1minute_rejection/",
        "score": 602,
        "num_comments": 63,
        "created_utc": 1705957819.0,
        "selftext": "I think I'm going to give up applying for DS jobs....\n\nhttps://preview.redd.it/gh26q6df42ec1.png?width=1408&format=png&auto=webp&s=a858e58a6cb8d60d0cab8ca018aa97d4998689ca\n\nhttps://preview.redd.it/gffguadf42ec1.png?width=1913&format=png&auto=webp&s=075673c3d66633805321c0827d27a5d449f970cd",
        "permalink": "/r/csMajors/comments/19d6gjy/1minute_rejection/",
        "comments": [
            "Hahaha; one of my friends applied to another company (couldn't get which one), and then they finished page 2 out of the 5 page application form. The last question of page 2 was \"what is your university?\", and my friend goes to this to some lower-tier state college, and immediately after clicking 'next page', a message popped up \"Sorry, we can't progress with your application further\".  \n\n\nMan got rejected before even applying.",
            "World record fastest CS job rejection time",
            "I once got the rejection mail first then the “thanks” mail.",
            "I mean isn't a fast rejection better",
            "This is genuinely funny. I once got rejected from Twitter 7 minutes after applying but you beat me!",
            "you'll find these are very common. H1B Visa OR bad university selection (\"Other\") OR graduation date mismatch will get you rejected before resume screen (of which you'll get rejections 1-2 days later or ghosted if no followup in 2wk)",
            "Workday huh? Probably took 3x as long to fill out the app as it did to get rejected:(",
            "This can be a great way to AB test your resume lol",
            "H1B visa?",
            "Correct me if I'm wrong, does the majority of companies who use workday use ATS to reject your resume application? And did your resume ever get seen by the HR?",
            "O(1) reject time complexity",
            "data engineering at work to filter you out 😦",
            "Are you an international student? If yes, then maybe they filtered it based on the requirement of sponsorship?",
            "Any% speedrun WR?",
            "Hh",
            "Make sure you get ChatGpt to highlight the skills in the job description, and then include them in your resume. Once you've done that us Jobscan or Teal to see the match percent, and then submit your CV. I hope this helps!",
            "I'll take that over this one time earlier this month when I applied, got an email to choose a time for the remote interview, showed up... and the interviewer didn't.\n\nI sent her an email after 20min. She literally never reached back. I don't care much because I was working while I waited but... seriously?",
            "I had a final round of interview with Highmark health for SWE internship, the manager said I was a very good fit considering I had past two internships where I used same tech stack. I got ghosted after the interview. I never heard back what happened lol.",
            "Congrats on the world record (maybe)!",
            "did you tick the box stating you need visa sponsorship OP?",
            "at least they got back to you op"
        ]
    },
    {
        "post_id": "qw8sah",
        "author": "uw-police",
        "title": "Finding internships is like finding a gf",
        "url": "https://www.reddit.com/r/csMajors/comments/qw8sah/finding_internships_is_like_finding_a_gf/",
        "score": 605,
        "num_comments": 64,
        "created_utc": 1637182584.0,
        "selftext": "So many apps\n\nSo many ghosts\n\nSo many rejects\n\nStill waiting for the one bby wya 🥺😫🥺",
        "permalink": "/r/csMajors/comments/qw8sah/finding_internships_is_like_finding_a_gf/",
        "comments": [
            "Let me tell you this tho, inverting a binary tree or implementing LRU cache ain't gonna get you a girlfriend",
            "does that mean i will never find one",
            "Tbh finding an internship is easier",
            "“Getting hired is like getting a girlfriend. Yeah sure you can go on tinder (LinkedIn) and compete with thousands of guys who have a better jawline than you, and if you're really attractive (talented) then you'll immediately get noticed regardless. But if you think that the competition is too tight, you're better off improving yourself and going to the gym (your GitHub) and getting noticed around the girls you interact with on a daily basis (i.e. maybe applying to companies you're passionate about)”  -someone at my school",
            "[deleted]",
            "bruh try being a lesbian it’s even worse",
            "You gotta get a better python then my dude. Try importing collections, that’ll dramatically reside your package and it has some useful functionality to handle your… speed issues with a default dict. Just make sure you ask for consent before you whip out that package.",
            "At least sometimes the GF finds you. Internships you gotta find em yourself.\n\nInternships are harder. You don’t do 200 applications and hear back from like 5",
            "Honestly finding an internship the harder one",
            "***cries in gay***",
            "and sometimes, you settle on one just to have something in hand while still looking for a better one on the side",
            "😔",
            "then how come I have an internship but not a gf :(",
            "I do job hopping in both cases.",
            "If you had to choose either one, which would you pick?",
            "FAXX",
            "Most of us post internship folks are still like that",
            "Lol",
            "but i’m a girl😭",
            "3 Big-N internships, no gf :(\n\nfinding internships is much easier",
            "The difference is, I might actually get an internship.....\nSad life.",
            "I wish finding a girlfriend was that easy",
            "Ayy man going through the same shit. Can't find a gf too :'(",
            "You can find an internship, but you won’t find a gf",
            "This is what I’ve been saying! I’ve only been slightly more successful at internships. I mean I got 3 interviews so far (don’t ask how many applications, also two were at the same company), but I have had 0 dates",
            "I proposed to my girlfriend this weekend and she said yes but no company has said yes to me yet :|",
            "there's a minuscule amount of gay cs guys",
            "You don’t have one but some people just do somehow",
            "I’m right here"
        ]
    },
    {
        "post_id": "lmgk01",
        "author": "Electrical_Ad_9568",
        "title": "Rename this sub to r/ApplyingtoInternships",
        "url": "https://www.reddit.com/r/csMajors/comments/lmgk01/rename_this_sub_to_rapplyingtointernships/",
        "score": 603,
        "num_comments": 48,
        "created_utc": 1613632180.0,
        "selftext": "This is r/ApplyingToCollege part 2, change my mind\n\nAlso: Amazon",
        "permalink": "/r/csMajors/comments/lmgk01/rename_this_sub_to_rapplyingtointernships/",
        "comments": [
            "I’ll make a more formal post about this later. We the mods are usually pretty hands-off, mostly removing self promotion spam and rule-breaking posts letting the community decide content via voting, but if people feel strongly we can start looking for ideas to consolidate stuff. \n\nI think the best compromise would be limiting internship related posts to certain days, or daily megathreads. I’ll throw up a poll later but if you guys have suggestions I’d be happy to hear them.",
            "Amazon",
            "I've been saying for a while: it's time for a sister sub with all the internship posts. It's one thing if it's a couple posts a week, but it's another entirely when there's 5 posts asking the same question within the span of 2 days.....every week!",
            "Omg yes it's as if everyone who graduated from a2c came straight here",
            "r/ApplyingToAmazon",
            "Wasnt this sub created to move all the internship posts out of r/CSCareerQuestions ? Like wasn't that the whole idea",
            "r/internships, r/cscareerquestions, and r/csinternships already exist. It’s up to the r/csmajors mods to encourage or discourage certain kinds of posts",
            "I would say internship posts are highly relevant. First of all, ever experienced how hard it is to come by an internship? Secondly, what else are we going to talk about here? Linked lists? Come on lol",
            "PLEASE!!!",
            "Pleaaaaaase do",
            "Yes",
            "Rt",
            "Yeah maybe like a r/csInternships or something",
            "r/Amazon",
            "[deleted]",
            "😂😂😂",
            "r/ApplyingtoInternshipsTech cuz then non tech related people will start joining",
            "HOW I GOT INTO FAANG",
            "yes so annoying",
            "Chance me for Amazon : Solved LC easy"
        ]
    },
    {
        "post_id": "16l6c7c",
        "author": "ggag0121",
        "title": "Bro who is getting hired 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/16l6c7c/bro_who_is_getting_hired/",
        "score": 603,
        "num_comments": 118,
        "created_utc": 1694970896.0,
        "selftext": "Just to be clear, I understand that it’s very hard to get a job and I’m by no means entitled to one but\n\nI have 3 internships, 2 prestigious ones, am graduating from a prestigious university, check every single diversity box, and am a citizen\n\nI get there’s several people out there better than me but HOWWW\n\nnot to be dramatic but I’m quite the catch (pls hire me)",
        "permalink": "/r/csMajors/comments/16l6c7c/bro_who_is_getting_hired/",
        "comments": [
            "[deleted]",
            "I'm glad its Sunday and this has a shitpost flair.",
            "you need to just start slurping recruiters",
            "I noticed I get more call backs from on site roles rather than hybrid / remote. There is probably immense competition for remote.",
            "even if it's one of those Sunday posts, jokes aside, if you get interviews and are not getting hired it means you're not doing a good job of selling yourself\n\ncompanies are buying a product \n\nthe product is you",
            "I’m going to start having to rizz up the interviewer ong",
            "I botted LinkedIn and got a Google and Apple Interview \n\nI failed both but I managed to get unlimited remote PTO so a win is a win",
            "It confuses me that people in a math-oriented field don't take a data-driven approach to reasoning through these things.\n\nOP, how many applications have you submitted, how many job fairs, how many interviews have you had, etc.?",
            "I'd hire you at my 7/11 if you need a job",
            "Bro same I’ve applied to every FAANG company and none have reached out to me??? wtf???? I even included the fact that I had a perfect SAT score but still??? These companies are ridiculous 🤬🤬🤬",
            "[deleted]",
            "You can't check every diversity box. That's physically impossible.",
            "[deleted]",
            "Wtff is diversity box",
            "You need to say that you are a refugee from Russia",
            "I remember at berkeley we had like 500 cs grads and that wasn't including eecs and other engineering/math majors. I think the number is closer to 800-900 nowadays but multiply that by \\~900 since that's roughly the amount of colleges that aren't community colleges, or religious/med schools. 500(I'm guessing not all schools have over 1400 cs + ee/cs grads). That's 450k cs majors. Everytime I've seen an junior application open up it gets thousands of applications, but we tend to just go with referrals first which usually fills things up.",
            "Not me lol",
            "Is it actually that bad? I'm still a highschool senior and thinking of getting a CS degree. Would you say It'd be worth it given that the field will probably be much more saturated in a couple of years, or should I find another interest?",
            "[deleted]",
            "I got a pretty much dream job as a backend engineer after a bootcamp 2 months ago. People underplay two big things in my opinion for interviewing being soft skills and understanding how to explain yourself. Even when my answers to technical questions were wrong I would kinda bs my way through it or soften the blow. \n\nAlso mentality and confidence is everything. If you think it’s impossible for you to get a job right now, it’s going to be impossible and you will self sabotage.",
            "Privileged people be losing they mind when they have to struggle as hard as the rest of us. 🤣🤣🤣\n\nI swear people used to struggling will just endure and work another job until the tech industry starts hiring again.",
            "[deleted]",
            "u gotta have a rich parent who have connections with higher-ups in companies to land u a gig",
            "This is why I gave up on CS. Out of the industry completely now",
            "Daaam your like above average too",
            "You are not getting hired because you don’t have Indian cousins in tech who can get you hired. Why do you think we see so many Indians in tech, it’s all monopoly",
            "No you're not. You lean on 'prestige' as though it's supposed to be some sort of golden ticket to a career.\n\nYou haven't said anything about how good you are and it leads me to the conclusion that you might not be.",
            "There is opportunity it's scarce but it's there. I'll say if you're in the 100-150 applications range so far you need to crank those numbers way tf up.",
            "Market is not bad? 0 experience apply one job as it consultant and got it??",
            "Check every single diversity box huh.  I was wondering what that would be.  You would need to be a minority - but not the \"wrong\" kind of minority - a female - trans or gay - first generation college grad.  Any other boxes?  A veteran?\n\nI am just wondering what the \"most diverse profile\" would be.",
            "Are you only applying online? I find that some resumes won't even get looked at because they have thousands of applicants -- maybe you can explore other ways to appeal yourself?",
            "Probably your lack of past work experience and your personality. You might wanna work on that.",
            "Your mom is lol",
            "Have a few years of exp and still can’t get a better gig. Rip",
            "I got one, v lucky",
            "Sometimes some people interview better, know someone, luck, timing, location: it’s many things",
            "Contact startups around",
            "We once had someone similar credentials like you, but the issue was that they were full of themselves and overconfident during the entire interview. If you can't even get your code to compile on HackerRank during the interview then your credentials don't mean shit. Anyone can get an internship (the school helps you), and it's not like going to a prestigious school means a lot anymore compared to experience.",
            "Trick is not living in the US.",
            "On the spot technical/coding interviews are BS",
            "Do yall go to career fairs? I get nothing online but at those events I get 10+ offers. Again, never gotten an offer for online application",
            "Honestly, I'm not sure if this is a consideration but try a masters in AI or something if you don't land a job. It'll add a layer to your skills and reduce the pressure.\n\nYou'll probably get accepted into a good uni anyways given your current \"prestigious\" banners, and the market will cool off by tbe time u graduate(hopefully)",
            "Lower your standards. Plenty of people will hire you.",
            "rip",
            "What sets you apart from all the other applicants? You went to a prestigious university, does that really set you apart? Maybe, but probably not for the reasons you think. What college or university you graduated from typically only matters in CS/IT for the alumni and other networking opportunities.",
            "DM for Raytheon referral",
            "Can you name the 2 prestigious internships."
        ]
    }
]