[
    {
        "post_id": "19688r7",
        "author": "Acceptable_Rest_3923",
        "title": "1000 rejection?",
        "url": "https://i.redd.it/t0czpd1pbccc1.jpeg",
        "score": 603,
        "num_comments": 25,
        "created_utc": 1705209623.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19688r7/1000_rejection/",
        "comments": [
            "Do you spend 1000+ hours on Leetcode because you are a CS major or are you a CS major because you spend 1000+ hours on Leetcode?",
            "Throughout heavens and earth, I alone am the unlucky one.",
            "The rot consumes",
            "Lobotomy Kaisen has somehow snuck its way into r/csMajors",
            "This panel along with \"That's how losers think\" carried my mental health during the interview process. Thank you GOATjo and KasHIMo.",
            "this sub is so depressing that it makes me want with this treasure I summon myself off",
            "Stand proud. You’re strong.",
            "https://preview.redd.it/2ioh2wxprfcc1.jpeg?width=750&format=pjpg&auto=webp&s=6272117da89b7310d8f5055b727d53f0f93b109a\n\nThe HM rejecting me after the interviewer says, “I hope to see you here”",
            "YOU RE STRONG!! KEEP GOING TILL 10000",
            "Literally me",
            "As the strongest job market, tech sector, fought the fraud CS students, it increased the output of its interest rate domain...",
            "Nah, I'd code",
            "Always bet on more applications.",
            "How do people find 1000 positions. The same positions keep popping up for me. I am currently at 150 apps",
            "Ah, the strongest leetcoder in this year vs the job market",
            "https://preview.redd.it/gte9s0c7jgcc1.jpeg?width=818&format=pjpg&auto=webp&s=ef7653f966e274df6771b3f55e66966c67da33e6",
            "nooooooooo stop doomposting your negativity is bringing us down!!!",
            "Pls delete",
            "He looks so different in the manga compared to the anime, didn't even recognize him before reading the comments"
        ]
    },
    {
        "post_id": "15jf0o4",
        "author": "uatemyduck",
        "title": "How I got into Google",
        "url": "https://www.reddit.com/r/csMajors/comments/15jf0o4/how_i_got_into_google/",
        "score": 606,
        "num_comments": 128,
        "created_utc": 1691292292.0,
        "selftext": "Please don't take this as a flex. it is merely an observation I would like to share.\n\nSpoiler: it's all luck. I believe I am the luckiest CS major alive. Every event that has led to where I am now cannot be explained from something other than luck. I am on track to graduate with 4 SWE internships (though I'm planning for 5 if possible), including Amazon and Google.\n\nMy first internship was with IBM, and that happened the summer before my freshman year of college started. I was lucky enough for them to host a 5 week paid internship program for my high school with no OA or interview required.\n\nI'd say my second internship was fairly earned; I interviewed the best and they didn't pay that well, but at least I got a year's worth of experience from them.\n\nMy third internship was with Amazon. I only had about 30 LC questions done, but I was lucky enough to get an OA with terribly easy questions and even more lucky to only have a behavioral interview afterwards that got me the offer. I also got the offer weeks before the waitlist started, so even more lucky.\n\nFinally as a rising junior, I was stupid lucky to have a Google recruiter select me as a candidate for 2024 SWE internship. The OA was easy, though I came more prepared. The interview was 1 LC easy and 1 LC hard, but the interviewer was nice enough to pass me.\n\nI see so many people with a better resume, more experience, better at LC, and go to a better school than I do (I go to a T200), yet they struggle finding internships. Meanwhile easy OAs and interviews are spoonfed to me.\n\nWhat do you guys think? I need to see this from a perspective from the general population.\n\nEDIT: From people that are asking for resume, this is my anonymized resume: [https://www.overleaf.com/read/qzvvfggdxdnd](https://www.overleaf.com/read/qzvvfggdxdnd) For people who are asking for my ethnicity, I am Mexican American.  \n\n\nEDIT 2: Nice to be on the top of the subreddit. Shoutout to my lil bro goku",
        "permalink": "/r/csMajors/comments/15jf0o4/how_i_got_into_google/",
        "comments": [
            "It’s probably not luck if you get lucky every time. Most likely you have some trait that is favored by recruiters.",
            "No Technical interview from Amazon? That's pretty surprising wow.",
            "This isn't really luck as much as it is momentum. Having a legitimate IBM internship before starting college is huge. You used that to launch yourself from role to role gaining more and more experience. But the experience only gets you an interview, you are the one that gets yourself the job.",
            "Did you get lucky? Probably, but at the very least clearly you were prepared to act on opportunities you got through that luck. I don't think it's *all* luck.\n\nIMO plenty of people with successful internships had a good part of it come from luck in one way or another, myself included. Whether they got lucky on a resume screen/interview, got lucky by having network connections via family friends, or got lucky by having supportive parents, lots of people are fortunate in one way or another. But like I mentioned before, for the most part, these people succeed due to a combination of hard work and luck.\n\nGoogle's interview process specifically is relatively rigid for interns, if you passed then you probably did something right even if you don't think you did. As for your IBM internship, was it just handed to anyone who requested it or were you given access for some sort of reason like academic performance? Luck might have played a factor but you still acted on it, that's more than most senior highschool students would do.\n\nI'd say the one exception is Amazon, which yeah people can just luck the entire way through... I know someone who applied with 0 internships or non-tutorial projects (no referral), moved past OA with 8/30 OA test cases, got asked 2sum during the interview and didn't know the optimal solution, didn't know LPs for the interview, and still got the offer. I know someone actually working at Amazon who did several intern interviews and she said she just passed them all, including downright mediocre candidates, because she didn't care and they kind of just shove those interviews onto random employees. Did you luck through it? Perhaps, but plenty of people did, and you passed Google later on so clearly you're doing *something* right.",
            ">What do you guys think? I need to see this from a perspective from the general population.\n\nFirst of all, we are not the general population. It would even be a mistake to generalize this subreddit to CS majors.\n\n> I see so many people with a better resume, more experience, better at LC, and go to a better school than I do (I go to a T200)\n\nHey, at least this shows it can be done.",
            "“I am the luckiest CA major alive.”\n\nI beg to differ given that I had a single new grad offer for fully remote 6 figures good WLB that came from my one and only internship that was my only internship offer that came from the only interview that I was offered. And my company without warning rescinded all new grad offers a week after I started despite the fact that I arbitrarily chose an earlier start date months before.\n\n\nOne interview with easy LC => One internship => One NG offer that was one week from being rescinded.",
            "[deleted]",
            "Maybe you did get lucky, but luck means nothing if you aren’t prepared and ready to take advantage of it. Sounds like you’re absolutely crushing it, regardless of how lucky you may be.",
            "Give yourself some credit, OP :) I know imposter syndrome is really common in this field bit I think you should buy yourself some good food and celebrate this achievement. Your worked hard, well done!",
            "If you don’t mind, what is your ethnic/gender background?",
            "You may have been “lucky” early on but you kept applying yourself. I made a comment the other day on this sub saying you need to get ready and STAY READY so you don’t have to spend exorbitant amounts of time getting ready later on. There’s too many people now scrambling to GET READY this summer for positions that closed early or are closing early this year.\n\nYour story is a great example of getting ready and staying ready",
            "I don't have a lot of thoughts but I also feel relatively lucky. Similar to you, I had internships in high school (in a reputable company only offered in the region where I lived) and from then on I had an internship every summer. The first two were at Microsoft, I started with the Explore program which is easier to get into than the regular SWE internship. Got kinda depressed and didn't perform well so no return internship. Then I got an Amazon SWE internship from a single not-super-difficult 45 minute interview and just completed my second summer there. However I'm now super stressed because of the hiring climate and I'm graduating in December.",
            "It’s all luck guys. I had 3 successful internships but that has nothing to do with it.",
            "You’re saying your first internship was a IBM the summer before freshman year in college .\nHow’d you intern for IBM as a paid intern and that too in high school ? How’d you get to know about that internship at the first place ?",
            "Theyre giving interns LC hard??",
            "The Amazon interview seemed like the only out of the ordinary lucky event. The recruitment could’ve been luck, but you would have to share your resume to determine that, as there are some subtle details that set you apart. Then you have the added fact that these early recruitments are a lot more lenient since most of these companies hire on a rolling basis. From things I’ve heard and personal experience, Google probably won’t give you hard DP or graph LC questions in July/August interviews",
            "There is no better resume than wall-to-wall internships. So you have the best resume, not the ppl you think have a better one.",
            "How did you get matched to a team? Any tips to maximize chances of being matched to a team?",
            "Definitely not luck. IBM internship before college is what pushed you ahead of other candidates. Additionally, you could have soft skills that play an important role whether people here like to admit it. All the big tech company’s and just many large corporations really believe in culture fit when hiring.",
            "You will always see people better than you, but that doesn’t mean you aren’t awesome yourself! The fact that you think Amazon and Google’s OAs were easy shows that you’re above most other cs majors. It’s all about perspective, so be proud yourself and how far you’ve come.",
            "Very cool! I’m going to go drop out now and go live in the mountains!",
            "Not asking you to dox yourself, but can you share demographics? My CS friends in college are really strong applicants at some good schools who are struggling like crazy to even get interviews. Your experiences don’t match with anything I’m hearing, especially not having to interview or barely being able to handle leetcode.\n\nActually, it’s specifically the asian males who are having a hard time. I’m also one and it scares me to death that I’m going to have a hard time finding an internship if they are.",
            "Luck is just when preparation meets opportunity OP. Glad you’re humble about unlike many who let it get to there head. It’s clearly made you a good person to work with, as well as likable which has given you internships you’ve gotten.",
            "Es todo wey alv! Yo tambien ando cociendo mis internships",
            "Que bien parcero! Sigue así y el mundo será tuyo. Pero no olvides recordar de dónde vienes y ayudar a los que puedas 💪",
            "What is your race if you don’t mind me asking?",
            "from one Hispanic (the better one🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺🇨🇺) to another, good job 👍\n\nhttps://preview.redd.it/tm6zngf2mjgb1.jpeg?width=750&format=pjpg&auto=webp&s=c8cb134d70241b0567ec35fbc7e932935a2e96cd",
            "Hey congrats! Do you think I can dm you asking for advice about related things",
            "The harder you work the luckier you get! Good job!",
            "> Finally as a rising junior, I was stupid lucky to have a Google recruiter select me as a candidate for 2024 SWE internship \n\nTalk about burying the lede. You're an intern. Congratulations and all, but that has always been an extremely low bar. And nowadays companies are more worried about DEI for these roles.\n\n> I am Mexican American. \n\nYep.",
            "[deleted]",
            "Waste of time. I would just look for a new job after first internship. But doing 4-5? Lol its better to get a fulltime job instead.",
            "Could you please share the OA questions ?",
            "Open the Bowser and type google.com make sure you have internet",
            "How'd you get matched to a project for 2024? My recruiter said host matching interviews haven't even begun. Or are you in host matching right now?",
            "I don't know if you know what luck is",
            "Career development is all about seeking opportunity. Luck essentially. So I wouldnt downplay the achievement considering: A) this is how the game is played and B) you seemed to have worked hard to capitalize on the favourable opportunities you’ve been presented",
            "Don't sell yourself short, you clearly have done well and worked hard to get to where you are today. Keep it up :)",
            "You’re like Big Head from Silicon Valley, except you’re probably competent tbh.",
            "Solid path .. thanks for the information and glad you found a way in .. you put in the work you deserve to get where you want to go",
            "Thanks for sharing. It well deserved and I appreciate that it’s an honest perspective.",
            "We’re not all looking for perfect solutions during technical interviews. Your personality matters a lot. We’re all humans and we judge you on a lot more than just your solution. How you problem solve, how you engage the interviewer is definitely more important (obviously you can’t flat out bomb the question) than getting the optimal answer to every question. Your interviewer will fight for you if you give them reasons to. \n\nAll this to say, you’re not lucky, you deserve all the things you’ve received. You possess the mix of qualities that the industry deem important and you’re not necessary just a codemonkey.",
            "Yeah you got lucky, but no shame in that",
            "Good job, I am a senior engineer and i cant even do lc hards",
            "If anything, your experience just highlights how important placements are. Well done!",
            "Did you already get matched to a team for google?Passing interviews don’t guarantee you nothing.",
            "Congrats brother, making the raza proud. 🇲🇽💪🏻",
            "Yeah I agree with you that it is all luck based on your story. You have nothing special. So do hardwork for your career to continue to be lucky!",
            "You’ve got good social skills and took advantage of the opportunities you are given. Sure the HS internship helped propel ur resume, but u r one of the few that took this opportunity. The LC questions could’ve been challenging to others for all we know, but it’s easy because you prepared. Sure maybe you had an easier interview format for some reason and ur ethnicity def helped, but you no doubt worked hard. Life is also not fair to everyone, and you deserve to feel good and proud. Cheers brother"
        ]
    },
    {
        "post_id": "1c21fhe",
        "author": "dynosys11",
        "title": "Why are CS students so socially awkward?",
        "url": "https://www.reddit.com/r/csMajors/comments/1c21fhe/why_are_cs_students_so_socially_awkward/",
        "score": 598,
        "num_comments": 213,
        "created_utc": 1712900577.0,
        "selftext": "Hello, I hope this doesn't offend anyone.\n\n&#x200B;\n\nI am doing a Ph.D. program at an enginnering lab at quite prestigious university.\n\nUnfortunately, I am the only female in my lab and this has put me into a lot of issues with my male colleagues.\n\n&#x200B;\n\n&#x200B;\n\nAll of us are in our late 20s, and I still can't quite deal the fact that many of my male colleagues cannot or will not (I am not sure which) even speak to me.\n\nThey have trouble looking at my face or eye when talking to me,\n\nand they will avoid asking me even important questions related to work or asking me what lunch menu I want to order.\n\n&#x200B;\n\n&#x200B;\n\nOr they will sometimes go to the opposite end of the spectrum and speak to me very abruptly or aggressively that leaves me wondering if I had done anything wrong or why they are so mad all of a sudden.\n\n&#x200B;\n\nI try not to take it personally or make it a gender issue, but it's been over 2 years and their ongoing hot and cold behavior (not to other male colleagues, surprisingly!) is bringing me actual detrimental consequences doing my job.\n\nAnd more than anything, this leaves me feeling isolated, ignored and disrespected as a human being or as a equal professional on the job.\n\n&#x200B;\n\n&#x200B;\n\nCan anyone help me understand why they are doing this so that I would not feel so miserable and unfortunate studying something I want and like, and so that I can actually survive in the engineering field?",
        "permalink": "/r/csMajors/comments/1c21fhe/why_are_cs_students_so_socially_awkward/",
        "comments": [
            "More time spent on the computer coding = less time socializing",
            "OMG FEMALE\n\n*heavy breathing*",
            "In order to maintain a high GPA and get into a highly competitive major and get through the math reqs, you need to dedicate a LOT of time to your studies. That detracts from spending time hanging out with people and developing social skills. You also have to be sort of inclined towards solitary jobs where socializing isn't the driver of success. Not saying it isn't a driver, just not the only one.",
            "It’s cause everyone who played video games instead of having a life in high school decided that “playing on a computer” = “having a passion for coding”, so every shut in lonely guy suddenly went into CS",
            "Dude, wtf is the female? Is it a new code principle?",
            "They probably have social anxiety or are on the spectrum. It's more common in certain fields and can be even more common in the academics.\n\nI don't think they ignore you on purpose, but maybe they don't know how to interact with you and are afraid that you'll misjudge their intentions. Or maybe they simply have known their male colleagues for longer and that's why they're more comfortable with them?",
            "I think this is only a problem for students. When you get out into the real world with a few years of experience, most of the swe I see are social butterflies. Especially helps when they’re already married with kids, it makes it much less awkward.",
            "If you struggle with social interaction, you'll often gravitate towards hobbies and professions that necessitate less of it. \n\nAnd it's a bit of a self-perpetuating cycle. Being on the computer all day for school, studying, and recreation means that you'll interact with less people. So your social skills get even rustier. \n\nI have social anxiety disorder but I am totally fine to talk with people *if* they approach me first. I will still be awkward at first -- I'll stumble over my words, I'll lose my train of thought, I'll speak either too quietly or too loudly. But after the inital hump I'm fine. I like other people and always am afraid I'm giving the impression that I don't.",
            "[deleted]",
            "Suicidal ideation",
            "It’s a field that doesn’t require much face to face interaction, social skills, and oftentimes draw people who have spent a lot of time on computers(ie not socializing, at least in person)\n\nSo it oftentimes draws in people who don’t like/aren’t good at social interactions. Currently in school talking to some CS majors it feels impossible. Some struggle to even say their name, major, where they live without coming across as extremely awkward. The most basic conversation you have in college at least 100 times a year, it feels as if they’ve barely even done it. Probably because they rarely do it. Look at platforms like Reddit or discord, which I think draws similar crowds. Skews heavy male and oftentimes you can read the most abhorrent socially out of touch things ranging from racism, sexism, and overall lack of understanding on almost anything social. \n\nMy school you can either get a B.A or B.S in CS and the requirements for a B.A are equally hard CS wise but it also forces you to do more humanities classes. For example I’ve done classes about inequality, chinas economy, human rights law just to name a few. However the B.S requires significantly less liberal arts classes and those individuals who are doing a B.S are more likely to be the aforementioned people.  Education is important, we should teach people how to be more well rounded not just code monkeys.",
            "This is literally all of STEM academia. Also one of the reasons why I didn't opt for a PhD because if I didn't want to end up socially stunted in my 30s.",
            "Lots of people in this field have spent WAY too much of their lives staring at a computer screen, and so have a lot less acculturation and exposure to casual social interactions.\n\nI am not a student, I have been doing this for 17 years or so, but I have definitely found that the most effective engineers, overall, are the ones with the best soft skills. [Software engineering is, at the highest levels anyway, a team sport.](https://en.wikipedia.org/wiki/Conway%27s_law) You cannot tackle very many technically ambitious projects in a reasonable timeframe without having multiple teams of engineers all working together. Being very talented isn't enough. It doesn't matter how smart you are if you can't operate within shared patterns and processes in a professional environment while navigating a complex social environment. This is not something that socially inept cloistered ubergeeks can successfully navigate.\n\nI'll take a team 6-8/10 engineers with solid social skills over the same number of 10/10 socially inept ubergeeks any day. The result will be a better architecture, fewer bugs, and higher velocity.",
            "Nerds, don’t know how to talk to women.",
            "As someone on the other end it's hard for me too, as I'm not only aware of my social flaws, but am limited by them. Most of the time I wish I could come off as just someone more; friendly if I'm feeling lucky. \n\nI'd tell you that communication is a two way street, and if you could try to add some social lubricant by sometimes initiating a conversation, it would be greatly appreciated. Be careful not to come off as too friendly though because then you'd just be swapping problems.",
            "From one woman to another, it's best not to expect too much from them. Trying to \"fix\" or \"understand\" them often leads to frustration. Remember, the issue lies with them, not you. Consider connecting with female colleagues outside of school, perhaps in a local developer or technology group. Being a woman in this industry is incredibly challenging. Recognition is rare, victories are few, and serious consideration is scarce, while judgment is plentiful, even over trivial matters. It's very much a male-dominated field. To save you the difficulties I've experienced, seek out communities where you can find support and guidance from others who share your experience.",
            "Yeah, it's a can of worms where you will have to pick your battles: give up on some, help others to come out of their shell and some of them just need to stop giving a fuck worrying in general about what people around think about them (this was how I came out of my shell - as soon as I realised that, my social life skyrocketed, got a girlfriend and so on).\n\nWhen it comes to class work, well, you gonna have to be blunt probably. \"We need to do this, so we have to communicate. Get over it, I also have my own issues the same way you do, but I make an effort\".\n\nIn a decent amount of cases it is also just accepting \"yeah, that person is just weird / has quirks\" and once you get used to them, as you go through life you start to realise that everyone around is fucking weird and the older you get, the weirder people around get :D Try knocking on your 40s when everyone around has mostly figured out their shit, do not take shit from others and do not care what people think about their eccentricities and freely admit their quirks :D\n\nObligatory: Use your own best judgement.\n\nP.S. Actually, being blunt as a hammer might work out well. Many of them overthink things, it's kind'a \"being too smart for your own good\" deal. That happened to me partially. I was overthinking things too much.",
            "Not all of us are socially awkward. I was the weirdest one of my CS class! I would hit the gym, go out to bars, work and have a GF.",
            "Ok I will give you the uncomfortable but hopefully more useful answer: If everyone in your class is literally like that but only with you, makes me think that maybe the problem is in your perception, and not in their behavior. You can try the next for a week: everytime you feel \"ignored and disrespected as a human\", annotate in a notebook what exactly happened, with details. At the end of the week, read everything and try to give a different meaning, try to be imaginative. My point is that you seems to focus only in \"why they are so bad with me\", and doesn't seems that even crossed your mind an alternative hypothesis. Have you wonder how they see you? Maybe you are not so friendly with them like you think you are. Maybe they wonder the same about you, why this girl is so awkward, I would like to be friend with her...Or maybe they never thought about it and never imagined that you feel like this. Or maybe you was really unlucky and ended in the most unsocial with females lab at university, it can be too. Why exactly do you think is because you are a female, and not because is just you? I mean, did you saw them interacting with other women? They also looks awkward and aggressive? I was in similar situation in a group once, not gender related though, until I saw myself from outside (literally, in a video record) and realized I was the reason of conflict, not the other way around. Was very shocking and difficult to swallow, as I was convinced they hated me. Is not the same situation but...just think about it",
            "I don't think I have enough information to make a judgement on this. But I have an especially bitter experience with the \"social awkward\" label, for which I want to share.\n\nGenerally, I am a pretty quiet and shy person. Usually with both genders, but with women, that effect is turned up a notch. When it comes to women I do not know, I rarely initiate, make eye contact, or look in their direction, unless they talk to me. If they talk to me, or ask me a question, then I pay attention, make eye contact (not too much though), and nod along. However, in my experience, many women do not initiate, do not ask questions, and rarely engage. As a result, between me and them, there is usually silence. Now what infuriates me a lot, is when these same women, who have not spoken a single word, or even attempted to start a conversation with me, complain to my male friends or family that I was somehow \"socially awkward\" with them. This really pisses me off, as I don't think they have any right to complain about my socially awkwardness when they haven't even tried to connect me. Like, if they tried to call me and I ignored them (which did not happen at all, they were on the phone the entire time!) then sure, they have a point, and I should learn to be more socially aware. But how can they call me socially awkward when I acted the same exact way as them??! I think it comes from this gendered expectation that the man is supposed to lead or whatever, be charming, be the initiator, which really pisses me off because these women would be the first to complain about gendered expectations. Especially the educated women who have a PhD in a technical field such as Computer Science!\n\nSo I am going to be honest with you, when I first saw the title, I was really pissed off. I wanted to say what is with you women, having this incredibly sexist expectation that men are supposed to be this charming, confident, handsome, funny, intelligent, swoon worthy, guy with a personality like Daniel Radcliffe who looks nerdy but still has that intellectual rizz to him. I am sorry those men aren't socially awkward if they aren't meeting your arbitrary sexist standards. Ask yourself, the standard on which you are judging these men, do you yourself also meet the same standard? Do you actively pursue and initiate conversations with these men? Do you make eye contact? Can you have a third party confirm that? Or do you just stand in the corner, hoping the \"male colleague\" uses some \"common social sense\" and treat you like a lady, that you supposedly are? If you are not applying the same standard, then in my opinion, you don't have the right to make those accusations or complaints. How can you accuse someone of being something when you yourself do the same? That has been my experience with a lot of women calling guys socially awkward. I am sorry, but you can not call someone \"socially awkward\" when you are just as awkward, when you just as much do not initiate, when you just as much use your phone, when you just as much wait for the guy to say hello, etc.\n\nNow, very important point to make here at the end. If a male colleague is doing something to you, purposefully to discredit you, or harm you in anyway, simply on the basis of being a woman, then I can agree that those male colleagues should behave better. If these guys are purposefully avoiding you, not because they are shy or scared, but they think you are beneath them or whatever, then I condemn those actions. But if they are shy, insecure, etc., those things are involuntary feelings, instead of making upsetting remarks about them, you should feel bad for them and find ways to improve the communication that upholds mutual respect. And we haven't even talked about the decidability factor of social awkwardness (on a mathematical logic or computer science level, this is your specialization right?). Is the label of social awkwardness decidable or computable? \n\nI don't feel like I have enough information to make a judgmental call.",
            "The best way to talk to such people is through some hobby(I myself am such a person). Video games is probably your best bet or some other niche",
            "Do you want Reddit confirmation about “quite a few CS PhDs are insociable nerds”? Well, you got it I guess. \n\nThere might be a wide spectrum of reasons why they doing interactions this way, but if it happened for two years with nothing changed - I’d say it won’t change without you being proactive.",
            "Man, I thought it was just me isolated in my room \\0",
            "My take is that CS especially (but engineering in general) draws the socially awkward guys who sometimes even might be slightly autistic (even if the often might not get a diagnosis).",
            "Many male CS majors have a hard time interacting with female CS majors. Unironically.",
            "Have you tried talking to them over coffee etc. Ask your lab guide for help, if needed.\n\nPerhaps they are uncomfortable having a conversation with you for reasons that can only be found when you talk to them or one of them. You can check with the guide under whom you are researching.",
            "Because CS stands for socially awkward",
            "Coming from someone that acts like the ones you described in your post.\n\nI used to be a very outgoing person in highschool. I had lots of friends from both genders. When I came to north America though everyone's been telling me things that I can't do or say to women. (Eg. Dont talk to first year girls, dont stare at them when you are talking, make sure you ask for their pronouns first...etc) I started getting nervous whenever I talk to girls in my class because I have to constantly think if I said or did anything wrong. (Also whenever I do that I look away as well. So I can think and also when you start thinking if u are staring people in the eyes you can't stop) Then because it is such a draining thing to do it I just stopped initiating conversations.\n\nAlso, I might be able to talk pretty well during a conversation if we are facing the same direction instead of face to face. I think this generally works with people like me. Hope that helps.",
            "I don't want to scare you, but as a woman in the industry, this is the tip of the iceberg. You will endure much worse, so make sure this (and worse) is something you can keep fighting against for your entire career. Stay strong.",
            "Gigachads",
            "Considering you wrote mostly about what **they** keep doing to you (even though you say this is not a gendered issue, I doubt you mean that), I'm left to fill the blanks of what your part is in all of this. So I'm just going to write some general tips.\n\nYes, both men and women in STEM are more socially awkward (yourself included) than other people on average. However, I'd argue that in today's age, most people are socially awkward regardless. I try to be proactive, patient and empathic. I don't judge them and I let them slowly \"let their guard down\" while not waiting for validation cues that they like and/or accept me. Some people will, some people won't.\n\nI hope I don't offend when I say that not being able to adapt to different social situations is considered \"socially awkward\". Hot take - you're expecting them to treat you in a certain way, while in their minds (probably), there's no problem and as long as they leave you to do your work, then everything's fine.\n\nIf you came here to vent (which is fine) then feel free to disregard this post. However, if you want to feel accepted, try putting your expectations aside, and treat people how'd you'd expect to be treated. Be kind and take accountability for your social life.",
            "fertile combative judicious seed possessive fly marvelous grey drab tan\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "As a guy in the field, I am sorry that you have this experience. Sometimes those people are awkward around women. Sometimes they're awkward around everyone.\n\nI wish I had some easy answers for you. It was bad in my day (10-20 years ago) with sexist attitudes. I think the awkwardness has become worse as people have grown up with social media and the anxiety it can generate, and less physical interactions. \n\nI hope you can get through this and find a more pleasant group of people to compute with.",
            "Why is almost every Zoomer on the spectrum and having panic attacks when someone talks to them?",
            "The problem isn't with CS, it's simply that in our society many people aren't able to have a conversation with a woman because they fear that they'll take it immediately as flirting.\nIt's hard to act normal around women and that makes us do things we normally wouldn't/don't do with other males.\nFor example, if I asked you to go compliment one of your colleagues on anything outside of CS, I'm sure you'd be able to do it. If I told this to a man they'd most likely refuse because they fear that they're going to get rejected/juged as a person in love or something.",
            "\"i figured it out with hard work i don't want to teach you for free,\" methinks.",
            "The comments you see here tells you what their mindset is",
            "Probably because there's a link between those that are neurodiverse and those that do computer science. Alot of people struggle with social interaction. \n\nI hate the lack of social interaction in my course, any time I ask if people are up for doing something I get one or two people that would be the rest just like going back home.",
            "Pretty much they lack training in being social, most cs majors likely are ppl who focused in their hobbies cuddled in their room. They got used to that and mindset has been trained, lots of ppl underestimate what u feed ur brain. If u feed ur brain being a loner, ur gon act like it, and it’s going to be hard getting out of it",
            "It's like this at school but honestly I've met very few awkward developers in the workplace",
            "It’s not *all* of us, but it is *a* *lot* of us…",
            "It depends on the person, but usually the ones who get internships early on in their undergraduate years or become big are the ones who are outgoing. So this really depends on the person.",
            "OP, I'm sorry to break it to you:  \nThey're not awkward; they just don't like women.",
            "I sure do wonder.",
            "The fact they can’t look into your eyes when you speak means they most likely have social anxiety.",
            "It has always been this way. Don’t expect them to look you in the eye. I look close enough that most people think I’m looking them in the eye, which works. But guys have always been like that toward me. I actually left IT for a while because companies treated me poorly. My experience in coming back has been much more positive.",
            "I had switched majors, but I thought it was amusing at my college that CS majors aren't required to take business and interpersonal skills.",
            "Its very possible that they like you and since they feel scared to ask you out or feel like you would reject them they lash out. When they are haning out with the male coworkers they feel at ease, but when they are with you, their floppy disk gets hard and they are, at a subconscious level, mad you are making them feel that way. Like if its your fault for being attractive lol i could be wrong, but i doubt it, i am far too wise and cool to be wrong.",
            "Yea dudes in tech are super weird, they never look in my face and if they do they have this O_O :| stare lmao. Never happens to me with finance bros or med bros etc",
            "It tends to select for people with ASD. That part of the brain just doesn’t work in those people no matter how hard they try to develop it.",
            "I am a woman who has been in many environments as the only female but I am in the US and do not know where you are so our perspectives may vary. \n\nHowever…\n\nI am going to disagree with a great deal of the comments that are most upvoted. I’m a female as well. I also have Asperger’s. If they are outright friendly to every male and only treat women and girls poorly, that is not a good environment to be in. \n\nI remember I couldn’t understand if a man was socially strange or was misogynistic. That is until I observed his behavior with other women. The men didn’t fire him when he crossed the line with women either but swiftly fired women even for disagreeing with them. This is not an issue of socializing. \n\nFrom childhood into adulthood I have always been around mostly males especially as a child being in advanced classes. \n\nMy partner now is pretty quiet. Even his family, friends, and colleagues say the same and they all know him to be kind just as I do. He is helpful, and a team player. \n\nI always have to remind people that just because more women have more options now, doesn’t mean than all men suddenly changed their perspectives. Unless these men who are this way do the work to adapt and be better, others will always encounter them. \n\nWithin the US, women only received so many civil rights and “privileges” to be aegay respected person, within the last 50-60 years. Think of the men who were alive then and the younger generations now. If their fathers and grandfathers, uncles, cousins, local store owners etc they encounter have always interacted with women in a less than healthy way, that didn’t just go away. \n\nI was once in a quick meeting at a table of investors and VPs. I’m a beautiful woman and was the only woman. When we first arrived this douche came my way with a smirk of lust (girlies know what I mean), leaned over and told me I had beautiful eyelashes, then handed me his business card. I felt it was inappropriate but because I struggle with social cues often, I wasn’t sure if it was a bad as I thought it was…UNTIL, the founder/principal of the private equity company that I was there with (I’ll call him Mike) was at the head of the table, and made a point to introduce me to the others as one of their investors. I am not. The company has a multi-billion dollar portfolio and had leverage over the other company at the table. The look on the faces of some of the men was priceless including the previously mentioned douchebag. \n\nI will NEVER forget what Mike did. He made me big in a room where I was immediately made to feel small. \n\nI ramble all of this information to you to simply state that your environment is toxic. Although it is clear that this behavior is normal, normalcy does not equate to healthy and never will. Imagine fathers who do this in home with their daughters, mine did and no amount of financial status that he secured for our family or gifts can ever cover the way he treated me and disregarded me as a human being. I don’t hold it over his head but I certainly don’t turn a blind eye. \n\nSome might reply to say I’m jaded or bitter, but really I just don’t care to give slack to people who choose to stay content in having poor behavior rather than self-reflect and become better. \n\nIf you cannot produce effectively where you are, that is your work and is a direct impact on your livelihood. You’ll need counseling that you’ll pay for to recover from this so you can regain the confidence and freedom to excel in your next space. \n\nFind a solution to this, think it through but find a solution where you can thrive.",
            "With knowledge comes nerdiness",
            "maybe what draws swes to swe is bc its very much face to face with a computer. maybe they're just introverted and prefer to now socialize LMAO",
            "They love computers👈",
            "Have you ever thought its the socially awkward people that pick CS as major because it requires less or no communication",
            "Sometimes stereotypes are true. It could be a gender issue and that you are attractive. You should try taking the lead.",
            "I don’t have this issue with females specifically but when I have long days coding I legitimately forget how to talk to people and it takes me an hour or two to readjust to talking to people.",
            "Not all of us! We go to clubs and raves and I’ve even taken some of my classmates out of their shells! I’m not the best coder by any means but hey I do know a ton of people lol. Maybe there’s a graph where the x axis is coding fluency and the y axis is social life. I find myself right in the middle of there was one lol",
            "Some of them might just be shy in general, but don't act that way with other male colleagues because those colleagues took the initiative to break the ice first. \n\nFeels like there's quite a bit of focus on how they should've acted towards you and not much information on how you acted towards them.",
            "I have this same problem. Nerd brains aren't wired to do well socially. It's not like they can be social on command even if they wish to be social.",
            "I’m sorry to hear this. Sounds awful. I hope you find a way to improve this in your student life. Perhaps talking to someone in a department in the uni ? Like a counselor who perhaps could offer another perspective on how to improve the situation? Good luck 👍🏻",
            "90% of them are autistic to some degree",
            "[deleted]",
            "For me, it’s mainly because the stereotype existed before I went into CS. As a gay man, I can be very outgoing, but consequently I would stick out like a sore thumb if I did.",
            "That's why China made a rule to bringing females at work to help IT people to not forget presence of females. These females they ain't into tech",
            "Yes they are, and so are redditors.",
            "Nerds",
            "I'm a mature female student, went in all smiley saying hi, etc, and OMG like nothing from the majority of the guys. I'm like a mum figure so not one hot female who might fluster them, but in my class the amount of guys with no social skills is scary.  I tried a few times to spark conversation but got nothing.  Our tutors have reiterated that you need to be able to communicate for interviews etc. I have a few older students I talk to and some younger ones too but 75% approx are scared to look at you or interact. Maybe that's the way they were at school due to being bullied or excluded etc, but in the adult world, we need to communicate with each other.",
            "Haha o feel personally attacked",
            "That’s given when you deal more with machines than humans.  \nAlso girls are scary mythical beings, at least in Comp Science studies.",
            "I guarantee at least half of them have a crush on you and act the way they do because they feel intimidated",
            "Speak for yourself.",
            "Pretty sure they are like that to each other as well. As to why? Idk lol",
            "\"Why are these nerds acting like such nerds?\"\n\n\nAs a neurodivergent person (ADHD) whos been programming since I was in middle school, I'm taking a wild guess here, but I'd bet that the amount of neurodivergent people in CS is probably a good chunk higher than the average of society. \n\n\nThese behaviors sound more like autism than anything else, to me. I wouldn't take it personally, and if anything maybe try to calm the nerves of the guys who can't even look you in the eyes. Men really struggle with rejection from women, and the more approachable you are the easier it will be for them to just talk to you. \n\n\n\nI'm choosing to assume incompetence before malice here, but I could be wrong, sexism is definitely still a thing. But I'd start with this explanation before assuming the worst.",
            "I’m somewhat “good” at socializing with women. but i make it my number 1 priority to ignore the women in my classes until after I’m done with the class. I keep it strictly about the curriculum and if I really want to, I’ll approach them after the class is over and plan a date or something. Girls are distracting for me. Idk if the guys in the OP can relate as well?",
            "Simple answer:  virgins.",
            "Why is this same post in engineering",
            "Do they have an actual need to talk to you?",
            "Lots of male fears going on there. Not at all unusual but you will have to learn to adapt to their personal issues and ignore your nagging self-doubts. It's basically all on them.",
            "Meh, if you’re the typical “LOOK AT ME IM A GIIIIIIIIIIRL PROGRAMMER ISN’T THAT  SUPER INTERESTING AND QUIRKY?!!!?!” colleague, I would’ve avoided you like the plague as well. Which sadly seems to be most of you in my experience.",
            "[deleted]",
            "Hey guys I'm a GIRL in COMPUTER SCIENCE. Did I mention I'm a biological FEMALE (the opposite of male) doing COMPUTER SCIENCE as my major?\n\nMy classes are 99.999999999999999% MALE. And yet I'm a FEMALE. \n\n&#x200B;\n\nIt's so awkward that the MALES can't talk to well because they're so socially awkward. I just radiate feminine energy and being a WOMAN,  socializing just comes naturally to me.",
            "How many fields reward you for being a basement recluse?",
            "I'm actually sincerely hoping this I'd the one advantage I can bring switching into the field. I have a decade of project management experience in construction and am pretty personable, I'm sure a lot of people have better technical aptitude than me but hopefully, I can leverage my soft skills.",
            "i don't get this , a lot of my female friends in CS or Engineering keep talking about having this same experience  as well as suffering from constant mansplaning  from their colleagues and men treating them as lesser professionals  while as a male i never hear any other male friend complaining about other females or talking about them as lesser people  in a professional  context , they  are just probably socially awkward not misogynistic or anything, for the aggressiveness part , ALOT of the \"smart\"  people in the CS line of work i met (which is going to be a large amount in a research lab)  whether in university or during my internships would become sometimes aggressive when contesting certain technical implementations or explaining something to me so i wouldn't take it as a gender problem tbh its just the type of people this line of work attracts",
            "💀💀💀",
            "https://preview.redd.it/2ovge9ive3uc1.jpeg?width=1170&format=pjpg&auto=webp&s=1009e8936eb301ba0dcec651d6b172fd447a48e3\n\nSaw your post on askacademia, I hope OP can get sufficient answers.\n\nI hope they are not intentionally trying to hurt your feelings and this is nothing personal against you as a female or as a person. IMO you might be overthinking this.",
            "The other option is neurodivergence. Computers are an abstract complex system. There may be some folks who are either slightly autistic or adhd or gifted.\n\nLack of socialization and making new friends is the other option.",
            "Tbh all of the females I’ve worked with in the industry have been a blessing and are usually the ones to ask me what I want from the lunch menu or if I’m okay, maybe try put yourself out there more? Then again a lot of people in general at uni are shy and would rather just not engage if they don’t have to so it’s probably not your fault. \n\nEnd of the day these are all people who you probably won’t interact with after graduating and from what I’ve seen people are usually a lot friendlier and outgoing in actual work places, so I wouldn’t let this get to you or put you down that much. I’d say just try to engage with them more and break down that awkwardness you may find what the problem is. Still really hard to say why they are like that though but yea you probably won’t know them after and you don’t have to be friends with them if you don’t like the way they act.",
            "This is a generational thing. Males in your age group came up during the #MeToo era and were hounded from an early age about the mere appearance of their gestures towards females being misinterpreted, so their subconscious, default behavior has been to either avoid interactions with females altogether or to be so abrupt that their verbal and non-verbal miscommunications cannot be interpreted as anything like sexual advances or sexism. This has been well-documented.\n\nI'm sorry your natural interactions with your male counterparts have been ruined by that societal trend. I believe this has gotten better in recent years.",
            "To do a PhD in CS nonetheless you need to be pretty autistic. You probably got a bit of the tism too.",
            "Are you hot?",
            "Maybe you have a great pair that’s why they can’t look you in the eye"
        ]
    },
    {
        "post_id": "mrd0vs",
        "author": "giminoshi",
        "title": "I Failed a Big Interview Recently, but I Learned 4 Solid Communication Tips in the Process",
        "url": "https://www.reddit.com/r/csMajors/comments/mrd0vs/i_failed_a_big_interview_recently_but_i_learned_4/",
        "score": 600,
        "num_comments": 9,
        "created_utc": 1618487527.0,
        "selftext": "Here recently I bombed a startup technical interview. I thought I had aced it.\n\nSo I asked for feedback and the CTO scheduled a call.\n\n>In general, we found that your answers weren't specific.\n\nWhen he explained further, it cut even deeper.\n\n>We've learned that engineers who can't speak specifically about certain experiences often don't understand them.\n\nAfter our chat, I spent some time reflecting on the interview. He was right about my specificity. My failure was some mix of poor communication and truly not understanding all the specifics.\n\nFour communication tips I learned:\n\n1. Never assume shared knowledge. Providing context is better than assumption.\n2. Think before responding. A small pause is better than a quick, thoughtless reply.\n3. Be honest about what you know and don't know. Clearly define the limits of your knowledge.\n4. Don't be afraid of ignorance. If you don't know something, take note and go learn it.\n\nHope this list is a good reminder / potentially helpful!\n\nYou can [DM me on Twitter](https://twitter.com/TR3NTG) if you have any questions. Always up to chat.",
        "permalink": "/r/csMajors/comments/mrd0vs/i_failed_a_big_interview_recently_but_i_learned_4/",
        "comments": [
            "[deleted]",
            "If I had reddit awards, I'd definitely give u one. Amazing post!",
            "Well said!\n\nContext is so important as you explain things and just don't assume everyone knows everything",
            "This is super important, thanks for sharing. I had a very similar experience. Those behavioral sections make a bigger difference than I'd thought, it's important to prepare for them just like any other sections!",
            "This is absolutely true it happened to me last year I had just graduated.The feedback I got was shocking to me and I took it and learned to articulate my technical language and experiences.",
            "3 is acc very important that we tend to forget about! They don’t expect you to memorize everything, be honest with your answer instead of throwing out buzzwords!"
        ]
    },
    {
        "post_id": "16zifr8",
        "author": "futureprincetoner",
        "title": "Finally got an offer",
        "url": "https://www.reddit.com/r/csMajors/comments/16zifr8/finally_got_an_offer/",
        "score": 595,
        "num_comments": 66,
        "created_utc": 1696411135.0,
        "selftext": "Finished my first and only internship last summer at a F500 non tech company. They did not mention anything about return offer. I was devastated since I’m graduating this year. I sent around 200 applications and did not get a single OA. Suddenly last week I got a return offer from them for 110k fully remote. I could not believe this is reality.\n\nI’ve been a long time lurker of this sub. Just wanted to share this positivity with you guys. Keep your heads up kings and queens. It only takes one!\n\nEdit: Thank you for all the supportive comments. And I’m a girl, stop calling me king lol",
        "permalink": "/r/csMajors/comments/16zifr8/finally_got_an_offer/",
        "comments": [
            "I’d rather hear this than all the damn downer stuff. Congratulations!",
            "Woooooo! Congratulations!",
            "110k remote? Dang bro let's go!",
            "Lets gooo! congratulations brother!   \n\n\nwhich company if you don't mind answering?",
            "Awesome man! You deserve it. Kudos to you and congratulations!!",
            "Congrats, and happy to see another woman working in CS (I'm also a woman)!! 110k fully remote is an amazing offer!",
            "will u be able to shitpost at work tho?",
            "Congratulations! You did the grind and it paid off.",
            "Congrats Queen!! 🎊🎊🎊🤧",
            "Congrats queen!! 🥳🥳🥳",
            "Congratulations! I read the return offer amount twice to make sure i read it correctly and its great!",
            "Woow.. You deserve it after all those struggles king. Congratulations",
            "Congratulations, my man!!",
            "W",
            "Gg",
            "JEEEZZ CONGRATZ",
            "Congrats 🥳 and best wishes for your new career",
            "YOU DID IT!!",
            "yay!! Congrats dude!!",
            "CONGRATULATIONS 👑",
            "SHEEEEEEEEESSHH lets go brodie",
            "Extremely happy for you! Good luck with everything to come!",
            "Congrats bestie",
            "LEEETSSS GOOOO!!",
            "I’m so happy for you, congrats!!",
            "Congrats 🍾🍾🍾🍾",
            "omg genuinely cracked a smile. happy for you op",
            "Congratulations",
            "it only takes one!! let's gooooo",
            "Happy for you! Make sure to celebrate.",
            "Congrats!! What position?",
            "Congratulations",
            "Upvote this to heavens",
            "Congrats 🎊",
            "Congratulationsssss! I’m so happy reading these posts, brings a pinch of hope",
            "Congrats bro!!!  \nAll the best with your future\n\nNot all of us have degrees but we all hope to make it one day like you!  \n\n\nIm currenly at a bootcamp... going good thus far... but searching for a job gonna be hard",
            "Lets goooooo",
            "Congratulations!!!!!!!!!!",
            "I know we don’t know each other, but I’m sooo incredibly proud of you. You’re living out the dream of many so young. 🔥",
            "Congratulations 🍾",
            "Grats!!",
            "Ayyyy congratulations! I also finally got an offer today!",
            "fuck you \n\nbut congrats tho",
            "congratulations dear",
            "Huge congratulations. I hope each and every one of us gets that happy phone call soon.",
            "Yesss girl!!! Congratulations 🥰 you should be proud",
            "Let’s go king 👑",
            "Congratulations Brother!!",
            "Wow congratulations",
            "Congratsss",
            "Congrats!! 110k remote is amazing!",
            "\\> And I’m a girl, stop calling me king lol \n\nYou are a king of girls, 110k is nice. Fucking nice for a noob. I got it after 10 years but i leave in 2nd world country.",
            "inb4 everyone starts saying OP is actually just a diversity hire and only got the job because she is a girl,,, 😭 \n\nfr tho congrats op you are amazing and so inspiring to me as a first year CS student 💝 you are gonna do amazing things!",
            "Congrats OP! May I ask what city or state? I’m doing new grad salary market analysis based on location."
        ]
    },
    {
        "post_id": "rlkf55",
        "author": "vasilescur",
        "title": "If your school uses Gradescope autograder, hidden test cases are now a thing of the past.",
        "url": "https://www.reddit.com/r/csMajors/comments/rlkf55/if_your_school_uses_gradescope_autograder_hidden/",
        "score": 594,
        "num_comments": 40,
        "created_utc": 1640110025.0,
        "selftext": "FOR EDUCATIONAL PURPOSES ONLY. DO NOT CHEAT\n\n\nSet up a listener on a publicly accessible server with `nc -lk 1234 -vvv`. Then submit code to an assignment that creates a reverse shell and connects to your listener. This will allow you to type Linux commands into your listener and they will execute on the autograder machine, returning the results to you. From here you can exfiltrate hidden test cases. Or mine Bitcoin or whatever, there's no time limit on autograders unless your professor manually wrote one in.\n\nThis can be as simple as copy-pasting some socket code, Google for \"C reverse shell\" or python or whatever your assignment uses. Put the IP of your public server into whatever shell code you end up using (make sure the port matches the listener, and you've allowed it thru the firewall if any). Unfortunately Gradescope's AG machines don't have `nc` on them and the old bash redirection to `/dev/tcp/IP address/1234` trick doesn't seem to work.\n\nI have a proof of concept working and was able to read all the test cases and autograder code for assignments in 2 classes, as a student, as well as fake all-tests-passed.\n\nEDIT: My info was slightly outdated, they've added a 40 minute default limit on autograders. That's still more than plenty, though.\n\nEDIT 2: I am not responsible for your academic integrity. I shared this because I feel a responsibility to draw attention to this vulnerability since Gradescope has done nothing to address it since [this paper](https://www.google.com/url?sa=t&source=web&rct=j&url=https://courses.csail.mit.edu/6.857/2016/files/20.pdf&ved=2ahUKEwjJlLfgjPb0AhWol-AKHdYQADEQFnoECA0QAQ&usg=AOvVaw2C8eBGAnRy89m9Zsu2qRbg) was published in 2016; I do not condone cheating\n\nEDIT 3: [whelp, guess the gig is up](https://imgur.com/a/rkDAzs3) (maybe)",
        "permalink": "/r/csMajors/comments/rlkf55/if_your_school_uses_gradescope_autograder_hidden/",
        "comments": [
            "What the fuck",
            "[deleted]",
            ">Or mine Bitcoin\n\nNew side hustle? Gotta get my tuition's worth somehow.",
            "And within the next two days, they'll patch this issue, or they'll leave it open and report you for cheating if you use it.",
            "Gradescope has a max timeout limit of 40 minutes and it defaults to 10 minutes when you create an assignment (you can also choose how much RAM and how many cores) so unless you have a bot that keeps resubmitting the assignment, doing something like mining won't work well.\n\nInteresting find though!",
            "Lmao if anyone is smart enough to actually figure this out and execute it, they deserve those test cases",
            "this reminds me of the time I had to tune parameters of an AI model for an assignment and I added print statements to easily compare performance to the parameters I changed, I accidentally submitted it to the autograder on gradescope, and voila… the ag output printed the optimal parameters for the model from the test case and just resubmitted that LOL",
            "Bro I’m in Python 101 😭",
            "Ngl I’ve had the exact same thought before. Generate a meterpreter payload, submit it, and take over the gradescope container. Never tried it because obviously don’t want to get in trouble. Looks like you figured out how to just fake all tested passed too. \n\nWonder if it’s possible to escape the container altogether. I’m not good enough at hacking to figure that out though, just know some skid stuff lol.",
            "lol i've considered this in the past but your code is public along with all past revisions...",
            "Or you could just do the assignment. Path of least resistance and all that",
            "Just do the work",
            ">  I shared this because I feel a responsibility to draw attention to this vulnerability\n\nso you reported it to the proper authorities in addition to posting here ?",
            "yo delete this post rn",
            "Man this type of stuff makes me excited, and i want to learn more to how to think to do these kind of things.Any tips?"
        ]
    },
    {
        "post_id": "1bjxoep",
        "author": "Ok-Possession1765",
        "title": "This major is just so painful",
        "url": "https://www.reddit.com/r/csMajors/comments/1bjxoep/this_major_is_just_so_painful/",
        "score": 597,
        "num_comments": 132,
        "created_utc": 1710993729.0,
        "selftext": "I love coding but every time I finish a class in my major it’s just so painfully depressing and demotivating. Every class is a battle. You spend hours working on fucking assignments at the cost of a social life. Then the hours spent just to grasp the concepts. And it’s not like they make the final manageable because the rest of the workload is so tough. No, the final has to be such a difficult exam that the class median is a C. And the grading distributions are so bad for CS it’s crazy. Like only 20% of the class gets an A- and above? It’s so painful to sacrifice so much when your peers in humanities and social sciences have all the time in the world to do whatever they want and breeze by with As. Ofc this would all be worth it in the end if finding employment was easy. Then, all the depression, being socially stunted, eye strain would be worth it. But no, the job markets just fucked. So now it’s like why even bother. It’s just sad man. I sometimes strongly regret making this decision, or maybe I’m just not good enough",
        "permalink": "/r/csMajors/comments/1bjxoep/this_major_is_just_so_painful/",
        "comments": [
            "Me in EE , going bald by 22",
            "[deleted]",
            "Mmm I had a class that revolved around a lab. The professor gave everyone a choice early on:\n\n1. Finish the lab project. Score an A+/4.0 if you finish it. (Regardless of quiz/midterm score).\n2. Attend lectures, do the midterm and final. Get graded like every other class.\n\nNeedless to say, he believed in the hands-on approach. The lab was ridiculously hard and during that time all I did was go to the lab to work on the project with friends, and eat/sleep/work, every other class was deprioritized. I've never put so much concentrated time and attention on anything for a single class before, and I've done my share of stupid shit as a student (like finishing one entire quarter's coursework over the course of 1 week).\n\nThen there were some kids in class that somehow... somehow knew everything. These guys would just hang out in the lab and play video games, and occasionally help other kids out with blockers when the TA was too busy. (Who the hell knew how to use an Assembly debugger? They did!) Ironically, some of my friends were given the opportunity to TA the next class instead of those super-geniuses - I assume that putting in the effort was what the professor thought would be best.\n\nSometimes, some people just don't have to sweat to get the work done. I had another friend who just absorbed almost all the material from many classes just by listening in. Finals prep week was the easiest for him because he was literally reviewing materials (like one watches John Wick 1 before watching John Wick 2).\n\nDon't stress it, just do what you can.",
            "Why is this NSFW",
            "On the bright side it’s even worse for engineering folks. A lot of engineering majors are absolutely brutal and the entry salary for a lot of their jobs is also lower than CS",
            "You are good enough. We all have the same feelings. But let me remind you that this sacrifice will return you as high salaries. Those salaries are unthinkable for \"easier majors\". Also don't forget that some schools (including mine) make things harder than it should. I know developers who are having less stress as full-time SWEs than they were in college. Believe in yourself",
            "[deleted]",
            "For what it's worth don't compare yourself to humanities and social science majors. Not even a comparison. CS is a grind but there's the light of a good job at the end of the tunnel (the job market is a separate concern). Stick with it and it'll pay off.",
            "Most majors are like this. CS is probably the easiest going in STEM. I did my BS in computer engineering with a focus on embedded systems and that was rough. My MS in CS was smooth sailing in comparison.",
            "Not a good look to compare your major difficulty or workload to humanities and social science majors when you made the decision yourself for your own reasons.",
            "My comp sci degree was the hardest thing I've ever done. I'm not very good at school. Graduated with a 2.7 GPA. \n\nNot even joking - I was so bad that I had to get an internship making a website for an erectile dysfunction clinic in the bad part of town.\n\nWorked my way up from there though! Life is great now.",
            "It's even worse for CS-Engineering. Please god help us 🙏",
            "It’s not for everyone.",
            "[deleted]",
            "I mean I’m graduating CS and my social life has been great.",
            "Same…. I have been strugling with the same 3-4 courses for the past year, still have not passed them. I just want it to be over.",
            "Somedays i SERIOUSLY think of running away. This course fucks you on so many different levels man",
            "40% of students fail to graduate within 6 years\n\nhalf of students change their majors midway through college.\n\nIt's not you. College is a broken system that barely works but there's too much money involved to change it in any meaningful way",
            "Imagine how hard it would be studying for dental and medical degrees",
            "Cs is a hard major. Just like any stem major. Idk where this attitude towards CS being an easy degree to get came from, but for most students, CS is rigorous. There are always going to be students that exceed at the field, but that can be said for other majors as well.",
            "It’s worth it , I make 175,000 a year. Keep grinding . You will reap the benefits !!!!\n\nImposter syndrome affects everyone in this field eventually , keep pushing.\n\nThere are days where even the check I make doesn’t seem worth it because burnout in this field is a real thing.\n\nI try to ground myself outside of my career to improve my mental health. This field is tough , and tough things are always worth it",
            "I sucked it up. It was horrible for a while there. Now I'm making $130k at 21. Stick it out fam. There is a payoff coming.",
            "I mean the major isn’t for everyone but if you work hard enough you’ll get thru it… trust me I’ve felt that way before. I literally broke down in front of my family, man. \nBut just know that you are good enough so just keep trying, you got this! Yes it’s a hard major but remember why you started! \n\nGo to office hours, talk to classmates and TA, work in groups to understand concepts. \n\nIt’s funny you said you regret this decision, looking back at it now, I’d regret not switching to CS when I did!",
            "Hate to break it to u but cs is easy for engineering majors",
            "this is absolutely correct",
            "Last exam average for me was a 60🫡",
            "I graduated last year from college, the whole time I was in school I worked full time, bought a house, moved, bought a vehicle, and got married. Sure I felt like I was losing my mind, sure I barely passed some classes, sure I didn't retain as much knowledge as I would have liked, sure I'm not a great programmer but I did it. If I had all that going on and was able to graduate with a 3.0 GPA, you can do it too.\n\nTake a semester off if you need a break, take some super easy classes, don't do as well in classes if it affects your mental health so badly. I'm having to go back and relearn some things now but now that I am learning at my own pace I seem to be absorbing it much better. \n\nYou either can do it or you change majors, choose what's best for you.",
            "U not wrong. It is what it is and like u said sadly stays a sacrifice as an employee. Just have to accept it and try to find the optimal way to balance, it’s a lifelong battle",
            "How is this post NSFW ?",
            "Maybe your profs kinda suck?",
            "Hey, I know exactly where your coming from! A few years ago I was in my first year of university and also had decided to look for a job. It was very difficult and yes at most times it felt undoable and it made me question a lot of my life decisions. I would ask myself \"what was the point of doing so much work outside of school to see your friends in much easier majors doing much better\". For me I thought I had to change majors in order to contend for a lot of these jobs however this is false. One thing a lot of CS majors don't understand is your problem solving skills aare UNIVERSAL a lot of the skills you learn throughout your degree can also be used in finance, and your coding knowledge will also give you an edge over many financial analysts. I think (and this goes for everyone) rather than mindlessly completing classes and regurgitating the same capstone project or same algo projects.  Learn skills that have nothing to do with CS and then find ways to apply CS to it. It is very difficult for a lot of people to find jobs because this field of study is PROBLEM SOLVING and the only way to thrive is by solving problems that haven't been solved. The market is bad yes, however it has been bad before! The ones who are able to not complain and get the work done will always be the ones with a job :)",
            "On top of that imagine most classes do not even have the relevant frameworks, specific modern technologies and if there are any it is a one off small project with very limited scope/depth that cannot even get you a job in that specific  area in Tech, rather it is funny.... how everything has to be learned by you OR you have industry connections some how someway, much older friends, much much more talented friends, family business, family members can hook you up with a job etc. Good luck though.",
            "Skill issue",
            "Man first do it like you want, own rhythm and use all ressources avalaible at school. At some uni it's more difficult. Don't let a fucking math teacher demotivate you. At the end, there will be a job for you, you are in CS! You'll take that doesn't require lots of logical maths and research and 90% of what you'll have done at school will be old memories. It's at this moment, after the major that you'll really be building your professional life and sought-after skills. 😊",
            "Yeah no duh it’s supposed to be difficult, it is one of the most difficult majors, but believe me you’ll get used to it and get time to do other stuff… like personal projects, networking events, working out, etc. When you get to that stage, all the sacrifice will be worth it. Btw what year u in?",
            "You are my CS spirit animal.",
            "Take comfort in the deeper suffering and longer lab hours of the mechanical/chemical/electrical engineers out there.\n\nNamaste.",
            "Take the hardest classes online, sometimes the classes are built to be more difficult than they need to be. Once the resources offered are available for you to reference from all the time (except exams, or maybe sometimes even during them) the entire course becomes much more achievable.",
            "No pain no gain",
            "This is exactly encapsulation of my experience too wow",
            " Math major over here",
            "An electrical engineering degree is just 4 years–okay, 5—d’oh! 6 years to get your undergrad degree, and then you have employment options worldwide, often at excellent pay. At least for the survivors, it’s a fair reward.",
            "I can't relate to this. My experience with the degree has been overwhelmingly positive.",
            "Dude wot, what subjects did you pick?, I didn't have this sort of problems even in OOP and data structures... buy GPT4 and do it fast. About the market you are right. But you ppl in US paying astronomical salaries >100k on tech, this was expected that the bubble was going to explode anytime...COVID and AI fucked this major. Better to start studying plumbing.",
            "It’s worth it",
            "College CS is incredibly easy compared to industry. If you are not enjoying it or passionate about it I would change majors. Many people do change majors in college (super common).  If you have a career you are passionate about then you will never feel like you are working. \n\nToo many people go into CS as they see it as a high paying field. But you have to love the work or your work life will suck.",
            "lol reeeee social sciences.\n\n1. The job market isn't as fucked as you're making it out to be. It's picking up.\n2. You're not Jesus on the Cross for doing STEM. Your most valuable asset after graduation is critical thinking and personal drive (with baseline technical knowledge). It's not compiler deconstruction. Liberal arts are just as good if not better at fostering that.",
            "It's probably the easiest engineering degree you can get and with one of the highest salaries. And it's honestly not that hard, especially now with AI. You're just either lazy or I'm sorry, but not that smart. It's not rocket science, coding is 90% practice and 10% skill lol maybe it's just not for you\n\nAnd sure the market is horrible right now, but you're in school wtf does that have to do with anything? You're not affected by the market, and it constantly changes. Stop trying to find excuses. GPA and grades don't matter unless you plan on doing extra stuff at your school that requires a high GPA. As long as you pass and you're decent at coding you should be fine. The most important thing is finding something that you like enough that'll motivate you to work everyday, and there are so many possibilities in tech, look on the bright side not just the negative side.",
            "sad to say, agree\n\nwait til you get a job with crunch etc surrounded by clueless pms, bms, sales people setting deadlines on top of it \n\nps if you go in a date never tell them you do comp sci. better off saying your an ex con\n\n[https://youtu.be/jKYivs6ZLZk?si=2POBbLFHt7cwVoTZ](https://youtu.be/jKYivs6ZLZk?si=2POBbLFHt7cwVoTZ)",
            "Just change major?",
            "how r u finding cs degree hard…plug half the assignments into gpt"
        ]
    },
    {
        "post_id": "lc7yvz",
        "author": "Curious_Cucumber1304",
        "title": "Some piece of advice for kids in early days of college",
        "url": "https://www.reddit.com/r/csMajors/comments/lc7yvz/some_piece_of_advice_for_kids_in_early_days_of/",
        "score": 592,
        "num_comments": 121,
        "created_utc": 1612414539.0,
        "selftext": "I have a good GPA, above a 3.6. Went to a good university. Studying CSE with a minor in Math, worked as a TA, as research intern, and working on an independent research project in my last semester. And I don't have a job lined up for when I graduate this may.\n\n\nDo your LEETCODE. That's how you gonna get a job. Fuck everything you gonna learn or do in school. It's not going to be useful to get a job. LEETCODE ALL DAY, EVERY DAY.\n\nDone venting off. Peace",
        "permalink": "/r/csMajors/comments/lc7yvz/some_piece_of_advice_for_kids_in_early_days_of/",
        "comments": [
            "2.5 GPA with 2 SWE internships and extensive LC practice > 3.9 GPA with 0 internships and 0 LC practice",
            "I mean at least you have a chance to do leetcode (getting past the resume screen) but I get your point",
            "This. I see so many people at my school fall in the trap of trying to have a good GPA and end up graduating with no internships and/or little to no personal projects. Then they end up getting shitty jobs or nothing for months after graduation.",
            "Here's my tip: learn to network. I got my internships and full-time offers mostly because I made friends with students who had great internships, and they were able to refer me to the companies. \n\nThe interviews for companies where I had referrals almost never required Leetcode, and that let me spend more time on projects, especially team projects that let me meet more students who could give me referrals and career advice.",
            "But learning about x86 architecture is more fun :(",
            "me: 2.9 GPA, 1 Internship is F500, 0 name school, some leetcode (200 problems), graduated with a job at different f500, 65k salary L-MCOL. Currently interviewing for a position at 6 figures same location.\n\nroommate: 2.1 GPA, 0 Internship, 0 name school, no leetcode,  graduated with a job at FAANG\n\ncolleague: 3.9 GPA, 1 Internship, F100 Internship, 0 name school, no leetcode, still looking for a job\n\n&#x200B;\n\nMay 2020 grads.\n\n&#x200B;\n\nHonestly its just luck, nothing makes sense.",
            "I feel Your pain OP",
            "Idk though leetcode only helps so much. It definitely is way better than just the degree though. Teaches good problem solving.",
            "Conversely: Don’t waste your time leetcoding and spend your time networking because at the end of the day it’s really just about who you know and wether people like you👍🏻",
            "I guess I’m fucked then....",
            "Or just learn to network. I have never once had to do leetcode. Most of my jobs have been from people seeking me out. They either want me or not. I'm not going to jump through hoops.",
            "this is extraordinarily bad advice for anyone who wants to go into academia",
            "I got a job, and I was never asked any LC questions during the interviews. But it's a small company that pays $60K.  So it depends on the company. If it's a well-known company, then yes -- do LC problems all day, every day.",
            "I pretty much refuse to do Leetcode for any company that tries to make me do it.  If my years of experience with verifiable references and a portfolio where I can sit down and talk shop with anybody who wants to verify my knowledge isn't good enough, then we're not a good fit.  There are still some places that haven't fallen into the FAANG \"monkey see, monkey do\" ways of doing interviews, but you'll have to dig deep to find them.  Of course if it's \"FAANG or bust\", then you'll have to play their game.",
            "[deleted]",
            "3.27 gpa here. Have done a total of 2 LC problems to see what it was all about. \n\nI have an internship this summer, which almost always leads to a job with that group.\n\nEnjoy your time in college, code some side projects, memorize your algos, LC doesn't do much outside of FAANG.\n\nAlso, they asked what I knew about computer science, I explained my projects, my debugging process, my programming team experiences, etc. Nothing about algos. specifically.",
            "I don’t do leet code, I have a 3.75 gpa. I had one internship, and I have a job lined up for me this summer. Starting at 80k as a cloud application engineer. You don’t have to do leetcode.\n\nHowever, I did have many side projects. I believe showing your passion has more worth than leetcode.\n\nAlso - for OP, you have a lot of time to find a job. Just keep applying and you’ll find something.",
            "Yup, and that BS of \"We just want to see your thought process!\" lmao   \n\n\nNo, you don't. You just don't want to waste time with someone who can't code as well as you want, because God forbid your internship actually does what it is supposed to do and help someone learn.",
            "Here’a my advice as a new grad who is about to start working as a software engineer. Leetcode is important, it prepares you for interviews and you should absolutely use it to maximaze your chances of landing a job out of college. \n\nThat being said, don’t make Leetcode your life. Enjoy you’re time at school and use it to learn as much as you can. Our field is so broad that it would be a shame if you don’t use this valuable time to explore many interesting topics. This can be achieved through taking interesting electives, taking up research positions, doing well in your classes. It’s all about balance!\n\nDon’t end up as one if those people who can ace leetcode hards but can’t remember how computers work at a fundamental level, or all the other essentials taught in school. Then again, that’s just my opinion and everyone is entitled to their own :)",
            "1. You haven't even graduated yet. Not sure you're in a position to be giving sage advice, mate. Not trying to offend, just calling it as I see it.\n2. It's early February. Yes, some people will have jobs in hand for after graduating already, but not everyone will. My experience is, a very large number of people, if not even the majority, will not have a job in hand yet. Keep applying and interviewing, there's nothing to panic about. Believe me, it took until May for me to lock down a job before my graduation in June when I was graduating, and that's not uncommon. It gets frustrating, it's a lot of work, and most of it you might not even hear back on (outside of automated \"your application was received\" emails), but keep chipping away at it.",
            "Also...get a whiteboard!!!! Even a small one is invaluable for algorithms.",
            "I had a shitty GPA and got a summer internship, they liked me enough to offer to extend it through the fall, then again through the spring, then offered me a full time position. \n\nTwo years later another company reached out to me via LinkedIn and made me an offer I couldn't refuse (after countering). I switched.\n\nNeither required leetcode, it was more about my personality and my history/experience.\n\nNow, I'm not saying that you shouldn't practice leetcode. I'm just saying that working on your soft skills, getting an internship, and keeping an up to date/interesting resume and LinkedIn are just as important, if not more.",
            "What's leetcode?",
            "I’m only a freshman (but graduating 2023 so technically sophomore), and I can’t even get an interview tho. I only got 1 interview so far. I just don’t know what to do. What’s the point of LC if I can’t even get to the interview stage? I hear about people getting Amazon or other FAANG after their sophomore year, and idk how I’m supposed to do that if I can’t get an internship this year.",
            "Barely holding a 3.0 did a personal project and leetcode and got STEP a few months ago. Either network, do something outside of class, or prepare for these interviews",
            "Leetcode + Networking! I got all my internships except one through referrals. I eventually landed my Big N job as a return offer from an internship. \n\nLeetcode & Networking will set you up very nicely for your career prospects without ruining your free time.",
            "This leetcode culture is cancerous. GPA doesn’t mean anything and leetcode doesn’t mean anything. Just work on personal projects to show your worth and enthusiasm toward the field.",
            "Kids. Don't take advice from someone venting off.",
            "So even as a freshmen you should do leetcode? Or should I wait till like the summer at least",
            "What is your advice on making projects? I always get stuck even when doing simple ones",
            "Sad but true",
            "You don't need that much LC tbh. You should try to increase the number of interviews that you receive. I am in FANG because I have interviewed with all of them. The more you play, the greater your chances of winning",
            "Grind or die",
            "I just do the string/array stuff and once this sem is over I’m gonna do the other stuff bc I’m taking ds this sem",
            "Is LEETCODE something you present along with your resume? Are there like certificates of completion or something?",
            "As someone who hates leetcoding, man im boutta cry"
        ]
    },
    {
        "post_id": "1bahqzc",
        "author": "MathmoKiwi",
        "title": "The importance of internships: an underemployment rate of 20% vs nearly 40%",
        "url": "https://i.redd.it/ioeegqlx8bnc1.jpeg",
        "score": 597,
        "num_comments": 95,
        "created_utc": 1709990933.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bahqzc/the_importance_of_internships_an_underemployment/",
        "comments": [
            "Damn this is pretty significant. I didn’t do any internships but I did start working as a dev my junior year.",
            "Yes, but the problem is getting the internship.",
            "One important thing to note is you cannot derive from this data that having an internship doubles your chances of getting a job. There would be a very large sampling bias because the people that got an internship are also the people that do well in interviews in the first place, which has arguably a larger influence to the end result.",
            "Wait till you discover that the more firefighters sent to a fire location, the more damage the fire does. \n\nNothing can be as such derived from this data.",
            "I feel like a lot of people in the comments are misunderstanding the graph? This says underemployment, which is not the same thing as unemployment. Unless the graph is wrong and means to say unemployment?",
            "Source, this WSJ article: [https://archive.ph/oyc5e](https://archive.ph/oyc5e) (who themselves cite Burning Glass Institute analysis of Lightcast Career Histories Database as their source)",
            "yeah, I'd even say that the whole point of going college is to get internships. Graduating without internships, especially in this market, is essentially a death sentence of unemployment.",
            "It’s competitive",
            "I definitely knew this but never knew the exact number difference, thanks! \n\nI feel like people are selling themselves short by not seeking out as many opportunities as possible while paying up the ass for tuition. \n\nI def feel for the competition for internships right now. It’s the same type of market you’re seeing for entry level. \n\nIt’s crazy how fast the tech industry was willing to hire juniors, just as fast they stopped hiring juniors. \n\nAnd they really don’t need to, they just want bigger profits and over hired a few years back",
            "Can't find an internship? Make your own with a fake company name...",
            "On average 50% of business majors won't get a job...damn",
            "What is underemployment rate? Is it the same as unemployment rate?",
            "This isn’t surprising. I have a relative who graduated from college but never did any internships. He only worked retail and fast food jobs during the summer. I tried helping him find a job, but as more years go by since graduation, it’s becoming harder and harder for him to secure an entry level position in the field he studied. He has absolutely no relevant experience and the longer you wait to get relevant experience, the harder it becomes to get it.",
            "Basically 40% of CS grads without an internship end up unemployed, versus 20% of CS grads with an internship ending up unemployed. \n\nFolks...this should scream out to you to apply in mass to internships. When I see people on here say \"Well I applied to 50-100 internships.\" Bro...do you go to some Ivy League school? Because if not, you should be applying to 400-500 at minimum. I applied to 800 because I knew the university I went to wouldn't carry me to where I needed to go. 400 is the bare minimum unless you're graduating from an Ivy or a school out in California that is massively recruited from by tech companies.",
            "I feel this.",
            "Are we seriously calling unemployment “underemployment” now",
            "Just curious, What measure of underemployment is used here ?",
            "Pretty weird that the underemployment of CS grads is 20-40% when every single day I read on this sub that it's 100% and the field is dead.\n\nIt's almost as if people are lying for clicks.",
            "just a question, considering the market is drastically different now than before (in terms of competitiveness) how do we know this data is relevant? We don’t see a year",
            "![gif](giphy|j6uK36y32LxQs)",
            "damn the unemployment rate is high all across. 20% for cs grads even w internships?"
        ]
    },
    {
        "post_id": "15knn8u",
        "author": "guwoskcmamja",
        "title": "WTF is all these numbers",
        "url": "https://i.redd.it/8bvm5vfjgpgb1.jpg",
        "score": 591,
        "num_comments": 123,
        "created_utc": 1691421510.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/15knn8u/wtf_is_all_these_numbers/",
        "comments": [
            "It's only 2k applicants. I seen far more in magnitudes like 12k+ in two days for more known firms.\n\nWelcome to saturation. It's happening. No need to be in denial at this point.",
            "The number 1,939 is the number of times the Apply button has been pressed.",
            "I really wouldn't worry about this. More than half the applicants are usually applying from India and other countries, which automatically gets them rejected due to not having any work authorization.",
            "Bro you taking a picture of your screen just disqualified you to get that job anyway. Move along",
            "Honestly don't worry to much about it. If you assume you have equal chances with those 2k applicants you will think you have a poor chance. The quality of applicants follow a power distribution (20/80 rule, etc). Just look better than the average and you'll have an easier time",
            "[deleted]",
            "Why does it say compare to 40 applicants below?",
            "Iirc the number of applications is just how many people clicked the apply button, not how many people actually submitted an application.",
            "Blank interface doesn't look very great. So...",
            "LinkedIn is the worst offender for high applicant numbers in my experience. I don't even waste my time applying to postings like this unless I think I match the qualifications really well.",
            "It doesn't say internship.",
            "Man, now I want to reconsider my major.",
            "Scary",
            "Don't lose hope seeing all this. I'm pretty sure only like 200 out of those would be confident enough to crack the job. The rest are all for a game of luck and might have applied for the sake of applying. And speaking from experience, try to apply for the jobs through the career page of the companies rather than the linked in jobs section. That and cold mailing. Also, dm ing the HR's and top professionals of the companies will have a lot more impact than simply clicking an apply button on LinkedIn as anyone could do it. All the best.",
            "I was offered to interview at Amazon for a new grad position... I have 2.5yoe at tiktok smh.",
            "Wow am I happy to be in Germany rn. It’s the complete opposite here.",
            "Never apply. Wait for them to contact You. That's my rule to have good mood about looking for job.",
            "the fear mongering in this sub is crazy",
            "It would make sense to prioritize applicants that live in the area that it’s in.",
            "Is this position for a person graduating in December? Or is it too early now?",
            "I just met 2 guy at a business networking event, they both got Amazon Web Service SWE job, 23-24 years old, making me wondering how tough it is to get in …",
            "This is actually happening guys!!!!!ugh. Cs majors are doomed",
            "I bet half of them are Indians in that",
            "SWE over saturated market now or what?",
            "ChatGPT: *exists*\n\nJob market: ah shit, here we go again",
            "I applied here too :p. Competition is rough man",
            "I, as an entry level, will be applying against 1939 more applicants? Well. Fuck me",
            "Saw one with 22k yesterday. I think most of them apply because of the easy apply option.",
            "The competition is insane",
            "This is what you call the new normal in the US right now.  It is insane.   Buckle up .  Just think this is a onsite role .... I thought they said alot of people are not applying for onsite roles in the US ?   We have determine this is a lie .",
            "I applied to this exact posting and got a response despite having minimal SWE exp. Don’t sweat the numbers, just apply!!",
            "rookie numbers",
            "Approximately 1,000 of them are ineligible due to living in India and most of the rest are so unqualified that the Computer laughs at them when it auto-rejects.",
            "Off topic but is a Stats Major as saturated as a CS Major at this point?",
            "Yes, this is bad for you if you believe you are on par with 2k applicants",
            "Do not worry, more than half are pure idiots, sad world, just try to do better, gl.",
            "Just clicks on the apply button",
            "Gecko Robotics? Hard pass.",
            "Sort by posted in the last week or day, under 10 applicants, plenty of quality startup to medium size companies that need talent and will provide the experience needed to start ur career"
        ]
    }
]