[
    {
        "post_id": "15505kq",
        "author": "EitherAd5892",
        "title": "Reality hits after college - new grad",
        "url": "https://www.reddit.com/r/csMajors/comments/15505kq/reality_hits_after_college_new_grad/",
        "score": 589,
        "num_comments": 128,
        "created_utc": 1689880205.0,
        "selftext": "If you graduate without a job lined up, it will get real depressing when you wake up everyday not knowing what to do other than interview prep and/or applying to jobs. If you are about to be a senior this upcoming fall do your future self a favor by working your ass off this summer and the following school year to get that job lined up. You will thank me for saying this because I was able to have a job lined up and it feels good knowing you have something to look forward to. I hear countless people becoming depressed being unemployed or underemployed after graduating because they did not do internships or waited to find ft jobs after graduating. Trust me. You don’t want to “wait after you graduate” to apply for jobs. You will slowly lose your new grad title the longer you become unemployed and it typically takes more than 4 months for companies to get back to you for interviews. It’s a tough market out there. Prioritize job search over school if your classes aren’t that hard and this is coming from a new grad",
        "permalink": "/r/csMajors/comments/15505kq/reality_hits_after_college_new_grad/",
        "comments": [
            "Fax. I waited to start applying until October(middle of the 1st sem of senior year) to apply bc I was banking on my internship return offer which would later be rescinded,  come graduation and I had nothing lined up. Graduated May and depressed for months now lol, start early.",
            "If I have to take a non dev IT role to help out my family and to maintain health insurance, will I be disqualified for entry-level dev roles in 6 or so months? I was a transfer from IT to CS and only had 2 years during covid period to find internships. I graduated in December.",
            "Imagine if the schools helped us prepare for this haha. In my program there are zero resources to help soon-to-be grads find work",
            "Facts. New grads need to emphasize the fact that the moment they graduate, they are on a ticking time bomb. After 6 months, it starts to look bad to potential employers that you haven't secured a job yet. After 12 months, you're disqualified from most new grad roles entirely -- you're damaged goods in the eyes of most companies. At that point your only hope is to hit the reset button and go to grad school for another shot at internships/new grad status.   \n\nDon't let this be you. Be LC medium proficient and start mass applying the summer before your senior year (i.e NOW for rising seniors) in order prevent a months long stretch of depression and doom.",
            "I was sold on the startup entrepreneur bs dream during college. Failed and fucked.",
            "This is very true, I graduated in August 2022, did not have a job lined up, thought it wouldn’t be that hard to find one. Boy was I wrong, I took a few months off to relax, I shouldn’t have the job market just froze outta nowhere, and I was stuck twiddling my thumbs for almost 11 months, I just got a full time offer a few weeks back and started working, but the past year has been hell, so many applications and fixing my resume/skills to land anything.",
            "Sounds like too much work",
            "Meh",
            "I graduate May 2024; Do companies still consider to hire me even if I won’t be able to work for a year?",
            "This!! Man it’s so hard to deal with mentally and  and I’m just 2 months in",
            "Keep your chins up.\nStay busy and continue coding and building projects. If you are competent and confident,  you'll get hired eventually.",
            "What school",
            "I agree with this, however don’t be too hard on yourself if you don’t get anything. Try to enjoy yourself while you’re unemployed, and apply and grind as much as you can. I graduated last year and started working 6mo after so it’s not impossible, definitely wish I had something lined up though",
            "Does this count for online programs? WGU? I’m still sooo anxious if I’m making a mistake because it doesn’t seem their is a difference in networking when the other option is suny/cuny yk",
            "If it gives you perspective..even after getting a job and working ..u could loose it to layoffs or being fired. There’s no guarantee. So take any job during a week economic season and then when things get better u get better job. As a new grad I will be competing with prospects that have more experience so that adds to it. I myself struggled in 2006-2013. Was the worst time . I was bouncing from one contract to another..low pay . One yr no job at all. It was hard. But keep looking and take those free courses online. Look at google certificate etc skills u add on will boost u up as a candidate",
            "Best advice I ever got was to start applying to jobs ~6 months before graduation. Took me 4.5 months to get an offer.",
            "[deleted]",
            "Agreed and I am even in a slightly better position. Applied for a full time position not related to my field to hold me over (rent and tuition and stuff) until graduation and am now stuck here because the market is so bad.",
            "Happened to me too. GEMS right here.",
            "I didn't do that because I was doing my Thesis and, it was the worst mistake of my life.",
            "Gonna grind leetcode/gfg now. I don't want to be more depressed.",
            "Ehh, YMMV. I graduated in spring of '22, had an internship and started applying to jobs in july. Applied to no less than 10-20 positions, got 2 interviews  and started in feb of '23. I had a couple of degrees and roughly a year of experience from the internship but the point is that sometimes the stars align and sometimes you just gotta keep going.",
            "Just say you graduated later than u did ez",
            "[deleted]",
            "Didn't got any internship, I major in IT but work at IT support for a month and half when I am about to graduate . After I graduated took me 5 months to find a role that pay really well . I also got lucky. One thing I wish I could do better is apply to job way before graduating and more internships exp",
            "Seems I am the only one to disagree, i did fuck all for 6 month after graduation (except interviewing) and it was great.",
            "If you wanna start an ebay business you can expect 500$ a month without doing anything. I do that and make 2% a month in investments with condors. I don't need a job",
            "Welcome to IT fellas",
            "What's more annoying is that even consultancies that used to beg you to join them have started acting like they're FAANG. I understand they might not have as many projects but their recruiters have now become unreachable.",
            "My exact thoughts going into the workforce and graduating in May, 2020. Had 3 offers, 2 rescinded and 1 pushed back twice before I was able to start. Those were stressful days.",
            "This was me 6 years ago. I did a masters to buy time."
        ]
    },
    {
        "post_id": "ss4fl7",
        "author": "Helius1108",
        "title": "Since many here only flex about their success",
        "url": "https://www.reddit.com/r/csMajors/comments/ss4fl7/since_many_here_only_flex_about_their_success/",
        "score": 590,
        "num_comments": 66,
        "created_utc": 1644822037.0,
        "selftext": "I will start bragging about my failures now. Even if I get many downvotes, hopefully the mods won't remove this because I want this to be a reminder to myself in the future.\n\nI did a 9-month co-op at a tiny tiny company starting 2020. First 3 months I did very well and they loved me and gave me my own customer project as an intern, but then I fucked up big time on a customer project and they held that as a grudge and did not give me a full-time offer in August 2021. I was too embarrassed about not getting an offer, so I told everyone I know that this company is actually giving me an offer, but it is too low and I want to take a risk and apply for better offers.\n\nI knew nothing about Leetcode in Aug 2021 and fell into deep depression, and succumbed to my ADHD until October 2021. I started applying in October for full time SWE positions.\n\nMy first OA was Twitter, which every applicant got one automatically. I did not get a single testcase correctly. I started leetcoding like once per week since my best friend was doing it.\n\nThe plan was to graduate in Dec 2021, but I was failing my classes so I had to extend my visa (I'm international std) and plan to grad in Spring 2022. \n\nFrom October to December 2021: failed Roblox OA, failed IMC OA, Twilio said I did great and kept sending me emails until now, but no interview. I got Goldman Sachs Hireview interview, which I prepared for so much but failed miserably nonetheless. I got Amazon OA, which had 2 questions, I got 1 and only passed one testcase for question 2. I did good on TikTok, Palantir, and SambaNova OAs.\n\nJamuary 2022: I got interviews for TikTok, Palantir, and SambaNova Systems. Sambanova actually passed me to the final round, but then the second interviewer asked what is a cache, and I had no idea what that is. He then asked how are local variables stored in C, I had no idea either. Failed my first final interview, felt pretty shit, and I was burnt out. I did well on Palantir's interview, but they rejected me anyway. I had an awful interview experience with TikTok and expected nothing, but they just gave me a second interview last week and I bombed it.\n\nFebruary 2022: somehow Amazon gave me final round with 3x45. I leetcoded for 5 days straight before the interview. First interviewer gave me a directory and asked me to write \"maintainable production code\" on a short question. I was confused AF and wrote some class and she said this is not maintainable. I had to pretend that my wifi connection is becoming weak and I could not hear her, but in reality, I did not know how tf to write \"maintainable production code\". At the end, I admitted I did terribly, and coasted through the next 2 interviews.\n\nMeta recruiter reached out and gave me a LC interview. Auto rejected next day. At this point, I have made peace with the fact that I am going back home after graduation with no jobs. I was sad, but I had to convince myself that it is okay. I am too burnt out to keep applying. I made peace  with the fact that I didn't get into Ivy League in 2017, so why would why I get into FAANG now? My soul is tired. I probably need to go home and rest. Bc of the pandemic, I have not met my parents since 2019. \n\nI got an offer last week for FAANG. If you actually read my rant, you will know which one. It felt great, but I have a deep understanding for those who are still on the grind, especially those with ADHD. It is such a soul crushing process, and I was a lucky one. I sincerely hope those who are burnt out to find the strength to keep going. If you choose to give up, I hope you find peace and accept that it is okay, even though it is so hard to do so. \n\nIn Vietnamese, there is a saying: Thua keo này, bày keo khác. It means if you lose this round, start planning for a different round, or something like that. Idk. Thanks for coming to my ted talk.",
        "permalink": "/r/csMajors/comments/ss4fl7/since_many_here_only_flex_about_their_success/",
        "comments": [
            "“I will start bragging about my failures”\n\n*gets offer at FAANG*",
            "I am more surprised you failed IMC, Roblox OA but did good on TikTok. IMO TikTok has one of the hardest OA but that might just be me, anyway, congrats on the offer! All the grind was worth it! Wish u good luck on FAANG",
            "Why do people think their life is a failure if they can’t get into FAANG? Genuinely curious, not trying to take a stab at OP. \n\nFrom what I have heard Amazon and Facebook are not that great. I would rather work for a smaller company if that means my mental health doesn’t get destroyed and I have a healthy work-life balance.",
            "I have nothing to say but congratulations and a hello in Vietnamese: xin chào đồng hương",
            "Hey. I went through the same when I was about to graduate. Find some small companies who's interview processes are easier. Worst case scenario, find a consultancy. Think about this rant on Valentines Day 2023. I'm sure you will be in a better place.",
            "This was a good read. I’m also an international student on F-1 and we really have to get a top company or we’re pretty much back to our home country. On top of that, lots of companies just auto reject us due to F-1 visa and its difficult to even get OAs for internship positions.\n\nAnyways congrats i’m really happy for you :)",
            "I thought techical interviews only had leetcode. What's \"directory with maintainable production code\" about? Freshman here so I don't know much about the process",
            "Here’s how I failed: *gets interviews at multiple FAANG and an offer, as well as countless OAs* \n\nOk.",
            "Just getting interviews from all these big names is a success in itself. Most people are struggling to get interviews from even no name companies or any at all.",
            "Nice it’s about how you finish not how you start",
            "Oh and I also forgot to do my OA for Blackrock in January. Big lolz",
            "Dope shit man :)",
            ">succumbed to my ADHD until October 2021\n\nAre you on Adderall or drink coffee?\n\nI read your essay, but I could not tell which FAANG it was. \n\nDid the fear of failiure of being sent back to your country without a job motivate you?",
            "I’m gonna flex my success, fuck all you guys. I got my first job . 72k in HCOL ! 😂😂",
            "Please get diagnosed and professional help if you can. It’s not about your achievements it’s about your health. The fact is that people who don’t have it don’t realize how shit it really is, how nearly impossible it is to dig yourself out of holes even when you’re not doing bad. Not specifically at OP, just in general if you relate to this and strongly suspect ADHD",
            "Dude. I don’t see a single failure in your post.",
            "- Hey good to see a fellow Vietnamese going places. It's been hard for me too but I finally got an offer and it was such a great feelings. \n- I'm sure only best things will come to you from now. You had a good fight. Time to take a chill term before graduation and starting work. You can travel somewhere and let your mind rest. Good job!",
            "I appreciate this post so much. It's definitely hard to read success stories over and over when no one mentions how many times they failed before succeeding. \n\nThat being said I do agree with others that not landing FAANG is not necessarily a failure. I suck at leetcode, so I aim smaller than FAANG. My most recent interview was essentially leetcode but over zoom, so I was able to explain my process while doing it so that even if I couldn't get an answer I still had a chance at getting hired. You should be proud you even got interviews at FAANG!",
            "Congratulations on your offer! It's all about not giving up",
            "Hey, when did you get your internship at that small company ? How far were you into your BS. Did you have any experience before that ? Congrats on getting an offer. Props on not giving up. You shouldn't say you were lucky. You were the opposite of lucky, worked harder every-time you failed and ended up with an offer. I'm currently in my 2nd year for my BS and I feel like I need to start looking for internships. Good luck on your job!",
            "Hello friend. As I was reading your post, I could really imagine how exhausted you were, and still are. People may say you didn’t struggle that much, but for someone with focus issues and depression, trying to work with a foggy brain is almost physically impossible sometimes.     \nPlease do take care of yourself so you can set yourself up for success in your new job.",
            "Ah, excellent. This is my time to shine. I’m not doing well with my internship and I’ve been rejected from every single job interview that I’ve had thus far. Feels great man",
            "Missing Tết for 2 years is rough, the future is very bright.",
            "chúc may mắn!!!",
            "Chúc mừng bạn (Congrats first of all). I applied to FAANG and a bunch of other companies. No offer yet. I really like and applied to Cloudflare. Still waiting for reply :( Can anyone give me an estimation of me getting offer from them :v",
            "Just finished an internship interview where I mixed up stacks and queues so god I really needed this post 🤦🏻‍♀️🥲.\n\nThank you, this makes me a bit more hopeful",
            "Proud of you for hanging in there, it’s not easy:)",
            "Respect",
            "Why'd Palantir reject you?"
        ]
    },
    {
        "post_id": "nlli33",
        "author": "Farconion",
        "title": "FAANG to TikTok / YouTube study influencer pipeline!",
        "url": "https://www.reddit.com/r/csMajors/comments/nlli33/faang_to_tiktok_youtube_study_influencer_pipeline/",
        "score": 589,
        "num_comments": 32,
        "created_utc": 1622047468.0,
        "selftext": "getting a position at FAANG is cool and all, but why do that when you could quit your job and make money telling high schoolers and college students how to get into FAANG?\n\nyou don't even need to do anything! all you need is:\n\n* a TikTok, YouTube, and Discord channel\n* a \"premium\" subscription service where you give \"one-on-one\" training, exclusive tips, or some BS\n* reposting the same 3 Leetcode easy tutorials, telling people to do personal projects, and telling them how much $$$ you made right out of college",
        "permalink": "/r/csMajors/comments/nlli33/faang_to_tiktok_youtube_study_influencer_pipeline/",
        "comments": [
            "Isn't that just techlead?",
            "That's what most of them do. You can't blame them, just put keywords like FAANG or Leetcode , easy 500k views.",
            "If it’s so easy why are you still here lmao",
            "Jarvis, are you trying to get into Reddit; silly Jarvis!",
            "Nothing wrong with them. They’re just chasing that bag, can’t disrespect it. Unfortunately, nobody really cares about how you earn money nowadays as in is it worth respecting or not.",
            "Make like 20 videos on why you left, why its bad to work there, why its good to work there, how hard it is, how easy it is... the video topics are endless!",
            "Cough cough techlead",
            "That’s pretty much the entire oversaturated development industry right now. People are selling courses left and right.",
            "Wtf😒😒",
            "😭😭",
            "Shovel salesmen everywhere."
        ]
    },
    {
        "post_id": "1ci32dv",
        "author": "Polarisin",
        "title": "TESLA started rescinding intern offers a few weeks before start dates. ",
        "url": "https://www.reddit.com/r/csMajors/comments/1ci32dv/tesla_started_rescinding_intern_offers_a_few/",
        "score": 593,
        "num_comments": 73,
        "created_utc": 1714612619.0,
        "selftext": "[https://www.forbes.com/sites/antoniopequenoiv/2024/05/01/tesla-abruptly-pulls-summer-intern-offers-amid-major-job-cuts-report-says/?sh=5a5efdf212bb](https://www.forbes.com/sites/antoniopequenoiv/2024/05/01/tesla-abruptly-pulls-summer-intern-offers-amid-major-job-cuts-report-says/?sh=5a5efdf212bb)\n\nDamn these companies are ruthless",
        "permalink": "/r/csMajors/comments/1ci32dv/tesla_started_rescinding_intern_offers_a_few/",
        "comments": [
            "Incoming intern here, started interviewing again today. Had several people ask me about the layoffs too. Haven’t heard of any SWE intern who got laid off, but I’m not positive that my fall internship will last, likely cooked.",
            "Obligatory “we’re cooked” comment",
            "Yet we are going to have a record number of CS grads this decade. This decade itself might prove very painful. Lots of offshoring happening now too post pandemic as companies reference the pandemic WFH model as \"offshore now works unlike the past. Plus, all the best talent globally are studying CS anyways\". Why pay 5x for talent you can also find in countries like Mexico and Brazil going forward. Plus, all the information is easily accessible in this field.\n\nMeanwhile, work at many places have become toxic as employers have leverage now. What needed 3 people is now done by 1 person and there's constant fears of layoffs on top. And you need to work harder than most other fields to even break in.\n\nCS pretty much is the new psychology degree in the making.",
            "This looks like the start of a lost generation for grads & interns for FAANG companies.  The golden age of stability, hiring and bragging rights are over.",
            "Turned down other companies for Tesla I’m cooked",
            "Well they have to pay for Elon's 56 billion comp package somehow.",
            "Don’t worry guys the high iq, South African apartheid, pedo name calling, real life tony stark, just needs 56 billion dollars and he’ll fix all this.",
            "But Reddit told me I was a doomer and that it would all get better soon!!",
            "there’s no way this is real what the actual fuck",
            "What a cheap move honestly, why are these companies even glorified?",
            "all CS grads cooked on high flame",
            "You guys have one less competitor here. I’m out. Gonna finish my EE degree. Bye ✌🏻",
            "That sucks",
            "Definitely a scary premise, but the two people confirmed to have rescinded offers are both non-cs majors. Not saying we’re safe, but just an important note.",
            "Tesla is running out of money, and they’re running out of money fast.",
            "Would not join Tesla unless I truly had no other choice. Brutal but hopefully a valuable lesson learned for those impacted.",
            "💀💀💀",
            "Nobody need more engineers",
            "Jesus I’m 25 and just finished my first semester. Nothing I read in this subreddit is promising",
            "So on brand for this dude.",
            "Tesla is a shit company and Elon is going to run it into the ground with his insane greed and ego. You're better off working for someone else",
            "CS is gender studies now. Crazy",
            "This is a trend now. I bet in a few years companies will completely stop taking interns."
        ]
    },
    {
        "post_id": "14b8k53",
        "author": "Altruistic_Oil_1193",
        "title": "I got an offer!!!!!! It's pretty low though.",
        "url": "https://www.reddit.com/r/csMajors/comments/14b8k53/i_got_an_offer_its_pretty_low_though/",
        "score": 587,
        "num_comments": 192,
        "created_utc": 1686951043.0,
        "selftext": "I got an offer for 60k with full benefits and it's fully remote. I'm on the east coast, it's better than nothing but I'm just wondering what you guys think? I know I shouldn't be too worried about starting salary since the hardest part is just getting your foot in the door somewhere.",
        "permalink": "/r/csMajors/comments/14b8k53/i_got_an_offer_its_pretty_low_though/",
        "comments": [
            "Take it",
            "Without a question you take it and build experience while continuing to look. Not doing so is a massive mistake.\n\nLiterally any experience and showing somebody else hired you is better than absolutely none.\n\n60k is not great but it’s also good enough in most places to hold you over until you get something better.",
            "Full remote is nice, nothing wrong with continuing to job search after accepting your first offer",
            "If you use remote to live with parents you’ll save around 20k/yr on just housing (rent is high in most places with good tech jobs). When you consider that it isn’t bad at all! You’re making what the average American FAMILY makes as a new grad, people literally raise kids on that salary you’ll be fine :)",
            "Congrats!!!!!! 🎉\n\n\nDo you know what tech you’ll be working with? Do you have to wake up earlier to work with your team?",
            "You can work remote and keep searching and jump ship asap",
            "Take it. Make money and keep interviewing and learning while you get paid for it.",
            "Live with your parents frugally if you can for a couple years, save $ like a mad man. You will have hella cash for down payment on a house when you get your next job.",
            "60k benefits and full remote is pretty good",
            "60k remote is average in the US, not low. Low would be like 50k.",
            "Better than nothing man",
            "I started at 55k, 4 years later at the same company I'm at 96k. Take it and see how it goes and if the company will reward you for working hard.",
            "Don't take it, give it to me instead.\n\nCongrats man (/woman?). Fully remote for the win.",
            "Accept it, and keep interviewing. Feel zero remorse about reneging on such a lowball offer, as soon as you find something better. That's a salary CS grads were getting 20 years ago. Remote doesn't change that, at all. You could've made $60k in the pits of 2009 in the fucking rust belt with a CS degree. The tech oligarchs are illegally colluding to do a capital strike. They're cheating. Cheat them back. But also, you need the line on the resume, so there are worse Plan Bs to have...",
            "Congrats I’m from MD too",
            "I was making mid-40s when I got  my first \"real\" programming job.  I was making high 80s a year and a half later.  Take it and don't look back, friend.",
            "Do you want low or do you want nil",
            "That's awesome!!! You bring me hope :)",
            "Lol it took me 6 years to hit 60K after starting at 36K in 2013. And you're fully remote, you can live where houses are only 200K and there is nature nearby. Take the offer.",
            "Take what you can get! What if you reject this for being too low but then can’t get in anywhere else? Also full remote is pretty nice",
            "60k for an entry level job offer is too low? Wow everyone really thinks they should be getting FAANG salaries with no experience",
            "First job out of undergrad? Can live where ever?\nIf it's (yes, yes) then yes haha good job man.\nEven a (no, no)  it could still be worth it for you idk",
            "General advice generally speaking for a newbie grad looking for their first job:\n\nTake it.\n\nAdvice in this current job market:\n\n***TAAAKE IT!!!!11***\n\n(but don't stop keeping your job skills sharp)",
            "[deleted]",
            "Take it and just move to a diff company six months or a year from now",
            "I know someone who recently took a similar offer, did well, and got a 50% raise within 6 months. Knock it out of the park and that could be you too.",
            "Take it and build your resume up. Started at 65k two and a half years ago and now at 90k. Also in Maryland.",
            "As an unpaid intern, I say it’s better than nothing. Take it!",
            "Having a job while looking for better opportunities is better than no job while looking for an opportunity.\n\nI would take it.",
            "Take it. 60k is a pretty okay income, all things considered. Your remote and it has benefits. It's assumingly full time. You sound excited about it.\n\nCould you get another 5-10k as a Jr? Sure, probably. But that won't be super apparent. Random take home pay calculator suggested 3.5k a month for 60k, 3.7k for 65k and 4k for 70k. You're going to move on from this job shortly, it's a Jr job. Do you wanna keep searching for months of zero pay for that extra $500 a month? How long will it take for that $500 to make up for months of missed income. Take the job and grab a large raise in 6-24 months. This isn't some $8 an hour offer.",
            "Take it.\n\nEven having 3 months of swe job on your resume puts you ahead of a LOT of people in the resume scanning algorithms.",
            "Actually I think that's a decent offer. 60k starting is a little low, but 60k starting REMOTE, is good.  I've done in person and hybrid and a full remote job is definitely worth a little bit of a paycut imo",
            "Congratulations!! 👏👏",
            "$60K is already better than 70% people in this subs.",
            "This is supposed to be low?\n\nhttps://preview.redd.it/zh0dhwcdqh6b1.jpeg?width=224&format=pjpg&auto=webp&s=500bd8e801c8446f00160f8016dfa7181a03e1c5",
            "I started off at 65, then switched companies after 2 years to 95/105.\n\nTake it. Get your experience in.",
            "Your next company will never know how much you were paid. As far as they know you had a standard 6 fig junior offer.",
            "That’s nice! Your taxes are low as well so you’ll be netting monthly the same amount as people in the Bay Area making 6 figures after taxes",
            "Take it, once you get that first job and have experience the next one will be a lot easier",
            "60k & fully remote is a good start. I'm job hunting, and I would settle for an entry level with that. You can job hop around in the future for pay increases after getting enough experience. Congrats.",
            "I wouldn’t be worried. You finally landed a job and that’s all that matters. Just keep doing some grinding and resume polishing and you’ll be fine.",
            "Move to somewhere that doesn't suck and all of a sudden 60k is a lot more money",
            "If by East coast you mean eastern shore, take it and don't look back.",
            "Sign that shit fast and don't let yourself feel bad about posts where people have higher salaries (comparison is the thief of happiness.) It's a massive f!@3ing win to have a job in this market. It took me 6 months+ to get an offer, and before covid (in my field, with my background, 10 yrs exp) I could easily get multiple offers in less than 2 months. Now I estimate it would take around 6 - 12 months for me to get solid offers.\n\nI'm also noticing a trend that companies are going from two-round or even one-round interviews to >= three. I know its common-place to have many rounds at STEM companies but small startups man... normally they would have fewer informal interviews and things would be solid. I'm guessing there's just many candidates and they want to select the best. Good for companies but horrible if you're a candidate obviously.\n\nGood luck with the new role. You've done very well!",
            "It can be worse. $60,000 is not that bad, and you're just getting started. Have some experience from home, and then keep applying to other jobs if they don't raise your compensation. \n\nYou got an entire career ahead of you. You'll be fine.",
            "I currently have a 60k CS job and am working here for at least 4 years or until senior level. There's a lot of room for improvement here as well so I can learn and get resume experience. I don't care about salary cuz I know it will get me higher one day.",
            "60k > 0k",
            "Congrats. Take it. Do you best! :)",
            "take it. earn experience. learn. grow. move on in a few years and continue until you are comfortable. my first job was around 74k in texas. now i’m making 140k 7 years in. it wasn’t easy but if you believe in yourself, you can make it. don’t let anyone tell you otherwise. i’ve had others tell me i shouldn’t be a programmer. you know what i did? i said f you, left that job, and worked hard to prove them wrong",
            "That isn't low, lol.",
            "Do you have a degree in cs and how much experience do you have? I personally would just take it to build more experience and make money at the same time. Sure beats help desk.",
            "Seriously, don’t listen to these morons saying it’s too low, take the damn offer, times are tough.",
            "If I got a 60k remote offer I wouldn't even have to think about it",
            "Take it and continue looking. When you leave they will know why.",
            "My company hires most software engineers at $60k with full benefits. But on prem. Sounds about right",
            "You think 60k is low? I make 5k",
            "Reject the offer. That's a very low TC.",
            "Congratulations 🎊",
            "Congrats bud",
            "My cousin is going to Maryland University for CS major, do you think it is worth it? The cost is like 80k/year too.",
            "take, and take one more and do both",
            "Use it to find another offer. First is the hardest one. Don't sign for 60k tho.",
            "Congrats! OP",
            "Take it",
            "Take it man. The way the industry is, you gotta take what you get. What company is it just curious?",
            "In this economy? Take it. It’s fully remote. You can always look for something else\n\nAlso congratulations on the job.",
            "Congrats!!!!",
            "You said it already! Congrats!!!",
            "Did you do a boot camp or get a degree?",
            "You can be promoted as you go and make even more. Or just switch job once you gain solid skills. 60k is not a lot but it is far better than grinding Leetcode while being unemployed.",
            "Congrats!",
            "Do you live at home?",
            "My first software engineering job out of college paid $60k. Start somewhere, work your way up, get that experience under your belt!",
            "Fully remote with full benefits is great.",
            "Congrats! Take it especially great since it’s remote and you start getting the experience. From what I’ve been hearing from friends, it’s been really difficult to find internships for college students.",
            "Congratulations man! It's a remote job. That in itself is a huge perk. You can keep looking for other potential better jobs but no need to decline an offer. Better take the 60k than taking nothing.",
            "Adjusted for inflation, that's about what I made in 2007 (42k) when just graduating. Get started, gain experience and maybe some industry certs, you should find more coming your way shortly.",
            "Experience worth more long term",
            "Congratulations! Take the job!",
            "Is there unlimited overtime?",
            "60k woth Eastern Shore MD COL > 80k Southern MD COL",
            "Congrats! My first job was also fully remote and 60k. As long as you can pay the bills and meet your financial goals, go for it! Having that first job behind you is so valuable. Also make friends with the senior engineers who like to chat. That mentorship will be extremely valuable.",
            "Not sure what the cost of living difference but I got a similar offer as a bootcamp graduate (currently going back for a CS degree now) in the Midwest but it’s not remote.",
            "Take it man, if you hate it then lets reconvene and we can figure out a plan from there, but that ain't bad.",
            "I started around there about five years ago and now make close to double. Many new engineers washout tbh so many companies start low and go up, asking about their raise structure would be good along with promotion opportunities in that same job ie swe 1 & 2 & senior etc",
            "Tell them that you really like the company, blah, blah, blah, but the salary is just a little bit low. You have some other things in the pipeline (whether or not that's true) and you'd like to see how those play out. Tell them that if the money were comparable you'd go with them but that the other will likely be significantly more. They'll come back with a higher number and you should accept (unless you really have another offer by that point).",
            "I started 2 years ago at 53k (NY state). Another place had offered me 48k. I turned it down, but honestly, had the 53k job looked shitty I would have hapily taken 48k (thankfully, it didn't). Just kick ass and know your worth, and don't be afraid to ask for big raises at year end reviews. Less than 2 years later, I now make 72k, plus they're gonna pay for my masters.",
            "That's awesome! Congratulations! You should definitely take it! Question, was the interview process lengthy and hard or was it easier?",
            "Congratulations! Take it. It's pretty hard to get a job now and the fact that you landed one is a  big thing! You can always job search later for a better offer while at your current job.",
            "It depends on your situation. Is this the first job you applied to? Then probably you could shop around for a better offer. Did you apply to 300 places before getting an offer? Then take it.\n\nMy cutoff would be if you’ve interviewed with 5 or more places (not counting resume rejections) and got rejected from them before this offer, then it would be fine to take. And depending on your standards, you can change that number.",
            "If this is your first job and you can stay at home full time? Not bad. Nothing stopping you from taking it and having a better baseline for new jobs.",
            "what was the interview/assessments like?",
            "Congratulations! You should really take that offer.  You can always look for new opportunities, but secure one first! Happy for you",
            "Two years and jump ship",
            "I take it and build 2 years experience and switch to new job. I’m sure you will get 150-210k in 3 year",
            "Take then look elsewhere. 60K is better than nothing for now but you can be shopping around",
            "Resume padding with a paycheck, not too bad of one either honestly.",
            "When i graduated (2008) was a shitty recession. Applied to hundreds of jobs no luck. Was working for my cousin as a painter for $24/hr when i finally got an offer. Was 16/hr. Two years later i bounced to another place for 50k more per year. \n\nYour first job isn’t forever, but it is a stepping stone. I’d take 60k fully remote after grad and sharpen my experiences.",
            "First job. This can help propel your career. General advice is to stay there for 1-2 years and move to a higher paying job with experience under your belt. \n\nIf you do think this is low, check the market rates and softly negotiate.",
            "I started at $50k as an intern and was just happy to have a job. If you keep improving you'll be making plenty very soon.",
            "What company is it?",
            "60k in Maryland is a good salary. A out of college student shouldn't be making over 100k out of the bat",
            "Figure out what you can accept. When I started, because of where we were located overseas, my options were limited on what I could do and got offered. I actually took a part-time job to get in the door, 9 months later moved to a cyber job making 35k(the company was crap, but I really wanted to move into cyber and our finance allowed me to take a cut), but less than a after that a new company took over and i was making 62k, and a year after that 86k, 8 months after that 96k, then during pay and performance I got bumped up to 99k with an end of the year bonus based on performance.   \nI say all of this to say that IF you can afford 60k because you no longer drive, so wear and tear on your vehicle isn't happening and cost of gas and time saved adds up to acceptable. I would take it. It gets your foot in the door. Just my 2 cents.",
            "Congratulations! Be Happy ! Be proud about yourself. \n\nYou will have some experience and may double that starting salary in 1-2 years.",
            "Always take the best offer.",
            "Don't worry about it. Take it, work hard and strive to do amazing on the job. Within two years you'll either get promoted or move to a different company that will pay you more. Rise and repeat and before you know it you'll be making more than 200k.",
            "100% take it. I got my first SWE job 4 years ago making $63,000. I too felt bad about it at the time but I got great experience and am now earning ~$145k because of it. \n\nAnd when you’re ready for your second job, your application response rate will be astronomically higher than it is now.",
            "How many years work experience do you have?",
            "“Thanks for the offer I’m really excited but can we explore a slightly higher starting salary of 67k?”",
            "Definitely doesn’t stop you from continuing to look elsewhere, congratulations!\n\nIf you don’t mind me asking, what is the type of role, front-end, back-end, etc?"
        ]
    },
    {
        "post_id": "tnacil",
        "author": "Stunning-Tower-9175",
        "title": "I used to complain about Leetcode and how dumb it is, but then I realized I wanted my goal badly enough that I’d do anything",
        "url": "https://www.reddit.com/r/csMajors/comments/tnacil/i_used_to_complain_about_leetcode_and_how_dumb_it/",
        "score": 589,
        "num_comments": 107,
        "created_utc": 1648170079.0,
        "selftext": "This is a quote that reminds me why I do what i do, as I spend 20 hours this week practicing leetcode on top of 40 hours of full time work. \n\n\"Brick walls are there for a reason. The brick walls are not there to keep us out. The brick walls are there to show how badly we want something. Because the brick walls are there to stop the people who don’t want something badly enough. They are there to keep out the other people.\"\n     -\tRandy Pausch\n\n**No shade** to people who don’t want to do leetcode or work for FAANG. But I used to make up excuses to myself about why I wasn’t doing leetcode or grinding for interviews and the truth in my case was I just didn’t want it badly enough. But now I do. Hope this quote helps someone.",
        "permalink": "/r/csMajors/comments/tnacil/i_used_to_complain_about_leetcode_and_how_dumb_it/",
        "comments": [
            "Out of all majors/industries, CS is the easiest to get 6 figure compensation and that's because most will never reach 6 figures in their entire careers.",
            "You gotta beat the system to change the system. And honestly, LCs are not that deep.",
            "coming from other industry this grind is not bad especially if you consider 6 figure compensation at entry level",
            "Tangentially related, I watched Randy Pausch's lecture back when I was starting high school and it is part of the reason I got exposed to computer science.",
            "Hell yeah brother.  I'm going to stay consistent this time !  I haven't even finished one section of the grokking course :/",
            "Without a doubt it is definitely worth it, but that doesn’t really change the fact it is simply a way to gatekeep positions. There was already a study that showed it’s useless at predicting job performance, so why even use it? You mines well ask candidates to juggle a few balls if your sole intention is to cut down on applicants. It is the standardized testing of the corporate SWE world. \n\nInterviews should focus on the kind of work you’ll actually be doing, but that’d require companies to put thought behind their technical tests.",
            "Small price to pay to double your salary from a non-FANG. Literally impossible for someone like me to be making 450k at 3 YoE without leetcode. My first job was 60k TC so trust me I know broke.\n\n4 year degree = no complaints but 6-12 months of leetcode is suddenly too much? Some people even have masters. In other professions getting a CPA nets you a 20k salary bump in exchange for your evenings for a couple years. Law school is 3 years and 200k debt to make 120k as an associate JD. Leetcode is a 15$ a month subscription!\n\nSo there really is no reason to complain about leetcode, it’s all cope. Yes it could be better, but so can the school system, the hiring process across the board. They are all optimized for convenience of evaluation rather than thoughtful engagement. Either put the work in or accept your salary cut in favor of convenience but don’t bitch about it.",
            "Same here. I have a post-it on my monitor that i wrote “$400K starting :)” on just to motivate myself. The odds of that happening are low but either way if i grind hard enough it should be somewhere around there.",
            "As someone who has started doing leetcode what's your approach to a question like?",
            "I’ve always just went about it that 2 months before I start applying for stuff I start doing leetcode. 1 hour a day and 2 hours in Sundays. By the time I actually have interviews I’ve done 60-70+ hours of leetcode. It’s not that hard you just have to plan ahead.\n\nA lot of people in this sub also seem to act that if you don’t have 1000 hours of leetcode you won’t pass an interview. I think a lot of people in CS overwork themselves and see diminishing returns with the extra work they put in. It’s not that deep just put in a decent effort, plan ahead, and you’ll find it’s not so bad as you thought it was.",
            "Complain about leetcode? You should be thanking leetcode for existing otherwise we’d no fucking clue what these interviews would ask.",
            "I used to complain about Capitalism and how dumb it is, but then I realized I wanted my goal badly enough that I’d do anything",
            "Good for you but quantity != quality.",
            "What does FAANG mean?\nSeems I been out of touch from technology",
            "[removed]",
            "I’m still gonna complain about it even if it lands me a good job.",
            "I just don't get why people despise LC.  Do you not like trying to come up with solutions to tricky problems?  Maybe I'm just a nerd and there are regular people that program too :D.\n\nEDIT: Well it's good we established that people who don't like LC, are just people who don't have the time.   That's assuming it is true, that to get a job as someone who isn't a junior, it actually significantly requires LC aspects.",
            "This sounds like some mental excuse to push you through the abuse cs is lol",
            "FAANG is cringe",
            "Once you’ve grokked the 12 patterns, LeetCode is just a proxy IQ test. \n\nI have never seen someone from a top school complain about LC in my life. For them, it’s a simple exercise in pattern matching to content they learned in lecture. The same lectures that are available to anyone on the internet.\n\nNobody wants to admit they’re low IQ, but it’s the truth.",
            "No offence mate, but don’t jump on the train of “I’m special because I feel inclined towards FAANG, which it’s not for everyone”. Literally every single junior developer and CS student in the world wants to work at FAANG (except for the few that found their own start-up or have a specific Unicorn in mind)."
        ]
    },
    {
        "post_id": "1bq6cql",
        "author": "shiiiinn",
        "title": "guys will I be ok? should I be worried",
        "url": "https://i.redd.it/bhw4bw0915rc1.jpeg",
        "score": 585,
        "num_comments": 43,
        "created_utc": 1711659089.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bq6cql/guys_will_i_be_ok_should_i_be_worried/",
        "comments": [
            "Usually implies a problem with the process rather than the individual; unless this is like the 6th time you’ve done something like this.",
            "This is how the fafsa website is right now",
            "\"Human error is never the cause.\" Ask what is responsible, never who. Make it safe for people to share their stories, so we can understand why their decisions made sense at the time.\n\nFrom my company production incidents guidebook, I never encountered this question in my career though.",
            "Time to seek exit opportunities…",
            "How did you get dev onto prod? where the fuck is your devops?",
            "I doubt he’s a senior if he has to ask 👀😂",
            "If you’re being serious here. You should be fine and if you aren’t it wasn’t a great place to work. I think most, especially large, software companies do blameless postmortems. There is a problem with the system if you can promote dev to prod accidentally and no one knows it happened till users are effected. A good team will know this and look into system, tool, and process improvements to prevent it from happening again.",
            "How to stay out of trouble as a dev: \n\nuse begin and commit tran in sql if you’re second guessing at all. Even learning the edit rows function in sql prevents a lot of screw ups. \n\nUnderstand the source control/ deployment process being used. \n\nAlways work on a separate branch if you can because someone else will screw your code up 😂 \n\nGet the green light from all devs to push to prod of possible. This makes it seem like you’re just doing no good teamwork while in all reality you’re double checking the mouth breathing senior above you. \n\nIdeally you should be able to know how to swap slots if prod gets screwed up. That is if they even have one 😂 \n\nLastly make sure you get the screenshot of that questionable order from the chat. \n\n\nJust a few things that have kept my track record near perfect over the years. 🤷‍♂️",
            "Don’t worry , your on track for a promotion to customer",
            "If something doesn't work after you push it just smile and say \"it works on my machine\"",
            "Never worked for a company/team where it was even possible to self push code into prod",
            "No one in this kind of trouble has time to create a meme I guess. I don't think this is a serious post.",
            "That's why master branch is protected and requires merge approval and has a scheduled release at midnight.. unless your leads are noobs",
            "Ahhh I remember when I missed something that caused prod to crash and essentially was roasted by all of the company heads and lost any credibility I had. It’s been 2 years and still remembered for it but I’m sure eventually the credibility will come back!",
            "Shouldn't there be some sort of measure in place? Branch protection?",
            "Who configured git and CICD to allow that kind of accident to happen?",
            "If millions of users lost access to their funds, then you work in the financial industry which is heavily regulated.  One of the things that the auditors look for is proof that there are safeguards in place to prevent any single person from pushing changes to production without going through the review and approval process.  Where were those safeguards?",
            "Everyone gets one free pass… i had a coworker take down one flow in a certain region for 15 mins? We burned over 20 mil. He’s been in the industry for 20+ years. He still has a job.",
            "human error is the most common cause of system failure\n\nso look for who else you can blame assp\n\n😆",
            "Means you need code review, an approval process and a deployment team with a separation of concerns.",
            "When the junior dev asked \"why is our CI/CD so busted to allow this to happen\" and the senior has no answer because the senior shouldn't be a senior.",
            "It’s never individual, it’s a process. Process needs to be fixed, individual needs to learn from the mistake",
            "Yes be worried",
            "Blameless post mortems my man. If anyone is at fault it’s the senior architects who didn’t properly safeguard the process.",
            "LOL"
        ]
    },
    {
        "post_id": "qpxawx",
        "author": "2345plates",
        "title": "Review of 2022 New Grad Recruiting Process",
        "url": "https://www.reddit.com/r/csMajors/comments/qpxawx/review_of_2022_new_grad_recruiting_process/",
        "score": 589,
        "num_comments": 79,
        "created_utc": 1636437913.0,
        "selftext": "Hi guys, just wrapped up the 2022 New Grad recruiting process and thought I would share my experience with you all. I learned a lot from this sub throughout the past few years, so I wanted to give back a little.\n\n### Stats\n\nLet me start by sharing my stats to ground the discussion:\n\nUniversity: UC Berkeley (Senior)\n\nGPA: 3.92/4.00\n\nPast Experience:\n\n* Sophomore year: Household name non-tech company (think big bank, retail store, etc.) \n* Junior year: Local Series-B no-name startup\n\nAlongside the above information, I had a year of TAing at Berkeley (1 semester for our DS class and another for the Discrete Math + Prob class) and a year of research. \n\n### Application Numbers\n\nHere is how the 2022 job search panned out: \n\n* Applied: 121\n* OA received: 42\n* Phone screens: 19\n* Onsites: 8\n* Offers: 7 (5 new from onsites, 2 conversions from internships)\n* Withdrew: 17 (stopped moving forward through the recruiting process because I already had offers which I knew I would take over the company I was withdrawing from)\n\n### New Offers\n\n**Google (Accepted)**\n\nCompensation: \n\n* Base: $131k\n* RSU: $170k (negotiated up from $125k using FB, L3 standard is $100k) (33/33/22/12)\n* Bonus: $30k (negotiated up from $25k using FB, L3 standard is $15k)\n* Relocation: $8.4k\n* TC Year 1: $217k\n* 4 Years Total: $724k\n\n\nRecruiting Process:\n\n* Initial Application: End of August (with referral)\n* OA: Received the OA end of Sep\n * Got 1 question completely correct (they have hidden tests but I felt pretty confident in it)\n * Couldn't figure out how to solve the other question so gave brute force solution\n* Onsite: Had onsite scheduled for mid Oct\n * Had 5 interviews (1x30min behavioral and 4x45min technical) in one day\n * 2 of the technicals had 2 questions each (with followups) (all mediums), got optimal for all\n * The remaining two had 1 question each (with followup), got optimal for one (medium difficulty)\n * For the other, it was really hard in my mind since it tested combinatorial logic. Needed a *lot* of help from the interviewer to get the 'trick', after that the actual code was trivial since it was just a math problem.\n * Except for that outlier, a lot of graph/tree based questions\n* Offer: \n * After the onsite, was moved on to the hiring team 1 day later (asked them to hurry since had FB deadline pending)\n * One week later, was asked to fill form for product matching\n * One week later, received the offer, took a few days to negotiate using FB\n\n**Facebook**\n\nCompensation: \n\n* Base: $124k\n* RSU: $150k (25/25/25/25)\n* Bonus: $75k\n* Relocation: $8k\n* TC Year 1: $237k\n* 4 Years Total: $721k\n\n\nRecruiting Process:\n\n* Initial Application: Mid August (with referral)\n* Phone Screen: Had phone screen early Sep \n * Got 2 med questions (with follow ups) within 45 min, got all optimal\n* Onsite: Had onsite scheduled next week (mid Sep)\n * Had 5 interviews (1x45min behavioral and 4x45min technical) split in 2 days (typical for FB is 3 technicals, mine was 1 extra)\n * All technicals had 2 questions (with follow ups), got all optimal except for one question (needed some hints from interviewer)\n * Lots of array questions and graph/tree questions\n* Offer: \n * After the onsite, received an offer one week later (end of Sep)\n * According to recruiter, FB stopped negotiating this year (before they would at least negotiate sign-on bonus) and no matter how hard I tried, they did not budge. It could just be a negotiation tactic but even after presenting my Google offer, they still did not move (or maybe I'm just shit at negotiations lol)\n\n**Amazon**\n\nCompensation:\n\n* Base: $120k\n* RSU: $88k (5/15/40/40) \n* Bonus: $47.5k (year 1) / $23k (year 2)\n* Relocation: $7k\n* TC Year 1: $172k\n* 4 Years Total: $639k\n\n\nRecruiting Process:\n\n* Initial Application: End of August (with referral)\n* OA 1: Start of Sep (one week after applying)\n * Got all test cases for the first question, timed out on the last 2 tests for the second question so overall was something like 10/12 or 11/13 (forgot exact num of tests)\n* OA 2: 2 days after OA 1\n * Focused on LPs and answered best as I could according to which option was closest to the relevant LP\n* Onsite: Received a response 1 day after OA 2 for 1x30min interview\n * The onsite was really chill, spent first 5-10min talking about possible optimizations on OA1 solution and the remaining time just discussing Amazon culture + growth opportunities, etc.\n* Offer: \n * Received official offer 1 week after onsite, was told that they do not negotiate and didn't bother trying to so no clue if it's a negotiation tactic or not\n\nFor the remaining offers, I'll just briefly go over them since this has already gone too long and I've covered the ones most people will probably have questions about. \n\n**The Voleon Group**\n\nCompensation:\n\n* Base: $150k\n* Bonus: $80k\n* TC Year 1: $230k\n* 4 Years Total: $680k\n\nRecruiting Process:\n\n* Applied early Aug (no referral), received phone screen invite end of Aug, received onsite invite early Sep, received offer end of Sep\n\n**Series D AI Start Up**\n\nCompensation:\n\n* Base: $140k\n* RSU: $150k (25/25/25/25)\n* Bonus: $25k\n* TC Year 1: $203k\n* 4 Years Total: $735k\n\nRecruiting Process:\n\n* Applied mid Oct, received OA 3 days later, phone screen invite a week after, the onsite invite 2 days later and offer a week after that\n\n### Leetcode\n\nIn terms of Leetcode prep, here is my distribution of questions practiced: \n\n* Easy: 50\n* Medium: 104\n* Hard: 11\n* Unique Total Questions: 165\n* Overall Total Questions: 231 (since did some common questions multiple times)\n\nIn terms of practice, I started with the Blind 75, did some of the most frequent ones from the Top 100 list by LC itself, and then the remaining ones were when I grinded for specific companies using their tagged questions (using LC Premium).\n\nWith regards to the interview process, I specifically grinded for Google and FB only. For FB, LC was king: I had 2 questions in my phone screen and 2x4 questions for my onsite for a total of 10 questions (and each had a follow up verbal question). Out of these 10, 9 of them were *directly* from the most frequent FB questions on LC (somewhere in the ~ top 30-40). Hence, grinding these questions out before the interviews was immensely helpful. \n\nIn comparison, for Google, the tagged list was absolutely useless. None of them were related to the most frequently listed ones, and not a single question I was asked in any of my Google interviews (OA or onsite) was something I had seen before (either in Blind, top 100, or anywhere else).\n\n### Lessons Learned\n\nNow that I've described everything, here are some lessons I learned during this interview process:\n\n* I know some people say that referrals don't really matter, but in my personal experience, referrals were extremely helpful. I only asked for referrals from 6 companies from my friends and ended up getting to at least the phone screen stage for all 6 of them. \n* In terms of LC, here's something I learned throughout the past few months: the process is *insanely* daunting in the beginning. Throughout college, every year I would tell myself that I need to grind LC to get the good internships, but every time I would start, I would struggle so hard with just the 'easy' questions and it felt absolutely soul-crashing + demoralizing. This continued until last summer where a switch just flipped in my head and I realized I needed to do something or I would graduate without a good job and so I just started with Blind 75. I didn't think what was 'optimal' or if there was a 'better' resource etc because according to my past experience, I would research and find all these amazing LC resources but never really stick to doing the actual questions, making them moot. This time, I did a single question every day, no matter what else I had to do, no matter how busy I was (if I was really busy, I just did a quick easy question I had already done before in 15-20 min). I did it first thing in the morning right after breakfast so that I could get it done early on and stop worrying about it. After a month or two, I slowly internalized the patterns and it was insane how I started figuring out what I needed to do for specific types of questions. Hence, for anyone struggling with LC, my advice is to give something similar to what I did above a try and see if that might help :)\n* Sites like AngelList and TripleByte are really helpful if you're applying for smaller scale start ups. Considering how fast the process to apply is on these sites (sometimes literally one click), I found out that I received a surprisingly high percentage of responses. They allow you to set your preferences (such as really early stage - 5-10 people - startups or established ones etc) so you can tailor it to what you're looking for. In the end, quite a few of them reached out to me through Email/LinkedIn etc to schedule phone screens and onsites.\n* See if your university has a policy regarding offer deadlines: Berkeley CS has a policy of recommending companies to allow up to Nov 1st for offer deadlines. I found out that if a company gives an offer deadline earlier than that, you can let them know about the policy and they will typically respect it. I was able to use it to get an extension for Amazon and my friends used it to get extensions for some other firms as well (be aware though that some companies straight up don't give a fuck though e.g. Microsoft told my friend to confirm their decision by mid Sep or fuck off)\n* In terms of negotiations, I would highly recommend reading some of the popular posts out there ([this](https://haseebq.com/my-ten-rules-for-negotiating-a-job-offer/) one is quite commonly cited) since I was not aware of a lot of the subtle things recruiters due to swing the conversation in their favor. While both FB and Amazon stone-walled me with their no-negotiation policy, the lessons learned reading these posts were quite helpful when negotiating my Google offer (although I assume having a competing FB offer to match played the largest role)\n* One thing I realized throughout the interview process was that your interviewer makes a world of difference. A good interviewer can literally be the deciding factor between acing an interview and completely bombing it. There were some interviews where the interviewer was so articulate, so clear in their explanation, and knew exactly the right amount of nudges to give when I got stuck that interviewing with them was a breeze. On the other hand, I also had interviews where I could clearly see that the interviewer had difficulty even understanding what I was trying to tell them, seemed completely disinterested, was extremely dogmatic by focusing on one single solution and constantly fishing for it, rejecting everything else. The worst were interviewers who were completely unresponsive, where I would try to engage with them and discuss my thought processes and feel as if I was talking to a brick wall: they would either stay silent the entire time or give one syllable answers. These interviews were really hard to get through - even when I knew the correct answer, I would second guess myself, I would be unclear about the requirements of the questions/the constraints imposed, I would be unsure of what they wanted me to return, all because we simply weren't on the same wavelength in terms of communication. \n\n### Mentality\n\nMentality is everything: one thing I realized throughout this recruiting process was that the way you mentally approach it is immensely influential. I'll share my personal experience in the hope that it might help some of you out. In my group of friends, I'm the 'dumb' one. I've never been bothered by embracing that label since I realized all the way back in high school that there is always someone smarter/better. However, it is a fact that all of my friends are much more accomplished career-wise: I remember sitting with three of my friends in our dorms in freshman year at the end of the Fall semester and each of them had an upcoming internship next semester at Facebook, Google, and Amazon respectively (literally, I'm not making it up, straight up those 3 lol). In one way this is good because it encourages you to be better yourself and enables you to struggle more to overcome your past self. However, if any of you are in this position, I would urge you caution since - at least in my case - it ended up being a hindrance as it made me believe that you needed to be an absolutely insane person to get offers from these popular companies. Hell, maybe that even is true, but the result of that mentality was that I *had already given up before I had started*. Throughout sophomore year and junior year, I didn't bother applying to these places when there applications came out since I thought there was no point and only applied really late (think March/April) since then I could delude myself into the argument that I only got rejected because I had applied so late. If any of you have caught yourself doing these kind of mental gymnastics, I would highly urge you to take a deep breath, embrace that *really* uncomfortable feeling of putting yourself out there and risking rejection, and still apply. This year, I kept track of when applications got released for popular firms and applied as soon as they came out, resulting in a response rate that is night and day from my previous one (obviously, considering how late I was previously applying). Anyways, sorry for rambling, but at the end I just wanted to share my personal experience in case someone can relate to some of it and if so, can seek encouragement from it :) \n\nSince we're on the topic of mentality, another factor that I think was really important and extremely helpful during the recruiting process was exercise: I suffer quite heavily from depression and anxiety (have been clinically diagnosed since freshman year) and I remember going through my FB interview. I went in extremely anxious since it was my first time doing an onsite for a company of FBs level and it ended up being this 3hr long slug fest that drained the life out of me. By the end of it, I was shaking from the adrenaline rush and just in really weird state. I decided to go out for a run and ended up just running and running until I had vented out all the anxiety and pressure and gotten back to normal. Hence, for those of you who can relate to such experiences, I would highly advise having something similar, a kind of 'vent' that you can use to release this build up of emotions during this highly stressful time, regardless of what it is. For me it was exercise, for you it could be reading a book, playing an instrument, losing yourself in a video game, whatever, have something where you can sink into the mindlessness of the activity and calm yourself down again, it helps a lot. \n\n### Conclusion\n\nAnyways, I hope this insanely long post has helped some of you out. I don't really know if all of it will be relevant to everybody, but hopefully you will find some parts of it resonate with your own experiences, and you'll be able to take those parts and make something out of them. In the end, I personally tied off my 2022 new grad search by accepting my Google offer a few days ago. It boiled down to FB vs Google in my case and I found it to be quite a hard decision since working at either company was a dream come true for last year me. I went with Google because after all the constant struggles I've been through in college, I'm hoping to take it a bit easier after graduation and I heard Google has a slightly better work life balance. However, for those of you who are interested in working on really cool stuff and climbing through the promotions ladder fast, most people I've talked to recommend FB as the ideal place for that. \n\nAnother reason why I chose Google was because I'm an international student, and I've read on Blind that FB is having some immigration issues with some law case of theirs stuck in limbo, so for international students, I would recommend doing your due diligence and making sure to pick the company that aligns with your future plans. \n\nHope the post helped, please feel free to ask questions in the comments :)",
        "permalink": "/r/csMajors/comments/qpxawx/review_of_2022_new_grad_recruiting_process/",
        "comments": [
            "You can't imagine how helpful this is, great write up.",
            "[deleted]",
            "Dude what a fking champ, you deserve all the success man :)",
            "this was so beautifully written, I am broke otherwise would award you. would love to connect with you in real world :)",
            "I think your 4 year calculations are missing target bonuses. Ie, google L3 is 15%",
            "What I don’t understand is how are people able to solve novel medium problems with just ~100-150 LC? I’ve done over 300 and I still struggle with solving Mediums that I haven’t seen before. I feel like there’s just way too many patterns for me to remember and I get lost on where to even begin. How were you able to solve almost all of your interview questions optimally with such (relatively) little LC?",
            "You got the $75,000 GE bonus without being returning intern?",
            "Congrats, my fellow bear! I will graduate in Fall 2022. When should I start applying for new grad positions?",
            "[deleted]",
            "Thanks a ton for putting this up - I'm not graduating but your tips are really helpful. You're right about the interviewer thing - it really does make all the difference. Whenever I got offers or moved to the next round normally the interviewers would be very nice and helpful; I also remember this one time where the interviewer was literally flipping through rejection slides while I was trying to solve the problem and that was super demotivating. I wasn't sure if that was the norm until asking later to other people who went through the process but oh well, it is what it is.",
            "What are the on-site interviews really like? Like you just sit in a room and people watch you code?",
            "From what I heard from a few people I know working at fb, they said that fb has resolved its immigration issue and all processes has resumed",
            "this thread doesn’t even pertain to me, but man you are awesome for doing this for others. i love this. Congratulations to you & i wish you the best",
            "Anything with Microsoft?",
            "With your caliber of resume, why didn’t you apply/get into unicorns/hft/ib? For example, stripe would probably pay you more than google.",
            "How did you get a $47k signing bonus from Amazon? When I started a year ago it was 26k unless you were an intern, and non-negotiable.",
            "How many of the tagged fb questions did you end up doing? Top 40 of most frequent questions in past 6 months?",
            "I know that post like this are supposed to be informative and motivational. Yet, they cause the opposite effect on me :( I didn’t got high GPA at a top college, or hard internships, or TA experience, factors which probably help you a lot. Expectations are unrealistic for me at this point. Getting depressed. I have applied to over 140 jobs and only one of them converted to an offer with low compensation. I am still grateful but dang! I can only dream about being so fortunate like you are.",
            "How was your Voleon interview?",
            "Man I wanna earn that much money",
            "Why was ur starting google RSU and bonus higher than the L3 standard? ~~Also any general tips for negotiation?~~",
            "Dude, what an amazing post. Congrats!",
            "Thanks for sharing",
            "Thank you",
            "Great write up. Cheers OP, and big congrats!",
            "GOB EARS",
            "Great write up, especially on mentality.",
            "If any one here knows more about Facebook J-1 sponsorship for next summer? If they are sponsoring J-1 at all right now?",
            "This is why we stay in camajors",
            "Great writeup, and seconding the fact that Google tagged list is absolutely useless lmao",
            "what team for google?",
            "Hey OP, \n\ncongratz bro! reading the first half of your post, I thought you were just another cracked fellow bear, but your second half on the Leetcode and routine is really inspiring.\n\nQuestion, I know you are probably at Cal since Freshman year, that means you somewhat had plenty of time to get through the courses, so when you started your routine, how was your actual course load like? and I know the course load is relative to how much a person can handle, but could you describe that part as well? i mean like by the time you started leetcode and company searches, did you already begin to have light courseworks that allows you to focus more on leetcode?\n\nFYI, i'm a junior transfer EECS, and you probably know how condensed our course load is. So yeah just wanted to get your inputs on this leetcode/schoolwork balance, because so far, with 2 tech courses, (i'm not cracked), I haven't been really able to find time to do leetcode.\n\n&#x200B;\n\nThanks",
            "Congratulations! I’m currently in the same boat mentally so it’s really good to hear someone succeed! I was wondering what you would suggest for google prep? Have onsites in 3.5 weeks and not sure what to study. Also what kind of questions did they ask you in behavioral?",
            "Hey I just finished up my on-site with google, and I got asked for an updated resume and any offer deadlines I had. Were you also asked about that? And how do you do know if you moved on to the hiring team?",
            "You bloody legend, congratulations beast! I have my FB final round in a week, grinding my cheeks off right now haha",
            "How did you find out to anticipate when the applications are going to/will come out?",
            "u/2345plates \nDid you apply Microsoft? If yes, is Leetcode likely to come from in onsite esp using blind 75, company tagged prep and some extras ?",
            "Appreciate this a lot"
        ]
    },
    {
        "post_id": "180mfvq",
        "author": "SlimeWT",
        "title": "I got an offer!!!!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/180mfvq/i_got_an_offer/",
        "score": 585,
        "num_comments": 71,
        "created_utc": 1700587885.0,
        "selftext": " Security Engineer for $115k base fully remote but can work at any office \n\nHey I may be the minority here but Ive been pursuing Cyber/Infosec Engineering and I’m in!\n\nI’m graduating with my CS degree this year from a small no name visual arts school. Our cs department is literally a 4th floor sandwiched between gender studies and liberal arts. \n\nHow did I do it? Sure I worked hard and tried to make sure I had relevant experience through projects and internships but what really did it was NETWORKING. Holy shit you’d be amazed at what a few strangers can do for your career. It doesn’t matter how hard you work or how smart you are if no one knows it. SHOUT IT FROM THE ROOFTOPS - Meet professional whether it’s LinkedIn or in person and talk about what you like to do and what you’d done so far. Don’t be just another face they’ll forget in a hour, stand out. \n\nI don’t want to go on and on but trust me fam the sooner you upgrade your networking the sooner you’ll find yourself in blessed positions.",
        "permalink": "/r/csMajors/comments/180mfvq/i_got_an_offer/",
        "comments": [
            "\\>  what really did it was NETWORKING.  \n\nI've posted this many times and I'm always downvoted. Congratulations on your position and congratulations on getting out and meeting humans.",
            "Hey congratulations!!! I’m happy to see some positivity in the CS environment right now and I can happily tell you worked very hard for this :D",
            "Quick add in for those asking about Networking:\n\nI used LinkedIn primarily to network. First I found people who graduated from my university and were Security Engineers (obviously target those who are working in what you want to do) - using that commonality between us I’d say something like “hey my name is xxxx I’m attending xxxx and saw you also attended and are doing what I want to do” and lead the conversation from there. Next is network in person at internships, my first internship was a result of a LinkedIn conversation. My second was a result of people I met at the first. The third was the same and using that huge network of people I wiggled myself into this position. \n\nMake the connections meaningful learn about the person you’re talking to, perhaps even meet them in the city or something :)\n\nObviously use correct grammar and present yourself nicely. Don’t talk like you talk on Reddit 😂",
            "I love your energy. congrats!!",
            "Congratulations 🎉. Can I ask more about that in detail? I am trying but I have no idea how to start networking.",
            "Great salary, starting salary or not, a lot of people will never make that much. I think it’s important to keep some perspective on how fortunate STEM majors can be. Congratulations!",
            "Congrats!!!! — from your fellow cyber student",
            "Congrats my dude! Happy to see some good news for new grads on here.",
            "Congratulations !!!",
            "Congratulations! So happy for you. Claiming this energy ❤️🙌🏼",
            "CONGRATSS!!!!!!!",
            "Congratulations!! Networking is def important in any field, but especially in CS.",
            "[deleted]",
            "Congratulations!! Your hard work paid off!! 🙌🎉",
            "Giving me hope as a student at a community college and a unconventional degree pathway 🥲",
            "Congrats! Maybe I can get out of my shell and network too ..",
            "How do you network",
            "Ayyyyyyy congrats 😎",
            "Lit",
            "[deleted]",
            "[deleted]",
            "Congratulations!",
            "Bachelors or associates?",
            "Congrats!! I love this for u, and will definitely be taking up your advice.",
            "I agree Networking is everything. It can do miracles . \n\nBtw congrats man.",
            "Congrats!",
            "Way to go!",
            "Congrats to OP 🎉\n\nYeah networking is a huge part of US work culture that many internationals, including myself, and even students with US citizenship overlook.\n\nDon't go plaguing Grace Hopper Conference saying you identify as a female or nonbinary tho.",
            "What kind of networking did you do?",
            "[deleted]",
            "great advice and congrats homie",
            "CONGRATS",
            "u from toronto?",
            "How do they look for in security engineers?",
            "How do you strike up a conversation and begin networking on LinkedIn? I'm curious to know. I don't want to sound like a troll ora groupy lol",
            "What kind of projects did you do?? Looking to go into the same/similar field!",
            "oof, all sec positions I saw need 3+ yrs of experience"
        ]
    },
    {
        "post_id": "j88cdg",
        "author": "Kingofkingdoms33",
        "title": "I got an Internship offer!",
        "url": "https://www.reddit.com/r/csMajors/comments/j88cdg/i_got_an_internship_offer/",
        "score": 581,
        "num_comments": 43,
        "created_utc": 1602280852.0,
        "selftext": "I just got a call from a recruiter at discover and received a verbal offer!!!\n\nFinally, after 70+ applications over the course of 4 months. I have gotten an offer! I just wanted to share my excitement with everyone here and encourage people to continue applying! I had only received two interview requests from those applications/OAs(failed a lot of them), one with JPMorgan Chase and another with Discover. And Discover gave me the offer!\n\nKeep at it everyone! Not everyone has to start out at a FAANG!",
        "permalink": "/r/csMajors/comments/j88cdg/i_got_an_internship_offer/",
        "comments": [
            "Wanna clear out my current balance my g? Jk of course. Congrats! That’s definitely exciting!",
            "Congratulations!",
            "I had similiar situation. Worked in a local grocery store for 3 years and did not have the luck to get an internship after applying constantly. I started my junior year and I now have 4 offers. GE Aviation, Cisco, Kroger and JP Morgan. I’m currently working with kroger and accepted GE and Cisco. Never ever give up. In additional to that I did not apply non of these jobs. Your time will came and remember everyone has a different journey. Pray and be grateful. My package offer contains a pay thats more than what most of my friends got working for FAANG. Believe that you can and you’re halfway there.\n\nBtw Congrats!\n\nAll the best to everyone that’s looking for an opportunity.",
            "Discover is still a huge company! Congratulations! It may not be FAANG but that is still very impressive",
            "Congrats bro!!!! I definitely agree that you don’t have to start at a FAANG. It takes time to land one.",
            "Congrats! It's such a huge relief to receive an offer this early into the semester!",
            "Whats the pay if you dont mind sharing?",
            "Meanwhile I'm a senior in college, applied to 82 full-time roles, and only had 2 phone screens (one of them was with a company I interned with) and 1 OA.  If you apply to full-time, do you generally see a larger rejection rate than for internships?",
            "We all finna make it. Congrats!",
            "Congrats",
            "Congrats bro!!",
            "Congrats!!",
            "There you go! Good job!",
            "congratulations, Riverwoods?",
            "Congratulations.",
            "Congrats! That's awesome!",
            "It never has to be FAANG to be impressive. Its all upon how you take up the work and do it with your own interest (in the type of work you most likely would be interested to). \n\nCongratulations!",
            "[deleted]",
            "Good job mate! Applied for 80+ positions (CS junior) 7 reached out with a test, for three of them I completely nailed it, one was average, and others pass. Only one company reached back with another interview.\nP.S hopefully I’ll find something for the summer finally :)\nP.S.S last year I reached to googles final round interview",
            "Dude I just got an internship offer today too! Congrats!",
            "congratulations!!! I also got a verbal offer just yesterday!! nothing beats the feelings of getting accepted tbh",
            "Congratulations 🎉",
            "Mind sharing what the structure of the coding challenges for jp Morgan are??😢😢😢",
            "Congratulations!!\n\nHope my offer is on the way.....",
            "Beech we won",
            "Congrats!! I'm happy for you",
            "Same dude. I had a ton of interviews as a sophomore and failed all of them, even the ones I thought I got. Come junior year, I interviewed for JPMorgan and was so sure I messed up the behavioral interview, and I could not believe it when they have me an offer. Capital One and Mathworks soon followed. Keep it up my man!",
            "Congrats! all anyone needs is the one!"
        ]
    }
]