[
    {
        "post_id": "11oacus",
        "author": "cannotCatchABreakFfs",
        "title": "A company gave me a long take-home assignment for SWE Intern. When I submitted it, I got a reject stating the position has been filled - and my assignment wasn't even reviewed",
        "url": "https://www.reddit.com/r/csMajors/comments/11oacus/a_company_gave_me_a_long_takehome_assignment_for/",
        "score": 588,
        "num_comments": 48,
        "created_utc": 1678507913.0,
        "selftext": "I spent 6 days on this. 6 fucking days out of hectic graduate school schedule. The worst part is I was successful in building the exact product demo they were looking for - meaning if they had seen it, I'd have gotten an interview call at least.\n\nI can still see my submission's GitHub repo - the people I added as collaborators did not even accept my invite.\n\nYou could've told me the position was filled earlier - I wouldn't have spent so much time on it 😭\n\nThis intern search has drained me. This was probably the final nail in the coffin. I give up 🏳️\n\nEDIT: The company is Volley \n\nhttps://www.linkedin.com/company/volley/",
        "permalink": "/r/csMajors/comments/11oacus/a_company_gave_me_a_long_takehome_assignment_for/",
        "comments": [
            "Name and shame",
            "Add it as a project to your resume, that’s what I did with my Shopify take home assignment last year lol",
            "If a company gives a coding challenge that takes 6 days that's a huge red flag. I'd expect the company to invest the same amount of time that I'm investing, and if it's.not balanced I'd move on. \n\nAs a hiring manager I ask for a 2 hour challenge, which usually gets me 100-200 lines of code from the candidate. I spend 30 mins reviewing it and discuss it with the candidate for 90 minutes whether I hire them or not. Even if they're a no hire, they get the benefit of my advice for the time they put in, and with that advice are often hired somewhere else pretty quickly. \n\nMy clients are small startups and I'm also very busy. But only think this is fair, if I expect someone's time for free then I should be willing to give my own. If a company won't do that, move on.",
            "username checks out, sorry to hear that, in a similar boat rn\n\nUse the new project you created to showcase your skills for the next one",
            "I got rejected too but i didnt get any oa. Got emaip position is filled",
            "I hate companies that do this sort of shit. A company on AngelList once tried this for an unpaid internship and I legit emailed saying their insane and unreasonable.",
            "Welcome to the club.  This is why we all complain on here about those things, and why many of us simply refuse to do them.",
            "Company?",
            "Just chatgpt take home assessments they're a waste of time",
            "This is why some people don’t accept take homes without pay. I’ve been paid $50/hr to do takehomes. I would just refuse it if they won’t pay",
            "wait. you made a product Demo for them? Of an actual product they make?  \nNever do this.  \nEver.  \nnever work for free. programing challenges are fine. but they should have nothing to do with the companies actual product.",
            "Why would you ever spend over like 2 hours on an OA? It just doesn’t make sense. This is why take home assignments are complete bs",
            "You had six days to do a take home assignment?  Normally my assignments have a time limit of three hours once started.  The largest amount of time I've gotten was 24 hours.",
            "Take home assignments are bullshit. I reject them outright. They’re just so that the company can feel like it’s doing something rigorously. But it’s just kicking the cab down the road.",
            "Ridiculous.",
            "Dodged a bullet",
            "The same exact thing happened to me. Except I got a call on the day it was due that the position has been filled.",
            "Similar thing happened to me. Was given a month for a take home assignment but the position then closed early without warning.",
            "It's just company tricking you to work free for them, I've seen some people in this situation as well",
            "NEVER WORK FOR FREE.",
            "Generally, avoid companies that give very long take home assessments, they aren't worth it.",
            "SSWE here. This is something I hated being a junior. All the tests and assignments I had to do for a job with a basic salary.\n\nI think some well known IT companies do it even for senior positions but I’d just give them a pass.",
            "DAAAMN\n\nI'm really sorry about this.\n\nTell you what, my situation is exactly the same.\n\nVolley gave me a take home assignment and I spent 7 days of my spring break, ditched my friends who were going on a spring break trip and finally uploaded a perfect implementation of the implementation only to be rejected very soon.\n\nThey didn't accept my collaborator invite either. Fucking bloodthirsty corporates, man, it's a sick world where workers are heavily disadvantaged.\n\n&#x200B;\n\nOP, let me dm you",
            "what was the project?",
            "[sips tea]",
            "This was an expensive mistake and you learned from it."
        ]
    },
    {
        "post_id": "xzexze",
        "author": "rising_coder",
        "title": "Chick-Fil-A paying more than Lockheed Martin for SWE Internship + free chicken sandwiches 💀",
        "url": "https://www.reddit.com/r/csMajors/comments/xzexze/chickfila_paying_more_than_lockheed_martin_for/",
        "score": 585,
        "num_comments": 87,
        "created_utc": 1665298594.0,
        "selftext": "https://imgur.com/a/RBy0v2f",
        "permalink": "/r/csMajors/comments/xzexze/chickfila_paying_more_than_lockheed_martin_for/",
        "comments": [
            "Free chicken sandwiches? That's 20 pounds gained over one summer",
            "Don't discount Chick-Fil-A too hard.  Their HQ is about a 20 minute drive from Georgia Tech and they didn't become super profitable by being stupid.\n\n&#x200B;\n\nThey are also an instantly recognizable consumer brand that people will take notice of when they read your resume",
            "Also the fact that Lockheed is in the Bay Area and Chick-fil-a is in Atlanta",
            "And RBI which owns Burger King, Popeyes, and Tim Hortons is paying 138k to their new grads in their TDP Program! Damn this is unexpected!",
            "Plus guaranteed Sundays off,\n\nnot a bad deal at all.",
            "As funny as it may seem working as an engineer at chick-fil-a it seems like they actually do some pretty cool things - was in the interview loop last year and they seem to utilise ml a lot for certain things like allocating the appropriate amount of ingredients to different locations within the appropriate time period to keep things fresh.",
            "I like how Lockheed just has A health benefit. \n\n“Hows the health benefits?”\n\n“No sir, you misunderstand. It’s only the one health benefit.”\n\n“…”\n\n“Choose wisely”",
            "Bro I’d do it for the sandwiches",
            "Which site is this?",
            "Chick-Fil-A has done some fairly innovative projects. One example: a few years ago they created a store-in-a-box using Intel NUCs that were simply plug-n-play provided all the in-store apps to get any new store location up and running and connected to the centralized datacenter.",
            "What webpage is this?",
            "can you please share the application link",
            "Chick-Fil-A actually pays their SWEs well especially for Atlanta. It's also a recognizable brand that's innovating :)",
            "Yeah but then you have to work for the shit stain of a company known as Chick-fil-a",
            "The reason I couldn't intern at Chick-Fil-A is because I couldn't look a girl in the eyes and say with a straight face that I'm interning at Chick-Fil-A. That's why I'm only applying for FAANGS.",
            "If only I liked chick-fil-a sandwiches",
            "Chick fil a pays their workers well",
            "[removed]"
        ]
    },
    {
        "post_id": "1ajc648",
        "author": "not_my_main_2",
        "title": "six rounds for an internship...",
        "url": "https://i.redd.it/1gfv9l8feqgc1.png",
        "score": 583,
        "num_comments": 52,
        "created_utc": 1707123482.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ajc648/six_rounds_for_an_internship/",
        "comments": [
            "Less than 100 applications and 3 offers. Bro is really the other candidate they moved forward with",
            "what would you say you did (apart from school work obviously) that helped you get most of the interviews/offers? \n\n- a student feeling super lost😭",
            "Holy 6 rounds.   Were you applying to be CEO?",
            "Accept all 3 lol",
            "when did you start applying for 2024 summer internships?\nDo you stick to linkedin?\nHow did you/does one go about getting referrals for internships, is cold emailing/linkedin connect helpful? \nIs linkedin premium worth the price to secure an internship ? \npls answer, itll help me next year 🫠",
            "faang companies have 1 round???",
            "Jeez, I give one, maybe two interviews for interns. I have actual work to do, not spending every minute of me day interviewing.",
            "What’s your advice on OA’s? I feel like even if I do somewhat okay on them I never get an interview after",
            "Share your resume hiding the personal information",
            "OP's the main character",
            "Do you go to a T10 for CS?",
            "Can I dm you for anonymous resume?",
            "Gotta be Palantir 😭",
            "How’d you look for local offers? I’m looking to intern at some place small, not really running for big companies",
            "What visualizer is this?",
            "The cable management on this one hurts.",
            "From when you started applying and what resume template u used ? Please guide",
            "What is this app",
            "6 interviews for an internship?",
            "Can you breakdown the rounds? Were they repetitive?"
        ]
    },
    {
        "post_id": "ly1eq9",
        "author": "Limp-Economist8488",
        "title": "Rant: Getting Tired",
        "url": "https://www.reddit.com/r/csMajors/comments/ly1eq9/rant_getting_tired/",
        "score": 580,
        "num_comments": 120,
        "created_utc": 1614909911.0,
        "selftext": "Background: I'm a second year computer science major at a California state school. I also identify as female.\n\nWhere my ladies at?? I don't know about you, but I'm getting tired of constantly trying to prove myself just because I'm a female in computer science. My grade only has 15 women in computer science out of 100 people. There's like 2-3 other women in my courses, and I'm just tired of it always being this way. The guys almost never take what I have to say seriously, and if a guy answers a question that I actually said earlier, suddenly everyone else believes it. Constantly getting belittled in my abilities is only the start. \n\nThis morning, we had a breakout room and they were talking about how our professor sounds really cranky over emails. Someone in response said that it must \"be his wife that sends his emails then.\" I know that not all guys are sexist or misogynistic, but dang... it gets tiring when you're around the ones that are. \n\nOH but not to mention the \"you only got those internship offers because you're a girl.\" I somewhat agree, that probably plays a little bit of a role in companies decisions; but that doesn't mean I didn't do countless hours of LeetCode, fill out 132 applications, work hard in my courses, fail coding interviews, and keep up with sexist slums everyday.\n\nAnyways that's just a little rant, hoping things get better when I'm in industry and HR is a thing :/",
        "permalink": "/r/csMajors/comments/ly1eq9/rant_getting_tired/",
        "comments": [
            "Tbh have heard the same thing from friends on campus.I honestly don't see any fast acting solution, a longer-term one is that more women join the field so upcoming devs don't face the thing you are facing alongside us men being made aware. Although you could reach out to people and make your own group of people. That's easier said than done.\n\nI hope your upcoming classes have better minded ppl tho.",
            "Honestly I feel the same. In my first programming class (called advanced programming where we learned some data structures and algorithms) in high school, there were only 3 girls out of 30 and my teammates wouldn't completely trust me in the group projects (I think just because I was a girl). My confidence got shredded and almost didn't want to apply in CS for university and I imagined how toxic the environment would be. This was around February 2020. However, I saw many girls in my introduction to CS and intro to software systems class last semester, of course more girls than I thought and people were more supportive and nice than I thought. I also joined the women in tech/CS organizations at my university and met a bunch of other girls with similar interests. \n\nBy the way, do you know Rewriting The Code (RTC)? It's a great global organization for female students in tech!\n\nYou go girl!",
            "Sadly this is how the world is rn. Not a girl but I’m a minority, gotta love being reminded about it every time I hop into a meeting (:",
            "I feel thissss (I’m a third year CS/AI major). It’s really difficult to be happy about my internship because it’s been heavily implied by a few peers that I only got it because I was a girl. But you don’t pass technical interviews by being female. I’m also tired of being labeled “hardworking” when my male peers will be labeled “intelligent” when we have the same accomplishments, grades, etc. It’s not that hardworking is bad, it’s just hard to be seen as technically talented when you constantly have to prove yourself. But I see you, and I’m proud of you if that helps at all!",
            "It feels bad but I just avoid anyone who says things like that / associates with them. It sucks but it definitely teaches you how to spot right away if someone’s a misogynist. They’re probably the same dudes who complain on reddit that they can’t find a girlfriend lmao.\n\nIf they say anything blatantly sexist tho, don’t be afraid to report them",
            "i feel this so much. i’m a woman as well, junior in north texas, and ugh man, does it suck sometimes to be a woman in this field. i feel like i have so much to learn since i switched majors and everyone around me has been doing this for ~ 10 years. i absolutely love this field though and I’m so determined to learn everything  and more. i just wish i could pause life to catch up. \n\nwe got this this OP! i believe in us. i’ll see ya in the field in a couple years:)",
            "Absolutely feel you! In my previous college, I was typically the only girl in my cs classes so I personally felt I had to prove something to all those guys. I was too afraid of asking questions and I tried my damn hardest to look like I knew everything the Prof was talking about. Let me tell you, after I completed my first project in the class, I open up my grades and saw that I received a zero on the project. Attached to the grade was a WHOLE essay about how I shouldn't give up and that as a woman in the field it can be really difficult blah blah blah...\n\nI immediately contacted the prof and he just told me I didn't do the correct project. Low and behold after confronting him about it and asking exactly what I did wrong I come to find out that he just didn't run the correct file type.\n\nTalk to people about their expectations of you and realize that for all of your perceived \"advantages\" in the field, those people will never have to deal with all the crap you do.\n\nGo girl! Get that degree and get that amazing internship.",
            "I’m sorry you’re going through this :(\n\nFor me personally, I’m a woman and I’m in my final semester of CS at UBC. Personally I haven’t felt anything close to this - quite a few women in my classes, and I never ever find that guys treat me weirdly or differently.",
            "Totally relatable post!!! \n\n\nI've lost count to how many times I had to argue with guys over answers. They would waste my time and at the end I was right all along. But if another guy steps in, suddenly there's respect. \n\n\nVery interesting. Don't you think?",
            "Am also a woman studying CS at my university. I get talked over and constantly interrupted in breakout rooms. I have other students ignore my answers and then reach the same one.. It is quite frustrating. I’m only in the beginning of the major but it is extremely clear why more women don’t pursue STEM degrees. Hang in there.",
            "The amount of people that have implied that I only got my internship cuz I’m a girl fucking pisses me off",
            "In my intro to CS class there was this one kid who constantly mansplained Java to me even though I had 3 years of experience with it, and he would always try to \"trip me up\" and catch me getting wrong answers. Come a few semesters later, he and I got grouped up for a project and he ended up being the one asking me for help on a lot of it :) you've got this, stay the course & see if you can find organizations like WiCS, SWE etc on campus, or join national/intl orgs like Rewriting The Code.  \n\nHaving a community of women around you in solidarity really does wonders -- at my school the women in tech orgs are super tight knit, and the people in them sometimes all sign up for the same section of a CS class, not only so they have people to talk to/work with, but also to show everyone else in the room that yes, women DO belong in tech & that the room being almost half full with the most intelligent, motivated women I know is the norm and not an exception. They also have a lot of workshops and panels talking about what women experience in the major & the workforce after graduation, and men usually come to these events to educate themselves on how they can be allies",
            "Honestly... fuck those guys. I have MAD respect for women that choose to pursue a technical field, because they're actually passionate about it. I mean... with a class filled with 90%+ boys (not men, just boys), I can understand that it must be tiring AF to hear boys say the same shit over and over again. But you'll build some thick skin by the end of it.... oh and..... use that shit as fuel for the fire. That's what I do, when someone is talking shit to me.\n\nI'm also a sophomore, and I've managed to accomplish more than the people that have belittled me in the past (but I stay humble about it to their faces).\n\nI honestly wish you good luck on your journey, and I'm sure you're hell of alot better than the boys who talk shit.\n\nGood luck on you're journey, and always remember... the only person you're trying to prove anything to is yourself.\n\n:)",
            "FACTS. I’m Asian too, so it’s a double whammy. \n\n*Oh you’re Asian, so you have to be smart!* No Chad, I studied for hours, actually read the textbook, and went to online tutoring everyday",
            "I definitely feel this way in my classes too where our cs program is only 25% girls. I think one encouraging thing I’ve seen is other girls in CS supporting and encouraging each other, whether it be through WICS or other orgs. I had a girl TA once who put the only 4 girls into one discussion group so we all got really close which was super kind of our TA to do. Push through and show them that gender isn’t the reason for your success!!",
            "Show them your Leetcode pie chart and they will all fall in line.",
            "Probably this is only an American thing or something, but over here in Asia, female CS students aren't really looked down at, at least in top universities. Yes, this is still a male-dominated field in representation, but the girls over here are equally respected as the guys in CS. Many of us even felt that the girls are stronger since they are more hard-working than the guys.\n\nIf there is anything, the whole \"You get your internship because you are a girl\" still exists everywhere. It's partly true because a lot of companies want more gender diversity in their workplace, but that doesn't mean the one getting in are incompetent or undeserving. Ultimately, you shouldn't care about other people's opinion - treat it as jealousy, ignore it, and go on with your life :D",
            "the smartest people in my classes are girls",
            "I’m so sorry you feel this way. I am a STEM female student as well and there really isn’t much of us out there. I am majoring in Statistics which overlaps with a lot of CS subjects and I really wish I had my male classmates’ confidence sometimes.",
            "I'm a guy and this shit has happened to me my whole life. I find in male groups there's usually only one or two people that are listened to and everybody else are there to agree. I don't know if its the same in groups of girls but in male groups you need to make guys listen if you have a point. Yea its tiring. But hatred is a good motivating force.",
            "Totally relating to this!! I’ve also found it harder for a girl to work in a group of all guys - sometimes they just don’t really take you seriously and give you the easiest tasks even if you may know better than them. I also hate the social dynamics of being the only girl in a group cuz it sometimes feels lonely and alienating",
            "We are all rooting for you.",
            "I have the opposite experience but in a different field. I was the only male in the whole studies for four years, including the professors. I must say though, I never felt excluded or patronized. I don't get why people act the way you tell, I used to think people that are in higher education would get more aware and sensitive of the situations they're in. This being not the case makes me sick.",
            "I think diversity and inclusion has a good mission but the people it tries to include into field can make them feel alienated once they join it, because then everyone forgets the hard work but only sees \"diversity hire\" which is frustrating for the person and the people calling the person with that name.... So as long as the numbers don't ramp up in this field the minorities would be alienated and we have to accept it that we are the sufferers for something good in the future (hopefully).\n\nRanting is a good way to reduce that frustration.",
            "Usually lack of women does that to a men. Pity them and get better while they continue to be a degenerate",
            "Do you mind if I pm to ask you what college this is? If you don’t want to, that’s totally fine too. I’m also a female going into the same field, and could potentially end up at a Cali school also",
            "I'm sorry",
            "Also female in CS! I was a tomboy growing up though who always had \"boy\" interests so those things never really bothered me and to this day I'm not quite sure why. I know friends who've shied away from CS because it was so male-dominated that they didn't want to deal with potential situations like the one you mentioned. I think part of the problem is representation as well because when we think of stereotypical coder its usually a white male in a hoodie hacking away in his basement. Unfortunately, the gender gap is getting worse, not better, according to a recent study (maybe if I find the link I'll pop it in here later). \n\nBut to see real change? I'm not sure even where to start with that tbh. There are organizations like Girls Who Code that I volunteer with but a lot of the young girls I work with are either really confident in their interest or feel that it's just not for them? In terms of the later, I try my best to be encouraging and show them that anything is learnable though effort and practice, but there's this intimidation factor or discouragement they get that is hard shake through and they just quit or don't show up anymore. \n\nSorry for the wall of text! but these are just my thoughts and experiences. \n\nThanks for posting this btw",
            "i appreciate the honesty and modesty when you said 'being a woman probably plays a little bit of role'. Yeah its not either of the extreme end.",
            "I'm sorry you had to deal with this and also grateful to hear what I experience in class/group project is similar to yours.\n\n2 idiots in the group project, 1 idiot was more manageable so I agreed with him about something. 2nd idiot accused me of liking him LOL. I said, I don't think my bf would agree with that. 2nd idiot was like, you have a boyfriend..? With that mentality? Would he have said that if I were a guy?\n\nAlso recently posted something about visibility in my 4K monitor recently, one guy's response was ..\"you know that type of monitor is for work, not hobbies...\".\n\nI am a software dev, and this monitor was sent to me from work lol. Then he proceeded to tell me he was freelancing in UX so he knows the industry. Asked him to add me on LinkedIn, I think my resume speaks for itself. Said he'll do it after he finishes his courses, lol nice. Guess you really know the industry eh.\n\n&#x200B;\n\nBut luckily my internships and full time experience, nothing but the best people I've encountered.",
            "Dr Grace Hopper ,Margaret Hamilton,Joan Clarke and many more whenever woman tried to do something she always brought revolution (good or bad) so you don’t need to be disappointed. You know you are doing good so that’s all matters just keep it up and when you would reach to certain point every else would see how hard you worked and where you reached people would praise you jealous of you just keep grinding don’t listen to people haha and best of luck for future you would get what you deserve not bcz you are woman",
            "just get good...",
            "Yeah I know things get tiring. I'm a male but lot of my female friends had to go through this which is very sad tbh. I know for a fact though that women in tech industry are top tier. My peers and lots of friends are at the top of their fields and are female. I know it's very sad to hear sexist comments and I really don't know what will be the solution for this problem but remember you don't have to prove yourself to someone. Don't let that get to you.  Keep working hard as always and you will definitely end up at a better place than the trolls",
            "Also a girl in CS, and I totally get it :( It's rough, but in terms of internships, I try to remember that if someone is sexist, it's them failing to be a decent person, and it's not a reflection on me. If women really have a much easier time getting internships, then why are most interns and engineers at the company men? They just want to invalidate your accomplishments, but in reality, your accomplishments are all the more impressive because you've gone through the same difficult application process that they did, on top of all the additional challenges you faced in even making it to this point. I guarantee if some of these sexist assholes had to deal with being talked over in class or at work, other people taking credit for their ideas, being the only man in an office, etc, they'd have quit the field much earlier. You're a badass for making it this far, and you should be proud of how well you're doing - here's hoping we make it better for the next generation of women trying to make it in tech. :)",
            "[deleted]",
            "[removed]",
            "I cannot believe people act like this, absolutely disgusting. That's straight up messed up, like no cap. I have never seen a girl harassed like this EVER at my university! If it happened the offenders would literally get beat up (by me)",
            "That really sucks, as a guy working towards his computer science degree I can’t imagine the extra stress of being judged cuz of ur gender on top of the coursework and other life responsibilities. Ur a trooper, keep on doing right by yourself and I’m sure you’ll find some better people eventually.",
            "I 10000% agree. Not only am I a woman, but I’m not even a CS major, I’m doing it as a minor. I constantly have guys thinking I have no idea what’s going on, that I got my SWE internship bc I’m a girl, etc etc etc. I’ve even had a guy try and joke about how I can’t type because I get long acrylics. It’s the most infuriating thing ever.",
            "Tbh I don't get people who imply that females get the opportunities as if they themselves are equally as qualified or as brilliant. I've actually met several other female students and professors who have only made me feel more hopeless about getting internships and myself in general because of how intelligent and good they are, on top of the fact that they're female... really humbling.",
            "Hi! I'm a CS Alum, female, and currently working in a developer role. I've also done undergrad research into why girls are so underrepresented in the compsci field. \n\nThe obvious reason is just general sexism towards women in STEM, but it does extend back a little further than that. The rise of our major as we know it now came from when the first personal computers were marketed to the public American audience. When these computers were first sold, the software that was primarily used was marketed towards an American male audience, so outside of using them for work, there wasn't really a reason for women to use a personal computer. Due to that, it caused a sharp decline in the number of women entering the compsci field, and thus created the internal bias that \"women don't work on computers brrrrr\". Is it messed up? Absolutely, but I digress. \n\nBesides that, I just want you to know that I've been where you are... I was the only female in my computer science program at one point at my community college until I moved up to a larger institution to complete my bachelor's degree, and even then, there was only a handful of us in the program. I faced a lot of that same bias from peers and professors, and the only thing you can really do is when they say \"you only got those internship roles because you're a girl\" is say \"no, I got those internship roles because I passed interviews with flying colors\". You don't have to prove anything to anybody other than your ability and your work ethic. It's not up to them to decide your worth as a programmer because of your sex/gender. \n\nAs for the workplace, if for some reason you feel they are discriminating against you for your gender/sex, I can tell you that they're probably not someone you'd want to work for anyway. Find yourself a job that celebrates your identity, and I think you'll find once you do, the people you work with will feel the same way! \n\nI know its tiring, but you're doing something really cool, and I encourage you to keep up with it! If you can, look for support groups or create them yourself to build a network so you have friends you can discuss these problems with. At my college, we had a WiCs group (Women in Computer Science) that would meet weekly to offer that kind of support.",
            "[deleted]",
            "If you dont want people to think you got the job because you are female, dont support affirmative action or diversity hiring. When big tech companies explicitly state that they prefer female candidates and as long as affirmative action exists, that notion will stay around forever.",
            "Just don't give a fuck is all I'd like to say",
            "Old person chiming in here (by old I mean I graduated 3 years ago) - my school was the same way and what really helped was forming a women in CS club (your school may already have one!) and meeting the other women in my major, forming a supportive community. Yes, you'll still have to work with the guys in your classes, but it's nice to have other women to bond with over internship applications, classes that you *do* have together, etc. By the end of my degree we had such a great group of women going that we always knew someone in our classes and had a dedicated place we could go for help/to vent when we needed it, it was really nice!",
            "[removed]",
            "Hear hear, I have no good advice to offer you but I commiserate.",
            "Can definitely relate. Already graduated but while I was in school - definitely felt like people's first impression (which I changed 99% of the time) of my coding ability was lower than it actually was. Especially *hated* when teammates decided I would be responsible for frontend without asking me (I swear it was because one of them thought as a female I had better design skills or couldn't handle the backend???). Have met some guys with big egos and very little coding ability trying to boss people around. Not impressed.",
            "Atleast at my uni I have never seen this happen. I believe we have all taken women seriously in all of my group projects with women (we are at 15% women in CS so it occurs fairly often).",
            "I don't understand people who do this AT ALL. We are all studying the same thing, so similar knowledge should be assumed. \n\nI don't know how big your college is, but my CS program is pretty small so we are all tight and learn from each other regardless of gender, sex, race, age, disability, etc. Hell, we even have a blind guy that everybody looks up to because that dude is a genius! \n\nMy professors will call on random students to answer questions, and not just xyz group of people. Our programming team is a mix of all groups and nobody I've spoken to has mentioned the ladies on the team as anyone different from the guys. \n\nIt angers me that people treat you all differently because you are all there to learn and to pursue the advancement of technology. Everybody should see each other as the same, as equals.\n\nI don't think this can be fixed, though. I know this stems from different cultures and groups convincing their men that genders have roles. Ironically enough, I go to a small college in the southeast US, so I would think racists/sexists would be prevalent, but thankfully not. \n\nAnywho, make it your goal to ignore those worthless people and try to form your own support group of like-minded CS students and just do your best!",
            "Maybe my school is more progressive or whatever you wanna call it, but we have tons of programs and outreach for women involved in stem. In my classes I’m actually partnered up with these two girls I met last semester because they are some of the smartest people I know. Very skilled in coding and very good with communication. Maybe it just differs by school, I don’t think there’s a ton of bias at my school, just a gender difference there’s still more guys then girls in the engineering majors. It is changing though and we see a lot of female stem majors which is awesome!",
            "I don't have anything to add to the post as everyone here has had such nice contributions to the conversation already. I guess I can agree with you on how *f*cking annoying it is to have my accomplishments be put into question because they think I'm a diversity hire?*\n\nJust wanted to thank you for this post. It's a breath of fresh air in this sub, and feels  *so* good to hear the opinion of other ladies and allies here ^^",
            "Theres more females than males in my classes",
            "I feel you! I have also heard this so many times.. when I got my first job after BE, I was the first one to get placed from my college and I was fed up of hearing “ yeah they hired only good looking girls!!!” It sucks.. 😖",
            "I'm so sorry to hear you and many other women in CS have to go through this. Seriously.  I have heard this from multiple other women I know who are also in CS.  It is something I fortunately never have to worry about for myself. CS is hard as it is.\n\nI try my best already to be as inclusive as I can, but is there anything I (or other men) can do to help minimize misogyny in STEM (beyond not being \"sexist\" ourselves)? In order for this to change, it is going to take a lot more than this, but I want to do as much as I can to be as helpful as possible.",
            "I'm sorry that you have to balance so much. \n\nSchool work is already hard enough and you have to also deal with this talk and living in general. \n\nWorst part about this is speaking up doesn't help either. And it's already tiring being in their virtual presence.\n\nI say speaking up doesn't help because 1) might end up being in same class again later 2) they'll just say to chill or you're labeled as uptight or a bitch 3) you have to be prepared for what comes next and gear up those English speaking skills\n\nI still say yes to speaking up because looking back, I have regrets of not having said anything even if results are bad. \n\nBetter to do it than to later regret not doing it.\n\nI hope you find a supportive friend group who are also talented, brave women and in tech, such as yourself.",
            "You NEED to stick with it! Some of the best coders I know are female, and they get mad respect. I’ve been in this game for over 20 years, and I’m seeing more and more women showing up and it is great! There are a lot of wanna be’s out there, and honestly all of them are guys, trying to pretend. If you have the chops and you can create and architect solutions to real problems you will be more than fine.",
            "Congratulations on your internships and I commend your work ethic. Unfortunately, This is definitely a regular occurrence in the tech industry but I hope you find solace in the fact that it will not always be this way. The more experience and value you command in the industry/role, the less impact your gender will(should) have. I will say this is an uphill battle for women, but from what it sounds like from your experience, you owe it to yourself and other women to keep pushing through and exemplifying your skills.\n\nBest of luck to you and I hope you have a fun and successful career.",
            "I’m female too and that’s how I felt at times in college too! It gets better in industry, it’s still male dominated, but there’s females in higher roles and who are key decision makers. Don’t let being one of the few females bring you down. I think befriending other girls in your class or joining female engineering college orgs helps. I see a lot female coding clubs too. There might be other girls around you who feel the same, so support each other! And overall just stay away from jerks, don’t let them get you down."
        ]
    },
    {
        "post_id": "1ayfumw",
        "author": "Interesting_Nail_843",
        "title": "Company put me on their waitlist...I made it out!😁",
        "url": "https://i.redd.it/a8655q80bfkc1.jpeg",
        "score": 577,
        "num_comments": 45,
        "created_utc": 1708732497.0,
        "selftext": "All that's left is to graduate 🫡😁",
        "permalink": "/r/csMajors/comments/1ayfumw/company_put_me_on_their_waitlisti_made_it_out/",
        "comments": [
            "Thats actually a good news. Congratulations. There is still a good chance when you get waitlisted.",
            "when were waitlists a thing???",
            "Congrats! Which company?",
            "Congrats! Is it Geico?",
            "Is this Amazon? Cause I was also placed on their waitlist and I already gave up ơn hearing back",
            "Congratulations !! Wonderful !!",
            "That's great! I'm sure you (reasonably) expected \"waitlist\" to basically mean rejection. It's nice to see a company actually follow through. Congratulations!!",
            "Wai I'm confused, did u get a job offer or not?",
            "wtf 😭",
            "If the company is Amazon, I would request you to not take it. Trust me.",
            "Did you get this email after completing the HireVue? Or did you have a face-to-face interview? Got the waitlist email after completing the hirevue but I haven't done the technical interview yet.",
            "Congrats! I got wait-listed today after taking their OA so maybe there's hope for me yet.",
            "I got waitlisted for the final interview and I received the exact same email. Anyone got off the waitlist for the interview?",
            "Nice! cap one?",
            "You were there second option.",
            "Congrats of being second option 😭😭😭",
            "Congrats",
            "Morgan Stanley?",
            "If this is capital one - make sure you have a good manager that will fight for you end of year and mid year.",
            "Yesnt",
            "Wait that’s awesome! Congrats so proud of you 🫶",
            "What was your process? How did you make it out?"
        ]
    },
    {
        "post_id": "l7ozlk",
        "author": "sdfequality",
        "title": "Citadel Mistake",
        "url": "https://www.reddit.com/r/csMajors/comments/l7ozlk/citadel_mistake/",
        "score": 578,
        "num_comments": 23,
        "created_utc": 1611914841.0,
        "selftext": "Fuck Citadel. \n\nGME to the moon! 🚀🚀",
        "permalink": "/r/csMajors/comments/l7ozlk/citadel_mistake/",
        "comments": [
            "Add the skill to your resume",
            "Take that Citadel! GME to the moon for giving me a retarded hackerrank!! 🚀🚀",
            "GME to Alpha Centauri !",
            "Lmaooooo GME to Mars 🚀🚀🚀🚀🚀",
            "I'm sad knowing that my school isn't good enough for Citadel to hire me as an intern, but I realize I'll probably make more money this summer than if I was with them anyways",
            "KEEP HOLDING NEVER SELL BOYS",
            "They didn’t give me an opportunity to interview for their trading role, and they got this now. Hope they learn from this, and at least give me an interview in future.",
            "DOGE to the moon fellas",
            "The whole Gamestop frenzy is starting to get mildly annoying...",
            "[deleted]",
            "[deleted]",
            "Same\n\nLMAO",
            "you tell em",
            "Okay so real question, I've actually been working on this for a little over a year...What's the likelihood that some of these big firms actually open WSB trading desks?",
            "LMFAOOOOOOO"
        ]
    },
    {
        "post_id": "jxuloe",
        "author": "None",
        "title": "JS vs other offers",
        "url": "https://www.reddit.com/r/csMajors/comments/jxuloe/js_vs_other_offers/",
        "score": 581,
        "num_comments": 29,
        "created_utc": 1605897058.0,
        "selftext": "I have an offer from Jane Street as a SWE intern and Garden State Dispensary as a wordpress intern. I initially applied to Jane Street thinking it was a marijuana dispensary but then near the end of the process, I realized it was really something to do with stocks n shit. Nevertheless, I got offers from both.\n\nJS: 16.7k/mo + 2.1k housing\n\nGSD: 15/hr + weed\n\nWhich one? My life passion is making websites for weed dispensaries. ",
        "permalink": "/r/csMajors/comments/jxuloe/js_vs_other_offers/",
        "comments": [
            "Follow your dreams",
            "Ahh yes. I too confused Jane Street with Mary Jane Street",
            "obv GSD it's not even close",
            "WLB prolly better at GSD. Who cares about money anyway? Can’t put a price on free weed.",
            "[deleted]",
            "This is how you shitpost, folks",
            "How was the Hackerrank for GSD? Did they ask any dank LC questions?",
            "The G in FAANG stands for Garden State Dispensary, I don't understand why this is even a debate",
            "Weird flex but ok",
            "[Money can be exchanged for goods and services](https://imgur.com/r/thesimpsons/9Y8p7)",
            "better to be a php intern than a swe tbh",
            "Go with Albertsons",
            "If only reddit allowed GIFs, but me browsing my feed when I saw this:\n\n[https://giphy.com/gifs/double-take-shocked-paul-rudd-K0Mmal97YNYkw](https://giphy.com/gifs/double-take-shocked-paul-rudd-K0Mmal97YNYkw)",
            "weed",
            "Howd u get an offer from Jane Street help a brother out lmao",
            "This is a pretty lame flex",
            "Flex",
            "Web designing off the pink runtz count me in",
            "Weed place bro.",
            "Is this the actual intern pay for JS?",
            "you should go with Jane Street because JS is the best language ever"
        ]
    },
    {
        "post_id": "rficsi",
        "author": "Equal-Basket-6918",
        "title": "Confession: I did nothing at my internship",
        "url": "https://www.reddit.com/r/csMajors/comments/rficsi/confession_i_did_nothing_at_my_internship/",
        "score": 577,
        "num_comments": 79,
        "created_utc": 1639409650.0,
        "selftext": "Okay, I did do *something*, but hardly anything of note during my 4 month internship. I basically prolonged my tasks as much as possible, found it very difficult to focus instead spending a large chunk of time browsing YouTube or Reddit, and ended not learning much. Anyone else been in a similar boat? I just couldnt get myself to work on my project some days, maybe it's an attention or motivation issue? I just couldnt focus for more than 10 minutes on my work, I would get bored and just start browsing since im WFH\n\nThis is no brag. I am very ashamed of letting this opportunity go to waste. I know it wont last once I get an actual Junior Dev job",
        "permalink": "/r/csMajors/comments/rficsi/confession_i_did_nothing_at_my_internship/",
        "comments": [
            "This has been my entire life since high school. I do not know how I've managed to get by and appear outwardly successful for so long. I love what I'm trying to do, spent much of my life dreaming of doing it. But nothing. Working through an ADHD eval atm...but I just don't know.",
            "Made a throwaway to comment on this. Dude, same. I had zero motivation to work remotely and my mentor wasn’t that helpful. Result: I barely did anything the whole summer. I’d nap during work, eat during work, honestly, do nearly anything but work. I’d complete super small menial stories and make like zero progress on anything significant.\n\nThis coming summer I’m gonna be at Amazon (was at a random not-prestigious company last summer) and I’m worried I’ll have motivation issues. Hoping that being in person makes a big difference.",
            "Well, it seems like everyone in the comments is having the same issue. I have some attention and focusing issues but not when I am getting paid, so I cannot relate.\n\nBut here's a simple tip, when I have this issue in my personal life, I decide to do something productive for 10 minutes, take 20 minutes break.\n\nPut it on the timer. Then do the same thing for 10 minutes. The goal should not be to \"complete a task\" but to \"do something useful related to work\".\n\nIf you're on youtube, watch a 10-minute tutorial, then go about watching other videos for the next 20-30 minutes. Start small, and then move it to 15 mins work, 20 minutes break.\n\nIf you only focus 10mins-20mins / hr, by the end of the day you'll have done something productive for 3hrs of your 9hr shift. Baby steps.",
            "Working in the office helped me a lot with that. When I WFH regularly I can't get anything done either.",
            "same 😭 tbh I don’t think this field is for me at least dev work. I think remote work is ass for this very reason since mentally there’s no separation. Like when I drive to work I know I’m there to do work and not dick around but idk. Wish you the best of luck man and hopefully you can get through this and figure out the underlying problem",
            "Yeah same here. I have really been struggling to focus on anything, especially work and school. I set aside time to do productive stuff, but then when I actually have to start I end up just spinning my wheels until I feel tired and giving up. It's like I'm allergic to action.\n\nThe habit of doing small menial stories is especially hard to break because you can do just enough work to be passable. I just pick tiny things and then wait forever, and when I finally get them finished I just feel embarrassed about how tiny my PR is compared to what everyone else is usually doing.\n\nHow do people just sit down and focus? I feel like I really can't put my mind to anything anymore, I always just get distracted and end up doing nothing.",
            "Another fellow time thief :)",
            "Setting rules may help.  Phone stays on drawer, internet only used for documentation.  \nBreak out goals into tiny chunks.  When you get bored, switch to the next goal.   \nIdentify a target purchase and make it if you meet a certain number of goals after a month",
            "Thanks for sharing this. Thank god i was not the only one going through this.",
            "I had an internship at a company that no longer exists back in 2012. Ran some tests on different machines for about a month and then I had literally ZERO work for the rest of the summer.\n\nThey offered me a return internship during the year… sure I’ll take free money (I wonder why they aren’t a company anymore? Lol)\n\nThen in 2013 I got an internship at Google. I did soooooooo little during that internship. Such a joke. \n\nInternships are mostly about having something on your resume. It’s funny because there is so much competition to get them and then 90% of them involve little to nothing getting done. Then student walk around campus like they are badass even though they didn’t do much.\n\nDon’t trip though. You’ll be fine once you join the workforce.",
            "Followup question: how many of you are wasting time at a junior dev job?",
            "Meanwhile, me doing nothing at my job🤣",
            "I literally got fired from my off-season internship for this lol",
            "I use YouTube for learning stuff for my work at the internship so can't help opening it.\nAdd the unhook YouTube Chrome extension to block all the distraction on YouTube, with Brave browser to block ads. Do not open Reddit during your work hours. I face the same problem usually and I found this solution working for me.",
            "Meanwhile I was thrusted into self-learning Vue.js and TypeScript and make a component in less than a week for my first internship, and get scolded for missing 2 team meetings in a week.\n\nDamn do I envy some people right here lol. At least your internship isn't hectic.",
            "Grind leetcode",
            "Based",
            "That's why I hate doing any work at home. If I'm at home, I just do not do any work.",
            "Not an internship but this is me at my university. Barely do anything don't even wake up for some classes it's been too long online I can't take it",
            "I wfh and go to a coffee shop/library 2-3 times a week to stay on task",
            "I felt the same through all my internships. But as a junior dev in a highly motivating and interesting work environment where I'm always engaged, I feel much more productive. Maybe it's the product itself but I feel it's more the attitude that everyone around me has.\nIg when you're an intern you're kinda fighting for scraps but once you're a dev, insist on an environment that gives you the support and learning you deserve.\nIMO it's rare to find this feeling in Faang",
            "Do you guys think that internships offer you more experience than your own personal projects, or is it the other way around?",
            "Maybe you didn’t have enough work to do, I’d imagine someone would be on you making sure you are on track with what you are supposed to be doing?",
            "My Mom was a lead software engineer for TI. She did most of the hiring and firing but had people above her calling the shots. She said their biggest problem was finding things for the interns to do that would be the best to help them learn. Especially finding tasks they CAN do without expecting too much. I can't speak from experience because my internship was completely cancelled due to covid and still got hired as a full stack .Net SWE 1.5 months after graduating. Just like my Mom said: \"internships don't mean shit my brudda.\"",
            "[deleted]",
            "If there’s any way you can separate your work station and play station, that would help. If they’re the same spot, then your brain thinks it’s play time.",
            "Yes I did that two years at the same company. I don’t really think it says anything about what work will be like at a full time job. Mentors/managers don’t really have a lot of time to spend on interns that will be gone in a few months and won’t really have the time to contribute meaningfully. I know for me they never really provided meaningful guidance so I never really knew what was going on",
            "Regarding the focus/attention issues I  recommend reading the book “Deep work”. Deep work is the ability to focus without distraction on a cognitively demanding task. It’s a skill that allows you to quickly master complicated information and produce better results in less time. \n\nhttps://www.calnewport.com/books/deep-work/",
            "Me too, I pretty much played league all day and didn't end up getting a return offer :/",
            "What company and what position lol…asking for a friend",
            "I’m in the same boat, but not for lack of focus. I came on as a UX intern and my boss knows next to nothing about UX..so I feel like I teach him stuff. He also will go weeks without contacting me and I’m just sitting there twiddling my thumbs waiting to be assigned tasks. I WANT to do stuff, he is just so disorganized and half the stuff he assigns me doesn’t make sense bc he doesn’t know what he’s talking about half the time. I would have quit already if this wasn’t for school credit. Two more weeks until I’m done and as soon as I get my credit I’m walking out the door. Kind of a joke of an experience tbh, I came on to learn and grow when I’m actually teaching him more than he teaches me.. RESEARCH YOUR INTERNSHIP OPPORTUNITIES FRIENDS",
            "Did you get a return offer though?",
            "lol same so I stopped working and now they’re blowing up my slack and calling me. Like fuck off",
            "I had a hybrid internship and I was a lot more productive in the office then at home. I have a fully remote internship next summer and I'm kinda spooked. In my defense the work was super boring (aka my ticket would be to update a projects libraries to work from CentOS 7 to CentOS 8) and the project would take 3 hours to run each time. For the most part I only had one ticket at a time. So I would literally either help out other interns in the office while it's building or do chores back home.\n\n\n I had several full time employees apologize for how unlucky I was to get literally the most boring tickets. I had one dude tell me he understands if I don't come back because my experience was probably worsened by the tickets I got. I spent three months out of eight updating libraries. Learned a lot about debugging really complex c++ so can't complain too much. Point is, if the work is boring it's so easy to get distracted.",
            "Literally my entire internship was this way. We were a team of two. Other guy did the entire project almost just by himself and he would work on weekends just because he wanted to impress our mentors. We both got a return offers. I rejected because I had better offers, he took it because it was the only offer he could get. Life is not fair sometimes. It doesn’t matter how hard working you are. It matter how hard working you can pretend to be.",
            "Yep. I barely \"worked\" to begin with but when I did sit in on meetings, everything went way over my head.",
            "Bruh same, It was one of the reasons I didnt get a reason offer but I still didnt care lmao",
            "In an entry level right now and I just chill most of the day about to hit the 4 month mark have not really learned anything lol",
            "Are you sure this is the area you want to go into? Does not seem to light a fire."
        ]
    },
    {
        "post_id": "jk58e8",
        "author": "mshahman",
        "title": "Jane street vs two sigma vs Airbnb vs stripe vs all of fang",
        "url": "https://www.reddit.com/r/csMajors/comments/jk58e8/jane_street_vs_two_sigma_vs_airbnb_vs_stripe_vs/",
        "score": 580,
        "num_comments": 50,
        "created_utc": 1603954001.0,
        "selftext": "Need help deciding which one.\nHave done all lc questions in existence.\nDream about lc hards every night.\nHave never held a girls hand and I don’t shower",
        "permalink": "/r/csMajors/comments/jk58e8/jane_street_vs_two_sigma_vs_airbnb_vs_stripe_vs/",
        "comments": [
            "Girls are temporary, red black trees are eternal",
            "[deleted]",
            "Take 4 sigma",
            "[deleted]",
            "wow just take gap years and never graduate!",
            "\"Ask not of what Leetcode can do for you, but what you can do for Leetcode.\"",
            "[deleted]",
            "Not even gonna lie, I'd be ok getting my virginity back if it meant I had these offers",
            "Have done all leetcode questions that ever existed?  Good.  Now do them again! *takes whip out*",
            "Oh, so you’ve done every Leetcode? Name every single one.",
            "I had all of them pining for me but I went with my gut and decided to join the City of Charleston West Virginia",
            "quality shit post",
            "I thought this was /r/whowouldwin for a minute",
            "[deleted]",
            "Don’t really think any of these companies are worth it. Would just do personal projects and more leetcode until you get something good",
            "two sigma balls",
            "Sounds like you can only handle one job? Weak",
            "[deleted]",
            "Which ever one pays the most lol",
            "lmaoooo simping for lc",
            "Take your talents to south beach Miami",
            "Stripe. They ipo soon",
            "LMAO IM DEAD 😂😂💀💀",
            "sigma balls",
            "Nobody should take this all that seriously but here's my personalized ranking of these companies in terms of desirability (assuming FAANG = FB, Amazon, Apple, Netflix, Google):\n\nJane Street > Stripe > Google/Two Sigma > Airbnb > Netflix > Apple > Facebook > Amazon\n\nA few explanations:\n\n* JS is not really the sort of place that is accessible to most people. You can kinda/sorta get in everywhere else on this list with enough dedication and LeetCode but Jane Street is more for the Putnam Fellows/IMO medalists. You've either got it or you don't and that's what makes it stand out.\n* Stripe's product frankly isn't that interesting to me but their engineering culture is phenomenal. Sort of like a Google from 10-15 years ago.\n* Google and Two Sigma are both known for being great high-paying places for \"engineers to retire.\" Pick your poison I guess. Two Sigma is a little harder to get into but it's also smaller and not everyone likes finance.\n* I have a strong personal distaste for FB which is why I ranked them so low. They also fire people easily. They pay a fuckton in terms of TC but, for me, it wouldn't be worth it.\n* Apple is a good company but it's not really the greatest software engineering place to be at.\n* Amazon is just a shitshow. There are good teams but taking an Amazon offer is tantamount to gambling whether you'll get PIP'd in a year. I'd never work at Amazon personally.",
            "different weary history shy badge stocking chase spoon existence mountainous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "TC or GTFO",
            "I've been contacted by a recruiter about Jane Street anyone got more information on them at a grad/junior level. Didn't realise they were a big deal",
            "Can you teach me how to be you.\n\nThe fruit-oriented part of FAANG is pretty awesome from my internship experience, can’t speak to others but JS pays insane amounts of dough."
        ]
    },
    {
        "post_id": "1ce14r0",
        "author": "Ashamed_World_9039",
        "title": "I got an internship!!",
        "url": "https://i.redd.it/3qnoqh7t1xwc1.jpeg",
        "score": 578,
        "num_comments": 86,
        "created_utc": 1714177505.0,
        "selftext": "I'm finally in after too many rejections (I didn't count, I just know it was many) 🥳",
        "permalink": "/r/csMajors/comments/1ce14r0/i_got_an_internship/",
        "comments": [
            "Same!!!\n\nhttps://preview.redd.it/fw482tjwgxwc1.jpeg?width=804&format=pjpg&auto=webp&s=9f1b696397bf35c76992c886074b5146fdbbb9f6",
            "Good.",
            "Best feeling congrats. Enjoy that dopamine rush lol",
            "Good, now give it to me",
            "Proud of you",
            "Enjoy brotha",
            "eyyyyy you got it",
            "CONGRATULATIONS",
            "Congrats bro, wish u all the best",
            "AMAZING",
            "Congrats brother",
            "congratssss 💐",
            "Aye congrats! Do well during the internship for a return offer 🫡",
            "Congratulations",
            "saaam",
            "This is paid or unpaid",
            "Ay",
            "Congrats!! One of the best feelings ever",
            "Lisan Al-Gaib",
            "Congrats! You got this! Enjoy🥳",
            "that's cool, now go and promote me also so i can i have one too",
            "Congratulations.",
            "Congrats man",
            "Congrats!!",
            "Which school are you at?",
            "Comforting to see it’s still possible in this job market. Starting university in the fall, so I’ll be searching for one before too long. Good luck!",
            "Congratulations",
            "Congrats op! \nWishing the same for everyone here!",
            "That's amazing! I graduated but never got an internship, just want to ask if there are internships for non students?",
            "Congrats!!!",
            "Ggs",
            "W",
            "Congratulations bro",
            "Congratulations",
            "Work you tail off and try to learn as much as you can. Any downtime during work ask your coworkers and superiors to help with their projects, or ask them to teach you about something they are working on. Most will be happy to show you something new, or show off a skill they have. It's helped me greatly at my job and I'm near a promotion due to all the new skills I've developed by asking people around me to teach me new things or help them with projects that force me to learn new skills.",
            "Good luck bro 🤘",
            "Congratulations man! This is where the real hard stuff begins. Number 1 thing you need to learn is how to bother people and not feel bad. Ask questions no matter how dumb they feel, but listen to the response. If you don’t understand their answer, ask your mentor/coworkers to clarify what they meant by that. You got this!",
            "I always wonder... what are you gonna do after 3 months?",
            "Society has been saved",
            "Nice! What’s the internship for?",
            "Thanks yall 🙌🏼",
            "Congrats!",
            "Nice! After you’re done, can you share?"
        ]
    }
]