[
    {
        "post_id": "nk3brn",
        "author": "None",
        "title": "Get a job at Leetcode",
        "url": "https://www.reddit.com/r/csMajors/comments/nk3brn/get_a_job_at_leetcode/",
        "score": 574,
        "num_comments": 33,
        "created_utc": 1621877264.0,
        "selftext": "Forget Google and other FAANGs - how much Leetcode do you have to grind to get a job at the mothership herself?",
        "permalink": "/r/csMajors/comments/nk3brn/get_a_job_at_leetcode/",
        "comments": [
            "And for the interview, no. You won’t solve a leetcode problem. You’ll create a leetcode problem.",
            "Leetcode behavioral interview: That's not how it works, that's not how any of this works.",
            "Some of y’all mention leetcode so much one could only assume they are already paying you",
            "all of it",
            "creating test cases would be a bulk of the interview XD",
            "Only if you can find a solution to the travelling salesman problem that is in P.",
            "https://leetcode.com/jobs/\n\nTo be a problem adder: \n\nLeetCode is looking for a creative and motivated individual with a passion for computer science and online education. The ideal candidate is passionate about writing clear and unambiguous problem descriptions and generates test cases that ensure 100% coverage to provide the best learning and user experience for our LeetCoders. In addition, this role will require you to think outside the box and propose different approaches to solve the problem. As an integrated member of a content creation team, the problem adder works closely with the Question Adder Coordinator and Internal Contest Testers to produce content that will enhance LeetCode users’ interview preparation. \n\nThrough this role, you will take ownership of the end-to-end process of setting a problem while working with the world-class talent of past ACM coders. Your questions will premiere during our weekly contests with over 15000 coders worldwide! What a great satisfaction! \n\nThis is a remote part-time, contractor position.\n\nResponsibilities may include:\n\nDeliver high-quality problem content based on our guidelines and standards\nOwn the publishing process from beginning to end, resolving issues and addressing feedback\nCreate a complete test case set for problems and ensure all corner cases are covered\nCollaborate with team members to ensure all problems are up to standards by providing and resolving constructive feedback\nRequirements: \n\nIs in the process of getting a Computer Science degree (or related field)\nMinimum LeetCode Contest rating of 2100+\nCan commit to this role for at least 6 months\nIs able to commit 2-3 hours from 9 AM to 5 PM PST every working day (M-F)\nAbility to complete test case set for problems and provide solutions for multiple approaches to ensure all cases are covered. The test case set should block incorrect solutions and allow correct solutions to pass\nAbility to work in a fast-paced environment with a team and deliver high-quality work on tight schedules. Proactive and self-motivated\nHas basic graphics skills, can produce simple image/chart to help explain ideas in problem descriptions\nPlus:\nACM contest participation experience\nContest prep/testing experience\nFamiliar with LeetCode problems and has solved over 500 problems\nLeetCode Contest rating of 2300+\nStrong command of the English language: an eye for detail, meticulous grammar, and proofreading skills\nProficient in one static language (C++/Java) + one dynamic language (Python)\nProficient in SQL\nExcellent graphics/animation skills, can produce elegant image/animation to help explain complex ideas in problem descriptions",
            "Nothing because they put their own problems on leetcode and let the end users solve it.",
            "You enter the interview grinded leetcode for the last year with 2000+ problems under your belt...\n\n\"Actually at leetcode we feel like OA are not a fair assessment so we have provided a group behavioral assessment to test your abilities\"\n\n😳😳😳",
            "Big brain question",
            "[https://leetcode.com/jobs/](https://leetcode.com/jobs/)",
            "I’m sure they’ll look at your account history and see how much you know",
            "behavioral test aka personal bias and discrimination"
        ]
    },
    {
        "post_id": "t4cid5",
        "author": "Risma_",
        "title": "Anyone else doing leetcode problems in their head while jacking off?",
        "url": "https://www.reddit.com/r/csMajors/comments/t4cid5/anyone_else_doing_leetcode_problems_in_their_head/",
        "score": 567,
        "num_comments": 37,
        "created_utc": 1646153809.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/t4cid5/anyone_else_doing_leetcode_problems_in_their_head/",
        "comments": [
            "r/cscareerjerk",
            "now that's multi threading",
            "chad 👑 any runtime optimizations?",
            "I solved 3sum whilst having a threesome",
            "LeetCock",
            "Mm-hmm. Why? I want to. That’s not why I do it. I do it because I fucking need to. Think about it, you’re dealing with numbers all day long. Floating points, integers, bang, bang, bang. Eh-eh-eh-eh. Fucking bits beep-boop-beep, all very acidic above the shoulders mustard shit.\n\nSo you gotta feed the geese to keep the blood flowing. And keep the rhythm below the belt. This is not a tip, this is a prescription. Trust me. If you don’t, you will fall out of balance. Glitch your differential and the tip fuck over. Or worse yet, I’ve seen this happen, implode.\n\nPop off to the bathroom, work one out anytime you can. And when you get really good at it, you’ll be fucking stroking it and you’ll be thinking about code.",
            "Yo not gonna lie and I feel like one been saying too much on this sub but last night was thinking of a problem while balls deep trying not to nut. Girl cam, I came and I solved the problem. About to present the solution on this mornings' standup.",
            "We need to get u laid, bro.",
            "Wow, I didn't see this coming when I logged on LOL! Yes, I do a LeetCode Hard, emphasis on the hard.",
            "Smh. This made my day lol",
            "They are quite literally the only way I get turned on at this point",
            "“Oh yea, optimal cumtime”",
            "Well we found the Citadel intern",
            "touch grass",
            "Yeooo🤣🤣🤣🤣",
            "most relatable post on this entire sub",
            "I couldn’t stop thinking about my Spring Boot REST API and azure pipelines while having sex the other day",
            "#LeetCum"
        ]
    },
    {
        "post_id": "1bjht5t",
        "author": "Appropriate-Tooth252",
        "title": "Masters done. Thanks OpenAI!",
        "url": "https://i.redd.it/mcvht9qboipc1.png",
        "score": 568,
        "num_comments": 17,
        "created_utc": 1710952537.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bjht5t/masters_done_thanks_openai/",
        "comments": [
            "couldn't fit an 'a' on there?",
            "CHeATGPT",
            "I will take your job, Welcome",
            "Job",
            "ChatGipitty",
            "Yeeeeee",
            "These the people that complain when they can't get a job:"
        ]
    },
    {
        "post_id": "10wppmq",
        "author": "Limp-Tune-5357",
        "title": "Finally landed quant internship :)",
        "url": "https://www.reddit.com/r/csMajors/comments/10wppmq/finally_landed_quant_internship/",
        "score": 564,
        "num_comments": 95,
        "created_utc": 1675838466.0,
        "selftext": "Go to a T20, low-ish gpa (3.1) to focus on prepping for interviews. That being said, paid a lot of attention in OS and comp arch.\n\nStarted grinding in 2020.\n\nDid around 1k leetcode and 1k codeforces, am \\~1900 rated.\n\nInternship is approximately $120/hr, high return offer rate. New grad offer is about $450k first year, $300+ recurring.\n\nFeels like all that time spent was finally worth it. Planning to coast for the rest of undergrad and hopefully pay my folks back for tuition.\n\nedit: had some referrals and previous faang internship experience\n\nedit 2: yes, this was a dev/swe role and I'm a CS major.\n\nthe leetcode questions ranged heavily in difficulty. Overall, they range from simple common mediums to maybe 1800 level codeforces questions (rare). Seemed like there was an emphasis on streaming algorithms and data structures, as well as DP strangely.\n\nacross all of my interviews, the biggest topics besides leetcode questions were C++, linux, OS, computer architecture, and to a lesser extent networks. These questions were mostly just knowledge-based. I crammed for these topics a lot in the past few months. I'd recommend doing your leetcode practice in C++ to at least get used to the syntax for the interviews. If you can, do your class projects in C++ as well.\n\nI feel like interviewers were somewhat impressed when I brought up lower-level implications of the code I was writing: things like being aware of cache coherence, avoiding branches, and rewriting loops to take advantage of things like vectorization.",
        "permalink": "/r/csMajors/comments/10wppmq/finally_landed_quant_internship/",
        "comments": [
            "That's a lot of Leetcode. My HFT process didn't involve a single line of code after the OA. It was all about reasoning and seeing how I think. The recruiter also explicitly told me not to study for the interviews because there'd be no point. They were right.",
            "good fucking shit, this is the kind of success story i like to read about\n\ncongrats bro",
            "450k bruh what the actual fuck I’m sooo happy for you",
            "Congrats! And fuck you :)",
            "W \n\nJane Street?",
            "Is this for Quant Researcher or SWE",
            "[deleted]",
            "Congrats!!!",
            "[deleted]",
            "Is this firm in chicago? If so you'll be living like a king lol. Nice job",
            "What classes do you think were most useful for preparing you for quant?",
            "CONGRATULATIONS!!!! You so deserve this!! I am so so proud of you. Good luck; you are going to crush it!! I'm rooting for you :)",
            "Did you have a social life? Serious question",
            "Are you doing only BS in CS?",
            "holyyy my guy lesss gooo now that's what I'm talking about",
            "damn didn’t think you can get interviews for quant with a low gpa",
            "Bro so happy for you! Side question but how was OS and Comp Arch helpful?",
            "Congratulations and fuck you!",
            "Congrats! Any tips for getting referrals? Apart from messaging random people on LinkedIn",
            "is it quant dev or quant research ?",
            "450k what in the fucking kangaroo shit m8 you are goated.",
            "Are you 1900 rated on leetcode or codeforces? Did you get a lot of OS questions?",
            "CONGRATULATIONS!",
            "Congratulations! Apart from leetcode type questions, what topics did you see in your interviews?",
            "What is quant?",
            "Congrats man 100+ per hours is def worth it lol",
            "Dont coast for rest of undergrad ! That was me i started slacking off cause i had an offer senior year and failed a class",
            "$120/hr is insane, congrats dude! that’s amazing",
            "you mentioned you crammed the non-leetcode topics in the months preceding interviews - any ideas on pointers for studying those topics (C++ nuances, OS concepts, Linux, etc.) or resources you've used to study? I've taken arch and OS already, but I wanted to make sure I could recall these ideas/learn more in-depth. Thanks!",
            "Hey was wondering if I could see your cv sent you a dm",
            "Damn bro im trynna get like you 💯💯",
            "bro may I ask what’s your major and what’s your grade in college?",
            "Congrats bro ur a beast. Got any advice for how to split up the studying - like between os stuff and cf?",
            "What would you say was the difficulty of the problems you got in your coding interviews in terms of cf rating?",
            "Congrats!",
            "Is this for SWE position? Or a trader role? Also, did you say 3.1 is low gpa? Whats considered competitive if so? And how many hours are you expected to work per week?",
            "curious where?",
            "damn that's killer dude. congratulations. sounds like you worked really hard and it paid off. nice work!",
            "Good shit baby! Hard work does pay off :)",
            "Bro created a whole new account to make this post and thought we wouldn’t notice.\n\nAnyone that has ever interviewed for a quant role knows this is bs.",
            "Congrats! Mind if I what you’re majoring/minoring in? Also, I’m guessing this is more of a developer role than research/trading?",
            "congrats and go fuck yourself :)",
            "Congrats! My goal for next summer🙏🏼",
            "[deleted]",
            "Beast mode",
            "this is for after junior year summer right?",
            "How’d you go about doing codeforces ?",
            "Congratulations!",
            "Gj man the grinding paid off big time",
            "Hi, congrats :)\nWas this quantitative research or softwer engineering?\nDid they ask you any probability/statistic questions in interview?",
            "What kind of personal projects did you do or exp did you have on resume?",
            "Bro!",
            "Congrats"
        ]
    },
    {
        "post_id": "tpll64",
        "author": "Riverendell",
        "title": "Has anyone else felt like university has really disincentivised them to learn?",
        "url": "https://www.reddit.com/r/csMajors/comments/tpll64/has_anyone_else_felt_like_university_has_really/",
        "score": 568,
        "num_comments": 79,
        "created_utc": 1648392953.0,
        "selftext": "I’m in my last year of university and I feel like every step of the way I have had to strategically min max my time, credits, and getting marks instead of really getting to grips with the material. Every time I try to really learn and internalise content I’ve fallen behind and it just never feels worth it.\n\nMaybe this is also just a dumb person problem it just takes me a while to really understand things and it really sucks to feel like I spend so much time getting marks but ultimately not really retaining anything :(\n\nHas anyone else had this experience?\n\nEdit: I also forgot to mention the problem of having to decide against taking courses that sound interesting to me and instead take courses that would be the most manageable in terms of workload.",
        "permalink": "/r/csMajors/comments/tpll64/has_anyone_else_felt_like_university_has_really/",
        "comments": [
            "absolutely, at this point I don't care about marks anymore and just try to get the most out of my classes and my grades have suffered",
            "The amount of times I've taken an easy class I wasn't interested in just to get a high grade and keep my GPA up has been astounding. Seems really antithetical to the whole point of university, imo. The currently system is fundamentally broken. Learning is one of the least important things, almost feels like an afterthought.",
            "Yes, it really sucks. I'm not even taking full time hours because of my internship but I feel this so bad. I'm learning like 5 different things right now and I wish I had the time to really learn at least one of them (while staying sane).",
            "This is a complex but very relevant topic. See, I went to the university in 1999 as a computer engineer and majored in 2006 in fault tolerant systems. For a rather long time I thought that most of the stuff we learned was useless, because I was working during that time to pay my bills and what we learned and what I did to earn money were so much disconnected. Or so I thought. After a couple of years when I was part of various projects I just realized what they told us but could not understand at that time: at the school you learn the abstractions of various problems and how to solve them. You learn engineering. What we lacked at that time was experience in the industry so we could not really internalize the material, to make it our own. But after so many years in industry at one point something just clicked, the dots became connected, and had the aha moment. From that on my view of the world changed and I started applying the theory on real world problems very conciously and with a great success. \n\nSo I would say that don't stress yourself too much on that, try to learn as much as you can, and later you will thank yourself. Also enjoy your youth. Make mistakes. Do silly things. Learn, adapt, and grow. Good luck college.",
            "Yes. The university system has been the worst four years of my life. When I was on breaks or Covid related no school I made an app, worked with AI, did research, learned for fun. I have not learned programming in school since freshman year. I have literally no time because I also have to work. It's so dumb and gets me nowhere. I just got an internship. Bc of school? No. They didn't connect me w anyone. I just applied, and after passing all the online coding assessments a friend's dad sent an email in my favor and I aced the interview, again thanks to leetcode and me, not my school. It's bullshit",
            "Absolutely, I’m actually going to trade school in a few months instead. CS has completely exhausted me and my mental health I just can’t do it anymore. You’re not alone in the way you’re feeling, lots of students suffer in silence :/",
            "Yeah it’s messed up how true this is.",
            "Absolutely 💯",
            "I used to love to learn, and now because of university it's feeling like a chore, it doesn't help that the only thing that seems to be on everyones mind is what marks they got, what course they're grinding to prepare for an interview or land a job. I came into CS because I genuinely am interested, and I still am, but my mind has not begun to associate learning with the immense amounts of anxiety I get from thinking about preparing for a job interview or test, or competing with all the brilliant students for whom it comes much more naturally.",
            "Absolutely- I’m in grad school &&& I’m just ready to graduate && work",
            "Just another year and a half of “learning” (*suffering*) and I’ll be free to finally reclaim my time and learn interesting and useful stuff. Scheme and prolog are NOT interesting or useful.",
            "I feel like at university I had this mood. But Idk, i still had a spark to learn. I've been working after my masters degree now for about 2 years and TBH it's killed my passion even more.\n\nEverthing is about profits, everything is about having no time to really learn something.\n\nGotta make sure to keep the hours coming on projects, but you have no time to do anything right.\n\nIf you take time to do something right it'll delay the timeline. Worst fucking thing ever. I swear I'm going to exit IT soon. It's getting too much. Can't keep sitting in front of the computer for my life. But a career change after a full study programm isn't really feasible. Struggle.\n\nHope the best for you out there.",
            "I studied engineering in India … did not due diligence on the college in joined .. turned out it was a scam by politicians to loot money from middle class.. ended up ruining my life ..",
            "Me too! At this point, my only objective is to graduate next year and get a job. I am tired of having to pay to work.",
            "this is not a shit post.",
            "I feel you",
            "feel the same way, I have a year long internship starting this summer, so during that time im gonna go back and study/review some of the courses where I prioritized my mark rather than learning the actual content.",
            "Me in first year lmao",
            "I felt like this doing CS classes in high school. I ended up opting for a software apprenticeship, where I get to learn loads of stuff on the job and get absolutely no homework, which gives me time to try out stuff in my own time. If I've resolved all my bug fixes and got where I want to be in feature development, I can take some time to do my own thing (in working hours). Could be some C++ practice, or a youtube lecture on SQL. Whatever my heart desires.",
            "When I truly comprehended the material, my marks nosedived and I had to beg to be allowed to remain in school. Get your degree, and then worry about learning how to do your job.",
            "I've got a deja Vu from reading your post. I just graduated 2 months ago, since then I kept brutally blaming myself for my passive attitude towards university. I was convinced that everything i told myself is a silly excuse for my procrastination and lack of effort. But now that I am reading this, remembering all those soleless profs I had, the terrible exams that reflect no shit about what you know, the gpa robot slaves you'd have to compete with.... I feel more at peace with my judgement/thoughts.",
            "The Educational System is supposed to train people to be obedient, conformist, stay passive, do what you're told... That's basically what the system is about.\n\nEven the fact that the system has a lot of stupidity in in, I think, has a function. You know that means that people are filtered out for obedience. If you can guarantee lot's of stupidity in the system ( you know, like stupid assignments and stuff like that) you know that the only people who make it trough, are the who are willing to do it no matter how stupid it is.\n\nThe fundamental architecture of university and schools has been invented in the 19th century. Since then, they made minor adjustments, but the overall structure has been unchanged.\n\nEdit: I absolutely agree with your main point. That has also been my experience. As a student, this is exactly what I've been doing. There is a tendency to min max your time for the optimal credits. Every other approach is not rational. The reason for this, is of course the structure of the system itself.",
            "I hate this feeling so much. I need a decent GPA for my scholarships, but I wanna just abandon all my coursework and just work on projects or Leetcode grind. Eventually, the latter will be all that's gonna get me a job. Not trying to take 3 religion-oriented courses making me read 60 pages of work I'm not interested in",
            "I feel this. I’m at the point where I just work smarter and not harder. It sucks but fortunately in this field you learn more through experience rather than through theory, textbooks and lectures.",
            "Yes. A hundred times yes. \n\nI completely lost interest in Game development after taking a Computer Graphics course taught by a teacher who himself learnt it from an online course a couple of months before our semester started. Game dev went from one of my primary career choices to not being a choice at all.",
            "Absolutely. And the university system (or at least my university) doesn’t do a well enough job in preparing you for the real world, or even an internship. I’m about to graduate in a month and never got around to doing an internship because I always felt I didn’t know enough. It was always “I gotta study Data Structures more” but with the onslaught of classes we have to take, there’s not much down time… I understand I’m partly to blame because i just didn’t know any better…but the university SHOULD know better and come up with a plan / curriculum that prepares us students for real life jobs better.\n\nNow I’m grasping at straws trying to figure out how to get my foot in the door into any job after graduation. We pay all this money and take all these classes and it’s basically just a paper slip that’s a prerequisite to get a decent job, but by no means enough. You need to have a ton of projects that you somehow do outside of class.",
            "fr tho, I have sm to do that by the time the next exam comes I've forgotten all the material on the previous exam",
            "I work full time and do school full time. Shits getting tougher and will probably have to drop to part time. It doesn’t help I didn’t finish high school (got ged) so I am doing language classes too. I’m just tired.",
            "Finishing general ed classes (liberal arts, politics and history) is very hard for a cs major who has to study DS&A, projects and internships. The classes surve no purpose and provide no value but are a requirement for getting your degree.",
            "It depends from university to university.",
            "Might be the first time you’re experiencing it, but this is very much life in general. It’s only going to harder. House, spouse, kids, career wait for no person. Big presentation and you have a hole in your roof, and its your best friend’s kids birthday, and your own dad is asking you for time to hang out….. you gotta figure it all out. 20 years from now, you’ll laugh at yourself at what you think is a large load. You’ll wish you had it like you do today.",
            "The problem is that building enthusiasm for improving your study skills and time management is hard, and we don't tell students to do this.\n\nYou actually don't improve by spending more time learning the content.  That's just working a double shift.\n\nYou only improve by getting better study habits and improving your productivity.  Achieve more with less.\n\nDon't study for 60 hours a week.  \n\nKeep a calendar, study for 40 hours.  And bring the coloured pens, markers.\n\nThen you'll have enthusiasm for the work. Because hey you'll have a life outside study AND be academically successful.",
            "University includes and you have to go through all:\n\n1. Professors talking..., talking..., talking...\n2. Professors reading PowerPoint slides.\n3. Trying to get good marks for your subjects.\n4. Everyone recommending you what is the best for your career, bla, bla, bla, etc.\n\nThe Professional Real-world is another story:\n\n1. Learning and understanding by mistake.\n2. Learning soft skills to deal with customers + coworkers.\n3. Have plan A, plan B, plan C depending on what you like most in your professional career, and stick to your plans to achieve it.\n4. Building experience takes time but you will get there.\n\nTherefore, no worries, passed your exams get the piece of paper, and move on to the Real-world to get experience ASAP.",
            "I have buy to only go t k this city develop"
        ]
    },
    {
        "post_id": "s7yrbl",
        "author": "frankturtle",
        "title": "hello from tiktok (Frank Niu)",
        "url": "https://www.reddit.com/r/csMajors/comments/s7yrbl/hello_from_tiktok_frank_niu/",
        "score": 565,
        "num_comments": 162,
        "created_utc": 1642621846.0,
        "selftext": "Hey I'm Frank Niu and I make tiktoks for fun. I've worked at a couple tech companies and am basically a full time dad now. Most of my experience was at large consumer tech companies like netflix, grubhub, and credit karma as a SRE.\n\nI've always loved reddit and have been an addict since University. Feel free to ask my anything about life in silicon valley, tech, or whatever else.\n\n**1 year edit: I released a book on my journey towards FIRE, called \"Retire by 30\". You can pre-order it at most major retailers.",
        "permalink": "/r/csMajors/comments/s7yrbl/hello_from_tiktok_frank_niu/",
        "comments": [
            "Man shows up on my fyp and now my Reddit feed too. Legend.",
            "No way Frank shows up on my Reddit feed too😭",
            "No questions but you are the absolute goat tech tiktoker. I don’t always agree with everything you say but you are by far the most informed/honest/normal tech tiktoker I’ve found.",
            "Hey Frank, what was the process for getting Hired at Netflix and after how many years of experience did u end up joining",
            "One of the only tech creator’s that doesn’t just talk about technology. It’s refreshing and encouraging to here about you as a person, compared to just hearing about your success in the tech industry; makes the possibility of success seem more realistic and human.",
            "Thoughts on 🍃?",
            "[removed]",
            "Frank did you ever give your thoughts on Whole Lotta Red/Carti? Haven't been on TikTok in a while and that was always a top comment.",
            "thoughts on the quantitative finance industry for SWEs?",
            "Advice to someone starting their first full-time SWE job?",
            "Any regrets?",
            "Any advice for someone just starting out their career? I have plans to purchase a home later this year and would like to start a family around my mid to late 20s.",
            "What do you think are the most exciting tech companies nowadays? Or, if you were looking for a job as a new grad now, what would your dream companies be?",
            "You type exactly like how you sound",
            "Love your tiktoks man you’re my inspiration. Any advice for newbie wanting to get into investing?",
            "Hey Frank, love your tiktoks. What made you decide to go down the SRE path instead of the traditional SWE path and stick with it? I feel like lots of people on here discount it as an option but it seems really rewarding if you enjoy the work.",
            "Thoughts on commuting to SF from the East Bay/South Bay? (or vice versa ig)",
            "What are your thoughts on these leetcode type interviews that these big tech companies conduct? Do you think there is a better way to evaluate candidates for SWE roles?",
            "You have to do technical interviews throughout your career to switch jobs, how much did you practice for each one?\n\nAlso, amongst your coworkers and network, which company seemed the best to work at in terms of their experiences?",
            "Hey Frank  Is it difficult to get into ux ui design with no experience? \nI’m a video editor right now and I’m teaching myself ux design, as well as studying to get the Google certification. I’m nervous I don’t have much experience asides from the projects I’m doing.",
            "[deleted]",
            "What do you think about all the \"Thoughts on 🍃?\"",
            "why do you not answer the “thoughts on 🍃” question",
            "Love your tiktoks man. You should definitely make a podcast.",
            "You've mentioned LoL a few times on your tiktoks, who did you main/what was your rank?",
            "Bootcamp recommendations for people trying to get into software engineering?",
            "Advice you would give an 18 year old right now",
            "How much did you save when you felt like you could retire?",
            "Love your content I’m a senior in college trying to pursue software development. \n\nWhat’s the most rewarding project you contributed to or solved?",
            "Do you think its possible as a CS Major to get a full time SWE role without any SWE internship experience?",
            "Thought about trying your hand at another startup? Maybe something non-tech related?",
            "I'm fresh out of highschool as an early grad so I still got some time but I have so many questions but I truly am fascinated by the SWE world and I've been doing my research. The further I look the more and more doubtful i grow because college is out of my budget and I feel like I won't be able to succeed because of it. But I've been looking Into bootcamps (I know you're probably cringing right now) but do you think a bootcamp is sufficient to Kickstart a career in the SWE world? I have already started the basics from binary code to intros in to Java and python. Bootcamp is my only option \n-\n[You are an inspiration to many young people and I appreciate your transparency in your content 🤙]",
            "Prove you're not an imposter",
            "Hi Frank, I’m Frank too. I’m in my last semester at Arizona State and getting a degree in Business Admin. I’m open to working pretty much anything, what jobs would you suggest i start looking at?",
            "[removed]",
            "What's a book you'd recommend",
            "Hey Frank, do you have any experience with people coming to work as SWE from abroad/poorer countries? Can you give me any tips?",
            "Frank, I watch your videos on TikTok. Your contents are interesting.",
            "Frank thank you for making some of the most unbiased opinions on all topics we’ve asked about on TikTok much appreciated :,)",
            "Best resource outside of school to study for Discrete Math for which is required for majoring in CS",
            "What percentage of your income did you save and invest in-order to retire at 30?",
            "God? Aliens?",
            "THOUGHTS ON/ ADVICE ON Public health majors pivoting into tech/CS for non public health roles",
            "Did you think you would do well as a tiktoker? As a technical person, do you think its hard to make it on social media like youtube/tiktok?",
            "Thoughts on DevOps?",
            "love ur content fam keep up the good work",
            "How big is the world outside full stack/front/back web dev work? Most positions I see are for that; are other options more competitive? Less?",
            "Any advice for seniors in high school leaving home and going to college soon? Like how is it different than high school what to expect?",
            "Hey frank, just followed you! What are your thoughts on quantum computers?",
            "Man u are on my fyp for ALL social media tf haha",
            "Is there anything you recommend doing freshman or sophomore year to better prepare for internship applications junior year?",
            "Is google SRE good? Any suggestion on new grad SRE? I’m thinking working as SRE-SWE for a year first to improve my design skills. Then switch to SWE if I don’t like it.",
            "Followed you a few weeks ago and your videos are really helpful!",
            "Your view on Snap as a company? Do they have a future because Tiktok is taking all their consumers?",
            "What are your thoughts on real estate investing in your 20’s?",
            "I’m having a hard time landing a summer internship. Currently an undergrad at a pretty recognized university. Made a website and think my resume is pretty good. Any advice?",
            "Hey frank I love your tiktoks! What are some signs an early stage startup will succeed? If they have 50 million series A backed by sequoia would that be safe?",
            "What’s the difference between SRE and SWE? Is it hard to switch from SRE to SWE within companies??",
            "Hey Frank! Appreciate your content. Any advice for someone who's about to enter the industry money wise? How did you learn how to invest? I feel like a lot of people go crazy with the crazy salaries, so I've been wanting to lay out a plan before I go crazy myself.",
            "Any advice for someone still applying and graduating soon? Thanks",
            "What are you looking forward to in 2022?",
            "I don't have TikTok but that's really cool. Which was your fav company to work at and y?",
            "Hi Frank, I just search your name on youtube and give you a subscribe :D Thanks for your advices though. Keep it up man!!!!",
            "I’ve been binging your TikToks for the past month you’re a legend",
            "High-level apprenticeship or university?",
            "What do you do now that you’re retired?",
            "Where should I save/invest my money as a new grad with a good FANG salary? My risk tolerance is very high if that helps.",
            "why havent u given your thoughts on playboi carti-sama?",
            "you are everywhere... love your tiktoks!\n\n&#x200B;\n\nI am junior in college studying computer science, I love web3 and blockchain technology. Do you think its a safe bet if I go balls deep and starts learning more about it or should I take the safe route and stick to grinding leetcode all day in hopes to secure a SWE job.",
            "I just wanted to say I love you",
            "Any tips or thoughts for someone that was lazy their first few years in college, but is doing well heading into their senior year? I just feel like I’m super behind with my gpa and programming skills. I also don’t have any internships. (Generic state school) love your vid’s btw!",
            "Why u clout chasing on reddit bruh dont u got better things to do? talking to a bunch of CS nerds on a forum is one of the last things i wanna do when im 30",
            "big fan, but this question has been bothering me for a while and did not stem from you. \n\nhow do we know what we consume online is objectively true? a big assumption people take is the niceness of the presentation and how informational/trustworthy the brand is (e.g. you). some youtube videos will have a bibliography which definitely authenticates they're content, in the sense that academia has peer review rigor to overlook potential errors. this is also assuming at least some consumers look at the bibliography AND call out the creator AND get visibility to other consumers.\n\npagerank roughly works on how long and how much people stay on a page right? so for things that aren't immediately testable (eg a better method for washing dishes video that you actually try to see if it works), the videos and websites suggested aren't really suggested for their accuracy.",
            "something you wish you knew as someone who’s just starting their CS journey?",
            "love ur tiktoks",
            "Is there anything you would consider coming out of retirement to work on?",
            "How much you charging for blowjobs like the one you’re selling?",
            "TikTok is a great spin off of Vine. Why'd Vine have to die? This is more a statement than a question.",
            "I love your tik toks, man. It’s truly amazing how well-read and informed you are about everything you post about. Keep posting the great content!",
            "Thoughts on open source projects and contributing to them?",
            "Show Pokémon collection pls",
            "I struggle in doing leetcode but can build applications like say a mobile app or a web app , is this normal?",
            "Hey Frank!! Thoughts on the job market in tech, how will it keep up with the influx of people coming in? Will it be able to keep up with demand or will it just become far more competitive?",
            "Frank I love the way you talk",
            "I applied ticked systems, platform teams  basically kinda of Platform, Infrastructure, Production engineering roles. May ik what can I expect in interviews, will they also be focused heavily on alog/ds or it will be bit different?",
            "What are your thoughts on cs taking over from an Econ major for university as far as compensation and ability to find a job",
            "How did you pull your wife?",
            "If you could go back in time, would you still choose to be an SRE or would you do development roles?",
            "You need to learn how to sell options correctly. It’s not picking up Pennie’s in front of a steamroller at all. That’s naked selling .",
            "Is it still possible to land an internship in college as a CS major if you have a bad GPA? Are there ways to compensate for this?\n\nAlso I saw you have an AWS certification. Would you recommend certifications like this? I’ve been looking into this more and more lately and it seems like it would help.",
            "RemindMe! 7 days",
            "Hey frank, im 17 making around 90k-125k a year from my crypto job(not compsci, social media management+help a friend with his crypto business, which im probably going to make more a lot more money in the future from) ,(all from my parents house in texas (which is very affordable), which i don't pay rent or own a car), and i just spent $250 on legos (lego porsche), i was a broke crypto nerd that hated spending money, but now just gotta a ridiculously good paying job, any advice on not buying dumb shit, budgeting and controlling myself but also living life and not staying in my room all day being a penny pincher(i used to do)?\n\n&#x200B;\n\nquestions\n\n1.should i save up for a house?\n\n2.invest all in crypto?($atom and cosmos ecosystem, which i made good gains over the last month, when all of crypto is down)\n\n3. buy a new reliable/fuel efficient car (some type of toyata or like a honda)?\n\n4.move out?\n\n5.get a GF?\n\n6.tell family/girls/people much i make?\n\n7. i got so many other question, lol im going to stop it here",
            "when u retired do u still have a lot of money to spend freely or enough to live comfortably",
            "[removed]",
            "Is it possible to get a job at a big tech companie wothout going to college?",
            "Hey Frank i'm kinda late lol, but would You reccomend CS Even if it's something i don't necessarily like? I'm just i'm My senior year of HS but honestly don't know what to do lol",
            "Frank if I’m in school majoring in IT software development, is it possible to land an internship in CS? Or is my internship restricted to my major? I wanted to get into CS, but due to financial reasons I was only able to get into a school that offers IT.",
            "Hey Frank, what do you think is the best career path for someone who really doesn’t know what they like but is fine with taking a path you did and retiring early even if it is working a job I don’t necessarily love",
            "Hi Frank, I am currently a sophomore studying computer engineering. What are some things I can do now in order to be on the path to success? I don't have any internship/research experience yet.",
            "Frank what do you think about not stopping at bachelors in comp sci and going for PhD in comp sci so that one can also do stuff in artificial intelligence or computer vision? Would those extra 4 or 5 years that goes into getting the PhD translate into being at Google possibly making 600k per year and working on computer vision research? I prefer that outcome over being a boring programmer but I am also afraid of investing that extra time and getting paid the same or less than a programmer that I could have been working as if I had stopped at the bachelor's level and started working straight away.",
            "I literally read this in Franks voice",
            "You're honestly inspiring me to do better in life. You seem (are) like such a well-rounded person and are presenting me with solutions for problems I have. I will do my best to put your advice into practice and better myself. Thank you, Mr. Niu. (edit- I have decided to learn python even if it has no benefit anytime soon. I would really love to see some of your work once I understand the language.)"
        ]
    },
    {
        "post_id": "lq4iqj",
        "author": "pepeman931",
        "title": "Anyone else get depressed looking at success stories on questions on this sub?",
        "url": "https://www.reddit.com/r/csMajors/comments/lq4iqj/anyone_else_get_depressed_looking_at_success/",
        "score": 565,
        "num_comments": 89,
        "created_utc": 1614040237.0,
        "selftext": "I honestly feel good for your success but every post is Amazon offer this,  Amazon negotiating that, Amazon internship this etc.\n\nI think its completely okay for you to post like this on this sub but I was wondering if I was the only one depressed that I have nothing.",
        "permalink": "/r/csMajors/comments/lq4iqj/anyone_else_get_depressed_looking_at_success/",
        "comments": [
            "The master has failed more times than the beginner has even tried",
            "Keep in mind that this sub is not representative of the CS population as a whole. Most folks on this sub come from highly competitive backgrounds so what you witness here is a skewed worldview. You’re doing fine, don’t give up.",
            "Luck plays a huge role in Amazon interviews, some people literally got stuff like two sum, reverse a linked list, merge two linked lists, while others got LC hard and mediums.",
            "Yep. 600+ apps in, 60+ interviews, 0 offers. (for summer 2021) - Still in final rounds but we will see how things wrap up.\n\nI hate life at the moment but it is what it is. (Yes, I'm actively taking efforts to improve myself but that has killed my self-esteem.)\n\nI don't even associate my career with self-esteem but getting the door shut on me 60x in a row has been brutal. Plus couple that with being a FT student and intern at the moment, I am dreading my life (and sleep schedule).",
            "Don’t visit this sub until you get an offer.",
            "https://xkcd.com/1827/",
            "The only person you should be comparing yourself to is yourself.",
            "NGL, I went numb after a few failed interviews. The interviews went perfect according to me but not according to them! Until December I would rant a lot to my friends and family, cry my eyes out that everyone around me is getting what they want but WHY NOT ME. And then came January and I was just so involved, I somehow shut every emotion I knew. I realised that talking to people about stress was making me more stressful so I started shutting everything off and putting all the free time into applications and connecting with people on LinkedIn (reached my weekly limit lol). And then I finally had an offer but ykw I didn't shed a tear (did it for the location though :p) \nI'm talking about all this bc I just want to tell you \nWhat doesn't kill you, makes you stronger! \nFeeling stressed and depressed is natural when everyone around you is raving about getting a job, not letting that affect you is in your hands. \nPeople talk about their offers, no one talks about their journey. To feel depressed bc of these success stories, be ready to live every moment of their life in their shoes. Be ready to give up your whole being and existance to be someone else. Everyone has a different story and struggles and hence a different timeline to success. Someone getting a job at 20 doesn't mean everyone should have it at 20. We wouldn't know life like we know rn if everyone and everything was the same. \nHave faith in your journey and in yourself.  \nNo one can take what's meant for you (bc it's not meant for them).",
            "Amazon",
            "Yes, I feel you. I'm a freshman and still feel a bit demoralized. Not because of these people getting offer, but just in general, seeing all the competition and rejections.\n\nEdit: Thanks for all the inspiring words guys!",
            "I'm not jealous of the Amazon internship, just the diligence it takes to get there. I detest Amazon as a company and I would refuse to work there even if I had an offer in hand right now. People who have the dedication to apply over 600 times to internships...that's admirable right there. \n\nThe only thing about this sub is how high the standards are here. People here expect 2x or more from themselves than the comp sci people I know IRL, and during a time when it's wayyyyy harder to achieve those results. This sub is inspirational in a way, but also incredibly discouraging if you don't know how ridiculously high the standards are here. Don't let this be the only place where you get advice about your major. Professors, classmates, and school advisors will likely have much more realistic expectations.\n\nThis major is literally one of the most in-demand majors, and the salaries and benefits are very reasonable. Now, is it the end of the world if you get a non-FAANG job that pays the bills and doesn't drive you insane? Up to you. For me, no. Anything else is just a bonus",
            "Dude this sub is just filled with kids from top 10 schools chill",
            "Pretty sure you're not alone. Me myself was pretty depressed when i first joined reddit, not just this sub. I joined several subs and it seems like almost everyone is easily in the ivy league colleges (mit, harvard, kaist, u name it)\n\nFeels like everyone can easily work for NASA while im struggling with programming fundamentals lol",
            "Last semester I got more interviews that I’ve ever had in the past. I got to the final round for all of them and got rejected by every single one of them. Then I randomly heard from Google and a couple of weeks ago I got an internship offer from them. Failing all my last round interviews last semester really crushed me and I was depressed when I saw all the success stories. But looking back now it all makes sense that I got rejected from all those other companies so that I could get a job in my dream team at Google. Chin up you got this!",
            "people dont post their failures (except me the one time i came on this sub to make a post very similar to yours lol). i gently recommend not idly browsing this sub and spending the time on learning new skills, honing old ones, and rapid firing applications because that's what worked for me. try hopping on a project that requires a skill you've always wanted to learn!\n\nit may seem rough now but keep at it and eventually you'll come back to this sub to post a success story of your own!!",
            "I'll just work on a project on my own if I don't get an internship by the end of my sophomore year. I mean ANY internship, couldn't give any shit about FAANG",
            "I got my offer after failing 8 interviews. Never give up. Keep going. And it's okay if you don't get into Amazon. I didn't get into Amazon, but that's okay.",
            "Amazon",
            "yes",
            "All those rejections just pile up to make your first offer much sweeter",
            "Yep. It made me leave it.",
            "yes. I want to kill myself.",
            "Fuck Amazon, few months in and I'm being pipped. Trust me not worth it",
            "I'm 35, have been working since my late 20's, am only here to help people who might need some perspective from someone who isn't a student themselves, and even I still get depressed seeing all these posts from people getting further ahead in their careers from an internship than what I'll ever accomplish in life.",
            "Amazon",
            "Amazon",
            "Amazon is not what I would call success.",
            "Lol, ur amazon kid is probably earning less than half of what I earn trading the stock market from home. Success isn’t about your income.",
            "Keep your head up. I've put myself in your position so many times. Keep working hard and things will start to look better. It's taken a few years, but things got better for me. Have hope",
            "That was me in 2019. It gets better don't give up.",
            "CS has opportunities that can take you in almost any direction you want. Success comes within. I know people who are in the big tech industry who are stressed out. It's highly competitive and you have to be on your game all the time. Opportunities are there but since the pandemic happened you have many people who are trying to push through at the same time. \n\nUnfortunately, those who possess more experience, where they went to school and GPA will be at the top of the charts before anyone else. It's terrible when someone submits their resume and you're thrown into a lottery pool. You start to think, are CS jobs available or are there too many people applying? There's a lot of good advice in this posting.",
            "today I was told by my professor to give up and withdraw from the course . But it subsequently motivated me and",
            "This won’t be relatable to you at all but I’m literally a music student who applied for an amazon studios internship and googled what the stages on my account were so many times that now Reddit notifies me of this subreddit even though I’m not a member. So you’re a way better coder than at least one person on this thread!!!",
            "Try to use your sadgeness to fuel you into wanting to one up the folks flexing their success here"
        ]
    },
    {
        "post_id": "qyo3c7",
        "author": "kuryu4",
        "title": "My interviewer was founder & president of his schools leetcode club",
        "url": "https://www.reddit.com/r/csMajors/comments/qyo3c7/my_interviewer_was_founder_president_of_his/",
        "score": 560,
        "num_comments": 52,
        "created_utc": 1637472800.0,
        "selftext": "God help me.",
        "permalink": "/r/csMajors/comments/qyo3c7/my_interviewer_was_founder_president_of_his/",
        "comments": [
            "Tell him you prefer HackerRank.",
            ">  founder & president of his schools leetcode club\n\nthat's one way to make sure you never get laid",
            "I didn’t even know such a thing existed lol",
            "I find this weird and puzzling , how did the conversation even go there lmao ?",
            "he should’ve done codeforces and ICPC. leetcode is lame in comparison and only serves to do well on SWE interviews",
            "lol good luck.",
            "Don't understand the hate for him doing leetcode, if he likes it and wants to found a club who cares.",
            "Honestly I'd respect them less for it. Anyone actually smart would be doing icpc instead; a leetcode club would exist entirely for career purposes.",
            "You love to see it…",
            "Pray he was from North Dakota and had a class of 5 😆",
            "It's always the younger engineers that like to flex on you",
            "Lame ass",
            "Why will you do shit like that instead of working on interesting projects. What a waste of education.",
            "[deleted]"
        ]
    },
    {
        "post_id": "k5nd9h",
        "author": "jonahc18043",
        "title": "If you don’t have an internship next summer, everything is gonna be okay",
        "url": "https://www.reddit.com/r/csMajors/comments/k5nd9h/if_you_dont_have_an_internship_next_summer/",
        "score": 568,
        "num_comments": 61,
        "created_utc": 1606959013.0,
        "selftext": "Y’all worry too much. You’re gonna graduate with proficiency in possibly the most important skill on the planet. Everything will work itself out.",
        "permalink": "/r/csMajors/comments/k5nd9h/if_you_dont_have_an_internship_next_summer/",
        "comments": [
            "I am a senior and no internships. I’ll graduate next fall",
            "Yea don’t get this sub get to your head. It’s full of people who go to top 5 schools or top 10 schools. Some of them sadly have inferiority complex like one guy who went to a top ten school and said his school was a bad school lol. Folks at those schools have companies show up to career fairs that don’t even show up to career fairs at any other schools. One guy I know was a sophomore I think at a top ten and Apple came to his job fair and give him an internship. He refused because he thought working there would be boring. Fucking hell lmao",
            "I agree, but it's tough in the job market. Especially for grads, having at least 1 internship really sets you apart during resume screens.",
            "*me immediately after getting an offer*",
            "I had no internships in college and vividly remember it feeling like the end of the world senior year. Still locked down an offer, have a friend that did the same. So seriously don't stress about that because you can't change it, stress the things you can change like applying to a ton of places and practicing both for LeetCode and behavioral questions. Good luck everyone!!",
            "thank you :(",
            "Nah, you will get an internship and you will be successful that better. Too early give up you 6 more more months.",
            "I love you",
            "Don't give up applying and interviewing! It's definitely not even close to too late to snag a great internship :)\n\nRecruiting season's not over till June!",
            "If you don’t get an internship, work on campus if possible. Maybe as a tutor. Hopefully as a research assistant. Even if you work for free. Crash on a friend’s couch like I did :) it’ll be ok!",
            "Thank you for the reassurance.",
            "I graduated in the spring without getting any internships. I tried every summer with increasing panic till I graduated with no success... I remember my University's career center telling me that with Covid-19 finding a job could take up to a year.\n\n&#x200B;\n\n6 months after graduating, 5 months after quitting my crappy retail job, and after countless applications and a handful of interviews I got a job offer. Just keep at it. If you have a retail job or something similar just make sure to save money for that transition period.",
            "Live long my friend!",
            "Just do some side projects and honestly enjoy your summer. Interning can eat up your summer so you have the chance to fill it up with something else. You’ll land an internship/job when it happens.",
            "Anyone who doesn't have an internship perhaps work on some interesting projects to put on your resume that involve technologies that the jobs are looking for.",
            "Next thing I am going to hear is \"no need to study, you will get a job anyways\".\n\nYeah no internship is not that big but it won't be a walk in the park and you know it.",
            "Unless your a senior who hasn’t landed at least one internship in your 4 years at college. If that’s the case then you’ll be getting your butt whooped by folks who have in the applicant pool",
            "I'm a freshman with no internships and feel really sad :( I think I could have done some really nice work if I had an internship... But trying to console myself that everything happens for a reason, and everything will turn out alright.",
            "[deleted]",
            "This is really nice, thank you.",
            "Freshmen and sophmores need to hear this."
        ]
    },
    {
        "post_id": "116kr4q",
        "author": "Jayjay_loves_Jesus",
        "title": "what the fuck",
        "url": "https://www.reddit.com/r/csMajors/comments/116kr4q/what_the_fuck/",
        "score": 563,
        "num_comments": 33,
        "created_utc": 1676832852.0,
        "selftext": " [How Levels.fyi scaled to millions of users with Google Sheets as a backend](https://www.levels.fyi/blog/scaling-to-millions-with-google-sheets.html)",
        "permalink": "/r/csMajors/comments/116kr4q/what_the_fuck/",
        "comments": [
            "I wonder if you can make a website with an excel file as a db. New project idea anyone?",
            "Based",
            "you can scale a read-mostly, latency tolerant workload to the moon with a little caching.",
            "My next system design interviewer is in for a treat!",
            "If it ain’t broke d0n’T fiX iT",
            "If it works it works.",
            "That's pretty awesome. I love how they kept the business goal front and foremost, and used and iterated technology to serve that business goal. \n\nWay too many startups, e.g. everything mentioning \"crypto,\" have it backwards.",
            "My project of using Excel as game engine is now finally approved",
            "I saw this. I worked at Facebook for 8 years (where believe it or not, they take privacy very seriously). The first thing I thought of was how they kept this system secure. Google sheets doesn't exactly have per-row permissions, audit logs, etc...  One employee creates a share link and you are in major legal trouble.",
            "Yes, this 5 year trend of always scaling and adding levels of redis and queues and whatever is stupid and feels more like people build things to build things\n\n&#x200B;\n\nmany many normal popular websites could be 1 simple datastorage + a BE framework",
            "I mean, you can request a db for months or just use that excel pre installed...",
            "I don't know if it can handle things forever.",
            "stupid title for a post\n\nit says nothing about the actual content \n\nand what does the content have to do with majoring in CS anyway ?",
            "How is it possible",
            "Well I guess if you manually write a data structure it should be good (B+ tree)",
            "I hate this website I don’t understand why so many people use it. Their numbers are always wrong."
        ]
    }
]