[
    {
        "post_id": "p5opln",
        "author": "GreenYoyo11",
        "title": "When in doubt... Hashmap",
        "url": "https://www.reddit.com/r/csMajors/comments/p5opln/when_in_doubt_hashmap/",
        "score": 562,
        "num_comments": 71,
        "created_utc": 1629146648.0,
        "selftext": "Change my mind: most OP data structure when it comes to coding interviews\n\nUpdate: did not expect this post to get upvoted so much and awarded, thanks so much 🙏",
        "permalink": "/r/csMajors/comments/p5opln/when_in_doubt_hashmap/",
        "comments": [
            "Was in an interview and the company asked me to look at some of their code to see if I can figure out what it’s doing. I had no idea what it did. But I did notice that they did something with a nested for loop and I told them they could use a hash map instead. Got the job",
            "Nested for loops, most OP technique, idc if o(n^4)",
            "Yup. Hashmaps are powerful for most data structure situations. \n\nEasy to store info. Easy to retrieve. Overall very useful.",
            "Is hashmap the same as a map?",
            "Thank you Nick",
            "most op data structure is the [tardis monad transformer](https://hackage.haskell.org/package/tardis-0.4.3.0/docs/Control-Monad-Tardis.html#g:2) change my mind",
            "Hashmaps store by keys and values,\n\nO(1) that speed'll wow you",
            "Fake news, I tried this in an interview and it backfired big time.",
            "Heaps also come in clutch - prolly less common though",
            "Word",
            "Amen to that 😅",
            "Needs moar lambda.",
            "[removed]",
            "Ok",
            "Exactly! I have around 1 year leetcoding and most of the times when I struggle to solve a question I try to figure out how to use a hash map to make it easier."
        ]
    },
    {
        "post_id": "1cfdqv2",
        "author": "aquasain69",
        "title": "Why are cs majors cooked?",
        "url": "https://www.reddit.com/r/csMajors/comments/1cfdqv2/why_are_cs_majors_cooked/",
        "score": 561,
        "num_comments": 279,
        "created_utc": 1714330105.0,
        "selftext": "I am considering doing cs and I’ve been seeing memes and videos about cs majors ending up being unemployed.Why is this the case and is it actually true?",
        "permalink": "/r/csMajors/comments/1cfdqv2/why_are_cs_majors_cooked/",
        "comments": [
            "Like everything else, the CS job market ebbs and flows. A few years ago you could get a job by fogging a mirror, with nearly no CS education or experience. With the recent, massive layoffs there are thousands of people with BS degrees and good work experience looking for jobs. Now there is real competition for attractive job openings. The era of boot camps is pretty much over. If you don't have a degree, things are pretty bleak right now. If you go to a good school, land some internships, and get good grades you should be fine. Although the bar has been raised, there are still a lot of good jobs out there.",
            "Good that people are noticing 😂. We should make more of these in TikTok and other platforms so more people notice. Then a few years from now, we'll be getting huge salaries.",
            "Apart from the interest rates, IMO a couple big reasons why so many CS grads are unemployed:\n\n1) university CS programs grew too large. At my alma mater, in 2020, CS was the second-largest major right behind biology (which was our pre-med factory). \n\n2) lots of them are straight up unprepared to become professional software engineers, usually due to lack of professional experience but mainly due to lack of soft skills. These students cannot pass the behavioral portion of interviews. Think of the average redditor, and... yeah... that's not the guy you would want in your team",
            "The tech market crashed at the end of 2021 and has barely started recovering, there's just fewer total jobs than there were at the starting point of the crash.  Some regions are worse off than others though.\n\nCombined with that is the fear that AI will take all our jobs and there's just a huge amount of negativity and fear with joining the software industry right now.",
            "secretive overconfident deliver attraction normal soup start alive political instinctive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "markets not great rn for CS students (or anyone looking for a job tbh) but also people on the internet are exceedingly negative. I expect it to come back to normal when interest rates drop",
            "When I am asked to interview a candidate, I ask them to code a very simple app.  At first, I was embarrassed to give them the coding assignment because I was afraid it was too easy and that they would feel it was an insult to their intelligence.  But then I would see so many candidates from top tier schools struggle with it.  Of course, I cannot recommend that they proceed with the hiring process.  I’m not sure why that is.",
            "They’re not, the market as a whole is slow rn but tech has always been feast or famine. this sub is just really cynical because it’s where the lowest common denominator goes to complain.",
            "It's over saturated, people have to apply for 1,000+ jobs just for a interview if they're lucky, mass layoffs across the board, and there is no hope of any recovery. It's nearly impossible to get an entry level job now and it'll stay that way for the far future with no recovery. You're better off majoring in something in the medical field were there's always going to be jobs.",
            "Just go to San Francisco and see how the streets are filled with homeless cs majors",
            "Oversaturation of the market. Simple.",
            "Don’t yall get tired yapping about how cooked or how saturated the market is? If you’re all this worried please switch majors 💀",
            "Mass layoffs and the rise of AI. Why hire when you can AI generate code?",
            "Cooked",
            "Don't read into other people's BS. Be hungrier and harder working than others and you'll find success in life. Not sure if you're young enough to be able to relocate, but that makes things infinitely easier in life.",
            "Most people saying cs is cooked skated by with Cs never took internships or developed any connections. If you actually put the work in you’ll be more than fine",
            "it’s still fine, as long as you’re networking, have decent grades, and do extracurriculars then you’ll be able to land internships, which in turn allows u to get a full time job. it’s just not *as easy* as it has been, but still VERY doable",
            "I don't know what's going on in the us but I know many employers in Europe who are trying to hire experienced people and can't, because there aren't enough.",
            "Job market is a market, it’s a never ending positive to negative trends",
            "Read through most of the comments and have a few additions I saw missed:\n\n1) Pre-covid many major tech companies would hire programmers not because they made they would necessarily lead to a direct profit from their work but because they wouldn't work for other (competing) companies. When the interest rates went up and money became more scarce, these companies dropped everyone who wasn't making a profit anymore; therefore, all the rest of the companies felt better dropping these employees too. This is why it seemed like every major tech company was laying off thousands of employees left and right. This means that suddenly the market was flooded with a bunch of ex-FANG employees that recruiters may misconstrue to mean they are better than non-ex-FANG employees.\n\n2) Ghost Jobs, job postings that will lead to a job for nobody. There are a couple of reasons someone might make a posting like this (Scraping Resumes for data or collecting resumes for future similar openings, to name two). The existence of these causes people to be much more likely to apply for a ton of positions without reading all the position requirements; or, as we are talking about CS majors, just spam apply via AI. This means that a legitimate recruiter might get 1000 resumes for a single position but most they wouldn't even consider. They then may need to manually filter through to catch people who automatically optimize their resumes with an AI based on the job posting. Jamming up the whole process.\n\n3) Foreigners (non-US citizens) looking for green cards. In the last paragraph, I said 1000 resumes, which may only be 1000 resumes from people who are legally allowed to work in the country, they may get an additional 1000-2000 from various other countries that wouldn't be able to work in the country. Again, slowing the whole process.\n\n4) CS is a relatively new but relatively (internally-)specialized industry. If you are hiring someone to program OS stuff in low-level C you don't want them to only have worked in Scheme before. As interest rates are higher and there seem to be lots of applicants, companies are more likely to try to hire someone who already knows most of what they need to do the job rather than having to spend 50-100k training someone. (This honestly might get worse since Congress recently banned effectively all non-competes, so you may end up training someone who sees a higher-paying job at a competitor)\n\nAll this means that life sucks for everyone here, job finders have to apply to hundreds of jobs to find one and recruiters have to look through hundreds of resumes to fill a position. And recent graduates with little experience aren't in much demand. But hey, at least you're not me who has had no job experience since a college summer in 2019 due to chronic health issues, and the only recent work I've been is only effectively Master's Degree level personal research projects that nobody is going to see as being worth shit.\n\nTLDR: Don't get into CS if you are doing it for the money, it's unlikely to be any better than any other STEM field anymore. If you enjoy programming you should be able to do well and get a job though.",
            "There are two misconceptions repeated in this sub.\n1. Jobs grew on trees for juniors before. \n2. Jobs require pedigree now; anyone below {arbitrary benchmark} is fucked. \n\nThe truth is that your school (or even the fact that you went to get a CS degree) has almost nothing to do with how well you perform as an employee. It's an almost entirely different skill set. People applying to a thousand jobs are doing something wrong or are overweighting their experience in 2023. Anecdotes come from unreliable narrators, and you don't know what else is holding someone back",
            "Outsourcing, Tfws, excessive supply vs demand, and soon AI will be the nail in the coffin.",
            "Years of experience or a degree wont guarantee a job like other careers. You will always be fighting for your place one way or another.  Obviously depends on your domain, industry, social skills, etc..",
            "This is pretty grim and it’s something no one is talking about. A lot of tech jobs are moving overseas. Developers in India, Eastern Europe, and South America have become far more east to access and cost a fraction of an American software engineer",
            "Too many people, literally other fields are gagging for students, why would you join this oversaturated dumpster fire of a career.",
            "You’re hearing the loudest minority",
            "Because pretty much everything in America is cooked and 99% of the people posting those threads are Americans. I’m from EU and I’ve landed a programming job straight out of university without even completing my major. Sure I’ve been lucky but the situation outside of America is vastly different.",
            "They’re not",
            "The job market is genuinely ass for everyone right now. I’d still rather do computer science than anything else though, so it is what it is.",
            "I think the mass amount of concern here isn’t with CS but rather just the job market in general. It’s garbage in all sectors (tech and non-tech) so it’s hard to get a job anywhere without it being super competitive.\n\nI’m in a complete different industry using my degree to put down solutions unthought of. Learning from this to hopefully apply to a larger, more tech-orientated organization. It’s also great to apply the methodologies from CS into these other fields. It allows me to think more creatively out of the box!\n\nJust keep pushing! You got this! Just like anyone else in this sub! Go the extra mile, we’ll make it!",
            "Think it’s in a similar place mechanical engineering was a few years ago. Everyone said they were in high demand with high pay so everyone goes for mechanical engineering then it turned to experienced mechanical engineers were in high demand with high pay. Same thing here I believe",
            "Better to go in other non cs fields. Jobs in cs won't be same like it used to be before.",
            "Nope, it's just normalizing like other degrees. For a time it was \"too good to be true\". 6 months bootcamp and then getting six figure job made no sense, this is just a normal correction. It's not more saturated than any other field. I think it's just going to slowly become like Law or Finance, where there's a higher amount of graduates and your university matters much more than before. Think that this is how every profession goes, for a time becoming a lawyer wwas an automatic guaranteed of a high paying job with not too much competition, as people realized this was a possibility then more and more started to enroll in law, and now you have the present moment where you can certainly make a lot of money but you can also find yourself unemployed or with a meager salary.",
            "Idk what's going on for other people but I just started a new job, applied for maybe 10-15? I wasn't desperate because I already had an ok job, and I got 2 offers. It just takes time and careful study of who you're applying to. I can guarantee the people who say they are applying to 1000 jobs aren't tailoring the resume and cover letter to each job and marketing themselves to what the company wants.",
            "CS majors are still one of the least regretted majors. Just sit and wait till the market returns soon.",
            "Outsourcing ruined everything",
            "Markets crash and recover. I’m currently going for my CS degree and I try to keep my eye on the job market. It seems like the job market is in the early recovery stage and it will take a little bit to get back to a healthy spot. I could be wrong though. \n\nBesides that, it seems like a lot of other fields are struggling too. I currently work in healthcare, laboratory to be specific. And we ALWAYS need people. But the big wigs don’t want to hire more people so they are running on thin margins. Basically we were told that if someone leaves, they aren’t refilling that position. Even though we need it. It’s all about money at the end of the day. \n\nEither way, tech is not going anywhere unless something apocalyptic/catastrophic  happens. I feel like the best thing you can do is get your degree so you have a one up. After that, just focus on being adaptable and improving your skills. Take what you see here with a pile of salt.",
            "Too many people in CS right now, also when you graduate you’ll have to compete with the FAANG layoffs in entry level positions that require 5+ years of experience",
            "Why do you want to do CS? Is it because you’re intrigued and deeply interested in CS problems and mathematical logic and love problem solving? Or is it because it’s the trendy thing to do and a great way to make some cash?\n\nIf it’s the former then don’t worry you’ll be fine.\n\nThe market always has good times and bad times. Right now interest rates were just raised substantially which damaged the market. But it will recover.\n\nSoon with the AI boom we will become even more productive than ever and demand for software engineers especially high skill software engineers will boom.\n\nThere is no need to be afraid. Especially if you haven’t even started your degree yet. That’s plenty of time for the market to recover.\n\nRemember that people mostly don’t make a thread bragging about their success. Reddit has a selection bias and it’s mostly people posting about failures.\n\nThe unemployment rate for software engineers in the U.S. is below the national average unemployment rate by a significant margin.",
            "Videos take months from idea to edit to produce. What was true 6 months ago isn’t true now.",
            "Multiple things adding up:\n\n1) Investors are now being super anal about tech companies and their finances. Previously hiring was good for a company because it showed that the company was growing; this made investors happy. A result of this is that many, I'd even say nearly every, big tech company over-hired. Because of the current state of the economy, companies are now laying off the extra headcount they've previously hired; flushing thousands of very qualified engineers into the market. These mostly include people that were hired for projects that the company is no longer pursuing (cough Google and their 100 projects), people that provide the \"least\" value i.e. lower performers or junior engineers that are easier to replace, etc. \n\n2) There's been a large economic shift towards AI; this caused a lot of big tech companies to shift their focus to AI and drop any projects that aren't immediately profitable. A good example of this is Google + Facebook shifting their hiring to Data Engineers, AI engineers, and people for their main apps (FB, Youtube, GSearch, Meta, and IG). TLDR, any high demand projects have headcount but positions for one off projects were completely eliminated.\n\n  \n3) Lots of companies are offshoring; I've seen this happen increasingly across almost every company. There's a ton of incentives to hire people from India, Latin America, and Ireland + it's much cheaper to hire people there. An example of this is my company which has nearly shifted 90% of our openings to roles in Dublin. \n\n  \n4) The reduce in headcount, the offshoring, and the layoffs of capable engineers made the job market absolute hell for new grads/people in general. There's so many junior engineers available in the current market that most junior eng roles are filled up + team match hell is back for alot of big FAANG (i.e. being stuck in team match until app is closed). There are almost zero available roles for people with under 3 yoe at the moment.\n\n  \nAll that said, I do think the market will turn up eventually. Tech is still the most valuable asset in the current market. If you're really into programming, I'd still learn programming. The job search isn't too bad if you make an effort to network and build your portfolio like others here have mentioned. You can build apps and put them in the Google play store for example. There's always a pretty good demand for mobile engineers and having successful apps make you stand out.",
            "You can, but then, you’ll be competing with a lot of people. You’ll be competing with the people who graduate same time as you, as well as people who haven’t gotten hired from 1-3 years ago",
            "I feel like the tedious and annoying jobs. Related to webdev, UI/UX and maybe cybersecurity will disappear with time but I can't imagine the core \"computer science\" parts being effected too much. Programming desktop applications, drivers and so on doesn't seem like something you would want AI to do. Sure you can use it for certain applications but you won't be completely reliant on AI for those.\n\nAlso, I believe atleast this level of \"cleansing\" was necessary. Too many people with subpar fundamentals who just join frontend, UI/UX and so on because of the attractive salary while having terrible experience. I feel like these are the same people making fuss about how the work load is too much and whatnot. If you are experienced enough, you will know how to handle a certain degree of workload. If you aren't experienced enough then you will take a LOT of time and effort to do the same thing. This is fine but it isn't good when this happens for things taught in college elaborately.",
            "CS used to be really lucrative from 2018-2022, even in my uni back in 2012 the advisers used to steer student out of CS due to how unpopular it was, you can even look up zuckerbergs speech in harvard in 2006 to see how low the interest was in that subject. Now years of seeing \"lucrative vloggers\" vlogging their jobs into google and seeing how the company culture in google was shown as fun and the income being stable, everybody jumped into CS. Now you got this over supply of candidates + AI is actually playing a really important role as well, even as student you can see yourself relying on chatgpt and such, some big compnaies have their own model to work in-house only reducing the needs for people to write codes, the person who knows which direction to go in can now just use AI to write code and make some corrections.",
            "The sad truth is that a lot of CS majors are not actually good enough to hire. The schools can't 'give' them coding abilities if they're not actually very interested in coding, and employers  know how to weed out the useless ones. They have a hard time finding a job because they don't actually have the skills quality they should have...\nI'm on the hiring team for our team in a large international company, and a rough estimate is that 50% of CS majors are useless... 😣",
            "Well I graduated in December and I currently work at a fried chicken restaurant so do with that what you will",
            "CS is experiencing the first real lull in 28 years and people just normalized calling it the best industry on earth for almost 3 decades",
            "People rely just on their degrees and are otherwise completely incompetent.",
            "Just don't blindly jump into CS. I've been telling this to people since pre AI and pre layoff era. Nothing in this world remains as an easy hotcake forever. People have been crazily left their profession and jumped into coding. The market is over saturated by partially taught coders. And here goes the AI code generators. So, jump into a different hot cake until that also loses its heat.",
            "From what I read it's back more to a \"normal\" job market like in most fields.      \n\nIf you get a good degree you'll find a job, if not you'll struggle more.    \n\nAnd tbh a lot of complaining is on an incredibly high level. If you have the expectation to get a 6 figure fully remote job straight out of college with shitty grade and no internships: life is gonna be tough",
            "I'm gonna humble myself here and say that I went to the type of school that will take anybody. I wasn't expecting to graduate and immediately land in a $100,000+ silicon valley dev job, I just wanted some place to start.\n\nWell, I worked full-time and did my degree and eventually I finished. Toward the end I applied for a few dozen different spots that seemed low-level enough to warrant an application. Rejected - but that's fine... Maybe things will improve after I've graduated and I formally have that credential.\n\nWell, it didn't turn out that way. I've applied for hundreds of jobs, and generally low-hanging fruit. Job listings that advertise less money than a menial job. I get rejected every single time. And I know the default response to hearing this will be to criticize my resume but I've had it looked over by several academics and they all said it looked as sound as I can make it.\n\nI think if you do CS at a top school and manage to land a few internships, you'll be okay. But we're definitely past the days when learning to code was a path to a career.  \nI honestly feel that in terms of career prospects I might be better off with something infinitely easier like communications or business. I'm getting rejected for help desk jobs that advertise like $15/hr.",
            "Yes we cooked",
            "A think major part is social media and these influencers bragging about 2 hr workday and 6-figure salary. Kids can be easily influenced, and now we have over-saturation.",
            "Life is full of ups and downs. I have been in the CS field for almost 26 years. Seen a lot. Don't worry, do CS if you want. Right now things look bad, but it will be better in some time (don't know when). I remember a time in 2001 when people said all jobs would be shipped to India. That happened a bit but jobs came back too. \n\nFYI: My son is a CS major in a top 5 school. I tell him to stay the course. My daughter also wants to do CS. If you love it, do it. It is fun and lucrative also.",
            "Basically the CS job market was way way way better than other majors, then after the interest rate hikes it dropped to just being way better than other majors",
            "So here’s the scoop. Nearly all of software engineering, which is a white collar working class job change my MFing mind, is plagued by boom-bust cycles typically driven by overpromising tech bros and brain dead VC funding. Corporations also have a tendency to not want to spend a dollar and will fire you to save their own ass when they’ve misled the company direction for a year or more",
            "It’s not *that* bad. \n\nIt’s tougher, you won’t be handed a job. I think, anecdotally speaking I don’t feel that school has been particularly successful at preparing me for what comes after graduation. \n\nI have to put in a significant amount of time and effort outside of class work, projects, and homework to refine my skills and understanding things like, for example, data structure familiarity and how to realistically implement algorithms into my projects. \n\nI do truly believe that as long as you stay dedicated, work hard, and continue to refine your skills, you will find some success when you graduate. I do plan on moving back home though, once I graduate, to apply to jobs and not worry too much about not being able to take care of myself or accept an awful job just to make ends meet.",
            "It’s not. The people you see whining online are in the left tail of the skill distribution and are finding out the hard way science and engineering are a meritocracy. Ironic that these people say they should have gone into medicine when they likely would still be in the left tail for that discipline and medicine is even more cutthroat",
            "The market is oversaturated with job seekers, also companies are squeezing as much value as possible from software devs.",
            "They're not. Stop paying attention to Reddit. These subs are filled with California college grads who thought they were gonna walk into a job making 200-300k out of college and now that they can't get hired at Google, the sky is falling. If you're willing to take a job making a \"measly\" lower six figures to start your career somewhere other than the Bay Area, you will be fine.",
            "You ever seen the meme about shooting glocks at night in nice neighborhoods/apartments to lower the rent?? That’s what’s happening here",
            "Section 174. Trump.",
            "I didn't see the subreddit name and thought CounterStrike majors were cancelled or something",
            "I don’t think it’s cooked forever. If you are looking for a job right now and need to start working soon then you are in a bad spot. But even in a good economy / job market that’s tough. Most people I know that are graduating and started applying for jobs 1-1.5 years ago all have jobs. It’s the people that have been applying for a couple of months that aren’t hearing back. But I’m sure things will change in the future, and the job market will pick back up… and eventually crash again.",
            "Nah it’s because they don’t have a passion for it and can’t get past the interview phase.",
            "Are they? I found a job within 3 weeks after graduation (I had two offers). Took me 7 years to finish a 3 year CS undergrad. Never did an internship, board year or whatsoever. I live in the Netherlands though.",
            "Because all of the kids that join CS because of money and not love of the craft are absolute dogshit.",
            "It's getting so much satuared!!",
            "Chatgpt and other automation tools will eventually make cs jobs obsolete.",
            "Don't read these subs ffs",
            "Because they say shit like \"cooked\" unironically"
        ]
    },
    {
        "post_id": "17dzrva",
        "author": "jakegag5",
        "title": "Got myself a SWE intern offer.",
        "url": "https://www.reddit.com/r/csMajors/comments/17dzrva/got_myself_a_swe_intern_offer/",
        "score": 561,
        "num_comments": 52,
        "created_utc": 1697999194.0,
        "selftext": "The technical interview was the easiest thing I’ve ever done, questions were like: “describe a stack”. I can barely even do leetcode but at least we got one!!",
        "permalink": "/r/csMajors/comments/17dzrva/got_myself_a_swe_intern_offer/",
        "comments": [
            "what company?",
            "Its true i was the interviewer",
            "Is this satire? Or am i out of touch ?",
            "Congrats! With my luck, I’m pretty sure I’d have to develop an operating system in GoLang in under 20 minutes lol",
            "Sounds like a normal company SWE interview…?",
            "Great man! Hopefully me next",
            "Damn, which company? 👀👀",
            "Huge congratulations! Hope to share in some of your amazing luck! 🎉❤💪🙏🍀",
            "what was the company, pls help a brotha out lol",
            "wells fargo?",
            "I got a job by not knowing anything but explaining whatever what came to my mind about the subject. Communication is a legit thing that helps developers. Most of the jobs in tech are just research homework and learning on the go. Not sure why many companies have to focus so much on the applicant's existing knowledge.",
            " What’s the pay?",
            "Maybe they liked how you were dressed, congrats tho",
            "Congratulations 🎊",
            "Your luck is too great buddy",
            "Congratulations",
            "Which company 👀",
            "now that ur in let us know 👁️👁️",
            "More of a technical than i did :)",
            "My second job at my tech interview the interviewer asked me to write a function that checks if an input number is a prime number… after 100s of hours of leetcode practice i wanted to laugh and cry at the same time",
            "Which country may I ask?",
            "Ye same, my technical interview with google was also super easy. They just asked me to print hello world in under linear time"
        ]
    },
    {
        "post_id": "158fqn6",
        "author": "sirfitzwilliamdarcy",
        "title": "GPA Matters for Internships",
        "url": "https://www.reddit.com/r/csMajors/comments/158fqn6/gpa_matters_for_internships/",
        "score": 560,
        "num_comments": 147,
        "created_utc": 1690216707.0,
        "selftext": "I just finished interviewing for Google. Answered all the interview questions with the follow ups. Got my rejection call and email today. Recruiter said to keep my grades up and show academic commitment. And that was what concerned the Hiring Committee. So yeah, keep your grades up kids. It definitely matters!",
        "permalink": "/r/csMajors/comments/158fqn6/gpa_matters_for_internships/",
        "comments": [
            "[deleted]",
            "I got amazon with a 2.7 gpa lmfao",
            "if you’re applying to Google with an under 3.0, i don’t really know what you expected. frankly, it’s impressive you got an interview given that",
            "Your GPA?",
            "I mean your gpa was probably pretty bad. It won’t matter for anything over a 3.0.",
            "uhm\nno offense\n\nbut you applied to Google. Of course these types of companies are gonna care about GPA like they have lots of competition. \n\nIf you target smaller companies frankly they don't care",
            "In other news, the sky is blue.",
            "I landed an interview at google and interned with 3.14 gpa. This was in 2020. I graduated with a 3.0 gpa and Currently working at tiktok.\n\nEdit: undergraduate degree",
            "I got into Google with a 2.5",
            "tbh my GPA hasn't affected any of my job opportunities it always came down to a technical interview or just luck. Only places that have asked for my transcripts were mostly areo companies not tech. no faang/adjacent ive interviewed at have asked about my grades. Of course it matters a great deal for grad school",
            "That’s generic rejection.",
            "99% of companies don't ask for your GPA, especially in big tech. Some of the ones who don't: the rest of the FAANG, Uber, Microsoft, Stripe, Roblox, etc.",
            "Of course it matters. You have no actual job experience. Your GPA is the only measurable metric I have to gauge your competency.",
            "This is wierd, I’ve gotten offers for Google, Amazon and Microsoft with a sub 3.0 .. they honestly just fucked you.",
            "Wait why are people acting like this is obvious? GPA doesn't matter for MOST tech companies?? Other than hedge funds and I guess Google, it doesn't matter. I've gotten job offers from many companies and not one asked for my GPA.",
            "zon literally never asked for my gpa. i could've had a 2.0 and it would have been fine regardless",
            "Yes they do, one time I went into a conference room for the company I worked for a phone call and they had criteria for what they wanted to hire for on a board and having a gpa in the 3’s was apart of it for both interns and ft.",
            "Just lie  \n\n# ¯\\_(ツ)_/¯",
            "When I become a hiring manager today I plan to give back to people. I swear I don’t give two fucks what ur grade in algorithms was I care about shit you have built. We BUILD software, not solve tests and quizzes. Fucking dumbasses.",
            "GPA definitely matters for internships, but not for the rest of your career really. I personally know people with 2.0 GPA in faang",
            "well not everyone wants to work at google",
            "Google has a >=3.0 cutoff right?",
            "It's called supply and demand.\n\nAs more people try to enter the field, the higher the bar will go.\n\nTech companies will soon regularly filter by GPA at entry. It's inevitable. There's a huge line of candidates hoping to break into the industry. Companies have to be fair.",
            "Yea no shit",
            "[deleted]",
            "Is this new grad or internhip? Did google start for 2024 new grads?",
            "Reading the comments, I gathered this data.\n\nWhile (true) {  //imagine your favorite language here//\n\n  “no it doesn’t… because”\n\n  “obviously… because”\n\n}",
            "Like 90% of the internships I've applied to seem to have a cutoff at 3.0. I've got a 3.1 currently and am hoping to just keep it afloat for 2024 lol",
            "Hi, I know it's a lot to ask but can you briefly explain the process of interviewing. From submitting resume to getting rejection with approx time span??",
            "Probably depends on the recruiter",
            "Unless you’re building the next gmail at night, you better keep your grades up.",
            "tbh you just have to be honest with your recruiter, i have a 2.9 but that’s because of some personal issues i had during my early college years that gave me a 2.0 at the end of my freshman year, so i grinded and brought it up to a 2.9 in less that two semesters ☠️ at the same time it’s Google and they get sooo many applications so it’s whatever",
            "I haven't received a response from Google yet after the phone interview. I'm a bit scare knowing that they're already sending the rejections",
            "I've had the opposite experience unfortunately. I have a near-perfect GPA but it hasn't helped me at all in getting an internship.",
            "I got an internship with 2.5 gpa",
            "I got my first job with 3.3 gpa.",
            "If you’re into the rat race then yes GPA matters.",
            "How much is minimum GPA when you’re double majoring in say math or physics plus doing projects? Because usually, grades are lower for these subjects, no?",
            "But does it matter when you graduate?",
            "But does it matter if you have graduated with a few years of work experience?",
            "GPA should be used to screen in / screen out candidates.  Having a candidate go through the full interview process and then telling them the GPA is the issue is very poor form.",
            "yeah A 100%, for college placementss they won't even shortlist u if u don't have a certain minimum gpa"
        ]
    },
    {
        "post_id": "jb4idf",
        "author": "odxs",
        "title": "I created a free chat bot that gives access to over 130 companies' coding interview questions",
        "url": "https://www.reddit.com/r/csMajors/comments/jb4idf/i_created_a_free_chat_bot_that_gives_access_to/",
        "score": 560,
        "num_comments": 16,
        "created_utc": 1602694436.0,
        "selftext": "hey friends\n\ni took some time to create a [discord chat bot](http://cscareers.dev/discord) that sources leetcode premium questions that have been asked by large tech companies. while i don't advocate for exactly knowing what specific questions are asked in intern interviews, it was extremely beneficial for me to know what type of questions are generally asked so i could brush up on those skills before my interviews. \n\nwe currently support over 130 companies! i'm always looking for feedback on how i can improve the user experience, so if you have any suggestions feel free to suggest!",
        "permalink": "/r/csMajors/comments/jb4idf/i_created_a_free_chat_bot_that_gives_access_to/",
        "comments": [
            "I love that bot and I use it often on that server. Thanks a lot for taking the time to make it!\nIs it available online for others to contribute to it? Github?",
            "Howd you get the corgi flair lol",
            "[deleted]",
            "G bless u 🙌🙌🙌",
            "Not the hero we deserved, but the hero we needed",
            "Good work, but to state the what-should-not-need-to-be-stated:\n\nThis is of course not every question asked by interviewers, and likely not a representative sample. It is great for prepping, but don't assume memorizing these are all you need.",
            "is it possible to invite this bot into a server? I'm in a discord for a CS focused club at my university and we'd love to have something like this!",
            "omg this is totally great!!",
            "Amazing. Thank you 😆"
        ]
    },
    {
        "post_id": "1aohbnb",
        "author": "Hellstorm5676",
        "title": "It's not just graduate and then work anymore",
        "url": "https://www.reddit.com/r/csMajors/comments/1aohbnb/its_not_just_graduate_and_then_work_anymore/",
        "score": 554,
        "num_comments": 146,
        "created_utc": 1707682508.0,
        "selftext": "Why is it that back then you could graduate then talk with recruiters/apply to boards to find a job, and you get soon? \n\n**Now it's a billion certificates, exaggerating your background and having 10+ years experience to have an entry role type living out here tbh**",
        "permalink": "/r/csMajors/comments/1aohbnb/its_not_just_graduate_and_then_work_anymore/",
        "comments": [
            "Back then they were desperate. Now you are.",
            "Because the market is saturated with graduates",
            "It's because programming has been made easy by implementation of features. It has been made accessible outside of academia by courses both offline and online. And finally the nail in the coffin, an influx of people with no skills getting into the field just to get a decent pay.\n\nThese people can be identified with their phrase of my passion is programming and the influx happened around the 2010s.\n\nSo HRs / Recruiters want something extra, and that happens to be certificates.\n\nBut those are now also cheaply available, so the situation is about to get a lot worse before it becomes better.",
            "The economy just isn't what it once was. Everything is expensive and investing on workers has become risky.\n\nI wish I was born in the 90s and prior, then I would be secure with a job.",
            "I go to a tech uni and 50% of new ug cohort is cs major, and that doesn’t even include related majors like ece, cybersecurity and information systems. Then there are TikTok commercials claiming you can make 100k simply by knowing how to write a todo app in python, attracting a bootcamp army. Just tell me how can this be sustainable",
            "Yes getting high-paying jobs is hard. Go talk to any doctor, lawyer, or finance bro.",
            "This cant continue happening. Something eventually has to give in and break.",
            "What do you think happens when a single degree is hyped and overpaid as CS majors?",
            "“Back then”?",
            "It was never just graduate and find a job. Maybe in the 1970s maybe.",
            "The more people that graduate with the same degree every year the stricter it gets when it comes to hiring. Supply and demand companies now can get their pick of the litter since there are so many people now.",
            "Because many CS Departments across the country have gone in just a decade from graduating merely 60 CompSci graduates per year to 300+",
            "Supply and demand. Supply is high ATM and demand is low. It will get a lot better when interest rates go back to zero.\n\nI'm an Econ major. Just hanging around for laughs here",
            "if you are getting certificates you are ngmi, nobody gaf abt them",
            "If you go over to /r/layoffs you’ll notice that people are saying tech jobs are moving over India \n\nIn addition, with the rise of GenAI and copilots, existing developers are more efficient, management is probably seeing that you don’t need as much developers.  \n\nPlus there are so many low code / no code platforms, as a result regular non developers can build applications",
            ">Why is it that back then you could graduate then talk with recruiters/apply to boards to find a job, and you get soon?\n\nLess saturation. Less competition. \n\nFew people could code. Even fewer held a computer science degree.",
            "Yeah it sucks, feel like giving up",
            "It took me 8 months to get a job back in 2012 after I graduated and I had to settle for $43k when most of my friends from college started out at $80-100k, and Google/MS was doing like $160k+ TC for 0YOE. \n\nI'm doing pretty well now but that shit sucked. I think the biggest problem is that reddit wasn't much of a thing in 2012 and now everyone has an easy to access echo chamber to cry in. People that aren't struggling aren't here complaining.",
            "It's what happens when anyone with two braincells can get a degree. Chatgpt did most of my cs bachelor's for me (WGU).",
            "Keep crying I know people at my shit university that made 200k offers literally last month",
            "Supply and demand OP. Thank all the TikTok and YouTubers who did nothing but brag online about their lifestyle in tech",
            "This is the problem with everyone getting degrees and thinking education is good for society. It just devalues degrees. People thought the key to upward mobility was giving as many people degrees as possible but now what a college degree got you, you need a masters or PhD for now.",
            "It was never easy for the average graduate, it's only easy for the exceptional ones.\n\nBeing on the \"other side\" as a senior dev that interviews people, it's so obvious when a CS grad doesn't know anything and expects their degree to carry them. If you can't be bothered to learn to program and answer programming questions , don't apply for SWE jobs.",
            "So would you recommend getting a software engineering degree instead?",
            "Was like this for finance back in 2012, it sucks.",
            "bro this is how the job market was in 2016-2019 before the ridiculous money explosion",
            "This is why I regret not majoring in engineering. While it may be a challenge to find a job in engineering, it’s a hell of a lot less challenging than finding a job as a CS major.",
            "The only real answer is macro economy. Saturation is true but that already happened way back around 2017 and 2018.\nIt's really tough for new grads these year.",
            "People, calm down. In Europe, especially in developing countries, this still happens a lot. Not to the same extent, but depending on the uni, its not uncommon. You just have to accept lower salary, no stock options, etc. Thats still better than having to go through the american process and not finding anything anyways…",
            "I’m going to college next year should I switch to computer engineering or something?",
            "It still is. Just that the work might involve flipping burger patties or mowing lawns"
        ]
    },
    {
        "post_id": "krfaa8",
        "author": "__SpicyTime__",
        "title": "It happened. Daddy Bezos blessed me with an internship!",
        "url": "https://www.reddit.com/r/csMajors/comments/krfaa8/it_happened_daddy_bezos_blessed_me_with_an/",
        "score": 559,
        "num_comments": 88,
        "created_utc": 1609903850.0,
        "selftext": "Got my amazon summer 2021 SDE intern offer today and I wanted to share the good news with you all!! The bazillion posts about amazon OAs really came in clutch ngl. Cant wait to get to work with some of you hopefully!\n\nEdit: [Resume Roast Link](https://www.reddit.com/r/csMajors/comments/kba2sl/weekly_resume_roast/gij5dt8/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
        "permalink": "/r/csMajors/comments/krfaa8/it_happened_daddy_bezos_blessed_me_with_an/",
        "comments": [
            "[deleted]",
            "Time to bend over for Daddy Bezos during your internship!",
            "How many souls do i sacrifice?",
            "Congrats! I’d apply but I cant do leetcode-style problem to save my life",
            "Awesome!! Currently doing my Amazon internship and it's been unbelievably fulfilling and insightful so far, hope you find it just as enjoyable",
            "omg this cracked me up. good luck!",
            "Welcome. Pledge your life to our Lord Bezos.",
            "Congrats! Ghosted here 😔",
            "What year you in ?",
            "Location?",
            "Speaking this into existence for myself",
            "Did you have any previous internship experience? Also, when did you apply?\n\nCongrats btw :)",
            "Can you tell me when you recieved OA? I have applied on aug 15 and still no luck",
            "I got my offer a couple weeks ago too! Irvine office in California for me.",
            "Congratulations ! Any chance you could post a resume (with redactions) just to see what a successful one looks like. I have had no luck so far with any applications",
            "What was the offer? Trying to compare to my current offer and see if it's worth going through another process",
            "Congrats! I finished my internship there last year. Had the best team, really friendly. Sucks that it was all online, but at least I get to go back there in March :D",
            "I just got the email setting up an interview today and i’m so stoked! Any tips for the actual interview itself?",
            "Am I too late to apply?",
            "I’m about to do OA2. Any advice?",
            "Congratulations!",
            "Hey everyone, my application status just changed and it's confusing me. I applied for the Vancouver Canada one and now it's changed to Toronto?",
            "Congratulations!! I just got an email from them last night saying my application was good and I have the three part “coding”(?) assessments for I assume the same sde internship. Any advice you could recommend since you just went through it all?",
            "see u there? 👀",
            "Man I laughed so hard at “daddy Bezos”",
            "\"Daddy Bezos\" runs me the wrong way but hey whatever floats your boat...",
            "[deleted]",
            "Congrats! How'd you find the internship? Linkedin or did someone refer you?",
            "Can I see your resume for insights?, I was ghosted. :(",
            "Congrats! What was the interview like?",
            "[deleted]"
        ]
    },
    {
        "post_id": "1bnvk75",
        "author": "EstimateDecent",
        "title": "Told my Google recruiter that my patience run out in April, got assigned to a new recruiter",
        "url": "https://www.reddit.com/r/csMajors/comments/1bnvk75/told_my_google_recruiter_that_my_patience_run_out/",
        "score": 557,
        "num_comments": 63,
        "created_utc": 1711416875.0,
        "selftext": "You all know how Google is holding back the newgrad offers. Well, I got a competing offer last week and I told my recruiter that I only have two weeks. Guess what I found out this afternoon, my current recruiter, who has 5-year professional hr experience at Google, introduced to me another recruiter, who is some random outsource recruiting specialist. Is it a subtle way of saying \"we are done with you\"?\n\n\\---\n\nEdit: Thanks for the sharing your thoughts. Want to clarify a few things:\n\n1. Regarding competing offer, I've passed HC, so I believe this delay is more of an internal headcount issue, and a competing offer will probably not have much impact in expediting it\n2. Regarding recruiter changes, this is my 5th recruiter in the process, so deep down I know it is probably nothing. However, all my previous specialist recruiters are not very responsive until the current one\n3. Regarding my attitude towards Google, I love the company that's why I applied. Companies have ups and downs, and the market loves a good comeback story. Think about Ballmer's Microsoft. If you locate yourself using Apple Map on iPhone, browse in Firefox to search on Perplexity or upload videos to Vimeo or receive emails from Yahoo dot com. Good for you!\n4. Regarding my attitude towards this hiring process, I'm not fond of passive-aggressiveness; it's the opposite of being constructive and decisive. From my perspective, switching me back to an outsourced recruiter feels reminiscent of the PIP culture at the other well-known Seattle company, which is just passive-aggressive. That's all I want to share with this post",
        "permalink": "/r/csMajors/comments/1bnvk75/told_my_google_recruiter_that_my_patience_run_out/",
        "comments": [
            "Google bad Nvidia the new google",
            "Why not accept the other offer? Google is getting shittier by the day anyway. It's not the amazing thing it was 15 years ago.",
            "If you really want Google, just accept the one offer then politely decline it Google comes through.\n\n\nTheir recruiting process is terrible, btw.",
            "Recruiter changes have had some correlation with offers this year. It happened with Workspace around mid feb and with core late 2023. I hope you get matched/aligned soon!",
            "Okay, I dealt with this same thing OP. Google wanted me for a cloud engineer position and they reached out to me. This was like three years ago. I remember eventually I told them if their hiring process was an indicator of work environment then I did not want to be a part of it. I remember they assigned me a recruiter, then they would go ghost for weeks. When I inquired they apologized and gave me a new recruiter. The new recruiter reached out on behalf of the old one and apologized, said they would take good care of me, guess what? They went ghost for weeks too. Then I reached out explaining how I was not getting responsive communication and THEY were the ones that reached out to ME. Soon enough I was informed by a NEW recruiter that the last one had changed roles or something to that effect. Well take a wild guess on what happened next. Yup, the new recruiter went ghost after a few emails again. They eventually assigned me a fourth recruiter and I politely expressed that I was not interested in anything Google had to offer me. This whole process literally spanned about 6 months. It ended with a recruiting manager reaching out and throwing everything at me to give them a chance, they wanted me to fill out surveys why I didn’t want to work at google. I just politely declined. Once every month or so for about six more months they would email me asking to reach out. I was through at that point and moved on. Soon I got a job offer by Amazon. And well friends…That is a story for another day.",
            "How are they holding back NG?",
            "If you get a new recruiter that's a sign that offer is coming.",
            "Google is on budget.",
            "What’s stopping you from simply accepting another offer? At any point you can bid farewell and tell them that you have to move to Mountain View due to an unforeseen increase in your salary expectations.",
            "Google is the new IBM",
            "This exact thing is happening to me right now. I've been on the project matching phase since December without even getting the chance to talk to a single hiring manager. I'm really disappointed. \n\n\nIs this commonly happening within Google right now?",
            "I will never understand why someone would even feel the desire to work at a place that treats people like this. \n\nSame thing with apple and their months of interviews; it just makes no sense. \n\nThere is plenty of money to be made and professional satisfaction to be had at other companies that don't treat (potential) employees like it's a privilege to work for them.",
            "Google is turning into Yahoo.",
            "why would you want to work with a company that is legitimately evil?"
        ]
    },
    {
        "post_id": "19f0w9a",
        "author": "Forward_Opinion6038",
        "title": "Cooked pt2",
        "url": "https://v.redd.it/lky9p08ekiec1",
        "score": 557,
        "num_comments": 70,
        "created_utc": 1706156887.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19f0w9a/cooked_pt2/",
        "comments": [
            "Spending 4 years/$50k just to lose out to some boot campers/bots😂",
            "Why is he yelling",
            "It’s because we are living in a silent recession not AI.\nAnyone who uses ai for programming knows they don’t do jacking shit and that shit is dumb asf.",
            "“On some unabomber shit” LOOOL",
            "Idk how good of an idea it is to openly say you would love to commit terror attacks lmao",
            "I graduated this passed May and had two job offers before I even finished. I chose to work for the federal government and I love it. I’m surprised more people don’t go for federal SWE jobs, they hire like crazy",
            "Lol suprise when not every company can afford to spend $100k+ on an entry level employee and would rather hire them at $60k",
            "I’m a full time software engineer. Y’all stay safe tho",
            "This place is becoming too negative for my taste",
            "\"I'm not gonna lie to you!\"\n\nLMAO!!! This is great! Nothing like some comedy to give perspective\\~",
            "This twerp is acting like cs grads are above working low wage jobs in their early 20s while they figure shit out acting like not getting the job you want immediately out of college is the end of your life.  I hope your egos aren't this inflated because it's cringe as fuck.",
            "Dude doesn't understand supply and demand",
            "Graduated in May with a CS undergrad, senior capstone was basically a homemade router that blocked all* cyber-attacks\n\nEntry-level won’t even consider me rn and now I’m working full time in a different industry with no time to brush up on my skills\n\nReally feeling like I’m slowly going to forget my knowledge and passion in the CS industry and just end up wasting my 4 years",
            "All because companies want 4 years experience for an entry level job",
            "Are gen z the new boomers?",
            "sigh, a degree doesn't guarantee a job, but it doesn't put you behind as well if you were without a degree.  \nI'd rather be jobless with a degree than without",
            "Gatekeeping for no reason",
            "Entitled pov",
            "So entitled. And the sad thing is that social media rewards this type of content.",
            "Hmm… terrorist…",
            "That virus line was hilarious ngl",
            "Bro is on every watchlist now"
        ]
    },
    {
        "post_id": "zadwzv",
        "author": "ExcitingBite1",
        "title": "Just accepted new grad offer with 0 internships",
        "url": "https://www.reddit.com/r/csMajors/comments/zadwzv/just_accepted_new_grad_offer_with_0_internships/",
        "score": 560,
        "num_comments": 33,
        "created_utc": 1669962645.0,
        "selftext": "Graduated May 2022 in compE, didn't apply hard enough during school, failed faang final round, 3.0 GPA. Wasn't feeling good with 0 internships, but had some project and research experience.\n\nStarted applying for more embedded swe roles since I had more experience with C/C++ and got more call backs. Got two offers and just accepted the offer for a company in a med COL location for 90k, was even able to negotiate.\n\nKeep it up and keep applying, companies are still hiring in this market.",
        "permalink": "/r/csMajors/comments/zadwzv/just_accepted_new_grad_offer_with_0_internships/",
        "comments": [
            "Inspirational. Thanks for sharing. We need more of these posts instead of the hoardes of insecure mfs posting \"should i accept citadel or jane street\" on the daily to make themselves feel better. Congrats!",
            "Nice. 👍",
            "in this economy??? we stan",
            "You love to see it",
            "Thanks for sharing. Gives hope :))",
            "Sounds like a great learning/working opportunity. Great job!!! Now go party your ass off",
            "Go off king",
            "Congrats!!\nSame stats and situation I had :)",
            "Good job, proud of you 👏",
            "Inspirational, congrats",
            "Congrats !!!",
            "well done!",
            "Wtf, that's nice. I havent touched C/C++ but that's something that I learned in college. I've been mainly focusing on web apps using react and javascript and hoping to land a front end role.\n\n\nJust curious but what projects did you do? howd your resume look like? How much leetcode you had to do?",
            "Nice that you go with embedded swe :-) congrats on the offer!",
            "[deleted]",
            "Thank you for sharing and congratulations!!",
            "W",
            "Same story, except I got my offer in early June still in school while the market was hot, and 3.9+\n\nGood on ya for persistent and best of luck on your new journey.",
            "how do u prepare for embedded software interviews? i have 1 coming up but is very unfamiliar with the format, and advice?",
            "That’s great! Good to see a fellow computer engineer on the sub. Congrats 🎉",
            "Thank you for sharing this :)",
            "congrats op!!"
        ]
    }
]