[
    {
        "post_id": "v2mfyb",
        "author": "ochuuu",
        "title": "internship got canceled",
        "url": "https://www.reddit.com/r/csMajors/comments/v2mfyb/internship_got_canceled/",
        "score": 550,
        "num_comments": 117,
        "created_utc": 1654104735.0,
        "selftext": "my (ex-incoming) manager called to let me know that the internship program was canceled due to the economic climate.\n\nI'm trying to stay calm but I’m a rising senior and this would've been my first real internship in college and now I just feel like the ground has crumbled underneath me. \nI feel so dumb for rejecting other companies bc this one offered better pay and was remote.\n\nDoes anyone know of any summer programs/boot camps/fellowships still taking applications at the moment? Thankfully I’m doing research at my uni this summer and I’m thinking i might as well make a project of some sort and start grinding to make sure i can still secure a new grad job.\n\nI'd appreciate any advice, thx.",
        "permalink": "/r/csMajors/comments/v2mfyb/internship_got_canceled/",
        "comments": [
            "Why don't these posts ever drop the name???",
            "Sorry to hear that. I believe Cloud9 is still recruiting interns. If you’re comfortable with sharing, what company is this?",
            "Name and shame",
            "Yep there's a summer accelerator called Headstarter which is amazing!\n\nEdit: it's their Software Engineering Fellowship which is 10 weeks long",
            "You could make a post on Linkedin about it, I’ve seen others with rescinded offers get a lot of attention doing that",
            "Name and shame them",
            "Drop the name. Shame on them",
            "if you turned down some other offers try reaching back out to them and explain the situation. As long as you communicated with them and didn’t ghost or tell em to suck it or something when you declined I’m sure they wouldn’t mind re-extending the offer",
            "With the description OP gave in one of his comments, it looks like it might be Loom?",
            "Is it a sports firm based in Cali?",
            "Just a long shot but I just learned there is a such thing as a Fall internship as well. As your looking for Summer internships try checking out some remote fall opportunities along the way. \n\nI'm a old 25 y.osenior in CS and I am very insecure about my situation. I'm coming back due to being able to finally afford my last 2 semesters in 3 years. You got a leg up on me. I'd say start networking before you graduate and advertise yourself and try to find ways to build sellable skill for interviews even if that means creating your own hustle/\"start build websites on fiver, or creating apps\".\n\nIt might be of help thats what I am doing build a \"portfolio\"!",
            "This happened to someone I know last year. The company was being acquired and there was a hiring freeze in the summer, canceling the internship.\n\nHe applied again this year as a graduating senior and they said internships are only for currently enrolled students. They aren’t hiring new grads with no experience.",
            "Some companies are still hiring fall semester interns. It might be worth taking a coop semester to work a fall internship.",
            "I’m so sorry. That’s also my biggest fear right now with my internship. Definitely list in your resume that you had an internship but it got cancelled due to the economic downturn. It shows that you are qualified. Otherwise, work on personal projects and leetcode as much as possible",
            "Drop the name or gtfo",
            "Have you reached out to companies you rejected and see if they have an opening?",
            "Rewired is still hiring a data science/engineering intern: https://www.politicsrewired.com/careers",
            "Just reach back out to the companies you rejected",
            "leetcode",
            "I had an intern quit 5 days before they were supposed to start. He waited just long enough that we couldn’t hire someone else instead.",
            "reach out to the companies you rejected",
            "I’m not sure if this is a good idea but have you tried to reach out to the companies that gave you offers initially and explained the situation to see if they could possibly work something out with you? A company reached out to me once again (even tho I rejected them) because they had extra positions it wasn’t a swe position tho.",
            "Don’t beat yourself up. Things like this happen and will always happen. A useful exercise would be to think of this: how would you tell an interview about this experience and how you solved it. Look at this as an opportunity as a moment to problem solve and grow.",
            "You can still put it on your resume",
            "Happens to many.  I wouldn’t name and shame the company, it’s not their fault the broad economy is struggling.  It also could come back to bite you.\n\nWhat’s your major?",
            "So many people calling for name and shame, but that accomplishes nothing.\n\nThis kind of thing happens just like candidates drop out a day before they are supposed to start because a better opportunity presents itself.\n\nI used to help recruit for my first company and they did the exact same thing, rescinded a bunch of offers a month or so before candidates were to start.  I never recruited for them again.  Turns out they were cutting costs so they could be acquired.  It was crappy, but it happens.\n\nAt another job, I had one new hire stop showing up after a month and a half.  Their LinkedIn profile currently claims they worked for me for a year.\n\nYou’re going to be fine.  Focus on what matters and dump your energy into finding the next opportunity.  There’s lots of great advice in this thread already. \n\nLet us know when you land on your feet and good luck.",
            "Bootcamps are good because it’s free training and usually paid while training and if they don’t land u a job I owe them nothing. But more likely you’ll get the work experience you want. I decided to do bootcamp while finishing college courses and I feel very comfortable now that I can adjust well to another job upon graduation. But I will prob stay at my current job because it’s honestly perfect. Next js and nest js are so nice together",
            "DROP THE NAME",
            "name?",
            "I am sorry to hear this! Wish you all the best, OP!",
            "Try reaching out to the companies that u rejected offers from. There's a chance they might still have something for you.",
            "Invest in LikedIn+ premium!!!",
            "Name and shame… this is crazy. You are allowed to warn others. This will not damage your career to state a fact that happened.",
            "Bro just get a job",
            "Don't feel down, this is happening all over, META, Twitter, Google etc.\n\nThe economic climate is unknown and companies need to extend runway.",
            "Why would you choose an internship because it’s remote?  Internships are about learning which is not ideal remotely.",
            "Ur an American citizen, your guaranteed a job anywhere else",
            "damn thats tough its hard to find an internship rn at this period since most internships are filled",
            "I was also supposed to be a SWE intern at the same company as OP. Very devastating news and unfortunate timing (less than 2 weeks notice). I am also a rising senior and this would have been my first internship and experience as a SWE. What should I do? Any advice is greatly appreciated. I am feeling a bit stranded now :(",
            "First off, awful situation.\n\nSecond, a LinkedIn post would have a bit of reach, BUT make sure to add that you're open to and ready to start work right away for remote internships. Also cold-messaging recruiters on LinkedIn is also a move, as at least if you don't get opportunities from them, you still put your foot in the door.\n\nGodspeed my friend.",
            "Talk to your counselor",
            "Onetrust ?",
            "in the same boat as you. i was supposed to start my summer internship on tuesday but it was rescinded because there was an error with the security clearance. wasn’t specific but it was something with fingerprints :/ so bummed out",
            "I still get email updates from indeed regarding new internships being posted"
        ]
    },
    {
        "post_id": "19fjosj",
        "author": "OddChocolate",
        "title": "Layoffs Announced In 2024 | Great Economy!",
        "url": "https://i.redd.it/gl2aksu2umec1.jpeg",
        "score": 556,
        "num_comments": 122,
        "created_utc": 1706216321.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19fjosj/layoffs_announced_in_2024_great_economy/",
        "comments": [
            "the fact that this is already outdated, thanks Microsoft 💀",
            "These figures are not accurate",
            "Microsoft layoffs happened recently",
            "- Why are there 2 Ebay?\n- And I checked the source they referenced, idk where they got these numbers….\n- Google already laid off 12000 last year, not announced this year\n\nClearly whoever made this table got laid off",
            "Keep in mind a lot of these layoffs are in sales or corporate functions which aren’t tech. But yeah our industry is not doing great right now.",
            "Global or just US ?",
            "[deleted]",
            "There were 160 million workers in the United States.\n\n[https://en.wikipedia.org/wiki/Labor\\_force\\_in\\_the\\_United\\_States](https://en.wikipedia.org/wiki/labor_force_in_the_united_states)\n\nThis is a drop in a bucket.  Not everyone can get fancy tech jobs.  A lot of economic data is positive since the pandemic.",
            "[deleted]",
            "deserted advise stocking ludicrous cows psychotic ancient glorious humorous lunchroom\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Oh boy, another doompost. From the finance cult, no less.\n\nJanuary always has the highest number of layoffs. These numbers (even if they were true) are not cause for concern. For comparison, January 2023 had nearly 90,000 tech layoffs.",
            "216,000 jobs added in December, but sure let's pretend these layoff numbers are big.",
            "Yay! Even more bugs on League from this dogshit indie company",
            "This is just the way that the administration count the “jobs”. For A person who was laid off from a full time job, then work 2 part time jobs to cover his cost of living, the government will count as one “additional” job. Thus, the economy is “striving”.",
            "You guys show why you are not hired or still looking for jobs just by your reaction to this stupid and factually wrong post. \n\nEconomy is great. Overhiring greedy companies laying off workers means nothing. Lots of these layoffs come from sales, marketing, product etc. Not software. I see lots startups, public sector and mid size companies are hiring like crazy. Stop tethering yourself to the idea of making 600K at FAANG and also learn to read charts, follow news, and fact check.\n\nIs the market good? Yes and no. Yes for experienced folks but not too experienced. Is it good for juniors? Unfortunately mot really. CS is almost oversaturated. Look for alternative roles like DE etc.",
            "You know what sticks out? The fact that Apple is not on the list. If you extend the list, META and MSFT will be in. But not Apple. Why? Because Apple does HR the way it does its products. Properly.",
            "How naive I was, thinking 2024 would be better than 2023",
            "Add Lockheed and Raytheon.\n\nSource: im a defense contractor",
            "[deleted]",
            "Let's play bubble pop!",
            "It's Q4 earnings report time for all these companies, start of year layoffs has always been a thing to look good for investors, this is no where near last year. The economy is recovering. No need to doompost when this is a trend since forever. People are so sensitive to any layoffs these days.",
            "and the migration is happening !! so all these folks now will move to other companies and the enshittification happens there ! the self suspecting scared people will go to these companies !",
            "The feds will lose Biden his election, even if it’s not under his control.",
            "What happens when you vote democrat",
            "It’s so over",
            "Still rumors that end of Q1/Q2 will usher in stagnant hiring or layoffs depending on how the market is and if the fed starts cutting rates like anticipated. She essentially said that her task was to create a list of the 4000 employees combined of different departments and teams and in June they would announce if they decide to do one or not.",
            "It’s so over",
            "The is good this is what JPOW wanted to see! Then when it gets real bad they’ll turn the money printers back on!",
            "I just checked Layoffs.fyi and there have been 11.8K layoffs in the United States since the new year (23.8K worldwide).\n\nThe numbers OP is claiming as “Layoffs Announced in 2024” is actually ALL layoffs announced SINCE MARCH 2020.",
            "there's no way that amazon laid off 27,000 already in 2024.",
            "this is still only like 10% of the companies or less than 1% for some, the rest 99% of tech workers are making a fortune with the stock price going up",
            "Nowhere does it say these are all tech layouts",
            "It is. Too many software engineers. There is no need for many with their skills.",
            "Holy f, competition",
            "And how many jobs were added?",
            "Not including the 20000 from Citigroup?",
            "Well, just don't work for any of these companies. Problem solved.",
            "A lot less than last couple of years though",
            "Didn’t Google just layoff 1000 workers this yet? Why does it say 12000?",
            "Tesla still open for business",
            "Amazon numbers are wrong 100%, so assume the rest are off as well, should require sources when trying to be spooky",
            "And check their profit",
            "Curious what these look like as percentages",
            "What if I told you this industry was completely built on financing at 0% interest rates before 2022?",
            "I hate that I'm in talks with the top company here. Great for there being open seats for me, not great for my chances of holding onto one for an extended period. That plus their attempts to move most positions over to hybrid just because they blew much money on some new buildings.",
            "When its expensive to expand, people who contribute to expanding get laid off yes"
        ]
    },
    {
        "post_id": "gl0841",
        "author": "StateVsProps",
        "title": "No summer internship lined up yet? Hack your own!",
        "url": "https://www.reddit.com/r/csMajors/comments/gl0841/no_summer_internship_lined_up_yet_hack_your_own/",
        "score": 555,
        "num_comments": 62,
        "created_utc": 1589655720.0,
        "selftext": "Hi everyone\n\nWe have seen a lot of people stressed about having no internship over the summer (canceled or otherwise). We are a group of advisors and mentors from major US companies (Citi, Google, Microsoft, ATT and more) who want to help out.\n\nIn real-life, developers don’t work alone. So we set up a space to match participants in groups to work on projects together. Our goal is to give a ‘real’ internship experience. As you know, projects on a resume is a critical way to get noticed for a first job.\n\nHere’s how the process works: \n\n* You fill out a [questionnaire](https://forms.gle/d5hSs2RXFanseDyq7) about your programming ability, favorite languages, and technologies;\n* We match you up in groups of similar experience and interests;\n* We help you find a project that matches your group, interest, and professional goals;\n* Our industry mentors give feedback and notes on your project idea;\n* We ask you to assign clear roles (architect, product owner, scrum master) to avoid confusion on the team;\n* We set you up with the tools, processes, and feedback loops that are used in companies and startups on real projects;\n\nThese initiatives tend to get everyone excited at first, but then fizzle quickly. We ask you to please apply only if you are serious about coding and adding a project to your resume. Similarly, if someone drops off of your project (that happens), we help you find a replacement with similar skills.\n\nYou can start your journey by filing the [questionnaire](https://forms.gle/d5hSs2RXFanseDyq7) and we will add you to the project. You will also need to join our [discord server](https://discord.gg/x6mAjHe) which allows you to connect with other members, share tips and resources, and more. LAstly, you can checkout our landing page at www.hackyourown.org and share it on social media.\n\nPlease also check out these similar initiatives. Let’s all stick together and beat this!\n\n* [Covidterns](https://www.reddit.com/r/cscareerquestions/comments/flfoc3/yesterday_i_started_an_open_source_project_for/)\n* [projects for programmers](https://www.reddit.com/r/cscareerquestions/comments/fo52w9/if_youve_been_affected_by_recent_events_and_are/)\n* [summer of shipping](https://www.reddit.com/r/cscareerquestions/comments/gis61n/internship_cancelled_join_a_group_of_100_students/)",
        "permalink": "/r/csMajors/comments/gl0841/no_summer_internship_lined_up_yet_hack_your_own/",
        "comments": [
            "This awesome. Doesn’t really apply to me but that’s okay. I hope someone who needs this actually sees it!!",
            "This is SO awesome. Do you have any plans to set these up during the school year as well? I can't commit to a project this summer but I'd love to revisit this idea in the fall or spring.",
            "This is SO cool. Can’t wait to fill the form. As a third year engineering student THANK YOU SO MUCH",
            ">You can choose multiple paths like front-end javascript or alternatively back-end javascript\n\nHmmmmmmmm",
            "[deleted]",
            "Discord invite seems to be invalid.",
            "Is there a knowledge requirement? I haven’t taken Data Structures and Algorithms yet but I haven taken intro to C++ and Intro to Java.",
            "This is really great! Thank you so much for the opportunity for a beginner like me!",
            "Thank you so much! Super excited!",
            "Is this only for American students?",
            "Invite invalid",
            "What a great initiative!",
            "I started filling out the questionnaire, but I stopped because I feel like I am not the intended audience of this project. I am a highschool sophomore with a couple years of programming, multiple languages from Java to html, and some basic project experience under my belt. Is this something that I could take part in or am I too inexperienced to do this? I know very little about working on projects in large teams and I am not super confident in my knowledge of the nuances of these languages outside of the projects that I have worked on and the classes I have taken",
            "!RemindMe 8 hours",
            "I have a full load of spring semester courses but might be interested in doing this starting late June. Is that an option?",
            "This is so great!!",
            "What is the deadline for signing up ?",
            "Hey, thank you so much for offering this opportunity! This honestly sounds so cool and I would love to be a part of this.\n\nThere's a slight issue though. Personally, I'm awaiting results on a summer internship I interviewed for last week but I am unsure if I will get it. If that doesn't work out, I'm definitely interested in pursuing this program. Would you recommend I wait until Sunday (which is when the results are out) before signing up or should I instead sign up and then withdraw (in the event I get it)?\n\nI'm just scared of you guys reaching the cap (if you have one)  and being unable to join on a later date :/",
            "Where can I apply to be a mentor?",
            "[deleted]",
            "I would love to sign up but the form is closed. Is it still an opportunity?",
            "Can we do this even if we don't have that much experience in coding?",
            "Thanks for this! Would definitely sign up!",
            "The invite link for the discord expired. Would you mind posting it again?",
            "Hey! Is this a paid internship?",
            "Is the Discord link invalid?",
            "Hi there! Can I get a valid invite to the Discord? I got laid off recently from my very first programming job, and responses from prospective employers are hard to come by nowadays for someone junior like me :/\n\nNvm, I just got sent one. Thanks for posting this here; I wish you luck with this noble venture :)",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/javascript] [Want to build cool projects over the summer, but no internship? Hack your own!](https://www.reddit.com/r/javascript/comments/gl0zol/want_to_build_cool_projects_over_the_summer_but/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
        ]
    },
    {
        "post_id": "10mvkrq",
        "author": "sun_gan",
        "title": "netflix swe internship got 33,000+ apps this year",
        "url": "https://www.reddit.com/r/csMajors/comments/10mvkrq/netflix_swe_internship_got_33000_apps_this_year/",
        "score": 557,
        "num_comments": 115,
        "created_utc": 1674852376.0,
        "selftext": "that’s crazy. like i knew faangs get a shit ton of applicants but i feel like i can’t even comprehend a position getting over THIRTY-THREE THOUSAND APPLICANTS\n\nedit: for all of you saying this is normal pls talk to literally anybody outside of cs and they’ll tell you it’s insane",
        "permalink": "/r/csMajors/comments/10mvkrq/netflix_swe_internship_got_33000_apps_this_year/",
        "comments": [
            "wait until you hear how many google and amazon get lol",
            "when you drop in a game of fortnite, do you worry about 99 of the players, or 5 of them who are actually good?",
            "CS grads have been telling people to spam applications for the last three years. I know plenty of people who put in 500+ apps during their search, so it’s not surprising that companies have been getting these numbers. I wonder how many of them are just application spams though, and how many will be real contenders.",
            "roblox got over 50k. more apps and lower acceptance rate than stanford",
            "Meanwhile I’m applying to unknown companies and I can’t even win with 1/100 apps :/ fml",
            "Twitter was 69k… 5 years ago. They took ~200.",
            "I’m surprised these places get that many. I would think the average student would just assume they wouldn’t get in and not bother applying",
            "That number is large but it’s likely a ton of them can’t do basic programming. \n\nSome of them may be boot camp people who have built a to do list and thought they were ready for prime time.\n\nAlso a ton are likely people have no prior experience/internships. \n\nI imagine Google is even worse.",
            "Probably 30,000 of them watched a couple of YouTube’s and think they can work for Netflix. If you meet the qualifications, apply. People actually qualified is a small portion of these apps guaranteed.",
            "this is the norm",
            "Top .1% get the top .1% spots",
            "Wow!! People really are shotgunning FAANG internships nowadays!",
            "tfw that is less than Citadel",
            "Most of them are one person with a bot",
            "There’s prolly some people not in college applying 😭",
            "It is normal, bank, biotech and even retailers get more than 33k internship applications per summer.",
            "Well, it’s no surprise, according to reddit a CS degree is the fastest way to get rich quick. \n\nso I wouldn’t be shocked to find out that everyone is rushing to get their foot in the door. \n\nApparently they ALL make $250 K + a year.\n\nAnd although some people do make that much, I would bet that on average most salaries are like maybe half of that.",
            "I’m curious what’s the amount of applications FAANG has received each year from early (2010-2015) to now",
            "Me an Indian - First time?",
            "[deleted]",
            "You’ve gotta set a lot of filters to get down to a workable number of apps you have to actually put eyes on 👀",
            "How many spots are there tho?",
            "Thank God I didn't apply",
            "They are literally hiring summer interns to go through all of the applications.",
            "Haha don’t worry an h1b will take the job",
            "Umm",
            "33000 is a regular MIT application pool",
            "Anyone knows how many interns they actually hire?",
            "Where do you guys get the stats on this?",
            "HUH how many do they take",
            ".15 %",
            "Happy to be out of that internship/entry level job race. Things can still be competitive (PM is always competitive af) but nothing compared to trying to get my first internship.",
            "Me only submitting in total 10 :("
        ]
    },
    {
        "post_id": "yzi2x9",
        "author": "None",
        "title": "Bye guys",
        "url": "https://www.reddit.com/r/csMajors/comments/yzi2x9/bye_guys/",
        "score": 557,
        "num_comments": 68,
        "created_utc": 1668881291.0,
        "selftext": "I found this sub at the start of my sophomore year when I didn't know what a data structure was. I'm a senior now, and there's probably been more days of me visiting this sub in the last two years than not visiting. As a sophomore I was blown away by people here choosing between multiple six figure offers, thinking I would be overjoyed to achieve half of what some of you guys here have done. It's very surreal now to be in the position of those I looked up to a few years back.\n\n\nI won't miss the hopeless nights of thinking I'll be unemployed forever and the hundreds of rejections, but I'm glad I stuck with it and made it through. I signed a new grad offer recently that I'm pretty happy with, so I'll delete reddit soon and go touch some grass. If it weren't for this sub I wouldn't even have known there were such great jobs out there let alone how to get an offer. \n\n\nThank you guys, good luck to those still searching - no matter how hopeless it feels now, I hope five years from now you think back with pride to how you overcame this adversity.",
        "permalink": "/r/csMajors/comments/yzi2x9/bye_guys/",
        "comments": [
            "🫡",
            "Congrats and fuck you!",
            "You could graduate to r/cscareerquestions instead",
            "[deleted]",
            "Stick around in the sub, the CS Students need advice from actual professionals sometimes",
            "Leaving the sub? I always thought this was a sub for people who were CS majors and those who currently are or want to. \n\nI graduated in ‘12… should I leave? Lol",
            "i am tearing up now",
            "YAYAYY!!! Congratulations, my friend, and good luck with all your future endeavors. Sending you lots of positive energy and wishing you all the best. :)",
            "Proud of you and enjoy yourself!",
            "god bless this sub. the cs major evolution",
            "We lost a real one today. 🫡",
            "Unpopular opinion maybe. Happy for you but wouldnt you want to stick around and help others in need?",
            "Good luck bro!",
            "Congrats and good luck",
            "Congrats on your offer!",
            "Hope you won't get affected by this economy and forced to return to this sub soon.",
            "Noobie redditor here . \nI guess this the post with which I'm gonna start up my CS career . \nGoodbye fellow champ",
            "You will always be a CS major at heart.",
            "Cya tomorrow",
            "🫡"
        ]
    },
    {
        "post_id": "y6m3qy",
        "author": "Paulchicos43",
        "title": "I DID IT",
        "url": "https://www.reddit.com/r/csMajors/comments/y6m3qy/i_did_it/",
        "score": 554,
        "num_comments": 34,
        "created_utc": 1666039381.0,
        "selftext": "Four years I've been in this sub. Four years. \n\nI used it to help me make my first resume. I used it to learn how to practice for online assessments. I used it to learn how to prepare for my first behavioral. I used it for my internship searches. I used it to help my with my new grad search. I used it for emotional support during the shittiest parts of covid when I sent 300 resumes only to get rejected 299 times until I got my first internship.\n\nEven when school was online and all I had was a computer and 5 bucks in my bank account, this sub helped me reach my dreams\n\nFour god damn years. That's insane.\n\nI have no clue where I'd be if it weren't for this sub.\n\nThank you so much to everyone here, I love all of you guys and I wish you the best of luck on your own journeys!\n\nI'm very excited to start my new life and it's all thanks to you guys :)\n\nCheers",
        "permalink": "/r/csMajors/comments/y6m3qy/i_did_it/",
        "comments": [
            "Congrats, and fuck you.",
            "Congrats man!",
            "You didn't use *it.* You used *US* buddy, and we're proud of you! Keep going and let us know where you end up",
            "congrats man🎉",
            "Cheers man! You deserved it!",
            "Congrats and lucky you found this sub so early. I didn’t find it til this year, my senior year.",
            "this is emotional af 😭 I only found this in my third year but I’m so happy for you! you did it and your hard work has paid off. I wish you the best in everything",
            "This post is so motivated,✨✨✨✨",
            "What the fuck did you do?",
            "congrats!!!",
            "so what did u achieve?",
            "congrats fellow retard",
            "Congrats! Happy for you.",
            "[removed]",
            "Congrats fellow badger!",
            "This is what the sub is for man. Good job with the hard work. You make all of us undergrads proud! Hopefully I'll be in your shoes soon.",
            "Congrats :D",
            "Congrats brother 🙌",
            "Congrats!",
            "CONGRATULATIONS! THIS IS SO MOTIVATING AND IM SO PROUD OF YOU AHHH",
            "You made it seem like it took you 4 years to find a job, gave me a heart attack. I see we were your moral and knowledge backbone.",
            "You know my biggest issue is finishing my resume",
            "Thats how you say goodbye",
            "Congrats on Bloomberg",
            "Congrats! Can you share the posts that helped you out? This subs been filled with shit posts and its hard to find good Info"
        ]
    },
    {
        "post_id": "k986vv",
        "author": "asafroz",
        "title": "I did it, you can do it too. Be patient!",
        "url": "https://www.reddit.com/r/csMajors/comments/k986vv/i_did_it_you_can_do_it_too_be_patient/",
        "score": 553,
        "num_comments": 82,
        "created_utc": 1607447418.0,
        "selftext": "Rejection from Google \n\nRejection from Microsoft\n\nRejection from Amazon\n\nRejection from Intel\n\nRejection from Bloomberg\n\nRejection from Apple\n\nJob Offer from Facebook \n✌🏼\n\nFAQ:\n\n• Tips: Leetcode, Don’t stop telling the interviewer your thinking process.\n\n• Leetcode:\n226/1681 Solved - Easy 63 Medium 133 Hard 30.\n\n• What was different on fb?\nNothing special, i think i was more focused and the interviews went really good.\n\n• “It’s not a lot of rejections”:\nI excluded ghosting. Don’t worth mentioning.\n\n• Im from Israel. Here, if you study at one of the top universities with an 85+ GPA - you’ll get interviews. That’s the reason I got those. In addition, referrals usually helps getting interviews.\n\n\n*it’s nice that “job offer” and “rejection” has the same length!",
        "permalink": "/r/csMajors/comments/k986vv/i_did_it_you_can_do_it_too_be_patient/",
        "comments": [
            "God, this sub always makes me feel inferior for barely even being able to land positions at small companies, where as there are people getting into these ultra-exclusive, highly prestigious companies that I wouldn’t have a snowball’s chance in hell getting into.",
            "Me: (rejection also includes ghosted)\n\nRejection from Google\n\nRejection from Microsoft\n\nRejection from Amazon\n\nRejection from Bloomberg\n\nRejection from Apple\n\nRejection from Facebook\n\n\\+ a bunch of other companies, no name and name\n\n350 rejections in total. Still, hard work always wins in the end and that gives me hope.",
            "How tf do y’all even get interviews at so many places much less rejections?? I got a total of 2 interviews while this dude got rejected from all of FAANG, didn’t even get a chance to interview there... how?",
            "Congratulations my dude! \n\nComing to the diagnostics: \n1. How many LCs?\n2. Ratio of E-M-H?\n3. Self analysis of things on your resume that might have highlighted you?",
            "Congrats!! :D \n\nAm freshman with nothing so far except just joining student startups :p",
            "Congrats man!! I have the first interview for Facebook coming up, any tips?",
            "Congrats dude! From your experience applying to all these companies- how do you get passed the resume screen? What are some things that are a MUST have in order to get to the interview rounds?",
            "the amount of motivation, anger, inspiration, and jealousy that this subreddit gives me is I N S A N E. Congratulations dude.",
            "Congrats!!! Is this for an internship or full time?",
            "Good shit man, I can even get interviews from them Sadge",
            "Facebook is probably the best company you listed here, besides maybe Bloomberg.",
            "Congrats!!!",
            "How did you get an offer from facebook",
            "Thank you for the motivation! Any advice for those that are struggling to get interviews?",
            "Congrats man. To all the people who are looking for jobs and internships. if you live near any air force bases apply there. They're looking for CS people all the time and can help with schooling. Included in that is any branch of government including the FBI.",
            "Omg that is so awesome!! Congrats 🥳",
            "Congrats! At least you got rejections for the other ones, haven't heard anything from most of the places I applied to. (Including the ones you mentioned) Honestly, companies should have the courtesy of sending rejections. Like an automated email takes literally no effort.",
            "Bro damn you got a rejection from Apple? They've never even gotten back to me (ever)",
            "Are FAANG jobs ever work from home, or you have to relocate?",
            "Did you use a referral for fb? Congrats on the offer man!",
            "מזל טוב גבר"
        ]
    },
    {
        "post_id": "15qcyco",
        "author": "None",
        "title": "Am I the asshole for joking back with the interviewer during my final round?",
        "url": "https://www.reddit.com/r/csMajors/comments/15qcyco/am_i_the_asshole_for_joking_back_with_the/",
        "score": 552,
        "num_comments": 150,
        "created_utc": 1691967296.0,
        "selftext": "So for context im british and we often say curse words without much meaning behind it.\n\nAnyway, im on round 3/final round with the Hiring manager and engineering senior in the corner observing.  theyre asking basic questions like 'why this company' 'projects' etc. she asked me a question in a mocking tone like 'you probably dont have any offers atm do you?' and I jokingly said \"haha piss off\". The engineering guy looks up, closes his laptop and she does the same. Tells me to leave for a bit, then comes out saying sorry but they wont move on with me.\n\ni said sorry multiple times but they just wouldn't listen and claimed I wasnt compatible as an excuse. did I fuck up or was it the right response?",
        "permalink": "/r/csMajors/comments/15qcyco/am_i_the_asshole_for_joking_back_with_the/",
        "comments": [
            "It was the right response, do it again",
            "[deleted]",
            "[deleted]",
            "Bruv it’s not a good look innit. 🤕",
            "Could you have responded differently? Yes. \n\nDid they also ask an inappropriate question? Yes. \n\nYou’re getting interviews, so don’t worry, think of it as a bullet dodged",
            "I'm not buying that this would be okay even in Britain",
            "YTA but also fuck em\n\nBeing condescending because you're in a position of power deserves that response",
            "I like British people, until they start speaking.",
            "You could've replied to that differently. Joking like that during an interview probably isn't the best idea",
            "haha, they actually pissed off, innit? XD",
            "[deleted]",
            "Well deserved response imo",
            "Keep doing it ☺️",
            "I hate that question when interviewers ask it because are they trying to make you feel bad that they’re your only hope?! I appreciate you were trying to be funny, but you didn’t quite come off with the right humor. I don’t think it was the cussing as much as that phrase specifically. It’s heard as a “Fuck you for asking me that!” Which is not the right response in that situation!",
            "Honestly, it was rude of them to assume you weren't valuable enough to have another offer. You believe in yourself, my dude.",
            "Your flair says you are a freshman, so I think if you are fairly young than this is a major factor. Fitting in with the older-than-you people at the office is a whole social game of tight rope and you 100% make some mis-steps that will be unexpected until you start to know the quirks of each person. They may treat you a little weird if you’re too shy, but acting too comfortable is a way more dangerous side to err on. I’m actually wondering if she was upset about the way you answered the question right before she made that rude statement. It sucks, but you are “selling yourself” in an interview.\n\n\nAlso, you have every right to distance your business relationship with any company or person, and it does sound like the interviewer was quite unprofessional so distancing may be the right move if you don’t want the job. However, usually you want to still “sell yourself” and leave your options open until you’ve taken some time to think if you want the job or not.\n\n\nNext time, try to politely correct them and say “I do actually have a couple other offers.” And explain a little more and then quickly restate two or three differentiating skills that you have to offer that make you stand out as a candidate. Then later on reflect if these are actually the kinds of people you can stand to work for, and politely reject the offer if you feel it doesn’t suit you. Give yourself time to think.\n\n\nOverall your comment, whether or not your realize it, burnt a bridge, which feels good, but you need to really pick your battles and always make it so you have the most options. I’m super happy that you offended those assholes, but you don’t really have the clout yet to be out there making big statements to people especially if it could hurt your career.",
            "Should’ve just called them bloody cunts, why beat around the bush.  But that was a douche move on their part and you did great.  Move on and read the room better next time.  Make sure to post this experience on Glassdoor.",
            "Bro what is this",
            "Nah fuck being nice to people who aren't nice to you.",
            "Sue them for racism",
            "https://preview.redd.it/qeq8iuh0rzhb1.jpeg?width=1088&format=pjpg&auto=webp&s=f679f50a3bd8a5b82550f7931ff177af97a87e96\n\nBruv it ain’t looking good",
            "Thas mento",
            "Nah I kinda fuck with it.",
            "Haha this was funny, I need a bottle of water now \n\n/jk",
            "What? This was a perfect response to such a question. You dodged a bullet OP. No good company will ask a question phrased like that",
            "what she said was odd for sure but your response was even worse",
            "🤷‍♂️\nProbably won't get the job, but who cares.\n\nMy attitude is I am me. If you don't like it, I don't care, you weren't going to hire me anyway.\n\n0 time for these childish games. Same with dating. If we don't mesh, cool, I'll find someone else.",
            "Sorry but they have one hell of a stick up their ass for getting worked up over that comment. Honestly I think you dodged a bullet. \n\nAt the end of the day we’re all human. They initiated the banter and you just continued it. Rejecting you for doing a such a normal and mild thing is ridiculous and tbh they did you a favor",
            "YTA\n\nIt shows a lack of awareness, soft skills, self-control, decorum, courtesy/politeness, etc.",
            "I recommend not saying that.",
            "I'd still hire you, but you sound like a bad culture fit for this shithole company.\n\n&#x200B;\n\nEdit: only if you come off as cool-British not if you come off as and asshole-British.",
            "You should’ve left the interview right after saying piss off. Add in a “you’re not a good fit for me” and T-pose to assert dominance. \n\nThen apply to the same place again and pretend nothing ever happened.",
            "“Besides this one, I have one from each of your mums”",
            "…..obviously it was an f up, if it cost you the job like that….\n\n1) don’t swear in an interview\n2) don’t swear with professional contacts or people you don’t know\n3) she’s a woman, so it looks extra bad to everyone. They might label you as a sexist too\n\nAlthough yes it is irritating to ask it that way, sometimes people word things condescendingly. I’ve gotten pissed off at work/by recruiters before for sure. Don’t show it to strangers ever. From their perspective, not only is it disrespectful (they’re taking time to interview you, which is company dollars), it gives a bad experience to the hiring manager who may wonder if you said that because she’s a woman+ they’re worried you might be unstable and hard to work with after they hire you",
            "Maybe this is your lesson. Better not joke around in interviews. Do extra careful and move on.",
            "lol\n\nNot an asshole, but you’re not smart for it.",
            "not the asshole but sure are dumb if you actually wanted the job.",
            "Is this a shitpost? You know, a mild but sort of believable version of the \"I swore at HR in the interview, do you think I'll receive an offer?\" shit post.",
            "Inappropiate from interviewer for giving an unprofessional tone like that. But you should never get on the same level nonetheless",
            "Why would you cower out if they behaved like that?\n\nFkn double down bro have some balls",
            "I get that you're joking... but I've legit done similar things in interviews and gotten offers.",
            "(Assuming you were in the US)\n\nWe Americans are prudes, \"bad\" words are touchy in the office. It really depends on the office but you've got to be careful.",
            "i’m all for the era of CsMajorsJerkers",
            "You absolute bellend",
            "I think if you had some banter going with them, then it would be a good response andshould be fine joking around, but as it sounds like they were very serious, and more \"out of the blue\" for a response, probably not the best idea. \nThough, if they're going to throw you out that quick, then you'd probably get fed up working for them.\nNormally, it's fine when you're more friendly, but generally not the best ideas for an interview, expecially if they are a very serious company. \n\nOn the other hand could be perfectly exceptable at a startup if it's just a few people. Just need to judge based on the atmosphere.",
            "It was the right response it just cost you the job lol",
            "The correct response was \"would i be here otherwise?\" and let them figure out what you mean by that.",
            "Just assume people are sensitive and can’t handle a curse word. I curse quite often and have found even though I don’t mind it and seems to be acceptable to a good majority of people some will take great offense to even hearing a curse word.",
            "Honestly, not the asshole.",
            "Probably worth it, what a major dickhead she seems like",
            "I've seen some piss poor candidates come straight from university... but this one takes the cake.",
            "Yes you threw that interview off the cliff. lol   It is safe to say,  I dont think they expected that type of response back.",
            "Were you interviewing with Americans? They're famous for this stick up the ass attitude. Interviews go both ways so you probably dodged a grenade",
            "they seemed arrogant af. stateside it could come across as almost saying f-off. but as a hiring manager i would have just rolled with it and completed the interview.",
            "NGL. This was one of the hardest things to get used to while working with Brits. But I'd say it was too much on the interview.you can go ham with the people you have at least some rapport with, not random people that try gauge you.",
            "You're focusing on the wrong thing OP, you didn't lose the job because of how you responded, it was lost before for some reason. Her saying that thing about your offers means they had already made their decision. I'd look back a bit further and figure out if there's anything you could do better",
            "you did great but the thing was... you weren't management-level enough. you need to tell them to fck themselves instead like that other guy. They were actually looking for that the entire time and you fell just a bit short.",
            "Sounds like their “culture” sucks then",
            "Should get them Nandos as an apology",
            "Shit post Sunday?",
            "Can't tell if this is a shitpost Sunday post or legit. In case it's real, OP, sometimes companies can be a little self-righteous. If it's common to curse in your area, they shouldn't have reacted this way.",
            "This sub is trash",
            "they  had other questions based on the answer to that question.",
            "I'll never understand why senior people in the industry are such assholes",
            "I’ve said ‘fuck off’ to an interviewer and passed the interview but it wasn’t in your type of context, I was joking around at the type of questions being asked (I think I got asked how to centre a div and I was like fuck off I don’t know that) \n\nIt worked to my benefit Cus my interviewer also thought it was a terrible question, so I was laughing with them. In your case you are laughing at something they said so it doesn’t quite do it. \n\nI’m also British btw",
            "Love it",
            "their loss fuck em",
            "haha piss off dude",
            "how did they tell you to leave after their laptops closed?\nin any case though, fuck them hahah",
            "U wot m8… BRUV it was a prank I swea",
            "I'm not British. I am an American. If you said this to an American company then yeah I don't blame them lol. If it's with a British company, and you were dealing with fellow Brits, then I don't have a clue.",
            "Not the asshole, divorce CS degree marry the interviewer",
            "very good result for You - people without respect deserve no respoct\n\nyou should add 'biatch' at the end",
            "I probably wouldn’t have answers like that, but I would have said something like «I am currently interviewing for positions at a salary between <highest number> and <lowest number> plus some interesting benefits and vacation time XX, with really interesting responsibilities and options for professional growth. Something about your job ad really caught my eye, so I would love continuing the conversation.»\n\nJust be smooth AF, if I can handle it with anxiety and stuff.",
            "Why did you respond like that? did you feel offended when they said it? if so then you should have stand your ground when you said that instead of apologizing.. but if you only said that jokingly then it was a very poor way of saying it",
            "As a fellow Brit, I say fucking let em have it. Do you want to work for someone with that sort of attitude?",
            "You left out c***, that was your mistake.",
            "Politics and a power move .. they got the leverage and used it when u gave them a chance .. thats the game smh",
            "They were a bit of a dick but your response was inappropriate.  \n\nA better response would have been that the tone in your question is inappropriate and I don't think if the company's culture finds that acceptable than this isn't the right fit for me - and just walk out.\n\nYou then should write the head of HR about the incident.\n\nFYI - a lot of recruiters will often find silly reasons for not moving on with a candidate - you just fell for it.\n\nIn either way you dodged a bullet.\n\nI would suggest taking a breather before responding like this in the future.",
            "On a bloody chewsday no less init?",
            "Your only mistake was apologizing for it",
            "They call that \"Not a Cultural Fit\".",
            "wankers",
            "bruv i thought u said u british not french 😂",
            "Least sociably inept cs major:",
            "The correct answer is I have 6 offers and I'm closing on one that's 30% above this salary at the end of the week if you can't match it.",
            "Next time just answer like \"Oh no you are my last hope. Nobody wants me. If you don't employ me I will cut my belly off.\"\n\nThey will look quite different than before and understand that you spit on them. May be this is an impressing move.",
            "Yes ma’am dems the fax.",
            "I would say “ummm…” then widen my eyes like a hawk until someone says something",
            "nah u're just a menace to society. keep it up",
            "\"Haha, you don't have any other candidates of my caliber, do you?\""
        ]
    },
    {
        "post_id": "1c0ydrp",
        "author": "SirGoatFucker",
        "title": "We’ve heard of the unpaid internship, but what about the reverse-paid internship",
        "url": "https://i.redd.it/7q8ffvbr8qtc1.jpeg",
        "score": 548,
        "num_comments": 48,
        "created_utc": 1712787549.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c0ydrp/weve_heard_of_the_unpaid_internship_but_what/",
        "comments": [
            "Damn some interns are getting paid 120 an hour while others are paying for it. Crazy range",
            "4500 people in 2 years… Indian immigration scheme spotted",
            "Once upon a time, I wanted to be an audio engineer and this is pretty much how it worked too.. or just not paid period.",
            "Lmao what a joker",
            "Lol, is it a company based in India? And advertising in Canada/ us markets lol",
            "I got a 90% similar message. I told him to fuck off.",
            "Well I've seen this. Indian website, and they tell you they'll give an internship, recommendation letters, certificates etc, but you have to pay 700 USD or something lol. Don't know how people can even afford it in INR.",
            "This is shit, but not untrue. I am from India and back when i was doing my internships same thing used to happen. I wont comment on immigration scheme 🫡🤣🥲 but its common. Its crazy",
            "🤣got the same message. companies called “Oeson”",
            "Imma start scamming like this too",
            "This looks like one of those programs where they train you (at minimum wage per hour) and place you with a client, BUT WORSE.  You pay a training fee?  Total scam!",
            "The bad grammar and punctuation makes me think this is a straight up scam.",
            "You mean a scam. It’s just called a scam.",
            "No offense but this is how the dumb kids used to do internships at my college for college credits.",
            "It’s old news in China 🇨🇳🤣",
            "I’ve heard about it in other careers but not cs",
            "So is this a school?",
            "Looks like a scam tbh, if there’s no gaurentee of an internship who’s to say they aren’t farming you for a “training” fee?",
            "And then the sender of the email updates his resume - got ceo internship",
            "Hell at this point I might just pay it if it helps pad my resume a bit.",
            "I love to see this. Quite amusing",
            "Just like school!",
            "I’m currently in a reverse paid internship",
            "My coding \"bootcamp\" did this too. Guaranteed internship! They just don't mention that it's with their company and you're still paying them during it.",
            "“Crucial” is such a chatgpt word",
            "I'm sure the department of labour would love to discuss the crucial aspect of paying for work",
            "I signed up for a 12 week unpaid internship from a “not for profit internship organisation “ only to find out they were charging me $2000 through my university, smh these people are capitalising off of students who desperately need experience",
            "Next season :-  reverse-paid job"
        ]
    },
    {
        "post_id": "131lszs",
        "author": "criticalhit10",
        "title": "Tips from the $420k offer guy",
        "url": "https://www.reddit.com/r/csMajors/comments/131lszs/tips_from_the_420k_offer_guy/",
        "score": 543,
        "num_comments": 92,
        "created_utc": 1682671014.0,
        "selftext": "get internship > do well > get return offer\n\n\nalternatively,\n\n get job > do well > don't get fired",
        "permalink": "/r/csMajors/comments/131lszs/tips_from_the_420k_offer_guy/",
        "comments": [
            "Instructions unclear, destroyed the code base.",
            "man the previous post was completely unhinged lmao\n\n&#x200B;\n\nfreaking people were upvoting the dude \n\n&#x200B;\n\nI cant belive it lmao",
            "based and leetpilled",
            "Anyone got a link to the post? I was half asleep when reading it the first time",
            "CHEERS!! Glad for you brother! Well, tell us about the journey. Your GitHub or any platform, so we can see how much effort we need to put in.",
            "Honestly it’s kind of a shit offer for the way he was talking. If you have wealthy genius parents, went to the best school and grinded hard, have a well established network, and only cracked 120k entry. U did something wrong",
            "This only works if you go to a T500 school!!!!!!!",
            "420 blaze it",
            "Link to the original post?",
            "Did you also go to Harvard? Your dad is the step brother cousin of the CEO of goggle right?\n\nMine is the sister’s cousin 2nd In law of TikTok,\nI am also shocked how I got the job😲😲\n\nMy tips are:\n1. Go to Harvard\n2. Go to private school that mentors you in Harvard\n3. Go to Harvard\n4. Use daddy’s money to go to Harvard\n5. And if all else fails:\n6. Transfer to Harvard",
            "[deleted]",
            "Got internship -> did well -> verbally assured return offer -> hiring freeze",
            "Unfortunately this is not a detailed plan and i failed.",
            "🤯",
            "based",
            "HFT for sure",
            "What if someone doesn’t have an internship?",
            "key is to be consistant. that is the meta algo",
            "Also > get lucky at a high paying position. Lmao your steps are standard for getting literally any job as a student",
            "Instructions unclear: got reported to hr",
            "I shall, with my own hands, lead the ruin of any enterprise that deigns to employ me."
        ]
    }
]