[
    {
        "post_id": "15f7vte",
        "author": "cashmuney666",
        "title": "Finally got a fucking job",
        "url": "https://www.reddit.com/r/csMajors/comments/15f7vte/finally_got_a_fucking_job/",
        "score": 550,
        "num_comments": 95,
        "created_utc": 1690883495.0,
        "selftext": "\n\nIt’s not really a job but an internship at least and I’m praying to Jesus Christ (I’m an atheist) that it turns into a full time offer. \n\nI almost gave up hope (that’s a lie I gave up) but I suddenly decided to use a connection and apply to SpaceX and got it ☠️☠️☠️\n\nEdit: \n\nThe first thing was a phone screen with a recruiter. Then the technical assessment was a coding test where you had max 8 hours. Those that completed it in 4 hours were “feasible” candidates. After that it was an interview about talking about your resume and answering some questions with a technical manager. The interview was actually quite tough he was grilling me on my projects and internship and asking a lot of technical questions. I actually thought i totally failed the interview, but I guess I did fine. Remember this is for an INTERNSHIP so they might’ve been more lenient than for a full time swe job \n\nI just graduated last month and over school I immersed myself in technology (docker, kubernetes, Kafka, AWS, microservices, APIs, React, multiple backend frameworks, learning multiple languages and how they work, etc) that is used widely in the industry. Even today I’m still building projects and apps. Something that really would impress and employer. \n\nI think I just impressed them with what I did and the apps I’ve built. I GAVE UP DOING LEETCODE because I think it’s pointless and BORING. I would rather build a cool app. Fuck your standards. I do what I want",
        "permalink": "/r/csMajors/comments/15f7vte/finally_got_a_fucking_job/",
        "comments": [
            "Yeah well I took a shit this morning",
            "The key here is the word \"connection\"",
            "Get me one too",
            "Bro went from nothing to spacex, respect lmao",
            "HELL YEAH OP!!\n\nNow, keep applying. Never stop. You've heard of ABC in sales? Always Be Closing? Your mantra is now ABA - Always Be Applying.\n\nSuper happy for you my person!",
            "Awesome, congrats.  I'm a senior engineer and you seem exactly the kind of person who would be great to work with (hell, maybe i'll work for you one day!).  Keep learning, enjoy, and have fun.",
            "Internship at SpaceX fuck yeah! All the best to you.",
            "[deleted]",
            "Congrats lol let’s be friends 😂😂😂",
            "Congratulations 🎉",
            "XAE12 is that you?",
            "What sort of coding test will take 4 hours? Is it a mini project?",
            "Hardest step is getting that first job",
            "Good, now get to work.",
            "congrats!",
            "Eh, I was thinking you decided to go for a fucking job, not a SWE job...",
            "Can you post your resume? Giving us freshers an idea about it.",
            "This in US? Broadly speaking we can’t do internships after graduating right? Where is this?",
            "You say you graduated, and then got an internship? How os that possible? I thought internships had a requirement that you return to study for at least a semester after completion?",
            "Elons companies work you hard and don’t pay well but congrats and in this time it’s huge!",
            "Are you graduated?",
            "Nice",
            "Nice man, nice",
            "Congrats, what is the pay?",
            "Sometimes it's not what you know, but who you know. Networking is a skill and it matters. Good for you, OP.",
            "Hey mate congratulations!\nCan you share some information please? \nHow was the process like? Was the interview easy? Hard? \nWhat is the pay?",
            "The title is misleading. Your job is of an SWE.\nCongratulations tho... All the best.",
            "Congrats!",
            "Good shit!! 👏🏾",
            "Congratulations!",
            "I don't know who you are or anything about you, but damn am I happy for you.",
            "saved useful",
            "Congrats",
            "I agree with the projects stuff, can you provide examples of what kind of projects you did that impressed them, or what projects you had on your resume?",
            "Max 8 hours? Feasible candidates complete it in 4? Holy shit are these coding assessments actually that long? Or is it just like a 1 hour test with a long window of time to do it?",
            "You should have looked for a *regular* job.",
            "Best of luck for the future champp!",
            "You said you gave doing leetcode. Didn’t they ask dsa problems?",
            "Can you elaborate on \"multiple languages [and frameworks]?\"\n\nDid you also make example projects so your portfolio showed different stacks?"
        ]
    },
    {
        "post_id": "1cdkr0a",
        "author": "coding_for_lyf",
        "title": "The Government Is Now the Hottest Tech Employer in Town",
        "url": "https://www.wired.com/story/tech-jobs-government-layoffs/",
        "score": 538,
        "num_comments": 89,
        "created_utc": 1714136306.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cdkr0a/the_government_is_now_the_hottest_tech_employer/",
        "comments": [
            "I got my job in gov as soon as I graduated. People are right that they suck at the concept of agile, but they need software. We’re here to make it, and the young grads shake things up by trying to bring the concept of dev work to the 21st century. (Agile was written in 2001)",
            "The company I’m at gets funding from the government. A few months ago I referred my friend, who got laid off from Microsoft, to around 10 SWE openings. She wasn’t able to get an interview for any of them.\n\nI was actually quite surprised and thought there must have been an internal error. I set up a meeting with HR and told them about this. HR told me that each opening receives thousands of applications.",
            "I’ve been applying to government jobs since they “hire anybody” and started to go crazy when I didn’t hear back. I had my suspicions that there was competition but I didn’t think it was that bad.",
            "LOL no.. govt jobs are also being swarmed. CA jobs are are 800+ applicants",
            "Hiring another 100,000 developers won’t help the government. It has almost no technical leadership. You don’t have product people. You don’t have risk taking leaders. Everything around you is designed for stability, not disruption. Even if they do find the right leaders, without the ability to fire, hire, and reorg, and take bets, they’ll never really get it. ",
            "Dubious notion of “hot” — a bit like saying being a barista is very hot among liberal arts majors",
            "#1 employer of Argentina is the Argentinian government",
            "I remember my unemployment took 6 months to get here when I was laid off lmao. All it needed to do was check a box cause all the info was provided from previous employer",
            "This article is from November of last year, chill",
            "I got a conditional offer recently from a government agency with three letters pending security clearance and am unsure, if I end up getting cleared, whether or not I want to make the move to work for the guberment. Right now I work for an institutional investment firm and make pretty decent. Anyone current doing software dev in the IC or Defense area have any input on their experience so far?",
            "What do y'all do about the whole security clearance thing? Almost every job posting I have seen wants you walking into the door with it from IT to developing but you have to have a company to sponsor it in order to get one. I've been ghosted by each one I have applied for, figured it is just like the whole experience conundrum.",
            "Hire me daddy Lincoln.",
            "Yea government job was my last hope now thats being snatched away too, I really really really wish I would’ve known the job market would be this fucked before I chose to pursue this career",
            "In my 14-ish years of experience since graduating all of it has been as a government subcontractor.",
            "Are international students or non US citizens eligible for working for the government?",
            "Until you realize that working for the government or a Federal contractor is one of the most toxic hyperpoliticized work environments possible, with all the bad management tropes in full force, and gods help you if you don't agree with the establishment messaging on NATO's expansionist war, escalations toward Russia and China, the \"past tense\" pandemic, Israeli war crimes and crimes against humanity, or so on. It's like a time machine to mid-20th century memes, the stuff the citizenry overthrew in the 1970s all back with an exploitative degrading vengeance like democracy is irrelevant. Good luck with *that*. But, if you have a tough stomach, with pliers and screwdrivers you could help disassemble the beast from within."
        ]
    },
    {
        "post_id": "wcs927",
        "author": "None",
        "title": "Can we ban is CS major worth it posts?",
        "url": "https://www.reddit.com/r/csMajors/comments/wcs927/can_we_ban_is_cs_major_worth_it_posts/",
        "score": 543,
        "num_comments": 75,
        "created_utc": 1659283754.0,
        "selftext": "Every. Single. Day.\n\nSame posts, same responses",
        "permalink": "/r/csMajors/comments/wcs927/can_we_ban_is_cs_major_worth_it_posts/",
        "comments": [
            "Appreciate the feedback (both with regards to the OP and the \"which laptop for university\" posts). \n\nI'm personally undecided on banning them entirely (because neither are \"out of scope\" for this subreddit per se), but one option I am thinking of is to force all such questions into a dedicated thread (like what we have for Amazon). Of course, with live chat turned off.\n\nWhat do you all think about that?",
            "I'd honestly prefer if someone created a bot that simply responded \"maybe\", and then the auto moderator locks the thread.",
            "Is a cs major worth it? I’m really thinking between underwater basket weaving and computer science. The thing is people are saying that jobs are being outsourced and I don’t want to have to move to India or something. It looks like underwater basket weaving might have more of a demand. What should I do? Sorry if this question might be a little repetitive.",
            "Also which laptop/macbook for uni posts pleaseee?",
            "Hey guys, is 64gb ram enough with i7 and nvidia 3090 to program?",
            "Is CS oversaturated? I’m so nervous that I won’t be able to find a job after graduation and I’m questioning if I should instead switch to another major ending in arts or studies. Those majors have so many job openings it’s unbelievable!",
            "Just grind Leetcode.",
            "amazon",
            "Is advocating to ban this kind of post worth it?",
            "Omg do I need this macbook that cost 3k to compile hello world programs? I know I don't need one, but please make me feel less stupid by saying yes you need it, I need an excuse to have one and look cool while in class before I drop out in my second year because I can't do basic algebra.",
            "I kinda prefer having a lot of freedom than eliminating too much posts unless it's strictly immoral or trolling or off topic or something like that.",
            "Sure.\n\nBut then we'd have to change the name of the sub to r/stackoverflow.",
            "But how else will I know if people on a CsMajor sub believe a CS major is worth it?",
            "VsCode or eclipse, which one is better for Java?",
            "Amazon didn’t send me an OA. Is my career over???",
            "yeah make a pinned message why degree is not completely useless and why codecamps are not equivalent to a degree",
            "I graduated and I didn't do any internships. Am I screwed?",
            "Is CS worth it?",
            "Is a CS major worth it?",
            "Is Cs worth it? I'm asking for a friend. For real though it can be worth, but if your skilled enough at coding and can pass their technical interview you'll get hired. The trick is making your resume look good and telling them that you can code. A degree gets them to look at your resume but probably not necessary depends who you want to work for to.",
            "Can we just ban this entire sub?",
            "Well if you don’t like it, then ignore them. It’s like being in the cats subreddit where people keep asking what breed their cat is every single day. The same post with different cats or sometimes the same cat. 😒\nBy now most people there are annoyed so they just ignored those posts and leave the ones who want to help the poster, help the poster by answering the question.\n\nBe like them. Times are changing and the layoffs make the whole field seem unreliable. Plus you have some people who are coming up and are curious. So of course there will always be people who always ask that question. Let them be and go on with your life.",
            "Keep ‘em coming!",
            "What a strange door to knock on…not judging just an observation.",
            "Please",
            "It's just a monoid in the category of endofunctors."
        ]
    },
    {
        "post_id": "1byqmv9",
        "author": "PixelSteel",
        "title": "It be like that",
        "url": "https://i.redd.it/mb2k98zo57tc1.jpeg",
        "score": 540,
        "num_comments": 4,
        "created_utc": 1712556487.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1byqmv9/it_be_like_that/",
        "comments": [
            "They're all bots",
            "Those notifications bring feelings of pain. Not joy.",
            "Appearing in searches is an absolutely pointless metric. It’s like walking down a busy street in a major downtown and having someone point out the job of everyone who walks by and gives a passing glance in your direction. “You know, he’s a C-Suite executive at a Fortune 500 company. That’s a hiring manager for an accounting firm. That’s the administrative assistant of a billionaire COO.”\n\nFascinating! But unless they actively engage in a conversation we’re all just strangers coexisting. I have less in common with someone I appeared in the search of than someone sitting the next table over from me at a restaurant, because at least then I might accidentally bump into their chair and say “Excuse me,” as opposed to LinkedIn where it’s impossible for us to communicate in any way unless they take the initiative and click on my profile, which they obviously didn’t or they would count as a profile view, not a search appearance view."
        ]
    },
    {
        "post_id": "182vorc",
        "author": "Dazzling-Rooster2103",
        "title": "Companies really be rejecting people on Thanksgiving...",
        "url": "https://i.redd.it/x98mmj7imb2c1.jpg",
        "score": 542,
        "num_comments": 27,
        "created_utc": 1700842696.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/182vorc/companies_really_be_rejecting_people_on/",
        "comments": [
            "[deleted]",
            "If someone is really marking these as rejected manually on Thanksgiving, you probably don’t want to work there",
            "Not everyone works in the USA. There are a lot of international employees working in countries that don't celebrate American holidays",
            "Oracle’s the boomer cloud anyway",
            "At least they are thankful for your application 😢",
            "Been there :(",
            "On the flip side: companies really making people work on Thanksgiving to review resumes",
            "Same. Woke up on Thanksgiving to Walmart giving thanks to my application after the last round of interviews.",
            "I saw a post on the recruiting hell sub Reddit about this\n\nThey create the emails 2 days before and have them go out on a 48 hour delay.\n\nApparently candidates are less likely to be confrontational about these rejections on Thanksgiving. If you want to annoy them just respond lol",
            "What did you expect from Oracle?",
            "Why wouldn't they?",
            "[deleted]",
            "Skill issue",
            "😂😂😂"
        ]
    },
    {
        "post_id": "1aqzkxn",
        "author": "Patient_Public482",
        "title": "SWE Internship Recruiting Season",
        "url": "https://i.redd.it/gibtp0p6mmic1.jpeg",
        "score": 535,
        "num_comments": 101,
        "created_utc": 1707949308.0,
        "selftext": "This is how this past recruiting season went for me. I don’t go to a t100 school. I don’t even think my school is even in the t500. Just some poor kid who learned how the game is played and grinded for a year. I also didn’t have a technical background before I started my cs major 2 years ago.\n\nA lot of interviews came after I accepted an offer I was happy with, which is why I skipped/declined a bunch. \n\nFeel free to ask questions if you’d like.",
        "permalink": "/r/csMajors/comments/1aqzkxn/swe_internship_recruiting_season/",
        "comments": [
            "Congrats! That's an insane applications to interview ratio. Any tips for passing the resume screening?",
            "Bro was really the other candidate they moved on with",
            "All I have to say is I am very proud of you!\n\n\nCare to share anything you feel is important?",
            "Did you have any previous internships? Any research/cool projects? Congrats btw, 6 offers is amazing!",
            "That’s insane ratio. Standard application process or through networking? \n\nApplications to interview rate for me has been 100:1, for full time roles. Have 3 years of work experience.",
            "> learned how the game is played an grinded for a year. \n\nPeople underestimate the significance of this statement.",
            "Congrats bro, that's a pretty good ratio! What was your grind like in terms of how you directed your time to max your resume?",
            "Very good, but how did you get so many interviews for your applications?",
            "Did you cold apply online or get referrals?",
            "Your resume must have been very good. What would you say had on there that separated you from the rest?",
            "Are your projects focused in a specific area/language or more of a diverse portfolio?",
            "Share your resume please",
            "What was your GPA, if you don't mind sharing? Did you put on your resume?",
            "Citizen/International?",
            "Congratulations bro I am super happy for you 💐, how did you search jobs like Linkdln or any other.",
            "Can i see ur resume pls",
            "As other have mentioned, can you please share your resume with us? We can learn a lot from yours!",
            "How’s the game played? Any insight that you have? Also, what company?",
            "Would you mind sharing an anonymized version of your resume? Getting that many interviews with only 60 applications is wild.",
            "How did you get so many interviews? Would you mind taking a look at my resume.",
            "Can you share your resume?",
            "Congrats bro, 👏",
            "Congrats on the offer. Could you share some tips for how you got inspiration for your projects? What kind of stuff did you work on?",
            "What did you have on your LinkedIn that set you apart? How did you describe your journey in a way that was unique and interesting?",
            "Any tips on how to format/curate resume according to job description? Any tools you've used for this purpose?",
            "How long did you prepare for leetcode questions?",
            "Can you send the resume in dm pls",
            "This is the craziest ratio ive seen so far,congrats",
            "Yo can you share your resume, I'm curious what it looks like. You can leave out any personally identifiable information if you want, I just want to see what kind of projects and internships you got.",
            "I am a sophomore who recently started taking CS classes and I think I would be able to become good at it one day. How would you tell someone like me to navigate his path? And what should be my priorities?",
            "I cant tell if its a troll, if its now, educate us please",
            "Drop resume 🙏🏼",
            "Congrats on the offer!! A lot of people think school is everything(it plays a huge role due to connections and job boards) but you can definitely make it without going to a t100 school.",
            "Things that didn’t happen for 500",
            "Fake",
            "Can I ask what ur offers were and how u decided on the company you chose?",
            "Any Tips for freshmen who are about to join college.",
            "Hey, I am planning on attending a CC due to my financial status. I know its extremely hard to find an internship while being a freshman and sophomore. Now knowing that what should I do in order to get an internship or some sort of work experience in the CS field while in CC?"
        ]
    },
    {
        "post_id": "zkpf0e",
        "author": "Tough_Palpitation331",
        "title": "Name and shame: Brex Rescinds",
        "url": "https://www.reddit.com/r/csMajors/comments/zkpf0e/name_and_shame_brex_rescinds/",
        "score": 538,
        "num_comments": 59,
        "created_utc": 1670915448.0,
        "selftext": "Note: Doesn’t seem like everyone is rescinded. Only US new grad not from intern conversion and had offer more recently?? Very small sample tho\n\nTitle. They Rescinded interns less than a week after I got my NG offer. I asked recruiter about it and trusted her BS answer. Fast forward today. Got email asking for an update call. Tells me they rescinded.\n\nF*k Brex. One week before my graduation and after I turned down other offers you pull this. \n\nI am so tired. I don’t wanna grind anymore",
        "permalink": "/r/csMajors/comments/zkpf0e/name_and_shame_brex_rescinds/",
        "comments": [
            "Don't let it get you down mate. If you're not an international or under financial constraints, consider taking a break and applying for jobs next cycle.",
            "Had my offer from a different company rescinded 2 weeks before graduation, extended my studies by 3 months, and just got a new job offer I'm accepting now. Don't give up. You got this :)",
            "To everyone that things it’s okay for them to rescind with such short notice… How come when a person is laid off from their job they are given at least a month’s notice and typically some form of severance pay, yet when someone who is likely in a lot of debt from school and hasn’t had time to build their savings net gets their offer rescinded with only one weeks notice, they just get told basically to fuck off? OP likely can’t even apply for unemployment because of a lack of work history. \n\nThis type of behavior deserves to be shamed. It should have nothing to do with business decisions, there was an agreement, they should honor it or at least provide some sort of compensation, not just kick them out with nothing.",
            "thats tough head up king",
            "Sorry to hear about this but never reject any offers during a time like this. Its better to accept multiple then renege one later before you're about to start at your first choice company. Try contacting those recruiters where you rejected offers from and see if they can help get you back in. Best of luck.",
            "Sorry to hear that OP. Make a linkedin post. It might help. Also shaming them on Linkedin would be good",
            "Shame. You deserve better, mate.",
            "Stay away from overvalued tech ‘startups’",
            "Contact your #2 offer. And all the other ones, if that doesn’t work. It’s just business, which can cut in your favor here.",
            "How much they paying you?\n\nEdit to clarify my question, stop downvoting: Are they paying you any severance or rescinded w/ no financial help?",
            "Just a doubt. Can we accept 2 offers at for the same time and decline the one at the time of joining the other. This way everybody is safe",
            "Contact the companies that had given you an offer and ask them if they are still willing to give you the same offer",
            "Lets keep this company in the name and shame list so that they cant ever get talented candidates again.",
            "Hey if we're allowed to reneg so are they :shrug:",
            "did you actually have an offer signed or did they say you were going to be getting one?",
            "your hurt feeling are not a cause to shame \n\nthey rescinded your offer               \n\nmany companies are implementing hiring freezes \n\nthe economy is garbage right now and is only going to get worse",
            "Child gets offended that business made a decision in the interest of the business.",
            "Whats an NG offer?",
            "I got sent an OA for an internship like, 3 days ago. Is it even worth doing?",
            "Same exact thing happened to me but with a higher fintech company. :(",
            "This is the worst position to be in. Do not be scared to reach out to previous companies you’ve rejected. They wanted you once and if you add a little razzle dazzle they should let you accept it again. No harm in trying.",
            "The fact that you turned down other jobs is the real bummer. No worries, in a few years this won’t seem like anything but a little speed bump"
        ]
    },
    {
        "post_id": "yn30wv",
        "author": "Dangerous_Macaron550",
        "title": "The Grind Is Finally Over 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/yn30wv/the_grind_is_finally_over/",
        "score": 540,
        "num_comments": 67,
        "created_utc": 1667675017.0,
        "selftext": "Y’all I love you so much thank you for the resources and advice (mostly just me lurking).\n\nAfter 107 generic ass “we’ll be moving on with another candidate” emails, I finally got notified that I was accepted to Google STEP this morning. I am so fucking overwhelmed with emotions right now\n\nEdit: (also PM for Discord invite link for 2023 STEP interns)\n\nHere's the timeline in case it might be helpful to anyone:\n\nEarly-October?: Applied ASAP as the apps came out\n\nOctober 11th: Received an email from a recruiter asking to schedule two interviews\n\nOctober 28th: Finished my two interviews!\n\nNovember 5th: Received offer through phone and email.",
        "permalink": "/r/csMajors/comments/yn30wv/the_grind_is_finally_over/",
        "comments": [
            "congrats! you rock",
            "Your life is set! Congrats!\n You have worked hard, take a break now and touch some grass!",
            "good for you bro. ~~I'm so tired already, wish I were you~~",
            "congrats!",
            "When did u interview? I interviewed almost a week and a half ago and I'm feeling pretty nervous",
            "good job!",
            "Congrats",
            "Username checks out!",
            "What year are you?",
            "If only google would respond to my app😭",
            "I remember that feeling :)\n\nBTW, it’s super common for Google to “trap” STEP interns 😉\n\nSTEP -> SWE -> FT",
            "CONGRATS",
            "congrats man! all your hard work paid off and this is just the beginning, keep working hard and enjoy your first internship!",
            "GG",
            "congrats 🎊",
            "Congratulations 🎉",
            "Congratulations!!",
            "Congrats!!👏👏👏",
            "I have a question, since I am currently considered a sophomore but will be a junior this upcoming spring, am I allowed to apply to this internship?",
            "You are IN! Congrats rockstar! I am emotional for you :)",
            "Congratulations 🎉…wishing you all the best during your internship",
            "congrats 👏",
            "hey! i can dm you i also got google step interview need some tips!",
            "how do u get past resume screen for step bruh are you a URM",
            "107 emails? That’s it? That’s just another Tuesday rookie. Ppl on here cry about the smallest of difficulties haha",
            "Google Step Program aint the real Google internship",
            "Yay!",
            "Congratulations!!",
            "It is an awesome feeling",
            " congrats from a former google step intern<33 you’re going to have a great time!! Pm me if u have any qs ab working there:’)",
            "congratulations!! hope you have a great summer :)",
            "eyy congrats ur gna love google STEP, mentors are one of the nicest ppl ive met",
            "The grind never ends.",
            "Congrats!!!\n\nCan you please tell a little about your resume and projects? Did you apply with a referral?",
            "Congrats! Just finished my second interview last Monday, pray for me"
        ]
    },
    {
        "post_id": "xfabpr",
        "author": "None",
        "title": "women in stem, keep pushing",
        "url": "https://www.reddit.com/r/csMajors/comments/xfabpr/women_in_stem_keep_pushing/",
        "score": 544,
        "num_comments": 73,
        "created_utc": 1663281859.0,
        "selftext": "Throughout my journey, \n\nI’ve constantly been made feel like men don’t believe in my skills. ):\n\nBeginning in elementary continuing onto college with a professor who implied I cheated because my test scores were “too low” to do that well on programming assignments. (And He felt the need to pull up all my past grades/test scores from previous CS classes.) \nHe brought them up as if my grades reflect me. Meanwhile I was battling through depression, i was barely alive those four years of college. I knew other people who copied and pasted code from GitHub, I wouldn’t do that. \nThis because I was asking for another chance to take his class because the pandemic screwed me and I failed the first time. \n\nMind you, it is the schools policy to allow you to retake one class as a CS major. He just decided to evaluate me to retake his class as if it was a high honor. \nIt felt like such a invasion of privacy He made the semester so rough for me, I was currently dealing with PTSD. I have major anxiety, this presented itself in exams.  That’s the reason I didn’t do well on exams. I didn’t feel like I needed to disclose my person life  to my college professor so I didn’t. Also reminder to everyone, there is more than one way to identify ones skills.  \n\nJust venting because I wish more men (and women too) supported women. didn’t have the best experience interviewing with a man recently. \n\nEspecially as I’m fighting HARD to be 2% of Latina in tech, I wish I felt more supported. \n\nI’ve gone through so much shit in my life and I’m confident in my abilities. So I’m never giving up ❤️ I’ve got big dreams.",
        "permalink": "/r/csMajors/comments/xfabpr/women_in_stem_keep_pushing/",
        "comments": [
            "You have my full support! If your intuition is authentically dedicated, then don't let anyone tell you otherwise. Humanity needs everyone on board who is willing and able to go the extra mile to truly advance all STEM fields. Spread those wings and take flight! I encourage everyone to step out of their comfort zone to solve real world problems we all face so don't stop believing in yourself. Be the change you want to see in the world, and you will manifest it in due time.",
            "Latina here too trying to get a CS degree. I’m honestly scared lmao 🤣",
            "Keep going, you got this!",
            "Sometimes I try to forget I am a girl just to live by. College kids are mean. My classmate told me, \"you're gonna find a job easily because you are a girl, you are just a diversity hire\"\n\nNow I am making six fig fresh grad I don't have time to laugh at him.",
            "I commend you for your dedication and determination to finish. My wife had a similar experience of being singled out as a woman in IT. She would get comments from other classmates like “you did well, for a girl.” Why do men think that’s a compliment? She never had a professor doubt her like you did. That sounds awful and I’m sorry you had to endure it. My wife also had issues with depression, too, but she overcame it and finished.  Now she is thriving in her career. She is who inspired me to go to school for CS.",
            "Ay I’m a Latina too!!! Keep going!",
            "Talk to your school’s disability office about getting extra time on exams for your anxiety, assuming you have a diagnosis.",
            "🔥💅slay those big dreams lady 🙌",
            "girl bossss💅💅💅slayy queeen",
            "That's awesome! Yeah I always thought the girls in my class were smarter than the average guy so I thought everyone else thought like me and that female discrimination in tech was a myth.   \nThen I talked to them and was amazed how many of them were accused of cheating. One of them described the harrowing process of a Dean making her break down crying in an \"ethics trial\" before saying she's innocent because she was showing so much regret. \n\nMeanwhile a lot of guys blatantly cheat but because they look nerdy and are male they are never accused. I didn't want to believe it but the examples I've seen are too obvious.",
            "[deleted]",
            "100% you got this!!!!!!",
            "You got this op!",
            "A lot of computer science folk lack people skills. They’re the cold blooded intellectual type who don’t understand things like test taking anxiety. That’s exactly why STEM needs more women. You’ll make it for sure because it’s hard to beat someone who never gives up and I can tell you’re not a quitter.\nJust keep swimming, just keep swimming 🐟",
            "Love to see more Latinas in computer science. I know many men in tech can be sexist whether they realize it or not because my sister has told me of some of her experiences. But don't let that discourage you they're fools and y'all are killing it!",
            "So very fucking much this. The roadblocks from boys will not stop us!",
            "\nLadies it gets better! I’m an Afro-Latina with ADHD and I have my BA and MS in CS. I’m happily thriving in my career as a software/web developer. My biggest tips are:\n* Find a good study buddy or group\n* Go to office hours and/or regularly communicate with your professor where you are struggling\n* If you are struggling with mental health or mental disabilities, reach out to your school’s disability services. YOU CAN REQUEST EXTRA TIME FOR EXAMS AND ASSIGNMENTS (and your teachers can’t legally deny you this)\n* Don’t worry about grades/gpas if you don’t have to! Just try hard to understand the concepts and take good notes so you can use them in the future (I wish I did this because preparing for interviews sucks)\n* Also don’t worry if you fail a quiz, lab, or class, it’s not the end of the world. I failed AI and Discrete Structures twice and my job could not care less\n\nSending my fellow women in STEM loads of support✨💖",
            "The day they implement equality of opportunity instead of equality of outcome you will be respected as a person in STEM (and not a woman in STEM or Latina in STEM). Most women/minority that get into STEM don’t deserve it. They most likely got in because of anything but their merit and if you get in without merit you will not be respected.",
            "Black people in STEM, Keep pushing. Everything said here relates to us except white women make more money than both black men and women.",
            "I just recently had a Latina intern finish up with us and she was great. She put in much more effort than the other intern (male) and she had a much better attitude. The dude was lazy and needed hand holding for the most simple tasks where she actually paid attention when I helped her and absorbed the knowledge and would apply it moving forward. \n\nSo basically what I'm saying is, you got this!",
            "Latina here! I have two small boys and worked full time while attending university for my Bachelors in CS and i am proud to say i will be graduating this semester.keep your head up you can do it! Dont let others get the best of you its a journey dont give up!",
            "Latinas in tech unite! I'm just starting my CS journey.",
            "I’m a Latina in tech. OP, keep fighting. Peoples assumptions hurt them. They empower you. If you want to talk, if you’re still in school and want guidance (I work at a major tech company) please reach out. \n\nI have cPTSD. I will do and be the person I dream because despite my trauma, only I define me. This is the most refreshing and positively inspiring post I’ve seen for those (like me) that often feel marginalized in ways it’s difficult to explain. Never let somebody make you feel small.",
            "Just stay focused on your dreams and try to learn new things everyday. Think about something you really want and know you will have it if you keep working hard towards your goals. You can do anything if you work hard enough towards your goals. Don't ever give up! I've had a rough life too and am also a woman. I just got my first job as a software engineer a month ago. I haven't even graduated yet. I don't graduate until December. I hope to inspire other women in tech. Good luck and never give up on your dreams. It feels amazing when you finally get that dream job you worked so hard for. Best feeling ever !!!!",
            "Nice!! I don’t know about other men, but for me I find women in tech to be admirable :))",
            "🫡",
            "Sorry you've been through all that, but I believe in you lol \n\nKeep pushing 💪💪",
            "Yesss as a Latina in tech as well!!",
            "Keep going!! We need new faces in tech from more diverse walks of life. Sorry you had to deal with all that.",
            "I believe in you! I know a lot of men are sexist assholes but some of us are trying to help make the industry better.",
            "I advise you to get the answers from chegg then revise them",
            "Yo this makes no sense to me cuz like most girls in stem be mad smart",
            "[removed]",
            "[removed]",
            "Hun we’re in mean girls but the big girl lite version.",
            "I dont know you, but you got this and ily! <3 you will do great things",
            "2 percent ?? That statistic honestly surprised me",
            "i love seeing posts like these, keep grinding",
            "YASSSSSSSSS",
            "Feel you on this one girl lol"
        ]
    },
    {
        "post_id": "1clvshp",
        "author": "loltammy",
        "title": "When is the last time you had a final like this? Stolen from theoretical CS class discord",
        "url": "https://i.redd.it/eacbaig8rvyc1.png",
        "score": 539,
        "num_comments": 41,
        "created_utc": 1715033695.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1clvshp/when_is_the_last_time_you_had_a_final_like_this/",
        "comments": [
            "It's a bait post",
            "I took a psyc course as an elective and that shit was harder than all my cs courses. Maybe I’m just bad at memorization",
            "In my university, some courses are designed for students from unrelated areas. For example, my major is Economics and I have taken Intro to IT which taught you to track changes in Word and write some simple HTML, and Intro to Chem which showed you two lines between two elements and asked whether it is a single/double/triple bond. It's unfair to compare these courses with those taken by major students.",
            "Dogs -> Bark, Cats -> Meow, Pigs -> Oink, CS Majors -> Unemployed\n\nEasiest A of my life.",
            "What? No shot in the world. 🤣",
            "Psychology in middle school or troll school.\n\nCs is a hard major but so are some other majors.\n\nBut well have something in common.\n\nWe hate HR.",
            "Mine was my operating systems final, paper exam but open book, we did a trial exam for revision with the tutor who walked us through the questions in the final class before it so everyone just printed lecture slides and the mock exam. We get in and half the exam is just the mock one questions with a few changes numbers and the rest of the exam was answererable directly off the main slides for that topic. Easiest exam I've done at uni for CS.",
            "Still fail anyway because professor doesn't like me",
            "The liberal art classes I was forced to take at my school had exams close to this. Not joking",
            "Questions like question 28 on a closed book test would be my worst nightmare",
            "can confirm",
            "Explains  the pride marches and all",
            "I walked by a business class once and saw “What is the purpose of a business entity? To create wealth” on the board.",
            "bruh discrete 2 with gerber😭😭",
            "Even in the humanities classes I took, there was a good amount of work. So, never? \n\nI had to write a 20-something page paper in a week for a final once, that was a fun time. ",
            "What are they getting paid?",
            "I've had my fair share of professors who just don't give a damn about the final and just do stuff like this to help boost student's grades.\n\nIf you ask me, it's a boon and I appreciate it. Pass or fail, what you get out of college is entirely your own responsibility, this isn't high school. And college finals are really just a typical exam that's weighted more.",
            "Isn't psychology a stem major?",
            "The ones that pass this test will become the bosses of the rest.",
            "Probably bonus questions at the end of the test.",
            "Last Friday",
            "Psychology is part of STEM you BDB."
        ]
    }
]