[
    {
        "post_id": "1aqfznx",
        "author": "Lopsided-Medicine-32",
        "title": "Learning Computer Science might be not a smart choice in 2024?(Jensen huang Nvidia CEO)",
        "url": "https://www.reddit.com/r/csMajors/comments/1aqfznx/learning_computer_science_might_be_not_a_smart/",
        "score": 536,
        "num_comments": 260,
        "created_utc": 1707890775.0,
        "selftext": " \n\nInterview of Jensen Huang - Nvidia CEO has some interesting insights.\n\nQUOTE - \"It's going to sound completely opposite of what people feel. You probably recall over the course of the last 10-15 years, almost everybody who sits on a stage like this would tell you it is vital that your children learn computer science. Everybody should learn how to program. In fact, it's almost exactly the opposite. It is our job to create computing technology such that nobody has to program and that the programming language is human. Everybody in the world is now a programmer. This is the miracle of artificial intelligence. For the very first time, we have closed the gap; the technology divide has been completely closed.\" [https://www.youtube.com/watch?v=iUOrH2FJKfo&t=1090s](https://www.youtube.com/watch?v=iUOrH2FJKfo&t=1090s)\n\nRegarding, he's literally an AI company CEO who will be biased to say good things for AI. Still, I think the fact that he encourages studying something other than computer science (for him, he said he'd choose biology if he went back to school, interview timeline 21:10) says something about the future of computer science. I know he's not the person to predict the future, but as the CEO of a company at the frontier leading this AI boom where Nvidia's goals are headed, their money and energy will be focused on closing this technology gap. Therefore, the future of computer science majors seems to be changing dramatically. I think CS will become like general education classes and not considered a major in the future because it will be so easy to program or learn CS with the small gap in technology.\n\nI don't know – as a computer science major, I've recently had lots of thoughts on the future of software engineering and CS in general, and now, listening to Nvidia's CEO and where all the money is leading, I feel like I should be prepared to start studying different interests, maybe not just CS. I wonder what you guys think?",
        "permalink": "/r/csMajors/comments/1aqfznx/learning_computer_science_might_be_not_a_smart/",
        "comments": [
            "I hope someone scrapes this subreddit and tells us how many doomposts per week are submitted",
            "Yeah that’s right guys, everyone stop being a CS major. Totally dead degree. Definitely move into more modern career paths. 100%.",
            "guys stop taking math classes. for the first time we have closed the gap, the technology divide has been completely closed. It is our job to create calculating technology such that nobody has to calculate math. it’s called… a calculator. ",
            "Lol if you guys think the CS market is saturated, look at the biology market LMAO.\n\nYou can't get a 'good' biology job without having a PhD in biology. And Bio PhDs in 'high paying' careers make the same amount of money as CS undergrads. Of course there is avenue for growth if you are a rockstar, but that's the truth for literally every field.\n\nI think the real opportunity for making money here is doing the 'tough' jobs, like the dude who said that he's getting a CDL for driving hazmats. The jobs which computers were meant to replace... because AI couldn't replace the tough, hazardous and boring jobs. Instead, AI is replacing the cushy white collar jobs that pay well and don't put you in danger.",
            "The average psychology or biology major in a saturated market:\n\nhttps://preview.redd.it/agojnk28uhic1.jpeg?width=450&format=pjpg&auto=webp&s=70bbe8a93412d07d95d3b36d7e2c8a762e7453df\n\nI believe all cs majors should have the same mentality.",
            "[deleted]",
            "Software jobs aren’t going anywhere. Will they change and evolve in the coming years? Yes most likely. But there will always be a need for software and humans to maintain that software.",
            "[deleted]",
            "CS != Programming\n\nAre you people even CS majors? \n\nHow is this sub called r/csmajors when after just 1 year of undergrad this simple point should be understood.",
            "!RemindMe tomorrow \"this is bs\"",
            "Don’t worry, even with the best AI it will take 100 years to unfuck all of the poorly made codebases in this world.",
            "I think he really means is learning how to code rather than computer science. \n\nWhat is computer science even…it’s not just coding, it’s that weird abstract stuff taught in 3rd-4th year like automata theory, formal language theory, computational theory, P vs NP problem type of shit that no one cares about because the latest js framework just blew up. You don’t see boot camps selling courses on those, unless they can put bread on the table 🥖\n\nhttps://en.m.wikipedia.org/wiki/Theory_of_computation",
            "Nvidia is not an AI company (although they contributed and critical part of AI boom)",
            "CS is still a good major to learn.\n\nThere are many other paths people can take with a CS degree, not everybody is going to become a Software Engineer. For example, any careers related to data, cybersecurity, etc. are still going to be valuable in the future.",
            "I had my CEO say “now that we have GPT-4, I can write SQL queries and help you guys out”. \n\nAll the devs laughed at him.",
            "What are you considering studying instead of CS?",
            "The proof is in the pudding, AI has always been said to completely replace developers for solutions X and Y in 5 years from now every year since it became a thing in the 70s - it still hasn't. \n\nCS teaches you how to solve problems with code. As complexity and dependencies grow you reach a point where only a human can solve that problem. Majoring in CS is and will always be a solid choice. Gen AI has come a long way but is still far off (only 5 years away) from being robust enough to parse holistic meaning of a problem and code a solution. \n\nTL:DR don't worry, AI is a tool you'll have to learn how to use, but you'll have to use many tools anyways majoring in CS. CS isn't going anywhere.",
            "my brother how are you just now realizing. You been under a rock?",
            "A tale as old as computers: \n\nEverybody and their dog will be able to program, you won't need to hire expensive programmers anymore, just buy this tool I'm selling!\n\nNo-code, low-code, IDE code-completion, UML round-tripping, 4th Generation Languages, VisiCalc, HyperCard, CASE, COBOL, ...\n\nRealistically, nearly \"everybody in the world\" is incapable of finding the files they downloaded on their own phones.\n\nTwo things:\n\n1, Providing precise enough specifications for a non-trivial system is what programming is, you are at most changing the language. Yes, AI can generate your homework assignment, because the requirements are well defined or clearly implied.\n\n2, Increasing developer productivity (which AI tools may very well do for real world projects) only means less employment if the demand for the output has peaked. People can only eat so much, so increases in agricultural productivity decreased agricultural employment throughout history. People can wear different clothes every day if it's cheap enough, so the similar or arguably higher productivity increases in the clothing sector has caused nowhere near the drop in employment. Where does software development fall on that spectrum? We'll see.",
            "And yet, Nvidia is hiring new grads.\n\nMake this make sense.",
            "CS is cooked. Learn another thing along with it (CS minor, something else major).",
            "!RemindMe tomorrow \"this is bs\"",
            "Don’t study computer science to learn how to code. Study computer science to understand fundamentals of how they’re built and how algorithms work",
            "Which degree should I get? I don't think becoming a doctor will be good for me as I am in mid 20s as will graduate from everything like 36-37",
            "!RemindMe tomorrow \"this is bs\"",
            ">If the current narrative holds—if AI is victorious—well, liberal arts types will be ascendant. Because rather than having to learn abstruse, ancient systems of rules and syntaxes (mathematical notation, C++, Perl) in order to think higher thoughts, we will be engaged with our infinitely patient AI tutors/servants like Greek princelings, prompting them to write code for us, make spreadsheets for us, perform first-order analysis of rigid structures for us, craft Horn clauses for us.\n\n>\\[...\\]\n\n>The winners will be the ones who can get the computer to move things along the most quickly, generate the new fashions and fads, turn that into money, and go to the next thing. If the computers are capable of understanding us, and will do our bidding, and enable us to be more creative, then the people in our fields—yes, maybe even the poets—will have an edge. Don’t blame us. You made the bots.\n\n[https://www.wired.com/story/own-future-artificial-intelligence-read-shakespeare/](https://www.wired.com/story/own-future-artificial-intelligence-read-shakespeare/)",
            "Ok fine, and if and when this happens then software is gone, but so is most jobs. So literally no point worrying about this because its out of our control",
            "What’s comical about this is that AI is a branch of CS. If people were to actually take this advice, we would have less people to research and implement artificial intelligence.\n\nOP, did you even think about that before you posted this?",
            "How many jobs will be available once the last Boomer retires in the next 10-15 years? Plot twist: a lot.",
            "if ai can replace a good SWE then it can definitely replace a biologist",
            "He is of course doomposting in order to lower the prices of software devs even further. Companies whilst rivals, all benefit when it comes fucking over the workers - meaning, you.   \n\n\nThey are not your friends.",
            "If you genuinely love cs I think you’ll always be fine. If you’re solely in it bc of the “work life balance” and pay, you might have some difficulty.",
            "He's investing in AI. Of course he's gonna say that. It's beneficial to his business\n\n\nIt's like saying ChatGPT has replaced programmers. It's a tool not a replacement  \n\n\nLet's say for a moment ChatGPT does replace programmers. Computer science would still exist but it would be more about data manipulation with some programming, how else would you filter the data you feed the AI? Office jobs in tech are not going away anytime soon",
            "Chatgpt can’t even solve basic calculus problems when i try it, just study what makes you happy. One can’t predict what will happen in the future.",
            "He has a point, our industry is kind of saturated. \n\nSince he said he'd choose biology if he were to return to school, would he be a good biology researcher without computing skills? I reckon he'd at least have to hire a computer scientist to process data from experiments, and store up that data. Would AI, in 10-20 years, be a viable alternative to having someone who knows and can use data science methods to analyze his research data?",
            "Yea you heard it from the horses mouth.\n\nBut I think it's pretty obvious that programming is on the path to eventually being obsolete. This might be in another 10 or 20 years though. Especially if you're in the higher percentile of devs you have a much higher chance of being employed. Imo be cautious about majoring in cs but if you do collect the bags while you can and don't forget to save and invest because the market might dry up one day.",
            "I mean it looks like I'll get the degree but probably won't use it at this rate. One less person to compete against I guess",
            "Well, AI might be the end of bad programmers but it won't be the end of programming in general.  You will still need to know how to code in order to know what to do with your results, and how to better build prompts.   Calculators didn't get rid of the need to know math.    \n\n\nI would say that if you a looking to get into computer science, you had best be prepared to go all in, and you should likely focus a lot of attention on machine learning and AI.",
            "!Remind me 5 years",
            "I told this A year back… It not about intelligence but real experience and observations",
            "Not just CS though. By his logic, AI will ruin most degrees.\n\nI mean... don't get a fuckin' art degree, that couldn't be more obviously useless lmao",
            "This doesn’t mean don’t learn how to code. This means “learn something else AND how to code, because coding will become a ubiquitous skill like reading and writing”",
            "He's right, but that's like 5 years into the future. Not everybody needs to be a SWE, AI will basically replace the bottom 50th percentile of programmers who's programming is mediocre and counterproductive when using AI. but it's also going to enhance the skills of already proficient SWEs. so combo of negatives and benefits",
            "Because after the Pandemic hundreds of thousands got laid off and Now each year more than 200k CS graduates in the US alone!\nIt's insane",
            "!RemindMe 10 years",
            "computer science isn’t about programming, same way microbiology isn’t about microscopes",
            "But who will keep the AI running?",
            "I’m a CS major who is looking to transition into biology/life sciences. Will a bootcamp help me land a job? 😇😇😇",
            "Every single industry push for people to learn a skill, from trades to coding to finance, is and always has been an attempt to lower the cost of labour.",
            "Everyone drives a car therefore no one needs to know how they work. /s Hahaha",
            "u need ppl to code / program out the AI programs as well",
            "I recently spoke with a person who’s involved with openAI at a high level. Albeit they are an entrepreneur and not a computer scientist, they said they would be an English major if they could go back and do college all over again.  The point of the anecdote is that it’s easy for billionaires to throw shoulda/woulda/coulda conjecture around when it doesn’t really affect them and they have zero clue what it means to graduate/study x,y,z",
            "If no one's going into CS, who's gonna build and maintain the AI systems?",
            "OP it’s clear you’ve never studied data algorithms or worked with them. There’s a reason we still don’t have self driving cars yet…",
            "!RemindMe 10 years",
            "I don't know what a CS major entails in America but here in Belgium it's a branch of engineering/mathematics. I mean coding is important but it's more about algorithms, architectures and mathematics in general. No clue what this guy is on about really...",
            "Going to point out Huang is an EE grad, not a CS major.\nAnd while programming is an element of CS, CS is not programming.",
            "AI can do a lot but these companies still have to be first to market and that will take man power",
            "When you are rich, you can be a philosopher",
            "By the time AI gets to the point where they can actually replace software engineers, they probably wouldve taken over every other job too. There will always be a need for people who can engineer software and AI. Maybe you would use AI to make your job much easiet and faster. Maybe you wouldn't need to code at all. But engineering is not just code.",
            "We're so cooked lmao",
            "Guys unfortunately I think he's right. It's probably best if everyone except for me moves on to learn something else as there is no future in CS :(",
            "Yeah I think you should quit and study something different with that doomer mindset going on.",
            "I think you are misinterpreting what he said in the most negative way possible. He didn’t say it’s not good to learn to program, he said it shouldn’t be good to program. Those are very different statements.",
            "Interdisciplinary computing will be the future in my humble opinion.",
            "That’s like saying don’t take math class because the calculator can do it for you. Advancements in calculator technology has stopped the need for mathematicians.",
            "Depends on what he means with \"computer science\". Frontend? Yeah probably not the best idea.\n\nBut machine learning research and machine learning engineering? Unless he thinks AGI is on the cards in the next few years, those AIs he's talking about won't just magically appear. They will have to be created by computer scientists. Those jobs will, by definition, be the absolute latest to be replaced by AI.\n\nAlso if I were the CEO of a company that makes large amounts of money by selling hardware that is used to run and train AI, I would probably say similar things. Not sure why whatever this guy says is treated as gospel in this sub.",
            "nah, I’m good",
            "Then fucking stop studying it. A lot of us are not in it for the money or not in it just to be a programmer. Piss off doomer, no reason to stop studying CS if anything this is the best time to study it.",
            "That guy doesn't like competition.",
            "Computer Programming != Computer Science.  \nHe uses \"computer science\" and \"programming\" synonymously in his answer, which is BS.\n\nCoding is an easy thing to understand/learn/master, automata theory is not.",
            "Sounds to me like you're one of those students that pick their major based on how much money/job opportunity they will make/have once they graduate. If that's the reason you are getting into Comp Sci perhaps it might not be the best major choice, for you, in the first place.",
            "I left this subreddit only to get recommendations from it💀",
            "DOOOOOM!!! DOOOOOM I TELL YOU!",
            "I look forward to the day where I can become a billionaire by telling an AI to make \"uber but for [stupid shit here]\" and \"netflix but for [stupid shit here]\"",
            "https://preview.redd.it/zblin6agroic1.jpeg?width=1290&format=pjpg&auto=webp&s=482c9213fd0a8a512588654953ff5a862e6c7d0c",
            "sadly this happens with a lot of proffessions i always looked at it this way the moment the general public start saying you should study x for great pay it is time to jump ship because that market is about to be saturated... and it has happend with computer science as we are seeing a horrible jobmarket for newcomers all over the world \n\nnow ofcourse there are couple study directions that buck the trend because of how difficult they are like medical degree's.",
            "Coming across this post as a SWE with 7 years industry experience… yes and no. Programming jobs will still be around for a while. However, it is true that AI with begin to reduce the supply of these jobs within the next 5 years. Per discussions I’ve had with peers and folks higher up in the management chain, it definitely feels tech companies are already contingency planning for this. \n\nThe first to go will likely be the new grad and entry level jobs, which are relatively easiest to automate with AI. The responsibilities of these roles that cannot yet be transferred to AI will be delegated to the human SWEs that will still exist in fewer numbers, and whom already have some experience under their belt.\n\nOver time, as AI grows more advanced, we expect to see the number of even these experienced SWEs dwindle.\n\nIf you are already a few years into your CS degree, then it makes sense to stay the course. There will still be programming jobs for you. And if these dwindle in a few years, you are still well positioned with a technical background to transfer to other career paths.\n\nThat said, I probably would not choose to pursue a CS major if I were starting college today. I would pick one of these alternate career paths and double down. \n\nPeople don’t realize but CS is one of the easiest jobs to replace because it doesn’t require hardware infrastructure. Automating biology or medicine, for example, may require precision robotics, which can take years to develop. You need to build an interface between the software system and the “real world.” To replace SWEs, you just need to build an interface in the software realm, which can be done in minutes.\n\nJust my perspective and I don’t want to discourage folks. So feel free to take all this with a grain of salt.",
            "!RemindMe 10 years",
            "Yeah. I have an accounting degree. I *totally* think me and my peers can bridge the technology gap and guide AI to automate all accounting processes! It’s zero gap! It’s completely a leveled field! \n\nA computer science degree would be wasted on me. Better cancel my masters and my passion for coding and engineering. What an absolute waste of my time. Btw all the people in AI will create *perfect* code that will run forever! And don’t worry, they’ll make AI BOTS that will keep the code running forever in perpetuity! AI will solve EVERY THING code wise, don’t worry we promise it will automate everything no need for more engineers!\n\nGive me a break. These are exactly the type of morons that made me want to leave business.",
            "Maker of compute bubble assures us his product is in fact not a bubble. ",
            "1. I don't think anyone would want to use a program completely generated by AI because AI doesn't have the ability to document accurate requirements. Very good AI might be able to transfer the requirements into a valid program, but unless the requirements are 100 percent correct, the resulting program is incomplete and actually needs validation again after complete implementation.\n2. If the AI proposes to maintain a program that AI did not write, such as a program written by a human or by different AI, how will the AI read the comments and how will the AI listen to the original writer of the program?\n3. Complex programs need a state machine that represents the operation of the program and valid and error states.  The state machines are based on requirements, input, exceptions, etc. How would an AI validate the state machines and know they are complete?\n4. AI cannot understand the value of each individual data element when data management is required. At best, given a list of data items, the AI is making a guess on how to normalize the data.  "
        ]
    },
    {
        "post_id": "qbjhu4",
        "author": "Dangaruz",
        "title": "Capital One. We did it bois",
        "url": "https://www.reddit.com/r/csMajors/comments/qbjhu4/capital_one_we_did_it_bois/",
        "score": 538,
        "num_comments": 66,
        "created_utc": 1634673386.0,
        "selftext": "I know a lot of you shit on capital one, but after 2 years of no responses, imposter syndrome and just generally feeling worthless, I got an offer today at 3.5x anything I’ve made in the past and I’m feeling great. There’s light at the end of the tunnel lads.",
        "permalink": "/r/csMajors/comments/qbjhu4/capital_one_we_did_it_bois/",
        "comments": [
            "Congratulations man! Best of luck for your career ahead",
            "lol anyone who shits on any job is immature. well done.",
            "[deleted]",
            "Anybody who shits on Capital One either has never gotten an offer and is “expecting to hear back soon” from the application they submitted to Google 3 years ago or is a massive out-of-touch asshole",
            "Capital one is an amazing accomplishment :) Congrats!!",
            "Good job!\n\nI had my power day a week ago and I didn't make it. \n\nWhatever higher being there is decided to fuck with me and gave me a linked list leetcode hard for the technical portion. Pretty sure that's why I didn't make it because I ran out of time to do the rest of the technical portion which was fucking easy! \n\nAnyway, congrats again!",
            "Congrats!! Been with Capital One for 3 years now and I love it. I was lucky to be on really good teams, and I've had managers who always supported me and listened to my opinions. The tech stack we use is pretty modern and we're all in on the cloud so you'll learn a lot of AWS",
            "Congrats!!! \n\nUnfortunately I just did my C1 interview today and got a LC hard(reverse nodes in k group) + an extension to the problem like bruhhh. 25 min to solve too.\n\nNot feeling optimistic :( I saw that problem before but never bothered to solve it cuz I thought they’d never ask a hard for an intern interview",
            "Did assessment 2 weeks ago havent heard anything, workday says in progress - assessment",
            "Congrats! How did the interview go? I have mine tomorrow and I’m pretty worried about the technical interview. Also I’m not sure what to expect for the case.",
            "My friend just smoked all day and made kotlin apps when working with them. Have fun.",
            "Congrats!!! I've been at C1 for over a year now + internships, it's been a great experience! Hit me up if you wanna chat about it!",
            "Congrats! A friend of mine also started at CapitalOne recently.",
            "CapOne is a great company",
            "I interned a few times at Capital One and absolutely loved the people and culture - congrats OP I hope you enjoy it too :)",
            "Congrats, I had an amazing time interning there and just accepted full time. I'm sure you'll have an amazing time there as well! The culture is amazing and the benefits great (you get PTO as an intern as well which shocked my friends). I had a friend in goldman sachs who said they all had to work pretty much non stop (goldman understaffs on purpose), so yeah experiences can vary",
            "Why would anyone shit on capital one? what are people's complaints with it?",
            "C1 is honestly a great company to work at, they’ve really been pushing to improve their tech the past few years",
            "Good soup🙏🏼",
            "Congrats !",
            "Congrats! When was your powerday? Mine was last thursday, dunno if that’s too early to hear back :(",
            "Which location bro? I'm starting FT at Plano in February!",
            "All da Americans here be talking in dollars and we here be like 😯",
            "Congrats man, how long did you wait after the OA?",
            "Congrats!! I have my final for them tomorrow, already secured my first two offers, but I will certainly be considering capital one if they decide to!!",
            "Congrats this is just the beginning 👍",
            "Congrats man.",
            "Congrats, do you mind sharing how is the final power day interview like? Did you do lc type problems? Or were you asked to just say your thought process?",
            "Don't put attention to this sub about companies. As long as you are happy with with your job everything’s golden. Many people here think that working for non-tech companies is a waste of time, but I think they are just envious as they probably cannot even get offers from their local McDonalds.",
            "Congrats G! Cap 1 is great!!",
            "Congrats, great to hear! I had my final last Friday and still waiting on a response. I totally feel ya, tried getting an internship with them the past two years and now going for a full time position, we'll see how it goes!",
            "Niceeee",
            "haven’t heard back from them and it’s been a month, i assume they rejected me? :/",
            "Congrats!! Capital One is a fantastic place to work btw. I interned there and had a great experience and team. You'll do great."
        ]
    },
    {
        "post_id": "1c48ims",
        "author": "Vagabond328Vanguard",
        "title": "How many of you can't make a website?",
        "url": "https://www.reddit.com/r/csMajors/comments/1c48ims/how_many_of_you_cant_make_a_website/",
        "score": 538,
        "num_comments": 272,
        "created_utc": 1713140134.0,
        "selftext": "This isn't a shitpost, and it is a judgement free zone. But I'm wondering how many people are in their final year but still wouldn't be able to make a full functioning website.\n\n\nSo far every web project I've made has been a half baked piece of crap. Mostly because I'm shit at Frontend or because of inconsistencies in the database.",
        "permalink": "/r/csMajors/comments/1c48ims/how_many_of_you_cant_make_a_website/",
        "comments": [
            "made this - [website](http://invitecards.in) \n\nIt's for my dad's business. \n\nThere's are many issues with it but I'm getting through them one by one.\n\nBuilt with React, ASP.NET web apis, Postgres\n\nI'm using docker and GitHub actions to deploy it.",
            "I’ve been working as a software engineer for over 5 years now and I wouldn’t be able to easily make a decent website. I’m not a web developer.",
            "I would have been that person if I didn’t teach myself this shit cuz uni hasn’t taught me shit",
            "I’d say 70% of the people in my cohort can’t create one because we don’t make them in uni. Some people are self taught/have internships. You (in my opinion l) SHOULD since it’s the most robust, popular and versatile skill for software development these days, so it’s a great way to express any project you build. It’s also a good asset to any team.",
            "What counts as fully functional ",
            "I’m teaching myself how with this course over the summer:\n\nhttps://fullstackopen.com/en/\n\nI hope it’s good",
            "[deleted]",
            "What you mean by a website ? \n\nIf you mean a basic Html template with basic CSS and some modifications here and there then anyone can make it \n\nThere are tools where you can literally drag and drop and make website \n\nIf you mean Complex Web Applications with tons of features and frontend and backend and database and hosted on cloud and security features and etc then very few people can actually do it",
            "2024 new grad and I can’t make a website.\n\nI did just learn about /etc/hosts to map a domain name to my docker container, start up and run an Apache server on said container, and access it from my browser. It’s a seed security lab, btw.\n\nI haven't had to connect to a database (project, prof provided code, just needed to enter credentials), but have used jdbc to make queries from within my java programs. I've done CRUD via Spring framework at my internship, but the entire connecting to the db thing was also already setup.",
            "I can't because I don't want to. Not a good use of time learning when I'm going to grad school for something not web development",
            "With or without chatGPT?",
            "I graduated last year and have been working almost a year. I don’t even know where to begin in making a website",
            "Most people could probably do it if they absolutely HAD to. It'll just take people longer to go through the websites they need to go through.",
            "My university didn’t teach any web development during my degree. All Java.",
            "I’ve made multiple websites in the past and have worked on both frontend and backend. Also deployed on heroku or vercel. Learned it all from YouTube tutorials doing clones of other websites. Once you do 1, you can do anything. Hardest thing for me is always styling.\n\n2024 new grad.",
            "Tangential comment. Modern web dev is way more complex than most people realize. And given the overlap between web and mobile app dev, schools are doing people a major disservice by not introducing their students to it.",
            "I can't, and after taking a front end course, I really don't want to",
            "Trying to build a full stack app with\n\nDistributed Logging (Going with Filebeats + Kibana + Elasticsearch most likely)\n\nDeployed To Kubernetes as a Helm Chart\n\nCI/CD (Github Actions + Argo)\n\nFull Instrumentation (Metrics and Tracing with Open Telemetry and Jaeger and Prometheus + Grafana)\n\nTrying to Have a good testing Suite (Unit Tests + Integration Tests) and E2E tests with postman / newman scripts\n\nMultiple Databases for multiple purposes (Redis, Postgres, Elasticsearch, and Cassandra)\n\nSelf-Managed Keycloak For OIDC Authentication\n\nPerformance Testing with JUnit\n\nSecurity Testing with ZAP\n\nLive Updates with Websockets (for now)\n\nMediasoup (the Node.JS library) as an SFU server for live conferencing (I'm not that confident in this decision)\n\nKafka for asynchronous messaging between microservices and gRPC for synchronous messaging\n\nIf anyone is interested in working with me and want to technology dump on their resume. I've done pieces of it but trying to glue stuff together at this point.  \nReact front end\n\nDecided to move and start over in [ASP.NET](http://ASP.NET)  since it seems to have a good market and is less painful than Spring",
            "Luckily, my whole uni was about writing cruds (back and front) and microservices in 100000000+  stacks. And seasoned with system analytics.",
            "I doubt I could make a good looking UI by myself, but it would certainly be functional assuming you're not doing anything to crazy on the fronted side of things. I actually had to make a few functional websites as part of school projects at my school. For my senior design project I inherited a website + mobile app where I basically completely rewrote the API to be better architectured as well as migrate a database as well.",
            "ik shit ,so i just use streamlit or plotly dash for whatever i need frontend for.",
            "Depends on what you mean by can't... in theory, I **could** but looking through a few courses on YouTube, and it would take me awhile... but using exclusively only the knowledge I have at the moment, no, I can't. I feel like the question is more like, how much time it would take me and how much more do I need to learn, but that's with everything in this field. With my coding experience, of course it would still take me much less time than an average person to learn to do a website from scratch, so I would say what we learn during the during the career is experience, learning a new language shouldn't take that much time",
            "i can’t make a good website but i can create my own database system from scratch, so im not worried that i can’t make a website",
            "Well, i did a group project in my first year, which was a site with node js and sql as db, but we used raw html/css and node js, didn't use any frameworks like react js etc.",
            "If I had only done what’s as coursework - nope. lol. Luckily I’ve been self learning for about a year",
            "Learning Dow to do it right now... And the websites I have turned out have been.... Ok. Like they work, and do what we want them too. But good lord are they duct taped together lol",
            "I can do it no issue but that far from my specialty. Also I mean I can make it functional. I can't make it looking great or design it to match one brand or whatever.\n\nWhat I can do reliably is to make it scale to millions of users worldwide and work with a great SLA plus ensure there no much bugs. Well not alone, I am not an SRE, but I can design it so it become easy to do.\n\nI am not in my final year. Been 18 years in the field and I mostly do backend stuff.",
            "Funnily enough I probably could like 6-7 years ago but now as a junior in college… yeah it’s not good",
            "If you have the self awareness to understand this then maybe you should work on it? It’s really not hard to set up a simple one and then keep expanding it with new features and services.",
            "Website besides editing a bootstrap template or the bare minimum css and html I can’t\n\nBut I can do a webserver in C so I was always better at backend",
            "I only can because my degree plan is full stack development, so I ended up having to get good at it.  It pretty fun once you integrate the front end with the back end.",
            "> But I'm wondering how many people are in their final year but still wouldn't be able to make a full functioning website.\n\nYou say 'still' as if web development is somehow related to CS. You could certainly learn it independently, in the same way you could learn graphic design, or to speak a new language, etc.\n\nHeck, I used to work as a backend engineer for the Amazon website, yet still probably couldn't make a website myself without looking a load of stuff up. I would probably just use pre-written templates if I wanted to make a site, or hire an actual web developer to do it if it needed to be good.",
            "What kind of applications did you learn how to build?\n\nWhen I went through CS just as the Internet hit the public, web sites were not even part of the curriculum yet, and every interviewer after I graduated asked if I had web development experience. \n\nWell no, of course I didn't. But I did learn how to build console apps in Pascal, C++, Fortran, and Assembly. I learned how to build database-driven applications and COBOL reports. Because of all of those learned concepts, by the time I was first exposed to web app architectures the following year I picked up on my own how to build static web sites within days and database-driven dynamic sites within a couple of weeks. Without that degree experience that would have taken months to years to figure out how to do it correctly. But my degree gave me a huge advantage in the new field of web applications over other devs who didn't have a degree.",
            "I read this thread and I am beginnig to think you guys in the US are getting scammed because I am on my third semester and we are getting everything taught on how to make a fullstack application, web and mobile. Whats more we have an \"End 2 End\" Project throughout the semester where we make a clone of uber. And this is just the first of the 5 \"software engeneering courses\" we take before graduating.",
            "Same, half baked product as thesis.",
            "I'm learning algorithms and data structure, I haven't been taught how to make a website. Though I'm a first year.",
            "I can! But suck at everything else unfortunately. One of the intro classes at my school was basically intro to full stack. Learned how to use meteor, react, bootstrap, we did “wods” (work out of the days) where it was pretty much a live coding interview and we had to use what we learned to create a mockup of a real website of the professors choosing. Really loved that class. 100% gave me a passion for this and specifically design/UI.",
            "Are you just using html, css, js? Or are you using a framework like react? And are you using ready built components? I didn’t know anything about web dev until I started my senior project, now it’s not too hard because I’ve started learning react",
            "I think anyone can “make” a website in about 5 minutes. It would completely depend on the features and styling you want to include. I would even say someone with cs 1001 knowledge could make a decent website in a day with ChatGPT and a youtube tutorial.",
            "I mean I can make one but I'm not exactly the greatest UI / UX designer. Much better with backend and algo stuff.",
            "I'm not going to post my personal website here for obvious reasons but during most of my 6 year study (BSc+MSc) I've worked part time developing webapps. So yeah not that hard.",
            "Guess I'm gonna have an edge if I'm good at making websites. I'm still in my second semester but I'm learning(postponed shit like a ton of times and finished an exercise today after 2 months XD). It wasn't too bad. I can keep trying.",
            "I made a fully functioning website for my to host my projects and to link recruiters to my github. I got a custom domain and everything honestly not hard I did not create a master piece but I did spend a quite a few hours on it. I will say making a static webpage from scratch is fun and should really give it a try.",
            "I've made plenty for practice but I don't know how to properly deploy them. Mostly because I don't want to pay to deploy silly practice websites",
            "It’s kinda hard to not know how to make a website when things like Wordpress and Hugo exist. I am not gonna be pretending I am smarter than thousands of people hacking at this for decades and that I need to be reinventing my own wheels.",
            "Been in industry for 4 years. Probably couldnt make a website very easily",
            "I think I would be able to figure out if I needed, but nobody ever asked me to make one and myself have too little motivation make a website out of my ideas. Maybe someone wants to order a website?",
            "never did web development so me i guess. can probably learn to do it tho",
            "I can't really. I did one while in uni, but those are group projects and I don't remember what or how much I did. I can use tools like Mobirise? But that's about it. I've never been very interested in web.",
            "This is one of the reasons why I always colleges have become parasitic in the relationship they have with students",
            "I made a web application with flet and python to automate some business proccess, its surprisingly easy as flet does not require any frontend knowledge.",
            "Tbf, CS isn't the same as web dev. There are a lot of different niches from OS design to security, to data sci, etc. Full stack development can be challenging at times, some people love it, some people don't. Though, I did feel like my uni time didn't really teach it, it's something I kinda learned on my own along the way (hence why I'm pretty trash at it).",
            "My opinion only...a website, even a simple one, is not a low level undertaking my friends. Even WordPress will give you some challenges without knowing a little bit about web design, PHP and MySQL. It might be easier to code a calculator with a GUI lol. So don't think of OP's question as a \"you haven't done this simple thing yet.\" Anyway, at least make a resume and project web site.",
            "Never tried dont know anything about it",
            "Use a template. Use a styling framework with prebuilt components",
            "I don't need to make a website for my job, so me I guess. Sure I could figure it out pretty quickly though.",
            "3rd year (2.6), and I am currently planning on creating a website in HTML CSS and JS using firebase for database and I’m not sure what I will use for hosting yet, but I am confident in my ability to make a decent website.",
            "[deleted]",
            "It depends on what type of websites you are talking about. Web sites can range from super simple to super complex. My former job uses bootstrap (public sector) and my current job uses wordpress (small corp).",
            "I graduated 4 years ago and I still can’t make a website. The problem I struggle with the most is not knowing how to start. I feel like I only come into my element when a project is already established or has some structures already in place. From my own experience I find the beginning of projects always a bit of a Wild West.",
            "I never made a website, mostly because I like to focus on backend stuff. I currently work as server-side/devops focused swe. I would like to think I could make a mediocre one if I tried.",
            ">I've seen companies ask intern candidates to create websites or apps with specific functionality using industry specific tools/frameworks.\n\nThis is completely normal and acceptable as an intern. It’s literally what it means to learn on the job—doing the thing you’re supposed to learn.\n\n>As part of the interview process.\n\nThat’s also not particularly strange. It’s typically just going to be a only a small subset of some real functionality, and in that case, dare I say it, it seems like it’s either (1) expected that someone that will be able to complete their duties as an intern is able to look up the docs to complete the take home or else (2) it might be an interview for an internship which expects that you already have some internship experience, and I don’t think that’s all that crazy either. Not all jobs are created equal.",
            "I've been in this industry for 10 years and can't make a website",
            "I can’t make a website beyond what they looked like in the 90s but that’s because I’m not a web dev  so those skills don’t matter to me.",
            "I cant make a full functioning website because I am a frontend software engineer so even if I have the screens, you cant really do anything with it lol",
            "My first website was an online judge like leetcode/hackerrank. You can learn anything if you stick with it for long enough",
            "I cannot. But, I can make and deploy rest api if that means anything.\n\nFront end stuff has never appealled to me.",
            "I probably could, but I loath web dev.",
            "Can someone suggest an ai tool that creates websites from images ?",
            "I don’t really want to a web developer but I think I could make a half assed website \n\nNgl, I would be really nervous about it’s security though",
            "I could Google it and figure it out. But school didn’t really teach me that. I did make a website when we could do whatever project we wanted, but it was with Streamlit which is super simple.",
            "I definitely cannot.\n\nEven though I did in university in my 2nd year course. Now after graduating and with 2 years of experience as SWE I haven't touched a single line of HTML or any web development.",
            "I work at a FANG and cannot make a website from scratch. I guess you specialize in one area over time and your other skills atrophy quickly. \n\nFor context, I could set up a website when I was a teenager years ago. I’ve forgotten most of the process in my 30s",
            "Me bruh webdev is my enemy, my websites so far have been sub mid. I should take a course and learn in a structured manner.",
            "I could maybe fumble through a basic tutorial or something but that’s it. That’s from 15+ years of building data platforms. But the skill could eventually be learned. I’ve just hated everytime I had to touch Js or anything UI related.",
            "\\*stares in mobile app dev\\*\n\ni could make a pretty semi functional react app with some brushing up online.. I could definitely make a little index.html page really quick lol",
            "i’m a systems guy so not me",
            "I'm in my first semester and definitely cannot, but I did just make a Java program about Old MacDonald to learn about interfaces so I'm basically a SWE",
            "I’ve been a web dev for ~3 years (internal applications at enterprise companies) and I can still barely make a decent website from scratch. Trying to change that now via online learning resources.",
            "Lol, I'm in my 38th year and couldn't make what I would consider a decent website. Smoking fast back-end system for sure but web site - no way. Still pissed off that they can't even standardize wtf a positional calculation should result in from a pixel perspective.   \n  \nFrankly web is the dumb end of standards development. So much how can we work around 'X' rather than how can we make it always work the same way.",
            "I'm a front end web dev so I can definitely make a website lol\n\n\nI'm working on a full stack Java project right now that is only kinda crappy because it's not finished and idk man Thymeleaf sucks or something \n\n\nI'm only 30% through my CS degree tho, buuuuut I've been programming and stuff as a hobby since I was 12 or 13 (I'm 27 now)\n\n\n(Don't get too jealous I'm getting paid less than an intern)",
            "I honestly don't care if someone makes a half-baked website, but good god try to make something original. So many people in college just follow YouTube guides. That alone isn't bad, it's how we learn-- but don't copy the damn thing 1:1.",
            "I made this [Memory game](https://dudeverse.github.io/Memory-game-v1/) when I first got into javascript. I used chatGPT to generate code for a 2X2 grid and then I tweaked it to make a 4x4 board. The css is still clumsy tho. I explicitly told chatGPT that I ddin't know loops yet, but only basic function calls. I used a bunch of meme sounds too lol.\n\nI have both a Master's degree and Bachelor's degree in CS. I am an example that degrees don't mean shit.",
            "Probably mostly everybody. You don't learn it in a standard CS curriculum",
            "I’m more like a (super) sophomore, but I cannot make a website. My interest is mostly in embedded, so that’s what I’ve been focusing on in personal projects. But my current personal project will involve a web interface for a esp32-based device! So I will learn!",
            "Making a website is not CS.  That's basic work for somebody who goes to a weekend tech camp.\n\nAre you saying make an entire e-commerce site with the backend database etc. and the front end interface?  Or a basic \"Hello World This is my Website\" page?",
            "This one of these situations where plenty of universities with even good CS programs drop the ball completely. It really is astounding that they don't have a decent web development course at all or have one and be it at the end of the program as an elective at best. In my opinion,  this situation is a total disservice to the students who pay a lot already. Fortunately, over the years I learned web development from community college and did some certifications prior to enrollment in a CS program. After a year, I checked out of that program and went into another one that did have a web development course that was required and towards the beginning of the curriculum. Now that I am further along I was able to make my own fully functioning website, build one for an instructor, built another one  for the database class project, and now contribute to another with me being responsible for a big piece of the functionality solo, yet on a team. When I finally graduate next year around this time I will be able to really be a contributor and have software to showcase.",
            "Uni didn't teach me anything about creating a website. They taught a lot about designing one but basically all they told us was \"Use bootstrap\" so that's all I know when it comes to web, other than what I taught myself.",
            "made [https://buildonarylive-theohal.replit.app/](https://buildonarylive-theohal.replit.app/) in my sophomore year of highschool, webdev just takes practice, iteration, and acceptance that you are just plugging other people's code together sometimes.",
            "Recently made [ResumeTurbo.com](https://ResumeTurbo.com)\n\n&#x200B;\n\nCSS sucks on mobile though",
            "I cannot (Data Science undergrad)",
            "I bet most 10 year olds can make a website.",
            "TIL that computer science major is for learning web development.",
            "You don't need to be able to make one",
            "This is my website [website](https://marketstreak.com)\n\nIt’s a side project which I run. \n\nFront end - nextjs tailwind css deployed on cloudflare\nBacked - fastapi , redis , postgresql (supabase) \nTools - docker , GitHub actions , oracle cloud, AWS lambda for updating \n\nTook me 2 months to build.\n  Check it out ."
        ]
    },
    {
        "post_id": "1brqc5u",
        "author": "dented-ice",
        "title": "Is NVIDIA worth more than school?",
        "url": "https://www.reddit.com/r/csMajors/comments/1brqc5u/is_nvidia_worth_more_than_school/",
        "score": 541,
        "num_comments": 84,
        "created_utc": 1711827597.0,
        "selftext": "I am currently interning for NVIDIA and recently got approved to continue my internship at HQ until the end of the year with a team that is even more aligned with my interests.\n\nHowever, I’m already taking a gap semester to do my current internship, and taking the extension means I’d be giving up on schooling for the time being until 2025.\n\nI only completed 3 semesters for my cs major, and I don’t go to any top 5 cs school.\n\nWhat should I do? Is education more important? Should I do online part-time education or would that stain my resume?\n\nWhat would you choose, school or internship? I’m so confused.\n\n\nEdit: since a bunch of people are PMing about it, I'll just add it here. No, there isn't anything special I did to get this internship. I applied, I was selected to interview, and I got an offer. No referrals or connections. I did have a lot of tech stuff on my resume, but very basic work (open source, simple projects). The main advice I can give is to tailor your resume to the job description as much as possible - at least for NVIDIA, each internship has a specific description; try to talk about your relevant experiences as much as possible. Its all about prep + luck, and I won't lie about me getting lucky.",
        "permalink": "/r/csMajors/comments/1brqc5u/is_nvidia_worth_more_than_school/",
        "comments": [
            "For context OP - Nvidia is arguably one of the FAANG/MAANG companies (often interchangeable with Netflix) so grab on quick. Most people are doing their degree to get their foot in the door to get into those companies; the degree is a tool, not the goal.",
            "Definitely take the internship, you could always go back to school after the internship ends, but you can’t guarantee another shot at NVIDIA internship if you pass this up",
            "Work towards degree part time, try to leverage internship into Full-time position after",
            "Internship",
            "Internship. Practical experience is more valuable than theoretical coursework. Delay your graduation as long as possible and wait for the market to rebound.",
            "Is this even debatable? NVIDIA all the way through, and if you could extened your internship and take a gap year, that would be even better.",
            "Everyone is saying internship + part time school.\n\nInternship is more valuable than school.\n\nIf you load yourself with part time school, you'll mess your internship.  Don't do that.  Your reputation with your futur employer is your most precious thing.  Put all your effort into that internship, you can go school at any time in your life later.\n\nLife is very long, 2025 is a blink away.  \n\nWhen your job is going to start being easy for you, then you can consider adding yourself work load with part time school.  At that moment ... well, school is going to be easy.\n\n\n\nMaybe later you can do full time school with part time job with them. That's the ideal student job no?",
            "uhhhh why did BasicsOnly post 4 most-upvoted comments in a row, one of them being a reply to himself 😂",
            "School isn’t going to go anywhere, this opportunity might. Stick it out and try to convert to full time.",
            "100 percent do the internship !",
            "Internship +1 and finish degree part time if you can or just finish it later. It’ll be fine as long as you don’t drop out. I’m currently doing MRSD at CMU as a leverage to get an internship at Nvidia. Would love to connect with OP if you’re down! c: you’ll do great either way.",
            "im confused about how online part time school would stain your resume. If you take online classes through a reputable brick and mortar school it is no different. I would definitely go for that option",
            "Defo internship",
            "We go to school to get an opportunity like this in the first place. Do the internship and go to school part time.",
            "PAY > No pay school can wait",
            "NVIDIA lets you do virtual - take that for Fall and do class",
            "Internship experience will teach you more than any degree will. Which makes sense because you usually work 40+ hours a week compared to the usual 10 or so you do in school, therefore creating a gap very quickly that school can’t fill. Nevertheless, Nvidia can have massive layoffs tomorrow and there can be a year long recession, if you don’t have that degree, you will be screwed. You can always go look for a job, but starting and finishing a degree program is a lot harder, requires more of a time dedication, and be comes harder to finish the older you get.\n\nI would determine wether to extend your school or not based on the pay. If you can graduate on time and make $175k or more (~$80/hr)vs getting paid like 80k now (~$38/hr). Just hurry up and finish your degree and get the full time. Your time will be valued a lot more. No point extending your earning potential and working for less longer. If anything just ask for the internship for next summer and stay on track to graduate. You already got 1 under your belt (at a really respected company), having a second one won’t make or break your future prospects.",
            "The job matters more than school, yes. I would even join full-time instead of graduating.",
            "Yes.  Nvidia on your resume is more valuable than school.  Getting the degree eventually would still be recommended, but no recruiter is going to be like \"you worked for nvidia for two years before you graduated?  Wow, that must mean you're a really incompetent student\".  If you only had the nvidia work and no degree you'd still be more hirable than people with degrees but no work experience.",
            "My friend took a gap year to intern at NVIDIA as well. During his senior year, he was lined up with a full time SWE offer at Google.",
            "Nvidia stock is 🚀➡️🌙",
            "Nvidia offers ton of flexibility. You can easily negotiate a schedule with them.",
            "no one here has mentioned the simple option…\n\njust change your return intern offer for the summer or whichever season you’re free, then continue schooling full time. \n\nthat way, you don’t delay graduation while still in the loop with nvidia.",
            "In these times I would be shocked at a company of that caliber not being flexible around your class schedule anyway. Did you actually bring this up to them?",
            "Nvidia all the way.",
            "Not even sure why this is a question😭 graduating a year later than expected isn’t deep, especially if you’re working at one of the companies steering the AI boom in return",
            "You’re killing it man! NVIDIA all the way.",
            "Internship 100000%, school later!",
            "Most ppl would kill for that internship…. 100000% choose the internship.\n\nThis is coming from a person who has been applying to more than 100 internship and landed a single interview… no offers.",
            "Let's put it this way, actual work experience trumps everything at the end of the day.  If you submitted your resume and actually have experience in industry (which an internship is) especially at NVIDIA you would move to the top of the list of applicants vs those that have only academic experience or have internships at places nobody has heard of.",
            "Can you take just one class in the coming semester while you work the internship? That's the ideal outcome",
            "Keep working",
            "Keep working",
            "Have a conversation out this with your boss at nvidia. That'll be the best way to figure out what to do.",
            "Keeep working and once the contract finished decide what to do. Maybe ask them if they’d allow you to take 1-2 courses while working",
            "i would see if your university offers 1 or 2 of the courses you need fully remote. if not i would still continue with the internship if i were you. no shame in graduating late especially if it means extra work experience under your belt",
            "congrats on the offer",
            "Nvidia, thank me later",
            "Internship full focus! Finish the degree after getting a full time position with the company. Youll get more money this way in the short term (2-3 yrs) and real experience with contacts in the NVIDIA network. The degree will simply be another accolade for you, but it will increase your value when negotiating for new positions in or out of NVIDIA",
            "Can I ask how you got the internship (anything notable is fine)? I’ve used referrals and they fr don’t want me.",
            "Taking a couple months of school is going to have no impact on your life. Getting a full time return offer from one of the hottest companies atm will.",
            "Your school will always welcome you back to finish the degree. Opportunities like this internship are hard to come by now, so highly recommended staying and grabbing as much experience as you can. Also focus on networking and securing a full time offer or another internship slot for the next internship season. Even if you want to try another company this will be a great failsafe to have! Awesome job so far",
            "Yes if you can, do part time internship and part time school. Nvidia experience worth alot. We give return offers to good interns too.",
            "How did you get it?",
            "You got referrals?\nI could mail you personally you are interested.",
            "Internship + 2-3 classes on the side imo.",
            "Worth it",
            "Education means squat (given you have skills which clearly you have) NVIDIA is the best place to be right now man, don’t squander it for some paper",
            "Work absolutely. You can finish uni even at 30, the experience is invaluable",
            "Just go to school part time, being that it’s an internship would it require you to be student in some capacity? Or graduate within a certain time?",
            "Delay your graduation, it’s not an issue",
            "I don't know honestly but I will say Nvidia is pretty cutting edge as a tech company. Having a well-rounded education is valuable for sure, but Nvidia is doing things colleges don't know about yet (I'm guessing). You could become very specialized and imo there is a big benefit to specializing as early in your career as possible. Getting in with a solid company and learning how they do everything is huge especially early on.\n\nI don't think you can guarantee one choice will be better than the other. The degree is probably safer long term, but this also seems like a great opportunity",
            "Do the internship and transfer to another school that offers online courses/degrees. Or do the internship and gap a year. It's hard to get internships these days...",
            "I would take the internship and try to get a full time offer. You can always finish your bachelors online while working",
            "Do the part time internship and part time student, nvidia is not worth more than your school. part time will not stain your resume, thats the normal decision to do lol. One of my buddies did 4 internship at 4 FAANG companies in 1 year and did part time school. \n\ni also did part time school and part time internship, but make sure to communicate it and set days/hours with the company.\n\nif you are not confident about doing both, you can ask if they can delay your internship to the summer. its very common to do this. \n\nAlso without the degree you cant get the full time so what the point of continuously doing internship work fulltime if you never get hired. you are doing fulltime work with half the benefits. The faster you get your degree the faster they can onboard you to full time. one of my other buddies graduated a semester early and got to start full time earlier by talking to hr. \n\nnever delay the degree, you will lose out on maxing out on the most money you could make and are putting your full time opportunities at risk. feel free to dm me if you want me to elaborate or want me to elaborate my experience doing part time internship/school.",
            "The requirements of an internship is to get a bachelors degree. School is hella important",
            "Yes, stay at nvidea",
            "Work part time while going to school"
        ]
    },
    {
        "post_id": "1axjoqn",
        "author": "slappy20000",
        "title": "Failing all my CS classes but I’m passionate? ",
        "url": "https://www.reddit.com/r/csMajors/comments/1axjoqn/failing_all_my_cs_classes_but_im_passionate/",
        "score": 533,
        "num_comments": 75,
        "created_utc": 1708640660.0,
        "selftext": "Hi Im a CS major but I happen to be passionate about CS, even to the point where I’ve made a BMI calculator with chat GPT last year. Despite this, I don’t have any FAANG offers. What’s even more disturbing is that my professors are failing me, even though I sent them all emails SPECIFICALLY stating the fact that I’m passionate. Is there any possible explanation for this? Should I send out another email? \n",
        "permalink": "/r/csMajors/comments/1axjoqn/failing_all_my_cs_classes_but_im_passionate/",
        "comments": [
            "FAANG likes to take bright young programmers and challenge them. The problem is that your BMI calculator demonstrates that you have already reached the pinnacle of programming, so they figure you'll get bored and make too much noise playing ping pong at the office. \n\nAs for your professors, they know your high level of passion puts their jobs at risk, so if they let you graduate, you will take all of their teaching jobs.\n\nI would send out an email letting them know that in exchange for passing you, you will offer them a one on one tutoring session for programming BMI calculators.",
            "Shitpost flair plz",
            "I managed to make a BMI calculator that runs in O(2\\^n) time.\n\nI think this is probably the fastest ever?",
            "You just need to make one more to do app",
            "Are you passionate because you grew up LOVING computers?",
            "You should make copilot and chatgpt talk to each other to make the most Supreme ai that can destroy mankind. With this new power, you could even build a calculator!! This will tremendously help your future",
            "Have you considered implementing a 4-function calculator in Python? Seems like a step up from your BMI design to prove you have what it takes.",
            "Not passionate enough. Grind 20 leetcode problems right now. 20 more when you’re sleeping. Then we can maybe talk about passing your class",
            "This is a troll.",
            "If u attend office hours and speak up during class to show ur passion u will have a bigger chance of the professor giving u a grade bump so u can pass and not fail. also gpa doesn’t matter u should focus ur time on industry skills.\n\nalso maybe the reason ur professors r failing u is because u told them ur passionate, ur gonna steal their jobs so they have to give u a low grade to discourage you.\n\nyou must be new since u are proclaiming ur passionateness but u have to remember to become ayanokoji from classroom of the elite in order to truly become a cs major",
            "It sounds like you're feeling frustrated with the situation you're facing. Let's break it down:\n\n1. **FAANG Offers:** Not receiving offers from FAANG companies doesn't necessarily reflect on your passion or skills in computer science. These companies have highly competitive recruitment processes, and many factors beyond passion, such as technical skills, experience, and networking, come into play. It's essential to keep applying, honing your skills, and seeking out opportunities to improve your chances.\n2. **Professor Feedback:** If you're receiving failing grades despite expressing your passion for the subject, there could be several reasons for this. It's possible that your professors are assessing you based on criteria other than passion, such as understanding of the material, application of concepts, and meeting assignment requirements. It's crucial to take their feedback seriously and consider areas where you can improve.\n3. **Email Communication:** While expressing your passion for the subject in emails to your professors is commendable, it's essential to ensure that your communication is respectful and focused on addressing any concerns or seeking help. Sending another email could be appropriate if you have specific questions or need clarification on the feedback you've received. However, it's essential to approach it professionally and be open to constructive criticism.\n\nIn summary, keep pursuing your passion for computer science, continue to improve your skills, and seek feedback from your professors to understand how you can perform better academically. Additionally, explore a variety of opportunities beyond FAANG companies to find the right fit for your career goals.",
            "I feel attacked",
            "Bad joke. Officer get em",
            "Have you tried making a bmi calculator with Gemini instead?",
            "I'm trying to build a bmi calc for the last year however im unable to do so because im still stuck at printing hello world🥲",
            "Your mistake was going to college. CS at college is too math heavy. You should drop out immediately and work on your passion projects. This will definitely work and not blow up in your face because you are passionate.\n\nBtw, if you get stuck while self teaching, I am offering a 10% discount on my shitty leetcode ripoff. Use promo code “GRIFTER”",
            "🎣",
            "cringe flair plz",
            "idk, not really convinced you are passionate about computors. perhaps you could explain more about this bmi calculator (whatever that is)?",
            "You are failing because you are communicating in email. You should build your own message service by writing to TCP/IP sockets directly and just assume your professor receives them. They will be so impressed that you will be top of the class immediately.",
            "The issue is your BMI calculator isn't revolutionary, it can be found on Wii Fit CD.",
            "Shitposts are generally supposed to be funny bro, not cringe",
            "Now, send out to recruiter that you are passionate but failing the classes.",
            "You better get PASSIONATE about doing your homework and studying. Ain't no room for socializing when you're failing. \n\nLoser does not get the spoils. Get to working, lad.",
            "This can’t be real",
            "You say that you're passionate, but can you reverse a linked list? You would be a fraud otherwise.",
            "*Yeah bro, more emails, less studying, that will help pass your classes*",
            "So passionate about failing?",
            "Is ChatGPT looking for a job?",
            "have you considered starting your applications with \"Hello World!\"?",
            "I don’t think it gets better than a BMI calculator and passionate emails so",
            "this is the guy who goes looking for a technical cofounder in a year",
            "What are you waiting for? Don't waste your time with this university crap, get the funding and put out the BMI calculator on the market! They don't want to hire you because they are afraid. #ai #heartemoticon #cs #venturecapital #enterpreteneur",
            "piquant alleged quicksand sable seed impolite boat gray nail truck\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Keep asking ChatGPT! Really gonna get you far.",
            "God bless this post",
            "Jerk 😂😂😂",
            " But does passion pay your bills",
            "This post reminds me of the folk that are mad people are flooding CS for the money.\n\n“ALL THESE GUYS THAT ARE GETTING THE JOBS ARE ONLY DOING IT FOR THE MONEY BUT IM PASSHUNATE AND CANT GET A SINGLE JOB, WHAT GIVES GUYS???”"
        ]
    },
    {
        "post_id": "19dcwc8",
        "author": "fegmentationSault",
        "title": "Landed my first internship",
        "url": "https://i.redd.it/jm36u9hbi3ec1.jpeg",
        "score": 534,
        "num_comments": 56,
        "created_utc": 1705974585.0,
        "selftext": "There is still hope. Good luck everyone!",
        "permalink": "/r/csMajors/comments/19dcwc8/landed_my_first_internship/",
        "comments": [
            "Every time I see one of these posts I get closer and closer to downing a bottle of sleeping pills, putting a plastic bag over my head and taking a bath.",
            "why is this tagged as shi*post",
            "Congratulations bro! Are you a junior?",
            "What’s your resume look like? What are you gonna be working with, good shit bro",
            "Congratulations brother",
            "What kind of questions did they ask you during the interview? Is it leetcode style?",
            "damn i applied to 3 internships got rejected to one, i rejected one and got accepted to one. Guess i was lucky",
            "Congrats!! Really nice seeing all these posts of people getting an offer lately, good change of pace",
            "all u need is one",
            "I almost landed on the concrete floor from the roof of my schools’ engineering tower. I’ll get there one day.",
            "Where do u find internships , suggest the best websites to apply for internships  \nalso if u can say what role, payed , not payed etc.",
            "How did u make this graph ?",
            "where did you get your security cert? :)",
            "how long did it take from when you applied to getting your interview?",
            "Congrats ! Can someone tell me how can we create this sort of graph ? Thanks in advance !",
            "How can I make a chart like this?",
            "Congrats and fuck you",
            "I have 550 applications and 200+ rejection"
        ]
    },
    {
        "post_id": "16aaj6x",
        "author": "Acceptable_Rest_3923",
        "title": "I wanted to inform everyone in here that you are in the presence of a 3 time PayPal rejectee",
        "url": "https://www.reddit.com/r/csMajors/comments/16aaj6x/i_wanted_to_inform_everyone_in_here_that_you_are/",
        "score": 534,
        "num_comments": 59,
        "created_utc": 1693877522.0,
        "selftext": "Ask me anything 💪",
        "permalink": "/r/csMajors/comments/16aaj6x/i_wanted_to_inform_everyone_in_here_that_you_are/",
        "comments": [
            "how much do u bench",
            ">3 time PayPal rejectee\n\nRookie numbers",
            "Refer me, please.",
            "U heard back?",
            "r u still gonna use paypal",
            "What is the cooldown period",
            "how can i become big baller swag like you",
            "Do you enjoy your life",
            "Hey, I got rejected by Capital One even though one of their interviewers showed up 20 minutes late and kept dropping off the call.",
            "Why paypal?",
            "you lift bro?",
            "A good course is Colt Steeles algorithms and data structures. I know someone who did this and didn't even do a computer science degree but got a job at Microsoft. This person was already working at Microsoft though in a different field but it shows how important finding the right teaching for you is.",
            "will you apply again?",
            "It’ll all pay off soon brother… keep at it ❤️",
            "Rookie numbers",
            "When is attempt 4",
            "How did you do it",
            "Didn’t learn after the first 2?",
            "how do I be like you",
            "Keep your head up man, its part of the process.",
            "How do you survive with no job ? Where do you get your money from ? (Real question from france)",
            "Why did you try three times?",
            "I have passed screening for almost every company. But intel has rejected me already 4 times i feel you bro",
            "Are you in the 1000lbs club at least?",
            "The funny thing is Elon was a horrible coder 😭😭",
            "Why would you want to work for PayPal anyway?\n\nThey owe me $50.",
            "Fuck PayPal. They’re a scummy ass company anyways.",
            "Leetcode or Leetcode ???",
            "Why you guys want PayPal so badly? Elon doesn't even work there anymore.",
            "OP change your r/ to rejectable….ASAP!!",
            "How do you deal with having such an enormous cock? Do you just wrap it around your waist and use it as a belt? What happens when it gets hard? So many questions!"
        ]
    },
    {
        "post_id": "1bqglig",
        "author": "Much_Independent_574",
        "title": "AI isn't the cause of the tech hiring slow down! via Zac Wilson",
        "url": "https://www.reddit.com/r/csMajors/comments/1bqglig/ai_isnt_the_cause_of_the_tech_hiring_slow_down/",
        "score": 538,
        "num_comments": 103,
        "created_utc": 1711687026.0,
        "selftext": "AI isn't the cause of the tech hiring slow down! There was a law that went into effect in 2022 that updated Section 174 of the tax code.\n\nHere are two scenarios to illustrate this:\n\n\\- In 2021, you could found a startup and hire an engineer and pay them $100,000. Say your company did $100,000 in revenue too. In this case, the $100,000 in cost cancels out the $100,000 in revenue, and your business owes zero dollars in taxes. This makes a lot of sense.\n\n\\- In 2022, you could found a startup and hire an engineer and pay them $100,000. Say your company did $100,000 in revenue too. Instead of being able to deduct the $100k salary in the first year, you have to amortize the $100k salary over 5 years.  \nSo in this case, you'd have a taxable income of $80k for the first year. This means you'll have a $24k tax bill with no money to pay it!\n\nMany companies were caught off guard in 2022 and 2023 during tax season and had to take out loans to pay their tax bills!\n\nSo nowadays, when hiring a software engineer companies have to think, \"will this hire pay off in 5 years?\" and the answer when hiring junior engineers is, \"maybe, maybe not.\"\n\nIn the old world, it didn't matter because 100% of the junior engineers salary could be deducted from a businesses taxes!\n\nIf you're struggling to get a job in tech, please call your senator and demand that they repeal the update to section 174 of the tax code! This would immediately solve about 50% of the tech hiring slow down we've seen in the last 2 years!\n\nSource: [https://www.linkedin.com/posts/eczachly\\_softwareengineering-activity-7179241199537377281-ebo5?utm\\_source=share&utm\\_medium=member\\_desktop](https://www.linkedin.com/posts/eczachly_softwareengineering-activity-7179241199537377281-ebo5?utm_source=share&utm_medium=member_desktop)",
        "permalink": "/r/csMajors/comments/1bqglig/ai_isnt_the_cause_of_the_tech_hiring_slow_down/",
        "comments": [
            "This new law seems weird asf, because wages anywhere else in any other industry is considered a write off for a business.",
            "This makes a lot more sense than blaming immigrants or ai",
            "great insight bro",
            "There's a bill in congress to fix this. It passed the house with a huge majority (357 to 70) back in January. But now Republicans in the senate are trying to block it. And they may very well succeed. \n\nIf you care about this at all, you really should call your senators. It literally takes two minutes. You can easily look up their phone numbers on the Small Software Business Alliance website ([https://ssballiance.org/contact-legislator](https://ssballiance.org/contact-legislator)), call the numbers, and simply say, \"Hi. I'm a voter in your state, and I want you to pass the tax bill, HR 7024. Thank you!\"",
            "Along with interest rates, this adds a lot of great insight to the current state of the tech industry. Thanks for this!",
            "Wow why is nobody talking about this ?",
            "Thank Donald Trump who introduced this bill, to pay for tax cuts for billionaires",
            "It’s no one thing, and a US tax clauses with narrow scope (R&D) is not what is driving the global cooldown in tech hiring. I’d argue that most CFOs do not consider it a major contributor either.\n\nA few significant contributing factors  \n\nGeopolitical uncertainty: war in Ukraine and the Middle East, increased geopolitical tension with Iran and China, and a bumper year for elections. Businesses and lenders are more risk averse, therefore investment and attitude towards growth is lower than it might normally be.  \n\nCovid disruption: we are still responding to the changes invoked by the pandemic. The virus itself may not be having an impact, but the changes caused in the supply chain, ways of working, and macro economic trends are still being responded to.  \n\nPoor macroeconomic outlook: even with recent growth in some markets, analysts are not confident in significant growth at a global scale.  \n\nHigh interest rate environment: financing growth is challenging for those without health cash reserves or margins, and with the conditions above, those with cash may be conservative in the or expenditure.  \n\nHype, over hiring in 2022: there has been a correction in response to the aggressive hiring post-pandemic where many of the firms that over indexed are now having rounds of layoffs.  \n\nSignificant volumes of grads or others who want a career in tech diluting the applicant pool.  IMO",
            "So, how does this explain that the same market conditions exist in UK and Europe?",
            "Shit gets reposted every couple weeks, the tax was just redefining points that made no sense in Tech like what Research and Development qualifies as.\n\nInterest rates are still high, every sector is getting hit with these layoffs especially finance like banking, so no this isn't a \"taxes are bad\" type thing, this is a companies aren't going to want to hire when everything costs more thing.",
            "Comorbid",
            "While I agree with the other commenters here that this is a factor but not the only factor, I still think this is a significant factor. You have to understand that U.S. is de-facto the tech market maker. If US slows down hiring, everyone else is going to follow suite. \n\nSalaries are the highest expenses in most tech companies, and a significant change like causes companies’ bottom line to change. In a sane world, this change makes no sense. I hope everyone no matter their political affiliation can look into repealing this change. This impacts all of us.",
            "It’s honestly not a bad law since it is for R&D purposes specifically. If a new company spends $1,000,000 to develop a new product, instead of incurring that cost all in the first year and then taxing on 500k in profit / year the following 5 years (if product successful). They can amortize the initial investment and only tax 300k in profit the following 5 years. Rather than a $1,000,000 loss in the first year. \n\nA lot of CS tbh isn’t R&D but maintenance and internal tools and wouldn’t be impacted.",
            "Of course it’s not! Everyone in here is just eating up the AI talk from people who’s job it is to sell AI products. Of course openAI is going to put out news that AI will take over SWE it’s literally how they sell their product. Stop being afraid of sales tactics. Y’all should be smarter than this.",
            "This is not a very good analysis of the broader forces at work here. One of the replies to that post shared someone else's thoughts that are much more accurate however:\n\n>1) Massive collusion of tech redundancies from all companies based on very flimsy claims about a tech recession which are not substantiated by the bottom line of most companies, and are if anything, self-caused.\n\n>2) Create a huge buyers market in tech recruitment, with 50% of people out of work, and many families struggling to put food on the table.\n\n(50% maybe too high, replace that word with \"more\" and it's still fine)\n\n>3) Rehire very selectively at lower salaries and enforce hybrid or full-time work from the office contracts.\n\n>4) Make those you rehired work extra hard to make up for the multiple people they're replacing.\n\n>5) Stock market rewards tech companies for 'cutting the fat'.\n\n>Do you realise how much we need unions yet??",
            "Looks like a consequence of moving too fast and not checking enough details before writing the law. Very much a Trump like bull in a China shop behavior. This is why Trump came up with a description of being a \"stable genius\" (when reports called him \"an unstable idiot\" / not my words) in a search of who caleed him impulsive or stupid you get: https://www.bing.com/search?q=Who%20first%20called%20Trump%20and%20%22unstable%20idiot%22&PC=XMBA&form=LWS001&ssp=1&cc=US&setlang=en&safesearch=moderate",
            "“Zach Wilson” a “mental health teacher” has a pea brain take about macro economics and the most complex tech on the planet and you guys take it point blank serious while the CEOS of 12-13 figure businesses and some of the most intelligent people in the world tell you to consider making a lateral switch and you call BS. \n\nThis sub is straight ostriches with your head in the sand.",
            "Doesn’t matter what causes it. When you can’t get a job, it sucks.",
            "5 stages of grief\n\nYou're in the denial stage right now. Tech layoffs are happening worldwide yet some rando nobody on LinkedIn has the answer to why which just happens to be the same answer which makes you feel better lol",
            "So companies are taxed for revenues and not for profits? \nThat doesn’t make much sense . But laws can be weird .",
            "There is no magic bullet answer. And if there is one, it’s not this. Large software companies got bloated and have more engineers than real work, small software companies don’t have easy access to cash. That’s the actual, core reason.",
            "Let's be real, this may be bad for CS majors but it's good for society. You shouldn't be able to cancel out your tax burden by hiring an intern.",
            "So it’s either AI, immigrants, resume, or tax code but definitely not the supply and demand forces of a free market. Got it.",
            "Welcome to the way the rest of the world handles it, and we're still dealing with shortage of jobs in tech sector, so it's definately AI's fault"
        ]
    },
    {
        "post_id": "1aphojj",
        "author": "cryotext",
        "title": "After months of leetcoding, interview prep, and anxiety, they finally stopped edging me",
        "url": "https://i.redd.it/8wycfh1ee9ic1.png",
        "score": 537,
        "num_comments": 41,
        "created_utc": 1707789392.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1aphojj/after_months_of_leetcoding_interview_prep_and/",
        "comments": [
            "I’m really curious about your resume, is there a chance to see it?",
            "YES MFCKA YES GOD YES!!!!\n\n\nSo happy for you dude or dudette, good grief 500+ applications and you finally got it!\n\n\nOnly takes one amirite?\n\n\nAnyway, tell us the deets and the secret ",
            "This definitely looks like my current graph except the bottom part. Good for you man 👍",
            "Congrats, well deserved. Glad to see people being rewarded for putting in a lot of effort. Hope your internship goes great.",
            "562 applications ... respect to you for pushing through to reach the promised land🫡",
            "Bro is me I am bro (I haven't gotten an offer yet(international studdent in canada)).\n\nGood for u bro have fun",
            "Could you please give more insights about your yoe, leetcode experience (number of questions, strategy etc)? Thank you and congratulations. 😊😊",
            "What a fuckin madlad 🫡",
            "Respect for that amount of work! I have literally never written more than 10 applications 😅😂",
            "Looks like my applications when I moved to Spain. 600 apps 2 final offers.",
            "Who’d u get the offer from?",
            "How many of those were QA applications?",
            "Congrats OP! Btw what app u use to track your applications to a diagram like that?",
            "Congrats OP",
            "Congrats buddy!",
            "Is this for new grad or intern, 562 is insane gj lmao",
            " Jesus dude",
            "I see this graph in this Reddit a lot how are yall making these I’m thinking about making one when I start applying next yr 😭",
            "What tool is this? I keep seeing everyone post visuals like this",
            "Congrats!!  giving everyone some hope 😂",
            "I'm glad you got one :)  \n500 is a lot and you were probably going mentally insane. I hope its all better now.",
            "Internship or Full-time job?",
            "How can you do this graph?",
            "Did you accept?",
            "What app or website did u use for that picture??",
            "Where do you go to generate that diagram?",
            "Where did you end up?"
        ]
    },
    {
        "post_id": "18qolkl",
        "author": "Crazy_Panda4096",
        "title": "I PASSED AUTOMATA THEORY",
        "url": "https://www.reddit.com/r/csMajors/comments/18qolkl/i_passed_automata_theory/",
        "score": 536,
        "num_comments": 113,
        "created_utc": 1703530577.0,
        "selftext": "WHAT THE FUCK IS A PUMPING LEMMA?!?!",
        "permalink": "/r/csMajors/comments/18qolkl/i_passed_automata_theory/",
        "comments": [
            "https://preview.redd.it/6gdxfsxloi8c1.jpeg?width=1290&format=pjpg&auto=webp&s=11fad1d36317ccea21399248a3608f968c3b747d",
            "I got an A in this class and I thought most of it was fun, but I still don’t understand the pumping lemma. I got lucky when it came up on an exam and the question turned out to be one I’d seen while studying.",
            "I HAVE NO IDEA WHAT THAT IS BUT CONGRATS I GUESS 😭!??",
            "WHO IS PUMPING THE LEMON???",
            "I got an A in this class.\n\n\nI could not tell you a single thing I understood during the class, during the exams, or after the exams.\n\nSomething something Turing complete something something DFA and silly diagrams with arrows.",
            "OMG CONGRATULATIONS",
            "I also never understood pumping lemma.",
            "|s| > p AND p in L\n\nPUMPING LEMMA BABYYYY",
            "CHOMSKY NORMAL FORM",
            "Congrats my guy. I got an A on this purely by sheer luck and eventually became the TA without even knowing a single shit from the lectures, even as TA I refuse to make homework questions and only grades stuff because I don't know what the fuck any of this means.",
            "This post resonates with me a lot. I did well in this class and still don't know what the hell we did 💀🙈",
            "The pumping lemma is just a fancy formal way to say: \"if a language is regular, there must be a finite state automaton for it, and then it is either the case the language is finite, or you can walk cycles in the automata. If you can construct arbitrary long words without this cycle property, the language is not regular\"",
            "when u pump these",
            "Bruh congrats. I remember i took that class last year. Probably one of the worst classes i have ever taken. Passed it with a B.",
            "Holy hell I took that class and got an A nearly 30 years ago and don’t think any of it has come to mind again until just now. Congrats and enjoy never thinking about that again.",
            "Same here. FUCK YOU MYHILL AND NERODE!",
            "HOLY SHIT BOYS I ALSO JUST GOT ABOVE THE MEAN FOR MY ADVANCED DSA COURSE FINAL. THANK YOU SANTA",
            "A pumping lemma is one of those things the professor adds to the test to drop your grade %. Or at least mine....",
            "Congrats! I remember that class it was challenging.",
            "Congrats!",
            "DUDE I LOVED THAT GAME ITS SO GOOD 2B's ASS WAS AMAZING",
            "Hands down the worst class I’ve taken. Somehow passed it with a B+. Took a hit on my GPA but I’m so glad I’m done with that trauma.",
            "this was prob my favorite cs class in college. Also the hardest so congrats lol",
            "what pumps up must pump down",
            "Isn’t it when King Julian from Madagascar lifts weights?",
            "[deleted]",
            "Congratulations 🥳\nI took the class last year and loved it.",
            "I don't know how everyone passes without understanding the pumping lemma, where tf are you studying?",
            "What a useless class I don't even know which out of touch academic made this mandatory. Just learning about flow charts as if they're fancy",
            "Hard subject! Nice one!",
            "Explain what it is",
            "Still don’t know LOL",
            "What helped me understand the pumping lemma concept was to start assigning some random values to some of the variables in the equation and seeing how that affected the other variables and overall resulting calculation. After seeing some examples like this, the concept made sense.",
            "Not to be that guy, but this was one of my favorite classes ever",
            "3-4 steps.. do them as shown in videos - 4 marks ezzz 🐥🐥🐥",
            "Well I'm a teaching assistant for this course🥹",
            "honestly don’t i have no idea how i passed this too",
            "Taking this class rn, wtf is this bs. Half of the cs courses feel made up lol",
            "M",
            "Jnmm. N nn. L..       nnnll..l a l",
            "Mmmm jrgrreec.         l.        MH.  e",
            "Jln.m       b. . .  Knjhn:⁠b a p (⁠*⁠_⁠*⁠. )=⁠n ..:⁠'⁠( d-⁠. [ wa ... n    \n.  l m inp phow   pp             mnnplease.  J  er   r     to     r.  .                     Mm.      e.          .  ...  .     \n. ...l  .loj. P lpl pbz we zx bn.",
            "Ae b xm l o nnnnj. F.   Loo p. Z",
            "Our final project was writing a functional Turing machine in our language of choice. That may have been my favorite class in all of CS.",
            "You passed automata theory without understanding the pumping lemma?…"
        ]
    }
]