[
    {
        "post_id": "126t2hb",
        "author": "Blackontheattack",
        "title": "Submitted 7543 Applications, after 2500 OA, 500 Interviews, I got 1 offer!!",
        "url": "https://www.reddit.com/r/csMajors/comments/126t2hb/submitted_7543_applications_after_2500_oa_500/",
        "score": 528,
        "num_comments": 59,
        "created_utc": 1680196092.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/126t2hb/submitted_7543_applications_after_2500_oa_500/",
        "comments": [
            "What I loser I submitted 7542 applications and got TWO OFFERS",
            "Rookie numbers I submitted 20 Applications, after 3000 OA, 6969 Interviews, I got 1 offer for a McDonalds front end cashier 🎉🎉🎉",
            "[deleted]",
            "Damn can you show us a Sanki diagram of it? Congrats!!\n\n(I also find this funny because it means your resume is disgustingly good and your interviewing skills are disgusting bad)",
            "That's insane. When I graduated with my BS 19 years ago, I applied to two jobs, got one, and then went to grad school instead.",
            "Offer: Albertsons.",
            "Bruh, I thought shitposts were reserved for Sundays only lmao.",
            "Pff I submitted 1 applications and got -3 offers catch me",
            "Nobody is surprised at the number of applications. Everyone thinks it’s a joke because OP got 500 interviews.",
            "bros shooting .0001 from the field 💀",
            "is it a joke",
            "This motivates me to keep applying for jobs no matter how many rejection emails I get",
            "I found it believable until I read 500 interviews and only 1 offer. It's funny because it shows the state of job hunting that I wasn't surprised someone sent out 7.5K apps.",
            "Loser I submitted 9669 applications and 0 interviews!1!!",
            "500 interviews?? Recording your interviews and watching back might be a good way to see what’s happening because .1% success for interviews is wild",
            "diagram??",
            "Imagine not applying to every job posting on LinkedIn regardless of role, YOE, or required skills.",
            "A 33% response rate is killer. Congrats on your new Walmart position!",
            "Satire",
            "Bro you missed a sanky diagram....",
            "You need to submit applications to get OAs?",
            "What Ivy?",
            "bro thinks we all go to ivies",
            "hence proven its a numbers game",
            "and that 1 offer is to write custom PHP for jim's surfboard emporium wordpress site for 30k a year. glad u made it bro!!!",
            "Good!!!",
            "Did 696969 applications, received 6969 OAs, gave 69 interviews, still left unsatisfied.",
            "People in comments not realising the sarcasm is a serious red flag for this major lol",
            "Troll post",
            "Some people are just unlucky ig. I had one interview and got SIX offers the next day. The interview itself was pretty easy. I just had to dictate to the interviewer line by line how I would write a function that calculates Riemann sums. They ran it, and the interviewer had a heart attack after it compiled and gave nine accurate answers in a row.\n\nI’ve only been coding for a month, but C++ is just so easy. Then again, it *did* only take me like two weeks of arithmetic in elementary school before I created my own, original proof of the Pythagorean Theorem. Anyway, I digress. Some people are just unlucky, but you have to accept that you’ll never be as good as people like me, so you just won’t have the same opportunities, y’know?",
            "I applied to McDonalds as a cook ONCE and was hired as the general manager three times."
        ]
    },
    {
        "post_id": "rqlwi7",
        "author": "None",
        "title": "Can I ask my university to pay me to be their student",
        "url": "https://www.reddit.com/r/csMajors/comments/rqlwi7/can_i_ask_my_university_to_pay_me_to_be_their/",
        "score": 527,
        "num_comments": 69,
        "created_utc": 1640715185.0,
        "selftext": "I am an exceptionally talented individual. Quite frankly I think my university is lucky to have me. Is there a way I can have them pay me to be a student? \n\nI am not looking for a scholarship, more like a 6 figure salary every month….",
        "permalink": "/r/csMajors/comments/rqlwi7/can_i_ask_my_university_to_pay_me_to_be_their/",
        "comments": [
            "[deleted]",
            "Frankly if you aren’t getting paid already you should be ashamed of yourself. If <750k a year, switch careers and save us all the trouble.",
            "Do it, bro. i think your resume and Github speak for themselves! Good luck!",
            "If you can solve a leetcode hard under 8 minutes like most us, you should be fine!",
            "ARE YOU OUT OF YOUR MIND MUH BRO?? You should ask for seven figures!! Six figures is just peanuts now a days.",
            "Ofc! I even make the profs write MY tests to prove they're worthy of having me as a student!",
            "Only if you can do leetcode hards in under 10 minutes.",
            "This is a shitpost but tbf there are scholarships that actually ends up paying you for studying.",
            "If you're not already being paid, then you have no chance. Maybe switch to business.",
            "Damn, 6 fig every month? Them faang engineers would be jealous. Heck minor ceos would be jealous",
            "[deleted]",
            "at least 🌲fiddy",
            "Bachelors tough luck\n\nMasters and phd, yes",
            "Yes. The trick is you need to get first hired as a Lecturer. But am sure with that Github profile that will be no problem for you.",
            "Tell them you have a competing offers from other universities",
            "You joke, but a handful of countries do pay their students a salary comparable to the industry. I actually turned done a top Uni in UK to head to a no-name university in one of those locations, lol.",
            "Where's your shitpost tag bby",
            "Unless you got the connections with people that own a 12 car garage, no chance mate",
            "Forget the schooling. Sounds like it's time to drop out and embrace your true calling: a Silicon Valley Tech Bro Startup Founder™️",
            "LOL right!! Cant believe we paid for this",
            "Yes, it's called employment. Ie. Ask them to create a job posting with job specifications that match your student responsibilities.\n\nApply for that job posting.\n\nIn return, you will get something called a salary.\n\nUse it to hire someone to punch you directly in the face for this dumb idea.",
            "If you’re so smart just don’t go to school and start making money. US no longer cares about degrees to be honest.",
            "\"Paid to be a student\"? There students that get paid for jobs within the university. \n\nMaybe what you're looking is scholarship. It's kinda like you're being paid to be a student and maintain good grades. That how I see it.",
            "6 figures each month ? not gonna happen",
            "That’s unironically possible in my country lol. Some universities (mostly private but some public as well) give full scholarship + extra money to attract high ranking students.",
            "Isn't this the plot of Young Sheldon?",
            "Six figures???? My high school paid me that.",
            "Ya BUD... you'll keep making six figures until you brain up and beat leetcode on nightmare 😎",
            "Bro aren’t you just saying that you want a scholarship form your university? Actually wouldn’t wording it like that help you more.",
            "Grind LeetCode",
            "yes , they shud pay us literate and hardworking students 100k's every year instead of those dumb already rich households who make all the money in the world by nepotism and are purely dumb."
        ]
    },
    {
        "post_id": "jsjnyq",
        "author": "scttcs",
        "title": "I got an offer!",
        "url": "https://www.reddit.com/r/csMajors/comments/jsjnyq/i_got_an_offer/",
        "score": 528,
        "num_comments": 61,
        "created_utc": 1605138948.0,
        "selftext": "I did it! I got an offer! I got here by taking extra classes at my university so that I could graduate a full semester early. I started applying for positions in early October. To my surprise, my software developer internship fired me in late October, but luckily I started getting interviews by then. At this point, I had two companies looking at me, one of them a small telecommunications company, and the other a large well-known government defense contractor. The gov't defense contractor contacted me today to let me know that they'd like work with me and sent me an offer! I can't believe it. All this hard work has finally paid off. Speaking of pay:\n\nSalary: $73,008\n\nSign on bonus: $5,000\n\nRelocation reimbursement: up to $3,500\n\nMiscellaneous bonus: $3,500\n\nBenefits include medical, dental, and 401K match\n\n120 hours of paid vacation.\n\nIt's still unbelievable. I applied to over 80+ companies, and those are the only application I kept track of. I can't believe I'm going to make $73k right out of college. That's crazy!\n\nWherever you are in the application process, just keep applying. Make sure you have a cover letter just in case, and modify your resume with every application. Trust me, it's so worth it. No one probably cares much, but I just felt the need to share this news. Thank you so much!",
        "permalink": "/r/csMajors/comments/jsjnyq/i_got_an_offer/",
        "comments": [
            "[deleted]",
            "So happy for you random stranger!!",
            "First of all congratulations! Second, I'm sure you already know everything I'm about to say, but on the off chance you don't, I'd feel bad if I didn't put it. I looked at your post history and saw that you tried shrooms at some point recently (?)\nFor the love of God, don't lie on your clearance form, because you will get one, and definitely don't take anymore illegal drugs. Make sure you read up on what they want to see for an clearance applicant in regards to prior drug use and double check that you won't have any issues getting a clearance. I'm sure you'll be fine, but when I started my clearance, they didn't really give me any details about this type of stuff.",
            "Gratz, I am only a freshman struggling my butt off with Discrete Math, I am trying my hardest to get a B.\n\nCant wait to make this post some day in the future.",
            "Congrats! What company is this?",
            "W!",
            "Congrats man! What did the interviews consist of?",
            "not making $400k at Jane Street? might as well die",
            "If you don’t mind, what state?",
            "That’s amazing!! Super happy for you :)",
            "what exp u have in coding ?",
            "Interview experience please. Like what questions they asked and all such.",
            "Congratulations!!!!",
            "whats your alma mater?",
            "Good job!!!",
            "Congratulations!! Its so difficult to land your first CS job. Throw yourself a big party please.",
            "Ayyyyyy, congratulations! That's amazing! I'm super happy for you, random stranger! :D",
            "Congrats OP hopijg for a smooth transition to wo k!",
            "That's amazing! Congrats man!!!",
            "Gives me hope dude! Thank you! and go you!!!! WOOHOO!!!",
            "Congrats OP!",
            "[deleted]",
            "Where do you live?",
            "Good for you pal"
        ]
    },
    {
        "post_id": "1cguinp",
        "author": "Claptic",
        "title": "Costco Internship Numbers (+12,600)",
        "url": "https://www.reddit.com/r/csMajors/comments/1cguinp/costco_internship_numbers_12600/",
        "score": 528,
        "num_comments": 55,
        "created_utc": 1714488068.0,
        "selftext": "Just got this email from Costco IT for one of their internship programs. +12,600 applicants for 40 spots.\n\nhttps://preview.redd.it/iwfom8gbpmxc1.png?width=923&format=png&auto=webp&s=6e151c6cd1c28bfbb474b2a8b897d1a9dc5da7d9\n\n",
        "permalink": "/r/csMajors/comments/1cguinp/costco_internship_numbers_12600/",
        "comments": [
            "CS Majors were told they would be Gods, but most ain't even gonna be slaves and they'll be executed before they even make the auctioning block.",
            "Ayy that’s 315 applications for each one of the 40 roles. I’d say your chances are better than average!",
            "i got my rejection too today",
            "You mean to tell me students shotgun applications to every internship they can find? Never would have thought that...",
            "But r/cscareerquestions told me that the reason why entry level is bad is because all we do is apply to FAANG",
            "I was working for Costco before I got my HS diploma. I can put you in touch with my hiring manager if you want.\n\nEdit: to add /s because my joke as a part time cashier didn’t come through and have people messaging me. Sorry!",
            "Guess I'm just going to finish it and hopefully work my way up in trades.",
            "Okay that number is fake. They probably don’t even live in the USA, rather India!",
            "out of those 12600 less than 5% are will actually even get looked that. Being that they have to siphon through applications by eligible workers. A lot of those are international students, people that are going to try to use AI to do the job, bots spamming, and people with the actual necessary skills to do the job and outside of school projects. So really there is about less than 500 eligible applicants and if you dont trust me go look it up.",
            "THOSE NUMBERS!!! WTF.",
            "Guys we are cooked…"
        ]
    },
    {
        "post_id": "17bz30a",
        "author": "United_Birthday7444",
        "title": "UWaterloo undergrad employment this year... it's joever",
        "url": "https://i.redd.it/u4j20xccd9vb1.png",
        "score": 527,
        "num_comments": 91,
        "created_utc": 1697764460.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17bz30a/uwaterloo_undergrad_employment_this_year_its/",
        "comments": [
            "U waterloo mentioned, gotta have this image\n\nhttps://preview.redd.it/kvabzha7h9vb1.png?width=595&format=png&auto=webp&s=cbbac6d1da2758f403554d49f05063bc98d68499",
            "38% for software engineering is insane. Is this 6 months after grad or a year? Or is it co-op unemployment?",
            "CivE is by far the most stable field of engineering. We always need to build stuff and it’s hard to outsource or automate due to regulations. But the catch is it’s the lowest paying.",
            "Dang even UW is struggling to land a job?",
            "it’s expected",
            "It's so Joever for us",
            "This is probably for a winter internship (Jan-Apr) so it's not super telling given its only October (i.e. probably only one round of co-op offers have been given out). The numbers will continue to increase over the next 3 months or so.",
            "What's Syde and tron ?",
            "Every single SWE intern besides me at my upcoming company for the spring is from Waterloo??",
            "Well isn’t this kind of the norm? Examine any college. You’d be lucky to find more than 10-15 freshman and sophomores who have employment in a field related in their degree. Many juniors and seniors just have the idea that “I need to get a good gpa and I can worry about jobs after I graduate”\n\nWe need more context here. Are these juniors/seniors only? Are these recent grads (I’m guessing not)? Does this include employment in unrelated fields?",
            "cause wipe ask swim provide distinct gaze attempt impolite squash\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Meanwhile, as an EE undergrad...LMAO. Should I just switch majors now?",
            "Where's CS?",
            "For everyone confused here, the statistics are for current Engineering students at the University of Waterloo looking for a co-op/internship next term (Winter 2024).\n\nThere are a few things to note, those numbers are actually in line with how its always been historically. Waterloo students get matched with jobs over 5 ish cycles over the course of this Fall semester. Only 1 cycle has been completed. Essentially, its still very early in the term, and there is a lot of time for the numbers to ramp up to 80-90%.\n\nAll in all, there is **zero reason for concern**. These statistics are for (mostly) Canadian Winter internships from a random ass Canadian university, and 95% of the people here are probably hunting for Summer internships in the US so those stats are irrelevent... \n\nIts also funny that OP didn't even include the statistics for CS majors (yes SE is there, but there are triple the CS students compared to SE).",
            "[deleted]",
            "How many of those unemployed are going to grad school/not seeking employment/doing research or working on a startup? This data does not show a full story",
            "How does a university even collect employment stats? There's zero obligation for graduates to inform their university of their employment...",
            "2nd highest % employed? Where is the problem?",
            "When did these student graduate? Fall 23 or Spring 24?\n\nIt would be interesting to see the change over time."
        ]
    },
    {
        "post_id": "14zzqqm",
        "author": "CyberChefsCookin",
        "title": "How do you deal with delusional parents 😭",
        "url": "https://www.reddit.com/r/csMajors/comments/14zzqqm/how_do_you_deal_with_delusional_parents/",
        "score": 529,
        "num_comments": 163,
        "created_utc": 1689388720.0,
        "selftext": "My parents are kind people, but they know nothing about CS outside of \"day in the life of a software engineer\" and \"FIRE: Retire early\" videos. They genuinely believe I will graduate with a six figure job and be able to save enough to retire at 30. Not to go into my personal life, but a mix of the going rate in my area + personal stats being mid + no real desire for tech jobs that make 100k (I have internships just not in the big companies) makes that really hard to achieve out of college. \n\nI would just be irritated by this, but my parents are legit planning their retirement off of me making big bucks once I graduate. I don't know how to explain this to them because whenever I tell them to be a bit more realistic they ignore me and say I'm delusional and I'm going to be rich because I'm a CS student\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/14zzqqm/how_do_you_deal_with_delusional_parents/",
        "comments": [
            "[deleted]",
            "Just smile politely and nod and ignore them or say something like 'well, we'll see but you should always have a backup plan'.  \n\nOnce you actually graduate and get a job, if they come around with their hands out then you can explain to them that after paying rent, utilities, etc you do not have extra income to fund their retirement.\n\nIt will not be a fun conversation, but there's probably very little you can do to convince them now.  And at that point you'll be out on your own and can more easily ignore their foolishness than you can as a student.",
            "With how the cost of living is going there’s no way you’re funding their retirement even w 100k",
            "I was watching some FIRE videos earlier too. I only have a crude understanding of it, but here's my take anyway:\n\nNo offense to your parents, but expecting retirement by 30 is frankly insane. Possibly, they do not have a good grasp of finances themselves or misunderstood what FIRE actually accomplishes?\n\nEarly retirement is still like late 40's to early 50's if ur lucky and invest well. I mean, invest 25% of your income and assuming constant annual raises. Oh! And also assume no emergencies that could wipe out your savings (cancer, lawsuits, etc).\n\nRetirement in 30's is only realistically achievable if you can save and invest something like 70% of your income. Obviously meaning you must be able to live off the remaining 30%.\n\nIn either case, saving 25% or 70% you can only safely withdraw 2-4% of savings from retirement accounts. That might get you close to maintaining your pre-retirement standard of living.\n\nFIRE gets YOU financially free. Meaning you only need to work because you like it. The interest generated on savings covers all your living expenses. It is definitely not designed with the idea of THREE PEOPLE RETIRING OFF ONE INCOME!! Your parents pulling from your savings (besides being obviously greedy on their part) jeopardizes the constant growth of your savings. If you lose too much or fall too far behind inflation, you could end up forced out of retirement.\n\nDisclaimer:  I am only regurgitating bits of what I understood from a handful of podcasts. (Shout out to Dave Ramsey, The Money Guy, and Caleb Hammer!) It's admirable to look after your parents, but only do what is financially sensible for you.",
            "Eh, my parents still see me as a failure (\\~15 yoe) and keep saying I should try to be a youtuber instead.\n\nLook on the bright side, with a little luck, in a few years, you won't be able to hear them over the sound of your spouse, house, and rugrats.",
            "Tell them to watch Broke from ESPN’s 30 for 30. It is about athletes going broke for multiple reasons. The one part where one NFL player cut off his mom after she gave him a bill of $1 million after he signed his first contract and had to cut her out of his life. \n\nJust remember Don’t have Champagne Taste when you make Beer Money.",
            "My parents are the opposite. They planned their finance around the assumption that I’m an incapable fuck who will live in their house for the rest of my life, and ignore how many times I told them I’ll be absolutely fine on my own. I just graduated and is making well over 200k right out of college, guess what, my mom stills says one day I’ll fuck up my job and move back to their basement.",
            "My parents have saved anything for retirement and don't even think they'll live long enough for it to matter, which is sad. That said, one of my personal goals is to retire them because they are hard workers who deserve it and their current jobs are destroying their bodies. That goal might be different if they acted entitled to the fruits of my labor or behaved as if they expected it, but that's not the case luckily.",
            "I mean maybe not right after college, but if you do get sec+ and capitalize off internships, with a bit of luck you could be making 6 figures in cyber within 5 years. If that’s what you wanted. \n\nBut as far as the parents go, idk, I would sit them down and tell them they need to have realistic expectations out of you. And not to depend on you for their retirement. Why aren’t they getting tech jobs and learning to code if they are obsessed with it so much?",
            "\"My money is not your money\"\n\nThat should fix it.",
            "Maybe tell them to suck it?",
            "Finances aside, how would your wife and kids feel about you funding your parents' voluntary retirement with the family's money?",
            "Your parents, while they mean well, are ignorant. \n\nIn no way should they burden you with their own financial freedom.\n\nJust keep doing what you can to succeed, and do your best to ignore their comments.",
            "I am the age of your parents. Probably older. My son is a CS major. I once saw an interview with a couple who supposedly lived the FIRE lifestyle. But if you paid attention they had moved to the middle of nowhere, the husband worked remotely and the wife took care of the kids while doing YouTube stuff on the side. In reality no one was retired. \n\nI have a 40 year old neighbor who claims to be retired. He’s actually a stay at home Dad. His wife works full time. Nothing wrong with that, but it’s not retirement. \n\nThere may be some people who truly retire very young, but not many. Regardless of what you eventually earn it’s unfair of your parents to put that burden on you. It’s not your responsibility to fund their retirement.",
            ">but my parents are legit planning their retirement off of me making big bucks once I graduate\n\nI would be very careful about this. I'm all for transparency for how much you're making to other people to educate others about how much you potentially can be made, but this sounds like a potential downside when you are transparent with your parents. Money is one of the really sour topics I have learned over the years in particular to never talk with my mom about because she also has really delusional expectations around it. I was asked by my mom a year ago 6 months into moving into a new place after furnacing my entire place from scratch with absolutely no help on top of her also taking away funds from me during a time when I owed a lot of debt from credit card payments and student loans since I was living with her if she could borrow 60k from me because of issues that she made for herself on some damages related to her house. I refused, then she proceeded to go to a complete stranger she's never seen before talking a whole bunch of shit about how I was ungrateful a son to her because of the income I was now making while completing my taxes, at a time when I was close to making a 6 figure income.  Not saying that you're parents are doing this, but just to highlight that money in particular is one of those topics that absolutely can change people, especially to those that don't have it.\n\nParents shouldn't be planning retirement for their kids. This could just be them playing or them giving you warning signs about how they potentially may act when you start to actually have a decent income for yourself. I would encourage you to steer clear away from this topic just from personal experience navigating around some of my own family members in my life after I gained a decent income for myself and even encourage moving far away from your parents after you graduate. Not saying that you shouldn't help them out if you have the means to do it, but you have to take care of yourself first before you start to help out other people.\n\nHaving a high income doesn't mean that you retire early. Retirement is solely based on how much time you're saving given all of the expenses that will come up in your life. To retire that early, you would've needed to start hustling and making money at the age of 14 while putting money into a brokerage fund to build up making a 5-6 income with no responsibilities to pay for anything else.",
            "Depends. Are your parents from a poor country? Then you can send them back and give them 200$ a month to live",
            "Show them the average salary for software engineers in your country.",
            "wdym bro just disassociate and ignore them lmfao",
            "There’s a lot more to unpack here than anything related to being a swe. There are boundaries that shouldn’t be crossed.  I had a similar a position and you have to remind yourself it’s not your responsibility to enable their poor behavior with to have the, leech off you when they retire. We all should honor our parents but honoring them does not mean enabling poor behavior. There money habits won’t ever change if you ever continuously help them. Which sucks because it’s your parents and you don’t want life to be hard on them.",
            "Sounds like you should introduce them to r/wallstreetbets",
            "Send them a link to layoffs.fyi",
            "Bruh. What? That’s delusional asf. When I get a career in IT, saving up for anyone’s retirement is the last thing I’m doing lmao\n\nI myself have big plans and these plans have the potential to help others. Yeah, I can help two people retire, but I would feel much better helping out more people.",
            "Sorry m8 but wrong sub. This is r/entitledparents material",
            "vast innocent berserk telephone gray attractive lip middle screw tease *This post was mass deleted with [redact](https://redact.com)*",
            "Tell your parents that you have cancer and will fie by the age of 29, 1 yr before retirement. They'll change their plsn really fast\n\nAlso, sounds like entitled and delusional parents. Frankly, they forced you into a contract you did not sign and demand a pay out on their investment by age 30. So maybe do it all under your own term",
            "I agree that your parents shouldn't be planning their retirement on you, but putting that topic aside, I also think you may be underselling yourself a bit in terms of your potential career trajectory. You may not make 100k right out of school, but after a couple years and maybe some job hops, it should be more than attainable. I work at a big tech and there are plenty of people around me who did not work at top companies or attend top schools prior to joining.\n\nI realize that the prospect of getting a high paying job might seem unlikely right now due to the tech downturn and personal factors, but sooner or later those opportunities will return and you would benefit from having the confidence to pursue them. Have faith in yourself and don't resign yourself to staying in low-paying jobs before you even start your career.",
            "just say what they want to hear.",
            "> I will graduate with a six figure job and be able to save enough to retire at 30\n\nNot unrealistic if you work in HCOL and retire in LCOL.",
            "Have more faith in yourself op",
            "They sound like people you may very well need to cut out of your life or have a very hard conversation with. Be prepared",
            "I would not worry this much about their expectations, if I were you. Whatever they are banking their retirement on is their concern, even if outward appearances suggest your income is a part of it. So just ignore it, let them do their thing, you do you, and they can be responsible for their outcome of their own lives, since they are adults. So the answer to your question about how to \"deal\" with them, is you don't. You're an adult. Worry about your own responsibilities.\n\nBut their financial expectations, if what you are saying is true, don't make any sense. Even if you were to make 6 figures over the next 10 years.  Let's make it $200k to be generous. Even if you were to start at 20 and make $200k/yr for 10 years and earn a cool $2 mil by 30, how much would you even have left at 30, after taxes and annual expenses? Even if you lived frugally ($40k/yr), don't make huge purchases, invested 100% of your remaining income at the average 6% return, according to my calculations you'd be left with about $1.05 mil at 30. That's nowhere **near** enough just for 1 person to retire on. Just your personal frugal expenses alone, with inflation and typical return, you'd be broke by the age of 47.\n\nIgnore them and do your own thing.",
            "Try showing them data or an article about income of cs degree holders and how competitive the field is.",
            "If they aren’t planning their own retirement, they are delusional.",
            "Ask your parents how they failed to save for retirement despite growing up in one of the best economies with tons of economic opportunities and a 15 year bull market.",
            "lol there was a lot of videos last year of like 'a day in the life at twitter' where someone on $300k would be like 'so I start the day at the office with a free coffee, then check my emails by the pool, then take a mindfulness break at the yoga suite, etc'\n\nbut yeah I don't know, reality will set in at some point, especially once you get your first couple of jobs and you tell them how much the rent in your area is",
            "Tell your parents to get their own damn retirement and to leave your money alone. Do they want grandkids? Tell them you can afford kids or them.",
            "So annoying bro. My mom was the same. Instead of encouraging me to finish the difficult classes she would say “Youre gonna make so much money when you graduate” & “I have to figure out how much im gonna charge you in rent”. For the first few months she charged me a ridiculous amount to live at my own home until I just burned out & broke down. It was my first job, I was still learning, & every check I worked hard for being chopped with no ability to save broke me. She then stopped. Ive been working 7 months & just got to save $10k yesterday… I could have been at around $20k by now. Thats a lot more than most people. But I am actively working hard to get out. Its weird & predatory.",
            "You’ll basically have to just ignore them. You likely won’t make 6 figures right out of school but don’t fall for the trap that you have to work at a FAANG or something to be well compensated.",
            "jeans head fanatical humor snails cover aromatic mighty consider sulky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "This is gonna sound mean but smile and nod for now so they don’t stop helping you while you’re in school. When you’ve got a job, you’re an adult, tell them their retirement is not gonna be mooched off your income in the slightest and stand by it. Nobody can stand up to them for you at that point you’ll just have to do it, and don’t feel bad about it bc they don’t feel bad for being entitled.",
            "AI gonna take all our coding jobs in like 5 years at most, how are your parents gonna retire off your riches when that happens",
            "Late reply but your situation is kind of relatable, although it’s kinda fucked they’re planning their own future off your come. That’s truly frustrating. Something I’ve learned as I’ve gone through uni with my dad who is the same way is that…one way or another they’ll see. Ok, you may not land the 100k faang job right out of school(very few do), but if you start out at 80k, hell even 60k first job you’re doing FINE. The most important part, YOU will be at a point where you are fine, they can rely on you all they want but you’ll be the one with the job and income by then. Ironically, you have more “power” in this situation than you realize.\n\nKick ass in your DS/algo classes, try for an internship even though it’s so hard right now, go to a networking even or two, and get a portfolio going. \n\nYou gain a different kind of respect from your parents when you become your own person. You may be an “easy target” now, but when they’re retired and you’re making 6 figures, no matter what they’re saying to you now, you’ll be the one holding all the cards. Help them sure if it makes sense, but save yourself the pain of working through uni with the thought the salary you’re working towards is just going to be siphoned by your own parents. You’ve got this, good luck.",
            "Seems like a personal problem for your parents lol. If they couldn’t have capitalized off the easiest easy mode economy/market and ability to get a good paying job insanely easily during the boomers peak timeline, then they are the problem",
            "i have the opposite problem. my parents think i’m gonna be a bum and think ill only ever be making 60k.",
            "I cut them out. I'm a millennial. We generally don't tolerate that, regardless of our relationship. \nI already cut out my psychopathic mother just for trying to gaslight me.",
            "lol... your parents think you'll be their retirement piggy bank? yikes.",
            "Let me guess: are you Indian?",
            "If you’re in the US, you are going to be rich, but rich doesnt qualify the millions they will need for their retirement, and you will never see an amount that high that quickly, even if you were an exceptional SWE.\n\nIf you’re outside of the US, your parents are extra dumbfucks.",
            "One thing that you can tell your parents is that layoffs are not that uncommon in tech work. According to Crunchbase, over 154,290 US tech workers have been laid off so far in 2023. I worked in tech for 20+ years and I was unemployed for a while during both the dot-com bust and the Great Recession. Some years you might make six figures, and some years you might not. And another thing is that a lot of new grads are having a hard time getting their first job right now. I have a daughter who just graduated with a BS in CS and she'd be happy to get a job paying $60K-$70K. I apologize if this sounds doom-and-gloom. It's just meant to help the OP to manage their parents' expectations.",
            "Tell your parents that you were planning your NEET life off of their retirement. That'll show them.",
            "You told them the truth and laid out what you saw as realistic expectations and the reality of the situation.\n\nI'm sorry. You did your best. Just remember you did your best.\n\nBTW: if you do start making money. HIDE IT. Rather, keep it low-key or just invest it. They will ask you for money in the future but it's not your responsibility.\n\nGood luck."
        ]
    },
    {
        "post_id": "17wzocs",
        "author": "hello_there_1231",
        "title": "Leetcoder talks about 400k TC offer",
        "url": "https://v.redd.it/3f40ypz5fs0c1",
        "score": 524,
        "num_comments": 20,
        "created_utc": 1700174370.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17wzocs/leetcoder_talks_about_400k_tc_offer/",
        "comments": [
            "2023 grads looking at this T-T",
            "Video loosely applicable to 2021 rush \n\nVideo is not at all applicable to todays environment",
            "“I’ve never written a production line of code in my life”\n\nand\n\n“I’ve never even written code outside the LeetCode editor” killed me 💀",
            "this genuinely got me dying of laughter",
            "risitas memes never fail, RIP!",
            "LMAOO",
            "Masterful editing on this one",
            "This is a hall of fame meme, fantastic work",
            "That's how it is with tech.",
            "In theory: This video.\n\nIn practice: You fail the interview",
            "Wholesome irony",
            "Fellas can we just appreciate that it’s really funny? Lool.\n\nYes it’s unrealistic. We get it. But this is so good.",
            "In theory: this video\nToday: you won’t even get the interview"
        ]
    },
    {
        "post_id": "1bwmbjj",
        "author": "rovampax",
        "title": "Get your numbers up! 400% rejection rate",
        "url": "https://www.reddit.com/r/csMajors/comments/1bwmbjj/get_your_numbers_up_400_rejection_rate/",
        "score": 521,
        "num_comments": 19,
        "created_utc": 1712334381.0,
        "selftext": "So after applying to a position at Revolut several nights ago (4 months' worth of several nights), they have decided to continue with other candidates and have been letting me know for a couple of days now.\n\nThe first time they emailed me twice to reject me, then another rejection a couple of days ago, and a 4th - perhaps final rejection just now. Mind you these are all for that 1 position.\n\nWe truly moving numbers",
        "permalink": "/r/csMajors/comments/1bwmbjj/get_your_numbers_up_400_rejection_rate/",
        "comments": [
            "Rejection rate on 400% is nuts. Motion like crack in the 80s fr.",
            "They preemptively rejected you for those other positions that you were thinking of applying to as well in your head.",
            "The must really have hated you, to go to such lengths to make sure you won't work for them.",
            "I was about to say “check your numbers bro that’s impossible” but lo and behold… wow. Maybe if you apply a 2nd time they’ll seriously consider your candidacy before rejecting you a 5th time??\n\nEdit: can’t math today",
            "That’s two double negatives. You’re in my guy",
            "London internship? Cuz same, they just wanted to remind u 3 extra times that u ain't good enough",
            "And, then there are folks who apply multiple times with different email ids.",
            "Your application broke their system",
            "You can thank your heavens that you got rejected. If they accepted you ud at least have 4 jobs to cover.",
            "I remember being rejected three times from a master's degree (I only applied once)\n\nYou went beyond that",
            "400% rejection rate from revolut is insane, i thought their requirements were a pulse",
            "Find your niche and master it.",
            "Ok, you are the new king here. The moderator team is handing over the admin rights to you as we speak. :)",
            "it's like you're down and they kick you ...",
            "ouch! I'd cry if someone does that to me",
            "This rat race is nonsense, not going to compete for shit thx.",
            "You’re only at 400%?"
        ]
    },
    {
        "post_id": "10szh3z",
        "author": "JaggedBen",
        "title": "Received an offer for a summer internship!",
        "url": "https://www.reddit.com/r/csMajors/comments/10szh3z/received_an_offer_for_a_summer_internship/",
        "score": 527,
        "num_comments": 45,
        "created_utc": 1675468796.0,
        "selftext": "After months of applying so finally got an offer!\n\n$15/hr 40/hr a week for 12 weeks at a mortgage company.\n\nDefinitely not the most ambitious or exciting work but I’ll be gaining some much needed experience.\n\nFigured I’d share the good news with all of you :)",
        "permalink": "/r/csMajors/comments/10szh3z/received_an_offer_for_a_summer_internship/",
        "comments": [
            "Good job OP! Be proud of your accomplishments!",
            "YAYAYAYYYYYY!!! This is so awesome, OP! Congratulations!! I am so proud of you and am celebrating this HUGE win with you!!! I am confident you are going to crush it in this internship!! Sending lots of positive thoughts and energy your way! :)",
            "Congrats!!! \n\nNow you'll get to farm more exp ✔️",
            "Congrats",
            "Congrats and continue applying. Since you secured 1 the confidence you will have in your next interviews is like nothing else.",
            "congrats. where do you guys usually apply?",
            "Congrats op. The first is always the hardest, and with that out of your way I am sure you'll get better (and more) opportunities in the future!",
            "Let's Fucking GOOOOOOO",
            "good shit",
            "Legend",
            "Hardest part down my friend. All your next internship interview processes will come much easier. Nice job at sticking through all the rejection!",
            "Some mortgage companies will cut their employees a slice if they steer business to them. Any friends or relatives thinking to  buy or refi??",
            "congrats!!!! Focus on gaining experience mate!!",
            "!!!",
            "Congratulations! Does this company sponsor visas? If yes, then can you please share the company's name?",
            "Dang man. McDonalds pays more than that around me. Hey at least u get good experience tho",
            "Lets gooooo!",
            "Congrats!",
            "Congrats!",
            "congrats bro I'm still applying not sure if I'll even find one at this point",
            "Congratulations!",
            "You did it. Be proud of what you accomplished, look forward to what's coming next! Just remember that it doesn't end here - its only the beginning.",
            "So happy for you ❣️",
            "Congratulations!",
            "Congrats! You did a really good job",
            "Nice work!",
            "Legend",
            "Congratulations!!!",
            "In the middle of faamg flex culture , thNks for saying this",
            "Congrats OP!!!",
            "Good shit dude",
            "Congrats!! All your hard work paid off!",
            "Major W! Congrats and take some time to celebrate!",
            "That's awesome man the expereince is way more valuable than the pay",
            "Awesome work OP",
            "Proud of you my G!"
        ]
    },
    {
        "post_id": "o68e02",
        "author": "Humor_Fantastic",
        "title": "Sober Post: Things I've learned as an industry engineer",
        "url": "https://www.reddit.com/r/csMajors/comments/o68e02/sober_post_things_ive_learned_as_an_industry/",
        "score": 519,
        "num_comments": 67,
        "created_utc": 1624435532.0,
        "selftext": "Inspired by [Drunk Post: Things I've learned as a Sr Engineer : ExperiencedDevs (reddit.com)](https://www.reddit.com/r/ExperiencedDevs/comments/nmodyl/drunk_post_things_ive_learned_as_a_sr_engineer/)\n\nThought I would jot down everything I've learned through college and over the last \\~2 years in the industry.\n\nBackground: Top 20 CS program, high school/college internships were a mix of gov't, FAANG, Big N, defense contractors\n\nFull time work: FAANG + Unicorn\n\n&#x200B;\n\n* Getting started:\n   * The best time to start is now. some people start in high school, some in college, some when they're 60. Don't compare yourself to others with different backgrounds, just compare yourself to your past self. As long as you're improving and better than yesterday, that's what matters\n   * Imposter syndrome is normal - use it to your advantage. thinking your entire team is smart should motivate you to get to that level, not keep you from learning. everyone starts somewhere and soon you'll have people looking up to you too\n   * don't do CS for the money unless you have an extremely strong will. this field will burn you out if you do it for money unless you're somehow able to separate the outcome and your day-to-day. i would recommend against it\n   * laptop recommendations get asked a lot. I would personally say get a mac product (used or new) made in the last \\~1-3 years for simplicity. things will work out of the box and you have unix support from day 1. If you're more adventurous, get a pc and load linux, or get a VM or build a hackintosh. these approaches require a lot of work. Swappa is a good place to find used deals\n   * Programming languages don't really matter too much - I would recommend python or java to get started with\n   * College is what you make of it - you can go to a low-tier school and do great if you push yourself. You can go to MIT and be a bum. it is easier to do well if you go to a high tier school and push yourself though\n   * CS is a learning experience even past college. you'll be learning new technologies, frameworks and having to brush up interview skills continuously. make sure you enjoy learning new things\n   * bootcamps vs college is an interesting debate. bootcamps teach the high-level knowledge without in-depth fundamentals. that you have to learn on your own. don't expect just a bootcamp to set you up for success against college grads. you have to put in more work than the minimum. [Would you choose a coding bootcamp or a computer science related degree? Why? - Quora](https://www.quora.com/Would-you-choose-a-coding-bootcamp-or-a-computer-science-related-degree-Why) The top answer here is a solid one. Generally, bootcamp grads are extremely rare in FAANG because they want fundamental knowledge. bootcamp grads do very well at small local tech companies that might want something basic without having to worry about scale\n* Once you're in college\n   * Try new things. go to hackathons, try new clubs, make friends. You learn from those around you and this is an easy way to surround yourself with smart people\n   * go to class. as someone that skipped a lot of classes, it's not worth it. you'll spend the same amount of time if not more trying to learn things yourself. the only potential exception is if the classes are recorded and you have enough discipline to watch them\n   * GPA matters and it doesn't matter. It matters for government, trading firms, traditional companies (although they'll stop caring once you hit a few years of experience). Normal tech companies don't really care ASSUMING you can show your value in other ways. Having a low GPA and no projects is a bad combo\n   * Personal projects are just another way to showcase your skills. it can be substituted with a contribution to open source, part-time work, etc.  It's better to have them than not\n   * Core classes to take in college IMO are network security, databases, algorithms, linear algebra, up to calc 2, an advanced data structures class, compilers, OS. you don't need to take the highest level classes but knowing these are good.\n   * Have a social life - growing as a software engineer requires soft skills. you can be the smartest person in the room but won't grow unless you're also easy to learn with\n   * Be humble and eager to learn. try not to be in an environment where you're the smartest person in the room. Goes back to point 1 where you should get comfortable being uncomfortable and learning\n   * Careers fairs are good but do your research. some companies just tell you to apply online, others will give you an interview on the spot. Go first to the ones that will give you an interview and go to the other ones last\n   * Hackathons and clubs are a good place to find jobs too\n   * [http://angel.co/](http://angel.co/) is a good place to get started on the startup hunt\n   * your professors and TA's are there to help you - ask them for help\n* Internships/new grad jobs\n   * getting the first internship is the biggest hurdle. after that it kind of compounds\n   * there's a correlation between the number of applications submitted and job offers. success = attempts x success rate. even if your success rate says the same, applying to twice as many places is good\n   * failing interviews is normal. its not a reflection of you as a person or your skillset but your demonstration of that skillset given at the time and situation. learn from it and move on\n   * Algorithms and data structures is the core of CS. Do leetcode and get started on these things as soon as possible\n   * FAANG has specific programs (FBU, Google engineering practicum, Microsoft explorer) geared towards underrepresented minorities and freshman/sophomores. apply to them\n   * [GitHub - j-delaney/easy-application: Over 400 software engineering companies that are easy to apply to](https://github.com/j-delaney/easy-application) and [Intern Supply](https://intern.supply/) are good places to start\n   * Optimize your internships for learning and growth. Learning means trying new things, pushing boundaries etc. Growth means jumping around from company to company. Use a defense contractor to go to Big N and then to FAANG.\n   * Learning standard tools like git, docker, etc can make you more effective at internships\n   * being young is the best time to take risks. if you want to do a startup over a large company, go for it but do your research. don't turn down google for a company that does IoT socks.\n   * information is power. especially when it comes to negotiating. sites like [https://www.teamblind.com/](https://www.teamblind.com/), reddit, and [https://www.levels.fyi/](https://www.levels.fyi/) are crucial to make sure you're compensated fairly\n   * practice coding on paper/whiteboards. most interviews expect this and will probably be the norm once covid ends\n* Industry experience/new grad tips\n   * Optimize your first job for (in order) learning, manager, interest in work, compensation. How much they matter should be up to you. ex - don't turn down a 100k job for a 50k job that has a slightly better learning opportunity. but a 90k vs 95k job, optimize on things other than compensation\n   * FAANG is overrated and underrated at the same time.  There are plenty of smart people but also plenty of slackers. That being said, the pay and benefits is fantastic. But there are always different and potentially better opportunities. Finance for higher pay and worst wlb, unicorns for higher pay but with more uncertainty, gov't for wlb and low stress. The one thing about FAANG is, there are very few other places in the world where you can work on things at such a large scale\n   * silicon valley is a good place to be when you're young, not so much when you're older (unless you're doing really well). living in a house with 3 roommates paying 1500/month is fine in your 20's but paying 2 million for a small house in your 30's with kids is not optimal\n   * not all jobs are in silicon valley/est coast but a lot of them are. new york and DC are also top contenders now\n   * learn personal finance. ESPECIALLY if you already have internships. Invest as early as you can so you set yourself up for a financially successful life\n   * invest in a good setup if you can - ergonomic chair, keyboard, a mouse so you don't have to deal with issues later on\n   * dual monitor/ultrawide screens are great for productivity\n   * noise-canceling headphones are essential for office work\n* General life tips\n   * your health is your wealth. eat well, sleep, exercise. money, success, intelligence means nothing if you die early\n   * be kind to people - you never know when you'll run into them again\n   * take risks when you're young, it'll be harder (not impossible) once you hit 30ish\n   * generally have a balanced life. an extreme of anything tends to be bad\n   * have a good group of friends - they mean a lot once you get out of college. as time goes on, the opportunities to make new friends come by less often - people go out less often and you don't get the same interaction levels you get in college with clubs and classes. once you're late 20's/early 30's you've pretty much made your core friend group and it becomes harder to break into new friend groups (not impossible though)\n   * spend time with family - by now you've spent 90% of the time you will with them so make the last 10% really count\n   * money and other things in life are only a part of it. i know people worth tens of millions that barely spend time with family, i know people making a very average income that are happier than people making 300k. everyone has their own issues\n\nI can't really think of anything else at the moment. If you disagree with anything i've said, feel free to ignore or just post a comment so others can see your point of view. i'll respond to comments/dm's when I can.\n\n&#x200B;\n\nedit: thank you for the awards :)\n\n&#x200B;\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/o68e02/sober_post_things_ive_learned_as_an_industry/",
        "comments": [
            "Good post! Resonates with a lot I’ve learned as well working in industry.",
            "It’s still fuck pandas out here in these streets",
            "Thanks for the post! What is your opinion on pursuing a master's in CompSci? Are there any significant benefits to doing one?",
            "> living in a house with 3 roommates paying 1500/month is fine in your 20's \n\nWait?! This is in Silicon Valley? I live in LA and its the equivalent. I feel like Im getting scammed here ):<",
            "I have no friends...",
            "Spot on, also learned some things as well. Can’t agree more on work life balance. The worst thing I ever did was stopped hanging out with friends and doing hobbies to focus on self-development/learning. It’s so crucial to have time away to avoid burnout.\n\nThank you!",
            "I didn't see anything about *not* stealing corporate secrets and selling them. So I think that means we are in the clear 👌",
            "Besides those websites, are there any other ways I can know if my salary is right? Or how do I negotiate if I feel my salary is low?",
            "Wow not just career advice but life advice too. Thank you.",
            "You forgot to mention LeetCode OP",
            "Why can’t I take risks when I’m 30? Why can’t I make friends after 30? Especially if I’m financially independent",
            "Can I pm you with a few questions?",
            "> take risks when you’re young, you won’t be able to once you hit 30ish\n\nAny reason why this is, except for family obligations if you have house/wife/kids?",
            "- Learning standard tools like git, docker, etc can make you more effective at internships\n\nWhat are the other standard tools besides those?",
            "My gripe would be if you were to only learn one language then learn c++. If you know c++ then you can learn anything. And I mean advanced c++. Not just basic ability to do leetcode with it",
            "THIS POST IS AMAZING!! thank you so much for all this great advice!",
            "Amazing post! Thank you!",
            "This should be pinned",
            "Love this",
            "[deleted]",
            "How do you know if you’re in it just for the money?",
            "Do you have any advice for someone who didn’t major in CS but is potentially interested in going back to school for it? Would I be better off getting a second bachelors or straight up getting a masters?",
            "any tips on where to start for learning about personal finance?",
            ">invest in a good setup if you can - ergonomic chair, keyboard, a mouse so you don't have to deal with issues later on\n\nIf I'm travelling a bunch in my 20s (i.e. from Silicon Valley to Canada), how do I move my ergonomic chair + monitors + PC + standing desk? I want to build a setup but this feels like a huge barrier",
            "People say don’t do it for the money. But if one does get burned out as an engineer, isn’t there a variety of jobs to work your way into using your cs degree and engineer experience?"
        ]
    }
]