[
    {
        "post_id": "w3nafh",
        "author": "techgirl8",
        "title": "Internships MATTER",
        "url": "https://www.reddit.com/r/csMajors/comments/w3nafh/internships_matter/",
        "score": 525,
        "num_comments": 80,
        "created_utc": 1658326165.0,
        "selftext": "Message to all CS college students/new grads. Hi everyone just wanted to pop on here and say before I received this current summer internship I'm doing I could not get any interviews. The only reason I got this current internship is because my professor recommended me. Networking is also extremely important. Connect with your professors or anyone in the field online, LinkedIn especially. Build your LinkedIn, make sure you have a good headline so you pop up for recruiters. Make sure I looks good. Add connections to people in similar fields. I have personally reached out to hiring managers on LinkedIn and have gotten interviews that way. I didn't do internships all through college until this year. I quit my job to do it because I knew it was important to have this experience before I graduated. I just can't believe how much attention I'm getting now. It really makes a difference! My internship ends in 2 weeks so I'm looking for another job and looks like I might have choices if I pass these interviews! Time to start grinding leetcode lol.\n\nEdit: I am 31 and a female so your never too old and I'm one of the minorities. I live in a rural area where there are no tech jobs. This is a remote internship. Don't take unpaid internships, ever. Build projects and put them on github I have 40 repos so far. I have lots of bills to pay since I'm older. So it was a huge risk for me to take this internship. I had money I saved so I could do this internship. I think it was worth the risk because I wasn't getting any interviews before and now I have a ton. Even though I'm out of a job in two weeks, I am confident I will land another job, I work very hard learning everyday. Practice every single day and you will get better. Also make sure your resume is formatted nicely and up to par.",
        "permalink": "/r/csMajors/comments/w3nafh/internships_matter/",
        "comments": [
            "The problem is: how do I get people to connect with me on LinkedIn who I don’t even know? \n\nI have around 30 connections on LinkedIn (most of them are people I know irl), but I’m not really sure how to connect with popular programmers who I don’t know. \n\nI see people on LinkedIn with 500+ connections and I have no idea how they do it.",
            "I’m interning at a small-medium size financial company this summer as a developer, about halfway through my internship i got contacted by a recruiter at capitalOne to apply for their full time junior role through LinkedIn, my current internship being the highlighted talking point during the connection. Not only do more recruiters reach out but you could also land a full time position at your internship which is what i’m hoping for in my case, love the company and the work.\n\nMoral of story: DO INTERNSHIPS and don’t stop applying, it’s easy to let yourself get down after some rejections, i easily applied to 50-100 internships and got 2 offers through my junior year, i applied to maybe 20-30 sophomore year and got no offers.",
            "[deleted]",
            "How did you (or anyone else) go by getting your first internship? What projects/classes did you have?",
            "As someone who was not successful in getting an internship before graduating and still haven't landed any tech job offers over four years later, can corroborate.",
            "This is an excellent advice that I don’t see a lot of people realize. Talk to your profs. Make really good connection with them. Students just don’t understand that profs, especially at R1 schools have way more connections than an average person on LinkedIn. Most of them can get their PhD and MS students jobs and internships at big companies with little effort. They will do the same for UG students that they like. During my UG, my prof got me an internship at Twitter because his friend from grad school worked there. The first internship is always tough, and you should use all the resources you can get to land one.",
            "Yep, and I urge anyone who is a senior, or even a junior, to make finding an internship your top priority before graduation. It will make your life 1000x easier post-grad. Quit your current part time job to study and interview if you have to.",
            "[deleted]",
            "So I have a question: I currently have a full-time job that's paying for my college and not at all related to CS. I also have a fiancé and live basically in the middle of nowhere. What would be a good alternative to internships? Because they aren't an option for me, unfortunately. Would working on projects on my own to build a portfolio be a good second option?",
            "Just an anecdote from my time in college.\n\nApplying for internships/co-ops with no experience: idk how many applications, 8 interviews, 1 offer (paid, but not that great)\n\nApplying for full time positions with 3 semesters of co-op experience: one application, 4 interviews (4 different hiring managers at the same large firm), 3 offers from a F500 (plus a return offer at the company I co-oped with).",
            "Ty for this breaking news",
            "Or taking on full/part time positions like QA during college. Not everyone is in a socioeconomic position to take on internships. Working in the field is a great alternative.",
            "This is amazing to hear! It's always cool to see everyone's development here on social media and to see what kind of paths they take and why it was like that. You definitely deserved what you have now. Don't think about the past just think about how fast things are happening for you now that you took a big leap into an internship that is now allowing you to be seen as a potential candidate. Congrats, keep up the good work. And remember... \"Never commit suicide, everything gonna see alright\" -Crip Mac 2022",
            "Get that guanxi, homie.",
            "Seriously they MATTER. I got an internship at a well known US fintech after loads of rejections and ghosting, only one month in and I have a Shopify recruiter in my LinkedIn DMs linking me an internship that wasn't even posted on any job boards.",
            "Does anyone know if me following through to an IT process development internship this summer will substantially help me getting future positions or offers? \n\nI’m not sure how much this can benefit an SWE application for example",
            "Grind LeetCode",
            "Are all these internships paid or unpaid?",
            "what do you do if you can't get any? 💀",
            "Networking > internships though",
            "I agree with what you said about networking. That's the only reason I got my internship for this summer lol.",
            "Fellas I’m a rising Junior who has yet to get an internship, if I get one during the next summer am I gonna be good for when I apply for jobs when I graduate?\n\nBasically am I fucked if I only have 1 internship under my belt?",
            "Rising senior who is doing his first internship this summer, I am wondering if I should delay my graduation to get another Internship at a much more prestigious company. Should I delay my graduation for another internship or should I just tough it out and apply for new grad roles with internship experience at a startup? If I do go with the latter, then I will do a lot of side projects to make up for the deficit of having only one internship."
        ]
    },
    {
        "post_id": "v7cte6",
        "author": "hashirama8",
        "title": "just got my first internship!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/v7cte6/just_got_my_first_internship/",
        "score": 518,
        "num_comments": 71,
        "created_utc": 1654649862.0,
        "selftext": "sorry, i’m just really excited and wanna share it :D i just got my first internship and i’m super stoked!!",
        "permalink": "/r/csMajors/comments/v7cte6/just_got_my_first_internship/",
        "comments": [
            "Congratulations! I'm glad you're feeling excited about it; that's the right attitude to approach this opportunity with.\n\nFrom what I've heard from industry professionals and older college peers, the first internship is not only a **major milestone in your career** but also a **stepping stone towards other career goals** (full-time jobs, entry to FAANG and HFT, etc.). Well done!",
            "congrats!!!!",
            "Congrats!",
            "Congrats",
            "Always happy for a fellow Naruto fan u/hashirama8",
            "Congrats 🎉🎉 I got mine in the beginning of year but it was a 2 month internship. Now I'm looking for another. I'll be grinding lc harder than ever.",
            "Huge congratulations! Hope to share in some of your amazing luck! 🎉😊🙏💪🍀",
            "[deleted]",
            "Have fun it’s always nice to learn new stuff while getting paid instead of paying to learn lol",
            "Congrats!!!!!!🍾🎈🎉🎊",
            "Congratulations!",
            "Congrats!!!",
            "Congrats!",
            "where?",
            "Congrats, who if you don’t mind.",
            "Congrats! Where at?",
            "Congrats!!!",
            "Congratulations!!",
            "Congrats! I also got my first internship as well!",
            "Congratulations!",
            "Gotta stop madara first",
            "Congratulations!!!",
            "Congrats!",
            "Ayyyyyy let’s goooo congrats 🎉🎊🍾",
            "Getting internship>>>>>>>top in sem exam",
            "Gg",
            "Huge congratulations and wish you all the best! You’ll have a great time for sure :)",
            "I really want to know this feeling 😩. Can you tell me if you did any special projects or your grades . How did you get one",
            "No need to be sorry, first internship is always an exciting experience :) congrats!",
            "is this internship for fall? Or sunmer",
            "congrats; so happy for you!!!",
            "Are you freshman?",
            "congrats!!!",
            "[deleted]",
            "Congrats!! I’m so happy for you!",
            "Amazing when do you start"
        ]
    },
    {
        "post_id": "qzsj5w",
        "author": "eggjacket",
        "title": "PSA: Complain to your recruiter if you have a bad interviewer",
        "url": "https://www.reddit.com/r/csMajors/comments/qzsj5w/psa_complain_to_your_recruiter_if_you_have_a_bad/",
        "score": 520,
        "num_comments": 35,
        "created_utc": 1637606819.0,
        "selftext": "Hi everyone. I just wanted to post a note about this because I see quite a few people posting about negative interviewing experiences they had, where the interviewer was a complete dick to them. And I don't think people realize that that's something they should be reporting back to the recruiter, if they feel comfortable. \n\nWhen I was a senior a few years ago, I had a *horrible* interviewing experience. The guy showed up 15 minutes late and did not extend the interview by 15 minutes (and it was only a 30 minute interview!). When he gave me my coding question, he told me to pick any language I wanted, didn't like the one I picked, and then berated me for a few minutes about how I'd picked a stupid language and I should know better. Then whenever I tried to ask questions about the coding problem, he'd roll his eyes and tell me I should be able to figure that out. \n\nIn short...it was horrible. I complained about the experience to my brother, who's a tech lead at a FAANG, and he immediately suggest I tell my recruiter what happened. I was hesitant, but he assured me that recruiters *want* to know things like this. Their job is to match qualified candidates to open positions. If an interviewer is turning people off the job by being an asshole, then recruitment *needs* to know so they can fix that problem. And unless you write some scathing email absolutely blasting the company and the interviewer, the recruiter won't react negatively and you certainly won't be blacklisted. \n\nSo I reached out to the recruiter. I made sure to avoid attacking or blaming anyone, didn't get emotional, and made sure to just describe the impact that the interviewer had. This was the email I sent:\n\n>Hi \\[recruiter name\\],  \n>  \n>I just wanted to touch base about my interview with \\[interviewer's name\\] on \\[interview date\\]. I was a bit uncomfortable throughout the interview. \\[Interviewer's name\\] was 15 minutes late and did not extend our interviewing time, so I feel I was rushed and not given enough time to demonstrate what a good candidate I am. In addition, \\[interviewer's name\\] seemed very frustrated with the language I chose to do the technical portion of the interview in, and spent some time lecturing me about how I should have picked a different one. He seemed very annoyed with me throughout the entire interview, and it threw me off my game, and I don't feel I was really given a good environment to demonstrate my skills in.   \n>  \n>I don't know what the interviewing procedure is typically like at \\[company\\], but I was just a little disappointed because I really like \\[company\\] and felt it could have been a really good fit under different circumstances.   \n>  \n>Thank you,   \n>  \n>\\[my name\\]\n\nThe recruiter actually reached out to apologize and said they'd be speaking with that interviewer, and I was offered a second chance at the interview. At that point, I'd already accepted a different offer and declined to move forward. But I really appreciated knowing that there *is* recourse if you get an unfairly poor interviewer.",
        "permalink": "/r/csMajors/comments/qzsj5w/psa_complain_to_your_recruiter_if_you_have_a_bad/",
        "comments": [
            "Highly agree with OP. Recruiters are getting paid to do this, and as OP said remember not to blast the company (because HR protects company and management over even the complaints from existing employees)",
            "Hmm, what language did you choose? Just wondering since interviewers should be language agnostic",
            "I keep getting interviews where I can only code my solutions in Java or JavaScript. I practice all my ds/algo questions in python though. I don’t know why it really matters, I can code them in JavaScript if I had more time, but they are hard enough to practice with one language. Doesn’t mean I don’t know JavaScript 😒",
            "This is also true if your interviewer refuses to grant you disability accommodations that your recruiter promised you, or if they make fun of your disability. I’ve had to do it for Google a few times.",
            "I had an interviewer that had her camera off pretty much the entire time. It kinda threw me off, but do you think that is even a reason to reach out to a recruiter about? My interview was last week so not sure if that would be late?",
            ">he told me to pick any language I wanted, didn't like the one I picked, and then berated me for a few minutes about how I'd picked a stupid language \n\nwhat the hell",
            "Im gonna play devil's advocate a bit here. My only concern is that a lot of interviews are not recorded (for example, i had a bad fb interview and they were not recorded but i didnt complain about it, still got the offer tho cuz they gave me a follow up interview due to contradicting rating and comments from 2 interviewers). So it is going to be your words against theirs. And why should a company trust you more than their current employee? I am always super hesitant when things like this happen cuz i feel like things can go either way.",
            "I hope this doesn’t convince people don’t readily complain if they get a question that’s difficult or just don’t vibe",
            "A couple of things to consider\n\n1. You might ruffle some feathers this way. The odds that you will get a second chance to interview are quite low. A good analogy is - When you interview with a company, companies won't give you feedback because the upside for them is almost 0. \n2. Always consider your goal. Ask yourself the simple question - Does sending an email to my recruiter help me achieve my goal of achieving an internship/FT offer?\n\nThis is simply speculation, and I could be wrong, so correct me if I am, but I think your brother is brainwashed by the snowflake culture they have these silicon valley tech companies. On top of that, you mention \"then recruitment needs to know so they can fix that problem\", but my question is - \"How exactly does this benefit you?\"",
            "another issue, some questions can only be answered by recruiter, go ask them than this sub",
            "Totally agree I had an experience where the interviewer looked completely not interested and shared screen with the code that I need to debug zoom out that I can't even read it.\n\nThe person completely ignored me when I ask to zoom in so I can see the code. It was the worst interview so far I had."
        ]
    },
    {
        "post_id": "pu9tyk",
        "author": "Bluehiperspace8",
        "title": "Kenny Talks Code List of LeetCode Problems",
        "url": "https://www.reddit.com/r/csMajors/comments/pu9tyk/kenny_talks_code_list_of_leetcode_problems/",
        "score": 520,
        "num_comments": 38,
        "created_utc": 1632448402.0,
        "selftext": "Edit: Check out u/Maezzzz comment down below for some of the side problems Kenny recommended\n\nHey guys!\n\nSo as all of you know by now, Kenny decided to shut down his YouTube channel. It's a shame because he had super useful content for all of us looking to prepare for interviews and even on how to do well on an internship.\n\nHis best content, \"LeetCode Problems That Got me Hired\", was a series of videos where he talked about specific interview topics (ex: DFS, Trees, Graphs) and provided some problems that illustrated the patterns to solving most questions of said topic. These were very awesome videos and now they're gone :(.\n\nAnyways, some weeks ago I discovered these videos and I actually recorded the problems he recommended on a Google Spreadsheet. I have the list of all the main problems he suggested we do. Here they are:\n\n1.- DFS:\n\n* [Letter Combinations of a Phone Number](https://leetcode.com/problems/letter-combinations-of-a-phone-number)\n* [Number of Islands](https://leetcode.com/problems/number-of-islands)\n* [N-Queens](https://leetcode.com/problems/n-queens)\n\n2.- Dynamic Programming 1:\n\n* [Climbing Stairs](https://leetcode.com/problems/climbing-stairs)\n* [Coin Change](https://leetcode.com/problems/coin-change)\n* [Longest Increasing Subsequence](https://leetcode.com/problems/longest-increasing-subsequence)\n* [Word Break](https://leetcode.com/problems/word-break)\n\n3.- Graphs:\n\n* [Number of Connected Components in an Undirected Graph (LeetCode Premium)](https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph)\n* [Course Schedule](https://leetcode.com/problems/course-schedule)\n* [Possible Bipartition](https://leetcode.com/problems/possible-bipartition)\n* [Minimum Height Trees](https://leetcode.com/problems/minimum-height-trees)\n\n4.- Sliding Windows:\n\n* [Minimum Size Subarray Sum](https://leetcode.com/problems/minimum-size-subarray-sum)\n* [Longest Substring Without Repeating Characters](https://leetcode.com/problems/longest-substring-without-repeating-characters/)\n* [Find All Anagrams in a String](https://leetcode.com/problems/find-all-anagrams-in-a-string)\n\n5.- Dynamic Programming 2:\n\n* [Longest Common Subsequence](https://leetcode.com/problems/longest-common-subsequence)\n* [Regular Expression Matching](https://leetcode.com/problems/regular-expression-matching)\n* [Longest Palindromic Substring](https://leetcode.com/problems/longest-palindromic-substring)\n\n6.- Linked Lists:\n\n* [Remove Nth Node From End Of List](https://leetcode.com/problems/remove-nth-node-from-end-of-list)\n* [Swap Nodes in Pairs](https://leetcode.com/problems/swap-nodes-in-pairs)\n* [Partition List](https://leetcode.com/problems/partition-list)\n* [Linked List Cycle II](https://leetcode.com/problems/linked-list-cycle-ii)\n\n7.- Dynamic Programming 3:\n\n* [Best Time to Buy and Sell Stock with Transaction Fee](https://leetcode.com/problems/best-time-to-buy-and-sell-stock-with-transaction-fee)\n* 0-1 Knapsack (not on LeetCode, apparently [this one](https://leetcode.com/problems/partition-equal-subset-sum/) is similar)\n* [House Robber III](https://leetcode.com/problems/house-robber-iii)\n\n8, 9.- Trees 1 & 2:\n\n* [Path Sum II](https://leetcode.com/problems/path-sum-ii)\n* [Binary Tree Longest Consecutive Sequence (LeetCode Premium)](https://leetcode.com/problems/binary-tree-longest-consecutive-sequence)\n* [Binary Tree Maximum Path Sum](https://leetcode.com/problems/binary-tree-maximum-path-sum)\n* [Binary Tree Level Order Traversal](https://leetcode.com/problems/binary-tree-level-order-traversal)\n* [Populating Next Right Pointers in Each Node](https://leetcode.com/problems/populating-next-right-pointers-in-each-node)\n* [Construct Binary Tree from Preorder and Inorder Traversal](https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal)\n\n10.- Heaps:\n\n* [Top K Frequent Elements](https://leetcode.com/problems/top-k-frequent-elements)\n* [Merge K Sorted Lists](https://leetcode.com/problems/merge-k-sorted-lists)\n* [Find Median from Data Stream](https://leetcode.com/problems/find-median-from-data-stream)\n\nThat is all! These are the main problems he recommended. At the end of his videos he recommended other problems but he didn't cover them in the videos. This list has all the ones he covered. If anyone has the extra problems he recommended, post them in the chat please!\n\nHopefully this is useful for everyone :)",
        "permalink": "/r/csMajors/comments/pu9tyk/kenny_talks_code_list_of_leetcode_problems/",
        "comments": [
            "Thank you for sharing This list. I was halfway through the series, should have finished it all when I had the time.\n\nIt is unfortunate he took down his video but I hope he is doing well wherever he is.",
            "[deleted]",
            "Thank you. Insta-saved",
            "As requested here are a few more problems that Kenny recommended through his \"LeetCode Problems That Got me Hired\" series:  \n\n\n1.- DFS:\n\n* [Generate Parenthesis](https://leetcode.com/problems/generate-parentheses/)\n* [Permutations](https://leetcode.com/problems/permutations/)\n* [Combination Sum](https://leetcode.com/problems/combination-sum/solution/)\n* [Subsets](https://leetcode.com/problems/subsets/)\n* [Number of Enclaves](https://leetcode.com/problems/number-of-enclaves/)\n* [Surrounded Regions](https://leetcode.com/problems/surrounded-regions/)\n* [Word Search](https://leetcode.com/problems/word-search/)\n* [Smallest Rectangles Enclosing Black Pixels](https://leetcode.com/problems/smallest-rectangle-enclosing-black-pixels/) (Premium)\n* [Valid Sudoku](https://leetcode.com/problems/valid-sudoku/)  \n\n\nAwesome post OP great resource!",
            "nooooo I wish I could finish that series",
            "Thank you so much for thissss, you're awesomee!\n\nI had just recently started watching his series and I was so disheartened to see his channel get shut down",
            "[deleted]",
            "I had just started watching his videos after your comment.  I was wondering why his channel was not loading.\n\nThank you for the problem list. Hope he makes those videos available again",
            "His approach to leetcode tutorials was the best by far. Recognizing the patterns, then contrasting use cases for different applications of the concepts, and splitting up the boilerplate from the tricky parts of each pattern.\n\nI am so sad it's all gone away.",
            "[deleted]",
            "Just when I decided to start watching this series, I get this news! This is really disappointing!",
            "goat!",
            "The hero we didnt deserve",
            "Thank you so much maaaaan thats gold really sad that he had to shut it down",
            "Awesome resource! Had I known his channel was gone I would have shared the google slide of all the problems he had (there's a few more than on here but this is a very adequate list)",
            "Im not familiar with this guys content specifically, but out of curiosity, what did he do differently from other people that made his videos so good/useful vs other content that's already out there?",
            "Thanks, man! Saved",
            "THANK YOU!!!! Damn, Kenny's channel was a gem.",
            "Does anyone remember the setup of the Graph questions that kenny usually does for Adjacency List?"
        ]
    },
    {
        "post_id": "13gy4hs",
        "author": "None",
        "title": "man i just wanna code for fun",
        "url": "https://www.reddit.com/r/csMajors/comments/13gy4hs/man_i_just_wanna_code_for_fun/",
        "score": 515,
        "num_comments": 66,
        "created_utc": 1684025907.0,
        "selftext": "Freshman here. I joined this sub so I could learn more about computer science in general. Not see posts about the job market and sending applications and crying over being the perfect applicant. I don't wanna learn how to come up with a solution in minutes. I want to spend time with my code. I want to think about it, experiment, get things wrong, and keep doing that. I love researching into algorithms and reading about them just for fun, even though I don't understand stuff most of the time. \n\nIt's sad to see how many people here started studying computer science because they found computers and writing code interesting and fascinating and now getting a good job or internships has sucked all the passion out of them.",
        "permalink": "/r/csMajors/comments/13gy4hs/man_i_just_wanna_code_for_fun/",
        "comments": [
            "RemindMe! 180 days",
            "For real, this has just become another r/cscareerquestions but for internships instead of full time. For those of us who have gotten internships or full time jobs, how many of us can say that we are still reading interesting research papers or building projects that we think are cool instead of being buzzword friendly? The discord bot that I'm working on is the most fun I've had coding in ages, even though it doesn't really hit any of the valuable skills employers look for.",
            "I totally understand.\n\nHowever People are free to choose what they want to pursue. Really there is nothing wrong about it \n\nCode for fun vs code for money.",
            "You're looking for r/programming. This sub is for CS majors and let's be honest most of us really care more about jobs than actually learning about tech.",
            "Totally feel you man,freshman as well in Computer Science, and this sub has depressed me so much, my passion are maths so that's why I choose computer science (in my country of birth the math program is twice as hard than the US) ,but I feel so rushed for everything, studying for my classes, learning to code by myself,get better to do internship,learn how to leetcode, is overwhelming, if I didn't like to code I probably would try to pursue another career, the people that try to inspire you by sharing their success history doesn't help as well because then I feel more pression to succeed. I hope things get better ,but between the economy getting worse for everybody, and the huge supply of computer scientist is believe in it.",
            "There is a perception bias where the people feeling strong emotions tend to be the ones who rant, so you're seeing mostly people who hate their life and not much from people who don't. Yes the real world sucks, but the trick to not hating your life is to find a good employer and stick with them. There are many ways to have a healthy work-life balance that won't make you hate coding. \n\nI have gone through periods of hating coding and loving it. Actually, most of the time I hated it was in college, because the courses were so overwhelming and stressful. The job I have now is interesting enough that I can scratch the intellectual itch, but I also feel I have enough energy to pursue open source in my free time. Open source gives me the creative freedom, and control, over my projects so I can do them without deadlines and managers breathing down my neck.",
            "You’re not wrong, but the having a community to commiserate with can easily trend towards a place that’s mostly venting and frustration. \n\nAs a teacher, r/teachers is a place I never go and have unsubbed. It’s just a faucet tap of misery and has nothing to do with most of my life. It doesn’t help that I’m such a weird niche over there as a special education teacher who teaches CS to adults with disabilities that have deferred a degree. I don’t have many fellow unicorns over there.",
            "This is a CSMajors subreddit, there are many programming subreddits for what you’re describing\n\nI do like software and coding, but I’m paying for a degree and I want to get a return off that investment when I graduate, so I’ve been focused on jobs and internships",
            "Working does seem to suck the life out of most lol.  \n\nI have all these side project ideas but it’s hard to find the energy for them when I’m wasting my peak energy on something else.",
            "Passion vs. income is not a binary choice. \n\nYou can do both - I have done that for many years.   Just learn to compartmentalize the crap from work and find fun time for coding, which is separate.  \n\nMy work will never use Rust; my work will always find some way to screw up CI-CD or proper UI, etc.  But I have fun with them on my own time.   I do Advent of Code and other \"Leet\" coding things on my own schedule.  Screw work.",
            "Consider code wars or join a “hacking” team to play capture the flags.",
            "Wanna have fun, create an algorithm that prints itself.",
            "none of us want to be the perfect applicant either. we want money to pay the bills",
            "Money > fun. You can have fun playing pool or snowboarding but working 40 hours per week will cause you to resent it.",
            "this sub is literally just a dick swinging contest. look elsewhere.",
            "Then do it and stop making condescending posts on this sub.",
            "welcome to the neolib hellscape we live on",
            "This was me 1st year, now it’s just shit",
            "Man I just wanna be a doctor for fun. I love studying the human body. I can’t believe all the doctors spend time with applications and crying about being the perfect applicant. I can’t pay my rent now because I have no job, but you guys are losers",
            "Any high paying field is going to attract those cringey mfs that frequented r/applyingtocollege and r/chanceme",
            "I think a lot of it depends on what industry you go into. Pure tech industry doesn't exactly have good work-life balance, and often doesn't give you good challenges when you're a junior developer.\n\nI am a programmer in the clinical trial industry, and I love it. Our team is super small (5 people!), so our projects are small, and you can technically see a project through from beginning to end. Even when I worked for a huge company, we still worked in small teams. I solve problems all day, every day, and I only get burned out if I push *myself* too hard. I've yet to get in trouble for pushing back deadlines if they are unrealistic and require me to work more than 40 hours a week. I do feel incredibly lucky to love what I do and get paid for it.\n\nYou will be able to find the place that allows you to do what you love the most, and get paid for your passion. You're just going to have to keep an open mind about what industry you can take your skills into. It'll probably be something you haven't even thought of yet.",
            "me too man, programming is like water for me :)",
            "Same sometimes I wonder if I got a job I might not be able to spend this much time trying and learning and experimenting by myself. \n\nI might have to just follow instructions and I wish I could have this life where I don't have to worry about making money and can learn things for fun and interest solely.",
            "Consider getting a job at a research lab.",
            "Coding for a living - for Me was soul crushing. I much preferred product management for software. Gave me a feeling of accomplishment that is just lost in coding alone in the business world. I still program for fun and actually have a few apps I sell.  But that’s a passion work. Not a day job. That’s how I found my balance; and I’m. It alone. Worked at companies with marketing people that all had cs degrees and felt like robots as programmers and moved into product marketed and loved it. \n\nJust my story. Different strokes for different folks.",
            "Honestly,  that will probably make you a top applicant in the end. Passion and curiosity go a long ways to actually learning your trade and becoming good.",
            "You do you buddy, DS and Algorithms has honestly become a good way to seperate the hay from the stalk because of the competition but you should always find the kind of role you like and compete for jobs among that role, smaller net cast but the job that you do find will be way more tolerable. \n\nEx: Don't just learn python because data science is hot, app development is still going strong and my company is still hiring for those roles if you're competent enough.",
            "\"I just wanna code for fun\".\n\nThe reality that flies in the face of this is not some recent phenomenon tied to layoffs or people struggling to find jobs. Its not even specific to software development.\n\nIts just how the world works. \n\nPlaying music in the garage with your homies is not the same thing as having a contract with a record company where you are expected to deliver results (an album, etc).\n\nCoding that fun little app in your free time is not the same thing as being paid to deliver value to a business that, for the sake of survival, has to focus on its bottom line.\n\nNothing on the professional level (even if you own your own business) is the same as it is on the hobby level. Clients are everything, if you can't deliver someone else will. This is the also the case between the employee-employer dynamic (in this case, your employer is basically your client).\n\nYour post seems more geared towards the \"getting the job\" part. Let me tell you, once you do its not going to change. It is, in every way, a job. You will work with tech stacks, projects, teams, managers, that you do not enjoy at all. \n\nI understand your sentiment with this post, but I just feel like maybe you haven't considered the reality of becoming a professional in a professional setting, and all the things that come with it.",
            "Fresh man \n\n&#x200B;\n\nlmbo\n\nRemindMe! 1 year",
            " RemindMe! 365 days"
        ]
    },
    {
        "post_id": "17cvh9b",
        "author": "None",
        "title": "I got a sick internship",
        "url": "https://www.reddit.com/r/csMajors/comments/17cvh9b/i_got_a_sick_internship/",
        "score": 514,
        "num_comments": 43,
        "created_utc": 1697866781.0,
        "selftext": "I'm not particularly smart. My gpa is around 3.3. People literally scoff at me when I tell them my previous summer internship(local tech firm pretty big but known to be willing to take anyone in and has a bad rep in all areas). \n\nI recently just got an internship offer at a pretty good firm(not big tech) that's paying about 5-8 times what a regular cs internship would pay and about twice the median SWE salary in my country.\n\nHow I did it? No clue. Got lucky I guess.",
        "permalink": "/r/csMajors/comments/17cvh9b/i_got_a_sick_internship/",
        "comments": [
            "Heck yeah dude (refer me)",
            "What is “regular internship” pay because depending on your perception that’s anywhere between $15/hr to $40/hr. Based on $15 being min wage in many areas that makes me think you’re making $120 an hour just from your x8 estimate.",
            "Which country? That’s the key 🔑",
            "the people scoffing at you part is hilarious. so much entitlement is getting kicked in the ass atm with this job market.  not the worst thing.\n\ncongrats to the internship. sure, some are just lucky, but luck can be created by hard work",
            "just drop the name pussy",
            "Willing to drop the company name? 👀",
            "This guy is probably like a human being who can socialize well",
            "Sounds like India and your first company being Infosys sorts and second being HFT sorts",
            "whats the local companys name lol i can try joining there :(",
            "Quant?",
            "let's goooo",
            "Sounds like Optiver",
            "How did you prepare for it?",
            "What was the interview like?",
            "Nice! Have fun!\n\nHopefully, it is not some sort of Blockchain-Crypto bullshit company …",
            "Where is it? I want in.",
            "Mad props on use of the verb “**scoff**.”",
            "Awww congrats, plz share some luck with us 🥹 \nWhat year are you in?",
            "Click here to learn how you can do this too for a small investment of 15k.",
            "Can i know how your interview went?"
        ]
    },
    {
        "post_id": "mhosym",
        "author": "random_throws_stuff",
        "title": "anyone else feel like they don't actually know how to code anything?",
        "url": "https://www.reddit.com/r/csMajors/comments/mhosym/anyone_else_feel_like_they_dont_actually_know_how/",
        "score": 520,
        "num_comments": 68,
        "created_utc": 1617256527.0,
        "selftext": "I go to a top-5 CS school, and I feel like I'm a pretty solid student. I've done well on exams/projects/interviews and I did pretty well with recruiting, but I have no experience actually building anything. I started coding only a few months before college.\n\nI've done one internship before, but it wasn't a competitive place at all, and the pace and expectations were both super low. How much do \"competitive\" places (FAANG, unicorns, quant shops) expect interns/new grads to know? Has anyone else been in this situation before? How was your transition? I have my first internship this summer at a top-tier place and I'm kinda nervous about how I'll perform.",
        "permalink": "/r/csMajors/comments/mhosym/anyone_else_feel_like_they_dont_actually_know_how/",
        "comments": [
            "The biggest misconception is that Comp. Sci. Is programming. Most colleges main focus is theory and conceptual ideas where programming is actually writing/building something. Just make it a point to build some projects in your free time.",
            "Don't worry, that's normal. Lots of us feel that way. I know I'm objectively one of the better ones at my university and I still feel incompetent and unable to code sometimes. Just gotta practice.",
            "You’ll be totally fine. I joined fang from mid tier(I think) state school. Most of your job is seeing if someone else has done something similar to what your asked/want to accomplish and then copying that, modifying it to your needs. This could be from the existing codebase(always better since you can learn good coding habits from this) or from tutorials or from stack overflow. \n\nI find that the most challenging part of my job is the direction and communication/ syncing with XFN partners and eng from other teams. And also coming up with ideas to improve existing processes within the company/org. I find coding to be a secondary thing that I just do and don’t stress about at all. If you get stuck you’ll figure it out since we went to school for this and prepped for interviews.\n\nRelax and enjoy your time! Find a good mentor or role model and learn from what they do. You got this! Dm if you have any more questions :)",
            "in my final year and feel the same since I have not gone too indepth into any language or framework. Starting to forget most things in my first 2 years of university,",
            "Totally normal dude. Other than knowing that you'll be fine, you can also relieve that by actually starting a side project on your own (when you have time)! Did that over last winter break, and it was honestly the first time I felt like I could actually build something. If you have a small idea that you *think* could be solvable by software, go ahead and try to build it!",
            "I feel exactly the same way as a senior.",
            "You know I often feel this way when I'm not in the middle of a project or otherwise. However, once I begin a project, I start to feel like, I'm not sure if it's my memory coming back to me or if I know subconsciously, but I feel as if I know what I'm doing. The minute the project is over, however, I again feel like I have no idea what happened or what I'm doing lol.",
            "As someone who “did” know how to code in college and had lots of experience “building” things, I can tell you with confidence that coding experience doesn’t matter that much in CS. It is something you can learn easily by reading API docs.",
            "Nah you're fine.\n\nBeing passionate about coding is something not everyone who is a cs major has. Some people just want to get hired and move up the corporate ladder and that's completely fine.",
            "How did you come out of a full time internship and still feel like you “don’t know how to code anything”?",
            "To OP and All contributors in this post: \n\nThis is some good ‘Reality’ shared by everyone in the CS field. \n\nEveryone thinks that CS is just about money. But there goes a lot of other ‘human-aspect’ which is constantly struggling to survive the ever-changing competitive CS world. \n\nPlease don’t delete this post. This is a good experiential share for young budding CS students and new grads. \n\nThanks! \n\nGood Luck All!🍀",
            "i’m currently in an internship at fang and even I feel this way. Part of the degree is learning *how* to code something you’ve never coded before. That means knowing *how* to find a solution to a problem. Think: knowing what resource to look to when you get stuck (e.g., Stack Overflow). \n\nMost of software engineering is doing something that’s never been done before, and it’s okay to feel the way you do now once you realize this.",
            "Competitive place or not, they’ll expect you to be able to fix bugs and add features. Majority of the time you’ll be working on an existing project, not be asked to build something from scratch.\n\nThe hardest part is becoming familiar with existing code.\n\nAnd also sounds like a terrible CS program if you come out unable to create anything on your own. In my first intro to programming class, we had to build a “government” program for adding and removing employees, and looking up records from a text file.\n\nBy my 2nd to last year, we were writing assembly programs from scratch for homework. And I didn’t even go to a top school.\n\nAnyway to answer your question, personally I didn’t feel like that since I’ve been creating projects for homework throughout my entire degree. I’m not saying I’m a pro - but I retain information. I was even creating iOS apps on the side.",
            "i feel u. I also go to top-3 CS school, interning at Faang, but i still rlly don't know what im coding sometimes :3",
            "I learned very quickly when applying that most everything was frontend, which school did not teach us at all... This is the norm. Basically what I told future employers was I have a strong base in Java/C OOP and functional programming but would be 'investment' to hire because they would need to teach me new languages (C#, JavaScript, JQuery, etc) and new frameworks (MVS, [asp.net](https://asp.net), react, Node.js). This is the case for almost everyone with a BS in CS. \n\nBasically it's like \"hey I can write for-loops and if-statements n stuff, you teach me the rest ok?\".",
            "Thats a good feeling to feel, you shouldn't feel complete in this field that develops further every seconds\n\nWhat really matters how you direct this feeling, if you lose confidence and get into your own shell because of it then its a bit bad, but if you use it as an excuse to break and learn stuff then its good\n\nI heard a saying, \"if you are the smartest people in the room you should change rooms\" or something like that",
            "I’m with you, graduating senior and even had a great internship over the summer but just feel like I’ve been BSing my way through it",
            "I am pretty much in the same position as you. Currently a new grad about to start full time at a FAANG firm where I interned last summer. I think the most important quality you can have during an internship is the ability to learn independently without requiring much hand holding. Given that you’re a solid student, you shouldn’t have any problems with this. All the best!",
            "Dude! We go to the same school LOL I was like IS THIS MEEEEE can’t offer any advice but lemme tell you I feel the same ALL THE TIME for what it’s worth",
            "Honestly I after 3 years of classes feel like I can code anything with enough time and energy",
            "Same, I don't know what to do either.",
            "What kind of school is l that? You didnt do projects or whatever else? And its a top 5 school? Lol",
            "As I've gone the self-taught + bootcamp route and am leaning towards looking to get in to traditional school to get a CS major because years in to this I still feel like I don't know how to code anything, yes. I can bash my head against a desk and figure things out, albeit much slower than my peers, which is frustrating. I've also been job hunting since November with no luck, and the ones that give me a shot remind me I know absolutely nothing because I fail at coding tests. What is life.",
            "You are intern you do not necessarily need to know everything just do your best. If it works according to how you wanted great , if it does not it is always a good learning experience.",
            "All the time. I have seen a vast improvement though when looking at myself 6 months ago.",
            "You move past it after working for a few years.",
            "Computer Science is a program that combines a lot of departments. There will be 3 types of people who enter Comp. Sci, Hacker, Mathematician, and Physicists. Hackers will suffer a lot during these 4 years. Haha.",
            "I would like to thank Google for helping me get through my programming course 🥲🥲🥲",
            "How did you do well on your projects but you have no experience building anything?\n\nThe solution to all these problems, where you act mystified that you can't program well, is to practice more."
        ]
    },
    {
        "post_id": "1cdnzdm",
        "author": "SilentSchwanzlurche",
        "title": "Internships do not count as Years of Experience (personally asked an HR)",
        "url": "https://www.reddit.com/r/csMajors/comments/1cdnzdm/internships_do_not_count_as_years_of_experience/",
        "score": 515,
        "num_comments": 114,
        "created_utc": 1714144513.0,
        "selftext": "Got to the final rounds of an entry level interview position (full time) and didn't get an offer as I didn't fulfill the years of experience compared to another candidate (emphasize on ENTRY LEVEL). Followed up and asked if my internships (2+ years) counted as YoE, and the HR said 'It's a grey area, but generally no, only full time (Permanent/Contract) counts as YoE'.\n\nPerfect, back to square one.",
        "permalink": "/r/csMajors/comments/1cdnzdm/internships_do_not_count_as_years_of_experience/",
        "comments": [
            "That absolutely sucks, sorry to hear it. I’ve also noticed that in the past - generally HR doesn’t count internships as experience (but if you don’t have one they still won’t hire you). Cheeks all around.",
            "That's weird. I do see both sides of the arguments like from their side, they'll think that in your internship you may have not done much or stuff just because youre an intern and you don't have the same expectations as a ft employee.\n\nBut then like from our side the only way to build experience is through internships like I'm not gonna do ft work and ft school and ft requires a degree anyway so like\n\nI think it just depends on hr and their company policy",
            "then how tf am i going to get a decent job 😭",
            "Thank you ser.",
            "I honestly hate this. \nIt counts as experience for your first job. Why not after that? Do people unlearn internship experience at a full time job?",
            "Define “full time” in this context. A full time job?",
            "connect uppity scandalous drab cautious dolls sheet correct birds reminiscent\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I think there's a lot of variance in internships. Some interns are given the same work as full-time engs on the team, other times they are given grunt work unrelated to dev work",
            "Seems dumb because that's the entire point of internships.",
            "If you have 2 years of internship experience, and you say you have 2 YOE, and a company passes you up because you're \"lying about your experience\", that's a shit company that you shouldn't work for anyway.\n\nTo be real with you, a lot of companies give their interns busy work. That shit happens in \"real jobs\" too though (as well as other fields), and it's never the fault of an employee / intern.\n\nI hope you maintain your confidence. That HR person doesn't know a damn thing about how to get hired as a dev. The disconnect between hiring managers / recruiters and job applicants is massive. Don't listen to them for \"advice\", only for \"insights\".",
            "Makes sense.\n\nYou manage or lead an intern in a lot different way then you'd manage a junior engineer. For an intern, you usually find one, relatively self-contained project for them to work on, and keep them away from the critical systems or other tasks that take a long time to onboard. In my experience, interns have much lower expectations, and right when they figure things out, they are about to leave, so the time invested in them is a lot lower.\n\nThat's not to say your internships weren't valuable experience, and YMMV may very, but it's simple enough for companies to not count anything that isn't W2 experience when they have people with that also applying.\n\nAnyway, just keep applying. Your internships are a positive signal, you're getting all the way through interviews, and it's likely you'll land something soon if you keep your foot on the gas.",
            "Lol anything counts as YoE in my book. Doing unofficial research with a professor? YoE. Building a random webapp and putting it on Github? YoE. Building a local company's website? YoE. Game the system my friend, these companies expect like 5 YoE for entry level roles.",
            "Was this two full years of being an intern or only part of the year?",
            "So to get the first full time position you already have to have years of full time experience and internships don't count they say, hmm. So where do they think we have to get yoe before our first full time role if even internships don't count? What do we do internships for?",
            "My first job was a 'two years experience required' job. Ever since then I figured that any listing of experience on the job listing should be thought of as +/- 3 years. \n\nPretty wild that they actually made a decision based on that tbh",
            "That's sad. Companies can decide themselfs what counts.",
            "Well I did a 2 year software apprenticeship instead of college so what's that worth!?!?!? Shit all?",
            "lmao what a joke what do these people think internships are for",
            "I have worked for more than 25 years in a CS related job. Take it from me, no one cares. They only care about your experience and how you can help them out. So focus on getting skills and this YoE will work itself out.\n\nMy son just got a CS internship. I told him to look at the actual job/skill, not pay.",
            "I wonder if this is how Canadian students' experience is also viewed.\nBecause at our universities, internships can range from 4, 8,12 and 16 months\n\n\nI wonder if the 12 and 16 month ones will be counted as experience? \n\nIf so, should everyone gun for those? \n\n(I personally prefer 4 month ones)",
            "That is some bullshit imo. Programming internship is worth a hell of a lot more than someone who spent the last 6 years doing fuck all or working in history or art.",
            "As someone who’s been working in CS for 10+ years, it always astounds (and angers) me how many entry level positions I have seen asking for years of experience. I have seen easily tens of job postings for an “entry level” position *requiring* (not recommending) 3-5 years experience. And this sort of crap seems to be getting more and more prevalent as the years go by. It’s ridiculous.",
            "HR does what HR does.",
            "Im not sure about csmajors, but in healthcare, our clinical experience and training hours don’t count as years if exp. Also mainly because jf it did, then the argument for pay steps based on yrs of exp gets very confusing/abused by entry level workers.",
            "I mean most internships are for a season, it would be disingenuous to count 2 seasons of work as 2 years.",
            "Good news is you don’t want to work for a company that has a needs “x years” to qualify",
            "The end of the semester is here I'm too exhausted for going back to square one. At this point I just wanna take another 3 months off, and retry back in Fall when everything opens up again and this time I'm full on lying about everything because companies just have arbitrary ass standards.",
            "As a hiring manager, it's true, unless you interned for our company.  But your internship is a heavy tiebreaker.",
            "I lied on my resume and say their FTE, fuck em",
            "So we seek internships to gain experience, but companies don’t count it as experience but you need internships to show you have experience?What kind of mind fuck as tech become?",
            "I don't think it's that internships don't \"count\" as years of experience.  But if I'm comparing an employee with a degree and 1ye as a junior with another that is the same but 1ye as an intern, the former is more attractive all other things being equal.  Most companies don't stick hard and fast with ye items listed in job postings.  They take the best candidate who applies to the posting",
            "That's bullshit and just another excuse to exploit other",
            "Interesting, the recruiters I have spoken to so far in my job search have counted it. Although I have 1.5 years of full time permanent experience in addition, so that might make a difference to them",
            "There is a great influx of people wanting to enter the software industry. In the past it would have counted now there are many people like you(sadly). Did you last the lice coding though or never reached that point ?\n\nAlso multiple internships and not a real job offer is kinda red flag to them as why Noone wanted to extent?",
            "I personally don’t get it, I was working 40 hrs/week for 8 months at a company, clearing tickets like everyone else, attended quarter reviews like everyone else, was performing like everyone else. Why can’t this experience be counter in my YoE?",
            "I mean… sure it counts as years of experience. But you need 5 10-week internships to count as 1 year. Are you trying to count  one summer as a year?",
            "Why even do an internship then at this point… kinda crazy",
            "Interesting my HR considers internships as experience",
            "THEN HOW THE HELL ARE YOU SUPPOSE TO GET THE JOB. Bunch of nonesense >.>",
            "Babe wake up, new level of hell has arrived. \n\nSo you’re telling me the best course of action is to just lie and say that an internship is of full-time job and then if you need a reference, just find some friend to be your reference lmfao",
            "https://i.redd.it/kgnanbr6j2xc1.gif",
            "Yeah they don't but if you get a cool one it definitely helps. Interned at a company and the company I work for now, one of the cofounders was an early employee where I interned. Definitely helped me feel welcome on the team",
            "I thought this was common knowledge?\n\nPlus, internships are 2-3 months long. It takes 2 or 3 internships to even equal half a year of FTE.",
            "HR doesn't know anything. I would remove the internship part from your resume and apply elsewhere.",
            "Really? I slammed my internships on my resume for my job and they asked about it when I interviewed. \n\n🤔 IG It also could have help I had a working website with projects and an active GitHub at the time.\n\nIMO projects and repos are king anyways. A much better indicator of skill and interests.",
            "I did two summer internships and then joined full time the same company. They got me a security clearance on my first internship, so i remained in the system as an “employee” (they actually paid me one hour a week to keep it kosher in the books i suppose). I still came in as an “associate” (entry level), but it ended up speeding the process for me to get a second promotion, the manager was using my internship as years of experience to try to help me get the promotion to keep me at the company.\n\nSo it’s a grey area that you can benefit from when you have some leverage.",
            "HR is dumb, I've seen internships that were more rigorous and rewarding than some degenerate employees slacking off and coasting on a full time 9-5 swe job",
            "The internships are not useless, you probably wouldn’t have even got the interview without them. Unfortunately a candidate with some existing non intern experience applied and was good enough for the job. It’s not the company being shitty, they just had one position to fill, and unfortunately someone else had more experience. Keep at it and you will find someone who prefers you over someone else.",
            "seriously, but who counts internships as YOE? sure I can just rack up 4 internships in each summer prior to graduation and have \"2 YOE\" by just working on small side projects or fixing documents.",
            "Interns aren't being stack-ranked, doing on-call duty or facing angry customers.",
            "You're supposed to be going through campus recruiting for your first job out of college.\nThe problem with you, and the rest of people applying for thousands of jobs, is that you're competing with the recently laid off software engineering workforce. You have software engineers with years of experience applying for roles below their experience level. You might have lost the job to someone who was already working full time for one or two years, but that recently lost their job.\n\nIn a normal job market, that engineer wouldn't do a lateral move to another entry level role.",
            "It all depends on the kind of experience you actually acquired from your internship. So for example, during your 2 years of internship if you learned skills X, Y, and Z then they will most likely count it. Its all up to the interviewer and whether they see that experience valuable enough for the role or not.",
            "Yep, internships are mostly a waste of time. To ask for experience for an entry level position makes it not entry level though, so that job posting is nonsense. Or the job market is so bad that they are getting people with experience downgrading to entry level positions."
        ]
    },
    {
        "post_id": "t04rfd",
        "author": "NaturalMaybe",
        "title": "I'm Ukrainian and have an internship interview tomorrow, I'm scared beyond belief. What do I do?",
        "url": "https://www.reddit.com/r/csMajors/comments/t04rfd/im_ukrainian_and_have_an_internship_interview/",
        "score": 517,
        "num_comments": 27,
        "created_utc": 1645686766.0,
        "selftext": "I could really use some interview support now, I'm literally shaking. Thank God I'm in US, but my family is still in Ukraine. I'm scared for them, and the tomorrow interview (first ever for an internship) is not helping at all. I assume asking the recruiter for an extension would be rude given such short notice, so I just have to go with it. Besides, the email wouldn't be seen in time. I don't know what to do, I just want to wake up from this nightmare",
        "permalink": "/r/csMajors/comments/t04rfd/im_ukrainian_and_have_an_internship_interview/",
        "comments": [
            "Hey, I’m really sorry about what’s happening in your country. I hope you and your family are safe. This obviously is something difficult, and I would hope most recruiters would be understanding. Personally I think you have a justifiable reason for rescheduling but if you choose not to, you might want to let the interviewer know the extenuating circumstances you’re under. What you choose to do and how much you feel comfortable disclosing to your interviewer is completely up to you. \n\nBest of luck on your interview! And I hope you, your family and your country stay safe!",
            "[deleted]",
            "[deleted]",
            "My username might be a poor one for right now, but I would say send the email. Explain to them that you will still try to attend the interview, but you may be a bit distracted and will try your best (shows resilience/strength). Also keep your phone by you and if you get any notice for anything, tell them its your family, and hang up instantly on them.\n\nFor the last three hours I have been pouring over every news outlet and social media for eyes and ears on everything going on. I even watched Rossiya 24 to see what the Russians are saying (spoiler: its a load of crap).\n\nNo employer in the US for anything CS-related will see anything you tell them as rude right now. Like... Your home and your people just had war declared - invaded, actually. You can extend, you can interview,  you can even tell them nothing, and write to them after-the-fact. They can not deny what you're going through... if they do, then that's not a company you want to work for anyways.\n\nKstati, ti gde zhivesh? V prinsipe bez raznitsi. Yesli hochesh, napishi mne. Ya takzhe v SShA zhivu i ne znayu skol'ko znakomih komputershikov u tebya est' skem bi ti hotel pogovorit po etoj teme.",
            "I had an interview with a top tech firm a few days ago and just before the interview the power suddenly cut off due to a power line malfunction. Literally 3-4 minutes before the interview. The interviewer called me by phone since that's how it works for that company and asked if the scheduled time was still a good time, to which I said I could take the interview but my connection would be slow because I was using my mobile hotspot. He let me reschedule without a problem since the conditions weren't right. The interviewers want to find good candidates, it's not in their interest to lose a potentially good candidate due to uncontrollable circumstances. Obviously this depends on the company too, and it's your call to make, but in general it shouldn't be a problem. On the other hand, you are international, and do need internships so this could be a missed chance if the company happens to fill their roles out. See what their policy says and make a decision, but don't worry too much about it. There are much more pressing issues that rightfully deserve your attention right now. Slava Ukraini!",
            "Ask for an extension. Everyone will understand, and from the interviewer's point of view, it's a waste of time to interview you when you can't focus on the questions.\n\nMay God be with your family.",
            "I asked Google to move my interview the same day I had it because something came up, they did it",
            "It would not be rude to ask for an extension but I think you can do it! I believe in you! We support you!",
            "You can for sure ask it to be rescheduled. Recruiters are humans too and if you tell them you are not in a good place emotionally because you are worried about your family and don't want to jeopardize the interview they will for sure understand.\nI'm sorry this is happening.",
            "Are you technically ready?  If so, go ahead don't postpone. It's an opportunity to show who you are.  If you're not ready, then it's different.",
            "Honestly... I don't think there's nothing you can do about Ukraine. \n\nTake some tea, talk with your family if possible, and take that interview tomorrow. If you re-schedule, they will most likely understand as its really extreme conditions.",
            "Let the interviewer know whats going on and that you plan on doing your best anyway. I wish you luck, friend.",
            "if you dont think you are doing well, you just scream \"my family is in trouble, I must go\" and leave",
            "I am sooo sorry this is happening to you. i think it is really important to take the interview but also let the interviewer know whats happening and that if a call comes up you must take it. They will be incredibly understanding",
            "Please stay safe, and know our prayers are with you. It's not much, but it's not  nothing. Please stay safe, and god bless you.",
            "Not religious but ill put my hands together for you 🙏🙏 this community has your back. If there are some experienced devs seeing this comment, go ahead & offer OP a recommendation.",
            "Hey friend. I'm really sorry about what you're going through. As for the recruiter thing, fuck the short notice, the war didn't give you a notice so they'd better be okay with you coming back to the interview when you're not worried about how your family is doing.",
            "I think emailing and asking for an extension given your circumstances is VERY reasonable.",
            "My thoughts and prayers are with you and all of Ukraine.",
            "It depends u know? If u can focus and code, then maybe just let the interviewer know at the beginning of the interview that that's why u might come off as extra nervous, and reassure them that ur ready. If u can't focus, then I would reschedule",
            "Listen, just explain your situation. If the recruiter doesn’t respond and you have the interview, TELL THE INTERVIEWER. I’m quite sure they’ll understand, and they should, most likely the interviewer will reschedule it to another day but they will definitely not interview you. \n\nPlease don’t tell yourself that you can’t let go off this opportunity / don’t want to be rude / etc etc all the thoughts, everyone is with you and your family right now and will understand the scenario. \n\nSend that email, if not seen in time, raise it up in the interview. \n\nWe’re all humans after all, empathy and sympathy are what we’ve survived all these years by. \n\nGood luck and take care."
        ]
    },
    {
        "post_id": "1cgbz1h",
        "author": "orkidesever",
        "title": "Software Development job postings decline down 51%",
        "url": "https://i.redd.it/rn22ltnsrhxc1.jpeg",
        "score": 516,
        "num_comments": 87,
        "created_utc": 1714428381.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1cgbz1h/software_development_job_postings_decline_down_51/",
        "comments": [
            "Welcome to Costco, I love you.",
            "It is not going to correct the next 5-10 years. The CS universities enrollment is 4-5  times more than just a few years ago. In a four years we will have the largest in history number of cs graduates and no jobs for them. So we have not seen the worst of it yet, far from it.",
            "But I am bad in other fields, what can I do?",
            "Yup....It might be over. Lets go home folks. Time to get another degree in nursing or something.",
            "This is a representation of the 0% interest rates of covid era going away, followed by high interest rates to counter inflation\n\nOver the 12 month period this graphic shows, the Fed Funds Rate went from about 1% to 6%, it is no surprise that a growth industry contracted under those circumstances \n\nCS will be fine and so will most of those industries",
            "I had a brother in law who trained to be a commercial airline pilot.  After he graduated he could not get work and ended up being a courier.  A few years later demand was waaaay up and he has been a commercial airline pilot for years now.",
            "At this point, what even is a good degree",
            "But Reddit told me I was overreacting and that it would correct in under 3 years!!\n\nWell look at that. Don’t forget that the amount of new grads in CS continues to increase every year, so the competition will be as fierce as ever! \n\nIt’ll continue to get a lot worse from here",
            "What are some fields or jobs where a Computer Science degree can help to get?",
            "Now show how many more CS grads there are. 5x the grads, half the roles.",
            "https://www.hiringlab.org/2023/11/15/indeeds-2024-us-jobs-hiring-trends-report/",
            "Just saw a similar post claiming it’s -44% …",
            "Some of the people that we’ve hired in the past 4 years are among the worst skilled I have ever worked with.",
            "Makes sense. Seeing these numbers alone is scary. Seeing them with the knowledge of wfh, covid, hiring frenzy, and then the fact that everything went back to in person again makes it less scary. Outlier period.",
            "While certainly an outlier and representative of changes in the tech industry, I’d bet that part of it from an overall decline in jobs as a whole just looking at the numbers for the other sectors.",
            "This is just the market correcting from overhiring. We are fine.",
            "I am looking for developers as co-founder or freelancers for a couple of projects. Feel free to DM",
            "Grind 51% harder then",
            "Time to oversaturate nursing",
            "Hb2 will still be maxed out . I wonder how long till were like Canada.",
            "Welp its time to learn lock repair and plumbing",
            "Guys don’t worry. UPS is always hiring.",
            "Is it a decline, or isn't it just because now job titles are different lol",
            "Lmao, I’m one of the few CS majors that aren’t going into SWE. I’m trying to do IT —> Networking or Security. I have a feeling that higher level cyber jobs will always be in demand so I’ll work for that. Backup for that will be Mathematics (it’s on that list) or Electrical Engineering",
            "lol",
            "why are you posting old data?"
        ]
    }
]