[
    {
        "post_id": "nt89wt",
        "author": "uwu_google_throwaway",
        "title": "Google new grad offer < 3.0GPA",
        "url": "https://www.reddit.com/r/csMajors/comments/nt89wt/google_new_grad_offer_30gpa/",
        "score": 515,
        "num_comments": 138,
        "created_utc": 1622935674.0,
        "selftext": "Seeing the recent posts about Google offers, I wanted to contribute my own story since I believe mine is probably more incredible than most.\n\nJust got a Google new grad offer without interning there previously. I've only done one previous internship at a fortune 500 company and one part time dev job at a local company. I go to a T100 state school with a 2.5 GPA with multiple withdraws on my transcript. Yup, you read that right.\n\nI am not an avid leetcoder at all either. I've only solved a total of 33 problems.\n\nAsk me questions about the application/interviewing process. Getting an interview requires some bit of luck, and I think I was able to use my available resources to full advantage. Would love to help others in my position & I hope my story inspires others.",
        "permalink": "/r/csMajors/comments/nt89wt/google_new_grad_offer_30gpa/",
        "comments": [
            "How did you get the interview in the first place? And how did you land that first internship? \n\nWhat do you think made you stand out from the sea of applications?",
            "Man call me salty but I hate how luck dependent it is. I solved 160 LC questions and during my interview I got 2 LC hard questions 1 related to implementing the A* algorithm and another combining binary search with hashsets. \n\nI had a really shitty interview experience where my interviewers didn't say a word until the last 5 minutes only to tell me my approach is wrong.\n\nOn the other end my friend got all LC mediums almost similar to what is on leetcode google section. And his was more of a pair programming.\n\nFML",
            "[deleted]",
            "Were you asked mediums and hards at google? Your point about 33 leetcode makes me scared tbh. When I interviewed for a swe intern position both my phone screens had leetcode hards. Idk if I’d ever be able to even get halfway there if I solved 33 leetcode questions.",
            "Am I the only one who thinks this persons BSing? All the answers are terrible lol",
            "[deleted]",
            "What are your personal projects like?",
            "What is your ethnicity? I'm taking one for the team by asking this. Feel free to not answer.",
            "seriously what a fucking chad owo, good luck on the new role!",
            "Did you do get an optimal solution for every question or did you have any bad rounds?\n\nDid you feel confident after your onsite?",
            "Congrats dude/dudette, at what age/year did you start coding?",
            "So basically no proof + whenever someone in the comments asks about your personnal projects you stay vague.\nWhy did you decide to be a troll today?",
            "Would you consider yourself incredibly lucky?",
            "Is this for dec grad or May?",
            "How long was the wait between your on-site and your offer? Also how do you feel you did in the interview? Did you ace all the technical round? Or were they a little forgiving if you fell short for 1 or 2 of them?",
            "Did you have any projects that wowed them? Dumb question but curious?",
            "and I was having an argument with a guy who started his own cs club(!!!) that GPA matters.\n\nGetting a job ain't grad school or medical school, a low GPA will not hold you back but a high one can give you like 5% more interviews(?) maybe? but ultimately depends on your work ethic and your willingness to get out there and connect and grind. \n\n Congrats!",
            "At the end you mention using your available resources to fill advantage. What resources were those?",
            "An SDE position?",
            "So you’re a legend.",
            "This is actually depressing lol. Getting an OA seems like complete rng.",
            "Damn is it really that hard to get an interview at Google/FANG without referrals or a top school? I thought that bigger companies were more likely to look at your resume compared to smaller ones.",
            "Did they ask for your transcript?",
            "Did you team match before or after hiring committee approval?",
            "I don't know whether to believe this or not, sounds unbelievable at first, also owing to your throwaway account. But major congrats to you if this is actually true! :)",
            "how did you not loose hope after not having fang internships?",
            "[deleted]",
            "I sent you a message.",
            "Did you do any projects that stood out or any opens source contributions?",
            "Can you please share your resume (redacted ofc) its gonna help a lot",
            "Damn man got a rejected after getting a perfect on the OA. Like, they asked for my transcript again and then got a rejection soon after. No interview. They are still hiring, so it definitely not that. I finished with like 25 mins remaining, like was speed a factor 😪\n\nAnyways dude congrats on the offer, and I would live to know what u did to stand out. Like, in terms of projects/open source or research.",
            "can you share your resume please?",
            "But what about being able to yeetcode?",
            "I just finished my 2nd year\n\nWhat should I do next",
            "Offer details?",
            "I have 4.0 gpa from Georgia tech and I only received an online assessment that's it.",
            "Do you have anything interesting or “fun”/creative in your application? Such as a skillset/knowledge of things like animation, or photo editing, videography, music production, etc? Something that might’ve made you stand out beyond just your school performance?",
            "LET’S GOOOO"
        ]
    },
    {
        "post_id": "1awm39h",
        "author": "bando-lifestyle",
        "title": "It’s over 😔",
        "url": "https://www.reddit.com/r/csMajors/comments/1awm39h/its_over/",
        "score": 514,
        "num_comments": 157,
        "created_utc": 1708546472.0,
        "selftext": "It’s over. ",
        "permalink": "/r/csMajors/comments/1awm39h/its_over/",
        "comments": [
            "Imagine how much time I would’ve saved if I applied to 0 internships instead of 500… I would still be in the same position I am now lol",
            "It’s not over\n\nIT NEVER BEGAN!",
            "Real (I’m a fucking freshman and I’m cooked)",
            "😔",
            "Nah i still got a year and a half till I graduate.\n\nIt's not over yet (unfortunately).",
            "It never began for us 😔",
            "&#x200B;\n\nhttps://preview.redd.it/7ehdv00m41kc1.png?width=1080&format=png&auto=webp&s=a9c2cef74948e8c8db9d9cc8631ae7f9bcee1ffc",
            "Man in already working full time retail while I finish up my cs degree. It’s been joever for me but since I’m already in hell it will only get better and I don’t care if it takes me another year I’ll get a programming job and pull myself out of poverty.",
            "joever",
            "?",
            "![gif](giphy|ht4yvN9Yx4dmIJJ9GB|downsized)",
            "Never began for you.\n\nSwitch to nursing or trades",
            "Zoom the fuck out.",
            "0 context ok",
            "Propaganda to strengthen the already indisputably incredible and forgiving SWE job market",
            "What's over bro?",
            "Blame TikTok and recruiters with their “A Day in the Life of a _____ “ videos.",
            "Getting your first internship in tech checklist:\n\n\\- Did you previously intern at a FAANG company?\n\n\\- Are your GPA 3.8+?\n\n\\- Is your school in top 25 CS program?\n\n\\- Can you implement Union-Find data structure in C off the top of your head?\n\n\\- Are you *really* CS major? (not CompE, ME, EE, IT, IS, etc.)\n\n\\- Do you have a cool project to talk about? (preferably a start-up to a school project)\n\n\\- Can you talk about a time when you have conflicts with your manager?",
            "Its 3pm, its not over yet",
            "That's under 😔",
            "There is so many high paying jobs. Computer science is not the only one. Don’t feel like it’s over, it’s only over when you give up.\n\nFor anyone that could still double major definitely do it!!!!\n\nFor those that don’t have time to double major, with a  computer science degree you could still apply to finance jobs, HR, marketing, and business jobs like Project management, etc. … also data analytics, and information technology. \n\nSome jobs want you to have a degree but it does not matter in what. \n\nThese are all great and high paying careers.",
            "Real",
            "**Bye Bye** 🤫🧏‍♂️",
            "Should I do CS anymore or no",
            "Honestly, seeing the state of this subreddit for the past few months gives me the only reason to feel good about being in a third world country where there's not enough good CS grads so market is not saturated if you you're good at what you're doing. I am in junior year and I have a part-time SWE job at a startup and the founder or the guy who hired me worked at Google for 10 years so he knows what he's doing.\n\nI didn't even have to fill a 100+ applications like most of ya'll because my professor was his friend and he was asked to scout for people so I just got recommended.\n\nI am surprised it's that bad in the western world. I am so much surprised that I sometimes think this sub doesn't represent the true situation and it's just fear mongering.",
            "We need CS degrees to add fucking filter courses. Make discrete math incomprehensibly difficult 🗣️🗣️🗣️",
            "Real",
            "Billions must apply",
            "It’s beaver 🦫🦫🦫 no one gives a dam",
            "Wait you guys started?",
            "IT’S NOT OVER UNTIL YOU WIN. 🗣️🗣️",
            "[https://www.youtube.com/watch?v=3zWau4rs1s4](https://www.youtube.com/watch?v=3zWau4rs1s4)",
            "In a good way or bad way?",
            "Good bye bro.",
            "It’s joeverrrr",
            "What is over?",
            "Everyone else could quit so it starts again",
            "im never getting my diploma im so cooked",
            "Join any field but tech you’ll be good 🤡",
            "Always remember problem is not you",
            "God used the break statement☹️",
            "No, it's Joever.",
            "We're all burnt out and hopeless, what do we do now ? 💔😭",
            "Solutions..",
            "Shrek: It's all ogre (I think)",
            "why is it over",
            "It’s never over. I got into this industry right after the first tech bubble. There’s lots of jobs still today. You just need to be willing to take something smaller than you had hoped, then job swap after a year or so. \n\nIn the first 5 years of my career (with no degree) I doubled my salary 3 times by changing jobs and being willing to move. Eventually making 15x my first year salary.",
            "Tough times never last. Strong people always do!\n\nDon't give up OP. I'm not in the best spot either but we'll make it if we stick with it",
            "Master Chief called. He said stop crying so loud and pick yourself back up. FIGHT BACK MF!",
            "start your own project, work part-time or as contractor to gain experience.",
            "It's over for you 🤫",
            "Idk what to do honestly, I’m going on 2 YOE and I’m just now graduating with my CS degree 😭. I have a SWE job but I want more pay. \n\nI’d try to switch careers but honestly it feels like the world is ending so it wouldn’t be worth the work.",
            "I'm slow but what is this referring to?",
            "I’m a senior, as a career change, and I’m practically depressed everyday feeling like it was all a mistake… at least all my student loans were forgiven haha",
            "Whats over?"
        ]
    },
    {
        "post_id": "1ajag3m",
        "author": "Ok-Conversation8588",
        "title": "Interview at FAANG company from the founder himself ",
        "url": "https://v.redd.it/gq8k05iwspgc1",
        "score": 519,
        "num_comments": 19,
        "created_utc": 1707116234.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ajag3m/interview_at_faang_company_from_the_founder/",
        "comments": [
            "I failed at the edging test😔",
            "Look what Covid has done to our youth….",
            "We all did stupid stuff with tech when it came out.\n\nKids these days, *shakes head*",
            "Wtf🗿",
            "https://preview.redd.it/rsxazvi7qtgc1.jpeg?width=800&format=pjpg&auto=webp&s=c68d7fa17dd9ec79398c047f1a2ba53bae997028",
            "AI is insane",
            "I thought this was a wsb post, well done.",
            "If I stop 1-2 times  during the edging test, will the grade I am interviewing for be lowered?",
            "Facebook, Amazon, Apple, Netflix, Google. Where's MS?",
            "If I ever interview at faang, I'd ask this lol",
            "I watched this muted cuz im at work rn... funny asf lol",
            "Can’t believe he said this",
            "Ai much?",
            "Is this why I can never move past the first round in interviews."
        ]
    },
    {
        "post_id": "1agtyvw",
        "author": "NASA_Orion",
        "title": "bro what😭",
        "url": "https://i.redd.it/hu5pwgjxb3gc1.jpeg",
        "score": 510,
        "num_comments": 21,
        "created_utc": 1706844134.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1agtyvw/bro_what/",
        "comments": [
            "r/unfortunateplacement",
            "https://preview.redd.it/bbj5jvfp57gc1.jpeg?width=1284&format=pjpg&auto=webp&s=0d20e967307b8fc1c56531e1c615340481ee52be\n\nThis post got one as well 😭",
            "it's joever",
            "That is a lot of first interviews, maybe it was a interview problem and not resume problem? Idk.",
            "\"Join the military\", they said, \"it will be fun\", they said.",
            "To be fair, after he gets out he will probably have an easier time than folks doomscrolling and complaining here.",
            "A 38% response rate seems unusually high",
            "Interviews are like first dates. If you have 13 first dates and no 2nd dates, something is wrong with your dating process.",
            "When AI is smarter than you /s",
            "\"We did it Joe!\"",
            "He didnt specify what military though. I’d love to be in the USAF and fly fighter jets like Tucker Balch did.",
            "what do you use to make the diagram?"
        ]
    },
    {
        "post_id": "xkir17",
        "author": "SnooRecipes1809",
        "title": "“Why would you like to work for [insert company]?” 😃",
        "url": "https://www.reddit.com/r/csMajors/comments/xkir17/why_would_you_like_to_work_for_insert_company/",
        "score": 515,
        "num_comments": 48,
        "created_utc": 1663798352.0,
        "selftext": "Uh, because I need money (like what). Am I supposed to write you a paper about why I’m so passionate about your mission statement?\n\nYou guys make fucking electronic payment buttons for websites, relax. There’s no short essay I could possibly write for that.\n\nI already need to crank out 200 of these applications like a factory machine to have reasonable odds at an offer. Half of them are through Workday which wastes so many minutes incorrectly plugging your resume and having you correct the site. I don’t even understand what 20% of these companies even make, I can’t begin to care unless they reply to me.\n\nPlease don’t waste my fucking time. I have 300 LC Med’s to master and dozens of assigments due next week, I could give a fuck about your passion project essay question. \n\nThis is the industry where interns getting a 5% response rate is considered decent; you expect me to write your essay question with odds at 95% of you not even replying? Fuck off.",
        "permalink": "/r/csMajors/comments/xkir17/why_would_you_like_to_work_for_insert_company/",
        "comments": [
            "Do what I do: make a template and only replace a couple of words to tailor it to the company's mission statement/vision. Most are very similar.",
            "I’m about a month into my new grad job. My generic go-to answers in the interview process went some combination of…\n\n“I’ve learned a lot in my classes, but I’ve only put the concepts into practice on a small scale.. I’m exited to learn more about what its like to work on a large scale, where your code impacts many users/request etc”\n\n  and\n\n“I use this product (and or/ my family and friend do) and/or I’m interested in this problem space, and I think it would be fascinating to get to touch something that I know and use. It’s exciting to have the opportunity to have kind of impact, it makes my code feel tangible! Plus it would be fascinating to learn from people who have worked on a product that I and many people enjoy.”\n\nTailor it as much as you can to the company, but really all you need to do is sound excited and not like a bumbling idiot. This is a soft skills question for sure 😅",
            "[deleted]",
            "Take my upvote",
            "[whydoyouwanttoworkhere.com](https://whydoyouwanttoworkhere.com/)",
            "Someone willing to put into more efforts gets the job, that's it\n\nAs a company, you obviously want someone that is willing to at least make up passionate and tailored responses, than someone just sending generic applications",
            "I just talked about the political and economical status of our world, and how it directly impacts Jaden",
            "Amen! HR be like oh I wanna get some of that “technical interview outta him too”; proceeds to make a behavior Q mandatory on application page 🙄",
            "I always answer it from the perspective of learning. Granted I'm genuinely curious about how these large scale systems work from a engineering perspective, so that helps.",
            "I always roll my eyes when I run into these retarded free response questions in SWE job apps",
            "[deleted]",
            "Money",
            "I want to work here because I believe that {comapny name} is a unique and innovative company that is constantly pushing the envelope in the world of {industry}. I am passionate about technology and problem solving, and I believe that {company name} would be the perfect place for me to continue developing my skills and knowledge.",
            "I want to work here because I believe that {comapny name} is a unique and innovative company that is constantly pushing the envelope in the world of {industry}. I am passionate about technology and problem solving, and I believe that {company name} would be the perfect place for me to continue developing my skills and knowledge.",
            " if you spent time copy-pasting the company's mission statements into all 200 of these applications instead of writing an essay about it on reddit about why you're annoyed you'd be done by now.",
            "\"Well there were a couple of companies I had my eye on, a few have given me some great offers, however I wanted to take the time to get a more personal take on this company as I was impressed with (blank)\""
        ]
    },
    {
        "post_id": "1btnn6g",
        "author": "cptalpdeniz",
        "title": "My Journey in 2023 Software Eng Job Hunt",
        "url": "https://i.redd.it/th5gx9tkazrc1.png",
        "score": 517,
        "num_comments": 58,
        "created_utc": 1712025474.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1btnn6g/my_journey_in_2023_software_eng_job_hunt/",
        "comments": [
            "How is your father?",
            "Interview qn: how’s your father ?",
            "\"With 300 years of experience\"",
            "April fools?",
            "![gif](giphy|xTiTnH8ppc3vZ6gTDO)",
            "https://preview.redd.it/ak1thoik45sc1.jpeg?width=1125&format=pjpg&auto=webp&s=b2a75bd7cdad9458eb1afd6255ad638645f3c28f",
            "That’s luck right there",
            "Can u post ur college experience year by year? I’m just gonna do whatever u did lol",
            "Congratulations",
            "You should add an option where you do all the processes and interviews and reach the reference checks then you receive a rejection mail",
            "op's dad is Jensen Huang",
            "Now try 2024 and post again",
            "What company? Not looking for name but was it local? Startup?",
            "What are these comments..",
            "Two years trying and can’t find anything 🥲",
            "That's terrific. Just curious, what kind of projects you had to do to get in with such short no of applications. Ofcoz, I can only imagine what deep network of contacts you must have developed to get there. Congratulations 😁😁.",
            "Aren't you a super star?",
            "What a flex lol",
            "Good job dude!",
            "![gif](giphy|BWhpkB6Xbe8FzfNLXw)",
            "https://preview.redd.it/3dmw9u75f4sc1.jpeg?width=1290&format=pjpg&auto=webp&s=be58abb2dc9a9c51badba60c022a84782b068874",
            "Bro, you didn't hunt shit.",
            "How does everyone make these cool visuals?",
            "what tool did you use to make this chart?"
        ]
    },
    {
        "post_id": "177mdxy",
        "author": "childofdreams",
        "title": "Got rejected by Duolingo. Not giving up, though.",
        "url": "https://i.redd.it/xrnqiw3m95ub1.jpg",
        "score": 510,
        "num_comments": 79,
        "created_utc": 1697278912.0,
        "selftext": "As it says in the title. Though, with the way the words are phrased in the email, is it wrong of me to hope (even for a little bit)? 😔\n\nAlright, next application then.",
        "permalink": "/r/csMajors/comments/177mdxy/got_rejected_by_duolingo_not_giving_up_though/",
        "comments": [
            "That's the standard rejection email (it's joever)",
            "Username checks out",
            "Duolingo is insanely hard to get boss.",
            "10yr dev here. You’ll see hundreds more of these in your career. Definitely keep trying if thats where you want to be.",
            "same here. I also got rejected. Looks like we got different messages though",
            "don’t sweat it they basically only hired from ivys",
            "Yeah don't hope. Youll never hear back from them, unless you apply again for other role. Ive read so many of these emails Im sick of them at this point",
            "That's the nicest, non generic rejection. I want to apply for duolingo now. How do I apply?",
            "[deleted]",
            "Idk who needs to hear this but there’s a reason their headquarters are situated in Pittsburgh. They basically only hire from Carnegie Mellon. CMU is a feeder for Duolingo internships which then transition into full time offers. They basically don’t look at your resume unless you’re CMU affiliated.",
            "Good luck! I hope you get an even better offer soon! :)",
            "Has anyone actually gotten an offer after a rejection email?\n\nI’ve seen so many of these rejection letters where they say “we’ll keep your info on file and contact you for a better fit available”",
            "Yea don't hold out hope. This is probably a form rejection letter they send to everyone. Keep working on new applications, and put this one behind you as a learning experience.\n\nFYI, in most situations if a company wants to consider you for another position, they would just do so and tell you immediately, for fear of losing you to other employers. There is a common misconception on here than when you apply for a job the employers can't or won't put your resume into review for a different position. It's pretty rare that a company can't do this due to some policy. In most cases they can and do. I've done this multiple times with candidates.",
            "Duolingo used to be my dream company but after researching how difficult it is to get an internship there, I gave up.",
            "got that email too lmfao freshmen/sophomore internships are SO hard to get",
            "received the same email today too 😔",
            "I see these responses 24/7 in my life at this point 😂",
            "I wouldn't work for a company that knows it is dying lol",
            "デュオ鳥：お前はもう死んでいる！\n\n夢の子：何？",
            "What is even the point of this post? “Hey guys, I got rejected”. Like what? Lmao",
            "Sad, but don't let your hopes get down, you got it :D  \nPs; can I see your resume?",
            "Honestly that’s probably a good thing since that app is literally useless for learning languages."
        ]
    },
    {
        "post_id": "16i9o64",
        "author": "iainttryingnomore",
        "title": "I moved to Seattle for a high-paying tech job. It turned out to be the loneliest time of my life.",
        "url": "https://www.businessinsider.com/incredibly-lonely-high-paying-tech-job-seattle-2023-9",
        "score": 516,
        "num_comments": 80,
        "created_utc": 1694668964.0,
        "selftext": "This article hit too close to home. I would advise all the college grads here to not be one dimensional about tc or prestige but balance it with other aspects of your life that money cannot buy.",
        "permalink": "/r/csMajors/comments/16i9o64/i_moved_to_seattle_for_a_highpaying_tech_job_it/",
        "comments": [
            "this guy really thought the google office would be a good date spot 💀💀💀",
            "too busy maxing the LC tree, spec'ing 0 points into the rizz tree",
            "Tl;Dr: Techbro moves to Seattle, doesn't get a hobby or anything, and then is lonely and surprised that it's unremarkable techbros are common in a tech hub. \n\nThat said, I think it's super hard to make consistent friends once you graduate. \n\nI'd guess >90% of the people I hang out with outside of work are either a) friends from college, b) their friends, or c) people from work. I see more on a regular basis (volunteering), but those are all in their 30s and don't care much to socialize. \n\n> being a software engineer in a tech hub is far from special\n\nNo shit; it's nice when I come back home and can just treat my friends anytime we go out lol\n\n>  I only talked about what it was like working at Amazon or Microsoft because that was all I knew.\n\nProtip: get a hobby",
            "I also moved to Seattle some years back for a tech job... and I actually loved it! I hung around UW a lot and managed to make lots of friends. I played a lot of pickup soccer in the parks there and the food options near UW are quite good. It probably helped that I was pretty young and worked for a big company, so a lot of coworkers were also there and willing to hang out. \n\nI moved back to the East Coast, but I still can't forget the beautiful summers there near SLU 😆",
            "Brother, if I have to code in Minecraft Redstone making $20 an hour with no healthcare - I would take it in this trash ass economy.\n\nStudent loans start next month, holy fuck.",
            "\"I skipped work to play TFT and made it to Diamond\" from his linkedin.\n\nWho the fuck is this man, I feel like I'm getting trolled. This whole post reads like \"What do you mean I can't have an elite job AND get laid because of it\"\n\nEdit: Do not go to his LinkedIn, he posts multiple times a week with #coding #softwareengineer all those bullshit stories that read like\n\n\"I was in the middle of an interview\n\n\n\n\nThe interviewer asked me \"What do you really want in life\"?\n\n\n\n\nI paused. I really had no idea, so I just said the first thing that came into my mind:\n\n\n\n\"I just want to fuck the CEO\". He didn't think much of it. A few weeks later, I progressed far enough to a meeting with the CEO.\n\n\n\nWhen she walked into the room, I immediately realized it was your mom. I'm going to bang your mom.\n\n\n\nAlways progress, let go of your ego and leadership principles will naturally follow. Stay humble.\n\n#coding #humble #software\"",
            "from my own experience and the experiences of others, seattle supposedly is one of the cities where it is harder to meet people. food for thought",
            "This guy is a grifter. He works at FAANG for about 1 year each, barely making it to the senior level, but keeps milking that FAANG experience on LinkedIn. He posts every day, so I had to mute him to avoid his sobbing BS.",
            "This guy has no idea. There are people who travel for work and make much less. \n\nImagine being in a new hotel room every 2-4 weeks to do some manual labor ass job. Your coworkers are uneducated drug addicts and no one from home calls you. \n\nI honestly can't believe some people write privileged suffering bullshit like this. \n\nThis dude is upset that he went straight from college graduation to a solid fucking 6 figure job in a tech hub and realized women don't think he's interesting for being a tech bro in a tech hub 😂.\n\nGet some fucking perspective before you think your experience is worth publishing, shame on the writer honestly.",
            "Awww poor guy. has a good paying job, stable life and career during one of the worst periods in  tech history in the past 20 years, but he can’t make friends. :(( truly an unfortunate soul",
            "I’ve read this guy’s posts on LinkedIn and sooo many of his posts are victimizing himself and complaining about all his past job experiences at FAANG. Also who thinks it’s a good idea to always talk about your own work on a date 😂",
            "Laughed my ass off reading this article this dude reeks of arrested development 🤣🤣",
            "Glad I don’t relate lol omfg going on a date within googles HQ? Bro separate your work from your life.",
            "This article is dumb as hell, of course you’ll be lonely if you put zero effort into doing shit outside of working and not making friends",
            "Goes to show that just because you make a lot of money doesn’t mean you’re happy",
            "How embarrassing for him (that he let this article get written).  I would hide my head in shame.",
            "This isn't about moving to Seattle or tech. This is about having an identity **outside of work**.",
            "I completely get the loneliness epidemic, that shit hits rough. I agree with him on that.\n\nBut a date to the Google office and not having a personality outside of tech? Alexcancode but Hecanhavehobbies too",
            "I swear man some people are so ungrateful with what they have it’s crazy bro",
            "Sounds like he is just shit and making friends and meeting people. Nothing to do with job.",
            "This guy is just a weirdo whose whole life focuses around his job. You are not your job. It should be just small part of You. Unless You are a president or a doctor then people will listen all the time about your work with interest.",
            "I could make friends in fucking Boise Idaho. This guy’s social skills just aren’t up to par, or is just applying his introversion onto everyone.",
            "I live here and love it tbh. Cities are big enough you can live whatever life you want, being lonely is a personal problem.",
            "“I’m an antisocial nerd who got a high paying job in a bustling city and it didn’t help my social life”",
            "I laughed a couple times reading this",
            "Sounds like someone who made cs there whole personality",
            "This person is what we would colloquially call \"an absolute fucking loser\".",
            "S-tier loser no 🧢",
            "this is why nyc is the best",
            "The absolute state of this thread. Neurotypicals really are disgustingly arrogant and ignorant.",
            "Good write up and brave for admitting all of this. People like to hate for no reason and then wonder why people around the world are getting more disconnected",
            "If you have money, how are you lonely? Unless you’re working 50 hours a week.",
            "Chase tc when you are young otherwise you’ll be old with trash comp and wonder why life wasn’t fair to you. Maximize comp and use your ote as leverage for your next, etc. eventually you will have high pay and low effort for that sweet work life balance.",
            "You usually can't make friends after college.",
            "This is very true in Seattle",
            "Go to the gym and find another hobby. I agree that it’s incredibly difficult to make friends post-college and especially in your late 20s and early 30s, but still find a hobby.",
            "Skill issue",
            "I burst out laughing when he mentioned bringing up stand up meetings on a first date lol.\n\nYes, it's hard to make friends as an adult. But this guy seems to literally have 0 hobbies. Don't be surprised if people aren't drawn to you when you're a boring person.",
            "The PNW weather is depressing.",
            "you’re literally making bank sthu 😭"
        ]
    },
    {
        "post_id": "106nmdf",
        "author": "bayesian_algebraist",
        "title": "Anyone else LARPing as a CS major?",
        "url": "https://www.reddit.com/r/csMajors/comments/106nmdf/anyone_else_larping_as_a_cs_major/",
        "score": 518,
        "num_comments": 23,
        "created_utc": 1673196088.0,
        "selftext": "I pretty much role play being a CS major in most of my free time, despite actually being in political science. I contribute to r/csmajors and various other CS-related subreddits despite not knowing how to code—I pretty much just parrot what everyone else says on here like all the freshmen do.\n\nI’ve never taken a CS class, but I hang out in the CS building and say stuff like “wow, discrete math is killing me!” to try to fit in, and I’ve made a lot of friends this way. My cover almost got blown one time when I accidentally remembered to shower before going to the university one morning.\n\nNobody has said anything yet, and my friends think I’m an actual CS student too lol. \n\nI even went as far as joining the socialist programmers club, but they kicked me out for “being too reactionary” after I told them that their government-mandated Discord nitro idea doesn’t interest me much.\n\nWondering if anyone else can relate?",
        "permalink": "/r/csMajors/comments/106nmdf/anyone_else_larping_as_a_cs_major/",
        "comments": [
            "Sounds like another case of a cs student with imposter syndrome",
            ">I accidentally remembered to shower\n\nstraight to jail.",
            "amogus",
            "Bruh, this is probably the best shitpost of the year and we’re only a week in 😂",
            "According to your post history, you asked your wife to marry you through some obsecure math puzzle. Seems like you’re LARPing the full 100%.",
            "i lol'd",
            "Why LARP when I is.",
            "Honestly pretending to be a CS major is one of the hardest things in my life. Walking to my Spanish class pretending it’s calculus 2 is like walking through a minefield. \n“Yes I am so sad that I have to take math, oh yeah I definitely did the homework, huh there was a pop quiz? Yeah I remember now.”",
            "i usually do the inverse, larp as a humanities major",
            ">*socialist programmers club* \n\nlmao",
            "[deleted]",
            "lmao",
            "I’ve been LARPing as a CS major while majoring in CS. Those CS students you’re talking to probably feel the same."
        ]
    },
    {
        "post_id": "kfzk1g",
        "author": "princess_yue_",
        "title": "0 internships and I got an offer! (New Grad)",
        "url": "https://www.reddit.com/r/csMajors/comments/kfzk1g/0_internships_and_i_got_an_offer_new_grad/",
        "score": 512,
        "num_comments": 78,
        "created_utc": 1608345610.0,
        "selftext": "I’m currently a senior (graduating May 2021), have had 0 software engineering internships in my 4 years of college (one cancelled due to COVID), and managed to get an offer for a new grad Software Engineer role starting in 2021! I’m unbelievably grateful and extremely lucky to get this opportunity, will definitely have some imposter syndrome for a while lol. But just wanted to let you all know that not all hope is lost, even when you’ve had 0 SWE experience like me! The team’s feedback was centered around my behavioral interview and said that I really stood out through those answers, so don’t think grinding Leetcode is the only important thing (although it does help). Thanks so much to this community for being here through my recruiting process. I literally read through this subreddit every single day. Most importantly - You guys got this!!\n\nEdit: Thank you kind stranger for my first ever award! :D",
        "permalink": "/r/csMajors/comments/kfzk1g/0_internships_and_i_got_an_offer_new_grad/",
        "comments": [
            "You know what they say: shoot for the moon and you'll become it, leaving your new boyfriend from the water tribe behind",
            "Hi Yue,\n\nCan you share your answers to the behavioral interview questions ? Or your resources ? I have been applying for about 6months and clearly I’m doing something terribly wrong with the behavioral interviews :/",
            "Is this role at a startup or large company?",
            "Congratulations!!! You absolutely deserve it! //\nCan i ask you a question? What were your resources for behavioural? Does ctci cut it?",
            "Congratulations you unicorn you!",
            "As someone who suffers from Imposter Syndrome, this post made me feel better. Thanks. I'm also graduating in 2021 with little to no exp atm.",
            "Congratulations! Would you be able to share any characteristics of the company you landed (rank/prestige/etcs)?",
            "How did they find you? Advice needed. Ty.",
            "I'm the same. Congratz OP.",
            "Congratulations!",
            "[deleted]",
            "Congratulations!!! I hope I am offered a similar fate. Best of luck to ya!",
            "[deleted]",
            "Nice!\n\n Curious but how many applications did you sems out? What more or less did you have on your resume that counted as 'experience'? What personal projects did you have?",
            "Congrats",
            "Can I dm you for advice?",
            "Congrats! I hope you excel in your role and I wish you all the best! \n\nIf you don’t mind me asking, did it take you a lot of applications, referrals, good projects,  a high GPA, going to career fairs, etc. to land this job?\n\nI guess my question is basically what were some of the things you did to stand out with no professional experience and was it difficult to come across this role?",
            "Congrats! :)",
            "Who are yue",
            "Congratulations! I’m currently looking for my first job post graduation. It can be frustrating looking at so many entry level job listings that require several years of experience, but I will fight on until I land one! Congrats again",
            "How many LC have you done?",
            "[deleted]",
            "Dm’ed you",
            "What kind of experience was on your resume?",
            "Struggling with getting a job right now could you give some tips. I’ve gotten pretty good at LC style questions although there’s still room for improvement there. I have a 3.2 major GPA from a good school (not ivy or anything but very decent). I’ve applied to around 18 places and heard back from none of them. I have 3 experiences 2 are very minor and 1 is an internship and I also have a project. I’ve been applying on the west coast and Chicago.",
            "Congrats!!  I'm sure all your hard work paid off!  Can I also dm you for advice?  I'm in the same position as a newly grad and tbh I'm pretty lost and unsure on what to do."
        ]
    }
]