[
    {
        "post_id": "1bpkqod",
        "author": "drillapolak",
        "title": "After lots of blood, sweat, and tears I finally got a summer internship!!",
        "url": "https://i.redd.it/jwxdqiwpmzqc1.jpeg",
        "score": 507,
        "num_comments": 42,
        "created_utc": 1711593662.0,
        "selftext": "fu companies that ghost after interviewing",
        "permalink": "/r/csMajors/comments/1bpkqod/after_lots_of_blood_sweat_and_tears_i_finally_got/",
        "comments": [
            "![gif](giphy|jJQC2puVZpTMO4vUs0|downsized)",
            "past experiences?",
            "Oh my congratulations\n\n![gif](giphy|JvYY6mPoEzntQ9u3ej|downsized)",
            "literally my graph bro xd congrats!",
            "Elaborate on the blood part, what did you do",
            "Which company",
            "Guys how to make this flow chart ?",
            "What class are you?",
            "Congratulations 🎉 🎉  + I want to ask you about something and please advise me I'm a sophomore computer science and technology student ( international student in china) and I'm currently learning Front-end development also I want to continue my career until Full-stack development, and I want to get an internship next year ( junior student) outside of china, so what's your advices About this, can you give me small company that can accept me as cs student without experience as entry-level if you have any ideas about this please let me know 🙏",
            "Congrats!!",
            "good shiittt🏅🏅🏅",
            "Can i dm you ?",
            "![gif](giphy|3oFzlV2pq0nnFntAZ2)",
            "How do you create this graph?",
            "what sites still have swe summer internship postings, i’ve been looking for them",
            "It’s RH right",
            "Are you international?",
            "Congratulations, How many months to get it?",
            "What tech stack needed for this internship?",
            "Inspiring 🎊congratulations 👏🏻",
            "Internship is hard to get? So we have to give an interview for that too?"
        ]
    },
    {
        "post_id": "xhiw4t",
        "author": "invertedfractal",
        "title": "Does the moon phase natter when applying to internships?",
        "url": "https://www.reddit.com/r/csMajors/comments/xhiw4t/does_the_moon_phase_natter_when_applying_to/",
        "score": 508,
        "num_comments": 29,
        "created_utc": 1663513175.0,
        "selftext": "Hi, I was wondering if the phase of the moon (i.e. waxing crescent/gibbous) matters when applying for internships? I've heard mixed opinions on this with people saying I should apply in the twilight hours of a full moon...",
        "permalink": "/r/csMajors/comments/xhiw4t/does_the_moon_phase_natter_when_applying_to/",
        "comments": [
            "yes, it does natter",
            "I usually like to find the astrological signs of my interviewers and then optimize all of my behavioral answers to our sign compatibilities.",
            "New astrology OA inbound",
            "Only if you're applying to NASA",
            "Yes, and be wary when Mercury is in retrograde.",
            "If you're not constructing a full horoscope chart for yourself, the company, the interviewer, and the interviewer's dog then consulting at least three haruspices do you *really* want the internship?",
            "It is important to apply to FAANG only on a full moon. Any other time isn't going to work. Unicorn's are also best during a full moon. No one is going to hire you if you apply during a new moon.",
            "[deleted]",
            "Depends if you are a werewolf or not",
            "Just go ahead and apply during a waxing crescent and you'll find out.",
            "Yes",
            "It matters if its a unicorn company or if you're a werewolf",
            "Yes",
            "It matters for internships but not for co-op positions.",
            "yeah",
            "Guaranteed offer on full moons!",
            "Everything needs to be in syzygy mode before you apply",
            "It’s actually the most important part",
            "Yea, and at FAANGs they actually started to ask about finding the most common occurring phase on each day of the week, ranked in descending order in a linked list that also needs to be twice reversed. If you can’t answer it then I’m sorry to say, your career is over.",
            "Tell me about a time when you were stuck working on a project due to a waning moon!",
            "Use a linked list",
            "If you’re a werewolf, then you should apply on full moon to get into FAANG"
        ]
    },
    {
        "post_id": "1bdmc46",
        "author": "lalllalallalalala",
        "title": "I WILL BE A PROGRAMMER",
        "url": "https://www.reddit.com/r/csMajors/comments/1bdmc46/i_will_be_a_programmer/",
        "score": 511,
        "num_comments": 130,
        "created_utc": 1710318366.0,
        "selftext": "i’m a junior in college and ngl the way people talk about cs and it’s future can be disheartening but not enough to make me quit. (nothing more satisfying than finishing the frame of a program and running it 100+ times to debug & make the interface pretty) if anything it’s the lack of belief in myself that affects me the most. i have to stop being lazy but i’m super motivated. \n- people become brain surgeons i can become a programmer \n- women in tech that have made big contributions. i can be them in some capacity.\n- rome wasn’t built in a day. neither will my programming career \n\ni don’t think ill have an internship this summer but im already thinking about a project that i’ll try to build in c++(the language i started with) instead of java (the language im learning now) and im excited about the future end goal is to learn swift and tunnel my way into working for apple. KEEP YOUR HEADS HIGH ladies and gents the worlds not over <yet> :p bye \n",
        "permalink": "/r/csMajors/comments/1bdmc46/i_will_be_a_programmer/",
        "comments": [
            "recommend you touch grass (socialize with other smarter and more experienced cs majors) to learn faster, try clubs and stuff.",
            "Crying today cuz I felt like a failure. These Reddit posts make me wish the sun would just explode so I wouldn’t have to wake up the next day.",
            "I don't know why the people in these comments bother to stay on this sub if they've given up on coding and CS?? \n\nLike not even doomposting, but straight up \"CS is dead and there's no point studying it now, tech jobs will soon cease to exist\".\n\nDo y'all just enjoy being miserable and making others miserable too? What is the point of coming on here to say this stuff if you're done? 💀\n\n...unless it's to ward people off from choosing a CS major, in which case: CS IS DEAD, EVERYONE SWITCH CAREER PATHS ASAP!!!",
            "What about the future of the field? Sure job market is kinda tough rn but that's because of the pandemic bubble and everyone knows that. If it's all the AI talk gettin to ya then I wouldn't worry about it. If AI can replace SWEs then Turbo tax would have replaced accountants and MRs would have replaced doctors. At the end of the day, even if code can be generated by AI, you would need an engineer to prompt AI and to look at the result, and that takes the same level of expertise, just with less work. That means the value an engineer can produce increased with AI, and if anything, that should incentivize **more jobs**, not the other way around.",
            "Y’all a bunch of Debbie downers I swear",
            "You're going to do great\n\nJust don't make your career part of your identity. You are much more than a programmer already",
            "Thank you OP, we need more positivity over here :)",
            "definitely learn swift imo. i went into native iOS development out of college (2021) and i feel that this niche has somewhat shielded me from the doomposting frequented in this sub. i got my second job as an iOS developer in late 2023 amidst the worst of it too.",
            "Good for you! Passion goes a long way. I didn't choose this career because of the money, but interest. In the end though it has to pay the bills, and it will, simply not as wacky as it has been, and competition will be fierce.\n\nIf I no longer make money in CS it will become a hobby again and I will pick up a trade job.",
            "You have the right attitude and will surely succeed don’t give up",
            "Hell yeah you will! With this mindset you will thrive in the industry. As you can see from the comments LLMs have permanently brain broke many. As a deep learning researcher let me tell you that while language models are incredibly powerful tools they are a dead end towards generating truly novel thought. They use a constant amount of compute to generate all their answers. Think about that it takes them the same amount of compute to answer where the Statue of Liberty is located as it does for them to attempt to give an answer to a unified field theory. That should be a huge red flag that they are engaging in a primitive form of reasoning. And it’s because they are! They are simply trying to determine the most probable next token and it is becoming a clearer everyday that this is simply a powerful form of lossy compression. Those who doom and gloom about how it’s over will find themselves permanently stuck as a junior skid who thinks engineering is copying and pasting code from stack overflow. Those with your mindset who take the time to master fundamentals will be empowered by AI and will quickly become a senior++ engineer. I see a bright career ahead of you!",
            "Nobody wants to see you fail more than your peers, and as long as you have that fire to succeed under your ass you’re going to get the types of comments you see in this thread. In any competitive environment, it comes with the territory.\n\nI promise you there is no greater feeling than looking back at comments like these while living the exact life you used to pray for.\n\nYou will never get hired to write code, you will get hired to solve problems. Seek problems and base your entire professional career on being the person who can solve them.",
            "Love your energy! Keep it up, you've certainly galvanized me too, I'll try harder too. Thanks!",
            "At some point, you’re going to realize that programming isn’t the same thing as writing code, and then you’ll stop caring about what language you want to write a project in, and you’ll just learn a new language if it’s better for the project. I think it’s good to learn C++ and Java in classes, because they’re good examples of languages that are simultaneously very different and very similar, but the important thing is to just recognize that programming is programming, and then you just break out a language reference and pick up a new language. I had a student who was looking for a C# tutor. I’d never used C#, but I told him, “Give me a week.” It’s just syntax and vocabulary, most of the time, but a loop is still a loop, a data type is still a data type, and control flow is still control flow. Hence, programming isn’t the same thing as writing code. The less you sweat it, the easier it gets. \n\nKid also looked at me like I was crazy when I started flowcharting the problem he was working on, but that’s another story for another day. Short version, though, is that it cuts my debugging and rewriting time by way more time than it took me to make the flowchart, and I think it’s a pity that most schools never bother to teach it.",
            "Currently, something is happening to me regarding CS. I've landed my first programming job. I feel very useless because I don't have much experience with programming, meaning I haven't built enough projects to feel comfortable writing software. That being said, when a task is assigned to me, I take a considerable amount of time to finish it, and I ask lots of questions to the seniors. Even though I am not that experienced, I'm building projects and studying in order to improve. I have noticed that once I learn something and practice it, I don't forget it easily. In fact, I grasp the concept very well and generate tons of ideas regarding the task in question. I'm extremely creative. Also, right now my logic is garbage. I feel awful at work because I'm not able to contribute as I could. I'm the worst programmer in the room.\n\nDo you guys have any advice for me?",
            "If I can do it, you can do it. Trust me.",
            "I AM A ~~SURGEON~~ PROGRAMMER",
            "Btw there are a ton of great resources out there for women in code. \n\nAnd yes the entry field is pretty scary and awful now but eh, that may change by time you graduate. As long as you are passionate about doing it, it’s worth it.",
            "Yeah I'm in this sub but I feel like theyre being a bit over dramatic. Realistically, AI agents aren't taking over tech professionals any sooner than they replace lawyers and other professionals. Imo. I graduated with my BS in CS 2 months ago and already landed a nice job as an embedded engineer at a large local company. I will say I sent out a lot of applications (easily 1.5k+) only to get a couple real interviews. And target jobs that fit your skillset. Or if you land an interview, make sure to emphasize how your skillset aligns with the needs of that position. The industry isn't dead. Yet.",
            "fyi this is your last chance to get an internship since you’re a junior. if you’re graduating with 0 internships you’re gonna be kinda fucked. there’s still time, apply to small companies and good luck!",
            "I gotta be real with ya, it’s more likely majority of us won't be programmers. Devin is coming for all of us, there will fewer CS jobs in the future but to adapt you have to start looking in adjacent fields and leverage your skills.",
            "I'm the same as you, trying to push towards my goals despite what people on here say, good luck",
            "i love the doom posts. let people quit so there is less competition in mid level when i need a new job in 2 years, higher TC for me ",
            "Yes, you will!!!!!!!!",
            "YOU GOT IT",
            "PROJECTS R GOOD UR ON THE RIGHT TRACK",
            "Damn you are so wholesome. </3",
            "I will become my own roman empire",
            "The imposter syndrome is so crazyy in this field. I feel like people have a lot of opinions about CS nowadays. Seeing the current situation and some code wiz it really feels like im behind but when I look back at whatever I have learned.....i realize that actually I have come a really long way. And progress is always slow and steady. And I totally believe that you would be an Awesome kick-ass SWE or whatever you aspire to be. Lots of love and luck. <333",
            "I don’t listen to people. I see them. Half of the people drop. The ones that remain say something else about the major.",
            "It's a dead field, your future career is dead, your dreams are dead, your major is dead, javascript will be dead, your first born child will be dead, nothing matters in this world...\n\nThe future is AI\n\nGo plumbing",
            "Maybe Bias from my end, but I believe C++ is a better language to learn than java anyways, learn the stuff that people hate, and opportunities will come. \n\nAlso, the situation is not nearly as doomed as the posts here would have you believe, there are some genuinely terrible candidates fearmongering that wouldn't have gotten interviews in 2018-2020 either.",
            "people always have a computer on hand - mobile phones, laptops, desktops, etc. If CS jobs get taken by AI then literally no job is safe. But AI and tech costs are still way too expensive to replace real skilled humans.\n\nThe only real threat AI imposes are those who are mediocre",
            "Hopefully everyone here gives up on cs",
            "Thats what we all said when starting our journey one way or another.",
            "Anyone can be a programmer. You just need a computer and an internet connection.\n\nAre you talking about getting paid to be a programmer? Different thing. ",
            "Look up Devin. Devin will haunt you. Not only is tech the new wall street where grads from prestigious top schools, uber smart people, or people with connections will always get rewarding positions because its grads chasing money and life isn't fair. CS grads are doubling every year, oversaturation is definitely real. While a surge in graduates can create challenges, it's not necessarily a death knell for a job market. But we have AI to deal with as well, ah Devin. \n\nDon't just grind (and keep staying super motivated) but Network. Who you know in life is much more powerful when thousands of others have the same skills as you. \n\nBest of luck",
            "Apostrophes... How do they even work?",
            "👏👏",
            "Word.",
            "Be fearful when others are greedy and be greedy only when others are fearful.",
            "To the people crying, just give it up. It aint for you fishies 🐟 \n\nIts for us sharks 🦈",
            "I recommend that you unsub from all CS subreddits (only use them for checking specific questions), doom and gloom will not accomplish anything. ",
            "yo I was thinking about this earlier. People have such negative attitudes and like I’m the market isn’t so good rn but you’re never gonna get a job if your outlook on things is doom n gloom",
            "IT is just a sector. But ok welcome to the club.",
            "Good to see a post like this",
            "You’re awesome, and I sincerely hope you get a role in the near future. I believe in you but what’s most important is that you believe in yourself 👊🏽✨",
            "I’m not giving up. NOT ME. NOT NOW",
            "Awww that was shoo kewt",
            "well maybe maybe not. Could be by the time you find a job that Devin has evolved into Devon and the need for 95% of SWE’s is gone. You and I are not in that 5%",
            "Just make sure you have a backup plan if things go south. Your optimism is cool and all, but it doesn't change the reality of our world.",
            "It sounds like you need to meet with devin",
            "Imma tell you. We are all fucked. Look at this job market",
            "Odds are you won’t. Womp womp lol",
            "no you won't... we will hire devin instead of you...",
            "So while your point isn’t crazy what makes YOU cut out to be the chosen one? Using brain surgery as a result and just because UW has a fantastic brain surgery school I can tell you most of them went to top Ivy League schools for undergrad. Programmers are not drying up overnight but my company for instance, not Apple but you might say better than Apple, has changed our college hiring from HBCUs to exclusively top ca programs like Carnegie Mellon, MIT, I am headed to Georgia tech soon to recruit. So unless you are in a top 10 ranked CS program you won’t be on the radar anywhere that’s considered a tech company. You can make it to industry somewhere because every company needs programmers but lower your expectations on salary by half and your chance of making it to Apple coming from an industry manufacturer or retailer is going to be pretty much impossible and getting harder every day as programming continues to shrink. \n\nUnless you are some programming god who makes it obvious to all those around them with every stroke of the keyboard your fate is probably sealed. You may get a programming job if you’re lucky but you will be cut short on your career in a couple decades regardless.",
            "Not if ur a white guy"
        ]
    },
    {
        "post_id": "12ch5wq",
        "author": "pianoloverkid123456",
        "title": "Ban of Comparison Threads",
        "url": "https://www.reddit.com/r/csMajors/comments/12ch5wq/ban_of_comparison_threads/",
        "score": 510,
        "num_comments": 68,
        "created_utc": 1680694125.0,
        "selftext": "Hello everyone,\n\nI want to inform you that we are no longer allowing comparison threads on this subreddit. We have observed that these threads often result in low-quality discussions, with a significant number of high school students who lack real-world experience making comments. Furthermore, these threads usually lead to fights and conflicts among members.\n\nTo help you with your college comparisons, we recommend that you check out r/applyingToCollege. For company comparisons, we suggest that you seek guidance from your school's career department or r/cscareerquestions . We believe that these resources will provide you with better and more accurate information that will help you make informed decisions about your education and career.\n\nThank you for understanding our decision. We remain committed to providing a positive and informative community for all our members.\n\nBest regards,\nThe mod team of r/csMajors",
        "permalink": "/r/csMajors/comments/12ch5wq/ban_of_comparison_threads/",
        "comments": [
            "They've become all anybody posts and I was getting tired off them. So thank goodness",
            "“Which is better for CS, Harvard or UIUC?”",
            "They are really pointless if you think about it. Which college is better? \"Well it just so happens I've received a BS in CS from both of those schools, let me tell you\"",
            "Thank you, the subreddit was getting spammed by so many high school students recently.",
            "they weren’t even a cs *major* yet 💀",
            "they're all brag posts. \"guys i got into hahhhvahhhhd and berkeley, which one should i choose?\" well at that point, pick the one with better looking broads.",
            "Thank you!\n\n\nI feel like people need to look at so many different things when determining a college that aren't just the CS major, things like Cost, Location, student life, diversity, etc are such important things for a place that you are going to be spending the next 4 years at. \n\nIn some instances I wouldn't even recommend a T10 school due to the price if a T100 university was going to fully cover your tuition.\n\nGetting a slightly worse education but not going $250k in debt like you will at a place like MIT is worth it IMO.",
            "Appreciated",
            "Thank God. Every post on the front page was about the better college. \"Should I go to Yale or Columbia?\"",
            "Yea, thank you",
            "god fucking damn it, how can I show my TC (huge btw) to impressionable kids with something to prove now? How can I tell them that I code everyday with my cock (huge btw) while playing Valorant in the background?",
            "THANK GOD",
            "Oh thank you so much.  These posts are maddening to me as someone who does a little college consulting and has a degree in CS.  Blind leading the blind for sure.",
            "Why compare companies are banned? I can understand ban school comparison cuz they are mostly useless",
            "Yeah it’s so cringe cause you know they are trying so hard to humble brag and flex but try and disguise it",
            "Hot take apparently, I think this is a bad idea. The whole point of comparison threads is to discuss to pros and cons of each option against each other. Is the discussion low quality? Yes sometimes but this is a sub for students in CS, most discussions will be low quality. Are the options subjective and not factually accurate? Yes that's how discussions work. Ask about schools in r/applying to college? CS is highly specialized and general school info isn't very useful (ex. Harvard vs CMU). Users are getting toxic? Ban the users don't ban ability for good users to discuss. Hit up people on LinkedIn to ask for their opinions? Few people will actually respond and it's a ton of work for both the parties because 1 on 1 conversions don't scale. To me, the main purpose of this sub is to discuss school and career, and now the mods aren't allowing that? Absolutely asinine.",
            "What exactly falls under the \"comparison posts\" umbrella?\n\nFeel like that is missing from this announcement.",
            "THANK YOU THANK YOU THANK YOU!!!",
            "I get colleges. But sometimes it's hard to compare companies and get an insight of A or B.",
            "I generally feel like the mods of the team could have a much more liberal use of bans and restrictions on posts / comments. There is p noticeable racist or sexist undertones to a lot of the comments / posts sometimes plus overt ego boosting posts",
            "Thank God 🙌🏽🙌🏽",
            "Much needed",
            "Had some guy ask between a full ride uiuc or Harvard it’s just so dumb.",
            "Thank you so much. This was driving me up the wall, it was every other post practically. The name of the school hardly matters for CS anyways - it’s what you take from the program, not what institution is written at the top of the paper on your degree.",
            "That's a very good move. Thank you very much mod team.",
            "thank the stars",
            "my thread’s longer!",
            "Can we also ban laptop questions? It always ends up being fights over the M1 chip."
        ]
    },
    {
        "post_id": "ik8r4z",
        "author": "accidental-dev",
        "title": "0 Leetcode problems. 1 job offer. It's possible.",
        "url": "https://www.reddit.com/r/csMajors/comments/ik8r4z/0_leetcode_problems_1_job_offer_its_possible/",
        "score": 509,
        "num_comments": 87,
        "created_utc": 1598915094.0,
        "selftext": "This subreddit is ridiculously intense. If that fires you up, great - I think that's the point. But for many, it's just discouraging. \n\nSo here's my story.\n\nI didn't excel at algorithms or any certain subject, but I did choose one stack and I practiced it a good bit. I graduated and got an average software job that made average developer money. (Which is great money in the grand scheme of things)\n\nYou don't have to be an all-star. Just keep at it and stay positive.",
        "permalink": "/r/csMajors/comments/ik8r4z/0_leetcode_problems_1_job_offer_its_possible/",
        "comments": [
            "I think most people on here chase after FAANG companies and to gain an offer from these companies requires you to demonstrate competency in DS and algorithms questions which is achieved by leetcoding. Congrats on your job offer by the way.",
            "What stack did you focus on?",
            "[deleted]",
            "Congrats!!!!! \n\nTo further this, I'm a Senior Software Eng. with a decade of experience and I can tell you (at the risk of downvotes) that leetcode is not nearly important long term as softer skills such as communication, writing, and actual software and product design and implementation. Knowing the ins and out of a stack you're working in is great, and hugely beneficial!\n\nBefore I begin, I have fun solving leetcode questions! But only in my spare time. In interviews, however, they are stressful af.\n\nLeetcode type problems rarely, if ever come up in the real world. But the industry asks them at all levels of interviews (seriously, some places still ask me them and my mentor who was the CTO at a profitible shop with almost 2 decades of experience and is moving on for personal reasons was asked a leetcode question even at that stage of his career, which is INSANE [he mostly, he gets scalability and hr type questions]) as a basis of understanding even though it has very little to do with your day to day.\n\nThere are plenty of \"elite\" companies that are straying away from them, and even divisions within some of the bigger FAAMG that don't use them as much as they used to! Hopefully we'll drop them and find better screener questions.\n\nThey also have tertiary issues (such as introduced bias, esp if done on a whiteboard - and also suffer from the SAT problem [wealthier people can afford to hire tutors lol]). \n\nPlenty of high level engineers use them as a metric in the interview to not go to the company they are interviewing.\n\nCongrats friend! You'll do great :)",
            "Thank you for this. I'm not trying to be the next bill gates living in San Francisco with the big leagues, I just want to make a comfortable salary, with a good work life balance, and this is truly helpful.",
            "Yep! I got the highest paying job my college placements offers, and totally without any leetcode. That was via an internship though, but at no point did I grind leetcode despite having gone through multiple coding and tech interview rounds.\n\nI know this is very anecdotal and depends heavily on luck.",
            "I've gotten my past two co-ops each with 1 phone interview and no coding of any kind :P",
            "What’s your stack?",
            "grats, but leetcode is for tech companies in tech hubs. hope no one else misunderstands that",
            "Tbh I feel like this topic is beaten to death. It should (and maybe it's not, but it *should*) be common knowledge that Leetcode is not required for every job, especially if you're not looking for a position at a big tech company. If you are, that's when grinding Leetcode becomes important. And btw by Leetcode I just mean studying DS&A problems, doesn't really matter how you do it or what you use to do it, same thing.\n\nAlso tbh, I think Leetcode actually is really helpful. I don't get why people call it pointless, after a certain extent it can get a bit ridiculous, but studying Leetcode for me really hammered in a lot of DS&A fundamentals. Graph searching, knowing how / when to use topo sort, understanding tries and other weird trees like index trees aren't used in every day SWE at every company, but studying those definitely made me a better coder and better at CSE in general. I definitely think Leetcode is far from pointless. \n\nMaybe in terms of measuring whether you'll actually be successful as a SWE is not a good measure (I'm not sure, I haven't looked into this), but I also feel like this is a really common phenomenon in a lot of application processes. Why does a college or major care about your extra curriculars when you can just show them your good grades? It's because it shows some extent of extra work you're willing to put in and that you're well versed / well rounded. Again, idk if this translates exactly the same way in SWE applications, but that's probably their thought process. Not necessarily defending it either, I think the SWE job grind is definitely super brutal and I hated it. But then again, we can also make twice the amount of a new grad engineer in other engineering disciplines, so the toughness of the interview is to be expected.\n\nedit: btw congrats on your offer!",
            "I unironically enjoy leetcode - I don't understand the hate it gets. it's fun. If I was set for life with a billion dollars I'd still probably leetcode a few times a week but I definitely wouldnt make stupid ass resume web apps anymore.",
            "What's your stack?\n\nStarting Salary?\n\nWhat country, city?",
            ">I did choose one stack \n\nWhich stack?",
            "FR. I read some of the things on here and think what have I gotten myself into and then I see things like this and it reminds me I can still get a job, congrats",
            "Personally I’m really glad for leetcode type interviews. Without them, companies would probably chose based on school name, so for someone like me who goes to an unknown school, I would probably never ever find a job.",
            "What did u focus on?",
            "Hey so I made an account just to second this, I lurk on r/csmajors every day also trying to get a Big N internship with no success thus far (non-target school, no previous Big N internships). However, I just got my first Summer 2021 internship offer from a mid-sized company (1000+ employees) with strong tech employees and a modern stack!!\n\nI have been studying a little bit of leetcode, but have been struggling a lot (still unable to solve a lot of Easy problems). I wasn't asked any leetcode-type questions at all throughout the interview process for this offer, just needed some of my overall software engineering skills (design and coding knowledge), which are definitely not at the advanced level.\n\nMost companies recognize that you are just an intern and don't have senior level skill in SWE, and that's ok! Idk what else to say but good luck everyone, just keep applying and seconding OP on the positivity part!",
            "What stack did you choose?",
            "Yes, Reddit is full of annoying overachievers. If that's your thing, cool. Most people just want practical advice. Thank you for sharing this.",
            "Need to CS and development, so sorry for the dumb question. What’s leetcode? What’s FAAMG? I’ve heard both of these terms frequently on this sub but never knew what they were.",
            "Drop average salary deets and location or DM pls.\nY'all are weird.",
            "Congrats but my goal it to make it at one of the companies that do care about leetcode",
            "bruh this is like saying \"no work, billion dollars\", guess what that dude was a trust fund baby? edge case. edge case. Having you learned osmehting from the HIREE EVUEES and the CODESIGNALLLLS brehhhhhh this bonafide tweak no cap 100% luh ma fao dawg being an all star is iportant im outworking you headahhhh",
            "Enlighten me please"
        ]
    },
    {
        "post_id": "1b1qw31",
        "author": "YakFull8300",
        "title": "Jensen Huang knows best......",
        "url": "https://i.redd.it/m73ilr6tr7lc1.png",
        "score": 512,
        "num_comments": 14,
        "created_utc": 1709077163.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b1qw31/jensen_huang_knows_best/",
        "comments": [
            "Nah man let him keep talking, reduce the competition",
            "Nvidia doesn't need 1 million SWEs, that's the problem. It's not so black and white as this person makes it seem",
            "Yeah but they would have to hire you tho",
            "Investors would rather hear that Nvidia will make software engineering accessible to anyone. Makes for a good narrative",
            "Also not to mention that the difference here is that getting good at CUDA is like, actually hard",
            "This is like telling a civil engineer not to learn statics because we have computers that will just do load calculations for you",
            "[deleted]"
        ]
    },
    {
        "post_id": "tvzwkp",
        "author": "hello-iamdad",
        "title": "After getting rejected by literally hundreds of offers, I just received not one, but two offers in one single day",
        "url": "https://www.reddit.com/r/csMajors/comments/tvzwkp/after_getting_rejected_by_literally_hundreds_of/",
        "score": 511,
        "num_comments": 39,
        "created_utc": 1649072403.0,
        "selftext": ":)",
        "permalink": "/r/csMajors/comments/tvzwkp/after_getting_rejected_by_literally_hundreds_of/",
        "comments": [
            "For those that could be wondering how I did it, and since I can now flex:\n\n1. I reviewed my Resume using Resume builder on LinkedIn, if the AI can read your resume properly them your resume is good to go.\n\n2. Google the keywords that make the AI orgasm, it could be Machine Learning, Javascript, anything you can think of.\n\n3. Again, the Resume. Design it, proofread it, let someone else read it.\n\n4. Projects, a resume with no projects means the recruiters are the ones that will be teaching you, and they hate that.",
            "big W",
            "Congrats! Chiming in to say I had almost the exact same experience, I got 100's of rejection over 4 or 5 months of applying to internships. Got to the point where it felt pretty much hopeless, and then BAM 2 offers within a week. Then an old application came out of the woodwork and I got a final round, and another offer 2 weeks later.\n\nI definitely learned a lesson in perseverance there. You gotta push through that point where it feels utterly hopeless and just keep applying, keep tweaking your resume, keep practicing, etc. There's that classic picture of a guy digging for gold and he's mere inches from it, but stops digging and turns around cause he thinks it's hopeless. Cheesy but so true.\n\nEdit: [for your vision board](https://i.imgur.com/XDrvkwz.jpg)",
            "Love to see it. Hope you ride this momentum to many monies friend. Best of luck!",
            "Never give up, never surrender!",
            "Where",
            "Congratulations! All that hard work paid off! I wish you all the best in whichever offer you choose to take!",
            "That's how it goes sometimes.",
            "We take those. Congrats!",
            "Congrats!",
            "Woot!  Well done!",
            "Congrats!",
            "congrats!"
        ]
    },
    {
        "post_id": "rkj43y",
        "author": "0olongCha",
        "title": "Is r/csMajors a prestigious subreddit?",
        "url": "https://www.reddit.com/r/csMajors/comments/rkj43y/is_rcsmajors_a_prestigious_subreddit/",
        "score": 506,
        "num_comments": 27,
        "created_utc": 1639991362.0,
        "selftext": "Everything about my life has been preordained for prestige. I go to a prestigious school (Southern Mississippi Technical College), have prestigious internships (Albertson's), live in a prestigious city (Chinatown, Mississippi), wear prestigious clothes, have a prestigious haircut and use prestigious words (wingardium leviosa).\n\nMy life has essentially been optimized for prestige. The issue is, I'm worried about being subbed to subreddit that isn't prestigious.\n\nI'm seriously not sure what to do here. Is r/csMajors prestigious enough? If not, can someone point me to a more prestigious subreddit? Thank you <3\n\nTC: too prestigious for you",
        "permalink": "/r/csMajors/comments/rkj43y/is_rcsmajors_a_prestigious_subreddit/",
        "comments": [
            "[deleted]",
            "Enough of this \"prestigious\" shitposts. I'm too prestigious to see all this shit.",
            "Hey! Albertson's is pretty cool!",
            "if you’re concerned about prestige you might want to try r/CSCareerQuestions",
            "Grind LeetCode",
            "Yes",
            "Well, I, myself, browse this subreddit, so, to answer your question, yes, it is prestigious!",
            "Sounds like your family line has been way ahead of you on prestige, seems like they have had an aversion to mixing the gene pool.",
            "Y’all are not funny bruh",
            "Is mayonnaise an intrument?",
            "prestigious!",
            "did you find the prestigious vaccine? \n\nif yes, which one?",
            "You should feel graced that someone as prestigious as I have even read your post.",
            "Why so Prestigious?",
            "You keep using that word... I do not think it means what you think it means.",
            "[deleted]",
            "Dumb ads here who graduated from a no name university with a 2.6 gpa. The amswer is no",
            "we are the absolute most prestigious of all the subreddits",
            "Too biased for a good response here, go ask Blind"
        ]
    },
    {
        "post_id": "ltgl0a",
        "author": "ss1st",
        "title": "Today I learned: No matter how well you did on your interview, there are tons of factors that are not in your control",
        "url": "https://www.reddit.com/r/csMajors/comments/ltgl0a/today_i_learned_no_matter_how_well_you_did_on/",
        "score": 508,
        "num_comments": 25,
        "created_utc": 1614401455.0,
        "selftext": "Long story short, I've been interviewing with a big company in AZ for an internship position for the last two weeks and today I just received the rejection. They had two video calls with me (all about solving technical problems) and I'm not flexing or anything but I gotta admit that those are the two interviews I really nailed in the best way that I've ever done. The interviewers told me they're impressed that I can finish the problems within only 20 minutes, and we spent the rest of time to chit chat about what projects that their company has been doing (they didn't even ask behavioral questions). I felt extremely confident after the calls and was 90% sure I would get the offer. But today I received the rejection, and the first time in my life, I emailed back to ask why I got rejected even though I completely nailed two interviews. They responded that it was a tough choice and since they had a great pool of candidates this time although they admitted that I did pretty well.\n\nI learned that performance is not the only factor that they'll consider you for the position. No matter how well you did on your interview, if there is another candidate that just does slightly better  (or more likeable) than you, you're screwed. What I mean is, there are tons of factors that are not in your control during interviews, and other candidates' performances is one of that. Lots of the time, interviewing is really a game of luck, so the more you try, the more likely you'll score what you need. If you don't try hard, you'll get nothing, and if you already think you've tried your best, and still didn't get what you wanted, that's life, but we have to keep moving on.",
        "permalink": "/r/csMajors/comments/ltgl0a/today_i_learned_no_matter_how_well_you_did_on/",
        "comments": [
            "Damn I feel sorry for you man. But it seems like you know how to handle these mentally tough situations. I think if you truly determined to get one, you will eventually get one at some point. We just need to keep moving forward. I am also actively seeking for jobs and I know exactly how that can feel (quite hinders the productivity of the rest of the day). Best of luck to you! 🍀🍀",
            "Rejection sucks, but just like Tinder the CS job game is all about numbers. Have had some FAANG interviews and have failed, but man its a ride and this last one I had more confidence because I have been coding \"in the industry\" for a year now. I caught a break with a start-up that took a shot on me. OP keep fighting, you will find your fit as well as I and man is it a ride!",
            "If you can stay consistent and perform like that all the time then there is a better chance you will eventually land something. \n\nKeep on trying, reflect on what good things you did and what you could've improved on. You'd be surprise, despite how amazing you felt you did, there is always something you could've done just a bit better.  Good luck on your future interviews!",
            "I got a trie question and a LC hard one interview and nailed both questions then didn't move on. It was technical only and I hadn't actually seen that trie question before. Crazy world out there, just keep trying!",
            "Same thing happened to me for one large company. I thought I nailed the interview. I think they only had 1 position open (for months too lmfao) in a small office and interviewed a large number of people, and someone else I guess was slightly better. It's all a learning experience and tbh I wouldn't change how I interviewed at all. Just gotta be patient",
            "Sad that you have to kiss ass to get anywhere in this world.",
            "I felt this. I got an interview with FB and studied all the right leetcode problems before so I really thought I nailed the interview, but still got rejected. I wasn’t able to ask for feedback, but the general consensus was that there was probably someone else who just finished faster than I did.",
            "You're luck you got a return email with feedback. That usually doesn't happen. Welcome to the real world.",
            "Hey this happened to me recently. I passed 3 interviews with this company and most of them were pretty good. Yesterday I got a rejection, saying that they chose a candidate that had more hands-on work experience. Like I'm sorry I have to start from somewhere?",
            "hey man, exact same situation. 6/7 on OA1, 2/2 on OA2, and aced the interview (AMAZON!). rejected for SDE internship. very upset by it, but somehow moved on (even though the portal changed on decision day). it is what it is i guess",
            "This last week I had a great interview, completed a coding challenge, and had a really good friend on the inside help get me that far, and I still didnt get the job. Really sucks, but what can you do?",
            "Hang in there bro.... I thought I did really well with a company that was just below Big-N. I was really excited, and I thought I finally made it (especially cuz i came from a no-name school), and next thing you know..... i receive a rejection email like a week later. Here's how I think of it.... I was so close to making it, that if I put in just a bit more effort and do a bit better next time, then I'll get that position. \n\nGood luck bud!",
            "Yep, that's unfortunately really how it is. I'm sorry you're going through this. I'm unfortunately in the same boat and open to practicing if you are, too. (I got told to try Pramp, but times I seleced no one was available so I just reach out to people in my network and book times with them and more mentors.)\n\nI definitely resonate with this as I've applied **700** places, and right about now approaching **70** interviews, and 0 offers. But I find with each interview, I saw that now with rejection it's just on from one company and onto the other, rather than stressing about how you could have done better about the previous, put that into time into preparing for the other. (I do vent about them extensively as some just stick with me because there are some companies, in particular, I really wanted but it's just onto the next at this rate.)\n\nI got that same it was a tough choice comment when I interviewed for a role where they said they had no more feedback, but had mentioned that they were looking for people with more experience whether from more internship opportunities or schooling. ...But I had **4** internship experiences relating to the role, am actively contributing to a paper on research pertaining to the field. I know that by no means guarantees an internship but if **4** internships isn't enough I really don't know what cuts it.\n\nLike recently I prepped a product interview at a place, and it was a phone screen, a technical take home, and seeing if you made finals. I made it past the phone screen which made me like **30** of **190** candidates, and then after the technical challenge it was **10** of us. I got told those details from a phone rejection that although I had all these qualifications that fit the bill, there was just someone else with slightly more experience. It's all about headcount honestly sometimes.\n\nI could go on about this because I honestly documented like **20** frustrating experiences by now that like strayed from a conventional interview where you just introduce yourself, and try to sell yourself in hopes that you land something, but the takeaways I got from my interviews is that people just want to see a person they can see themselves working with day to day, a culture fit. I know that word's been thrown around a million times but feedback I got from peers and mentors was that \"Oh, well if someone was with you for a long time, say the time waiting to board a flight, or another scenario, could they tolerate you?\"\n\nSorry for the ramble but I definitely resonate with your experiences as that has definitely been frustrating but oftentimes you get a generic feedback cause companies don't want to get sued and HR or hiring is often quiet on this.",
            "[deleted]",
            "I just went through something similar, but what can we do ? Just need get back up and keep trying.",
            "Yes this is super true I've gone through the same thing as you like 5 times. A lot of it comes down to luck at the end of the day which is why shotgunning applications is the best method.",
            "\"we have to keep moving on\". absolutely correct. That's all you can do. You'll be fine OP. Just keep killing interviews and you'll take your pick eventually.",
            "True I have had both experiences. Some where I thought I did great and received the rejection. Other time I did not even finish the problem and they moved me on to the next round. Yes, there are definitely many more factors. Keep it up guys! A rejection is a lesson."
        ]
    },
    {
        "post_id": "1bkw85b",
        "author": "Cool_Banana7352",
        "title": "Congratulations! You weren’t selected for this role!",
        "url": "https://www.reddit.com/r/csMajors/comments/1bkw85b/congratulations_you_werent_selected_for_this_role/",
        "score": 510,
        "num_comments": 62,
        "created_utc": 1711104040.0,
        "selftext": "Got to the final round interviews of some random company for a cloud engineering role and thought it went well. Two weeks later I get a phone call from the recruiter who started off with “is this a good time to speak” thought I had the offer in the bag and got hit with the generic rejection except over the phone???😭 idc I didn’t get the offer but to call me and tell me is hornswaggling",
        "permalink": "/r/csMajors/comments/1bkw85b/congratulations_you_werent_selected_for_this_role/",
        "comments": [
            "Bruh, that must be devastating. My condolences, brother.",
            "Rainforest did this to me lol. AFAIK some companies do rejection phone calls. I do appreciate the feedback but they could've just done it through email 😭",
            "Crap! Im about to have a similar call in about 2 hours :o. Thought I had it in the bag too till I saw this",
            "What relevant experience or stats do you have for cloud engineering btw? I have an internship in AWS and a long one for IT but not sure what else would help. Certs maybe?",
            "\"Is this a good time to speak\" doesn't sound good or bad though.",
            "Hurts bro, I feel you 😔. My family just filed bankruptcy this week.",
            "Bro i thought this was a Gmail notification!\n\nTill I remembered I already got all my rejections 😭😭",
            "these office jobs are something else I tell ya!",
            "Dude I was so close too, got into final interview round and I thought it went amazingly well, I got an email a few days ago that told me to fuck off. I’m so frustrated, angry, sad, ugh I felt like crying and punching the wall.",
            "Waaaay better than being ghosted / generic email imo, especially after 4 interviews.",
            "Congrats ☠️",
            "At least they called you dude, it means that you were probably one of their top choices.",
            "Yesterday a company emailed my bf after a very good round of interviews, made him wait for a week and then said “the other candidate moved forward with the offer”. They literally made my bf feel like a backup! This is extremely frustrating!",
            "Lool",
            "That's wild!",
            "I once had a scholarship send me a letter in the mail telling me that I was not selected. Before I opened I was so happy thinking I won. This type of thing is much better with a generic email that is clear and doesn't raise spirits of people honestly. Why waste our time to call  an applicant unless you want them for another role?",
            "Who cares. It’s just a job. You’ll be working soon and you will be like, man I got to do this for another 40 years?",
            "Better than ghosting you... I wish companies would have let me down verbally.",
            "Do you mind DMing me the company’s name? I’m currently in the process of interviewing for a very similar role and I’m afraid it might be the same company. Don’t want to get my hopes up. :(",
            "it's brutal right now, i get several rejection letters a day with how many applications i fill out. I would of flat out told them \"and you didn't think this would be better suited to an email?\"",
            "Calling just to reject is insane 💀",
            "Yea this is why I dropped my major as CS. The new world of CS is the biggest pile of shite since the first man to throw water over a fire pit",
            "Stories like these are why I was hella anxious when my recruiter sent me an email \\~1-2 weeks after the final round to schedule a Zoom call. Luckily, I got the offer, but they also could've just sent me an email. \n\nbtw, this was for a hardware role (I'm EE, not CS) but same idea",
            "I just got that response from Oracle last week lol.",
            "Sometimes you will get a call that you were selected and you get another call that the position is on hold. So, don’t celebrate until you get the offer letter or I should say the first paycheck",
            "Tesla recruiter scheduled a 30 min zoom call  after final round to tell me I’m rejected 🤡🤡🤡🤡"
        ]
    }
]