[
    {
        "post_id": "16co652",
        "author": "GaslightingGreenbean",
        "title": "Yohanes Kidane",
        "url": "https://www.reddit.com/r/csMajors/comments/16co652/yohanes_kidane/",
        "score": 504,
        "num_comments": 56,
        "created_utc": 1694115636.0,
        "selftext": "I’m in class fighting back tears rn. 22 years old, graduated from Cornell, software engineer at Netflix. I can’t imagine the suffering he was in to drive him to go through with what he did. \n\nThese mental health struggles are so real. I’ve been suffering from panic attacks, insomnia, and intense anxiety since the beginning of August. I have a job offer and possibly another on the way. These job offers mean nothing. The money means nothing. I’m not saying I’m at risk of anything, but I’m just emphasizing the importance of mental health. So many of us struggle in silence when we’re not alone.",
        "permalink": "/r/csMajors/comments/16co652/yohanes_kidane/",
        "comments": [
            "God bless his soul and his family",
            "Mental health challenges are serious, and our industry (especially in certain cutthroat companies) largely ignores them.\n\nIf you’re still in school, take advantage of the mental health services that are available to you as a student. They might be better than what you’ll find is available through your company benefits once you start working. Share your struggles and fears, and learn healthy ways of coping with the inevitable stress of starting a new job — before you are already in that situation.\n\nOnce you start a new job, find a mentor! The most important part of that relationship is feeling comfortable sharing all the things that are hard, scary, uncomfortable, etc. about your job. With that kind of vulnerability you will be able to get valuable feedback: Pointers on how to deal with difficult situations and people in the company, advice on which skills you need to consciously work on improving, and reality-checks to let you know when you’re wasting energy worrying about trivial matters.\n\nYour fellow engineers are generally good people, who want to help you succeed. Ask questions, learn from your mistakes, and be grateful for the help you receive (even when your code is getting torn apart in a code review).\n\nWe’re all in this together. Look for the people who realize that this is just a job, and there’s a lot more to life than work. They get it.",
            "RIP",
            "Since we're on reddit, don't forget one of it's [co-founders](https://en.wikipedia.org/wiki/Aaron_Swartz).",
            "It’s so hard to find something worth staying on this planet for. As a former suicidal person and someone who deals with depression, I have so much compassion for people that have actually gone through with it and of course people that are still fighting and suffering with it. You think you’re being completely rational and logical in your thinking but the depression just hijacks your very ability to think. Condolences to his family.",
            "It’s beyond shocking news. I’ve known Yohanes and his brother since my sophomore year and I’m a senior now. He’s such a kind person and made me feel present in the room when I talked to him. Performing at the top of his class seemed effortless to him. I’ve talked to him on multiple occasions throughout the years during school events but I never had the chance to get his number and he had 0 socials other than LinkedIn. I would have never thought he’d go out this way. I’m just left in confusion and I cherish all the few moments we had together, wishing I could see him again. Check up on your friends guys, you never know what they may be going through. My deepest condolences to his friends and family.",
            "this made me so sad man, rest in peace Yohanes, and I’m so sorry for his family’s loss, hopefully they’ll find peace and closure",
            "I am sorry but I am out of the loop.. Who is Yohanes Kidane?\n\nRegardless, his suffering has ended. RIP brother.",
            "What happened to him? May he RIP",
            "RIP.\n\nMaybe this will send some shockwaves in the CS industry that they're going too far with their interview process.\n\nI've already seen LinkedIn talk about it.",
            "Wow I remember they were sharing posts on LinkedIn about his disappearance. Rest in peace to yohanes",
            "I personally knew Yohanes pretty well. There are A LOT of different theories going out there where many people believe it's a cover up for a murder. Personally, I'm having a hard time believing the cause of death was suicide. Yohanes faced every challenge he had head on. He even challenged himself his final semester of his senior year to take some of the harder CS courses rather than taking it easy. I don't know what was going with Yohanes if there was something going on with him, and it's apparent that many of his family members are in the same boat. I don't know if something happened at Netflix, but ik Yohanes isn't one to step away from a challenge so easily. I can sit here and go thru a whole rabbit hole for weeks, but the bottom line here unfortunately is he is no longer with us. And that crap rly hurts to say, but those are the facts right now. As far as his cause of death, I have to believe what the police and the coroner's office are saying. It's possible they could be wrong, but regardless, I lost one of my good friends.",
            "May he RIP.",
            "Hey man. Was in the same place. I started meditating and I have never been happier in my life. You should def give it a try",
            "I had a really good job at a FAANG company, but my mental health was struggling and was going through a divorce. Ended up coming back to my home country to be with my family. I’m burning through my savings but my mental health is finally stabilizing. As you said, when you are not healthy money and success mean nothing, I miss some little things and comfort of having a really well paid job, but the time spent with loved ones is way more important.\nBottom line, don’t sacrifice your health for a job, not worth it",
            "It's a long shot, but does anyone have traces of him on Reddit? Would be helpful to learn of the breadcrumbs he might have left on here that possibly led to his suicide.",
            "That’s sad. Bright young man with a future ahead of him. I wonder why he committed suicide? Dude is making boat load of money and such a successful career for someone who just graduated.  I’m probably thinking work related  stress prob got to him?",
            "Bro, an offer from Netflix is CRAZY. The struggle is done, and you gone live a life you worked your ass off for - hats off to you man.",
            "Is this person habesha?"
        ]
    },
    {
        "post_id": "1bfybqo",
        "author": "nicotinepercocet",
        "title": "is 35/hr good",
        "url": "https://www.reddit.com/r/csMajors/comments/1bfybqo/is_35hr_good/",
        "score": 508,
        "num_comments": 166,
        "created_utc": 1710564933.0,
        "selftext": "i just got my first offer today, 35/hr. it’ll be going straight to savings since it’s in my home city and i’ll be chilling at my parents house 🙏🏼",
        "permalink": "/r/csMajors/comments/1bfybqo/is_35hr_good/",
        "comments": [
            "It’s better than $0/hr which is probably your next best option so take it",
            "Yes bro I had 30/hr and had like 10k saved up by the end of the summer. Was awesome",
            "Fuck yeah bro",
            "35/hr > 0/hr, W",
            "Solid wage and living at home stacking that is going to be insane. Congrats on your offer!",
            "In your home city living with parents 35/hr is 6 figures my boy, good shit congradulations",
            "Horrible. That's only 5x the national minimum wage",
            "You’re in a great spot! Don’t let anyone tell you otherwise.",
            "That is above median and average in the country. 35 * 40 * 52. Good for a first job unless you live in HCOL.",
            "Better than 16hr working at a super market",
            "Definitely good.  Much better than being unemployed",
            "Since ur living with ur parents then it’s basically free money so def take it, in general tho it usually depends on COL, so I'd say $35 is great in lcol areas, decent in mcol (dc, atlanta, etc.) and meh at hcol (nyc, sf, bay)",
            "That's a decent wage but the real value is in entering the industry and getting experience, that will pay off dividends ",
            "Not terrible for entry level, but it’s only 70k/year, celebrate your achievement, but keep working on getting better and better compensation",
            "Dude that's alot of fucking money",
            "35/hr is very much decent for an internship. Much higher than a lot of well known companies. Congrats",
            "Yeah this is very good based on what you're saying. I would love to find one locally, so I can stay with my parents and save everything lol. That's why I'm looking locally, and applying for anything. Even if you get lik 60-70k that's better since you can save everything.",
            "30/hr while not paying rent and filing taxes as a dependent is a lot of money",
            "Make that money",
            "really good start id say. I was around the same and my internship was 22/hr so it felt like alot compared to that",
            "Thats solid pay man, had an internship pay around that and the money I saved carried me through 2 semesters. Good shit bro 😤!!!!!",
            "Congrats!! Go celebrate 🙌 🎉",
            "Bro you gotta start somewhere ..",
            "Living at home that’s gonna stack up like legos. Congrats",
            "me getting paid 14/hr for an internship 🤯",
            "Yes. That's the hourly equivalent of a $65-70k full time job.\n\nidk if you are talking about a full time position, but that's definitely a good starting salary regardless of the hours",
            "bro this post made me wanna do the math for my summer internship and its 16.25 the hour LMAOOO",
            "can't help but think you're just looking for an ego boost.",
            "Lol I'm making 20 an hour in the US working as the only front end web dev of an e-commerce site...\n\nI'd die for 35 an hour right now",
            "Yes thats amazing dude",
            "It's decent, go for it!",
            "Saving a bunch rly gives you a head start when you move out",
            "Keep in mind that it is per hour so if you work overtime you get paid more!!\nMost of the full time jobs give you salary and you often end up working more than 40 hours a week for no extra money. All jobs should be per hour.",
            "35/hour is great pay!",
            "Yes especially if you’re living with parents, save that shit and gain some experience",
            "35 hr paying no rent = you’re chillin",
            "To figure out annual wages from hourly double the number and make it thousands. 35/hr at 40 hours a week is 70k",
            "Great start.",
            "72k and no rent? A fucking no-brainer",
            "Congrats! Im 24 and in the same boat as you. 35 an hour living with parents till I got my down payment for a place. I manage to save about 10k every 3 months, hoping to break into the market early next year.",
            "That’s about $70k/yr if you’re working full time, which is average for an entry-level software engineer in the US.",
            "35 /hr and no rent? Hell yeah",
            "Bruh for an internship or for a job? But still, decent.",
            "Early experience is going to pay huge dividends later, and that's not terrible anyway.",
            "it is",
            "Yes, it’s good for an internship",
            "Just negotiate for higher and if they decline, take it, that’s what I’d do atleast",
            "I mean I'd take an unpaid internship atp, I just need that first job lmao",
            "Are you going to not take it if we say no? No one understands your financial situation or career interest better than yourself. If you are tight on money and don’t enjoy the work as much, take it and keep looking for the next gig. If it is something you enjoy doing, great, earn some experience and ask for a big raise in your next gig. Simple as that.\n\nI will probably get downvoted for this. But OP is a grownup and should be able to make judgement themselves.",
            "It depends on your alternatives. If someone paid me 35/hr to perform brain surgery, that would be amazing since I'm not a brain surgeon.",
            "that’s about 3 times what a Subway employee makes",
            "Consider your retirement saving, since you are young, can start buying index ETF(s&p, Nasdaq) and it should help out-pacing inflation in the long run.",
            "Same pay but have to relocate to HCOL. In pain. But better than nothing",
            "No bro it’s please decline and give it to us plebs",
            "Depends on where you live.  Paying new york rent not so much.  Paying west VA rent, you have it made.",
            "40hr a week with 52 weeks a year. You are making 72800 yearly. Not the best but with the market now, not the worst.",
            "practice squalid offer wrench soup historical bear roll spectacular tart\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I would say yes. You’ll be getting work experience on your resume so even if you aren’t currently satisfied with that wage, it’s only up from here.",
            "Definitely a first great offer, mine is 30/hr and for the most part it's better than 0 for sure",
            "that’s very good",
            "Depends of location but for anything remote - yes.",
            "That’s what I’m getting, I don’t think it’s enough to move out but if you’re living at home it’s plenty imo",
            "Is the Earth a planet???",
            "Thats solid! What state is the position in? Obviously its a higher or lower percentile depending on location.",
            "No",
            "These comments must've forget prices change where you live/want to go. \n\nIf you go move to san fran right after and you submit that as your yearly income, you'll qualify for food stamps, be classified as low income, get medical, get SNAP, and struggle to make basic ends meet. If you go to the middle of nowhere in America, you'll be living really good.  \n\nI say this because if you're in san fran area and living with your parents AND want to eventually move out but still be in san fran area, look to see on [levels.fyi](https://levels.fyi) if the hourly rate goes up for full time. Otherwise look for other internships which pay more or the pay goes up for full time.",
            "I have an offer to be a full time coding instructor for $35/hr as a community college student on the verge of transferring, if this is what tech is paying should I not transfer and start my career in education?",
            "decent/really good for an internship. I would say a majority are within the 20-30 range. With only a handful (like faang) that push to 50-100.\n\nYou are above the majority of people who have offers, but not faang level.",
            "Is it’s not at least $120/hr, ur being scammed"
        ]
    },
    {
        "post_id": "187p7rt",
        "author": "sqdcn",
        "title": "My job search as a data engineer in HFT (2.5 YoE and H1b)",
        "url": "https://i.redd.it/vgntdimg1j3c1.png",
        "score": 509,
        "num_comments": 71,
        "created_utc": 1701368406.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/187p7rt/my_job_search_as_a_data_engineer_in_hft_25_yoe/",
        "comments": [
            "Wait headhunter reached out to you and after you applied, you didn’t get a response?",
            "Graduated from pResTiGiOuS public uni with good engineering program. 2.5 YoE in HFT. The whole process took me about 2 months. I only applied to HFT/hedge funds that have openings in my city. I also require sponsorship so that sucks a little :-( Happy to answer any question.",
            "I assume your work is mostly streaming jobs, Please can you give us an idea of the tech stack you use as a DE with 2yoe?",
            "Did you go straight into hft after grad?",
            "it looks like a lil dude leaning back and jacking it",
            "How did you manage to get the H1B tell meee pls",
            "Currently a DE at a non-hft hedge fund doing mostly batch work. My experience when interviewing at HFTs was that they expected knowledge of C++ and a strong understanding of Linux and multi-threading - even for DEs. I didn’t stand a chance in those interviews since I almost exclusively use Python and SQL. Is that similar to your experience?",
            "TC?",
            "Okay seriously, HOW DO YOU GUYS GENERATE THIS CHART PLS TEACH ME",
            "Do you have any tips for Data Engineer technical interviews at these firms, as well as experience in building data pipelines specifically for financial data? For example what is your usual tech stacks for a data pipeline, what considerations do you have to make when building pipelines for financial data, do you use SQL or noSQL more? \n\nI have an upcoming final round with a hedge fund for DE position but I’m transitioning from MLE. Thanks!",
            "Any advice to transition into DE? I work as a Data Analyst.",
            "I’ve applied to over 200 software engineering jobs here in CA and have only heard back from about 10% of them. And of those, were mostly rejections.",
            "That's an enviable funnel..congrats man!",
            "how did you count the number of applications you sent? I’ve always wondered how people did that",
            "only applied to 15?? lol"
        ]
    },
    {
        "post_id": "sh37vd",
        "author": "400KOrSuicide",
        "title": "I'm going to come back and visit this post in 2 years",
        "url": "https://www.reddit.com/r/csMajors/comments/sh37vd/im_going_to_come_back_and_visit_this_post_in_2/",
        "score": 507,
        "num_comments": 336,
        "created_utc": 1643641304.0,
        "selftext": "I should have received an offer for at least $400K.",
        "permalink": "/r/csMajors/comments/sh37vd/im_going_to_come_back_and_visit_this_post_in_2/",
        "comments": [
            "Uh, Username checks out ig? Lmao",
            "!RemindMe 2 years",
            "RIP",
            "[deleted]",
            "!RemindMe 2 years",
            "I’m also intrigued where I’ll be at in 2 years. See you soon OP\n\n!RemindMe 2 years\n\nEdit: 2 years later working at FAANG, pretty happy",
            "Me too bro. \n\nMake a one year update tho",
            "!RemindMe 2 years",
            "F",
            "If I was making 35k a month. Man, the free time I’d have. I’d be able to setup a cool electronics shop and invite my friends to chill, and we’d all learn electronics and software and hang out, and maybe build a platform to help spread free devices and teach kids in third world countries. I could at least partially fund a free community school  for kids and adults to access PC terminals to get a free education and online job training. I want to see people in third world countries get the knowledge and resources to build up their infrastructure. I saw a few videos of how people are living in rural areas in India. It’s like a mix between living in the wilderness and having very small windows of electricity usage, and poor plumbing and stuff in general. And the kids have old beaten books and old Windows 98 PC’s. It’s sad, and I wish the literally millions of millionaires and thousands of billionaires in America, and around the world, would help them. It wouldn’t even be a drop in a bucket. But me, a single person making 400k a year, I could fund some part of it myself. To think that there are millions of millionaires and thousands of billionaires who just don’t even want to.",
            "did you get ?",
            "So how did it go\n\nEdit: oh looks like he deleted the account.",
            "OP, did you get the offer? Here two years later.",
            "Alright pal what happened I’ve been waiting 2 years",
            "lets goooo !RemindMe 2 years",
            "Thats the only way OP. All or nothing.\n\n!RemindMe 2 years",
            "we will have to make a conclusion if you don't",
            "It’s SO over",
            "Well?",
            "Hi",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!Remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!Remind me 2 years",
            "!Remind me 1 year",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Should have?",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "I wanna know where I'll be at in 2 years too! \n\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!Remindme 2 years",
            "RemindMe! 2 years",
            "Lessgoo!!!\n\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!remindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "RIP in advance OP",
            "!RemindMe 2 years u/400KOrSuicide",
            "Good god",
            "A_Post_To_Remember!",
            "I will return to this thread in 3 years. I will be happy if I get a 75k salary.",
            "Can you do liveleak?",
            "im back",
            "I'm so far off dude...",
            "Yooooo, how is everything progressing",
            "Alright bro, what happened ?",
            "So?",
            "Here you go bro.",
            "Did you receive an offer for at least $400k? u/400kOrSuicide",
            "Hey guys anyone remember this post?",
            "Did you get that offer?",
            "Hi we’re back and waiting",
            "so what’s up?",
            "I should have received at least one offer from the US. !RemindMe 2 years",
            "Goal next 2 years: finish college and get a Php100k/month job\n\n!remindme 2 years",
            "jesus christ OP are you ok? get off this sub and talk to a therapist pls",
            "Btw, money doesn’t buy happiness",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "RemindMe! 2 years",
            "!RemindMe 2 years",
            "1RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "RemindMe! Two Years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Oh shit this a lot of pressure to put on yourself",
            "Same",
            "Why 400k?",
            "RemindMe! 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "What’s the over under on op living?",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!Remind me 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "I also want to see what my offer looks like in 2 years\n\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "What's your plan king\nI'm in a similar boat (although content with $200k and not as severe consequences)\n\nIf you wanna start a leetcode study group I'm down",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 1 year\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "And here i am hoping for $120K in 5 years, teach me your ways sensei",
            "!remindme 2 years",
            "!Remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "i wonder where we all will be in 2 years\n!remindme 2 years",
            "!remindme 2 years",
            "!remindMe 2 years Still like Hololive?",
            "!remindme 2 years",
            "$1000,000 in 2 years from now. Remind me.",
            "I respect this energy",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!Remindme 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "Cue hyperinflation",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "i hope i’d have made it out of highschool lmao\n!RemindMe 2 years",
            "!RemindMe 2 years",
            "Are we all coming back here in 2 years? XD",
            "!RemindMe 2 years\nCurrent status: In flight to LA\nPlan: Study for interviews/grind LC",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years\n\nBless you hahaha",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Something tells me that you’re looking for an excuse to die",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Likewise. \n\n!RemindMe 2 years",
            "! RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "400kANDSuicide here,\n\njust wanna leave something behind for my ~~friends and~~ family before i go.\n\nalso i’m not lasting a whole 2 years.\n\nthis needs to happen before the end of march.\n\nedit: forgot i don’t have friends for a sec",
            "!RemindMe 2 years",
            "!RemindMe 2 Years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Me too. I am not making enough, thanks mate ✅",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!remindme 2 years",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "Would love to check my growth too, !RemindMe 2 years",
            "!RemindMe 720 days",
            "!remindme 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "!RemindMe 2 years",
            "money wer",
            "I dont think bro is with us anymore"
        ]
    },
    {
        "post_id": "q42pm8",
        "author": "SiciliaDraco",
        "title": "Me: Studies graph theory, dynamic programming, Blind 75, Grokking The Coding Interview, Leetcode Tagged Questions....",
        "url": "https://www.reddit.com/r/csMajors/comments/q42pm8/me_studies_graph_theory_dynamic_programming_blind/",
        "score": 502,
        "num_comments": 63,
        "created_utc": 1633714731.0,
        "selftext": "Thomson Reuters Final Round: Reverse a string. \n\nThey really  sent 2 senior engineers to watch me reverse a string LMAO",
        "permalink": "/r/csMajors/comments/q42pm8/me_studies_graph_theory_dynamic_programming_blind/",
        "comments": [
            "[::-1]",
            "What solution did you give them? I'm kinda curious what they expected.",
            "[deleted]",
            "This hits so close to home. Except, i chocked like a high school kid asking out the lead cheerleader.",
            "Those fuckers made me sit through a 6 hour final round last year with no breaks and then took 4 weeks to get back to me on a decision",
            "Can you handle an easy question when there’s a lot of pressure?",
            "Was this for summer internship? I couldn’t find the internship position on Thomson Reuters.",
            "Oh wow! I am happy for you!🥲 you got the offer?",
            "Thomson Reuters: Congrats, you're hired!\nMe: Meh.. not part of my syllabus this time. 🤷‍♂️😂",
            "Lord, I have seen what you have done for others...",
            "senior engineer: *damn he’s good..*",
            "How was the OA for Thomson Reuters, if you don't mind me asking?",
            "That must have been a really nice string",
            "plz update if u get the job",
            "Same sort of thing happened to me for a different company lmfao got an easy array question except I fucking CHOKED",
            "Maybe your application was just so good you didn't need to prove anything."
        ]
    },
    {
        "post_id": "167r2fa",
        "author": "Pumpkinut",
        "title": "Are the future cs grads fucked?",
        "url": "https://www.reddit.com/r/csMajors/comments/167r2fa/are_the_future_cs_grads_fucked/",
        "score": 503,
        "num_comments": 417,
        "created_utc": 1693623404.0,
        "selftext": "If you have been scrolling on the r/csMajors you probably have stumbled upon hundreds of people complaining they can’t get a job. These people sometimes are people who go to top schools, get top grades, get so many internships and other things you can’t imagine. Yet these people haven’t been able to apply to tech companies. A few years ago tech companies would kill to hire grads but now in 2023 the job market is so brutal, it’s only going to get worse as more and more people are studying cs and its not like the companies grow more space for employees. At this point I’m honestly considering another major, like because these people are geniuses and they are struggling so bad to find a job, how the fuck am I suppose to compete with them? So my question, are the future grads fucked?",
        "permalink": "/r/csMajors/comments/167r2fa/are_the_future_cs_grads_fucked/",
        "comments": [
            "Imma keep it real with you, it doesn't look good lol. At my college, CS has become the #1 major for the most recent class of 2027. It's blown up way too much",
            "This is my 5th and final year as a CS/Math double major at a no-name school. Been on this sub for 3+ years now.\n\nThe complaining and job search was always a problem. More so recently, but it's just a bigger version of an existing problem for new grads. Hopefully it gets better, but if not, it would've been the same fundament problem whether you graduated 5 years ago or 5 years from now. \n\nWhen I graduate this spring, I'm just focusing on three things:\n\n1. Send lots of job applications. Cast a wide net and eventually you'll catch something given enough time.\n\n2. Get through the filter. If a human can't see my resume, it won't get accepted. \n\n3. The rare chance an interview is landed, don't waste it. I'm good at communicating and know my shit so as long as I give my all, I've done all that is in my power. \n\nUntil then, I'm just trying to finish my classes, improve my resume projects, and seeing if I can get a spring internship in addition to my current no-name internship. Also just enjoying college before I finish it to work a job for the rest of my life.",
            "Bro, do yourself a favor and stop listening to what redditors have to say. There are also people on those forums that claim doing the freebootcamp.com certification alone landed them a 6 figure tech industry job, there are people on there that say they're struggling finding a job in CS after graduating with a BS, there are people who went into Analytics/data science who claim its a major with lots of opportunities and good money, and in the next post a CS major who says Analytics/data science is a horrible major and can't compare to CS even though they haven't graduated yet. \n\nThe truth is, its really about who you know and the connection you make in school. I'm a bus and Econ Anlytics major with a minor in CS, I go to school and try my hardest to make connections, join data analytics and business clubs, show up to meetings, and make an effort to meet people. I've landed a couple summer internships (granted nothing impressive like Google or Twitter) and met a lot of people in the banking and corporate world. \n\nIn the mean time I know CS majors who don't like being social, who don't like putting themselves out there, who don't apply for anything that isn't a FAANG internship. \n\nYou want my genuine, college junior advice? Go into CS, major in it, MEET PEOPLE WHO ARE IN THE INDUSTRY, go to fun clubs like video game club or whatever, BUT also go into business related clubs for the purpose of meeting people. If your school has a computer science related club that is more oriented towards meeting engineers and programmers in the actual industry,  go to those. Put yourself out there, don't be like 90% of the CS majors who don't make connections and think the degree alone is going to land them a 6 figure job at a FAANG.\n\nBut then again I'm a redditor so listen to me, don't listen to me.",
            "Congrats, you’ve found out that people on Reddit like to whine and complain. Computers are only going to become more important in the future",
            "Shit better clear up in 3 years.",
            "this sub is literally nothing more than unicorn cs proteges flexing faang internships and jobs, and everyone else blackpilling that they are never gonna make it because they only keeping aiming for the highest denominator",
            "No future CS grads will be fine, by then the Fed will lower rates and the market will probably recover. Current CS grads (me 😂) on the other hand are fucked.",
            "Isnt this just the american hire and fire cycle? The economy slowed down a bit and they are now in a fire economy. Soon they will be in a hire economic situation again.  Overall digitalization is needed in so many parts of the economy that cs grads are probably never fucked.",
            "CS Majors all expecting to become multi-millionaires within a month of graduating are f*cked yes definitely. But CS has so many routes outside of tech for you that you're unlikely to struggle for a job in a general sense. If you're the bottom 80% of tech grads you're a top 10% in many other industries on skills alone IF you're smart enough to market yourself.",
            "When interest rates subside, things should improve.\n\nThere also seems to be a direct correlation to a lot of the bitching being from international students having trouble getting visa's, as well. That is a completely different issue in this economic environment.\n\nOr instead of another major, learn a useful trade and forego the high debt. Electricians and Plumbers can do really well.",
            "Hiring surged and companies expanded their investment in tech during the pandemic. Now they are contracting and putting hiring on hold, so hiring is back to pre-pandemic levels.\n\nThe US Dept of Labor statistics say CS is still one of the fastest growing fields growing 15% more between 2021 and 2031. As boomers retire and more things use computers they’ll need more CS people.\n\nhttps://www.bls.gov/ooh/computer-and-information-technology/home.htm#:~:text=Overall%20employment%20in%20computer%20and,new%20jobs%20over%20the%20decade.\n\nSoftware developers in particular will grow 25%.\nhttps://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm\n\nIt’s a dip now, but holy hell it’s not doom and gloom.",
            "The market is pretty intense right now. I just finished interviewing candidates for a position and the quality of candidate was far superior to when I was interviewing for the same role last year. We had to reject multiple qualified candidates who would've otherwise gotten the position in a different market.",
            "Do something to SHOW you're good. When we hire a graduate all we have are grades, and that. The grades have to be good but we also have something more, AND you have to be a social fit for our team.\n\nIf I don't have that something extra, you're immediately at a disadvantage. We need people who don't just do programming to get a job, but people who're passionste enough that they do it on their own time.\n\nThe grades have to be 'good enough', but not necessarily stellar. The other two will determine how attractive it is to hire you. Fail any of them, and you won't get hired.\n\nThat's our process. We know it works. We haven't gotten a dud in years following it. Other companies will have their own process.",
            "Yes. The market is oversaturated at this point. \n\nOn top of that I feel like businesses are not willing to gamble on junior devs working remote. For whatever reason, juniors struggle a lot more with wfh. \n\nPlus chatGPT is actually amazing at solving the low level stuff a junior would normally handle.\n\nNot looking good imo.",
            "I haven't even finished my degree yet and I'm employed making good money. Not FAANG level stuff but enough to pay bills, have a little fun, and put plenty towards retirement. I don't attend a top school and I don't have top grades. Things are different yes, but our (American) entire economy is different than what it was just a year and a half ago. These companies tried to scoop people up as fast as they could because their companies were scaling during covid and they were getting dirt cheap cash from investors. Things are correcting. \n\nAnother thing, if I say anything here it's only a comment. I don't post about the job market because I don't care. I'm busy working hard to make stuff happen. If you want to switch majors because you thought development was an easy six figures but are scared because now you have to put in some work, then go ahead and switch majors. But if this is a field you believe in and want to pursue it, then stay the path. There will always be someone smarter than you. It's like worrying about how rich someone else is or how buff they are. On all 3 accounts, comparison is the thief of joy. And you should focus on your yesterday self more than the other person. If your yesterday self looks identical to you today without a single tiny shift. That's when you should be scared.",
            "Welcome to classic pump and dump of how retail behaves. Everyone joins in a frenzy at the peak.\n\nIt's definitely going to take some time for the effects to cascade and the younger generation to realize the truth about the job market.\n\nAnd yes, in the near future, future CS grads are probably extremely f-ed. I'm presuming it would take like 8 years for the next generation to realize the effects of all this wave of CS grads. And probably 3~4 more years for the job market to truly cleanse out and also get out of a recession (as recessions tend to come once a decade).",
            "from what i've seen & heard, companies are more interested in seeing candidates who aren't just pure CS (and can also align with leaders on their big brain strategy goals), but then again my thing is cyber and most of yall are doing software engineering which is quite literally pure CS",
            "For a few years they will be. This is the unfortunate downside of graduating into a recession (not recession officially but let's be real). You'll get through it if you want to get through it.",
            "CS field is over saturated right now. That and AI on the rise is going to make hiring people in that field a bit harder.",
            "You are competing with bootcamp grads, todo-lists, calculators, cs grads, and people who think they will make 100k after three months of learning HTML and CSS",
            "From what I’ve observed not really. I have a little under 100 connections (ofc this is my anecdotal experience) and I see a lot of them either getting defense, tech, or bank internships. If it’s not my direct connections then it’s them reposting their direct connections at these places for the summer. I know a few people alone who got Lockheed, Google PM, Bloomberg, Netflix SWE, C1, Wells Fargo, Amazon, startups and more. Only Amazon and startup were from targets. Rest from complete non targets never heard of.\n\nMe and my classmate both from CC have fellowships under faangmula and I’m just entering sophomore year so I know theirs many more opportunities out there. Just gotta be persistent.",
            "It is a market cycle.  There was a big downturn in 1988, another around 2000, then the great recession of 2008.  It will get better after a while, then it will all come blazing down again.  Software is still eating the world.",
            "Tech market is not like 10 years ago.\n\nThe market is over saturated now with entry level wannabes. In the US it’s worse because all of the international students coming to get master degrees to compete for entry level positions.\n\nI think in the next 5 years salaries will drop below $100k in average.",
            "CS is trendy. But I would say all bachelors are saturated",
            "Omg.  All these doom and gloom posts about CS majors.  Y’all are really doing too much. \nIf you have unrealistic expectations you will be let down when still unemployed after applying only to the Googles of the world and being rejected. \nSome of you also don’t know that the ATS has a lot to do with whether your resume even makes it to the hiring manager. Your resume could be the underlying problem. \nAlso, it seems like all of this is coming only from those looking to be programmers.  Y’all gotta chill out.  Every company relies programmers somehow and the more technically advanced we get, the more we need these programmers.  Where do you think these jobs are going?\nFor those saying that the market is becoming over saturated, look at CS majors like doctors.  A doctor has a specialty and so do those in CS.  Everyone graduating is not becoming a programmer so rest easy.  \nNobody knows what the future looks like but damn, y’all are painting doom and gloom with every other post.  I know you are thinkers so come up with solutions to your problems.",
            "Its the same with engineering, which is what my major is. I think competition has just gone up for stem majors. It is clearly an **employer's market.** You could switch majors if you hate CS but any stem major will probably have a lot of competition, and non stem majors of course usually don't pay as much.  \n\n\nMy prediction for the future is that entrepreneurship could rise. If there is a higher supply of workers and low demand by tech companies, Then new companies have a large pool to pull from.",
            "I would say no, but the days of 250k a year to attend standups only to ship a new shaped button every 6 months are probably over for at least a little while. Twitter proved that most FAANG level companies can cut 50% or more of their developers and nothing would change for their customers and users.\n\nThere is a lot of real work that needs to be done in software, its just not happening at companies who prioritize dorm style lounges and buffets over producing good software and letting good programmers build better products.",
            "I don’t think so. I hear you but the job market has always been tough for grads. \n\nLike all things your best shot is to start small or come up with your own business.\n\nThere’s a lot of roles that the old guard will never lower themselves or their salaries to take no matter how desperate they are. But for a new grad it’s not so important. \n\nIt may be harder to hit those stratospheric 6 figure salaries from here on in. But you never know.",
            "I remember back in 2017 one of my friends applied to like 5 or 6 intern positions and got 2 offers. Those 2 offers were Google and Facebook.\n\nIn 2020, I applied to 300-400 and got 0 interviews. I think covid messed everything up",
            "grads are geniuses. haha. experience > everything in cs. There is a flood of bad people who are not in it because they love the job and it's making everyone look bad. so now more than ever they prefer people who already did it for a while over people who want to do it because of the money",
            "r/csMajors experiences normal market conditions instead of a hyper-bull run:",
            "I don’t really see people’s logic that the industry “has to recover” in the next few years. There is massive and growing supply of new grads, the pace of people trying to get into the industry is far outpacing the number of roles available, even for mid level/senior positions. \n\nMy SAAS company is over 2k people and hasn’t hired any engineers for the last few months and there hasn’t been much difference even though our user base is growing. I feel like this could be in part to a lot of the developments and improvements with different languages, tools, and cloud infra. When we were hiring we received many resumes and a SIGNIFICANT amount of the engineers were very qualified. \n\nNot to say that we won’t need IT/SWE’s in the future, but it’s a field that is constantly advancing so people can do more with less. I love my job and genuinely hope I’m wrong, but being in the industry for a few years and talking to older engineers/managers who went through 2008, I really think this is more of a shift in the industry instead of just another recession. We just have way too many people entering the field in comparison to jobs available, a lot more then 2000/2008. Even if rates drop and the economy goes full force, there’s still way too much supply.",
            "I'll be straight with you.\n\nIf it were me, and I was back in school and early enough to switch, I probably would. That's not just because of the job market though. A big part of it is I basically ignored my mental health in school. And it culminated to this event after graduating, where I had a severe mental episode and basically lost myself. Between that and the heavy medication I am on, matched with the disillusionment as I entered the market, it really tested me to see if I was really *into* tech. And tbh, I'm not really that into it anymore. Its weird because in school I was all about it, really enjoyed programming and making things, loved my classes, etc. But now, idk it just feels like I'm someone else. My interest has changed, my mind doesn't work the same as it used to, i'm not sharp enough for it now tbh.\n\nEnough about me though, let's think together here. If you were going to switch majors, what would you choose? Get a game plan together. Look at jobs for that major and see what 'competitive' looks like in the market for a new grad. Is it reasonable? Are you willing to do that? Talk to other people from that major, see how it really is. Ask them about their job search, how's it going? Just do your research before making the switch.\n\nAlso do some introspection, why are you majoring in comp sci? what do you want to do? where do you see yourself in the workplace? what does your ideal responsibilities look like?  does the major make sense with what you want to do? etc.\n\nLastly, just a little side note here, mental health is extremely important! Take care of yourself OP!",
            "This sub is really something else sometimes\n\nAs a new grad who’s been working as an SWE, you will be fine. The median new grad salary for cs is still vastly higher than the median new graduate salary. The demand for software engineers is only increasing. Most applicants for new roles aren’t qualified and make filtering very difficult. Once you get your first entry level job you’re chilling.\n\nAlso don’t forget that our material conditions are getting worse because of the wealth gap and the approach of late stage capitalism. These economic struggles are not a tech sector issue, but a system issue.",
            "It's totally fucked",
            "No, future cs grads are not fucked. There are plenty of jobs out there, you just have to lower your standards/expectations and make the most of your career fair. Lots of local or relatively unknown companies that pay 6 figures exist, you just have to go out and find them. If you want a big tech experience, you are going to need big tech work ethic.",
            "If you truly have a passion for CS then go for it, nothing will stop you if you work hard. Otherwise if you just pick a major looking at job prospects, the market is brutal now. There are Dec 2022 graduates waiting, then May 2023 grads, Summer grads and now Dec grads lol. On top of that the layoff and experienced folks too.\n\nIf you wanna change major, I would say maybe Supply Chain. Every Supply Chain majors that I knew got a decent $70-80k job right after college before graduation. It's upto you though.",
            "Yeah market is rough. Im a Stanford Uni new grad and was rejected by 96% of applications I sent out. I recall sending 500 apps and ended up receiving an offer at a lesser known fintech company for 200k TC.  Fyi, I have 2 swe internships at FAANG.",
            "Nope you just lost the priviliege you had on the job market and have to struggle like most majors now. Sorry, it sucks. It will get better for you in a few years, you just spawned on the wrong part of the market's cycle.",
            "Yes boyo it’s over if you’re not at T10",
            "Where does this paragraph rank all time?",
            "I think most of it boils down to unrealistic expectations. It’s never been easy to find a software engineering job as a new grad. The more experience you have the easier it gets. Take a quick look at how many job postings there are for senior engineers (hint: a lot). On top of that there’s sooo many different areas you can specialize in within the field.",
            "In short, yes. I luckily found and have a job post-grad, but know people who are still looking. I recommend not focusing on FAANG, big tech, etc. if you are, there are more important matters in the job hunt rn (granted I think FAANG specifically is overrated and a social construct, but won’t go down that rabbit hole…).",
            "Going to be a lot more freelance entrepreneurs than anything else .. might need to start low and work up doing something different in a bigger company if they wanna go that route instead",
            "Let the complainers complain, just increases the likelihood of quitters clearing the way for people who are actually serious about their career.",
            "Yes absolutely. They see 1000 other threads with the same topic and then continue to make the 1001 thread. All hope is lost for the future generations.",
            "No, the ones that did it just because they assumed it was easy/good, money are completely fucked. That accounts for the 75% of faang code monkeys in this sub.",
            "Less so than other majors. Every career field has gotten harder and harder to find jobs in. There's a reason why SO many people graduate and go into customer service gigs - a lot of these people also had internships, good grades, and extracurriculars! \n\nI don't know of any majors with new grads that AREN'T struggling. It's going to suck for the next couple years for new grads, but it'll even out for STEM majors like it always does. \n\nDon't be discouraged if you aren't in a job right out of undergrad. New grad positions and internships are open for a couple years after graduation for a reason.\n\nKeep applying, get your resume reviewed, do a leetcode question a day, work on some side-project, etc. A couple hours a week on tutorials in a relevant technology you're interested in is all you need for side-projects! It's not easy to do all this AND apply for jobs, especially during post-graduation burnout recovery.  Do what you can with the time/energy/resources you have and you'll land a job.",
            "Most of you have no ambition. you just do your degree and maybe an internship and think that makes you worth hiring. you have FOUR. YEARS. of a degree. you can do dozens of projects, research, publish papers, start your own side business, make connections, network, etc.",
            "[deleted]",
            "Haha! Joke's on you, I pivoted from studying cs to study polisci ( don't worry I'm prepared to keep earning minimum wage on my current job for the rest of my life)",
            "please take another major, thank you",
            "Only the strongesssttttt willll surviiiive 💪",
            "TikTok ruined CS like it has ruined so many other things like Costco and Trader Joe's.",
            "CS is literally the degree of the future. Computing is what turns our world now, nothing else is nearly as important. Every industry would crumble at its current scale without software. Everything is competetive, not just software engineerig. Think abt med school applications, IB, consulting, law internships/ law school. Nothing is easy.",
            "Let me offer a different perspective. Most of the people who complain about not being able to find work at all seem to also have zero corporate work experience, outside of their barista job on campus. \n\nOr they will ONLY accept the top 1% of all available tech jobs. \n\nAs someone who is in the industry, and about to complete my bachelors in CS, it’s all about how you demonstrate your ability to succeed within a corporate setting. \n\nWhat were your results? How did you add value? Did you meet goals and deadlines? \n\nI have tons of adjacent QA experience, which makes my bachelors literally just an obstacle I have to overcome to increase my earning potential. \n\nThe job market isn’t even that cutthroat compared to other industries that I have been in. It is quite large, even among tech only companies. \n\nBut let’s be real, most modern corporations need tech people. I still routinely get recruiters emailing me, and I’m not actively looking. \n\nI have no GitHub, or leet code to speak of. Don’t apply to only tech companies. Other companies need tech people. And they probably aren’t as good at squeezing you for productivity.",
            "To summarise in one sentence\n\nPeople who had interest in computers before majoring in cs will be rich rest will struggle.",
            "Serious question- what do u plan to major in? At this point I’d also consider something in economics or finance since cs has a good base of math and so does economics and finance. And there’s even good money in these fields",
            "Yes",
            "I've seen computer science grads do non-tech sales internships. It's gotten pretty bad.",
            "Yeah but probably not because of AI. They're fucked because they're going to be gen-z.",
            "There are many ways, legitimate and illegitimate, that you can make money on your own with this skillset if there are no jobs. Just look at all the Ukrainian engineers that managed to make a good living in a corrupt shithole country before the war. Look at how many of them managed to leverage that to dodge the draft and escape certain death in the Donbass.\n\nMoreover, there's a world outside of the US. There's national security concerns at play here, if the US tech sector starts resembling Russia's, with a glut of skilled hackers and no legitimate opportunity. The CPC would ramp up their recruiting efforts on university campuses tenfold. This is also perhaps the most useful degree to get for immigration purposes.",
            "no,  have a good day",
            "Oh the old gatekeeping tactics…",
            "Eh it’s not that bad. If you practice Leetcode, practice interviewing, apply to a lot of jobs (50+ applications, not easy applications, ACTUAL website ones), and think reasonable at this time in terms of jobs (don’t apply to senior ML engineer) you will probably be fine.",
            "STOP LOOKING AT FAANG, there are hundreds of entry level dev spots and engineering spots in TECH at non tech companies.",
            "Lol losers.",
            "Nah it'll be fine.",
            "its great. once all the jobs are gone we dont have to work anymore!!",
            "[deleted]",
            "> its not like the companies grow more space for employees\n\nIt’s exactly like that lmao. Software begets more software.",
            "No, the market is good.",
            "I am strongly considering a sidestep partially because I see the market but also because I think there is some writing on the wall with the capabilities of AI increasing every day. I have to ask myself what is the human element here?\n\nI am also a creative and have been feeling strongly that I am missing a connection here between technical ability and generative work. Between learning algorithms and the artistic skills and critical thinking I already have. I don't really have any answer but I'm planning to keep on and keep my eyes open for the creative parts of this all. \n\nI do not believe we are F'ed but I do believe we may need to adapt.. But was that ever not true?",
            "In the US?",
            "Weve started hiring new grads again. Just hired a half dozen. Before we would only backfill essential positions. I think it will take a little while for things to get easier since theres a huge backlog of people up the skill chain and new grads are most attractive only to a few large companies and they only want the top 5% of CS students.",
            "Actually these companies are growing more jobs. And the economy is growing more companies which are growing more jobs. That’s why the bureau of labor statistics has the industry creating more and more jobs every year. It’s fine. Get off this sub and just do what you’re interested in.[169,000 new jobs per year through 2031.](https://www.bls.gov/ooh/Computer-and-Information-Technology/Software-developers.htm)",
            "Yes",
            "Yes",
            "If the supply/demand issue is scaring you then I suggest switching to Accounting or doing a dual major to have that as a fallback. Accounting is scrambling for new people mainly due to lower wages but there will definitely be a job waiting for you.",
            "I feel like the people who say this don’t believe in computing as a technology. AI is going to create demands that we can’t really account for yet.",
            "Yes. If you’re not too far into the major, transfer to some other engineering with similar coursework but different job opportunities. Maybe electrical engineering or mechanical. Unless you’re near the top of your class and make a bunch of connections, you will not get an internship, and will probably not find a job.",
            "Yes",
            "No",
            "Go into robotics",
            "I see what you're saying. I graduated in May 22'. Took me till Feb 23' to find a job. My GPA wasn't great, I had 3.2 and I had no internships. \n\nRetrospectively, I declined 3 job offers because my expectations for a SWE salary were higher than reality. I also didn't want to move out from where I was.\n\nI finally took the job with a previous salary I had declined, across multiple states for a two year contract - but wait: They moved to 100% remote less than 6 months. I can move back home a year early, work remote with 3 pay bumps and experience under my belt.\n\nMy point is, there's an opportunity for everyone. You just need to humble and manage expectations. Everyone starts somewhere and honestly you never know how your experience will be.",
            "CS will always be needed.  I don't know if it will be the rock star job it was in the 2000s though.",
            "Too many people going into CS. Going to end up like Canada and Finance majors. Hundreds of applicants for even an entry level analyst position. So many MBA grads that’s essentially worth nothing",
            "Well this thread makes me depressed as someone who's about to graduate with a Software Engineering degree in 2024.",
            "Too all the CS majors:\n\nI’m saying this as a person with an engineering technology degree, so maybe I don’t really know what you’re going through. But I got two job offers out of college. I was actually forced to get a job right out of college because my parents kicked me out of the house. So How did I do it?\n \nThe biggest tip I can offer to any of you is to EXPAND your job search to literally anywhere in the country. After you graduate college, there’s nothing saying you need to return home. \n\nFor example, I found a job and moved to a total shithole town called Kokomo, Indiana. There’s NOTHING to do here, but you know what it did have? A job opening. So I moved here, and once I gain some experience I’m going to move back to my home state. \n\nI would recommend looking at small, rural towns across the Midwest and south. Yes, your quality of life will suffer for 2-3 years, but after that 2-3 year point you can switch jobs again and get something better.",
            "Don’t believe that cs majors can’t find jobs with more difficulty than any other field. The data shows the exact opposite",
            "People are applying to just the top companies and when they don’t get it they whine that the major is useless lol. Don’t apply to big tech and look into other industries and roll in the offers. I get probably 10 recruiters each month for tech positions in my industry. It really isn’t that bad in my experience",
            "I thought I was being smart, picking this major and to be completely honest with you. I don’t think I’m gonna have a hard time getting a job. I suppose I just wished I specialized in something. But honestly, I’m gonna do my own thing after like 10 years in the industry.",
            "Chatgpt like ai software will take good chunk of jobs in entry level software Jobs",
            "If you like it, major in it. Also develop people skills and emotional intelligence and you’ll be leagues ahead of your peers.\n\nThere are more jobs opening for people in comp besides software engineering. It’s all about passion and communication",
            "The markets rough right now mostly because companies over hired during the pandemic, and then conducted layoffs, so most job seekers atm are skewed towards the experienced side of things, that’s really it. It’s not because the market suddenly collapsed from a surge of people majoring in CS. For the past decade or so you’ve had people going into engineering in general at a pretty high rate between bootcamps and CS majors. So it’s really nothing new, people have been saying the same thing since when I was in school and that was back in 2016. There’s always going to be a need for software engineers, so it’s not like it’s going anywhere any time soon.\n\nAlso no one cares about where you went to school, what your gpa was, or even if you had internships or not within a few years of being in the market, so none of that even matters in the long term. It’s in your best interest to have those things because they will get you a good head start, but it’s not like your career is over if you don’t have those things.",
            "More ppl will get masters and do more research to differentiate themselves. Getting a job is a an optimization function. I work in the sf Bay Area. Graduated with a ms right before the pandemic. Worked at 2 companies have my profession network with a varieties of engineers and managers. >60% of the ppl I know have at masters. I only see that number go up the next decade as it provides students an extra year or two for my internships and research. It gives ppl access to hot fields such as ML. And for the students who can’t figure their job situation, more credentials is better and buys them time. Career changers will realize the bootcamp option is becoming less effective. And if ppl really push for union protection. You know well that education requirement could be involved as it’s an easy way to protect existing ppl and keep out less qualified ppl.",
            "I get job alerts for around 30 or so tech positions almost every day on my email, about 30-50% of those jobs are entry level.",
            "Posts like that absolutely kill any hope I have for breaking into the field. I’m doing an untraditional path by getting my degree online. I already know that in itself is going to make my job search a difficult one. Also might not even be able to get an internship doing the online degree as no timeline of when I’d actually graduate.\n\nNot sure if it’s worth it if people who are going to top universities with internships struggle so much to get a job. I mean I’d be happy with a job making 50-60k to start and work up to those 6 figure marks, but man it feels like I may not even be employable doing it like that. I’m not someone who is inherently great at this stuff either. At the same time, I don’t really have another option of what career path I’d like to pursue and maybe having the degree will at least check off the box for other careers. It might take me a really long time to become a SWE, but I really have no other plan.",
            "same thing with a lot of majors, mine included (finance). it’s just the bachelor’s degree job market as a whole. it’s pretty fucked atm.",
            "I was thinking this same thing all last month no one can get a job but I notice some lack certs so Imma get me a cloud cert along with my ITF+ to give that boost and show recruiters and employers in willing to learn.",
            "There's an artificial constriction of available openings in the market to suppress wages. That's what the layoffs and subsequent hiring freezes / slowdowns were really about. But a lot of those people who got laid off are going to be hiring at their start ups soon which will result in demand outpacing demand again and wages will rise, and then all those companies will spend tons of money to buy the start ups. But for a brief moment they delivered more stockholder value by having layoffs. (And maybe the stock goes up when Google / etc buys *fancy startup that does fancy X* even though they could have kept those people and had *X* themselves).",
            "There's an artificial constriction of available openings in the market to suppress wages. That's what the layoffs and subsequent hiring freezes / slowdowns were really about. But a lot of those people who got laid off are going to be hiring at their start ups soon which will result in demand outpacing demand again and wages will rise, and then all those companies will spend tons of money to buy the start ups. But for a brief moment they delivered more stockholder value by having layoffs. (And maybe the stock goes up when Google / etc buys *fancy startup that does fancy X* even though they could have kept those people and had *X* themselves).",
            "A few years ago it was covid and tech companies were raking in cash because PLENTY of people had more money to blow for various reasons. Personally, my wife and I were nearly doubling our monthly income during covid with nothing to do but shop online and scroll through an obscene amount of ads. Companies need to find their “normal” again in this weird depression/non-depression financial time.",
            "Most pps in the forum are overlooking the game changer: AI assisted coding (GPT). It's reducing the complexity of entry level programming.",
            "I think the SWE bubble is just bursting. I graduate in December and I am content at this point with pivoting to something else, like data/devops/security/systems/whatever. I am still going to work on projects and leetcode, but I am not going to throw away life grinding for a job. That's ridiculous. It would've been cool to get a 6 fig job out of college, but there are people with masters degrees living paycheck to paycheck. I think I'll be ok with my 5 figure above average salary fresh out of college. Yes, shit is tough right now and people are struggling to get jobs, but I've also seen people on this sub complain about getting job offers paying 70k+ salary in areas where cost of living isn't through the roof (yet). Is that pennies in comparison to the value that a lot of IT people provide to the company? Yes, of course. By all means have standards, know your worth and fight to reach your goals, but also remember there are fights not worth fighting and the path to achieving your dreams is not linear. I can assure your there are multiple career paths that all lead to the same end.   \n\n\nPerhaps I am overly optimistic and delusional, but nobody is going to do themselves any favors doom-scrolling this sub reading every last persons vent post. Perhaps this should be some kind of wake up call? Maybe IT professionals should start putting their energy into organizing , maybe even unionizing ,rather than wasting time and energy complaining about the job market on this sub? We all now something isn't right about this. Yet, what are we doing to make any meaningful change? Why let companies treat us this way? Why wait around for crumbs? Idk that's my 2 cents I guess.",
            "In my class, half of it has no idea what they are doing. I do not know why professors give them passes If i would be a professor, I would insta fail every one of them That is why I think that maybe many people are going there, but many people have no idea what is really happening at the advanced c++ class half of the class could not write code for (axb)\\^2 and did not know what cin cout is doing so i can optimistically cut 30-40 percent of competitors here",
            "Disagree, I think you just have to become a good specialist in a solid area thats not back office for tech, like AI or hot and trend areas that companies are looking professionals for. \n\nAnother good thing and news for you is that is a technical field so you’ll get an offer from here sooner or later.",
            "I'm an old-timer. In 2000-2001 there was a massive tech wreck, worse than what we saw in the last few years. I switched to health sciences hoping to pursue medicine but a 3.7 GPA held me back 15 years ago. So I totally got F'ed. I regret not doing CS, and I'm doing it now as another degree, no regrets. The material is interesting and I see a ton of industrial application outside of SWE even (cybersec, cloud, IoT) everything. Once the economy picks up again, or if we go to war, these will be valuable skills and knowledge - if not only for your personal life too to make yourself more productive. Every industry will need technically able people - companies without technological adaptation won't be able to compete.",
            "yes",
            "No, those posts have always existed. The market is worse than usual right now but we'll see how long that lasts",
            "They can’t find 100k remote jobs.\n\nIf they apply to something more reasonable they can find it",
            "Yes and most of the people who are not getting a job had a made up interest in CS just cause it pays well they're doing it solely for money, they don't really like computer and stuff they're just in it cause the crowd goes to it cause it pays well, if you like it, keep learning it, you'll get the job you want",
            "There are plenty of jobs. A lot of people just have unrealistic/warped expectations and unreasonably high standards. Jobs will pop up more during graduation seasons as well."
        ]
    },
    {
        "post_id": "1551pde",
        "author": "Dismal_Orange_8775",
        "title": "Why the pay is low in this position?",
        "url": "https://i.redd.it/jxc7o61tf6db1.jpg",
        "score": 502,
        "num_comments": 223,
        "created_utc": 1689883684.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1551pde/why_the_pay_is_low_in_this_position/",
        "comments": [
            "Skills: JavaScript, Java, Java#, Java++, Sjava, AWJava, Kuberjava, Objective-Java, JavaTalk, Pyjava, Deep Neural Java, Continuous Java\n\nedit: forgot Javatopy Type Theory",
            "I find it wild that employers would pay less than $20 an hour for a junior tech job. Might as well work retail or something else that’s not tech for that pay 😂 sadcompsciguy is right though. If you’re that desperate to be paid like shit then by all means go for it",
            "The fact that it has 271 applicants is crazy",
            "Apex Systems is a consulting company. While they pay you x per hour, they make y off of you per hour and pocket the difference for basically doing nothing.",
            "You'd have to ask the company why they are offering such low pay, but if you have a BS in CS you should just pass on this and look for something else, unless you are desperate for experience.  \n\n\nYou would likely get much better pay even as an intern at a good company.",
            "all companies will pay what people r willing to work for. if you aren’t willing to for this price (i wouldn’t be either) don’t apply; there’s 271 applicants that are",
            "I recommend you pass, the pay is ridiculously low.",
            "Because Apex System. I have blocked them everywhere.  Stay away from them. You can filter them out in the searches using plugin extensions.",
            "Apex is a recruitment agency, not the actual company. So the company might be offering $25 an hour and Apex is pocketing the difference.",
            "Working at Starbucks paid me more then that",
            "The fact that over 200 people applied to that in an hour is crazy",
            "Seems like a job basically preying on laid off visa holders that are desperate to find work or will have to leave the country....otherwise not sure what sort of warped logic you have to be under to not think pay like this won't just result in really poor talent. That or there is a scam in there somewhere.",
            "Wtffff even my high school internship paid more than that, I'm surprised that's even legal",
            "Skill requirements: good at chatgpt prompting 😜",
            "Let me guess: 50 years of experience preferred",
            "H1B1 Visa requires not being able to fill the job for x amount of time.",
            "I’d go just to meet Skylar tbh",
            "With pay that low nobody will stay there longer than a year. The employer is just harming themselves :-/",
            "Still 271 applicants is wild",
            "If they want to bring in an immigrant to do a job, they are required to post it online so Americans can apply for it first. After no one applies, they can hire the immigrant so they can pay them shit and treat them like garbage.",
            "Because employers don’t understand what it takes to be a programmer. We’re essentially linguists who specialize in written text over spoken, on top of that we’re authors writing massive amounts of text (that may only ever be read by a few people, if any) and we do both in such a way that we get computers to do amazing things to entertain, automate, enrich and simplify the lives of billions of people. But to most hiring managers we are “just some person to write this trivial app for us, no big deal”.",
            "Because it's a job you shouldn't apply to",
            "because it is a junior position and remote , they are looking for someone from others countries.",
            "Maybe they are testing the water. If they can hire someone at that price then they'll do it. If not, they'll raise the price.\n\nI can see some self taught people who just want to change jobs applying for this.",
            "Too many CS grads these days; the talent pool is flooded with supply thanks to the YOY exponential growth of CS graduates. When you look at all these posts saying that people are applying to 500+ jobs and not getting an offer, its simple economics that wages would inevitably drop as well.",
            "Because of indians.",
            "Because it has the word Junior on it and allows you to be remote.",
            "I’m ready to get downvoted into oblivion for this, but here we go:\n\n6 month contract for $18 an hour? It’s something that unfortunately a lot of people need. An internship for recent graduates who never got internships during college. The fact that it’s a “junior” role without “intern” in the name is even better for those who need a 6 month stepping stone.",
            "Apex systems 💀",
            "I’ve got paid more as a research assistant at a bio lab lol",
            "Apex is a horrible company to work for they are notorious for underpaying all positions",
            "Maybe because that's remote? There are junior developers in my country making less than 1/3 of this money. I am a junior with a similar wage and i am like a king here, almost a god between mortals, top 0.000001% junior. That 15$/h might be trash for you, but one man's trash is another man's treasure. I know seniors who make less than this.",
            "This is good rate, dude.",
            "Cuz there’s an abundance of CS majors and too little jobs lol the bubble finally bursted",
            "It's a **contract to hire**. This means they want a low risk candidate who will prove themselves before they offer a full time job at a much higher pay.\n\nThe point of contact-to-hire is they are taking a chance on someone with no experience.",
            "The actual answer is that's likely an error and I've seen that exact \"15-18\" range on many postings. The real pay is higher, that's some sort of software error on whatever they use to make the posting.",
            "Because Java devs are a dime a dozen. They're not rare and learning Java to a junior level is incredibly simple with free online resources. It's not worth more than 15/hr for a junior position.",
            "Supply and demand yall",
            "Welcome to supply and demand.\n\nCS is showing an exponential growth in supply. And more increase to come.\n\nIt's just supply and demand at play.\n\nThis is basic economics. Expect this to be more common (and even worse) going forward this decade.\n\nYou can thank all the TikTok and YouTube influencers for destroying this field's supply and demand. Too many people here seem to not understand how supply and demand works.\n\nWhy pay more when more and more CS graduates are being churned up and getting desperate. When barely any CS graduates, companies have to both treat and pay their employees well. When a good chunk of people worldwide all are trying to be CS graduates/self studying CS/boot campers, employees can bring in that toxic wlb on top of worse and worse pay.\n\nWlb across tech is falling fast and toxic ness has been rising incredibly fast this year (overall). And entry market pay overall is falling fast.\n\nOnly fools would believe a field would be immune to the nature of supply and demand.\n\nImagine if recession or depression hit. Back in dot com bubble, top quality engineers we're praying to work at places like McDonald's. Supply and demand effect is a real phenomenon.",
            "I mean in all honesty, go ahead and apply for the role if you don't have any job in hand and you're looking to graduate soon. You can always shift once you have a better offer. \nI'd choose having good experience over pay any day.",
            "Apex Systems is one grade above a sweatshop.",
            "I made 24/hr as a junior. Once I got promoted, I'm making more than I ever thought I would be at this age.",
            "I saw one offering $11 per hour with 1000 applicants",
            "u can work at target and make the same amnt of money 😐",
            "Cause it's apex",
            "Maybe they mixed up the ad for a junior barista.",
            "cuz recruiters are dumb they dont even know how much we worth",
            "Guys chill, apply for it and do your side project during work hours. They wont likely won't know because with this rate they can only get bad devs ... bad in skills or/and bad in work ethic. You choose to be the one with bad work ethic. \nPeople in any market who is only willing to pay bare minimum dont care about quality, even if they complain.",
            "Associate in a job title means they want to be able to underpay you and treat you as an expendable object.",
            "Because they are out of their minds",
            "I'm not proud I'll take on the this job. I haven't ever made that much an hour, I've waited tables my whole life and I am eager to learn.",
            "\"+8 more\" lmao",
            "I make that much wrapping flowers at Fred Meyer. This is a scam right here.",
            "Because compensation in CS varies extremely widely.    Everyone needs technology but the pay keeps getting worse the farther away it is from a companies core products.\n\nAlso that is a job posted by a staffing agency, so it's going to be a step lower than what it would pay if it weren't a staff agency.\n\nPeople who are 6 months to a year without a CS job might just vote on something like this. (Those people are out there, and were even when CS was booming).",
            "because the competition is so high. remember all these ads? LEARN OUR COURSE NOW, CHANGE YOUR PROFESION AND BECOME AN IT SPECIALIST, WE NEED TECH PEOPLE!!!! they dont really need tech people... they just want a lot of them on the market, so that they could lower the pay due to competition between employees.",
            "Because its remote, they're trying to outsource work abroad.",
            "Because we're barely a few years out from the point where a junior have dev job can be done for free by an AI.",
            "Apex Systems is based out of Virginia, which is generally speaking, a LCOL zone. It looks like they're paying entry rate for their area- which is probably good in their eyes, since if you're an IT worker in Virginia, it's honestly slim pickings.",
            "in dubai they are paying $1000/ month",
            "https://preview.redd.it/tofmmxwl5adb1.jpeg?width=1352&format=pjpg&auto=webp&s=1d88761c2b97b5dd1b9ebaf0ec7fdeca2a701139\n\nThat is nothing compared to this.",
            "Java is one of the most commonly outsourced languages. Many companies hire out to the Philippines or Mexico for java devs. I've heard US based devs sometimes say that their company is only technically US based because that's where all the executives and project leads are. All the engineers/coders are outside the US.\n\n10/10 would NOT learn Java if I wanted a CS job. Going to be one of the MOST competitive niches.",
            "I've seen that pay for interns back in 2016. That is ridiculously low.",
            "Because they are a shitty company that don’t know what they are doing?",
            "Ah apex systems, they will find you a job, but you get paid pennies on the dollar from what they get from the client.",
            " Is this low? I am working for a US company in a remote position earning $5,000 USD per year. I am open to job offers, backend, devops, sre roles.",
            "At this pay rate, I think the assumption on their part is that you'll be getting more training time from them than the value that you contribute to the codebase. Or that the job market is ice cold.",
            "Probably because they deem it a junior role .. but I doubt they going to get anybody to actually take that job if they have a brain",
            "Java is a complex stack it’s not worth it to hire a junior developer. They literally paying you to get trained.",
            "271 applicants? For a remote job!??!?!?",
            "because they are clowns?",
            "One of those typical jobs where the hr asks you \"Why should we hire you instead of using ChatGPT?\"\n\nOne dork in a skirt found that question \"over-innovative\" and asked the friend of mine as the finalizing question. And that was an interview for a mid position.",
            "Worked at a contracting company for my first job.\n\nGenerally it's low like that because contractors like apex lease you out to clients to make money.",
            "The amount of people in this thread talking about \"immigrants applying to the job\" is unreal. The job posting says US citizens only. \n\nSo tired of people who can't be bothered to do the bare minimum giving their dumbass opinions.",
            "I’d take it, any experience would be nice.",
            "Less than McDonald's",
            "Cause we’re fucked aren’t we",
            "my high school retail job pays more than this",
            "They're fishing for people really desperate to get a CS job just for the experience, not for the money. Seeing that the application count is 271 really surprises me."
        ]
    },
    {
        "post_id": "12fs9pz",
        "author": "Riishhab",
        "title": "Was Git invented in Britain?",
        "url": "https://www.reddit.com/r/csMajors/comments/12fs9pz/was_git_invented_in_britain/",
        "score": 505,
        "num_comments": 20,
        "created_utc": 1680974368.0,
        "selftext": "Because git init",
        "permalink": "/r/csMajors/comments/12fs9pz/was_git_invented_in_britain/",
        "comments": [
            "`git init tuesday`",
            "it was invented by Linus Torvalds and in a 2005 mailing list post announcing the creation of Git, Torvalds wrote, \"I'm an egotistical bastard, and I name all my projects after myself. First 'Linux,' now 'git.'\"\n\n100% deliberate.",
            "r/angryupvote",
            "Oi' wankers innit that the truth ☕☕☕",
            "Every thing is made is China no matter where it is invented.",
            "/r/dadjokes",
            "How about we have some freshly harvested hobo d*ick cheese for lunch?",
            "Ah, the good ol' git init. The start of any great project or repository. It's the first step towards version control excellence. I remember my first time using it like it was yesterday. *wipes tear* It's a beautiful thing, really."
        ]
    },
    {
        "post_id": "z50fnc",
        "author": "Likey_00",
        "title": "Name and Shame: Duolingo",
        "url": "https://www.reddit.com/r/csMajors/comments/z50fnc/name_and_shame_duolingo/",
        "score": 501,
        "num_comments": 42,
        "created_utc": 1669444610.0,
        "selftext": "I made another post about a week back asking if anyone had heard back from duolingo. \n\nSpecifically, I interviewed in the October 20th batch day, which is their final interview round and there seemed to be about 30 other candidates present on that day as well.\n\nEven though it's irrelevant to the situation, I felt like I did really well on this interview and was able to solve the problem quickly and gel with the interviewer. It even ended early.\n\nI've received absolutely no response from them, even after prodding my recruiter repeatedly. They said they would get back in 1 to 2 weeks, and it's been 5. It's really disheartening when you're excited about something like this to receive absolutely nothing.",
        "permalink": "/r/csMajors/comments/z50fnc/name_and_shame_duolingo/",
        "comments": [
            "[deleted]",
            "it sucks honestly. mostly that you got to the final round. it’s not like it was an OA or the early stages of the process. you spent time doing the prev interviews or assessments. I had the same thing happen to me and I blacklisted the company(you heard that right if companies can blacklist me, I can to). take that as a learning experience and move on. if they contact you back, great! if not, take it as if you dodged a bullet. Imagine how they will treat you as an employee.",
            "My insider friend at Duolingo told me they have a lot of candidates they want to hire but the higher up didn’t give her headcount/budget. So they are trying to hold on to you as long as possible. And wait for the budget and headcount to be approved.  But IMO the chance of approval is skim considering the financial stance of the company. I don’t want to feed you copium but yea you are not out yet. Those getting rejected are rejected right away (for example me).",
            "[deleted]",
            "At this point everyone should just assume that after any interview, if you don’t hear back in 1 week then you didn’t get to the next round / the offer. Yes, the recruiter should’ve gotten back but you need to set your own expectations right so you don’t get this disappointed or anxious when waiting to hear back.",
            "It took them 26 days to get back to me. I interviewed September 1st and heard back September 27th. Given that it’s a holiday week,  you likely will hear back next week.",
            "Duolingo really needs to chill out",
            "If you don’t hear back within 3 business days, assume the worst and move on. Ghosting is just part of the journey, you’ll get a better offer down the road! Cheer up!",
            "They just sent me a questionnaire to complete. Submitted that. Didn’t hear from them again.",
            "We're naming and shaming for ghosting now? Cmon now. 90% of companies will ghost you, you should just be thankful for the ones who do give a response.",
            "Name and shame for this? Really?\n\nYeah it sucks, but legit happens everywhere. You should get used to it. Not telling you you won't pass final round, but getting ghosted is, unfortunately, not uncommon on all rounds.",
            "Name and shame for being a shitty terrible way to learn a language.",
            "I think a good way to navigate these scenarios is to assume you don’t have the job until you sign the contract.",
            "Skill issue",
            "Bloomberg and Restaurant Brands International for me. Absolutely ghosted",
            "Most likely massive hiring freeze and layoff of all recruiters",
            "bro i feel that- Boeing is basically doing that to me, but the worst part is they told me i’ve basically gotten the job bc they were impressed, and we talked about paperwork and all that stuff, and then they haven’t responded to me in over a month now\n\nmy cousin had a similar thing happen w JP- she got the offer verbally , and then got news 3 weeks later that the position was filled… like tf"
        ]
    },
    {
        "post_id": "z0djoe",
        "author": "According-Coffee-387",
        "title": "Professor gave me zero on my coding assignment.",
        "url": "https://www.reddit.com/r/csMajors/comments/z0djoe/professor_gave_me_zero_on_my_coding_assignment/",
        "score": 500,
        "num_comments": 156,
        "created_utc": 1668974192.0,
        "selftext": "I had a coding assignment two weeks ago, and the grade for it was just posted today. the professor gave me a zero and added a comment saying he found a similar code. the code was my work and I did it on my own.\n\n&#x200B;\n\nI'm going to be upfront, a classmate reached out for help and asked if I could help him. I said yes and tried to guide him through the process he kept saying his code is not working so I just gave up and shared my code assuming he would just submit his own code and use mine to figure out where he went wrong.\n\nwhat are my options? I realize I made a mistake, but I had good intentions. ",
        "permalink": "/r/csMajors/comments/z0djoe/professor_gave_me_zero_on_my_coding_assignment/",
        "comments": [
            "You live you learn, don’t do that in the future",
            "What year are you in? Professors are usually more forgiving for first years and sometimes second years. Lesson learned tho, never show anyone else your code",
            "At my school, giving someone else your code has the same consequences as copying someone's code. \n\nHere, in freshman/sophomore classes, its an instant F in the course. In other classes, it might be a zero on the assignment for the first offense",
            "Proving authorship once a professor is decided you have committed plagiarism is a pain. It often ends up on he said/she said situations and your word against the professors and the other student in your case. I would even consider dropping the course and have done so in similar situations not that I am telling you to do so but just so you have an idea how severe those kind of cases are.",
            "Take accountability that you fucked up. Firstly that you should never show your code. Just explain it to them and how to structure it. Then gobble down that 0 since it'll teach you a painful lesson which you won't repeat again. Or else you'll leave this scenario with 0 repercussions and 0 learnt experience",
            "Be glad all you got was a zero… some places would take disciplinary action on that because it’s technically cheating/academic dishonesty\n\nI will say though, you could try talking to your prof and explaining g you didn’t realize it was academic dishonesty and see if there’s something you can do to partially make up for it? Idk",
            "been in a similar situation.\n\nyou had a good intention, but your classmate was an imbecile who could not even rephrase your code. in my situation, i ended up getting a zero \\[which had a 5% impact on the overall course\\] and eventually got 1 letter grade less than what i deserved. my classmate? he just dropped the course.\n\non the other side, there is nothing you can do about it. if i were you, i would just confess everything and let the other person suffer as well. it is okay as long as no disciplinary action is taken. again, just cut off contact with that selfish moron.",
            "Even if you wrote the code, your mistake was in sharing it. That’s basically just as bad as copying someone else’s code if it’s an individual assignment.",
            "well, when you give solutions, they don’t learn. from what I read, it looks like your friend didn’t even want to try. cause you helped him but he kept complaining. next time you want to help, just explain. if they complain about errors, help them understand and fix. never give the solution. once you start that, it will become an habit for them to always ask. I understand that you fear they will say you are mean. but believe me this is not mean. they are just lazy.",
            "Confess and show the logs of you sharing the code with someone else",
            "\"Good intentions\" are rarely part of the rubric. You facilitated cheating. Be happy you're not stuck with a charge on your permanent record.",
            "Good intentions/lack of knowledge is no argument for violating academic integrity. Accept the mistake and next time just say \"I cannot share my code\".",
            "This happened to my friend before. Even if you can afford a zero on this assignment as you’ve been saying in your comments, you should still go to the Professor and let him know what happened. Also you could maybe try talking to your classmate and asking him to own up to his mistake. Again even if you can afford a zero at least try to fight for something that’s not a zero",
            "I’d try and email the professor and offer to show evidence that you wrote the code yourself, it’s just that your classmate copied it while you were trying to help them. It’s not fair you get a 0 for just trying to help someone, and if you clearly only had the intent to help you can’t get in trouble for that.",
            "Sending your code is violating academic integrity. I sent my code to my friend and we handed a similar structure and both of us got a 0 on that homework and dropped a letter grade. Don’t do it again.",
            "Skill issue",
            "Lookup your schools ethics policies. Some schools have ethics policies that make sharing homework expellable. If you tell the professor you gave someone else your homework, and put it in writing, it could end very badly for you.",
            "It's okay to discuss answers. I wouldn't share my whole solution.",
            "Your classmate is a fukin shit. He screwed you over. Confront to your professor and be honest about what was actually going on.",
            "Honesty is your best option to avoid a much worse fate",
            "Did you happen to turn in your assignment first? It could help if that is the case.",
            "Ask the other student if they got a zero as well? Ask the other student if he shared with other classmates? If that other student has any sense of remorse, they would go to the professor themselves and admit their faults. That's the right thing to do, any normal person would feel bad and want to make things right to the person that helped them.\n\nOne time I turned around in class during a quiz and asked another student if she saw where my bottle of contact solution went. It was on the floor somewhere cause it rolled away from me. The teacher in high school gave us both a zero. I went to him after class and told him what happened and to only give me a 0. He decided to not take away both of our points.\n\nIf the other students code looks nothing like yours, then go into the professors office hours and go over what he compared the parts of the plagerism. You can use websites like [this](https://www.w3docs.com/tools/code-diff/) to compare sources of code. Also did you post your code anywhere online? That would be another reason.\n\nAlso how much of the assignment did the other student copy? This looks like it could be one section. You can even argue that you did share one section of your code and try to help this other student. You dont have to take the blame for your entire assignment being shared. One section of shared code can make a difference. You can say after going back and forth with the other student, you felt that it would be hard for them to understand without seeing the code directly. You just did not expect them to turn it in verbatim.\n\nYou need to talk to the other student though. You mentioned you are a sophmore. That student may or may not continue a programming major in the future. You may also be sharing the same student and professor for future classses. I recommend speaking the classmate first, have him share his code with you. Then find your problem area.\n\nThe first step is to rule out the other student of wrongdoing. If that student is your friend they will help you find the exact source and reason for your 0.",
            "I’m a high school TA, not a college professor, but I have a point of view a little closer to the authority figure than most commentors here.\n\nDo not confront your lab mate, speak to the professor immediately and let them know what happened. Not because it will change your assignment grade, but because they will appreciate understanding the ‘direction’ of the academic misconduct and may not judge you harshly in the future.",
            "Do you not commit changes to a personal repo?",
            "bold assumption",
            "Someone asked me for help but kept just wanting to see my code. Now I’m glad I never gave them my code because of incidents like this.",
            "Make sure the cheater is outed so they dont get credit for your work. Explain you stupidly let them see your code and they stole it.\n\nIm sure youll be able to explain the code far better than they could since they couldnt figure it out on their own.",
            "Talk to your professor. Explain what happened. It may not change your grade but they'll look at the other student more closely now.",
            "You live and learn brother. It's college now, professors aren't payed to give a fuck. So If you admit that you facilitated cheating, either you get maximum 70 on the HW, or you'll face getting dropped from the class/expulsion since you confessed to facilitation of cheating",
            "One of the reasons why I hate college lol",
            "You should not share code. At least in my school thats the first rule in assignment",
            "shared code was your mistake.",
            "Bruh , 4 years every single assigment , evey quiz and paper i cheated and still graduated and landed a solid job , you are going to do just fine",
            ">shared my code assuming he would just submit his own code and use mine to figure out where he went wrong.\n\nThats a HUGE nono. You never, ever show your code to others. Even to \"use mine to figure out where he went wrong\", its still cheating, and you are still helping other students cheat. If a classmate asks for extensive help, you point them to the professor. Most programming assignments are individual, you shouldn't be giving that much help to other students. \n\n>what are my options? I realize I made a mistake, but I had good intentions.\n\nYou hope that the university doesn't pursue this further and just leave it as a 0. Even if your intentions are good, you still committed an Academic Integrity Violation.",
            "Could be worse. You could have been sent to the discipline board because plagiarism is really serious at university. You are just going to have to take the 0 and learn from it. Better than being suspended",
            "Well, I keep all my assignment in a public repository. Each semester I see multiple copies of my assignments being handed out to the teacher. In my senior year now, I see my code even in the teacher's solution (from all the subject I have previously taken).\n\nI think I'd enjoy seeing them when I return to school as an alumnus",
            "Take the 0 and learn. At my university its similar, if they find matching code you get a 0 for that assignment(call it a warning). If it happens again, its having a chat with the dean and academic affairs. In my time as a CS student I've treaded lightly with helping others, let alone sharing code. \n\n&#x200B;\n\nLike you said, you shared the code but you didnt intend on that student just straight copying it. This is a huge liability you open up when you do this. You basically 'assume' they wont directly copy your code... but obviously there is no guarantee by any means.  In the future, its best to walk through with other students the thought process and logic, but the buck really needs to stop there! Don't ever share your direct code itself, its far too risky!",
            "You plagiarized and now you are fucked",
            "My brother in Christ that’s called Code plagiarism. You can share ideas, never share your work. Good thing the prof is giving you a 0 and not an F. Some AI violations are unforgiving",
            "Take the zero and move on.\n\nYou fundamentally violated the agreement implicit in every CS assignment (namely: keep your code secret), and failing the assignment is a natural consequence.  Since you already committed academic dishonesty, you probably can't salvage the assignment.\n\nAnd definitely don't even risk doing this again.  Depending on policy and previous offenses, people can instantly fail entire courses for a single incident, or even get kicked out of school (especially for multiple incidents).  A bad grade on a single assignment, is letting you off easy.\n\nAnd the policy usually considers letting someone plagiarize, to be as bad as plagiarizing yourself.",
            "At my school you will fail the class, so consider yourself lucky",
            "“I did it on my own”\n\nHmm. \n\n“I just gave up and shared my code”\n\nIdiot.",
            "Your options are: suck it up. You cheated and got caught, even tho you’re not the one benefiting from it. Don’t bother confronting the other student, it’s as much your fault as it is theirs.\n\nIf anything, your prof went easy on you. At my school, you get 2 strikes throughout your entire degree. If you cheat once, you fail the class. If you cheat twice, you’re kicked out of school",
            "I would find out what your school policy is and how likely it is that your professor would flunk you out. If he has already told you that he has noticed your hard work, then he probably knows that someone used your work, as opposed to you both copying it. But, he couldn't give that person a zero without giving you one. If I were in your shoes, I would not bring this up with the professor unless you saw any indication that he was going to hold this against your final grade.\n\nIf you do speak with the professor. I would be very careful with what I would say to the him. Say only enough to show that you came up with the code and that you shared some of the code with a classmate to help them out. Then say I accept the 0 for the assignment, that it was my mistake. Also, be prepared to deal with the consequences of the professor confronting your lab partner.",
            "We get one of these every year, and 99% of the time, they actually cheated",
            "You accept it and move on.\n\nNext time, make sure that they actually change the code and not use the same code word for word.",
            "Lesson learnt, bit of advice keep a repo even for assignments. This way you have proof you did the work and have history of when you started it etc, and when all is said and done you have a repo of projects you did. For now take the L but you learnt.",
            "You shae code with someone on an assignment, you basically cheated. You can share thoughts and ideas but not code.",
            "What university are you in?",
            "If I ever give someone my code, I make sure to let them know that if we get caught, they have to say they stole it from me, absolving me since I actually did it.",
            "What class?",
            "At my school they make you sign a document at the beginning of the semester saying you understand that sharing your work with others will be treated as cheating in the same sense as copying other’s work. \n\nSo assuming your school works the same way, you are unfortunately just gonna have to eat this one and don’t give out your work next time.",
            "Unfortunately at these ages no one is trustable. Good intention backfires and then no one trust you",
            "This is likely against plagiarism rules @ your school, if you had legitimate evidence he plagiarized your work he could receive harsh penalties from the school, if that’s an avenue you wanted to take",
            "Explain what happened but don't expect a grade reversal.\n\nI'm in my first year of grading computer programming as a college professor and I can tell you it sucks. \n When you're asked to take over an unorganized class mid semester it's almost impossible.\n As a professor you really just want evidence that the class has produced someone who's competent.\n My standards are much much lower because of the situation the students and I are in, but I still mark 0 on any repeated assignment, and it doesn't even matter how it happened.\n\nDude should feel bad for messing up your grade.",
            "Dude this happened to do many ppl in my program! Except many of us are booked for code similarities because the questions are LC questions 😩",
            "Be glad you’re not on the chopping block for more trouble.",
            "I wouldn’t explain it to the prof if he’s not trying to take disciplinary action. Just don’t do it again and take the 0.",
            "Helping others is punishable under slave master capitalism. Indoctrination schools take decades to make sure this is fully embedded in the programs of people's minds.",
            "Explain the situation to your prof.",
            "Did you go over what constitutes as cheating/plagiarism before you started at your university? This is definitely cheating, and you will have to carry that punishment.",
            "I'm so sorry for you. I had kinda similar experience with you last year with a data structure course. My professor gave me 0 for that assignment and downgraded my final grade by 3 letters (lol wtf). Then I got C+ for that class :) I had to retake that course next sem to increase my GPA :(",
            "Sorry you’ve been blacklisted from Faang",
            "I was a TA for a Matlab course and there were tons of duplicate code submitted. Not for CS major students apparently but the frustration on the grader’s side is likely the same.\n\nI feel like in this case your grader or the professor is just trying to get to the bottom of it and want to penalize the cheater. The assumption here is the one who did the work (you) will not just sit here and be OK with a zero. I’d just talk to your professor and see what they wanna do. Good luck!",
            "Never share your code",
            "Ah fuck yeh man this story had been played out so many times there’s no going around this best policy even if it’s a friend is to never share the code under any circumstances at all.",
            "Just tell the professor what happened but don’t expect him to change your grade. Tell him as a character thing not with expectations for change. It also depends what kind of professor you have. I know some don’t care what your story is.",
            "people asking for code tend to be the shadiest and less street-wise people, at least in terms of changing it so its nota direct copy. I've learned to avoid helping others with that kind of thing",
            "Did you push to git? If you can prove that your commits are stamped earlier than whatever he’s looking at, you might have a case.",
            "Same happened to me, unfortunately got to try again the next year.",
            "When I share code in the past, I always be sure to share a version of it that’s completely different or change the fuck out of mine before I do. And generally, I won’t share before I just help.",
            "Show your work. You have files with date and time stamps and if it’s your code, you could almost certainly explain better why you did things the way you did and how they work. Also be clear upfront that you aren’t trying to get the professor to change your grade but rather want to show that you did not benefit from this cheating but rather were trying to help a classmate. If the professor comes out of it with the opinion that you acted with maturity and integrity that’s about the best you can hope for."
        ]
    }
]