[
    {
        "post_id": "v5fa55",
        "author": "Any_Illustrator_2878",
        "title": "Coinbase rescinding new grad offers!",
        "url": "https://www.reddit.com/r/csMajors/comments/v5fa55/coinbase_rescinding_new_grad_offers/",
        "score": 504,
        "num_comments": 47,
        "created_utc": 1654441691.0,
        "selftext": "Damn, woke up this morning to see linkedin full of international students posting about rescinded offers just 1/2 weeks before their start date. Sending some love from this side.",
        "permalink": "/r/csMajors/comments/v5fa55/coinbase_rescinding_new_grad_offers/",
        "comments": [
            "Bruh, you're like a week late",
            "[deleted]",
            "This is why we need to accept multiple offers and let others know once onboarding is finished",
            "It's coinbase. Is anyone surprised? Like what even is their product? A trading platform for scam currency.",
            "Is it only international students? I thought it was everyone?",
            "some of the posts are getting a lot of traction thankfully. ik some people are gonna get better offers (after successfully interviewing ofc) out of this.",
            "I'll be in my final year soon and this is scaring me. I wonder if this will affect my job hunt too.",
            "[deleted]",
            "Don't rely on work boys, always first try to make something of your own, and see whether you can commercialize it and turn it into a startup. That's the way to go.",
            "OneTrust as well. I don’t know what kind of company would do it"
        ]
    },
    {
        "post_id": "q8oxb0",
        "author": "SnooSongs4297",
        "title": "im very overwhelmed and I want to give up",
        "url": "https://www.reddit.com/r/csMajors/comments/q8oxb0/im_very_overwhelmed_and_i_want_to_give_up/",
        "score": 505,
        "num_comments": 103,
        "created_utc": 1634306045.0,
        "selftext": "College is hard man",
        "permalink": "/r/csMajors/comments/q8oxb0/im_very_overwhelmed_and_i_want_to_give_up/",
        "comments": [
            "Keep in mind that GPA isn’t everything, drops exist to be used, and an extra semester isnt bad. Take some weight off your shoulders and come back stronger.",
            "Fuck ur classes buddy just leetcode thank me in 3 years",
            "I feel you bro. Surprisingly I'm doing decent in my comp sci classses but man these math classes and the other required courses are hella annoying.\n\n&#x200B;\n\nAnd I Regret doing a statistics minor lol",
            "I'm 26, still living at home, and have been working on my bachelors for 7 years now (worked full time through most of it also). I super feel you. But I'm graduating soon, starting my job at G00gle in a few months, then beginning a new life, and I'm so glad I did it. \n\nStick through it, there's a light at the end of the tunnel and you can do it.\n\nPS: Here's a tip, don't discount the option of slowing down a bit if you need to. Taking a break or taking less than full time is better than giving up completely. Doesn't matter if you graduate in more than 4 years, its better than not graduating at all, and no one really cares how long it took you to graduate. I took separate 1 year and 6 month breaks at different points due to medical difficulties at the time and did most of my degree with less than a full course load. Its all good, do what you need to, as long as you keep going.",
            "Feel ya buddy. How to do a truck of homework and personal project on a week?",
            "You read my mind…. This semester in particular I’ve felt so burnt constantly having assignments and projects due with shit professors who put in the absolute minimal effort for their class and expect perfection…. This semesters fuckery has been Assembly language which is the most stupidly difficult language I’ve learned on top of my professor thinking he is God’s gift to the university, giving us huge weekly programming assignments to complete and notoriously hard exams each worth 20% of your grade (4 total). The average on the first was a 58 and he had the balls to tell us, a classroom of seniors, that college is about trying hard. REALLY TEACH???? Profound advice there shit skull…… \n\nAnyway I felt that last part was more about me than you, but stick in there bud it will get better. One month left of this semester, plan something fun during the break to have that to look forward to.",
            "I hope you’re just talking about college",
            "Sometimes I have noticed the more I tried to catch up with college, the more I compromised on my sleep and mental health which in turn made things more difficult.\n\nGet some rest, even if it means some pending work remains unfinished. Contrary to what seems a popular advice here, please do take care of your GPA, if possible. I don't know about other countries, but at least in India the companies set a minimum requirement of 8 or even 9 out of 10 for your first internship/job.",
            "Im with ya\nTommorow starts my 2nd semester and im dreading every minute\nIts a nightmare",
            "I fucking feel that so hard. I’m just trying to graduate at this point. 3 more semesters and it’s hard to force myself to give a shit about my GPA anymore",
            "Retweet",
            "Yup, same here\n \nFeel like crying everytime i sit and start to study, i feel so dumb it's sad",
            "It’s okay to give up. Prioritize mental health over everything.",
            "I’ve been having a hard time teaching myself python. I feel you!",
            "Don’t give up! You can do this!",
            "Same",
            "First off, if you have time, give yourself this weekend off or give yourself saturday off. Overall, aim to give yourself Saturday or Friday off and go chill with friends. Grades aren't everything and as much as not doing homework for a day stresses you out, it'll be a way to relax your brain. -> Your brain is a muscle and clearly it needs a day to rest. Would you run 7 days a week even though your legs are aching? No, right?? The same goes for your brain.\n\nSecond, I agree with other people. Work on leetcode/interview/project prep instead. You can have straight As or straight Fs, it doesn't matter in the end if you don't get a job. Straights As only act as the lubricant but even then it doesn't help that much as companies care much more about projects. Why? because software jobs are all about projects and how well you can carry them out AND that goes beyond just technical skills.\n\nThird, go to the gym daily (this is a slight exaggeration, do what you can and don't hurt yourself). Nothing beats stress like using every ounce of muscle to lift 20 lb weights. Also, you sleep like a baby. \n\nGl bud, you got it!",
            "Just decided to drop 2 classes, I realized I wasn't putting a 100 percent effort into my courses because of health issues I've had to deal with this semester. Coming back stronger next semester. Stay strong everyone we got this!",
            "If it's an \"I don't really want to do CS anymore\" kind of giving up, there's no shame in that. You're allowed to change paths. If you're still passionate about the field, keep going! You'll get there",
            "I don’t wanna give up just yet but having weekly mastery assignments every single week is tough. Quarters are bad.",
            "Hey man life is hard. I go to college, the gym, weigh all my meals for most the week (track macros), have a fitness YouTube channel, but still prosper Bc most of those things r my hobbies and choosing and if life was easy then everyone would succeed. KEEP.FUCKING.GOING 💪🏼💪🏼💪🏼",
            "Don’t give up 🍀",
            "Give up. One less person to compete against.\n\nBut for real, shit is hard. Whether that be classes, life, or finding ways to balance it all. I think it's say to say we all get to this point.",
            "I am in my senior year of CS and planning to switch to SWE. I am struggling with AI and robotics.",
            "Same here. I’m a Cs junior and classes for my second semester have to be picked next week. I do good in my math classes but I had to retake Cs 1 last year and I feel like the pattern is repeating this year with Cs 2. If I gotta retake the class so be ig bc I’m not in the mental state to finish this class",
            "[removed]",
            "[deleted]",
            "Totally understand and can relate. 32 F married and quit my job to go back to school. The only courses I have to take are prerequities so I can transfer. Sadly most state schools in California will not accept lower division so I'm screwed. Courses include Calc 1-4, programming courses and physics. My memory recall is terrible as an older returning student.. I'm taking Calc 1 and cisp 360 Intro to structured prog. Right now my class grade in Calc 1 is a D. I've already accepted that if I fail I can always retake it again. Knowing that actually makes me a little less stressed. I've tho of dropping that course but I can't be under 6 units as I'm taking out student loans.",
            "On?",
            "I feel you man. It’s my last semester and I’m really struggling with machine learning rn. Between senioritis and the difficulty of the course it’s rough. On top of that my other 3 courses are also 400 level CS classes so even though I’ve only got 4 classes they’re all a lot of work.",
            "Am a senior struggling to get a job and school is tough enough as is so I can relate",
            "I know exactly how you feel. Jumping from community college to a 4 year im taking classes that I feel are a jump from what I’ve learned. My pride tells me not to drop any classes but I know staying in will just be an easy F. I plan on taking a semester off and trying to learn to get more up to speed. Maybe look at some syllabuses.\n\nThat being said, college is hard but it ain’t a means to an end. Take a step back, those who are relying on you will appreciate you being honest than you stressing and your work showing that stress. Take a breath, teach yourself for a bit, only you know how you learn best. And like others have said, come back strong and refreshed. It’s a marathon not a sprint, try not to overwhelm yourself."
        ]
    },
    {
        "post_id": "14gwfqc",
        "author": "Soviet_Onion-",
        "title": "Help! I am stuck on the hardest homework question I ever encountered in all my CS classes",
        "url": "https://www.reddit.com/r/csMajors/comments/14gwfqc/help_i_am_stuck_on_the_hardest_homework_question/",
        "score": 503,
        "num_comments": 128,
        "created_utc": 1687520768.0,
        "selftext": "Does P = NP? If so, prove the statement.\n\n&#x200B;\n\nI dunno where to start.  I asked the TA and he just laughed at me. I need to get 100% on this homework, otherwise I will fail this class this summer semester and not graduate. Any help would be appreciated....",
        "permalink": "/r/csMajors/comments/14gwfqc/help_i_am_stuck_on_the_hardest_homework_question/",
        "comments": [
            "True for n=1, there you go.",
            "I guess once you solve it, your TA will collect the $1,000,000 prize?",
            "My interview question for Microsoft was to find non-trivial zeroes of the Riemann Zeta function. I hacked a solution up in 30 min and was promptly rejected",
            "yes                     \nthe proof is left as an exercise to the reader",
            "r/csMajorsCircleJerk",
            "Guys, its all good. I found the answer on Chegg.",
            "'P' is clearly not 'NP' not sure what they teach the kids in school these days.\n\nOn a more serious note P != NP and I found a very compelling prove lately that sadly doesn't fit into this comment, but will link the blog post once it is finished.",
            "\\>  I need to get 100% on this homework, otherwise I will fail this class this summer semester and not graduate. \n\nSigh.",
            "Reading through these comments, getting scared for my upcoming semester, proceeding to google, finally reading \"Shitpost\". \n\nr/MurderTheOP",
            "Just use a hashmap",
            "Isn't this one of the 7 millennium prize problems?",
            "P is one letter. \n\nNP is two letters. \n\nHow tf are they gonna be equal? Are you high?",
            "Just ask for the answer sheet after you get the problem wrong, and then collect your money as you turn in the answer!",
            "This is so trivial I won't even bother to explain it to you",
            "If n=1 yes, else no.",
            ">If so, prove the statement.\n\nSo you can just say 'no' and you don't have to prove anything. Assignment complete.",
            "If SAT is in P then P = NP so just show whether the statement is true or not\n\n(This hasn't been proven so best you can do is use already existing knowledge to just write down something haha)",
            "P != NP because if P=NP, a biological system would exist capable of doing it, imo",
            "P does not equal NP, they are opposite.\n\nP = Problem\n\nNP = No Problem",
            "This post hits different when you've taken the Theory of Computation course",
            "Wtf no one has been able to prove whether that’s true or not why r u being asked to do so",
            "I was given the same exact question in my third year and I wrote “fuck you, piece of shit” as the response. Nevertheless I got full marks on that question.",
            "This reminds me of the first time I check aboard a Naval Warship and someone told me to go get batteries for the sound powered phone.",
            "Just ask GPT-4: P and NP are two classes of problems. P (Polynomial time) is the class of problems for which a solution can be found and verified quickly (in \"polynomial time\"). NP (Nondeterministic Polynomial time) is the class of problems for which a solution, if given, can be checked quickly.\n\nThe question \"P=NP?\" asks whether every problem for which a solution can be verified quickly also has a solution that can be found quickly. In simpler terms, it's asking if verifying the correctness of the answer is as hard as finding the answer in the first place.\n\nIf P=NP, this would mean that for every problem where we can verify a solution quickly, we could also find that solution quickly. This would have profound implications for fields like cryptography, optimization, and more.\n\nHowever, as of my knowledge cutoff in September 2021, the question remains unresolved. The Clay Mathematics Institute has even designated it as one of the seven \"Millennium Prize Problems,\" offering a $1 million prize for a correct solution.",
            "PMme",
            "God I fucking hate when professors do this. Do us all a favor and tell your professor to eat shit.\n\nYou won’t be able to solve it. https://en.m.wikipedia.org/wiki/P_versus_NP_problem\n\nJust throw a bunch of proof jargon on a piece of paper to make it look like you tried your best and turn that shit in. This is a trick question.\n\nNo one in computer science has been able to solve the P vs NP problem to date.\n\nYour professor is a fucking smart ass with no respect for their students time.",
            "[https://youtu.be/EHp4FPyajKQ](https://youtu.be/EHp4FPyajKQ)  \nI instantly thought of this video, hope this might be of any help!",
            "I still don’t understand those at all oml. So glad I’m done with that algorithm analysis class. Professor gave 20% to all homework and exam questions that you put “I don’t know” on. On top of that after the first two homeworks he started giving out insane amounts of extra credit. Each homework would be worth as if they were two homeworks so you were able to get a max score of (200/100). Only way I survived that class; don’t know what I would’ve done if a hadnt.",
            "Lol, yugi o is looking for you with his millieum prize puzzle. This is my hint.",
            "courtesy of some llm:)\n\nThe most important aspect in the P versus NP discussion is whether P is equal to NP or not. This question remains unsolved and is one of the biggest unsolved problems in computer science. If P equals NP, it means that problems with efficient verifiability (in NP) also have efficient solutions (in P). In other words, any problem for which we can quickly check a solution would also have a fast algorithm to find the solution. However, if P does not equal NP, it implies that there are problems for which verifying a solution is relatively easy, but finding a solution efficiently is difficult or may even be impossible.\n\nMany important real-world problems, such as the traveling salesman problem and the satisfiability problem, belong to NP. While no efficient algorithm is known to solve them in the general case, these problems still have practical applications, and researchers continue to study them in hopes of finding efficient solutions or approximation algorithms.\n\nIt's worth noting that the P versus NP problem is an open question, and proving either case would have significant implications for various fields, including cryptography, optimization, and algorithm design.",
            "🤣🤣🤣🤣🤣🤣",
            "I have no idea what this means",
            "It's wrong, though I don't have enough space to write down the proof.",
            "Bruh just chatgpt the answer",
            "is this discrete structures taking it next semester",
            "My brother in Christ P = NP\n\nDivide by P \n\nN = 1\n\nTrue for N = 1, above is the proof",
            "My brother P = NP\n\nDivide by P\n\nN = 1\n\nTrue for N = 1, above is the proof",
            "I gotchu, so basically there’s a problem called the 3 color graph and what you got to do is implement the 2 color graph solution and tweak it a little bit, change 2 to 3 and there you go. You should be able to take that and turn it into a proof for p=np /s",
            "P and NP are polynomial and non-deterministic polynomial. As far as everyone knows, they are not equal (no proof yet) and they are not different either (no proof for that as well). So it is an open problem. \n\nFor now everone assume that P ⊆ NP",
            "Professors should be able to pass the assessments they give their students. Otherwise, how is this fair? XD",
            "Lmao u get nobel prize if u solve this",
            "Well according to our Multivac, \n\n&#x200B;\n\nThe question of whether P equals NP is one of the most significant open problems in computer science and mathematics. The P versus NP problem asks whether every problem for which a solution can be verified efficiently can also be solved efficiently. In other words, it questions whether problems for which a solution can be checked quickly (in polynomial time) can also be solved quickly (again, in polynomial time) by an algorithm.\n\nAs of my knowledge cutoff in September 2021, the question remains unresolved, and no proof has been found to demonstrate whether P is equal to NP or not. The problem is considered to be one of the seven Millennium Prize Problems established by the Clay Mathematics Institute, and a solution to it would have profound implications for fields such as cryptography, optimization, and complexity theory.\n\nMany researchers have devoted significant time and effort to understanding the P versus NP problem, but as of now, it remains an unsolved mystery in the field of computer science and mathematics.",
            "Bro share ur million dollars if u solve it okay. \nUr name suggest so u believe in sharing",
            "P = NP. Proof: I said so ▪️",
            "everyone knows N=1 is a solution but lets not forget P=0 is a solution too",
            "Hello World!",
            "Lol",
            "I am Andrew Wiles and Amazon made me prove fermats’ last theorem",
            "Ha, nice",
            "Well, \nWe all know (via gut feeling) that \n\nP!=NP\n\nThe way the second part is framed, you don't have to prove shit ! \n\nPS: Is your TA an indian by any chance?"
        ]
    },
    {
        "post_id": "lks0y2",
        "author": "MWilbon9",
        "title": "Finally...I Got a BIG N OFFER !!?!",
        "url": "https://www.reddit.com/r/csMajors/comments/lks0y2/finallyi_got_a_big_n_offer/",
        "score": 498,
        "num_comments": 49,
        "created_utc": 1613437494.0,
        "selftext": "*Holy shit.*\n\nI know you've probably seen 105000 posts exactly like this before but trust me, *this ones different.* Unlike the other 50000000 other people before me who got into FAANG on their first try after 0 rejections, I sent out over *1200 applications.* I got ghosted. I got rejected. I bombed interviews. But now I'm here.\n\nNow, to the 90% of people reading this that don't have FAANG offers like me, I assure you *this is not a flex*. That's why as a newly initiated and qualified FAANG employee, I'm here to tell you - don't give up ! Ever ! Keep sending those apps and 1 day you'll get a FAANG offer just like me! I once was a non-FAANGer too, but look at me now! Take it from a FAANGer - *you can do this.*\n\nAnyway, now that I know my unqiue, never-before-heard advice (from a FAANG employee) is *guaranteed* to help at least one person land their dream job at FAANG, I'm going to get back to the point: I just wanted to reiterate to all the people still searching, all the people facing rejection, all of you guys who are non-FAANG but wish you were, all you guys who I dont even fucking know and have no reason to tell you this, *I got a FAANG offer (which one?!?!? hehe not telling!).* I also want to reiterate - *this is not a flex.*\n\nP.S. Please upvote so the non-FAANGers can see and so my post gets sent to the moon like all the other posts that look like this one (even though this ones different).\n\nEdit: Why on Earth does everyone keep assuming its Amazon ?!??!? I just want to *remain anonymous* from the other 20000 ***FAANGers*** \\- why else do you think I posted this in the first place???? wait...\n\nEdit: Appreciate awards and stuff - glad I could make some random ppl on the internet laugh :D\n\n/s",
        "permalink": "/r/csMajors/comments/lks0y2/finallyi_got_a_big_n_offer/",
        "comments": [
            "#DOES ANYBODY KNOW IF AMAZON OR NOT",
            "Amazon.",
            "Congrats, mate!  Tell Jeff that we love him ;)",
            "You had me in the first half ngl",
            "Amazon",
            "Honestly, is there a reason why people who get Amazon offers often say they got an offer from FAANG instead of just saying Amazon?",
            "[deleted]",
            "this is perfect",
            "Amazon",
            "so inspiring!! 😍😍\n\n😍\n\n😍\n\n😍",
            "You got me good.",
            "*amazoom?*",
            "amazon",
            "Congratulations bro! I'm so freaking happy for a stranger XD\nDude, you just made my day !!",
            "Amazon",
            "Bro 1200 resumes is nothing i sent out 3600 resumes over the last year. The math really adds up. If you send 10 each day of the year and only 5 on the stat holidays ( us grinders need a break too) then its a clean 3600 numbers. You sit up there on your high horse and mock us mere mortals but when *I* land my FAANG job putting in 3x the amount of work you did at least I can say *I earned it*.",
            "Big corporation that likes tips.",
            "After 1200 applications:\n\nSend the applications, Prepare for all the interviews, and GET this man an INTERNSHIP (Infinity War reference)",
            "Amazon",
            "Yep. Definitely more annoying.",
            "These types of posts were encouraging at first but now I just get frustrated seeing other people get offers while being rejected from every company. Annoying.",
            "Faangot",
            "this reminds me of tech lead (as an ex-FAANG intern, ex-1000 application submitted club member, ex-PIP survivor)",
            "[deleted]",
            "Bruh 1200 applications? This has gotta be because of the pandemic",
            "Take my free silver!",
            "If it’s Amazon keep the excitement cause you’re kinda fked.",
            "Doesn't make a difference bro"
        ]
    },
    {
        "post_id": "1cblvum",
        "author": "WhenInDoubtJustDoIt",
        "title": "Is the 'cs students stink' stereotype overplayed?",
        "url": "https://www.reddit.com/r/csMajors/comments/1cblvum/is_the_cs_students_stink_stereotype_overplayed/",
        "score": 499,
        "num_comments": 212,
        "created_utc": 1713921953.0,
        "selftext": "Personally, I have never had bad experiences w CS students and hygiene but maybe that's because I go to a LAC so my sample is off. So fr, is this a joke on cs subs or a real thing ppl go through?",
        "permalink": "/r/csMajors/comments/1cblvum/is_the_cs_students_stink_stereotype_overplayed/",
        "comments": [
            "https://preview.redd.it/3tmq04q36cwc1.png?width=937&format=pjpg&auto=webp&s=1e5709dfe823c315b61812e8f8d6a9c61e59b217",
            "DUUUUUUDE, I remember this one guy who smelled so bad I could taste his unwiped shit in my mouth. It was that bad. It was awful man. He wasn't broke or anything either. Guy was a straight up sloth build.\n\nIt got to a point that we would immediately open the windows if he walked in.\n\nBro could not understand the concept of \"Please don't smell so bad I can taste your butthole\".",
            "You think it's overplayed until the lecture hall starts smelling like wet onions in an oven.",
            "The reason CS classes don't stink as much anymore is the same reason it's so hard to find a job right now. CS went mainstream so it's not just the smelly geeks in the major anymore.",
            "Am CS major . Never wipe, never flush, because I don’t let shit bother me",
            "https://preview.redd.it/ukqmekja2cwc1.png?width=771&format=png&auto=webp&s=309018c36ed8dfc7e1d23b1db2bee3d4098e86fe\n\nApparently it's not just CS students?",
            "Ime, it's the physics students who show up to CS classes who are really..... I mean CS classes stink. But physics classes.... wow.... I literally sent an email to my prof like \"I'm having asthma attacks in lab bc dudes are unclean\" and got a special exempt to just do labs on my own immediately with an apology and acknowledgement of how smelly they are. He didn't even want to deal with how smelly they are. He knew it was unchangeable. It was easier to give me an auto A- in lab than convince students to bathe.",
            "Big time thing at my school. \n\nWe had an entire 1 credit class called \"College 101\". Includes things like cooking, budgeting, time management for homework. A *significant* portion of it was hygiene.\n\nAnd it still didn't help much.",
            "It is not overplayed. I am over 3 years out of college now, but I distinctly remember smelling the worst BO of my life from a freshman year CS lecture hall.",
            "I’m not going to lie. It’s a lot of STEM guys. If they’re not pulling overnighters studying, they are gaming. They probably just get dressed and go to class thinking they’ve been in all day they don’t have to wash. Maybe that’s it ? I can’t imagine not showering but I’ trying figure the logic here because have seen a pattern and noticed it. Also, many are introverts and prefer staying in to going out. I don’t get it",
            "Realest thing, there is a certain stench in larger universities in the CS section. A lot of these mfs don’t bathe, and they wouldn’t be in person if they could choose it’s just that, for the most part, it’s a mandatory attendance thing.\n\nIn colleges and universities where attendance doesn’t mean anything against you, I imagine you don’t see this problem too much.",
            "There genuinely is a higher number of stinky kids in my CS classes than my other classes",
            "I dunno about students, but one of my CS professors smelled like rotten cat piss blended with gasoline... if he was standing within 15 feet I was gagging... could not ever ask that mofo a question because I couldn't tolerate him coming over to me to look at what I was coding",
            "when i changed my major to cs, i didnt attend classes in person because they were all online, and when i showed up for the first exam, i remember & will never forget just sitting there laughing about the memes being true. bunch of stinky fucks",
            "In my university I honestly had some of the least loser cs students I’ve ever seen, actually attractive guys and girls who are normal and friendly, I was so surprised when I transferred in lmaooo\n\nBut I had this one stinky fedora guy in discrete math 2, and in class he always tried to answer people’s questions when they asked THE PROFESSOR",
            "A friend of mine told me about a guy she worked with once. Guy was kind of a huge asshole, but the thing that really stood out is that this guy just didn't shower. Or if he did, it was very infrequently. So this guy would just be the smellist person in the office.\n\nSo yeah, some people don't grow out of that.",
            "at my uni, there is a building that the majority of cs classes take place in.\n\nit's always warm because the uni doesn't like turning on the air conditioning.\n\nbut that doesn't mean the hallways, classrooms, bathrooms and elevators should smell like raw fish and fungi.\n\ni've learned that a lot of those cs students are barely at their homes because they get to campus very early and leave very late, even on days they didn't have classes.\n\nthey'd just be in the library, or out on the lawn, just coding their lives away. stressing and literally sweating about assignments, projects, and post-grad stuff like networking and internships. don't get me wrong, i understand that these are all important while in the major.\n\nbut, they wore the same clothes so often that i was able to tell who was who without even having to learn their names a single time.\n\nseemed like they rarely showered or applied deodorant daily. some students had very distinct scents and it made me hate going to certain classes.",
            "Add more women to CS classes and you will see every bro will be showering them with flowers and deodorants. I have witnessed that in my CS group project…",
            "I thought it was overplayed and then I got to college and met other CS majors. I'd say most don't stink, but the ones that do, they STINK",
            "Personally this semester I have found it more important to study data structures than to take showers",
            "ngl every semester in a CS class there is at least one incident of a BO bomb. Stereotypes exist for a reason",
            "Yeah Tiktok streamer girls all rushed in this major how can they stink right lol",
            "It’s not! You will be surprised by how some CS students think, how many lack common sense and how they process things. \n\nI had a classmate who would eat 2000 calories of donuts and say that’s his meal for the day! Another classmate would only drink Mountain Dew and Pepsi with a cup of water. Some CS kids are straight up weird.",
            "OK but it seems like so many students complain about the stink, how do you all know it isn't you? You're all nose blind to your own smell.",
            "Yeah I notice in class they wear the same sweaters and shorts  all the time",
            "My uni’s newest CS building has showers installed. Most other buildings on campus don’t have one so it definitely sends a message. \n\nAlso my Structures/C class smells awful at times.",
            "A lot of university aged students don’t shower enough.\n\nI remember I once went to the university café to study for the entire day. At around noon six ladies came in and sat at the table behind me. During their time there the conversation eventually pivoted to showering. Most of them hadn’t showered in a week. Only one had showered in the past three days.\n\nUniversity students in general don’t shower frequently. This is their first time out of home for an extended period. They have lots of school work. Random adventures with friends. Etcetera.\n\nCS Majors likewise have that; however, they also have the fact that unlike most majors in university, they are majority men.\n\nSpeaking in averages for a second. Men sweat more than women. And not just a little bit more.",
            "I never hung out with any of the really stinky groups.\n\nThe wildest thing though is how much the stinky greasy students were fucking. Holy shit there were enough of all genders and orientations that they were forming forbidden harams and polycules. I remember the burger place near by had to ban a bunch of them for aggressive takeout sessions right by the door.\n\nThere were dudes with hair so shiny and stuck down I could be convinced it was plastic. And one of these guys would walk everyone with a girl on each arm casually grabbing kisses from either one go from classes back to his dorm.",
            "Average cs student has the personality and hygiene of a discord mod so id say the stereotype is true",
            "Not overplayed at all. Acne for days whilst grease oozes from the doldrums of their hair follicles. It’s actually mind-blowing.",
            "when I first started undergrad our engineering building smelled like war but towards my graduation there weren't as many geeky nerdy types and less smells",
            "No. Some people genuinely REEK. There are usually free showers across campuses, there's little excuse as to why they don't shower.",
            "Yes in a way. I know ima get down voted saying this, but most of the people who stink are from a certain race",
            "There are a lot of nasty fucks lounging in the cs wing. I wouldn't say it's overplayed but it's not pervasive. I'd say one out of 5 people.",
            "I only ever smelt stank in one senior class surprisingly",
            "It only takes one weirdo for an event to be weird. Similarity, it only takes two stinky cs majors for cs majors to be known as stinky",
            "Walked through the hallway where all the school club offices are. Hallway smelled fine, except for the area around the CS club. That part reeked of body odours and stink",
            "My wife said: usually guys who work at a computer think “I didn’t work out, I didn’t do anything physical so I must not be stinky” 🙃",
            "Like all stereotypes, a few bad apples usually ruin it for everyone. Of course not all CS students smell like shit, but some do.",
            "no",
            "I don't know if it's because I have a bad sense of smell, or because I just don't hang out with other people as often, I don't tend to sense bad smell from other people unless I'm at the gym where people are sweating really badly.",
            "We never showered in 2016.  I remember in uncomfortably mucn detail.  My coworkers are generally better about it these days, but there’s always room for improvement lol",
            "no",
            "CS is mainstream and \"cool\" these days. It's no longer only for basement dwellers.",
            "Oh it’s so true. When I switched to cs I stopped wearing deodorant lol",
            "Well I think this is all technology fields people tend to lack hygiene and don’t know how to shower or use deodorant, or brush teeth.. this is my  school experience",
            "Way back when in Eng school at UBC there were a few folk who couldn’t figure out their personal hygiene. We gave them for ed baths in the fountain outside the main library. Can’t speak about CS in eng it was take a damn shower",
            "Idk. There have been many times where I sat next to someone that smelt like they haven’t showered in months.",
            "When I have my summer exams at uni the whole building stinks",
            "I mean majority of the students are redditors. And we all know how redditors smell like",
            "My roommate is a CS major and I have never seen him shower or change before. He doesn’t have shampoo, towels, or any personal hygiene materials in the room. He does tend to go home, but sometimes he stays for the week and I cannot bear the smell.",
            "It is atrocious, I have had to change seats in my CS classes or leave the library during finals coz someone just stunk so bad. How do ptnor bathe everyday???????",
            "I've seen CS students with skidmarks bro. Hygiene is smth you learn and is a general problem, especially among men, but I think it might be more prominent in engineers, esp if they are also gamers and spend most of their time in their dorms and shit. \n\nSource: I was a CS student, and now I'm doing my master's and teaching CS.",
            "nah its true at least for lower-level classes in my experience\n\nlike 100, 200 level classes have absolute shitshows, but 300+ level classes are p chill",
            "CS when I went to school was a weird mix of of hipsters and incels",
            "No it’s definitely not",
            "There's some truth about it. The ultra mega nerds definitely have a tendency to emit bad BO.",
            "The stereotype that CS students stink is definitely overplayed. It's more of a humorous exaggeration than a reflection of reality. Here's why:\n\n* **Confirmation Bias:** Funny stories or anecdotes about smelly CS students might get shared more often, creating a skewed perception.\n* **Long Hours and Focus:** CS projects can be demanding, leading to occasional instances of neglecting personal hygiene due to time constraints. However, this wouldn't be representative of the entire field.\n* **Shower Stereotype:** The stereotype might play on the idea of CS students spending a lot of time at their computers, neglecting showers. But this is a generalization and doesn't apply to everyone.",
            "You can gauge a CS students talent by their odor",
            "Only on test day when all the basement dwellers who skip class show up",
            "It’s a real thing. Internationals tend to have… questionable hygiene and diet that produces unique odors. Being still but stressed and sweating for a long period of time has its own scent. Those that tend to be attached to the online world and lack real life social skills also tend to go into Cs",
            "[https://www.reddit.com/r/ucla/comments/8qydn0/to\\_the\\_cs\\_143\\_phantom\\_final\\_exam\\_farter/](https://www.reddit.com/r/ucla/comments/8qydn0/to_the_cs_143_phantom_final_exam_farter/)",
            "there's probably some truth to it. I had to remind myself to put in deodorant during my degree but it was also an online degree lol",
            "Idk about being overplayed. The lower level classes always stank. When I was a TA for the 2nd introductory class, half the kids coming for help obviously didn't shower and just used a ton of axe body spray :/",
            "No they stink",
            "I used to be a CS major until I switched to Econ. Oh Lord. It was slightly better in Econ, but the majority of women.. yes women, stank through. What I don't understand is how they got by in their lives without one single person pointing out their stank?  \nOne time I had to put a cotton bud soaked in perfume in my nostrils just to stop myself from puking.",
            "I'm so glad in all my years of schooling, there was only one kid back in high school who didnt shower.",
            "Everybody stinks. I’m sure after pulling an all nighter getting my code assignment done in the lab that I definitely needed a shower afterwards.  Shoulda smelled me after a hockey game, whew. Nothing good hygiene habits can’t fix.",
            "Cs student arrogance tends to be a much more common problem",
            "I hate to say it, but it’s not overplayed. CS lecture halls are pretty nasty sometimes. Thankfully, a lot\nof girls have started to do CS at my university, and they universally take better care of themselves. I myself have anxiety about smelling bad due to times when I was younger being bullied because I used shitty deodorant that didn’t really work, so I take showers multiple times a day now so as to always avoid the stereotype.",
            "I'm a girl. And yes there can be a smell in CS student spaces. I walked into my object oriented design class yesterday and was assaulted with the smell of musk that overtook the room. \n\nIt's not an everyday occurrence, but it's happened frequently enough that I have to give some of my classmates the side eye. \n\nIf you've gone to the gym. Shower before class. If you haven't showered in 3 days, please stay home. 🙏 \n-a fed up cs student",
            "nope not at all, im a software engineering student and the few cs classes i have had have all smelt bad lol",
            "It’s cause they’re all Indian",
            "We had class after a Java exam that took up half the period one night, I left for a bathroom break, came back, and it smelled like an obese workout sesh  in this room\n\nNot to mention it being high 60s-low 70s outside and the room thermostat said 75",
            "Some of y'all legit need deodorant and soap",
            "I’m in grad school doing CS and any time we all have to be present in class, say for an exam, the room stinks of body odor. It was less prevalent in undergrad, but it’s become nearly every single classroom in grad.",
            "99% of the time class is fine, but every time I'm sitting near someone that smells absolutely foul it's been a CS class",
            "It was true ages ago when you took cs out of interest. Since then the number of cs majors have increased eith ar least 2 magnitudes and there are more normal people taking cs as a major.",
            " during my masters, I subleased my room to a japanese guy majoring in English, after I returned from internship.. my room smelled like cat piss ... had to wear a mask and clean everything... damn that was horrific",
            "Not a ton of that where I’m from in Southern California. I see a lot of soulless, bag chasing techbros who would build a refugee bombing drone swarm if it gave them a bonus for Q4",
            "I dropped a class because the class smelled so bad. I swear at least 3 people around me smelled like unwashed ass",
            "I think I'm pretty lucky that the CS and EE people in my uni do not smell that bad. The worst smelling classes I have ever been in were the classes that were used after petrol eng and earth sciences specifically. We will always open the windows wide and stay outside for a lengthy time. The smell was horrid like they went mining like a slave",
            "I had to take a 2 hour exam next to someone who smelled like they had shit their pants",
            "It definitely is not. At least most that decided to sit by me.",
            "Nah it ain’t overplayed cuz it’s so true 💀 like how are you guys grown ass adults that don’t know how to take care of yourself",
            "So the students that are really good at CS are also good at mental manipulation so they are more likely to have lower serotonin levels.   The group of folks that would have lower serotonin and higher intelligence often have genetics to have poor zinc absorption.   Zinc deficiency is well‐known to cause anosmia.  So in many of these cases the students literally don't notice how they smell like everyone else can.",
            "Indians?",
            "the dude that sits next to me in Linear smells like ass covered with cologne",
            "Do they actually smell 👀👀",
            "No there's some really bad smells, mostly sweat and general \"I don't need to shower / use deodorant\" stank. The girls and guys can be equally bad in my experience. *Most* people are fine, but it only takes one. \n\nWhen I was a TA, we worked in this dark, poorly ventilated basement computer lab where they shoved all the CS kids for some reason. You could tell when certain students or TAs were walking in because they carried this aura of B.O. with them. It was practically a visible cloud, like Pigpen from Peanuts.",
            "To an extent, but there’s a reason it’s a stereotype. The lecture hall of a upper-div cloud course at my uni literally smelled like BO as soon as you walked in. Like yes there are plenty of us that are clean but lots of these mfers really do smell like shit",
            "Had an exam 2 weeks ago. \n\nClass is all online except exams. \n\nGot to room early. \n\nSmelled normal. \n\nA girl and guy walk in and sit besides me. \n\nNow it smells like humid foot fungus. Always thought it was just a joke about CS majors, but last exam unfortunately proved me wrong.",
            "Let’s start with stress literally makes you smell bad. If I’m stressing I shower morning and night because I can’t stand the smell of me. Add to that men typically smell more strongly than women. That gives us the difference in ick smells between cs and the nursing school. That and half my girlfriends carried baby wipes in their purses. I’ve used a baby wipe mid shift because the ac was out and I was giving showers in 100 degree heat. I’ll tolerate gym smells to not see the things I used to see daily. I want to be 90 the next time I see 90 year old private parts.",
            "Was a TA for an undergrad course this semester and I used to dread my office hours hoping that a few students don’t show up. It was impossible helping them with the smell they carried.\n\nAs a TA I wanted to help everyone out and be unbiased from every aspect. But hygiene surely comes in the way as it gets intolerable after a point.",
            "Case by case basis. None of my CS classes smelled bad, but on average the type of people who go into CS are the same type to stay inside and play a lot of video games for days without showering. So it's not surprising when CS students don't shower.",
            "Comp Sci and Business.\n\nNever had a single instance of BO in business classes.\n\nRegularly have kids with  BO in CS classes.",
            "The stereotype is definitely true, but personally I've had more issues in Math and Physics",
            "It’s not, I explicitly remember rushing through one of my Concurrent Computing exams because the person that sat down next to me smelled so horrible.",
            "I’ve had two roomates that are cs majors and both smelled 💀",
            "I thought it was exaggerated until\nthis year...\n\nFor context, I live in a quad with 2 of my friends and a random, and the random is the embodiment of the stereotype but honestly worse:\n\n- showered twice this whole year – once in October where his shampoo and bar of soap showed up, another time a week ago when the bar of soap finally moved (it sat there so long it grew mold). also has a sour smell coming from his room but an air freshener solves that for the most part\n\n- doesn't take out UberEats trash he deadass kept a bag full of like 6 ubereats orders in his room for two months, and just took it out to our kitchen for someone else to throw out instead of himself\n\n- throws used tp rolls onto the ground (ive thrown out every roll since ig he was never taught to take out the trash)\n\n- doesnt wash his dishes (his dishes sat in the sink for 2 months until he discovered mold, and instead of washing them he just poured some dish soap on them and called it a day)\n\n- had two piazza posts written about him in a class (one by a prof. cuz he smelled so shit)",
            "No, I have never been in smellier classes. I want to die.",
            "Some of my math and cs classes smell like sweat it is real",
            "No, our infornatics building is nauseating to stay at for long periods of time. I don't know if its poor ventilation or what but if you plan to spend your whole day there you will start getting nauseous, even though we open up windows. Me and a friend of mine started going to a completely different campus to stay at a new building because it was just that bad. Switching buildings helped, neither of us felt nauseous there and we've spent much longer hours there than we ever spent in the informatics building...",
            "No, my engineering research building stinks like bad body odor as soon as you walk in, and it stayed that way throughout the year. Recently, the chemistry and physics building started to smell bad as well. The other engineering buildings attributed to host mostly mechanical or industrial engineering classes or civil or electrical engineering; I haven’t had a bad experience with those to be honest, and I was a CS major as well until people started talking about it being over saturated and I decided to shift over to a double major in math and data science. No smell complaints there 🤷🏻‍♀️",
            "Dude I work for a large company and there's been some colleagues (typically said individuals are here on work visas) who were pretty rank. I don't think that it's them not showering, I think its them not \\*using soap\\*. Or at least not for the...odorous parts.",
            "M8, when you’re out working it’s a lot worst.. there’s this very specific demographic that love curry and good lord.. they fking stinks!",
            "I am in some large CS classes, if I’m honest the only issue I’ve ever had with people smelling are the Indian students/TAs"
        ]
    },
    {
        "post_id": "1564sfs",
        "author": "amirasayshi",
        "title": "Did my Google interview today.",
        "url": "https://www.reddit.com/r/csMajors/comments/1564sfs/did_my_google_interview_today/",
        "score": 498,
        "num_comments": 116,
        "created_utc": 1689984865.0,
        "selftext": "Hi everyone! I did my Google interview today. For those who are unfamiliar with the process, I got reached out to a recruiter (possibly because I applied in the past and found my application in the pool), who helped me revamp my resume, did an OA, and scheduled my interview for about a month later. I used  leetcode75 and top interview 150, hacker rank, and coding ninjas. I even did some practice interviews with preamp and some friends because this was my first technical interview. \nThere were two interviews. The first one, I needed more help than I would’ve hoped to need, but I had great conversation with my interviewer, and was able to find the solution, and then optimize it. My second interview, I was able to quickly get to the solution, and optimize it, and I even also had a great conversation with my interviewer. Overall, I had a great experience and thought it was super fun! I’m happy to answer anyone’s questions. \n\nEven if I don’t get it, I had a lot of fun interviewing. From this whole process, I’ve learned more about myself and have ultimately become a better programmer! I just wanted to share my experience :). I’ll provide some updates when I get them.\n\nUpdate (July 27th, 2023): I passed :-))))))!!!\nUpdate (February 7th, 2024): I matched with a team.",
        "permalink": "/r/csMajors/comments/1564sfs/did_my_google_interview_today/",
        "comments": [
            "this reads like a linkedin post",
            "imagine having a recruiter from any company contact you🥲",
            "Wait, recruiter helped you revamp your resume?",
            "Mf thinks he on linkedin",
            "> ultimately become a better programmer \n\nYou've ultimately become a better ~~programmer~~ interviewer. \n\nThere is a depressingly small overlap between the programming skills required to get through these style of interviews and the programming skills required on the job.\n\nSounds like you prepared well though so good on you.",
            "is this for internship role?",
            "How many hours a day did you review? And this was after 1 month of studying I assume?",
            "Copy pasta from linkedin?",
            "I had fun during mine too, glad it went well!",
            "Can people working in medium level companies like GE , Amdocs get interview in Google?",
            "hope this helps you in the future: [https://github.com/antariksh17/Reddit-wiki-programming](https://github.com/antariksh17/Reddit-wiki-programming)",
            "proud of you! people will hate but you gotta ignore em.",
            "[deleted]",
            "So google still hire so they can let people go....buahahha.",
            "Nobody cares",
            "What were the interview questions? Verbatim",
            "Do you know why you didn't move to the next round? Was it primarily because you needed help solving the problems?",
            "When you say you had a great conversation with your interviewer, do you mean about the code?",
            "Which position is this for",
            "can you share your new revamped resume?",
            "We really need an update in this",
            "Good luck in the final round where the questions will be much harder. Make sure you can do graphs in your sleep",
            "Mind sharing ur resume dms are open!",
            "What position and term were you interviewing for?",
            "congrats!!!",
            "!Remindme 2 weeks",
            "Hey i also have my interview in about a month. Can you share how you structured your prep? I'm really trying to make it structured but i feel it's so disorganized. Also how many questions were you solving per day?",
            "I had a similar experience about a year ago with a google recruiter reaching out and it ultimately led me to getting an internship offer. I’m wrapping up my internship now and hopping for a return offer. I wish you the best of luck!",
            "What did the OA contain?",
            "Bro what DSA questions did they ask you ?",
            "https://youtu.be/OeWLeEiqMhQ?feature=shared This video has a detailed breakdown of the interview process, great examples of the interview questions and tips to prepare you !! I secured my job thanks to this video",
            "hi! Does google interview use hankerrank or some other code editors with some test cases? Or we need to code it on a plain google doc?",
            "I have my first phone call today. Any other tips you can provide?",
            "Hey Op! Congrats 🎉\nI did my Google technical phone screen today. Do you mind if I DM you"
        ]
    },
    {
        "post_id": "russ0v",
        "author": "enough_throwaway",
        "title": "The Catch of Working at Hedge Funds and HFTs - Literally Your Soul",
        "url": "https://www.reddit.com/r/csMajors/comments/russ0v/the_catch_of_working_at_hedge_funds_and_hfts/",
        "score": 501,
        "num_comments": 110,
        "created_utc": 1641183690.0,
        "selftext": "I've been seeing a lot of posts about HFTs and hedge funds. Many are mostly memeing it as \"prestige\" but some are idolizing it and actively chasing it. I went to one of HYPSM and got a software engineer job at one of the \"prestigious hedge fund/trading firm\" right after college. After this I realized what a mistake it was and now work at a FAANG/MANGA.\n\nThis job literally consumed my entire life. No one left at 5 pm. You leave at 7-8 pm on good days. If you leave at 5/6 pm, people literally shout at you and you're viewed as a some degenerate taking who's taking a \"half day\". The work I did was dull and most of the time I had to work with legacy code. I had to listen to traders bitch about something that didn't work, and because of this job I almost lost my relationship of 2 years since I couldn't spend anytime with my partner. I started feeling burnt out and this really affected my mental health badly. I started shouting at my colleagues and developed anger issues. Guess what? No one gives a fuck about your mental health at these hedge funds!\n\nI started leetcoding again and soon found a job at FAANG. Now I make about less now but now I'm working on products that I like and have a nice tech stack. I leave work at 5pm and spend my time with my partner and my dog. When you join these hedge funds, you average 80-85 hours per week so your hourly rate is same as FAANG/MANGA employee. These HFTs that say \"we value work life balance\", yeah shut up. That's still around 70 hours. This industry is fucked by ex-Investment Bankers from Goldman Sachs who bring in their toxic work culture. These companies \"groom\" you with posh housing and trips through through their internship program, they overwork you when you join full-time. There's not much you can do with an extra 100k/200k when you don't have a life outside work. From being a full-timer at both FAANG/HFTs, I truly believe the tech industry provides the best compensation, career growth, and actually values work-life balance.\n\nIf you have an offer from a top tech company and a trading firm, and you value your life outside work even a little bit, do yourself a favour and join the tech company.\n\nTC: 350k (At MANGA)\n\nYOE: 2.5",
        "permalink": "/r/csMajors/comments/russ0v/the_catch_of_working_at_hedge_funds_and_hfts/",
        "comments": [
            "Work life balance is the most important thing, way more than an additional 100k. Happy for you OP",
            "[deleted]",
            "What companies are MANGA?\nIs it an extended version of FANG?",
            "Citadel?",
            "Become a divorce lawyer and make money off HFT guys whose wives divorce them. You don’t have to work a lot and can make a lot of money since America has one of the highest divorce rates in the world 🦊\nEven a chiropractor(even though they are certified they are basically scammers) in my place (MCOL) can earn mid to high six figures working 40 hour weeks without having to pay much in taxes because they only take cash.\nThen there are dentists, podiatrists and other niche medical professions that earn a ton, and the shop is yours\n\nHow do I know? Well half of the people who fat fired in my area took this path so believe it or not",
            "Bro I’ve been working 80 hours a week as an IB analyst getting paid only $120K. I’d love to get paid $250K+ for the same hours.",
            "working at cit and posting about overall hft wlb is like working at amazon and posting about overall swe wlb",
            "Really depends on the HFT/Quant firm, obviously Citadel sucks ass and I’ve heard horror stories from Optiver and Akuna\n\nHowever Jane Street, HRT, and Two Sigma generally have pretty good WLB and chill culture similar to most tech companies.",
            "It's still highly depend on the team. I know some guys work at Citadel. One of them works for 40-45 hours per week and basically leave at 6pm everyday. But another guy works 60+ hours per week, sometimes close to 80 hours.",
            "Does trying out HFT sets you back when applying to SWE jobs? Like did you start out with lower seniority than you would have with the same YOE?",
            "Wonder how many of the people in the comments here defending WLB at HFT have actually worked at HFT. Guaranteed majority of them don't even know anyone at a HFT firm.",
            "- Uses the most relaxed software company in the world in your view\n\n- Uses the most intensive HFT company in the world in your view\n\nYour argument is bad and you should feel bad.",
            "> After this I realized what a mistake it was and now work at a FAANG/MANGA. This job literally consumed my entire life. No one left at 5 pm. You leave at 7-8 pm on good days. If you leave at 5/6 pm, people literally shout at you and you're viewed as a some degenerate taking who's taking a \"half day\".\n\nbut amazon is faang and is also exactly that ^",
            "Yeah they value a work life balance. It’s all work no life that’s the balance.",
            "Citadel? Lmao c'mon we only care about prestige here. I don't wanna hear it unless you work at RenTech.",
            ">TC 350k YOE: 2.5\n\nHow did you manage that?",
            "> Now I make less but I am still happy\n> TC: 350k",
            "Thanks for sharing! Had no clue about this before I saw this post",
            "Cap",
            "Honest question, do you think you still would’ve gotten the 350 tc in that same amount of time without your experience at a trading firm, because of the comparable amount they were paying?",
            "The guy who posted about his new job making 350k said he recently bought 2 houses. 1 to live in and one for an investment. I guess he'll need to work those 70+ hours a week if he wants to afford those two houses.  \n\n\nEdit: The mods deleted the post, https://www.reddit.com/r/csMajors/comments/rtzat3/how\\_to\\_efficiently\\_flaunt\\_wealth\\_to\\_women/hqwbry9/?context=3",
            "Yeah, quite frankly I find quant trading interesting, but don’t want to lose my sanity and have that interest ruined. I am now just a retail trader who does quant trading as a side hobby rather than trying to make it my full time job. Goal is to work as a data analyst and use my spare time to research and trade for myself without having a douchebag Wall Street fuck breathing down my neck",
            "I love when ppl act like their one experience at one company determines the reality for all ppl at all companies of that field. Also hft dare known for using extremely skill-requiring and modern tech? Wait Nvmd u went to HpySm and makes 350k u r the tru manifestation of this industry! I’m sorry to have doubted",
            "leaving at 5/6 p.m. is a half day?? I thought half day is when you leave at lunchtime?",
            "> There's not much you can do with an extra 100k/200k when you don't have a life outside work.\n\nSure there is! You can invest it, and maybe make even more! Say, why not invest it in this little employee index fund that we have set up?",
            "Play me the world's smallest violin. People working low-paying, stressful jobs also give up their soul. Lots of people get up, commute, and come home at night, repeating 6-7 days a week for 40k with little career progression.\n\nYou're on the path to retire at 30. Stop bitching",
            "[deleted]",
            "The dude yesterday says he works at one with 50 hours at most.",
            "Why do you weirdos keep saying \"partner\"? Just say BF or GF"
        ]
    },
    {
        "post_id": "16ewfxc",
        "author": "lizxxss_",
        "title": "the only girl on the team",
        "url": "https://www.reddit.com/r/csMajors/comments/16ewfxc/the_only_girl_on_the_team/",
        "score": 500,
        "num_comments": 130,
        "created_utc": 1694340096.0,
        "selftext": "Hello 👋 i’m currently taking a mobile application development course and the professor had us split into teams. Im the only girl taking this course and was put with 4 other guys. It’s been a month now working with these people and i’m so close to dropping this course and taking that W on my transcript. Every time we have a meeting these guys just ignore what I have to say and split the work amongst themselves and give me the shit work. One guy also tried flirting with me and it was super uncomfortable. The groups are all set now so I can’t really move to another group and I have a feeling I’ll just get the same treatment. Should I just drop the course?!? I don’t really want to talk to the professor 😭 it would be so awkward the whole semester if I just snitch to the teacher. What do I do, I feel stuck.\n\nupdate: I didn’t really specify the work they gave me, they gave me the designing and aesthetics of the app (before anyone says, yes I did tell them I couldn’t draw and tried to object but they said it’s okay and moved on). \n\nI privately messaged one of the quieter guys in the group and told him that I’d like to work on the frontend with him and that we can leave the designing for later. He said that he will bring it up in the next meeting and that’s it. If they say no I will just tell the professor, I don’t want this on top of all my courses and workload. Thanks for the advise.",
        "permalink": "/r/csMajors/comments/16ewfxc/the_only_girl_on_the_team/",
        "comments": [
            "[deleted]",
            "No just tell the professor. It ain’t switching, they need a reality check. \n\nDuring my last internship one of the other interns whom I was sharing my project with was slacking A LOT and had me doing majority of the work. I hit a breaking point, similar to you right now, and told my manager. One thing lead to another and my manager ended up terminating the other intern. That’s the real world.",
            "You’d rather drop the course than talk to the professor?",
            "I'd like to hear from a guy how to react without being labelled as \"doesn't do any work+throws tantrums and is difficult to work with\"",
            "Please talk to the professor. He is not a tyrant.",
            "I agree with reaching out to your professor for help/advice. However, being a girl and a CS major comes with some extra challenges compared to your male peers. Take this as an opportunity to strengthen your backbone cause you are going to need it your whole career. I am out of school and a software dev professionally 3+ years now and still get ignored in meetings and have to fight to do the exciting work, it’s unfair but it’s the reality \n\nWhat I’ve learned:\n\n- don’t wait for someone to give you the work you want to do, take it for yourself. Show up and say “I will do x”, rarely will someone argue\n- don’t let them ignore you. If someone doesn’t answer you in a meeting, repeat yourself, call them out on it. This shocks people into respecting you more and it’s pretty fun \n\nYeah you might get called “difficult” but who cares, don’t let some dumb college boys stop you from doing what you love. Stay strong 💪🏻",
            "Stand your ground! Complain about that behaviour.",
            "I feel bad for you. I would say that you find the most understanding/sympathetic person in the group or person sharing common interests with you and try bonding with them and talk about your concerns with them instead. Once you've bonded with one or two members, that will make you part of the group. Talking to the whole group could make things even worse.",
            "Been there!  Except total opposite in that everyone refused to do any work by claiming to have less experience than me etc etc. It was a game of chicken every deadline (with me doing everything last second) until halfway through the project I would post what needed to be done in Slack and then only do my part.  Again and again it was time to submit or present and I was the only one speaking/with anything to submit. For the final project I sent the prof and TAs all of the screenshots and proof of submission and I turned out to be the only one who got full credit. \nYour professors are there to help you, but you need to record everything as well. Make a Slack or group chat and ask them to clarify what your role/work is, and then show the professor that you tried.  But don’t withdraw, it’s not worth the W for a few months of gritting your teeth imo.",
            "Coming from experience in industry, you must stand up for yourself in meetings. If their behavior continues, report them without a second thought. These types are endemic in school, but get weeded out more readily in industry. They're not non-existent, but are far less common.\n\nThe field has bee moving away from the time where pure skill could safely secure you a career regardless of your personal traits. Soft skill are king. Some people need to learn the hard way that misogyny and other antisocial behaviors aren't tolerated in the workplace.\n\nIt starts whenever you decide it starts. They aren't going to report themselves.",
            "You need to stand up for yourself, if you cant even go to the professor youll never survive having a career in any field.",
            "You have three options: 1. just so the work assigned and don’t worry about it. 2. Be a *lot* more assertive. When the work is getting broken up, advocate for what you want to do. Don’t even ask. Say you’re doing X. 3. Talk to you professor. Even if it’s awkward. Especially if one of the guys is making you feel uncomfortable. Outline clearly and professionally why you want to switch and ask if it would be possible, with the understanding they might say no.",
            "Engineer has way too many simps and you should take advantage of it if you could.  I have a coworker who bought his 1 month girlfriend a brand new car (I do not mean leasing or monthly payment, he paid it in full), and another engineer who met a girl online and although he has not met her once in person, he has been sending her \"gifts\".\n\nDuring the holidays, they are most vulnerable and I know for a fact, girls know they are desperate and would flood dating apps to get free expensive things.",
            "Firstly I just wanna say sorry you're having to deal with this when you shouldn't have to. It's an added stress that so many women in CS (and STEM/other areas in general) have to deal with when we shouldn't have to put up with it at all. As a fellow woman in CS, it can be incredibly frustrating knowing that you're not being taken seriously or even listened to at all. If you want a space to talk with other women in the field, I found r/girlsgonewired to be a nice place for that kinda thing :)\n\nAlso as someone that hates confrontation, I totally get not wanting to tell the professor and just wanting to quietly drop the class. While it's very tempting to take that route, please don't let these pricks be the reason for you dropping the class. I would just quietly pull the professor aside (or even shoot them an email and/or set up a private meeting if it makes you feel more comfortable) and let them know what's going on and how you're feeling in the group. I would just explain how you're wanting to participate and learn, but are finding it difficult to work in your current group (feeling excluded/uncomfortable). I hope it works out either way, keep us updated OP :)",
            "Talk to the professor. I've had this experience before where I felt like I was being cut out of the work and it turns out they weren't doing the work at all. Also, I was told once by someone with less technical proficiency that I could \"work on the aesthetics\" of the project when that's not what I was offering help with.\n\nDon't be afraid to say fuck you and your sexist attitude.\n\nI also wouldn't be afraid to say directly to them. Hey I feel like you've cut me out of the project and it makes me want to quit and I don't deserve that. I have actually found some men do know how to respond if you communicate in \\*your\\* language rather than just trying to talk bro talk.  \n\n\nIt also might be good to bring this up to the group that you have two basic choices. Have them help you resolve this or go to the professor. Ask them which they'd prefer.",
            "Tell the instructor what’s going on. Been in similar groups as a guy in school, people either don’t want to do anything or want to take all the work amongst themselves because “only they can do this right.” I’d rather do an entire project on my own than deal with those types. It’s stupid and not productive in any sense.",
            "Gather evidence and tell your professor. I had to do this before and thankfully my professor believed me so I was out of the group and assigned to another project.",
            "Just to give you some reassurance, there is no way this would run in the professional world. Not saying it doesn't happen, but work culture at most companies is good at dealing with this",
            "find the quiet kid....slowly buildup a friendship, and try open up him and open up yourself with him. Experimented method , it works trust me...and try to be kind and polite a little...help the people who are looking for help. i hope you do well.All the best SISTER..:)",
            "Dewit. The point of taking this course is to get hands-on experience developing apps, and if you don't get that same experience then you are wasting your money to end up not learning anything. This only keeps happening if you don't speak up, and even if they complain about \"snitching\" you're only helping them acknowledge that women can be capable of doing things if they put in the work too. Ask your professor ASAP to find some alternative or solution. Alternatively, if you like learning on your own, you can take a different course instead and learn app development on your own by making your own projects, which will have no barriers.",
            "Curious what you mean by shit work?\n\n\nI totally believe you. Please believe it’s not just a gender thing and these virgins treat men similarly who aren’t on that virgin time also\n\n\nIn the mind of many CS majors, if you’re a woman, go to the gym, play sports or are handsome, you must suck at cs\n\nYour best bet is using your social skills since theirs are 100% lacking",
            "It's part and parcel of joining a major made up of incels.",
            "Can you complete the entire project yourself in the time remaining?\n\nIf not, best you can do is let the professor know about the issue if you want to and let them do the work they're doing. Contrary to what they try to tell you these college projects are absolutely not like working in the real world and have little relevance to learning how to work with others.\n\nPersonally this is why I ended up just doing group projects by myself.",
            "Men are just so silly. Set boundaries and if they are crossed report them for ethical reasons to your professor and your advisor. They are adults and should face adult consequences if they are out of line. \n\nAs for your part of the assignment, speak up if you need help or ask to have it broken down with help of another teammate. \n\nDon't ever be afraid to advocate or speak up for yourself. : ) \n\n💖💖💖 ~fellow tech girlie",
            "I have a feeling I know what school you're in🤣. Speak with your professor tho she will change your teams especially now it's still kinda early in the semester.. The faster you go about the process, the better.. Good luck!",
            "Learn to deal with these situations.  Note you will likely experience this as well in a work environment as well.  I wouldn't quit.",
            "speak with the professor or your advisor regardless of how you decide to handle it. even if just for advice. they know the other people in your class/program and can give more specific advice. personally i dont think you should drop the class. theres no such thing as being a snitch. you have a problem with your coworkers and the correct thing to do is to discuss it with your boss (professor) so they can help work it out. even if its awkward, its just a few months.\n\nthey  shouldn't be treating you like this, but they might not really be aware of it. go to the meetings with a clear idea of what you want to do and how you want to contribute and suggest that right off the bat. say 'i'm planning to work on \\_\\_\\_ this sprint' and put the onus on them to object rather than asking permission. have a clear understanding in your mind of your strengths and weaknesses.\n\nthe flirting just isn't a big deal as long as it doesn't  keep going once you've made it clear you aren't interested or it becomes inappropriate. flirting with people in your classes is a really normal way to meet people.",
            "Damn, lmfaoo",
            "Sexism unfortunately is so ingrained still in men that they might be doing it without realizing how shit their behavior is. Perhaps let them know straight up and if that doesn't work then tell the professor",
            "\\> One guy also tried flirting with me and it was super uncomfortable. \n\nBecause he was ugly?\n\nIf You will find guy that will be very attractive to You - wont You try to flirt with him? Is is forbidden? Up to previous decades most marriages found partners in high school/university.",
            "Girl if you only want to do work you \"like\" youre not cut out for this.",
            "r u Asian or Latina?",
            "Who cares it’s a group project… make sure you are learning the material but you need thicker skin, maybe you don’t know anything.. and that’s okay. You’ll be riding the inclusion, diversity, equality track anyway, so get used to it.",
            "I don't have any solace except I've been in your shoes so many times, and it only got worse with grad school",
            "I'm a woman and often have been the only girl in a professional setting. I haven't experienced what you've described professionally, if that makes you feel better (so, it isn't always going to happen like that at work). Definitely don't drop the course. I would just try to speak up and force yourself into their conversations (but I am more dominant when I want to be, so maybe that's why).",
            "I know it’s easier said than done, but you gotta try to be firmer and not let them ignore you. Next time they try to give you shit work, don’t let them. Speak up and tell them what you’d like to work on. I’m going to guess you haven’t spoken up much to them, considering you’d rather drop the course than go to a professor or solve the problem amongst the group.\n\nPeople can be oblivious, especially guys in CS. I’m not excusing their behavior, but they might just view you as being the shy person in the group that doesn’t have an opinion. If you don’t let them treat you like that, and they keep doing so, that’s when you go to the professor and you can explain what you tried.",
            "Same thing happened to me, the guys kept me out of the loop because they were trying to screw me over. I was the only non asian in the group if it helps. I spoke to the professor and got to do the project myself. Speak to the professor, tell  the truth and if they don't help, drop the course.",
            "Don’t be afraid to stand your ground and state what you want to do. If you are passive and let them do what they want, you will just get the leftovers that they don’t want to do. You won’t be liked, but you also won’t do the crap work. \n\nAnd don’t listen to the people saying to just suck it up. Experiences like this should not be normalized. Don’t be afraid to speak up for yourself. As a woman I got a lot of crap from men for delegating stuff but oh well, at least the stuff got done.",
            "Inform the professor right away but be respectful and explain the situation. Your team members should respect you and work together for the greater good.",
            "I work at a famous software org and there is only one gal in our whole 30 ppl team. Nobody ignores her or anything but she gets pulled her legs so much lol.",
            "I'd recommend being clear with them. Maybe do it in a group chat. Less likely, anyone will be embarrassed  and get defensive. Let them know how you feel. Most guys do not want to make a woman feel unwelcome. \n\nEspecially CS guys, we don't meet many women. We can't afford to be chasing them away.",
            "That's messed up, one suggestion I'd have for you is to be assertive and really let the group of guys know what it is that you wish to do, if they ignore that then keep your professor in the loop. Also, like others have already mentioned here, try to document everything and keep your professor cc'ed in the mails if needed.",
            "Quick reminder: you are literally paying for this class. Talk to your professor!! And if not, talk to your department chair!",
            "This happened to me quite a bit in uni. After that I actively sought out other women to work in groups with, and we nailed it every time without feeling talked down to or over. Ideas were shared freely.\n\nBe confident in your knowledge and don’t let them make you think you are less than. Your ideas, input and skills are just as valuable. The way I managed difficult people was being prepared in advance of meetings, backing your ideas with evidence and asking for space to talk. \n\nI also used to choose to work with the less difficult person, which helps to some degree. It also helps to break up tasks so you are responsible for your own section and have to work with them less.\n\nI recommend looking into developing project management skills (check out the Project Management Institute). Also, a Terms of Reference can be really helpful for group projects moving forward. It clearly defines roles, responsibilities and expectations in terms of behaviour. Make a TOR template and bust it out for each project. You will look like a nerd, but I stopped caring.\n\nIn the meantime, try to either sit them down and voice some of your concerns with suggestions on how to move forward. If that doesn’t work, ask the prof for advice and they can mediate.\n\nTaking a W isn’t the worst either, you will have time to complete other things. So don’t beat yourself up if this is the route you choose.\n\nAlso, if they hit on you just shoot them a dirty look and move on. I was asked out in an interview once, which messed me up for a bit. Just treat those guys like children (they are).\n\nGood luck, I got your back!",
            "The men making stupid jokes are the reason why there’s so few of us and why they’ll forever be lonely incels fr. Touch grass.",
            "Just tell the professor. The longer you wait, the harder it gets, since a lot of teams would’ve made some headway already. So do it ASAP. I’m a guy, and sorry this happened to you. Try to demand that you’ll do the non-shit work when they’re splitting it amongst themselves, so that they know that you can do it.",
            "2022 grad SWE here, I'm the only girl on my team at work. Not a subteam or a project group, out of the entire team from new hires to VP. The best advice I have is to stand up for yourself. \"Being the only girl makes it harder to appeal\" can seem equally stereotypical as \"Girls can't code\" -- both are not something you want to provoke. Second best advice is not all guys/girls are the same, in any field. Just think of them as arrogant \"engineers\" with shitty personality, not \"guys\" trying to assert dominance. I'm very sorry to hear you had to go through all that, no one deserves this regardless of gender. Be proactive and confident, make sure to be proud. Wishing you the best of luck!",
            "Unfortunately, this is something you will more than likely come across in your career. I’ve been there, it sucks I know. I agree talk to your professor, but also you NEED to advocate for yourself. You can’t rely on people to do it for you. It’s awful and unfair, but the truth is being a woman I’ve had to work twice as hard to get the same amount of respect and opportunities as my male counter parts. \nSometimes in situations like this it helps me to write down what I want to say and stick to a script. So go to your next meeting, put your foot down, and if that still doesn’t work reach out to your professor.\n\nAlso feel free toDM me for any help. I have multiple years industry experience, as well as a CS degree and now completing my masters. I’ve been in your exact position multiple times, and it took a lot of work and learning to be able to deal with situations like this effectively.",
            "Be aggressive. Assert yourself. No need to complain. Life is not fair. Either take the shit or try to change things but any case don’t take w or give up.  Most cs guys are timid.",
            "This would happen to me often that one time I snapped and they all painted me as crazy and the bad person in the situation. So all I can say is stay calm but play it smart.",
            "Sorry you’re going through this! If you don’t talk to your professor right now, the guys you are doing your project with are going to turn into the absolute worst employees. By “snitching” , you’re actually helping them out.",
            "I would involve the professor.  yes, this is hard to do, but would do it still.  CS. unfortunately,  still has a LOT of misogyny,  both in classes as well as the workplace.  seen many women in the field needing to prove themselves more than their male colleagues just to be treated somewhat co-equal.  it's really sad,  as in my career, known a number of women that exceeded my talents in programming in various aspects.\n\nkeep up the fight, don't let yourself be forced into roles you don't want, during school or in jobs.",
            "If your team needs you to do X at a big tech company, do you get to complain to your manager you don't like doing it? Or your mom needs you to do chores you don't like, do you automatically complain to daddy?",
            "Where are you taking the course?",
            "It really sucks you have to go trough this. I would just recommand for future case too to voice your concern on the first day and not care about stuff being awkward. Doing project is a chance to learn and you should havw a choice to work on what you want",
            "I'm not qualified to give social advice, but I wonder if there's a way to stand up to yourself with the students themselves? They don't have to like you you know (I think). You could get more and more firm and eventually put your foot down and say you refuse to do the work you don't want to do, or keep pushing back, maybe ask something like \"since none of us want to do this maybe we can come up with a way to decide who does it, how about rock paper scissors\" (I told you I wasn't qualified to give social advice). But seriously"
        ]
    },
    {
        "post_id": "nrdo6i",
        "author": "antenarock",
        "title": "Classmate submitted his midterm project code in a Word document",
        "url": "https://www.reddit.com/r/csMajors/comments/nrdo6i/classmate_submitted_his_midterm_project_code_in_a/",
        "score": 497,
        "num_comments": 88,
        "created_utc": 1622727328.0,
        "selftext": "As you have read, for the class Introduction to Programming I, in the midterm project, a classmate submitted his code in a Microsoft Word document instead of zipping the whole project and submitting it. The instructions were not clear according to him. Of course, the professor failed him.\n\nWhat is the most ridiculous thing you have ever seen at college?",
        "permalink": "/r/csMajors/comments/nrdo6i/classmate_submitted_his_midterm_project_code_in_a/",
        "comments": [
            "One of my students submitted his entire final project report in the subject line of an e-mail.",
            "I had to bring hard copy of my C project in first semester...",
            "I had to print out my coursework to send it for moderation.\n\nThe code was put into a 150 page long Word doc.",
            "honestly i’m surprised he didn’t just write it out on paper given how often i’ve had to do that on exams",
            "While working on a group project, another group member had a bug he couldn't figure out and was trying to email us the code so we could look at it. We were all on a zoom call, so we had him share his screen. Turns out he was trying to drag his vscode window on to his email window, thinking that would attach every file he worked on in vscode.",
            "This doesnt seem too ridiculous bc ive had a lot of classes where this was the norm.\n\nI haven’t seen much ridiculousness in any code-related classes tbh. Most of my classes are just good examples of complete laziness in students rather than a smooth brain moment. I’ve even had people try to ask for my code so they can use it for their project too",
            "He was just following this video's advice:\n\nhttps://youtu.be/X34ZmkeZDos",
            "Every student had to turn in homework using USB Flash drives. Before the pandemic hit my professor had my flash drive and was in the process of grading my code but then the pandemic hit and we never went back to campus and I never got my 128GB flash drive back :/",
            "Not really that ridiculous. I've had classes before where the professor made us copy our code into a word document, print it out and turn in a hard copy. Pretty stupid, but that's what they wanted.\n\nAlso, I highly doubt the prof failed them just because they turned it in as a word doc. They would have to be the biggest asshole professor on the planet to not simply ask for the original file(s), or maybe mark them down a small percentage at most.",
            "During final practical exams one of my classmates ran java code on c++ compiler. He then complained to invigilator that system is not working properly. The professor did not fail him.",
            "I think failing was a bit rough, but I think it should be known to submit code in its format",
            ">Of course, the professor failed him.\n\nThat sounds pretty dumb. I've submitted code inside MS Word documents before because the professor said \"Submit your code in your lab report\". To me that meant put images of code in the lab report alongside with explanations. Some professors (especially in Hardware-related or Computer Engineering labs) require images and code embedded in a report, while most Software labs prefer a zipped file with separate MS Word/PDF reports and code. Either way, at most they'll ask you to resubmit it, not flat out fail you.\n\n>a classmate submitted his code in a Microsoft Word document instead of zipping the whole project and submitting it\n\nThe professor/TA still has the submitted code from the student. To fail someone over something so trivial is pretty stupid. At best a 5 point dedication or small note would be made. Significant Grades should be evaluated over whether the code works, not whether some trivial procedure was followed. To fail someone (especially on a midterm) for submitting code in MS Word rather than as a file is low-key ridiculous.",
            "Microsoft Word is the best IDE. Why wouldn't he submit his midterm project like that?",
            "I remember doing a group project for a coding course where we worked in C. My workmate sends me code… in _JavaScript!_\n\nI told him we weren’t handing that in. He told me “too late!“ Because it was one of those classes were everyone in the group got the same grade, we all got an F.",
            "Second year of college I had to do a project with a group, and it was a database class in which we used SQL. We asked him to send his queries so we could add to the main project to show the teacher hoping he would send the .sql file... Nope, he sent a .jpeg image, with his queries written in it. So for the final thing, we had to write everything copying from the image, and fix a lot of the things cause most of his work was wrong.",
            "During my first year of uni, I was given a C on my final project because my program was “too complex and beyond the scope of the class teachings” :))))))\n\nYes, I tried contesting it. Even brought it up with the department, but they said the professor has final say.",
            "My data structure and c++ professor requires us to copy and paste our code to a word document and then submit it... it’s ridiculous",
            "he's ready for an interview at google",
            "Copied the Shortcut Folder and burn it in the CD disc.",
            "I once graded a Java project that was written in JavaScript. The files were *.java but it sure wasn’t Java.",
            "1st year 1st sem midterm, one of my classmates started crying during an exam because she couldn't answer a binary question. I think she gave up and changed major.",
            "Took a database class in college. Professor gave us assignments to write down SQL queries on paper.",
            "Around 3/4 of the way through Software Design II one of my classmates asked if his programs are supposed to work before he turns them in.\n\nHe said \"they always be crashin\".",
            "My professor REQUIRED us to submit our code in a microsoft word document. I still have nightmares about formatting those assignments. \n\nOrganizing the document for different file structures... Checking that each line did not overflow... Manually reentering all the botched whitespace... The list goes on...",
            "The most ridiculous thing I ever saw was definitely my C++ Prof requiring us to print out and hand in hard copies of all our homework assignments, which he would then grade by hand, red pen and everything 🙄. We're talking literal class and header files for 5-10 different classes, stapled together 🙄",
            "Friend of mine was taking a software engineering class that required partner coding projects. The projects were impossible to complete alone & each only had a short period of time to encourage paired programming. Each partner also got the same grade on each project regardless of who contributed more. \n\nHe didn't have a partner coming in, so he ended up being assigned someone who ended up being the Partner From Hell. \n\nThe partner refused to learn Git even though it was a requirement for the class, so the two of them ended up EMAILING their code back and forth. Besides that, partner never showed up to lectures, had no idea what was going on, and would write code riddled with syntax errors & send it to my friend, who had to sit and fix the mistakes on top of writing his own portions and doing other classwork. (This was when friend was a junior and partner was a senior, but the code apparently looked like it was written by someone who'd never coded before). \n\nOne day, after the partner sent him a whole half of a project that didn't work the night before it was due, he decided \"screw it\", handed it in, and got them both 0s.\n\nIn response, the partner ghosted him, didn't let him know that they dropped the class until the last minute, and left my friend fending for himself. He ended up getting an F in the class and had to retake it.",
            "One of my colleagues didn't know how to unzip a 7zip file during a midterm. He spent half of the time trying to figure out how to do it. At the end he did it but he failed the exam.\n\n\nAnother one, my colleague mixed up the languages during a midterm and used Java instead of C#. Luckily he passed",
            "This was years ago when I was a kid and I was in a coding competition. \nInstruction said to save a file in the root folder. \n\nEasy peasy. Finished everything in half the allotted time. Right before submitting, stroke of genius came over me. A voice in my head to save it in a \"Root\" folder. \n\ni.e. a folder named \"Root\".\n\nDid it. Submitted it. I was proud for a minute.\n\nThen the panic set in.\nI realized I didn't capitalize the root folder. \nOf course, it should've been \"ROOT\", not \"Root\". \nIt's 'the' root folder. Duh. \n\nStill to this date, I have no idea what happened and how that crack-head logic made so much sense at the time.",
            "I've actually tutored students in intro CS classes (for non-majors) where the professor told them to submit their code in a word document. I guess it's easier for plagiarism filters to do their thing?",
            "My website programming final was writing a full-stack site (HTML, CSS, JavaScript, PHP, some SQL queries) *by hand with pencil and paper.* At least we were allowed to use the `$(selector)` shorthand common in JS libraries instead of `document.getElementById` over and over...",
            "Google interviews use a google doc. So he’s actually way ahead of the rest of the class ;)",
            "I had HW6 due one Friday, and after finishing it I submitted HW5 file in HW7 Dropbox... It took me 30 minutes to explain it to my professor how it all happened.",
            "Inspired by Google interviews.",
            "I don't really like the idea of zipping code either, the standard procedure at our school is to use git. That way, if you submit late they can still get the version before the deadline",
            "30% of the students dropped a class because they wanted to use Python instead of Java for their assignments.  The final project could be in any other language tho. I am not sure how one can survive a CS curriculum by avoiding Java.",
            "I can’t stand professors that fail people over being human and making mistakes. Deduct some points ok but failing someone who did the work and spent tens of thousands of dollars is not a fair outcome. He’s failing the guy on a technicality. It’s an immature thing to do.",
            "it is hands down retarded to fail a student over some shitty cosmetics like this. deduct points sure but fail.. holy fuck one retarded lecturer",
            "Nothing beats having to write code snippets for problems that you implement in Lab class. I'm talking about writing them physically on a notebook.",
            "We had to literally \"write\" codes in notebooks for our computer lab practicals",
            "A professor using Word to demonstrate their program in their first lecture. \n\nI bailed immediately."
        ]
    },
    {
        "post_id": "1byghzv",
        "author": "Dragonvarine",
        "title": "Feels like an absolute con to get a CS degree",
        "url": "https://www.reddit.com/r/csMajors/comments/1byghzv/feels_like_an_absolute_con_to_get_a_cs_degree/",
        "score": 500,
        "num_comments": 150,
        "created_utc": 1712526591.0,
        "selftext": "I got to create accounts for multiple different jobseeking sites to apply for each job found on LinkedIn, create a personalised cover letter for each job listing, among hundreds of applicants with more experience on an entry level job. And if youre incredibly lucky to get a response then having to prep for multiple interviews with a low chance of succeeding because it's going to be a bunch of leetcode tasks I might not know.\n\nAnd I got to apply to HUNDREDS for a mere tiny, tiny chance of landing the job?\n\nI got bunch of projects ranging from AI and robotics and .NET, but I cant even get a call back for a single interview.\n\nFeels like Sisyphus here.",
        "permalink": "/r/csMajors/comments/1byghzv/feels_like_an_absolute_con_to_get_a_cs_degree/",
        "comments": [
            "bad economy rn, keep your skills sharp, network, and apply. But try to survive more than anything",
            "Your experience makes me feel like grinding LC and projects is not worth the effort right now. At the same time I’m pretty certain it will help in the future. Success is when preparation meets opportunity… I can’t help but want quicker/instant gratification though… “Mom, Dad, the market is rough at entry level right now but I’ll be out of this brainless job and using my Computer Science degree eventually…”",
            "People who do hiring want you to have absolutely everything in terms of qualifications, but at the same time not \"too much\" because then you're overqualified and might be unhappy with the pay / position.\n\nThe problem is the hiring, not the degree. The degree is still opening doors for you (I don't have a degree and I've been rejected because of it). This might sound corny, but it's honestly very important:\n\nDon't give into the pessimism. Do what you gotta do to stay positive and keep moving forward. There's a mountain of garbage software out there that desperately needs fixing. It's just a matter of time before the big-wigs catch wind of it and start shouting at management to get back to hiring, and that time will come sooner than you think (they're all stupidly shortsighted).",
            "I could be wrong, but it seems like CS degrees are turning into what business degrees turned into a long time ago. You can't just get the degree anymore, you need good grades and internship experience to land a job quickly nowadays, just like with business",
            "With hundreds of applicants chasing each job opening, networking is essential. Spending more time on networking and less time on \"spray and pray\" applications is probably your best strategy.",
            "Never did a cover letter lol",
            "There’s nothing wrong with giving up and going completely away from CS(I don’t mean non-tech SWE but not SWE at all)\n\nThere are countless jobs that just need a college degree and that’s it. \n\nDon’t fall into the trap of not considering other fields at this point. At the end of the day there’s simply not enough jobs for all the genuine people out there trying their best.\n\nBesides, wages for entry level SWE are pretty much below or the same as other new grad jobs at this point. Might as well take them",
            "Just wait till you hear about the scam that is every other college degree.",
            "It's not an \"absolute con\" yet. At least we can think differently compared to people with other majors.\n\nBut job hunting is really hard nowadays. Those interviews are getting unrealistic.\n\nCan you imagine the guy who singlehandedly designed, programmed and also made the music to the game \"Stardew Valley\" couldn't pass any interview and find a job?\n\nThat's one example of how weird today's job market is.\n\nThere are too many interviewees and I guess they don't know how to or even don't want to take extra time to judge each one objectively, so they just use a \"lazy and stupid\" method to filter out the \"incapable\".\n\n(I feel it's somehow similar to the education system)",
            "Cover letters are SUCH a waste of time 99.9% of the time, and a degree is a lot more than a piece of paper. You had to learn from a bunch of highly knowledgeable and well connected professionals, why ignore that?\n\nIf you want to make your student loans more useful, talk to those professors, advisors, basically anybody you can in your school's CS department. Look for classmates on linkedin that found jobs, buy them coffee and ask them what they do in their role, how they feel about it, and how they got it. People love talking about themselves!\n\nProfessors typically get input from industry connections on what to include in their curriculum, plus they often have lots of industry experience, so they've got plenty of connections and love to see their students succeed. Employed classmates will want referral bonuses, and will enjoy talking about their cool new career path (or gripe about the dumpster fire they dove into).\n\nAlso keep an open mind with recruiters, they can lead you to some shit jobs but getting that foot in the door of your target industry can be worth it, and sometimes you'll be surprised with something better than you expected.  \n\n\nWhen it comes down to it, only two things matter:  \n1. Can you do the work  \n2. Do they want to work with you\n\nYou almost always need both to get a job/promotion, but you usually only need one to keep a job. Meeting people in the company and getting to know them as people is crucial because you can fulfill #2 without drowning in the AI-generated, AI-filtered resume spam swamp. I know I'd rather have coffee with somebody smart (and hopefully cool) than to make a cover letter that nobody will read.",
            "Well... One must imagine Sisyphus happy, no one said anything about him actually being happy",
            "It’s bad everywhere, I’ve found no luck in 10 months, did so many assessments, interviews but never landed anything. But we gotta keep the grind, sometimes things are not meant to be and they can take time. At the very end something gotta work no? Wish you the best 🌹",
            "There is only one simple answer at this point for all of us CS. STAY AWAY FROM TECH, IT'S A SHIT HOLE OF NONSENSE 😂\n\nNo matter what you do, how much good you get, you will always get punch in the face by some bullshit",
            "Sisyphus would be a good CS mascot.",
            "What does your resume look like? Are you personalizing your resume? Like if you are applying to ai jobs have majority projects to be related to ai. If you are applying to companies like caterpillar have some robotics project + software projects.",
            "Post resume",
            "My guy that’s like almost every degree chill out",
            "You are wrong on a few points. If you get an interview, you have a very good chance of success. Especially if you are a decent applicant.\n\nAn interview means they are interested.\n\nThere are some other things about your post that strike me as either wrong or odd.",
            "No you don’t have to personalize. It’s a boomer advise talked by absolute out of touch retards. Just mass apply with one resume. Use simplify robot and that’s it. Use ChatGPT if you really need a cover letter but usually you don’t need it. And yes spam apply.",
            "would you mind to share stats / prev internship experience?",
            "The degree is a minimum. Your application won’t be looked at without it.\n\nOP, I began applying 6 months before I graduated and didn’t get a job until 6 months after; this was after already completing a degree in biology. \n\nWhat is your region and how is your low level (C, assembly) understanding? I work in aviation and in house teams are always needed. I can’t guarantee good pay or that they would actually hire you but I can share the companies I’ve worked with if you like C",
            "Then change majors.",
            "Welcome to the real world kid. Enjoy.",
            "Wouldn’t have been an issue if companies just decreased the salaries for Computer Science jobs by a lot.",
            "Honestly, you guys (cs majors) still have it good compared to all the other fields - it just sucks for everyone right now, and because so many cs majors were fed pipe dreams by influencers, the contrast between ridiculous expectations and the reality of the tough (but not as tough as other fields) job market is agitating a lot of you. Engineering, finance, whatever field you can think of - they’re all in the same situation as you, if not worse. CS is super versatile and valuable like a lot of other STEM degrees, don’t go hating on it because you think you’re the only ones in a bad job market.",
            "[Welcome to the world of \"real\"-money lol...](https://www.reddit.com/r/cscareerquestions/comments/1avadgm/comment/kr9rq96/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "It seems like it is really hard to get an it job in the US, but at least in Sweden I only applied to a few places and got a job. Any other European job hunters having similar issues as in the US?",
            "Try using a recruiter. Economy is not like 3 years ago but this is still one of the best 4 year degrees possible",
            "The CS degree is a set of skills that will be useful to you regardless of career. The market is bad right now for just about everyone, unless you're a nurse practitioner, AI PhD, or blue collar laborer (plumbers, electricians, handyman, etc have slow months but always steady business), and the process isn't much better.\n\nIt's an absolute con right now to be in the job market. I graduated in 2009, and had the same problem. It took a lot of my friends years to get their careers really started. But I don't think it's the CS degree, and I do think that if you stick through it and get a job as a programmer, you will find a comfortable salary that involves sitting in front of a computer with flexible hours and can be done anywhere is still more luxurious than many other careers.",
            "> And I got to apply to HUNDREDS for a mere tiny, tiny chance of landing the job?\n\nmore like a mere tiny, tiny change of being selected to interview right now. I feel for y'all",
            "This is why I gave up on tech a long time ago. Too much gatekeeping and demeaning yourself. I went to an industry where they were happy to get me started with no experience, that and doing side hustles so I can make money my way. I’m happy for the techbros that are killing it out there but I just don’t think tech is for me as much as it pains me to let that dream die.",
            "Imo cover letters are a bit of a sham. \n\nUnless it's a company where you have specific extra stuff to add, the time cost of writing and uploading a personalized cover letter outweighs the benefit it gives.\n\nAlso many recruiters just don't read them.",
            "CS is the worst degree you can get apart from basically all the other ones",
            "I graduated into the ‘08 meltdown and within ~2-3 years hiring was fairly normal.\n\nI would recommend you find companies in some niche you’re interested in or have skills in and try to use your interest or outside skills to help build your value to the companies you’re applying for.\n\nThis both helps you stand out & since they’re less main stream software companies they usually have less applicants.\n\nFor me, my first interviews were all with local electronics manufacturers who were interested in me because I had tangential knowledge of and interest in electronics which I could speak to from time working at RadioShack.",
            "The first job is the hardest to get. Keep applying while you focus on building our your portfolio. Also, make a LinkedIn and reach out to a recruiter. I've had great success with recruiting companies finding jobs for me without me having to apply (and they're free, since the company pays the recruiter a finders fee if you get hired and stay on for 6 months)",
            "Go into other fields related to tech but not software development specifically. Networking , system administration, cyber security, devops, consulting /sales, data analytics is super huge right now, \n\nAnd please bro believe me when I say ALLL OF YOU are so much smarter than the competition for data analysis jobs . Those people BARELY know sql and Python but get jobs making 80-90k and once a week got to make simple SWOT diagram and send a report to the business analysts. \n\nIf u know Python and sql , learning something like Microsoft power BI or tablaue can really propel you, make a dashboard app and ur golden imo for a DA job .\n\nReally in DA the philosophy is “don’t be a programmer , use programmers” , so that should say enough about if you can make it",
            "Sisyphus is the exact analogy I’ve used to describe myself",
            "This isn’t only happening in tech my friends I mean I never got into cs to go to a media company or those creative applications website, I’d rather do research or  quant strategies, the big tech companies are laying off but there’s so much more than just knowing html and css, use that python and c++/java you learned lol.",
            "Oh, another whiny post from r/csMajors. Yawn.\n\n“A bunch of Leetcode tasks I might not know” - Leetcode problems have an insane amount of resources to learn from and are literally just pure algorithmic CS. If that’s too hard for you, this might not be the right industry.",
            "If you are in it for a job then you should probably be smart and learn something that is in DEMAND cause CS workers are a dime a dozen.",
            "If you are just applying online on linkedIn or Indeed with their auto apply, you are just wasting your time. You need to apply with referrals, or speak to recruiters and managers directly. This has been true for all new grads in the last ten years. Almost no one actually applies directly on a job board in the industry.",
            "If you are good with AI I would just automate the process of applying to places or at least automate finding applications and tailoring resume/cover letter for them.",
            "Apply for a small start up and accept low pay to gain experience. That’s probably what I would do.",
            "Degrees have never been a guarantee for employment unfortunately no matter what schools may lead people to believe.  Take it from someone who graduated with an English degree into the Great Recession with \\~17% unemployment.\n\nYou may want to have your resume professionally reviewed or written if you aren't getting any callbacks.  If your resume checks all the boxes for HR you'll get interviews.  You can also freelance which is the route I went for years before being picked up by a startup.",
            "Do you think other new grads have it any different?",
            "Focus on cybersecurity and your job hunt will be over. Not enough people have cybersecurity experience for the amount of jobs.",
            "I doubt companies will read cover letters these days, since they receive over hundreds for each internship.",
            "It’s a good degree; the market will turn around."
        ]
    }
]