[
    {
        "post_id": "1719ny0",
        "author": "None",
        "title": "Can I be rejected from an interview for looking too good?",
        "url": "https://www.reddit.com/r/csMajors/comments/1719ny0/can_i_be_rejected_from_an_interview_for_looking/",
        "score": 495,
        "num_comments": 68,
        "created_utc": 1696591172.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1719ny0/can_i_be_rejected_from_an_interview_for_looking/",
        "comments": [
            "It's happened to me every single time, they don't say it directly but I know why.",
            "yeah, if they suspect that you can seduce the CEO and run off with all the investors' money",
            "There is an apocryphal story of the kid who didn’t get the Goldman Sachs job cause he wore a nicer suit than his future boss",
            "If you’re a cs major, you’re prolly like 90% of the population where looks aren’t a concern 💀",
            "In all seriousness, you can actually get rejected for dressing up or down too much.",
            "No, subconsciously. Look up the halo effect.",
            "Yes this is the reason why google rejected me, I'm just too hot for them",
            "😂😂😂",
            "Happened to me. Was interviewing from a entry role for a hiking company in vancouver. \n\nFeedback from the interview on call said they thought i was a hustler from my black suite jacket and was only in it for the money and didnt care about the product, contrary to me saying i was an avid hiker.",
            "This is a troll post but as a feminine girl I seriously feel like people do not take me seriously. It’s a bit scary when in an interview for a position I really want. I don’t want to stop doing my thing though. Life is too short",
            "You’re a cs major, clam down.",
            "I think you can... thats why I try to avoid wearing make up for my own.",
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)",
            "Happened to me. Was interviewing from a entry role for a hiking company in vancouver. \n\nFeedback from the interview on call said they thought i was a hustler from my black suite jacket and was only in it for the money and didnt care about the product, contrary to me saying i was an avid hiker.",
            "Dude don't make me laugh this hard in class",
            "Yeah. If you radiant to much holy light from your good looks then you may be a distraction",
            "slow down bud we got a gigachad over here",
            "Yes of course you're active on redscarepod lol. Jesus H Christ.",
            "No way in hell, dude! I would know, I'm the hot diversity hire who's front facing and deals with the stakeholders.\n\n(This is a joke before people come at my throat)",
            "All the time",
            "Yeah,  never look before then the interviewer or they’ll be afraid that you’ll be aiming for there position and that you’ll steal their wife/husband",
            "yeah, i don't know from personal experience (i'm ugly and employed), but my good looking friends are all broke and unemployed",
            "I once got rejected because my penis was too big I believe. They got really mad in the zoom call",
            "You wouldn't believe it but same thing happened to me at a Tesla interview. Crazy!",
            "To be serious, software industry is super casual in terms of dress code so for an interview I always avoid dressing up too fancily or putting on too much makeup. Maybe wear something that looks neat but not too eye catching.",
            "Yes, for multiple reasons. Just couple examples,\n\n1.) The job requires a lot of technical skills and the interviewer who has a bias to that belief will form the impression that you are not the right talent based on first impression that you are too well-groomed. \n\n2.) If you are a female candidate facing a female interviewer, your good looking can trigger her insecurities, and you are off of a bad start there as she will find reasons to justify that you are no good but just got the look.\n\nOverall however being presentable and being friendly are positive to interviews, but in some situations like above can backfire. I will say dress appropriately for the role, clean with good hygiene is your best bet.",
            "why do you need to worry about this tho😂",
            "Yes, that’s definitely why you were rejected. They realized you had all of the required skills, but you were simply *too* good-looking of a person, so they rejected you as a result.",
            "[removed]",
            "Stahp.",
            "Happens to everyone in this sub, join the club",
            "Yes, this happened to me once, very likely if the interviewer is from a certain subcontinent, but I won't reveal which one."
        ]
    },
    {
        "post_id": "ye4v4u",
        "author": "PhoenixAsh69420",
        "title": "Bloomberg interviewer doesn’t show up AGAIN",
        "url": "https://www.reddit.com/r/csMajors/comments/ye4v4u/bloomberg_interviewer_doesnt_show_up_again/",
        "score": 496,
        "num_comments": 69,
        "created_utc": 1666808055.0,
        "selftext": "Rescheduled my Bloomberg interview after getting ghosted the first time on Zoom. Had it today and got ghosted AGAIN. Waited 15 min on Zoom. These guys are something else 😂 if you don’t have any more spots available just reject me instead of playing this game of Zoom tag. Only reason I’m putting up with these goofy mfs is because of their TC.",
        "permalink": "/r/csMajors/comments/ye4v4u/bloomberg_interviewer_doesnt_show_up_again/",
        "comments": [
            "fuck em",
            "Dude. The exact same thing happened to me. I rescheduled for Halloween so I'm expecting another ghost",
            "I got ghosted too yesterday :) didn't bother rescheduling :)",
            "They don’t deserve any of us. Remember interviews are both ways!",
            "Which interview was it",
            "[deleted]",
            "Move on. It's their loss not yours.",
            "I've heard so many bad things about Bloomberg interviews oml",
            "[deleted]",
            "I work for Bloomberg, sorry this happened to you and anyone else who experiences this. Really just comes down to your scheduled interviewer not paying attention to their calendar, was probably the same one both times.",
            "Bloomberg is garbage. Worst interview experience ever had. Rude as hell interviewer and had a huge ego problem. “Dedicated” HR and recruiter for each school and my school’s recruiter went on PTO for 2 months straight lmfao so everyone at my school got fucked",
            "Fool me once, shame on you. Fool me twice…well.",
            "So many better companies out there lmao, they don’t deserve you",
            "Happened to me today also",
            "I think they reached their HC for this year.",
            "Sounds like that Community episode with the social experiment. How many reschedules before you go insane",
            "is their TC good?",
            "Waiting for 15 minutes and the interviewer still hasn't showed up. I scheduled my interview like a month in advance.",
            "Wow this sub is entitled. Make a business decision and stop scheduling interviews with them.  It's not about your emotional boo boo. Move on. They behaved unprofessionally: get past it.",
            "Reschedule the interview, just don't show up next time.",
            "Bruh I keep seeing talks about Bloomberg in CS spaces. I’m a CE major tho. But idk if you guys follow gaming news (lmfao you probably do), but is this Bloomberg the news company, that has this famous reporter Jason Schreier?",
            "[deleted]",
            "When will y’all realize that a lot of the other big tech companies from the start of this fall had multiple freezes/firings meaning more candidates applying for Bloomberg. So of course the process is slower/ a lot more hectic. Blame the other companies that aren’t hiring and if you don’t think Bloomberg is worth it then apply to Meta 🙂"
        ]
    },
    {
        "post_id": "sq87b5",
        "author": "None",
        "title": "There is nothing dishonest about not revealing to the interviewer that you’ve seen the question before",
        "url": "https://www.reddit.com/r/csMajors/comments/sq87b5/there_is_nothing_dishonest_about_not_revealing_to/",
        "score": 499,
        "num_comments": 58,
        "created_utc": 1644609758.0,
        "selftext": "I don’t even see it as an “honesty” thing. This is just ~~pure luck~~ the result of preparation. When you’re doing an exam do you go up to the prof and say “sorry I’ve seen this question before, can I get a different one?”\n\nNo one has ever done that in the history of exams, and it’s not “dishonest”. Also, it’s not the candidate’s fault if the interviews are designed by the company in such a way that a candidate could have seen the question on leetcode. This is what preparation is about, after all. \n\nI don’t even know why this is a question. Just answer the interviewer’s challenge and call it a day",
        "permalink": "/r/csMajors/comments/sq87b5/there_is_nothing_dishonest_about_not_revealing_to/",
        "comments": [
            "Just keep saying you've seen the question on questions you've never seen before until you get to a question you've actually seen before. <- the only algorithm you need to know for coding interviews",
            "Yup, that’s information that you take to the grave, it’s not like you’re a fraud for it anyway. \n\nI think the people who let them know feel like they need to struggle during the interview so it feels like a genuine accomplishment. It still is either way, your effort securing and practicing for the interview wasn’t wasted.",
            "Life be giving y’all lemons and y’all chose to throw them away. Weirdos",
            "employers lie to us all the time. He can promise to give you an offer and then a better candidate comes last second and you're history",
            "Lol people are actually letting something like that weigh on their conscience?  That's exactly what you want.  You want something you've seen before.  You should be able to explain what you're doing easier because of it too.\n\nThe world of making money is not about being \"honest and hard working\".  Obviously ethics get involved at some point, but as an individual don't let shit like that hold you back.",
            "It is dishonest. I’m constantly practicing for behavioral questions and I always tell the interviewer “I’ve already been asked to talk about myself before, may I have a different question?” The interviews are much shorter as a result. /s",
            "It’s not your fault if you’re properly prepared lmao",
            "Honestly, an even bigger flex is saying that you've seen it before, and then optimally solving the new question, but you have to have an insane amount of confidence for this.",
            "Companies do stupid shit all the time. Hell, the interview process is one of them. So fair is fair. If your interview questions are openly available on the internet then it’d be stupid to expect someone to NOT have already seen it. I mean, come on now.",
            "It's actually incredibly dumb to say that you've seen the question before. It in some capacity defeats the entire purpose of preparation. I 100% agree with your analogy. Also, unless you're blatantly obvious about it, your interviewer has no way of knowing. But I don't think this should even be something you want to hide in the first place.",
            "If someone asks you a question, and you give an answer you know to be false, then it is a lie. This is the definition of dishonest. \n\nNow, companies are acting in their best interest and so should you. Pretend like you've never heard of leetcode and the only experience you have with graphs is a coursework you did last year",
            "I mean, don't go \"The answer to your question is 7.  Next question.\"\n\nRemember that half of the interview is watching your problem solving ability and skill in communicating.\n\nOtherwise, all good.",
            "That's the strategy tbh. Practice so much that you aren't surprised",
            "It would be really bad if you say you know it and then answer it wrong. Lol",
            "I told my interviewer I had seen the question, and I got asked a different one. And I still got the job at FAANG. I'd rather be honest personally.",
            "Number 1 rule for interviews, behave how you would behave on the job. \n\nI like to be open and honest. So I've gotten a live code challenge that I've seen before, I mention it and go from there. Most times the company doesn't really care about the answer but how you got there. And really most problems we solve are not that unique anyways. Saying you have seen something and already solved it and can solve it again is a really valuable conversation to have during an interview.",
            ">When you’re doing an exam do you go up to the prof and say “sorry I’ve seen this question before, can I get a different one?”  \n>  \n>No one has ever done that in the history of exams\n\n&#x200B;\n\nActually it did.. during one of the tests in my uni last year, one of the students in my class got up in the beginning of the test and told the professor that he already did that exact test, someone sent him the test the day before so he and a few others did it as a practice exam to study for the real one\n\n&#x200B;\n\nAnd he defiantly did the right and honest thing telling her that, it would have been extremely unfair for the rest of the class if a group of students already knew all the questions",
            "Be careful with this.\n\nIf you have already seen the question while interviewing for this company and you stay silent, they might see afterwards that you told them nothing and reject you.\n\nOtherwise, it's not dishonest. There's a limited amount of questions anyway, so if you have done 1000 leetcode, the probability of seeing something twice is quite high.",
            "I understand the compulsion to want to score points with the interviewer/ company by informing them and exhibiting (ethics?) but resist the urge.",
            "Literally the whole point of Leetcode prep is to learn the patterns, so you can spot them when you see something you've seen before but worded slightly differently. It's the same principle as revision for school exams. Bizarre that some people call this dishonest, it's called 'being prepared', and many companies recommend their interview candidates to do this prep.",
            "True man. My friend had an interview he is really intelligent and hard working. In the interview the interviewer went through 6 questions which he had already solved he confessed after that he was able to solve the problem. Still he got rejected. When he asked for the review they said it was because they were not able to assess his skills through that interview. I mean wtf man. Doesn't it show that he worked his ass off just for an interview. He can do a lot more working as an employee.",
            "I'm way late in my career, but every time I say I've seen a question they don't care. I don't do much leetcode, but If they're asking questions that I've seen before it means they don't really care about having unique questions and they just have bad interview practices.",
            "Would it be an issue if you solved the same integral practicing for a calculus exam? It literally means you practiced thoroughly",
            "What if he never asked If you have ever seen this question ? You just go ahead and tell him you have seen this , what if he thought you are trying to evade the question ? What if that's the only question he master and know all intricacies of it",
            "test",
            "I always thought you do that if it’s during the interview you’re CURRENTLY in.  Like if in the second round a different interviewer somehow gives you the exact same question you solved in the first round, then say hey, you just did this.  It’s not for if you’ve seen the question during prep.",
            "It's only dishonest if the interviewer asks if you've seen the question before and you say \"no\". \n\nOther than that it's completely fine to not voluntarily tell the interviewer that you've seen the question."
        ]
    },
    {
        "post_id": "1bvmd7c",
        "author": "roguethrowaway0999",
        "title": "wyd in this situation",
        "url": "https://i.redd.it/0g3qwrp8mgsc1.jpeg",
        "score": 500,
        "num_comments": 15,
        "created_utc": 1712235167.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bvmd7c/wyd_in_this_situation/",
        "comments": [
            "Why would the CEO do this?",
            "Blind will tell this guy to sue just to see him lose all his legal fees",
            "I think you're actually supposed to keep your clothes on during the nap.",
            "should’ve made yourself a eunuch, failarmymoment",
            "RemindMe! 2 days",
            "Why is the HR noticing that",
            "RemindMe! 3 days",
            "RemindMe! 1 day",
            "RemindMe! 2 days",
            "RemindMe! 4 days",
            "RemindMe! 5 days"
        ]
    },
    {
        "post_id": "wv1uhg",
        "author": "fireoptionstrader",
        "title": "I don't like it when people say CS dgerees are (in a way ) a waste and meaningless to the actual job.",
        "url": "https://www.reddit.com/r/csMajors/comments/wv1uhg/i_dont_like_it_when_people_say_cs_dgerees_are_in/",
        "score": 495,
        "num_comments": 152,
        "created_utc": 1661194339.0,
        "selftext": "The CS major is meant to teach you a practical and logical way of thinking. Yeah you have to take linear algebra and discrete math with theoretical classes that seem to mean nothing, but I'd argue that they are useful. These classes teach you how to think and adapt your skill set. You can jump from one industry in one sector to another w a whole different job and transition with much more ease.\n\nA boot camp could never teach you these things. They can make you a web developer, but that doesn't mean you'll be able to transition and adapt.\n\nI think people who say going to college and getting a degree is worthless and a stupid financial decision need to actually evaluate all the skills you receive rather than hard skills.",
        "permalink": "/r/csMajors/comments/wv1uhg/i_dont_like_it_when_people_say_cs_dgerees_are_in/",
        "comments": [
            "I mean getting a college degree is the number 1 way out of poverty and certainly obtaining a cs degree is a great way to get a good paying cs job and perform. I think bootcamp/self taught want a fast track with the least learning possible. As you said the degree makes someone more well rounded and will probably pay off in the future.",
            "The only people who say degrees are worthless are business owners or employees who wished they had one.",
            "You can make this argument for nearly every single degree, there isn't anything particularly special about CS.\n\nWhy take computer science? Just take a bootcamp/just watch youtube\n\nWhy take a history degree? Just read some books\n\nWhy take a business degree? Just work at a business\n\nWhy take a communications degree? Just communicate bro\n\nHonestly though, why do you care if people say CS degrees are a waste? In my experience 99% of the time it doesn't even come from someone that works in cs.",
            "I've earned nearly all of my lifetime income in this career writing Haskell or ocaml. I dare say the mathy courses are damn well the most important ones in the degree, since they are simultaneously extremely foundational as well as being the hardest topics to self study",
            "Discrete math, algorithms, statistics and combinatirics are priceless and they will stay true forever.\n\nStupid js bootcamp gets outdated within 3 months.\n\nEvery page of algo book gives me understanding of one concept to solve one timeless problem. \n\nIf you spend 1 day to learn what memoization is you will find out that you can solve some problems within minutes instead of days.",
            "Yeah, thats why engineering degrees are seen as substitutes for CS degrees. Half my collegues at the FANG-adjecent company I work at have traditional engineering degrees (i.e Mechanical, Electrical, etc) including myself which have very little overlap with actual Software work.\n\nSoftware engineering is fundamentally about critical thinking, not knowing the syntax of x language.",
            "25y+ hardened professional here.\n\nYou want all the courses that are in a CS degree.  The math in particular.  But also the English and ethics.\n\nAnyone who says they're unnecessary isn't actually doing CS.  They're glorified script kiddies.",
            "I think people argue that there is no need to take those courses at an university, simply because you could learn them on your own and not have to pay big bucks to get substandard teaching. For my university, the math department is a nightmare, so people avoid math courses at any cost. Also, I’d say that linear algebra and discrete math aren’t really that useful for regular SWEs, but each to their own.",
            "Ya I fully agree, plus you never know where your interests will take you; having that foundation down is key. Makes it easy to pick up new skills/learn other concepts, people say lin alg/discrete are useless but if you get through them, ML concepts are easier to understand & the critical thinking/logic you gain from doing proofs is invaluable. If you can't reason correctly your code will suffer & algos/queries or whatever will be harder to understand.\n\nComputers are logical abstractions and consequently so is coding, so math is pretty userful ngl",
            "I studied math (now I teach CS) and always felt the same way about the math education I got in university. It turned me into a mathematical thinker, and *especially* the more theory-side, pure-math courses I took. Even though I don't directly teach those exact courses now, it gave me a solid grasp of the subject, in such a way that I can't imagine teaching without.",
            "People will say this but honestly if you want to get a BS I can't think of a more valuable degree to get. Maybe a BSE? I was able to land a full time SWE job while still in school. I graduated and made 6 figures (while working remotely, might I add) within the year. Not many majors can boast that.\n\nTHAT BEING SAID:\n\nI have a friend who had a good app idea. He took some udemy courses to get a basic understanding of Flutter and built his app. A very simple app that stores little data and doesn't do anything too intricate, yet it nets him \\~$1,000 a month. You of course don't need a CS degree to build your program. You just need to be intelligent and motivated enough to ... actually build your program. A CS degree just offers a different type of opportunity.",
            "The majority of employers who are hiring for developers want the candidates to have the degree. A bootcamp is good however I believe the degree is much better in the long run.",
            "If you're 18, have no financial obligations, and get into a CS program, 1000% a CS degree is worth it. Even with 100k in student loans. No one is saying that this person should do a bootcamp instead of a degree.\n\nIf you're 32 with two kids, working a full-time job that you hate for 60k, you absolutely should not be going back to school for 4yrs and taking on debt. A bootcamp is meant to fill this gap, people who want to change careers but can't afford the time/money to go back to get a bachelor's degree.",
            "Yeah, you’re absolutely right, and when you enter FAANG+, beyond some rare unicorns you see this in action. Not only this, but as much as people negate school name, depending on your target outcome it matters. There hasn’t been a single SWE I’ve met (not working on web apps, where even then CS underpinnings are extremely valuable for perf) without a CS degree. This is of course talking about engineers building new technology, like scaling infra, distributed systems/computing, AI (no bootcamp will ever work for this), etc but again, understanding OSes (a heavy subject) will make an enormous difference for even a mobile app dev, who may have been taught the “top” and never gone down the stack, as such they might not even know the implications of not freeing memory in app, or the app size binary. \nFurthermore, CS curriculums do *not* teach coding. They teach complex abstractions that are put into practice with code as the tool. Take queueing theory in a networking class for example — this is easily translatable to an Industrial Engineer optimization problem. To be even *more* controversial, having a strong math and general STEM background is key. For example, putting work for AP Chem/orgo in high school heavily paid off when learning MOSFET - physics understanding pays off when calculating optimal network routing, and so on. \n\nI’ll take the downvotes, but all I’ve done here is put my observations from 3 internships + 3.5 years of FTE at companies that tend to only want CS majors (and ones that many *not all* here may be targeting). HRT, JS, 2s would auto-reject a bootcamp grad (unless they had a physics, EE, stats, math degree). Basically all of these fields have a lot of overlap and complementary abstractions and your ability to impact as an engineer is amplified by knowledge of each area. But fundamentally your CS degree says you had the ability to actually understand how a modern computer works, and further that you’re capable of processing/communicating complex abstractions. \nI kid not, a fund I interviewed with asked me to run them through computer abstraction layers starting from a transistor up to a running, executing process. Had I not invested time in chem, physics, EE, Comp Eng, and finally low level CS I would’ve been shown the door. This is notoriously a very difficult fund in fairness. \n\nsorry for the rant folks, but OP made a post I’ve been wanting to for a while. Bootcamps are great for people who want to be web devs without needing to scale. Yea, there are bootcamp faang devs but they exclusively work on web dev/product (the ones who don’t do product always studied the other above majors) where their tooling is abstracted away by the teams who have CS PhDs. You can reason which team the companies value more.",
            "Bootcamp teaches you how to use the tools. College teaches you how to use the tools and also the theory behind them. It’s like the difference between a technician and an engineer.",
            "CS degrees are definitely not worthless, but having them be required for a ton of programming jobs also makes absolutely no sense. A lot of programming jobs *can* be done by someone with just the knowledge from a boot camp (or something else that is to CS what a trade school is to, say, mechE). \n\nJust like I wouldn't want an electrical engineer to wire my house, or an electrician to design an amplifier for an instrument",
            "Also a good place to network and meet like minded people",
            "The paper diploma you get is the only real useless thing out of it. Everything else, for the most part, involved in your learning: you get out what you put in.",
            "The vast majority of software engineer jobs for bigger companies won’t look at you without a degree, and you won’t look competitive without an engineering degree (CS included) \n\nSo even from just an HR perspective it’s very valuable.",
            "this is a popular opinion, actually. i go to the top school and i take tons of classes for fun just because they shape how i approach to different types of problems and i also get to learn tons and tons of random stuff (from footnotes, class forum etc) and i value knowing a little bit about everything.\n\nyou can do the job without college degree, but it's a fun and cool experience, i think.\n\nedit: i am from a third world country so i get financial aid but yeah they cost so much. not sure how i feel about paying that much..",
            "My CS degree is the only reason I got considered for the opportunities I'm applying to and/or have interned for. I'm not even applying for coding roles, but the CS degree carried heavy weight in creating those opportunities I can guarantee you that.",
            ">The CS major is meant to teach you a practical and logical way of thinking.\n\nclearing knowledge burden or linking up logical thinking is two different thing. are you sure your university training is enough just because it touched some calculus?\n\n> Yeah you have to take linear algebra and discrete math with theoretical classes that seem to mean nothing, but I'd argue that they are useful. These classes teach you how to think and adapt your skill set. \n\nexplain how eigenvalue is useful to general web development (note: not the machine learning side)\n\n> A boot camp could never teach you these things.\n\nMath can be easily self-taught, particularly for  anything below real analysis (aka cal3 and below, applied stats and intro linear algebra). these are all standard curriculum in asian high school. i do not think they are exactly helpful to either general web dev or when building machine learning model.\n\nask some of your data  guys in your company to see if they can explain everything they know rigorously all the way up to the point the tool they use.\n\n>I think people who say going to college and getting a degree is worthless and a stupid financial decision need to actually evaluate all the skills you receive rather than hard skills.\n\ngetting a degree is a signaling effect (as in economics). the math courses teaching you logical is pretty overrated. since most are only knowledge burden. they throw you all the tools and you link up the pieces for a proof. the content really  isnt as useful. am math grad working to cs.",
            "there’s this thing called the internet where u can arrange any sequence of one’s and zeros and teleport it to anywhere on the fucking planet\n\nthe value from a degree comes from the fact that employers still use it as a metric because people keep getting degrees so the only ones who don’t are poor or dumbasses so it’s just a very expensive filter",
            "I’ve never heard anyone diss the CS major",
            "Agree 100%. At the time I learned discrete math, I was like \"what is this useful for?\" and then a year later when we were designing digital logic circuits, the prof whips out concepts from discrete math to do things like state-reduction, and it was like that moment in Jurassic Park where the girl says \"This is UNIX, I know this.\"\n\nIn my experience, the ones who understand computing back to its roots are the rockstars.",
            "Also nobody said college is all about just getting skills for a career. There is just inherent value in a higher education especially if you are taking liberal arts classes in addition to CS. That's what college is all about.",
            "But it is. Source: me. Thousands of interviews, no one cares. All that matters is exp",
            "So I've always enjoyed the saying \"Success is the best revenge.\" Many times, those who discount the value of a degree end up working for the people who actually got the degree (of course, there are exceptions, but play the odds). Those esoteric math classes? They form the basis of machine learning and artificial intelligence. Even those English Composition classes pay off when you are writing funding justifications for the millions of dollars that your projects will require. Get that sheepskin!",
            "I guess you're not going to like it when I say the same, \"a CS degree means nothing to me\". What means something to me is that you can code. I value a coding academy certificate because I know from this that you can code.",
            "I have worked with people who had CS degrees who didn’t understand why comparing two reference types wasn’t working, and I have met people who self studied complexity theory.  There are all kinds of exceptions but for most people a CS degree is going to make you a better programmer, and you’re going to be forced to learn important things that you wouldn’t have the discipline to teach yourself.\n\nAlso if you get tired of programming, you can teach, you can emigrate to another country, or move into other careers because you have a STEM degree.  And there are some jobs/industries that won’t talk to you if you don’t have it.\n\nThats not to say you can’t be successful without it, but you have more opportunities if you do.  I have found since I have my degree it seems to be easier to get jobs that pay over 150K, where under that it didn’t seem to matter as much.\n\n(I was making 170K before I finished and I’m still glad I did it)",
            "Just seemed useless to spend 4 years learning peripheral info or just completely irrelevant info for 4 years instead of going straight into the core skills. The only other downside I see mentioned somewhat commonly is the burnout of 4 years of just learning before applying it outside of school projects. I know personally I wouldn't be able to do that. Also didn't have 100k to throw down on it.",
            "From what I have seen grads are a bit useless and don't know the bare basics when they come out of their 3-4 year long degree. The self taught people tend to be able to actually contribute sooner and have already built up a way of thinking that lets them solve problems without being babysat.   \nA grad, not so much",
            "Definitely agree with this statement. Plus, they’re literally a certification proving that you have the fundamental knowledge and theory to solve the company’s software problems. You’re giving yourself a competitive advantage compared to just saying that you graduated from a coding bootcamp/never had a proper form of education to get into the field.",
            "Idk i loved the stuff taught in discrete math lololol those are some interesting stuff later getting related to theories and its awesome",
            "> A boot camp could *never* teach you these things\n\nu dropped ur koolaid",
            "I’d argue it’s the same as someone not needing a physical therapist when injured. You could of course do all exercises and stretches at home. The vast majority of people won’t. So a PT helps them stay on track and ensures completion. Same thing with uni.",
            "Just want to add this. I interned at a FAANG and someone on my team had a physics degree from one of Harvard/Yale/Princeton although he had taken a handful of CS courses including algorithms.",
            "You don't have to like it.",
            "I have a degree and am an swe and I think the degree was useless in terms of teching me anything that I couldn't self teach outside of it. The main thing that I got from the degree are connections and the degree certificate which proved to employers that I can finish a degree and I'm not stupid. Otherwise, with enough will, you can learn everything by self study.",
            "Basically every career where your degree isn’t part of the requirements for your title, a degree could be useless in the sense that it might not be needed by some very driven individual. But that’s not most people, most people need some sort of formal education to to have a certain amount of subject matter expertise.\n\nSo I’m gonna go get my degree, because I don’t like my chances will a YouTube education.",
            "Playing devils advocate...\nSeems like majority of the subreddit agrees with OP hence from the high upvote count on this thread. However, would this discussion be deemed bias due to this being /r/csMajors where everyone here has some interest or connection to CS.\n\nFrom a personal standpoint I understand the opinion of OP's, but are we discussing is a CS degrees useful or are we just comparing degree vs bootcamp?\nIf the latter, I agree with OP, if not I'd argue the opposite to an extent.",
            "Your arguments are moot.\n\nYou can learn how to think and adapt through practice.",
            "Also how do people learn programming from scratch to be job ready in a few months? I've seen it everywhere, learn how to code in 3-6 months! Maybe a basic command line card game",
            "As an employed SWE that’s moved into cybersecurity which has a CS degree. I think there’s plenty of work for the boot campers to do and for CS degree folks too. I’d expect the degree holders to be leading the projects/architecting and the bootcampers to be implementing. But I’m not sure about things like DevOps for bootcamping. The networking and security classes I took at university were really helpful for setting up VPCs, subnets, gateways, etc.. to support web apps and services.",
            "I got a machine learning internship off of my freshman year of CS just because of my university's reputation. You won't learn about ML, AI, neural netwroks or robotics in boot camp. When I was applying for my intern visa, they specifically requested a letter from my university that my internship matches my degree.\n\nBoot camp teaches you the basics, and you'll be among a million others who know just the basic gist of cs. In university (obviously depending on how much you want to delve into certain aspects of CS) you get to explore topics more in depth like cybersecurity, cryptography, robotics...etc.\n\nAlot(all actually) of the prestigious jobs that pay 400+k$ per year in CS and software recquire you to have formal and/or further education in the field."
        ]
    },
    {
        "post_id": "1af4qes",
        "author": "AquaticFury",
        "title": "My SWE Internship Application Experience",
        "url": "https://i.redd.it/2bxtfazcbofc1.png",
        "score": 496,
        "num_comments": 55,
        "created_utc": 1706662342.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1af4qes/my_swe_internship_application_experience/",
        "comments": [
            "&#x200B;\n\nhttps://preview.redd.it/f5v6mmt0sofc1.png?width=1125&format=png&auto=webp&s=f1e45f1be9ee676fe02fbbf457e2719e5f94b37a",
            "Thanks for the nsfw tag, this is not something for tame viewers.",
            "It’s tagged nsfw because of what OP did to the interviewer to get the job",
            "Thank you for the NSFW tag I would’ve screamed so God damn loud they’d have no option *but* to fire me",
            "https://preview.redd.it/oqjcx4bxwpfc1.png?width=1125&format=pjpg&auto=webp&s=5c034e30308b47ff6208e40901fc139bcc7c55e8",
            "Nah no way",
            "I refuse to believe it 😭",
            "“With all due respect, Fuck you!”",
            "☹️",
            "How do you guys make these charts?",
            "https://preview.redd.it/b1kdps4bsqfc1.jpeg?width=1024&format=pjpg&auto=webp&s=7f22e4fc970760eed66fe4f0dbb43b61187a1a0e",
            "Jesus Christ… congrats, fuck me…",
            "in 2007: 4 applications, 2 interviews, 1 offer, salary was 3x average wage in my country.   \n\n\nI was still in uni. Good times back then.",
            "My day is ruined",
            "\\-You are hired!\n\n\\-Thanks.\n\n\\-Is that all You want to said?\n\n\\-Thanks, uncle?",
            "Congratulations, and fuck you ",
            "same here. feels good but also guilty seeing your friends without an offer",
            "gigachad",
            "What job/company did you go for?",
            "im about to get disrespectful",
            "What does this graph called?,how do you make it?, btw congrats.",
            "aint no way boy  😭😭😭😭😭",
            "The other candidates:",
            "No cap, me fr.",
            "diversity hires are playing easy mode fr fr",
            "Daddy's company",
            "Seeing the current situation you must be a girl or really skilled."
        ]
    },
    {
        "post_id": "xrht4i",
        "author": "fluffysandalz",
        "title": "Choking",
        "url": "https://www.reddit.com/r/csMajors/comments/xrht4i/choking/",
        "score": 497,
        "num_comments": 68,
        "created_utc": 1664482480.0,
        "selftext": "oh my lord I just choked so hard in that fcking interview they had 4 people watching me code at the same time and I forgot how to code over a matrix while staring at them with my dumb face I just want to hide and never show my face again",
        "permalink": "/r/csMajors/comments/xrht4i/choking/",
        "comments": [
            "Yeah it happens. In my C1 interview I totally forgot how to read and write basic code in front of my interviewer. Under the pressure of live coding even a LC easy becomes a medium",
            "youll never see those people ever again its okay",
            "same i forgot how to implement a linked list in my first interview lmao",
            "I didn’t had the guts to even join the meeting once, it happens. You’ll get it next time!",
            "lmfao just choked as of an hour ago on probably the easiest final I’m gonna get so right there with you 🫡",
            "Same",
            "Choked such an easy final interview problem for an elite tech company, it happens",
            "I had a similar experience with my amazon SDE Internship interview. Forgot how to define a function bro, it happens. There's always next year",
            "Same you’re not alone",
            "[deleted]",
            "Nobody else exists and is an npc and you are the Liam character. Approach life in this way and simply don’t care what people think.",
            "Happened to me the first time",
            "[This comment was retroactively edited in protest of Reddit's enshittification regarding third party apps. Apollo is gone, and now so are we. Fuck u/spez.]",
            "I feel that I got asked what’s the value of an integer and had no clue what he was talking referring to or talking about😭😭😭",
            "It happens, now you know how it feels so you’ll be ready next time! the only way out is through!",
            "it doesn't matter how hard you fall.... but how hard you can fall and then get back up!!!",
            "Don’t worry it happens. Important thing is to not let it get to you and keep going",
            "It happens. I got asked to explain one of the apps I created and I stumbled my way through and was cut off due to lack of time. \n\nNever doing a 9am interview ever again in my life.",
            "It happens to the best of us! Keep your head up and take as many interviews as you can. You’ll get better as you go :)",
            "I've never left the an interview meeting, but I've wanted to... it happens. Practicing in front of the mirror/with live partners under time duress helped my interviewing tremendously.",
            "Make sure you tell them, omfg y’all’s big dictionary energies are so huge",
            "I choked today too on a final round. I know that feeling bro.\n\nThis is my last summer for an internship too... guess I'll have the new grad cycle to try again.",
            "4 people made you choke…? On what?😏",
            "Choking is just your subconscious telling you that you actually don't want to work there",
            "Lucky you, I can't even get to the first coding challenge. Automatic rejection for me days after submitting a resume and cover letter.",
            "lol rekt\n\nhope you do better next time friend",
            "4 people watching you??? What company does this?",
            "A week ago three interviewers watched me literally forgetting to type everything single semicolon.",
            "Hey! It happens to the best of us. Don't worry. You are so talented and maybe there are better opportunities to come for you!!! :) Sending positive energy your way!",
            "If it's any consolation, I had the easiest interview with a dev who was asking basic OOP questions and I just bombed every question because I was nervous.",
            "Think of it this way: they will never see your face again and your next interviewers won't know about this interview. \n\nAll that's left to do now is get back on that horse and prepare for your next interview. Don't forget to see if there is anything you can learn from failing this interview, anything you can improve on. That way it won't have been a waste.",
            "4???",
            "In my very first coding interview, I forgot how to bubble sort.",
            "it's happens !! Now got an experience for the other one, cheers !!",
            "This is how I feel when coding for/taking tests. I seriously forgot how mod works today.",
            "“There’s no shame in failure if you gave it an honest try.” - Ron Swanson. And hey, sometimes an honest try means waking away because the vibes are off. Own it.",
            "Happened to me a couple of days ago! \nI knew the solution and I still could not convey it to the interviewer \nIt was for a tier 1 company😭😭😭😭😭😭😭😭😭😭"
        ]
    },
    {
        "post_id": "jumm7t",
        "author": "CDFalcon",
        "title": "Friendly reminder: Leetcode doesn’t measure your programming ability",
        "url": "https://www.reddit.com/r/csMajors/comments/jumm7t/friendly_reminder_leetcode_doesnt_measure_your/",
        "score": 501,
        "num_comments": 37,
        "created_utc": 1605450268.0,
        "selftext": "Talked to a lot of students these past few weeks who expressed shame over their inability to solve problems with consistency. Just wanted to remind everyone here that Leetcode is intended to work as a standardized test, not as a comprehensive measure of your ability or intelligence. Just like the SAT only really measured how good you were at taking the SAT (if you are US), Leetcode interviews only determine how well you study Leetcode. People will dress it up, but at the end of the day these tech companies, which receive thousands of applications for a single position, needed some way to weed out applicants, and so they settled on standardized testing. It is necessary because there are simply too many applications to just give interviews to everyone, but that still doesn’t mean your success with these interviews reflect anything but the effort you put forth to master this very unique form of standardized testing. Take care everyone!           \n\nEdit: a few people are commenting and saying you still have to practice it to get a job, and you are totally right! The purpose of this post wasn’t to imply Leetcode is a useless skill, merely that it is not the best indicator of your programming ability or intelligence, nor is it meant to be. Obviously you should work on your ability to solve these problems because it will help you in the future, but don’t let them get to your head. Cheers :)",
        "permalink": "/r/csMajors/comments/jumm7t/friendly_reminder_leetcode_doesnt_measure_your/",
        "comments": [
            "LeetCode measures the worth of your entire life don't @ me",
            "Too bad, 99% of the companies out there do not share your opinion, as much as I don’t like it.",
            "LeetCode is just a website that contains algorithmic problems set up in a programming environment. The problems are quite interesting in nature as they require some mathematics, basic programming syntax, and usage of various data structures as tool to solve the problems. What these problems actually measure is mathematical problem solving skills in a programming environment. It is just like a basic aptitude for problem solving using programming as a tool. Many companies asks similar problems at interview in order to check candidate's problem solving aptitude. The ability to develop and design a software is not necessary conditions for these companies as they care more about candidate's overall programming aptitude and the reason according to them is that if a candidate has algorithmic thinking to solve these problems then he/she can develop or design software in a more efficient way and his learning ability is also understood to be of higher order.\n\nBut for any company, these problem-solving interviews are not complete requirement for candidate's selection. They also conduct system design interviews, do project discussion and also behaviourial interview. Projects in resume do not play a major role still it is a necessary to have some good projects to get the resume shortlisted. The candidate who practice problems like that in leetcode website, tend to become a good learner and learning software engineering and making interesting projects become quite easy. \n\nAll the best!",
            "100% true and the SAT comparison is spot on, but are there alternatives? If you’re a company with 1000 applications how else can you find the best candidates?",
            "I’m going to go against the grain here. I think leetcode has improved my programming and general problem solving skills. And I would say that generally, someone who can quickly solve a hard compared to someone who can’t crack an easy probably has better programming skills. \n\nIt’s extremely stressful and annoying that companies use it for interviewing, and whether leetcode is actually a good criteria for finding good SWEs is highly debatable.",
            "Wish I could give you gold on it.",
            "I think that true for most general places, but if you want the competitive companies like college your not getting unless you have a high sat=good leetcode skills most of the time.",
            "It does measure your ability to get a job tho",
            "It doesn’t until you realize you don’t know shit",
            "Needed to see this, thank you 🙏",
            "This is sooo true",
            "Helps your problem solving skills and reminding you how to solve certain problems in the most efficient way. But I agree, doesn’t help you in “programming”. But as a friendly reminder, Top companies don’t necessarily want programmers, they want problem solvers.",
            "Insane cope. Someone better at leetcode will, on average, have better problem solving skills.\n\nDo you work in NLP and have to do part of speech tagging? It's all dynamic programming, as difficult as LC hards.\n\nDo you have to make n-gram language models? It's all sliding window and dictionary algorithms.  etc and etc.\n\nPosts like this are just to make yourself feel better about not being able to solve LC and you know it.",
            "You need to practice it for the interview though.....",
            "> these tech companies, which receive thousands of applications for a single position, needed some way to weed out applicants, and so they settled on standardized testing.\n\nSo it is a measure of your programming ability.\n\n> Leetcode doesn’t measure your programming ability\n\nIf you can't get a job due to your leetcoding ability, then you don't get a chance to utilize your actual programming skills, so leetcode might as well be the measure of your programming ability.",
            "I have been solving Leetcode problems for 2 months now it really has helped me get better at my problem solving skills. Now whenever I see a problem I get the approach real quickly even if its not of the best time and space complexity. It has really helped and will do in the future too. So stop wasting your time here bitching abt platforms and get a life.",
            "mostly wrong but whatever",
            "Leetcode is essentially the dunking of programming. Some people are naturals: tall => smart, and have a big advantage. It’s one of the flashiest ways to demonstrate your abilities. Knowledge of basketball => programming is whats most important, but it certainly helps to be able to dunk => leetcode.",
            "But like the SAT, it’s a decent proxy for general intelligence.",
            "Good read"
        ]
    },
    {
        "post_id": "v8gb0p",
        "author": "vvrim",
        "title": "Professor uses LeetCode problems in assignments, accusing students of plagiarism",
        "url": "https://www.reddit.com/r/csMajors/comments/v8gb0p/professor_uses_leetcode_problems_in_assignments/",
        "score": 500,
        "num_comments": 74,
        "created_utc": 1654779552.0,
        "selftext": "Hi I'm new to this sub.\n\nI am a college student taking the algorithm course. In our assignment, professor put links to some leetcode problems and ask us to solve them (Medium, Hard level). I already solved those problems before taking the course as I was preparing for interviews for some internship. So I just copy-pasted my solution and submitted.\n\nNow, he publicly accused us of plagiarism because many students submitted similar code. To be honest, I also learned the solution from YouTube videos, so there's a high chance that my code will look similar to other students who watched the same video, or just read the similar code from leetcode discussion.\n\nIt's not formally announced yet and grades are not out, but I'm very scared right now. I don't think it's fair to say we were plagiarising. What should I do if penalty is given?",
        "permalink": "/r/csMajors/comments/v8gb0p/professor_uses_leetcode_problems_in_assignments/",
        "comments": [
            "[deleted]",
            "Plagiarism? The solutions are all the same",
            "Yeah I'm not sure what the professor was expecting. Students will have similar code because the first thing you do when you get stuck on a problem and get tired of banging your head on the wall is to look at the other solutions.",
            "Honestly, call him out by sending an email to the department he’s working under, saying that since you already did the problem in the past no wonder it looks similar to the online solution. If you complain about feeling disappointed that you’re paying money to be given free online leetcode problems, he’s in a spot of trouble",
            "Most coding questions have a sort of Canonical solution so you can't really plagiarize it, you just learn it and know it. It's the same reason you can't ask leetcode questions in an interview, you might get a memorized response.",
            "That’s weird, my prof let’s say use the class code he taught line for line in our DS&A assignments,  usually he’ll show us how to do 70% of the assignment and show us the concept off how to do the last 30% then leave us to code that part ourselves but he said don’t worry if your code looks similar to others because it will lol",
            "That is definitely not plagiarising - I am really not sure what the professor was thinking. Leetcode has like a million users and if you were preparing for interviews there is a high chance you would have seen this question already. If you do get penalized (which I don't think you will) I would try to talk to the teacher to explain the situation. If he doesn't believe you, I would reach out to the head of the department and explain the situation.",
            "The prof is so lazy that they can't theme and variation the questions like every instructor in history?? Not your problem OP, you're fine",
            "oh wow a LeetCode course then...lol",
            "Show him your leet profile, submissions long before assignment guarantee proof it wasn't \"plagiarism\" but some profs will ignore reality for whatever nonsensical excuse.",
            "Just show the honor board that this was your solution submitted before you took the class. Open and shut.",
            "My dsa prof would present leetcode easy problems ask us to solve them or come up with an approach at least for 5-10 minutes then walk us through it. Kinda bs yours is doing the opposite",
            "This was common when I was going through CS, especially the Machine Learning, AI, etc. classes where there’s a lot of abstract principles. \n\nThe best advice I can give is that if you DO copy code from somewhere, find ways to restructure it, recreate the flow, use alternate variables/very blatant stuff, try to find a creative way to approach the problem that *resembles* the solution without straight copying it. Try adding improvements to it as well. Challenge yourself as much as you can. Restructure classes, methods, functions, signatures, expressions, weave in new stuff, etc. \n\nA good way to do this is put solution code on one window for a “flow” guide, and rewrite yours completely from scratch by hand without copy/pasting any of the code and add your own flare/signature to it. I found I learned a lot more when I took this approach as well, as I had to process character by character, block by block, etc. and it eventually became clear. Then I’d rewrite it a few different other ways as well to make sure I really got it. \n\nIf at that point there is still criticism — just make sure you cite where you got the code from, ask to meet with your professor, see if s/he can walk through it with you and help you really comprehend it. Even the most asshole professors I had at their core really did want to help when I was struggling — they just didn’t want me slapping my name on something that was very clearly a CTRL+C CTRL+V job. \n\nGood luck and hang in there!",
            "Wtf, most leetcode solutions are going to look pretty much the same. Know problems have known solutions...that's like half the point of the algorithm classes. Imagine accusing someone of plagiarism something like a solution the knapsack problem. This prof sounds like a tool. If you do get hit with a plagiarism offense make sure you seek out resources to help fight it .",
            "Ask your professor what a “non plagiarized” solution is supposed to look like lmaoo",
            "Lazy ass professor",
            "I teach at a university part-time in the evenings on top of my day job in industry. One of the classes I teach is a programming class, so hopefully I can give some insight from a professor’s perspective. \n\nFirst off, I would never give problems that can be found on LC as homework. Maybe as an in class exercise, but certainly not anything that would be graded. That’s just asking for plagiarized answers. \n\nYou need to understand that when a coding assignment is given, it is 100% *expected* that solutions will be similar. All students are receiving the same education, learning the same fundamentals of algorithmic design, data structures, etc. and the problems given coincide with those lessons. However, the assignments are also semi-complex and every problem literally has an infinite number of solutions. Most importantly, and this is where a lot of people get hung up, **there is a vast difference between a *similar* solution and a *copied* solution.** It is extremely easy for a professor to distinguish between the two. \n\nIn the former scenario, you may have two students who take similar approaches to solving a problem, but do so with different code, even though the overall structure and algorithm may be similar. They both solved the problem without copying code and wrote their unique (albeit similar) solution. This is perfectly fine and expected. \n\nIn the latter scenario, you have a student who obviously copied code (either from another student or a solution found online such as YouTube or LC forums) and simply copy / pasted and maybe tried to change variable names thinking it would be enough to fool the professor (it isn’t). This is the scenario that is plagiarism. It is plagiarism because the student is just using other people’s code without doing the work themselves, creating their own solutions, or understanding what the code actually does. \n\nI have no issues with students using google to try to get an understanding of how to approach a problem, seeing how others have solved similar problems, and adjusting their solution from there. That’s how real life works much of the time. What I do have a problem with is students just copy / pasting solutions and trying to be “tricky” about it and pass it off as their work.",
            "Call him out for plagiarizing the question. Worst case, report him to the department.",
            "there is nothing you can do about it, if you call him out and he finds out that you did that you're done, you just can not win against teachers in any situation.\n\nin fact, in my 2nd year in college, my professors used to make mistakes when they graded mid-term, final, etc.., I always found out they gives me a wrong mark I tried to talk to them they always ghosted me, and ignore me and lost like a total of 20 grade ;P.",
            "Yep, you can plagiarize yourself, meaning, it's academically dishonest. Learn to solve those problems without youtube or you'll never make it.",
            "I ran into a similar situation with my algo prof but he was reasonable and realised at some point people have to look up the answer, so he just asked that we cite any algos we did not write our selves. From a purely academic stand point what you did is absolutely plagiarism, but if you cite the work your butt is covered in terms of \"administrative action\" it is however up to the prof if they want to except the work you have emulated and cited. Best of luck 👍.",
            "How? How can anyone plagiarize that?",
            "I wouldn't worry too much – seems like a lot of people are in the same boat, and there isn't much variation among the correct solutions.",
            "“Self-plagiarism” is the concept of reusing your old work, you’d think it’s no big deal since it’s your own work but it likely violates an honor code policy at a university. If you get the same prompt for a paper in an new class as a class you did before, you can’t reuse the same paper you wrote, or even parts of it without citations. Copy/pasting published code, even if it’s your own, is going to be grey area here.",
            "Escalated. If you innocent, there is no reason to be scared. There is no way around having similar answer in coding. There may be more solutions to the same problem but 90% of the student will have the same answer with the least complex solution. If he really want to prosecute people, just tell him to make a quiz of some sort.",
            "Wait can you explain why a prof is using Yeetcode as assignments? \n\nCan't they be more creative for data structures and algorithms?? We have to implement Red black trees, heaps, and some sorting stuff.\n\nHow will interviews work if Yeetcode is getting thought at schools lmaoooo",
            "The professor is the one who plagiarize",
            "Unless you copy pasted a solution from another source that other people also have access to. It will be hard for the professor to win the case.\n\nAt least for my university there is a tribunal for these kind of things. I used to be a teaching assistant, and I generally don’t report unless it is so obviously copied (like if they are stupid enough to copy the code along with original comments).",
            "If you submitted a solution when you did it on leetcode, just show that you completed the problem in the past. There is a submissions tab with a timestamp that you can show them.",
            "This professor sounds like a moron. I don’t care if he has a million credentials, he’s probably a dumbass and you should email him that",
            "Hahah classic everyone plagerises from one dude who solved the question 5-10yrs ago. Love it",
            "Escalate to higher ups if something happens. You have a valid case of misconduct, that shouldn’t be considered plagiarizing",
            "Surprised he hasn't had a mandatory quiz or exam based on the weekly comps. Although he/she might get different answers there instead.",
            "Out of curiosity, how much are you paying for that course?",
            "Familiarize yourself with your institution's appeals process right now. Start gathering receipts on everything that was said and everything you did. \n\nIf you are eventually accused, meet with the professor and explain that you intend to dispute this via the process that you've previously researched. There's a chance he will back down at this point.\n\nIf he doesn't, pull the trigger. Academic dishonesty is a serious accusation and you should fight it."
        ]
    },
    {
        "post_id": "1chtl9i",
        "author": "mastertechmind",
        "title": "My code was found to be Plagiarized, but I didnt cheat. What to do.",
        "url": "https://www.reddit.com/r/csMajors/comments/1chtl9i/my_code_was_found_to_be_plagiarized_but_i_didnt/",
        "score": 495,
        "num_comments": 119,
        "created_utc": 1714588571.0,
        "selftext": "Professor says my code was found to be similar to someone else's code using their plagiarism detector. I know I didn't cheat at alll and had done the coding myself. I tried to tell him, but was told my code was similar, but has some extra lines of code and different names. Like out of the whole class only 10% completed it. I was one of them. I got a zero on the assignment and also points taken off my overall grade. What should I do. Im in college and I know i'm innocent.\n\n  \nUpdate I talked to the professor. Was told his AI detectors found it and I just have to appeal but 99% of the time the professor are always on the right said bc ik they both work for the school.",
        "permalink": "/r/csMajors/comments/1chtl9i/my_code_was_found_to_be_plagiarized_but_i_didnt/",
        "comments": [
            "Fight like hell if your code is not identical (word-for-word) or syntactically identical to someone else's code. You'll need to keep fighting to get a good grade in this case. After all, this is about more than just a grade; it's about your future livelihood.",
            "Do you have an idea how it was plagiarized? \n\nWas it shared with another student? Was it hosted on a public git repo? Was the code based on an online example? Did you use copilot or chatgpt to help write it?",
            "[deleted]",
            "Talk to your teacher. \n\nThere is legal precedent that in many instances, your code isnt considered plagiarized.\n\nGoogle V Oracle concluded that certain tasks (such as checking an index as out of bounds) are so vital/granular that they don’t violate copy. This standard often applies to CS assignments where there really is a standard way of completing an assignment that is bound to cause similar answers.",
            "Is there a student office / guild where you can get advice on how to fill out an official complaint? Universities will have a process. Otherwise you can also talk to the person above them, eg the department head, and so on. \n\nBut often those people don’t respond until you start the bureaucratic paperwork process against them. This happened to me when I missed a quiz while literally dying in hospital. I submitted evidence and they just said sorry rules are rules. Once I went through the official process they quickly changed their tune (which was literally clicking a button so I could do the quiz). Sigh. \n\nBeing flagged by an AI detector means nothing, they’re literal garbage. \n\nHowever this is also why it’s a good idea to use some source control while you’re coding so you have a time stamped history of how the code evolved. It would help, but even without it, the burden of proof is on them, not just “well known broken tool go brrrr.”",
            "With the age of ChatGPT, I read a case where the student had his essay rejected for the same reason. Now he uses his webcam and screen recorder to record him working on his assignments. That way he can refute claims that he copied it. Let’s face it, how many ways are there to code something? Sooner or later, there are going to be false positives",
            "if its a beginner course, there is only so many ways it can be accomplished. talk to your prof and ask what was caught and walk him through your code and why you did it that way and such. ask to compare with the person he thinks you plagiarized it from. if you really did not cheat you have to fight it but be calm about it. gl",
            "ask to meet with your prof and see if you can talk it through with them in person. its possible someone got ahold of your code somehow and you didnt realize. if thats not possible though you need to appeal to them and show that you can demonstrate that you wrote your code/are knowledgeable about how it works. \n\nas a TA, i will say that we can usually tell when code is copied, so it would be strange for a false/positive to happen",
            "I faced this once.  It was an old JAVA class but I had been a coder for a while.  So I submitted what I thought was pretty well crafted code that just implemented standard GOF patterns.  Detector came back and said I cheated .. cause ya'know most of the time we are just spinning our wheel in college classes.  I had a call with the school and tried to explain that sometimes coders use patterns to create code and it's pretty standard.\n\nWell they called me a liar and told me to do it again.  So I wrote it all in spaghetti code and submitted it and passed with flying colors.  College is a lovely place.",
            "If teacher won’t listen talk to dean",
            "It is stupid Ai sometimes. I got once for a super short program (which is very common have similar even same variables and logic)",
            "Maybe go through every line of the code and explain what it does. A lot of the time people who plagiarise have no idea what the code is supposed to because they’ve just copy and pasted it in. If you show you have an understanding of it then you may get some leeway",
            "Agree with the other comments, maybe also consider reaching out to your university's student advocacy office. They likely have more experience and resources to help you navigate this situation.",
            "Happened to me. Teaching assistants showed partner and I how to do the assignment and left comments for us. Those comments and design got us flagged for plagiarism. If we didn’t save a picture of our office hours meeting notes from the whiteboard we would’ve been screwed with a capital F.",
            "Hopefully you did it on git, so you can show the version history to the dean.\n\nOtherwise, not sure about this but visual studio (or vs code) might have their own version history.\n\nIt's important to allow you to show your mistakes while writing, how your code changed over time to become more similar to the other student's, and the time you spent on the assignment.\n\nOf course, bring in excerpts of articles about AI detection being faulty, such as the US constitution being flagged as AI.",
            "Ask him for the rate of false positives that his software gives and go on from there. If he is not aware of it, tell him that he needs to actually understand how ai software works. If he says 0% he is full of shit and you may need to scale this up",
            "Do you have proof of incremental progress?\nThe gold standard would be if you have a git repository and can show how you built your solution. Another option is if you can show some sort of flie history that most code editors have.\n\nI can't tell which story it is because on one hand you're claiming they said that you and another student have a similar solution but on the other hand they say that it's AI detection. \n\nAt the end of the day, it depends how similar your solutions are. If it really is just \"different names and a few extra lines\", you are probably screwed. I'm not sure if there is some language barrier hindering your description though. \n\n It is virtually impossible for you to generate a solution that is similar to that of another student for an assignment larger than ~200 lines of code. Even the same algorithms used will probably have different abstractions, different ideas, different quirks.",
            "Op you'd be surprised how many professors plagiarise other professors when creating assignments lol. Try copying and pasting your assignment online and tell me you don't find another one just like it.",
            "Ask to look at the source code and understand better their methods for detecting copy cats and ask to see the \"original\".\n\nIf he doesn't comply then that's a red flags anyone can say anything at that point.\n\nIf he does comply then at least you have something to work with and you can see if it really is just coincidence or a bad AI\nIn if it is an AI ask to see the data? Is it historical?? Eventually it's bound to detect anything as a copy.",
            "Regardless of what the outcome is going forward use Github for version control and commit often. This t's a good way to prove progress in the future",
            "You need to make sure this can’t happen again. When working on assignments push the code to a *private* GitHub repository for example so that your efforts are date stamped and away from public view. That way you can prove that your efforts precede the similar code found by the AI tool.\n\nRegarding what you can do now, I would go ahead with the appeal irrespective of the potential outcome so that if the same situation pops up nobody can claim you “admitted guilt” by not taking it further.",
            "Just remember your professor isn't an authority figure anymore like highschool. They are providing you a service and you can continue to raise the issue to the next person in charge. Someone failing you on an assignment without evidence seems like a breach of contract from the school.",
            "ridiculous that a CS professor can be one to trust generative AI to a fault.",
            "scary trees practice wise poor squeamish strong languid unique automatic\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "The bigger issue here is that a CS professor is using an AI plagiarism detector. That's professional malpractice, anyone who doesn't know better is unfit to teach and should be fired.",
            "This is a serious accusation against you, especially in current ChatGPT times. Folks who use LLMs are already typecasted and you shouldn't get caught out. I don't know your school's policy, but for me, it's:\n\n- Meeting with the Dean, zero grade\n- Meeting with the Dean, zero in the course \n- Meeting with the Dean, expelled\n\nHow does your school check for plagiarism? I am a bit older than the folks here and in my day we used something called MOSS by Stanford. It uses a winnowing algorithm to normalize tokens, however profs that use it have to configure the program so that when a fragment of code happens often enough, it is marked as a false positive (otherwise, something as simple as checking if an array index is out of bounds will cause concern). It could be because only 10% of people in the class did the assignment, this might have tripped it (assuming your school uses MOSS). I don't know what modern \"AI\" solutions do other than that.\n\nEither you do nothing and take it on the chin or fight it and at worst, still take it on the chin. Assuming you're innocent, I would not want to live the rest of my alma mater waiting for another false positive to get my grade in the course zero'd, potentially delaying graduation. By letting this first incident slide you give the faculty more ammo in later, spurious cases, both for yourself and the other people falling victim to these newfangled tools. \n\nRegardless of if you're innocent or accidentally plagiarized GeeksForGeeks, you are still entitled to see the evidence and defend yourself. I remember a similar situation to this. We had to implement Boyer-Moore's string matching algorithm, and almost nobody I knew did it except a few folks and I. We all copied the textbook code, because unlike 2SUM, there's really only one way to implement BM (aside from small syntactic differences). Fortunately the MOSS didn't catch me. \n\nProfs need to treat these tools as smells/indicators, and use better judgement upon trigger. \"Necessary but not sufficient\" as the true crime statisticians would say.",
            "Talk to the Dean.\n\nI had a professor who at the end of the semester, asked all the students to give BACK to him all of their graded assignments.  apparently the moron never actually wrote down anyones grades.  HOWEVER he also never gave back ALL of the assignments.  So out of like 100 assignments, we all had maybe 30-40 depending.  Some folks got some back while others didn't.  The guy was insanely disorganized.  and he assumed that if folks didn't turn back in their assignments, then they must not have done them.\n\nHe Failed the ENTIRE Class.  \n\nSadly, it was spring semester and i was switching majors that summer, in part because a lot of teachers in that degree were like him.  So i completely missed out on the fact that half the kids went to the dean to complain and got their grades fixed, while i didn't.  I had no clue.  and didn't find out until midway through the Fall Semester and was told at that point it was too late.  Was very pissed no one in that class reached out to tell me.\n\nSO, GO TALK TO THE DEAN.  After all,  How does he know that those others didn't copy YOU?",
            "First things first, AI plagiarism tools are not 100% accurate. You should ask your professor for the plagiarism report. Most tools will (and should) give you the report highlighting the plagiarized sections which will give you a better idea. \n\nAs someone who works in tech publishing and uses plagiarism software pretty much everyday, I can tell you, they're not completely reliable. As someone already pointed out, there 's only so many ways to code something. These tools scrawl the internet and all publicly available piece of code, so they end up highlighting even the most basic and generic statements, like import statements. This is why reports are helpful so you can see what's being highlighted and whether it's actually relevant. \n\nI don't know what the assignment is, but if it's a common coding question, chances are you just got unlucky. I think the only way through is asking the professor for the report or the tool he used, so you can try it out for yourself.",
            "This is why i always use different coding style than the rest of my classmates. Like nextline open curly, ternary ?: instead of switch case, etc. Because I got told if my code similar with my classmate I would get 0.\n\nAnnoying but I don't want to waste my time later on if my classmates actually copied mine.\n\nIf with different style still made get 0 because of similarly with my classmates, I will show them all my works since the beginning of my college class to shut them up.",
            "Since ChatGPT has taken over, some professors have gone mad. They trust grossly unreliable AI detectors rather than the students. Maybe ask him if he’ll let you explain your code. If you are able to answer everything about the code and related concept clearly, he doesn’t have the right to fail you just because he thinks you’ve cheated.",
            "That’s lame - I’ve always iteratively ran my code through a plagiarism detector as individual text documents, such bullshit after sinking hours into a project. Maybe they should switch up the curriculum a little more and projects won’t look so similar. I would fight it tooth and nail.",
            "I had a pretty similar case when I took my data structures class. My code was coincidentally almost identical to some guy that I didn’t know at all. The only thing I remember for that assignment was getting help from a TA. When I first got the email accusing me of cheating and failing my grade, I could barely function for a couple days. After asking some friends for advice, I eventually talked to the profs about it and fought my case. Thankfully God they appealed their honor charge against me. Scariest day of my life.",
            "Why did they run it throw plagiarism detection, when you write code there's on so many ways you can do it.\n\nHas that detection software added your code to it's detection library without your consent? That's copyright violation if this is commercial service.\n\nYou have to fight this with tooth and nails to bitter end.",
            "It seems like you already talked to the prof and they’re not budging, so now they forced you reach out to the dean and escalate the situation, if they don’t hear you out keep moving up the ladder eventually one should listen, like they said it’s right 99% of the time so that’s actually a pretty decent argument that if there are at least 100 people in your class it’ll get it wrong once on average",
            "Previous professor here: AI detection should never be used as grounds for grade reduction. It could flag a student's work which would then require the professor to further evaluate, such as asking you specific questions about what the code does and asking you to change it's behavior slightly.\n\nAcademia is full of fucking nerd professors.",
            "I was there in the exact same situation, and the professor won the case. I had to repeat that course and it remains as one of the darkest days in my life.",
            "When this happened to me it was because I hosted my assignment on my public GitHub profile and some jackass copied it 100%. It was before I knew to worry about that sort of thing.\n\nIn my case, I was able to explain to the professor exactly how the code works in such depth, and the other student was not able to do that to the same degree, so the professor gave me 90% of the credit back. I guess the 10% dock was for being an idiot and causing trouble in the first place by hosting my code publicly.\n\nMaybe you can ask your professor to do something like this. Have him sit down with you and walk through the code, and do the same with the other student.",
            "I had a professor claim my code was not my own. It was too advanced for the concepts she had taught, and based on how far I was through the CS program. \n\nThe problem? I had 3 years more experience than this professor and was employed by a company doing exactly what she was teaching. It ended up being a huge headache and ultimately led to my quitting school.",
            "you go to ASU? Lol.",
            "if you are telling the truth\n\nask your professor to give you a similar problem and say you will white board it \n\nof course if you are lying, you will be screwed",
            "WTH. Instead of using a plagiarism detector, why should he/she explain to you how code works and what will become outcomes like a recitation to know what you understand in code. In the real world of programmers and plagiarism does not apply as long as you understand how it works.",
            "Bro you could have just changed the variable names lol",
            "Did you use an VCS to document your work? Maybe you could show your efforts and convince your prof that you did do the assignment",
            "If you coded the solution, ask to discuss your solution. Looking at the problem together with proff you should be able to give the solution again with pseudo code.",
            "from now on do all school related tasks in this professor's house, and at night fuck his wife",
            "OpenAI has mentioned that AI Detectors do not work. \n\nSource: https://help.openai.com/en/articles/8313351-how-can-educators-respond-to-students-presenting-ai-generated-content-as-their-own\n\nTry to show a trail of evidence for your work (logs, commit history, file versions if it's there, notebook pages)\n\nThe goal should be to make them acknowledge that these AI detectors report a lot of false positives and there should be an acceptable percentage threshold if the parts of the work are flagged as AI generated.\n\nIf all this does not work, run your professor's published work through the same detector and submit the report to the dean's office.\n\nA lot of researchers in my network are facing this issue that software like TurnitIn are flagging their original work as AI generated, and we've been figuring out ways to make the already human written text to seem human written to the detector. \n\nTurnitIn has said that if their report flags less than 20% of the work as AI generated, the report is unreliable.\n\nSource: https://www.washingtonpost.com/technology/2023/06/02/turnitin-ai-cheating-detector-accuracy/",
            "\"AI detectors\" are shit. Even companies who make them say it is not foolproof. \n\nIf the assignment is code based, chances are it is going to similar code for everyone anyway.",
            "From my first gen ed class to my current core one, I always run my work through a plagiarism checker before submitting.\nUsing descriptive variable names and heavy commenting helps maintain originality.\nAsk which plagiarism checker they use.\nI then generally add the output from the checker in the assignments.\nIf you use code examples from the textbook, just cite the textbook in your references.\nThen put an inline reference after your code listing that states \"portions of code inspired by  (whoever, whenever, page 45)\nI am 2 classes away from BSCS and never had a plagiarism issue.",
            "Ask the professor if he can prove his ai didn’t hallucinate the plagiarism result.",
            "One of my buddies got accused of cheating on a test/quiz(i don't remember) that we do through canvas. The professor could tell if we copied and pasted. \n\nOne of the questions was something like:   \nWhat is the output of this line of code:   \nprint(\"ABCD\")\n\nBut probably with some sort of string function. And the answer was ABCD. And instead of typing it out he copied and pasted it. Got accused of googling the questions by copying it, and him and the professor went back and forth a few times. The professor wouldn't understand why he would copy/pasting such a short string instead of typing it out. I don't remember what ended up happening, it was a years back. \n\nBut you can typically bring it up to the head of your department if the professor isn't budging. And if that doesn't work, most schools have a conflict-resolution/plagarism center. Most professors will try to find a resolution before getting to that level but if he isn't budging go for it. Probably better for you to bring it to them, than for your professor to approach them first. \n\n**But i guess it also depends on policy and how much this grade affects you.**   \n-If this grade doesn't change your overall grade/gpa, don't bother. Take the L and move on. Personally, I would move on even if it dropped me a letter grade that was still passing, and if i didn't have to take another class with that same professor. My gpa wasn't perfect, and I don't want to a take a class where the professor is gonna hold something against me.  \n\n-If your school expels you after 1 plagarism offense and you take it to the plagarism/conflict center, you could potentially lose the case and get expeled. I think my school would expel you after two offenses. \n\n1/3 of my CS professors were subborn assholes who will die on their hill. And if you take it to the conflict/plagarism center, don't be surprised if he starts analyzing your previous assignments.  \nGoodluck!",
            "lol happened in my DS&A class. Professor also failed everyone who he thought cheated. He gave a warning to them when he thought they cheated but failed them at the end of the course",
            "This happened to me and my friends in school. Professor said we cheated because we were the only 3 from the class that technically got the write answer. All of our code was different because we didn’t work on it together but since we were friends and sat by each other we got called out for cheating. After that day I commented every single line of code explaining the logic and never got accused of cheating again. \n\nIt’s very disheartening when you know you don’t cheat and get accused of it anyway. Just fight like hell with solid evidence and really dig deep to explain the code and WHY you did it the way you did.",
            "Same thing happened to me all those years ago in college, I asked the lecturer to ask me anything he wanted about the code as I knew it inside out, he did and completely backed down after I explained it all. Having ai check your code for plagiarism is outrageous!",
            "Kinda stupid to be plagiarism checking a coding assignment. There are better ways to test coding competency and most assignments in college setting are going to look pretty similar solution wise.\n\n\nAll you can do is challenge it. If he doesn't back down request accommodations you don't want to be accused again. Ask if there are ways he would be willing to let you do assignments with a proctor assigned in class since he can't trust you to code on your own.  If he refuses to work with you, you may need to just go super high up and escalate this. \n\n\nBe prepared to challenge the shitty precedent of AI plagiarism checkers. Do your research on how they work well. You'll need to demonstrate somehow that it's easy to plagiarize without realizing it. Also how similar simple assignment solutions are going to create false positives and cause students to lose faith in their program.",
            "Wild suggestion:  If you worked on this in a space where there may be security cameras you could potentially ask for footage to prove you did it on your own",
            "Lol i got accused of cheating and using the teachers answer sheet for an exam back in college for a python assignment. It was something extremely simple, if 10 people did this problem probably 8 people would have the exact same code. About 6 other people got called out for this too. I asked her what exactly i did to cheat and she said it was „against school policy“ to discuss this. Gave me a zero and i got a strike (2 strikes and youre kicked out). This happened a few other times throughout college, same situation. One time i even got called out for turning in an assignment the day it was due. It was a final project for Python (i was already working as a dev by then and was very good with python). Its crazy man",
            "There was a similar incident that happened in CSULB as per https://daily49er.com/news/2022/11/08/computer-science-students-successfully-appeal-grades-academic-dishonesty-charges-dismissed/#:~:text=Computer%20science%20professors%20Darin%20Goldstein,recognized%20similarities%20in%20their%20codes.",
            "Next time use git and make small commits",
            "You might Have used chatgpt and chatgpt might have given the same code for someone else too.",
            "How much does it weigh out of the total mark? Id pick my battles if I could in this context. Wouldn't want to get the teacher to hold a grudge unless it was necessary.",
            "Don’t get caught next time?"
        ]
    }
]