[
    {
        "post_id": "1bsvzgi",
        "author": "fellatio_di_grigio",
        "title": "What the actual fuck am I going to do in the future",
        "url": "https://www.reddit.com/r/csMajors/comments/1bsvzgi/what_the_actual_fuck_am_i_going_to_do_in_the/",
        "score": 496,
        "num_comments": 193,
        "created_utc": 1711950857.0,
        "selftext": "I’m trying to get into ML/AI but I can barely get a simple gender predictor working with sklearn’s built in svm models. I have like a month of school left and I’m already a sophomore. Can’t do leetcode worth shit either. Can’t even build a simple todo list app. I can barely code period. I’m losing the drive and motivation. \n\nI’m fucked yall. ",
        "permalink": "/r/csMajors/comments/1bsvzgi/what_the_actual_fuck_am_i_going_to_do_in_the/",
        "comments": [
            "If you’re really passionate about CS then you should definitely try your best to stick with it. You’re only a sophomore, you still have 2 years of school left to improve your coding skills. \n\nThe best advice I have is to just work on projects and learn from those projects outside of classes, I went from not being able to build a to-do app too to making a full fledged music streaming application by myself in under a month just from grinding on that project and googling and reading documentation (although it was winter break so I had almost 8 hours a day to learn and build the project), but the point is if you have the motivation and the time, you’ll 100% be able to improve a lot by the time you graduate",
            "I'm clueless so why is everyone so negative in this thread?",
            "Half the posters in this increasingly useless sub are on a mission to try and weed other people out of cs. You’re a sophomore, when I was a sophomore I didn’t even know python. If you want to grow you will do it- the best ways is to grind projects you’re actually interested in (take a dataset of a topic you’re interested in and work it), or, what really helped with me, take classes you’re interested in to really feel out what you would like, and apply for undergraduate research positions! I feel like research could be extremely helpful- some business professors love using basic data scraping and processing in their work and would love cs majors or you could work with actual ML development on for example, CV projects. Just gotta look around.",
            "You don't need to do AI/ML. Most software engineering isn't AI/ML.\n\nYou're a sophomore. You have plenty of time to get good at leetcoding...and coding in general.\n\nYou can do it 🫡",
            "lol wait so, you have recognized your short comings and have 2 full years to work on them and that makes you LESS motivated? \n\nL take man. That should make you push harder. You have plenty of time. Grind it out, or pivot into a different field. Those are your options. ",
            "Just know the CS graduate pool is more competitive than its ever been with everyone trying to get in on AI/ ML. Ur either gonna have to lock in or major in business.",
            "Potentially hot take from someone who stumbled on this thread but graduated a while ago - getting into AI/ML as an undergrad is setting yourself up for a rough time come grad apps or job hunting and we don’t even know if the field will be major or major major in a decade. Focusing on being a generalist now and specializing later is better.\n\nSource: previously did ML research but quit, now am in infra",
            "You’re cooked.",
            "Masturbate  to relieve stress",
            "Maybe pivot away from ml/ai? There's a billion other fields out there that are half as competitive and difficult that you'd probably be more interested and skilled at anyway. Dont be too hard on yourself, build something, and try to improve everyday",
            "Apply for a summer REU for a CS topic that interests you (there's a lot all throughout the US for AI/ML and other things too) https://etap.nsf.gov/\n\n\nYou will truly learn a lot from the experience and in some cases you might even get a stipend (I got $8000 for 10 weeks). I know some might need letters of rec but for those just ask/email your professors from classes you did well in and be prepared to convince them how what you learned in their class applies to the REU. Apply to as many as you can.\n\n\nIt might be too late to apply for this summer, but grind as much as you can in your classes and projects to have a solid backbone for your applications. Also, get to know your professors NOW (show up to office hours, talk after class etc.) so that you'll have solid recommendations in the future. Hell, they might even hand you an opportunity to do research with them on the spot.\n\n\nI did one last summer, even though I was never close to my professors and I had zero experience (pure coursework) I was able to get into one. The entire time, I was the dumbest person in the room. But it was worth it, because I put in the effort to gain as much as I could from the people around me. I'm a senior about to graduate and it changed the trajectory of my college career as well as my way of academic thinking entirely. ",
            "it’s great that you’re having this realization as a sophomore. i was delulu and had the same thought end of junior year and took a semester off to build concrete skills. Try your best and it’ll work out at the end.",
            "You’re a sophomore. It’s okay. This sub is also not the best place to come to rant imo. Focus on doing what you gotta do to get into Ai/ml while also dabbling in other CS areas. Try looking for research at ur university as well to get your foot in the door. Breathe bro. You only live this life once don’t trip",
            "That's not something you can reliably do with just a bachelor's, get a PhD",
            "Use the degree to become a military officer and get 0 down payment on a home",
            "Start you’re own business, be you’re own boss and keep those profits for yourself.",
            "Dude are you serious? You can just spend 3 months focusing on one tech and you'll be ok \n\nIf you are here you are capable, or you wouldn't ever got here in fist place \n\nGreetings",
            "hey atleast you still have time, i graduate in a month and a half and im in the same boat lmaooo 😭",
            "When I was a sophomore I hadn’t even taken a coding class yet. I didn’t until I was a junior, and still finished CSE in 4.5 years after wasting a year and a half on business classes because I didn’t know what I wanted to do.\n\nPlease, please, please just keep trying to build things that is the best way to learn. Group projects in school were huge for me, and it was hard to get involved because I’m pretty shy, but it’s worth it for your development. Always stay curious and try your best to learn when you can’t figure something out.\n\nBtw I also am horrible at leetcode. I did well in my algorithms classes but can’t do leetcode. There are jobs out there that don’t care about whether you can do 2 mediums in 45 min in a high pressure interview.",
            "Wait a second my friend . The fact that you can’t get SVMs to go gender detection from raw images is not your fault! It is the SVM and features engineered that are not good enough.\nFor images you need Convnets (CNNs) to have success. I’m sure if you just took some standard CNN like a MNIST tutorial one, you’d have way better luck! \n\nThe point here being that often right tools are what you need as well as experience. \nNot being able to leetcode as a sophomore is no problem, it takes years to get good at it. Keep at it and keep getting better. \nIt isn’t over by a fat fat stretch. There is so much to build and so much to do .",
            "Dude you probably barely practice coding. If you actually try to get better and practice coding for 2 hours a day every single day watching coding vids and doing projects and homework etc every single day then you’ll be really good in a few years.\n\n\nTalent is just a multiplier for hard work. Maybe you suck at coding? That just means you’ll have to work slightly harder than other people which isn’t the end of the world you can get MUCH better and then people will look at you the same way you look at people better than you!",
            "Bro stop crying, go on YouTube, watch a tutorial/project you want to do and follow till you finish. You’ll learn regardless, do this a few times and you’re gonna look at this and laugh.",
            "My son just switched his major to accounting.  After reading Reddit i am very relieved.  CS seems saturated and by changing fields he will be much more employable.   He will have to go to school an extra year by changing majors now, but we feel it’s a smart move",
            "I'm a sophomore and I have no idea what %70 of the words you said means",
            "Why AI/ML specifically? If you are doing it just for the hype that's wrong. its better to study in an area you are interested in. It's better to be great at a less popular thing than mediocre at a popular thing.\n\nIf you can't build a todo list app, start building it now. If you cannot do leetcode, start doing leetcode now. Crying around wont do you any good or change things. \n\nThe best time to do these was when you started out at university, the second best time is now.",
            "Use ChatGPT",
            "In same boat except Its been a year since I graduated, worked part time jobs, didn't like it so with savings I've been learning Linux on my own and hope that'll be useful",
            "You’re just a sophomore",
            "My man i couldn't do shit as a sophomore either. Dont worry about it, just work towards changing that.",
            "Todo apps are really easy man I can make a todo app in less than 10 min and I dont have a CS background. It means creating an App gets easier with practice and it doesnt mean I am more knowledgeable than you. You just learn to do something by doing something. If you cant do something do it now. You will get better and better",
            "Stop freaking out. And you can’t “get into” ML/AI yet when you haven’t even built any sort of production software yet.\n\nStart general, take any opportunities you can to work with large systems, and go from there.",
            "Why are you trying to get into ML/AI?\n\nIs it just because of the money? I originally did  engineering at uni because I was interested in working at NASA. By the time I graduated the NASA drive had died but I had developed a passion for solving complex software problems and that drove my self learning. \n\nLearning for the sake of a future paycheck is much harder than finding the thing you’re passionate about and leaning into it. Because while not everyone in the industry is passionate, plenty of them are, and if you’re just going through the motions they will blow you out of the water every single time.\n\nI wasn’t a CS major and the bulk of my initial software journey was spent during the internship I did prior to my final year. \n\nFinding problems you want to solve and trying to solve them is when you’ll find out if you actually like computer science.",
            "https://preview.redd.it/gwm0qm53aurc1.jpeg?width=1080&format=pjpg&auto=webp&s=bd4ed296cd98684f0b3dce9d11b3add58d1e1897",
            "You'll be fine. Get a job in consulting or government or something and get some practical experience; You'll discover quite quickly that the stuff you learnt in Uni is really just the foundations, and stuff gets much easier once you have real mentorship.\n\nEDIT: Reread your comment, and you meant you had a month left of your sophomore year, not a month left of uni. You've barely gotten started, calm down",
            "Sorry my guy - Nothing to do but keep going. If you do you’ll be surprised how quick you start seeing real progress - just gotta get to the tipping point first",
            "Pivot to React CRUD apps. It’s a brainless job that pays too much for what it is.",
            "If you can't do the things you mentioned, you've barely even tried. If you quit now, your low threshold for frustration will follow you into your next career attempt. \n\nYou have to eliminate distractions, delay your gratification. Remember mastery takes 10,000 hours. CS is not limited to some special people, anyone of average intelligence can become a decent SWE",
            "What is tripping you up ? ML/AI is just math/statistics and Idk what program you attend so I can only speak on behalf of mine and my experiences but in my school they assume you know/understand most of the math. If the math is tripping you up just focus on that and re enter ML/AI at a later time, i.e. grad school. If you’re only tripping out on the code just think how a computer works and what you want it to be doing. If all that aint work goodluck there’s always a Business/comms major",
            "The main problem with people who join or want to move to IT field is that their only motivation is what the YT SWEs sell them: do a bootcamp/CS/Course and in 6 months you will have a 6 figure job, and you can drink fancy macciatos while working remote on a Starbucks.\n\nThe field is really hard, and it will be harder. \"AI\" will remove the bootcampers and all those who want to join with money as the only motivator.",
            "[course.fast.ai](http://course.fast.ai), do this if you want to go In AI. a solid start and will give u confidence u need",
            "First of all you still have years ahead of you.\n\nSecondly there other areas of computer science you can engage in other than programming, networking, it (as in helpdesk, system administration, technical support etc.), database management and many others, computer science isn't just programming.",
            "U need to accept and embrace chatgpt",
            "figure out why your svm isn’t working, and then adjust it to get it to work. \n\nUsually a data problem, not a built in model problem.\n\nBut given you’re a sophomore, you may be using the wrong model for a given dataset",
            "OMG just use GPT 4",
            "Love posts like this. Bro really bringing down others with him",
            "I never made a single app, didn’t do any coding projects outside of school other than dabbling in robotics, tried one leetcode problem I never finished, and didn’t do any coding challenges. That being said I spent probably 14+ hours a day on school studying some semesters to get a 4.0 (including class time), took at many jobs with any relatable experience that I could, slept 3-6 hours a day, and was not a person trying act like I’m smarter than other people (seems to be a common behavior of some people in the field) and therefore was likable enough to be given references. I got a job, but it is not one of the crazy salaries people listed, still much better than I could be making in other professions. I think coding based jobs are just no longer going to have crazy pay like in the past. People probably won’t instantly get a job out of college but probably find one in the year after so they’ll have to be prepared to do some factory work or fast food work while applying. In sum, if people don’t like the profession, they probably will fail or will be miserable trying to get a job. If they do like it, then they need to focus on the steps they are able to achieve and appreciate them while keeping their eyes open for opportunities that pop up. \nThis doesn’t take away how incredibly stressful the market is and the recent change in the profession. So my suggestion is find things that bring you joy to distract you from the stress, make sure you have some form of income from any job so that you are not desperate during interviews, don’t pick up industry jobs that you can tell are going to make you miserable & burn you out, and don’t worry about all this work people are doing for free like leetcode unless if you really feel like it brings you value.",
            "I think you have enough time to actually turn that story around. Sit down and analyze the lack of knowledge that is making you unable to achieve these things you mentioned. Then try taking them one by one, step by step, crossing off minor achievements off your list until one day you’re able to bring all the parts to make the whole and achieve all these things.",
            "If you really want to learn programming the best way to learn is to make something that you want to make. I only really started learning when I was making plugins for Minecraft, because that's what I wanted. It has to be something you're passionate about, those projects **always** end up being the best ones",
            "If you don't care for CS just switch majors. Freshman and Sophomore years typically filled with electives anyways. My brother decided at end of Sophomore year he didn't want to spend his life in a cubical as computer engineer and switched to English - has worked out well for him and actually working with ML models now lol, but in industry he wanted to get into when he was a kid... TV/Movie editing.",
            "Bro just study more why are you here, just to get people to tell you you suck? You can obviously learn to get better. Stop trying to learn ML and learn some regular stuff. If you can barely make a to do list app or do leetcode then you need to drop the time you're spending on ML and learn to do those cos they're not hard. Then do the ML. You don't need to learn everything at once. Just study more and keep doing it.",
            "It’s fine, you just need to work through it and continue to develop. The more you work at it, the better you’ll get.",
            "Relax, you are biting off way more than I would push on the average Sophomore. You'll probably take some sort of advanced algorithms and software engineering courses during the next two years where you will have massive growth in skill. Your first two years should be focused on fundamentals and math, then when you're taking technical electives as a Junior and Senior you'll be given plenty of opportunities to grow your skills how you want.",
            "hahahahahahahahah",
            "It sounds like you're feeling overwhelmed and discouraged right now, but it's important to remember that everyone faces challenges when learning something new, especially in fields as complex as machine learning and programming. Feeling stuck is a normal part of the learning process, and it doesn't mean you're \"fucked.\" Here are a few things to consider:\n\n\nTake a Break: Sometimes, stepping away from a problem for a little while can help clear your mind and approach it with a fresh perspective when you come back.\n\n\nBreak it Down: Break down your goals into smaller, more manageable tasks. Start with simpler projects or exercises to build your confidence gradually.\n\n\nSeek Help: Don't hesitate to ask for help from peers, professors, or online communities. There are plenty of resources available, from forums like Stack Overflow to online courses and tutorials.\n\n\nPractice Patience: Learning takes time and patience. It's okay to struggle and make mistakes along the way. What's important is that you keep trying and learning from those experiences.\n\n\nFocus on Progress: Celebrate your small victories and progress, no matter how incremental. Each step forward is a step closer to your goals.\n\n\nExplore Different Resources: If one learning method isn't working for you, try another. There are many different approaches to learning ML/AI and programming, so explore what works best for you.\n\n\nRemember, it's okay to feel frustrated and discouraged at times, but don't let those feelings define your journey. Keep pushing forward, and you'll get there eventually. ",
            "Disconnect the code from the programming. Code is a whole separate thing; it’s secondary. When you have difficulty solving a problem, it’s likely rarely because of a language issue, where you can’t come up with the code to solve it; you’re just not solving the problem before writing the code. If your first response to a leetcode problem is to just start hammering away at the keyboard, that’s probably a big part of where you’re going wrong.\n\nA lot of leetcode problems can be solved with one or two decks of playing cards. Get two decks with different backs, because it makes them easier to separate when you’re done. Two decks means you can simulate up to a hundred or so elements, and you can deal with duplicate data. Once you really understand what’s going on, with how your eyes and hands work as iterations of loops, you can structure the solution like a flowchart (god, I wish they taught flowcharting at more schools), and then you eventually just go, “Huh,” and type out the code like it was nothing. This is part of the reason I bounced over to playing with CNC machines and robots; when I flowcharted the program, I had effectively written the program, and the coding part just bored the shit out of me.\n\nReason why I’m the high priest of a local flowcharting cult is because if you flowchart a program, you can write that code out in any language you know. There’s no more problem solving to be done. I was out at my old community college, pushing the CompSci and Engineering Tech majors at my university, and my Yoda threw a random leetcode problem at me, so I just grabbed a marker and flowed out the problem on the whiteboard. Some kid in the back of the room says it doesn’t count, because I didn’t write the code, and I asked, “Do you want that in C, C++, C#, Python, Swift, or Java? I don’t care what language you tell me, because I’m just going to write out the code that matches this chart.” And then my Yoda told me (once again) that I was throwing my life away to play with robots instead of writing software.\n\nI think that what you really need is a philosophy. Mine is one of patience and solving the problem, which I gained after looking long into the abyss and seeing nothing but registers, accumulators, comparators, and Booleans, and anything else is abstraction. At that point, I could really feel the execution, and it made me better at solving a problem on the computer’s level. Because there’s nothing magic about code. Code doesn’t exist for the computer’s benefit; it exists for *yours*. And that’s why I think writing code is boring, because by the time I start writing it, I’m already done with the hard part.",
            "You have to be persistent and dedicated. That's a character trait of a successful person.",
            "You are not fucked 😂 it’s not funny but stop thinking this way. To learn anything takes time, failing and dedication, keep at it",
            "Lock in lil bro",
            "First. You are going to calm the fuck down.\n\nSecond. Identify what your problem really is:\n\nIs the learning pace too fast? Are you taking classes in the right order? If you are a sophomore having trouble with a todo app and leetcode, that doesn't necessarily put you behind. Sophomore year was the first time a lot of my classmates began coding. Those should be moderately challenging tasks at your skill level. I think maybe you need to get your head around those more intermediate level concepts before you dive into something like ML.\n\nIs it clicking? What don't you understand? Are you making an effort to understand? Tons of us coasted through highschool and never learned how to learn and ask questions. The harsh reality of college is, you have to put in effort to learn now. Go to office hours, find good YouTube courses. Do side projects. ASK QUESTIONS. Learn how to clearly communicate your problem to your professor, TA, or friends. Everyone wants to help.\n\nQuick aside: There is no stigma to attending OH. Lots of underclassmen tend to think it's admitting defeat. That is insane. No one can learn anything in just 3hrs of lecture/week. We either study hard or go to OH.\n\nFinally: Are you ok? Is stress, depression, or anxiety creating a  mental block? Is it hard to focus? Maybe you need a therapist. Or at least start taking better care of yourself.",
            "Lol. I was a senior in the same boat as you. 14 months into my first job, making 100k+ working remote. Learned everything I needed on the job, school just provided enough background for me to understand.\n\nPoint is, you're young with 2 more years of college - job market is murky yeah, but what landed me a job was working on my people skills. Keep at it, don't lose faith bc it's worth it in my opinion.",
            "I have a computer science degree and have been working in the field for over 10 years. Here's my advice. If you're in your sophomore year of your undergraduate degree you need to be focused on understanding the basics of programming. You can take upper level courses on AI and Machine Learning , if you have a passion for it, but I have never heard of anyone hiring a bachelor's degree fresh out college to a position of any consequence in AI/ML. I'm sure there's an exception to the rule. I'm sure someone here will tell you the opposite. I can only say, I've never seen it. For the most part, I expect very little from people fresh out of college who don't have any serious internships or portfolio projects. \n\nIf your goal is to simply get \"a job\", focus on the basics. Build simple applications. Apply for internships that give you actual coding experience. You will get a job. Your first job will likely not be your ideal job, but you can try to find an entry level role at a company doing some ML/AI stuff and try to get on those teams. Get a company to sponsor your masters degree. Study ML/AI there, contribute to open source, attend conferences, meet other people in the field. From there start applying to the jobs you really want. \n\nThis subreddit is very disconnected from the reality of the industry.",
            "When it comes to diving into machine learning and AI, hitting roadblocks is totally normal. Sometimes, it feels like you're stuck in this endless loop of learning without really getting anywhere.",
            "You’re getting into AI/ML.\n\nIt’s already going to be hard, but you have 4 more years to figure it out (you’ll need atleast a masters to get anywhere with AI/ML).",
            "You're probably like me. Like to do things on our own. When you say you \"can't\", have you tried asking for help? Needing help and guidance doesn't mean you can't do it. I'm quite sure it's challenging for many people to just take on projects they know nothing about and trying to solve it. Doesn't mean you can't, though.",
            "Forget all that, you first need to learn the basics, i.e., patience and perseverance!",
            "My guy I'm an illegal immigrant and because of that I can't even get internships and I'm graduating this year . I think ur fine my g, just keep at it.",
            "Cant can’t cant blah blah blah",
            "Don’t lose the drive ik it can be difficult, i would suggest check out why you are not successful with the model. Go deep. Understand every small aspect all the maths. It’s tiresome but i think you will find the issue. You have plenty of time take one step at a time but take a firm one and practice practice practice. \nGood luck 🤞",
            "So the doom and gloom is that barely hacking it in CS is not going to cut it when it might have in the past. The idea here is the job market is constricting so it isn’t that you can’t do well with CS it is that only the best of the best will do well. Just like every other degree path or industry.\n\nYou are still early but ask yourself are you willing to work hard to become the best of the best? You have a couple more years to grind it out and make it happen. No one started off a coding genius they all worked hard at it so you can too but are you willing to? If not then think of something else you are willing to work hard at.",
            "Don’t stress about not being able to do leetcode, it’s complete gibberish until you’ve take datastructures and algorithms. If you’ve already taken, dw they’re still hard. Only way people get good at leetcode is literally doing hours of it a day",
            "The process of learning ML modelling is more than just running a predictor. Like debugging it's also trial and error. It takes time. You make assumptions, you look at the data, you clean it in accordance to what you feel is needed, then you train the data with certain assumptions. If that doesn't work, go back to step 1. \n\nIt's not the same as you would for leetcoding, there isn't a specific answer that's being looked at.",
            "Learn how to program low level C and Rust, then become a Linux kernel dev\n\nIf you get good enough either someone will pay you to maintain the kernel, or you'll be a kickass programmer who can work on anything",
            "I don’t know what classes you’ve taken or anything, but it sounds like you’re giving up too early basically. I couldn’t leetcode for shit for like a year after I started doing it. Just do the dailies Monday-Friday. Try to solve the problem yourself or with friends for 30 minutes. If u can’t solve the problem,  then go through solutions, try and implement them. Do that for a year and you will get better, promise.\n\nLeetcode aside, for projects/AI/ML, it helps getting involved in stuff through school. My school lets students get involved with AI research and there’s even a course put together by a club for that research. We also had clubs that put people together to work on projects, get advice, etc. I won’t assume your school will have same stuff, but look out for those “groups” so u can always have ppl to ask questions and learn from. If you can’t find them, remember that your professors are valuable. It doesn’t hurt attending office hours to ask questions abt things like AI/ML or full stack development even if not in the scope of the class.\n\nLastly though, you just have to do a project. It sounds so simple, but picking a project, learning the required stuff, and doing it isn’t easy the first time around. The project can be a simple weather app, checkers, a card game, etc. Just something that lets you practice ur skills. Doing that will help you leaps and bounds in actual learning and proficiency. \n\nHere’s what I’ll tell you to do NOW:\n\nStart doing leetcode daily problems today\nTake time to decide on a project the next couple of days. Start it by next Monday. It might be a “month before sophomore year ends,” but next year is junior year. After the summer if you have at least a project and get better at leetcode, you will have a better chance of getting an internship (junior year summer is huge), and learning more from there",
            "I used to be TA for c/c ++, I had students complaining similar thoughts like yours. \n\nI told them exactly how I learned coding. \nI used to write with pen and paper, this way I learned simple syntax and how to make logic. \n\nOne of the reason people cant code is because they don’t have memory of syntax. You can do this with any language, first use pen and paper to do simple coding, then start with very simple projects.",
            "You are a sophomore, get off Reddit and enjoy your life and do your best ",
            "When I was a sophomore I couldn’t do those shit either . Relax and learn . You probably trying to code something your don’t know, stop coding and start reading 📖 and look for YouTube videos",
            "Currently a middle-aged junior in my CS program, working towards a degree I should have finished 20 years ago.  It'll probably get buried, but here's my advice, anyway:\n\nIt's not just about coding.  Is the ability to read and generate code important?  Sure.  But not all CS careers are locked into code.  My current goal is Network Engineering.  I know I'll need to develop some coding skills (relearning C++ after a 15 year hiatus is *hard* - going to be riding the struggle bus all the way to graduation) and learn some scripting, but the bulk of my focus is going to be on network topography and security.\n\nIf parts of the major don't mesh well with your thinking style, find the parts that work well with you and focus on those.  Security, networking, and Enterprise IT can all draw from the CS pool.",
            "Relax dude. It's normal to feel like this. You're feeling imposter syndrome cranked up to 11 for no good reason. In year two, I needed to have my hand held. I also struggled with todo apps. I remember having these exact same thoughts.\n\nStop reading this subreddit and stick with it if you truly enjoy the satisfaction of solving problems. People here are discouraging you on purpose for their own gain. Just keep rolling with it and things will click. It takes time and experience. Eventually the puzzle pieces fit together and you'll develop a skillset that allows you to plow through trivial work (like todo apps) and approach big problems without fear.\n\nStep away from AI for a bit. That shit isn't easy, especially at your level. Revisit it later.\n\nFor now, focus on fundamentals. Pick something easy and useful to build *for yourself*, then go and do it. That is by far the best way to learn. For example, I made a shitty little bot for a video game. I didn't know what I was doing when I started it. Had little confidence. Today it has hundreds of users and got me two jobs before I was ever asked to touch Leetcode.\n\n---\n\nTLDR: Stop reading this sub, keep going if you like solving problems, build something for yourself (or a friend) that is useful whether you think you can or not, reap the benefits.\n\nTLDR++: Fuck Leetcode. Get a job somewhere that doesn't value your ability to memorize shit you'll never use. Let everyone else fumble around in the rat race.",
            "If you chose CS cause you genuinely liked it then try to channel that passion again - do projects that will force you to learn. If you chose if for money then that's too bad.",
            "Tbh I got my passion in Cs by learning how things work and how they are built. \nJust GOOGLE \"how does <any-curious-topic> work\" And just read any article on it.... U will have everything u need thennn!",
            "Maybe someone else has asked but what was your impetus for doing CS? Not that this is required, but I went into CS already learning some programming stuff in my free time because I was interested in programming and making stuff. In college I met a lot of people in a similar situation to yourself where they didn’t really know how to do anything. So I’m genuinely curious what your motivation is.",
            "[removed]",
            "I couldn’t build a todo list app until senior year, couldn’t solve leetcode until the end of junior year. Couldn’t build simple AI predictors until I took an NLP course.\n\nI now work at FAANG and have worked on multiple big and challenging side projects.\n\nJust relax and keep learning, in sophomore year I only knew the basics.",
            "You'd be surprised how much you'll advance in the next 2-3 years if you stick with it. I'm guessing you're around 20-21ish years of age. You've been through middle school and high school and you get around a year to master those subjects (chemistry, physics, calculus, maybe even some CS classes) but college is a different beast. It's 4 years because it really does take 4 years at least for most people to become a software engineer. If it only took 2 years to be a programmer then you'd be graduating in a couple months. Give it time and most importantly try to relax a bit. You WONT learn everything overnight (unless you're fucking Steve Wozniak or some shit, which if you were you wouldn't have posted this anyways). You'll absorb more info if you're not so stressed about it.",
            "Well, computer science is not just about building apps. I recently noticed for myself that pure software/app development is not for me. I like hardware and have some signal processing background so I am currently going for an embedded role. \nIf you like optimization you could go into high performance computing. If you have some affinity for maths maybe simulation / algorithm development is more for you. If you like scripting and automation, maybe go for DevOps/MLOps. And there are so many more fields like Computer Graphics, Networking, CyberSecurity, …\n\nNot every CS Major needs to be a FullStack App developer…",
            "Manage your expectations. Going directly into ML/DS was already fighting against the grain, those roles are not entry level despite what anyone says. Refocus on a more realistic goal and work slowly towards it. Be more critical on what is not working and focus on realistic specific areas to work on. Trying to learn Leetcode and ML at the same time might mean you are spreading yourself thin and not learning any of these areas well. \n\nIn school, you should have resources to discuss this too (particularly advisors, professors, clubs, and peers). Use them as sounding boards.",
            "You’re just going through “the phase”. The only way out is through. You’re gonna make it.",
            "I only learned about leetcode after graduation and first heard about react when I was a senior. Still got a job. \n\nYou understand your gaps and know what to do next to fix them. This means you are way ahead of many people in Big Tech. Keep the grind and I 100% guarantee you will get it. Reach out to me when you are a senior if you are still lost.",
            "Don't use SVM models, depending on your data size probably just use Logistic Regression. Yeah you have at least 2 years to figure out how to do a simple todo list app.. what's blocking you? Just Follow a tutorial but make sure you type out everything rather than copy paste.. this forces you to put it in your bones and muscles a little bit and forces you to learn rather than quickly eject it from our brain.",
            "You’ve got 2 years for the market to recover. I think AI will eventually create more jobs in tech as it spiders out into every sector and matures.\n\nStick with it. Apes strong together.",
            "I’ll be honest you’ll need a PhD to get into the ML/AI industry (maybe you can with masters but it’s a bit more difficult)",
            "Don’t be too hard on yourself. The information you are learning and the things you are doing are the culmination of hundreds or even thousands of years of human effort and research. These things may be trivial to experts and those farther along than you but don’t compare your beginner level to their expertise, obviously they will be better at it. Stick to it, it’s abstract and weird stuff that does not come natural to most humans. Keep trying and it will click after while. Be kind to yourself and just get a little better each day. This is the way",
            "I would say adjust your approach to do more projects first (try get that to do list app working). Then from there then start branching into harder stuff.",
            "In general a CS program does not really prepare you to be an employable software engineer. But it builds a solid foundation for learning the skills and tools to become one. This is a problem as most people who study CS are doing so because they want to have a career as a software engineer.\n\nI graduated with Computer Science in 2001. A rough time to graduate, the dot com bubble had just burst and the company I had interned with (Nortel) was about to go bankrupt and was not hiring anybody.\n\nWhat is the solution? Get an internship the summer before your final year of university. Or even take a gap year and get an internship. The expectations for an intern are considerably lower than those for an entry level full time position.  During an internship you will learn to code, learn how to ask for help, learn how to read documentation, learn how to interact in a professional meeting environment.  Its invaluable.\n\nI tend to think there are two types of people who take a CS degree, those who love computers, they have programmed as a hobby for years before going to university and there are those who think it will be a well paying career. If you are in the second group its going to be hard for you, at least for a while.\n\nThere are too many new grads out there with zero experience in a flooded market. Its rough.",
            "Switch your major.",
            "https://www.reddit.com/r/leetcode/s/bY7FiwhHqw a senior data scientist with 5 years experience got rejected I have no chance 😭"
        ]
    },
    {
        "post_id": "1aigyb7",
        "author": "killuazivert",
        "title": "My internship journey as a sophomore",
        "url": "https://i.redd.it/xo2eofb5eigc1.jpeg",
        "score": 493,
        "num_comments": 39,
        "created_utc": 1707026482.0,
        "selftext": "3 Stages of Life:\n\n1. Early Life\n2. Losing a bad bitch\n3. Death",
        "permalink": "/r/csMajors/comments/1aigyb7/my_internship_journey_as_a_sophomore/",
        "comments": [
            "we've all lost that one baddie that we can never forget about huh",
            "Sorry for being stupid. Could someone explain the \"bad bitch\" and \"lost bad bitch\" joke? The job was a bad bitch?",
            "You talk to women?!? As a CS MAJOR?!?!",
            "Awesome for the intern and sorry for the loss!! Mind sharing your anonymized resume??",
            "Mind sharing your resume?",
            "How to optimize resume for bad bitches? 600 applications still nothing",
            "How do you make this chart?",
            "Congratulations - all the best for your future!"
        ]
    },
    {
        "post_id": "17vyop8",
        "author": "joliestfille",
        "title": "just got a call to inform me i was rejected from an internship LOL",
        "url": "https://www.reddit.com/r/csMajors/comments/17vyop8/just_got_a_call_to_inform_me_i_was_rejected_from/",
        "score": 498,
        "num_comments": 52,
        "created_utc": 1700069170.0,
        "selftext": "it stung a little :') i've never received a call with bad news; usually they just ghost or send out a short generic email. they gave me feedback as well, though i already knew exactly where i went wrong lmao. i guess it was probably a respect thing since i got rejected in the final round interview after spending upwards of 6 hours total interviewing with these people. the search continues i guess :/\n\nedit because people keep asking which company this was: i don’t feel comfortable saying, but it’s a niche, well-known (top of their niche) company. nobody in the comments has guessed correctly",
        "permalink": "/r/csMajors/comments/17vyop8/just_got_a_call_to_inform_me_i_was_rejected_from/",
        "comments": [
            "Giving feedback to a rejection. Now you dont see that every day...",
            "Happened to me in the middle of a lecture. Caused a commotion shuffling my way out from the middle of my row to get rejected 😭. Bro also took his time getting to the rejection part by asking about my day and how I felt about the interview??",
            "This isn’t the solution we imagined when we complained about being ghosted 💀",
            "I've had that happen for my first internship rejection call. Everyone was getting moved on to the final round with big goodie bags, then my call comes and I'm told I didn't make the cut. I was the only one who didn't. \n\nIt stings at first but def better than a ghost. Fwiw I got another internship that season that paid twice as much. It's not the end of the world even if it seems that way. Keep your head up, keep applying:)",
            "[deleted]",
            "One time I got a rejection call to tell me my grades weren't good enough for the company, I didn't even interview and my lowest grade was a B 💀💀",
            "Nah my man. Don't take that standing up! Call them back and reject their rejection. Lets see how they like them apples.\n\nJk. In all seriousness, at least they're informing you to move on to the next one... unlike those who ghost us 😭",
            "google actually did this for me once. got a call and he started off with “hey it’s ___ from google” and i jumped for joy. then he said “i’m sorry to inform you but…” and i jumped out the window",
            "Lowkey I would rather this than the email",
            "Same happened to me.  The recruiter emailed me saying that he wanted to call me just to tell me I didn't get the job.  And I didn't get feedback either, just him saying that it was competitive.  Like bro wtf, that literally could've been an email...",
            "Google called to inform they rejected me off a leetcode assessment. Lmao",
            "that sucks 😭 I'd rather be ignored",
            "Veeva scheduled a video call to reject me for full time 💀",
            "Happened to me, hopped on a teams meeting to get rejected",
            "Bestbuy did this to me too 😭",
            "Atleast a rejection call if not an interview call 🥲",
            "Same 🥲",
            "What company was this for?",
            "damn what company was this?",
            ".",
            "Wait y’all getting interviews?",
            "What company?",
            "Yeah we dont get that very often but when we do, it hits hard... Good luck on your job hunt!",
            "is this bloomberg?",
            "Just like the good old days! If you got that far you’ll definitely get something!",
            "This happened to me and the next Summer after that they hired me",
            "That's happened to me with two companies, one of them being a dream company of mine. It's nice that they decided to tell me personally that they're not going ahead with me coz they did end up saying no after the final round, but I kinda got hopeful considering I made it so far and they chose to call me! I can relate.",
            "Usually if you get to the point of interviewing they will be a bit more human (but not guaranteed) in communications.",
            "Happened to me twice already, the world is so cruel.",
            "I’m not a CS major, but I had a recruiter email me a few weeks after my interview to schedule a call with me, and i assumed it was good news. Scheduled it the next day only for him to tell me they rejected me… Literally the dumbest thing i’ve ever seen."
        ]
    },
    {
        "post_id": "y0ms69",
        "author": "Yung-Split",
        "title": "Classmates with BO",
        "url": "https://www.reddit.com/r/csMajors/comments/y0ms69/classmates_with_bo/",
        "score": 497,
        "num_comments": 134,
        "created_utc": 1665428019.0,
        "selftext": "Is there any other major with people who are as smelly as this one? No wonder women don't want to be in the field. I have a class where there is consistently one person who shows up that you can literally smell all the way across the 60 foot wide classroom. And nobody ever says anything. It's actually hard to concentrate because of it. I feel like im going to get sick from breathing in the fumes. He is clearly on the spectrum, but like damn dude literally must only shower once a week. Do you guys have this problem too? Why do so many of you mfs stink so bad? Take a shower, brush your teeth, clean your clothes and wear some deodorant holy shit. \n\nPs. How can I get this guy to take a shower?",
        "permalink": "/r/csMajors/comments/y0ms69/classmates_with_bo/",
        "comments": [
            "Bro even my CS professor said how our CS/Engineering lab smells bad and is musty. Like if y’all paying 50k for an education bruh you can pay 2$ for some soap bro please. We wearing masks not cuz of Covid but cuz y’all haven’t washed ur ass in 7 years. We don’t care if your algorithm is O(1) when your body odor made 7 kids drop the class.",
            "Lol knowing this is a CS forum page I know exactly who you are referring to and I can say the same here too. Shit is nasty.",
            "i’m dead 💀",
            "[deleted]",
            "When I was a new dev manager I got stuck managing one of them. We had the devs in pods of three in double sized offices. I knew it stunk but didn’t want to deal. My CIO eventually came and told me it stunk in one of the rooms and I needed to talk to the dude about his stink. I knew he was on the spectrum so I agonized over how to tell him. I finally pulled him into my office and just came out with it “We have a small issue With your hygiene, I‘m going to need you to come in tomorrow with clean clothes, showered, with deodorant on and do that every day going forward”. He thought for a second and said thank you and then explained he isn’t always good about people or personal hygiene, but he understands. He then turned around and walked back to his room without another word. He came in the next day clean as a whistle wearing new clothes and we never again had that problem, I just think nobody ever really told him or if they did they didn’t tell him how to fix it. I‘ve had a couple more of these types over the years and I’ve followed this pattern, be exact and tell them how to fix it.",
            "I once had some guy blow his bad breathe right into my face while sitting next to him in a computer lab. I thought I was gonna puke.",
            "I know it smell crazy in there",
            "keep computer science smelly and socially awkward",
            "Our Calc prof in first year had to send out an email regarding how many students had horrible BO and how it’s distracting for other students. I believe he said students could even be subjected to a ‘smell test’ before attending office hours",
            "My dad never taught me shit about being a man. My friends had to tell me I should wear a belt, wear an undershirt, etc. Learned to shave on my own. Just try to be kind and help the kid.",
            "At my school, the smelly ones are the computer engineering majors",
            "Slip some deodorant in their bag with an educational/cheerful note attached. Some people grow up poor and/or by uneducated/disinterested/abusive parents and could never afford hygiene products or taught that it was necessary and become accustomed to the smell because that was their environment growing up. Sometimes it takes just one person to teach them but most people are understandably hesitant to bluntly point it out to someone.\n\nI personally dealt with folks like that in middle school and high school but fortunately didn't have any issues with smells in my undergrad classes. I totally understand not being able to focus though and it taking away from everyone else's education.\n\nPS: Make sure it's not a gel deodorant in case they never notice it and the heat from the bag causes it to melt and ruin everything...",
            "Woman here, I hate it. Today one of my classes reeked if stale cigarettes and BO. Earlier in the year the room was super hot (no ac), so those smells just marinated. Smelled like someone put greasy hair, old gym clothes, and old work boots in a crock pot and let the room soak up the smell. I leave and just watch the lecture recording if it’s particularly bad.",
            "Email your prof and ask if he could send out an email to the class reminding people to shower bc it’s a distraction & taking away from other people’s learning.",
            "shook a guys hand and it was greasy, immediately regretted it",
            "I'm the only woman in a lot of my classes. PLEASE shower. So many guys have greasy hair and BO. And don't crack your neck in class please 🤮 i wish my teacher would record lectures 😭",
            "Dropped a class last year bc it was a super small classroom and they packed desks in there and it reeked. As a woman, I don’t understand how some boys can’t do basic hygiene 😵‍💫",
            "The stereotype of the analytically/mathematically intelligent having no social skills or self awareness was something I did not expect to be so true when I started school.",
            "Invite them over for the sexy time and shower with them before the deed. \n\nThat way they’re clean and you lose your virginity, a win win for everyone!",
            "I'm a woman and I'm glad I take my classes online.\n\nIck.",
            "Facts, I feel this walking around campus",
            "Happens occasionally in other fields too. Did a computational bio internship where one of the other interns (bio major) made a communal bathroom smell so disgusting that every other intern eventually took the long way to use another bathroom. I don’t think he washed his towel once in 2-3 months. Near the end of the summer even he started using the other bathroom and the smell started getting worse again over there. He didn’t even realize his towel/lack of soap was the cause.",
            "This kind of thing is what keeps our salaries so high. Embrace the BO and never EVER put deodorant on!",
            "We have this fucking guy who smells so awful it turns the lecture hall into a fume hood. He will pace up and down the room while the prof is speaking, and I hold my breath when he gets within 10 feet of my row. He also interrupts constantly and is the only student to ever answer questions. \n\nObviously he’s very autistic and i feel bad even complaining, I’m sure his life is hard and he’s just an inconvenience to me at worst. But holy shit dude.",
            "My gf told me that her school had to send out a university wide email confronting cs students about taking a shower🤦🏻‍♂️",
            "Dude, my entire CS class smells so strongly I’ve grown nose blind to it. The first few weeks were rough.\n\nI should say that I think, in my circumstance, it may be more cultural differences(?). Over half the people in my class are international students.",
            "One time I didn’t shower for two days before a final to throw down the curve, guy next to me kept making noises that he was disgusted but he never asked to change seats lol. But I was a bio major at the time… I recommend it though, I got an A cuz of the curve",
            "Not me",
            "Gotta get a good stank goin, it helps you absorb the knowledge",
            "I work in a gym, tip for dealing with this (yes it’s annoying and we shouldn’t have to deal with it), is a little bit of vicks vapo rub under your nose, it helps a little bit with the smell.",
            "I guess masks aren’t just for covid",
            "I hardly go to class since it’s cheaper to watch my kids while watching recorded lectures. I went for our midterm and sweet fuck how oblivious are some of these dudes. Fucking reeked. Like I’ve seen better hygiene in the field when I was in the military.",
            "[deleted]",
            "On a sort of unrelated note, how do these people make friends? I've noticed that appearance is a big determining factor in making friends/getting dates. Do they not care about having a girlfriend or a tight friend group? Do they not want to be popular?",
            "I heard UC Berkeley's CS building has showers in the building. Which is funny for meme reasons, but maybe the students need to work so much they don't go home often... :(",
            "Man, this dude in my algorithms class would rip farts all the time while watching Hentai",
            "A lot of the odor is from not wiping sufficient after doing #2.\n\nGuys need to use bidet or wet towels to clean that feces out.",
            "Lucky me, no one in my class smells. There’s also only like 15 of us, only me and one other girl left 🤷🏻‍♀️",
            "Just drop a note saying “take a fucking shower” in their bag or some.",
            "Go to Student Services and find a social worker. You need a person, preferably female, who can interact with this student in a sympathetic way. People like this do exist, they just don't hang out in the Engineering Building.",
            "Oh yes still have PTSD from that curry stench. Fucking gross",
            "Why are you saying that women can’t handle with smelly people? Do you think they’re more fragile and can’t handle bad BO?",
            "You start not showering and assert dominance .",
            "Lmao i’ve experienced this firsthand in computing science classes",
            "Glass and Glass Sculpture = stinky",
            "When I served on a ship back in the day, we literally had to make a shower watch on a guy because he wouldn’t take a bath.(shower watch is when someone one on a Navy ship wouldn’t wash unless they we forced too.",
            "so this is what excess KN95s/N95s could be used for 🤡",
            "This is the average CS lecture at any university",
            "[deleted]",
            "Get a 3M respirator. Wearing masks is encouraged nowadays anyways",
            "I would say you are right 💀 hahaha put it this way, you can be one of the most good looking one in the field",
            "CS, Med, MEng and Actuarial Science tend to be the worst in this department.",
            "lmao a course on personal hygiene is a must in CS curriculum. in my first year we had a whole bunch of classes where we had to do an oral exam to pass. for every single one of those classes the profs sent emails beforehand asking everyone to shower and use deodorant 💀",
            "Seems like having social skills and being attractive is a major advantage as a CS major.",
            "Had some smelly weirdos in college, but never in a real job.",
            "Double major in CS and Psych. \n\n\nNever had an issue with people smelling in any of my Psych courses. Not sure what it is about the lack of cleanliness and computer science. But it's unsettling."
        ]
    },
    {
        "post_id": "15mz07f",
        "author": "Solefam92",
        "title": "DONT MAJOR IN CS",
        "url": "https://www.reddit.com/r/csMajors/comments/15mz07f/dont_major_in_cs/",
        "score": 491,
        "num_comments": 72,
        "created_utc": 1691633235.0,
        "selftext": "I’m tired of seeing these posts holy shit mfs gmt",
        "permalink": "/r/csMajors/comments/15mz07f/dont_major_in_cs/",
        "comments": [
            "Majored in CS, specialized in selling my kidneys",
            "Exactly. CS is a sinking ship. People should be running from the major.  AI will take over all SWE's jobs and all CS majors will become homeless.",
            "Yuh",
            "On another note: why do so many people think CS is only the SWE part?",
            "Major in what you like is what I’ll always say.\n\nI say give CS a try, but if you don’t like it, don’t force yourself into it.",
            "There is some merit to those complaints though. I have been looking for a job for 13 months and it is dry. The most recent rejection knocked the life out of me. Got through the final stages of the interview process for Pratt&Whitney as a early career DE and everything went better than my best dream. The manager basically said i will send you the offer letter within 2 days. They gave the job to another guy because he had FiveTran experience(Recruiting manager informed me when I asked what put the other candidate over the edge). Honestly killed me inside.\n\nNote: FiveTran was never mentioned at any interview and it was not a required or preferred skill.",
            "[deleted]",
            "brb majoring in egyptology.",
            "Is the market in America that bad? Is this for a role as dev or all roles?\n\nDoes this include tech consulting and  and less glamorous roles as erp dev ?\n\nEach company has an IT department are they all filled up or are we talking about companies that are IT/software companies?",
            "It's true! I majored in CS and promptly began to regret my decisions. There is no money here anymore. AI is taking over my job.",
            "Gmt?",
            "Was this post made so you can scare away the competition?",
            "But here’s a bar chart race video on why you should major in Computer Science (backed by stats)\nhttps://youtu.be/LqusyrZzY4Q"
        ]
    },
    {
        "post_id": "18ymeif",
        "author": "Muted_Poem",
        "title": "Asked my GPA after a shaky final interview.",
        "url": "https://www.reddit.com/r/csMajors/comments/18ymeif/asked_my_gpa_after_a_shaky_final_interview/",
        "score": 496,
        "num_comments": 69,
        "created_utc": 1704398534.0,
        "selftext": "I graduated with a low GPA (2.7). I applied to a Fortune 500 and partially because of my location they moved quickly with the interview process. The application asked for a GPA range and their brackets are wide (2.8 +) . Screen and first round interview with local higher-ups went really well. I moved onto a final interview with overseas bosses and it did not go well. 1 day later I'm being asked my GPA. ",
        "permalink": "/r/csMajors/comments/18ymeif/asked_my_gpa_after_a_shaky_final_interview/",
        "comments": [
            "ngl it ain't looking good bro",
            "whatever, sent the email. let them do their worst (reject me)",
            "It’s joever?",
            "I had a very similar profile as yours when I was in college: bad GPA but good internships. Only Goldman Sachs asked me about my GPA; no one else did. I have been working for more than a decade. I wish you the best of luck!",
            "I would say you should’ve lied, but they can easily just ask for a transcript, if you got caught lying, you’d get blacklisted",
            "To anyone else here, is it normal for companies to ask for your gpa? Is this a rare occurrence?",
            "I guess its simple, if you don't lie, you could just lose job, if you lie, you could/could not get a job. Mostly company will not ask for transcript.",
            "You’re done",
            "[deleted]",
            "RemindMe 1!",
            "Man with 2.7 gpa has interview, i with 3.87 GPA had no interviews so far.",
            "[deleted]",
            "Woah",
            "Did you have to put your GPA when you applied? If so, I really don't think it matters but I obviously could be wrong.",
            "I mean if gpa is important and u ve  a low gpa just say that u never went to university or lie, in most cases they dont check",
            "school/major are factors as well. 2.7 from Tier2 college's STEM is way better than a 3.5 from tier-3 college's non-STEM major."
        ]
    },
    {
        "post_id": "14te9k7",
        "author": "Deep-Drag-7668",
        "title": "HELP! MY CODE TURNED INTO SQUARES",
        "url": "https://i.redd.it/xibbeb7rzkab1.jpg",
        "score": 493,
        "num_comments": 101,
        "created_utc": 1688752355.0,
        "selftext": "I’ve been working on my project all day and my laptop suddenly died. When I charged it and reopened Eclipse my code had been converted to this. How can I fix it?",
        "permalink": "/r/csMajors/comments/14te9k7/help_my_code_turned_into_squares/",
        "comments": [
            "https://i.redd.it/ksso0hfhvlab1.gif",
            "The source code goes into the square hole",
            "Ctrl + z and pray",
            "Your project got corrupted. Unless you have version control, this is a good lesson.",
            "Ok so what you’re gonna want to do is turn them back into letters",
            "More leet code should fix it",
            "F\n\n- written by the totally not biased c# gang",
            "Oh, I see the problem. You're writing in java!",
            "close, don't save\n\nopen in notepad++\n\n&#x200B;\n\nstill squares?",
            "Sandpaper",
            "If you're on Unix/Linux, drop to the command prompt and type \"strings filename.java\". That may help you recover any string data that still exists in the files. Or open in a hex editor to see what's still in there.",
            "as far as i remember, eclipse has a temporary file saving system, you just need to change the extension of that temp file, google it, you might find something, there's a less chance though",
            "git revert",
            "Ctrl z",
            "I think the reason you have a problem is because your code turned into squares",
            "This is why you don’t talk to the fae, they steal your code.",
            "All of ur code now belongs to us",
            "Just in time compiler 😎☝",
            "code got sent to gulag",
            "Uninstall eclipse and download IntelliJ",
            "Make a proper screenshot, post the error messages, etc etc",
            "Bruh turn on auto save.",
            "Building blocks",
            "Seems your code is Unicode",
            "What kind of class name is this",
            "Just paste the squares into ChatGPT and proompt it to convert it back to ascii java",
            "Open it in Minecraft, it should make more sense when converted. It’s in Java so you should be fine",
            "Now you know why we have source control.",
            "Better learn how to read square",
            "Uh... square root em?",
            "What are you talking about?\n\nI can see your code clearly on my machine",
            "Maybe you changed the encoding of the file to some exotic encoding. Try Utf8. If that’s not the issue you learned what it’s like to code without git",
            "Update: I ended up restarting the project because majority of the comments came in much later. I also want to say thank you to everyone! The insightful and funny comments helped me through this.",
            "Can someone explain what happened here? Why did the corruption change everywhere into squares instead of gibberish",
            "git reset --hard HEAD. Though if you don’t even know how to take a proper screenshot I assume you don’t use git either.",
            "Womp womp.",
            "Step 1: close editor\nStep 2: uninstall Java SDK\nStep 3: learn a real programming language like C or C++",
            "Just clone your github project repo",
            "If you have a log-structured file system, you could try to analyze the disk and pray",
            "That is normal when coding in Java.",
            "Jeepers creepers!",
            "Kid named Git:",
            "Restarting your computing should fix it",
            "Are you using Ultra Edit Studios? You should be able to find an autosave in the recents tab",
            "I'm not sure if you've done this, but if you previously commited you can go back to your code at that point in time using git revert",
            "Maybe you opened the file with wrong encoding",
            "You just unlocked hard mode",
            "😂😂😂😂",
            "Bahahahaha",
            "Does it still execute? Lol"
        ]
    },
    {
        "post_id": "10ne8bq",
        "author": "bot01110011",
        "title": "Why everyone such an asshole?",
        "url": "https://www.reddit.com/r/csMajors/comments/10ne8bq/why_everyone_such_an_asshole/",
        "score": 492,
        "num_comments": 107,
        "created_utc": 1674909873.0,
        "selftext": "I keep seeing people ranting and the replies are straight so mean and rude. It’s a rant, they aren’t looking for a lecture so stop trying to.\n\nWhen people ask a genuine question, stop telling them to Google and lecturing them.\n\nMaybe it’s just me but these type of posting really reform the stereotype that cs majors are bunch of pretentious people with superiority complex.\n\nMain point: Just be kind and respectful",
        "permalink": "/r/csMajors/comments/10ne8bq/why_everyone_such_an_asshole/",
        "comments": [
            "I'd say 4 out of 10 programmers are absolute ass holes.",
            "I've come to notice this about the people on this sub, but they all seem to be overachievers who demand to be the top 2% of programmers (which can be observed by the obsession with getting internships and jobs at FAANG while ignoring the many other huge - and respectable - companies that need programmers as well, but especially ignoring the smaller companies that definitely don't mean a bad career).",
            "I recently read a tweet that stunned me. She said that asking questions in online forums about software technical issues would go ignored. But she discovered a way around it. She would post the detailed question, then she would use an alt account to give a wrong answer. Then people would stomp on the wrong answer, just to prove they knew more. She had to goad people into giving useful answers. She concluded that people are more interested in proving someone else WRONG, than in giving the right answer.",
            "Idk if you're talking about in person but if you're talking about online here than it's not a cs majors thing, it's literally just a reddit/internet thing. I find these people everywhere, in every game I play, every social media platform, every forum (these especially), discord, you name it.",
            "\"Why everyone such an asshole\", I'm sorry, but couldn't you have just google that? Why are you posting this here? A software engineer should be able to figure stuff out by themselves !!!!!!!!!!!!",
            "The same people that act like that on Reddit can't back it up in real life.",
            "Unfortunately i think a lot of people in this field beleive they have a some chip on their shoulder that makes them better. I think its a lot of the \"I fucked your mom\" kids from the 2000s online gaming community who have grown up perpetually online and cant even look a person in the eye, let alone speak to them normally. All of us a nerds through and through, its so easy to just not be an asshole.",
            "It tends to happen in a hyper competitive field. Finance is full of assholes too. People want jobs over the other person and want to think they are better than them so they will criticize the TINIEST thing and say \"you are not fit for this field\" to discourage others. Obviously this isn't everyone but go into any competitive field and ask anyone there. Med schools have their \"gunners\", lawyers have people who are stingy when it comes to helping because the classes are stack ranked, and the list goes on.",
            "CS major and also, the type to be on reddit constantly specifically on this sub. Not surprised if alot of people here were also terminally online on r/ApplyingToCollege",
            "I see a lot of people saying that’s just the people here. While I agree, I’ve also encountered that type in real life and it was horrible. There are fantastic helpful people everywhere, and also assholes everywhere. You just have to put yourself first and focus on what will help you succeed.",
            "I once had a person in a class that chatted with me in a friendly manner for about 2/3 of the semester. One time they asked me for help on a assignment(which was for a class I was in, but hadn't started it). I tried helping them but wasn't much help. \n\nThey changed after that and never really spoke with me much anymore. This field is just super competitive, and a lot of people will only be 'friends' with those that can directly help them. It's shallow, sad, and a bit funny.",
            "probably because most cs majors are uptight and socially awkward so they come across even worse online when they're surrounded by other uptight and socially awkward folks.",
            "Well said. This is why I am afraid to post in this sub.",
            "As CS major, one of the important skills is to use google. The next important one is ask ChatGPT",
            "I lurk on this sub quite a bit and see the general trend of people being jerks/narcissists/uncharitable/whatever as well. It really hurts me to see.\n\nOverall, I'm a large advocate of just being nicer to people. Of course this isn't saying they should be babied and spoon-fed information, but general kindness and being enthusiastic to help others goes a long way.\n\nAdmittedly, I've never been the best socially and I'm far from perfect, but I've learned that 90% of the time, being benevolent towards someone you're talking to will cause them to innately reflect that cordiality back to you. That's not to say that your sole reason for emitting positivity should be to receive it, though.\n\nThere are countless reasons to be kind that I could go on about for hours. Anyways, for what it's worth, I make an attempt to be as nice as I can possibly be, even towards those who don't mirror that. Being kind takes so little effort, yet for some reason, countless people will take the harder route of just being demeaning towards everyone they encounter.",
            "Most of the assholes wouldn’t say shit in person lmao, but if they’re here or on discord the superiority complex is through the roof",
            "I was such a bad programmer, I honestly thought I was stupid for a long time. Eventually I just realized most other people into programming are just jerks after I \"kindly\" helped someone else and they said they appreciated me being nice.  \n\n\nI may just have bad luck but most people Ive talked to, besides a good buddy of mine haven't been the nicest people. I had college professors, years ago, outright refuse to help, or even say we have far too many programmers and to stop studying the subject lmao. It's super weird.",
            "They spend too much time on Reddit that’s why . Nothing you can do .",
            "I think the poster can take it upon themselves to do a quick search. When you're in this field you can't expect to ask a senior person who has dozens of meetings and an important deploy to sit down and babysit you through something. The ones who succeed in this field have that \"figure it out\" mentality.",
            "you have to think about the average programmer who does this- typically nerdy, insecure, non- agreeable, anti- social, been bullied or messed with growing up so typically locked away to only interact with themselves. Now throw in a place where they have some knowledge over a topic, their responses just tends to be vomit instead of water for growth because they’re not aware of how they should behave or interact",
            "Redditors are only like slightly less terrible people than 4chan users tbh.",
            "These are the same assholes who grew up with no friends and couldn’t get a job. There was socially focused there’s your answer.",
            "Facts, I asked for a referral on a Reddit post’s comments section and people started downvoting and pointing at me for not being professional lol",
            "I don't have a choice. I'm literally an asshole.",
            "There is a huge amount of beginner questions that get asked by newbies. So those who have been in the field get asked the same simple questions over and over.\n\nFrankly a lot of them can be googled. New people want to open a dialog. Talking through something and getting like minded struggles can be comforting.\n\nHowever, after you learn how to find answers yourself you too will join the dark side.\n\nIf you can’t handle a few people telling you to try something on your own. Then this industry will be difficult for you. There are constant cross functional discussions with opinions. You might need thicker skin.\n\n\nAs that is the aim for senior engineer. Its always okay to ask questions as long as you search first and try not to repeat them. As you get more experienced you’ll need to become more and more independent as you get to the top.\n\nThere may be a time when you have no one to ask. You have to push through and an important skill.",
            "Perhaps because being a coder is a continuously life long process of self learning and figuring things out yourself.\n\nAnd yes, it is completely ok and normal to ask questions, but perhaps people can be understandably harsh when people show that they haven't even made an attempt to figure it out themselves first (as even if you fail at attempting that, at least then you can ask ***a better quality question!***).\n\nIn many cases telling someone to google it *is the right answer*.",
            "Computer Science is extremely hard and under-appreciated. Most people will never encounter problems as complex as those in cs. Ask a random stranger how to sort a list. Ask a random stranger how to send encrypted messages.",
            "All cs grads are asshole.",
            "Yeah literally wondered about this the other day.\n\nSeems like people choose to be selfish and bark out their thoughts and opinions as rude comments on every subreddit (and sometimes in life), and while they try to come off as having some understanding of the importance of independence and correctness they explicitly demonstrate their lack of social skills and empathy\n\nHoly f-ing s***, I hate them. I just kind of want to comment back “f*** you, you dumb peice of s***” all the time. They literally don’t deserve any respect. Idc.\n\nFor some reason they don’t understand what they’re doing is the same as telling someone who is sharing their difficulty dieting and exercise something like “do it yourself”, “stop being lazy”, “just go to the gym”, “google it”.\n\nImagine if I, a student who finds every class pretty easy with a 4.0, commented at students struggling on an assignment or exam like\n “that was easy, you’re just dumb”, “it’s your fault you fail”, “study more like I do”, etc etc.\n\nWell that would just make me like them. On the other hand, maybe I can allow myself to just give these people a piece of my mind.\n\nI f*****g hate people like that. Idiots.\n\nI literally posted the other day about missing the first day of class, just kind of getting it off my chest and looking for some validation, and every comment was like “you should have checked the schedule”, “it’s your fault”, “it’s your responsibility”.\n\nBut they wouldn’t like it if I said “this class is easy, you’re dumb”, when they complain about any workload 🤷‍♂️\n\nHonestly these people are the worst 🖕",
            "IMO. they usually forget the Rant flair, thereby opening themselves up to criticism. All we need is the appropriate flair to illicit appropriate treatment.",
            "I think it's normal everywhere. There will be people like that lol just ignore them",
            "It’s not that deep people be too soft these days",
            "Sadly I can only down vote your post once.",
            "Just google on why CS majors are asshole 😡😡🤬🤬 reeee",
            "If you can’t handle a counter rant on your rant then don’t rant\n\nWe are all blowing of steam",
            "I am what i eat. love that bootyhole 🤤",
            "I might get flagged as “asshole” but like, for me, posts like this are dumb and useless. How would we know why are ppl “such assholes”? Are we psychics? Is this psychology majors? No. At the end of the day, this is a useless post. Ur not benefitting, neither are the ppl reading. Rants in general are trash imo. Thats just me tho, i dont join communities for useless rants and opinions. I view csMajors as i place i can look for help in my major, not the things that come with it like stress and whatnot.",
            "5/7",
            "Why Charlie hate?",
            "ESR is a psycho so we all think we have to be.",
            "math and science/eng majors tend to attract a demographic which doesn’t obstruct the socially inept.\n\nAlso knowledge (in any field) almost always puffs up the ego. It can be a force to be reckoned with.",
            "Engineers are some of the biggest jerks I’ve met.  Having social skills is routine one of the top skills engineers lack.",
            "No, u!"
        ]
    },
    {
        "post_id": "xc34cl",
        "author": "csThrowawaynew",
        "title": "Does it scare you how popular going into CS is getting?",
        "url": "https://www.reddit.com/r/csMajors/comments/xc34cl/does_it_scare_you_how_popular_going_into_cs_is/",
        "score": 496,
        "num_comments": 308,
        "created_utc": 1662956463.0,
        "selftext": "Every tech tik tok that comes up on my page has like 500k+ likes and freshmen classes at my school are at like 250 students per class.",
        "permalink": "/r/csMajors/comments/xc34cl/does_it_scare_you_how_popular_going_into_cs_is/",
        "comments": [
            "A lot of people also want to become doctors and engineers at first.\n\nHow do you think it turns out for most of them?",
            "I’m currently doing CS and one of my classes created a class discord. About 90% of them have no idea what’s going on and they were contemplating dropping the class. This is one of the easier entry level classes too. I offered to help some of my other classmates with homework and these guys had no idea what they were doing and they did not seem interested in it. \n\nSo yea I agree there’s a lot of people going into CS but majority of these people are only doing it because they don’t know what else to do and they see tech workers making all this money on social media.",
            "Most of them can't cut it. Just stay motivated and work hard.",
            "I don't feel bad that many are starting to like CS, what I don't like is the \"cool\" \"hip\" portrayal of the field as designing React apps and HTML webpages. \n\nThe people who are actually interested in learning Operating Systems, Compilers, Networks, is still pretty low.",
            "Data structures will sort em out lol",
            "Yep especially with recession even more people are going to try to go into CS. I miss being one of the only CS majors amongst groups of people.",
            "I will tell you my story, when I was in college taking my programming 1 class back in 2017, on first day, there were \\~85 students (went to a public uni in FL). These 85 kids were mostly White, Indian (including me) and Asian men but still 20-35% women and other POCs.\n\nAfter our midterm exam and drop-out deadline, around 40-50 students dropped the class, leaving it to be overwhelmingly Indian, White and Asian men with 4-5 women and rest other POCs.\n\nThe point is, tech is ALWAYS be saturated at entry-level since the thought of six figures would turn on any human being but when you struggle and don't like/understand basics, you leave it.\n\nWhich is why positions from mid to high level are so lucrative with high salaries but entry-level ones are saturated. So, don't worry about this. Most people end up leaving tech in initial stages, leaving the more resilient ones to reap the perks. Don't stress out, focus on being the best or at least better than what you were yesterday :)\n\nEdit:\n\nI might add :- after programming 2, programming 3, data structures, computer networks, computer architecture classes, there used to be around 10-15 students in a class towards my last semester. So, from almost 90 went down to 15-20... huge drop.",
            "I am not worried about it. Those tiktoks show how easy it is to get a job as a software engineer just to get people to buy some magical courses that's suppose to land them a CS job. In reality, CS and Software Engineering jobs are very difficult which is why they pay more. Whoever is going in with the expectation to earn some easy bucks are about to get humbled soon. Some lucky folks might end up getting those FAANG jobs just by leetcoding a few months but other than that it requires real dedication and hardwork to be able to survive in this industry. Not everyone has what it takes to survive 4yrs in CS - trust me I have seen a lot of peers drop out because their expectation didn't match reality. What people also don't realize is that the degree isn't going to speak for them during the interviews - they will be on their own and what they decided to do with that degree. The bar to enter the market as a software engineer is lower than ever already (degree or no-degree) but if you want those high paying jobs, you will always have to earn them through the hard way.",
            "Nope.  Out of the 1000 cs first years, only ~100 graduated.  For those who graduated, barely any of them leetcode, had internships or any side projects",
            "One of the intro cs classes at my school had over 900 students.",
            "wait for calc 2 amigo",
            "CS also has one of the highest dropout/major change rates",
            "There’s no shortage of CS students, but there’s a massive shortage of *good* programmers. That’s why good programmers make multiple six figures.",
            "wide history nail unique six flag ruthless frighten elastic repeat\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "It’s probably less popular than you think and the TikTok algorithm is just recommending you CS vids because you’re a student",
            "My freshman CS class was 84 students.\n\nMy senior CS class was 5.",
            "No linear algebra and discrete math will weed out most tiktokers",
            "[deleted]",
            "I have my out, nah.\n\n\nIn all seriousness, this was a longtime coming. Entry level jobs have been saturated for years now. Remember, tech shortage is for **experienced** developers, not first years.",
            "My school started out with 125 kids in the CS lab, and by week 2 there was ~32, including me… I think most people go into it for the money and realize it’s actually frustrating if you don’t like it",
            "Yes. Thats why I'm getting my masters at gatech with the omscs program. CS was a really easy degree. I taught myself object oriented programming when I was in high school so the classes were easy for me in college. \n\nI'm worried ill get out competed by high school kids once programming because a normal class to teach in k-12. \n\nI graduate next year with a masters of CS in machine learning. Hopefully that will protect me from the millions and millions of people who are learning the simple skill of programming.",
            "CS is popular because of pay and remote flexibility. Little do these students know that you're going to be learning just the basics. And the basics are difficult. Not only that, once you graduate you will need to learn new material constantly. If you can't keep up you'll be weeded out.",
            "The intro class at my school has like 2000 people",
            "You probably are just interacting with a lot of cs tiktoks, the internet is big",
            "I TA’d for an intro CS class last semester. My school which is definitely not known for CS had about 13 sections of this intro class and about 20-30 students per class making for 260-390 students going into CS. In the section i worked for by the end there were maybe 10 students left who’d show up to class. I also had a Senior lunch with my fellow senior CS students, i estimated around 80 students total were there, so we are seeing about 3/4 drop at least at my school if not more out of CS over 4 years. It’s saturated in the beginning but weeds people out.",
            "A lot of people are motivated by money and that's fine, everybody needs money. I, myself, am broke as hell. \n\nThere is a difference between motivation and discipline. \"If there is something you want to achieve, your internal reasoning that forces you on a path towards achieving this goal is motivation. How much effort you put in, in order to achieve that goal, is discipline.\" So motivation can come and go or just flat out change. When you are disciplined though, that is engrained in you.",
            "Nah.\n\nInstead of spending time worrying about other people are doing, I can just grind Leetcode and spam apps 🤷🏻\n\nPlus, most people who are enticed by the bag won’t think the journey is worth the destination once they find out the hoops they gotta jump through 😭",
            "No because im interested in a very weird obscure niche",
            "A large portion of those freshmen will switch majors after their first or second CS class. Even after that there will be a ton of Cs majors, but tech is a growing industry",
            "That is very low on my list of fears.",
            "Why would that scare me? I love that the field is expanding. We can't very well ride the novelty bubble forever, after all, and it means more smart people are working on the world's hard and interesting problems.\n\nIn any case, I don't think there are untamed hordes coming for \"the good jobs\" anyway. Research positions are more open than ever, general hiring downturn aside.",
            "Bruh why does it “scare you”, you decided to go into this major too most likely for the pay, of course everyone else is, it’s a high paying field so people will go to it. Imagine people saying “are you scared how competitive it is to get into big law, be a doctor, get into Harvard business?”",
            "It scares me that people think college is a good place to learn CS. The vast majority of them are so far behind the industry. \n\n4 years of Learning and doing real world examples will get you much further in your career and much faster. Imho. \n\nI would rather see your GitHub and works you have published than a degree from MIT with no actual real world work.\n\nI might be old and bias. My first job 20+ years I walked in and showed him the things I had published and done for free for fun and was hired on the spot. \n\nThat’s how I hire people today. Don’t give two shits about education. I am not a hospital or law firm. I don’t need bar exam or board certification.\n\nI need actual product actually delivered to clients. \n\nWhether you learned on stack overflow or in a Harvard lecture room doesn’t matter to me. Can you do the job?\n\nCS degrees are the liberal arts of stem.\n\nYou can’t convince me learning a conditional loop from Harvard is better than learning it on stack overflow.",
            "You guys are right to worry . The tech industry is getting crowded",
            "I’m more worried about the people not majoring in CS. The average office job in the future is going to need a lot more technical skill than today.",
            "Look at the facts. How many CS degrees were issued nationally last year.\n\nLooks like about 56,000. \n\nHow many open software engineer job listings are there in the US? Over a million.",
            "more people that really know logic can't hurt.",
            "Many will not work as SWE",
            "Honestly no. Most of them are jumping on the trendy train and chasing the $$$. A lot of them will fail/change majors before graduation. I saw it happen at my school and I’m sure it’s quite common at most schools.",
            "A lot are pulled in by the promise of big earnings, not because they like or are good at writing code.  I'm not concerned at all.",
            "I think it's just the algorithm promoting this content to us",
            "don’t worry. once they start taking more classes, the numbers will drop. hard. if money is the only reason you’re doing cs then 95% of ppl aren’t gonna tolerate it for long",
            "discrete math should filter most of them out",
            "Maybe 3/10 students who start in CS will finish in CS",
            "with the 50% fail rate for calc 2 at my university that weeds out every stem major, i wouldn’t worry",
            " I’m just a freshman but using cars as an example. There are more cars on the road today than ever and at the same time the prices are up to record levels as well for a multitude of reasons, chip shortages, hobby popularity increasing every generation, more tech, etc. \n\n There will not only be wash outs but a direct need for more cs majors to keep up with demand as everyone owns at least a couple pieces of tech. I may be completely wrong but this is just my take.",
            "No\nFreshman class size isn’t the metric, look at senior class size trends.\n\nThere are always some classes like the algorithms class that cut 80%",
            "grind harder",
            "Yes.\n\nThe average person is a moron, and half are below average.\n\nHaving a huge number of dumbass engineers flooding the market (because colleges want tuition money so they'll give away those degrees for $$$ to people who have no business being anywhere near a compiler) is going to make it more work to sift through to find the smart ones, pay will go down, and overall code quality is going to be a complete dumpster fire.\n\nIt's going to be a rough decade.",
            "Lol y’all are going the same way of chemical engineering…between a surplus of grads here and outsourcing, y’all are going to fight like dogs and work round the clock for salaries way below what people see now",
            "Yeah, there will be more tards I have to interview.",
            "[deleted]",
            "[deleted]",
            "Most of those people are fillers to increase the salaries of the professors.",
            "The idea that you don't want people to follow their passion because it might give you a marginal competitive edge in the job market is disgusting. I'd be willing to take a 50%+ paycut if it meant everyone in the world was happy and satisfied with their job.",
            "Not really. More people interested in the things I'm interested is always a win. Besides, many won't last.",
            "nah, filter courses exist for a reason",
            "Just see how DSA kicks them out :-) no need to worry.",
            "They’ll try and many will quit.",
            "Not scary but pretty exciting",
            "To be honest it's not worrying about the job market but more so college/university places. People will go in and then in the 2nd year dropout ruining a place for someone who could've actually got in and been successful.",
            "Worry about your own race & control what you could control . Focus on you and everything else will follow",
            "I would worry if your senior classes all have 250+ people per class, and they are all doing better than you.  CS isn't easy, most of those people will fade away",
            "yes, but most drop out or have no clue what CS really is.",
            "I think specializing will help , like artificial intelligence , IE . Most of those people are entering into just development or project management",
            "Freshman class at my school was ~120. \n\nGraduating class at my school was 7.",
            "The cs bubble popping like the nursing bubble and MBA bubbles .",
            "A lot of universities are having to restrict being able to declare a CS major because of this in addition to making the intro classes weed outs.\n\nIn my case, when I entered in 2015, I was declared in CE but not CS. In order to switch CS, I needed a 3.0 between intro programming and discrete math. Partially because I had no programming experience and wasn't used to college studying, I nearly wasn't able to change to CS after failing intro CS the first time. Retook it the next semester and got A's in both that and discrete math the semester afterwards.\n\nYears later, they've made it borderline impossible to switch to CS if you don't come in as an engineering major, and you have to finish the initial requirements in a year too. Gave me kind of a scare that I had it so easy to think about it.\n\nAlso there's colleges that outright only allow you to declare CS when you apply, so you virtually can't transfer in.",
            "going in != getting out.",
            "You should come to Asia. My class in one India's top universities had 225 CS graduates at the end of 4 years. There are some universities that produce upto 1200 graduates each year.\n\nAnnual CS/IT graduates nationally are upwards of 180k.\n\nhttps://www.statista.com/statistics/765482/india-number-of-students-enrolled-in-engineering-stream-by-discipline/\n\nParents are crazy pushing kids into CS after lusting the FAANG salaries.",
            "The only reason you think its easy to do is because you find it easy and do it all the time. Don't let your survivorship bias win, just because you put the effort in to make it easy doesn't mean its inherently easy.",
            "A little",
            "CS at my school has a 50% dropout rate. many are hopping into CS, not many are making it out, things will become more competitive of course, but we will not have a surplus of CS majors in the market for a longgg time. I read somewhere we still have to import people from outside the US to fill about 10-20% of tech jobs cause we don't produce enough  in the States.",
            "Idk where you go to school cause my experience is the opposite",
            "\"Going into\" and completing are entirely different things. Also, you are talking about Tik Tok. There's 99% of everything on there is garbage.",
            "That’s because no other career path besides medicine pays a person what they are worth. You can’t blame them.",
            "Every cs person on TikTok is goin to see those videos lol. I don’t think it’s that big of deal that more ppl are getting into it",
            "I’m not trying to be arrogant or something but after working with multiple different people in different CS classes… a lot of them won’t be able to cut it and swap majors. Honestly most of them get cut by the gen ed engineering classes like calc and physics before they even reach the hard cs classes",
            "Computer science is the most dropped degree in all of college.",
            "That should only scare you if you are a below average developer. People can come at tech as much they want but that doesn’t change the fact that tech isn’t for everyone, you need a certain mindset and smartness to work in this area (I hope LOL)",
            "I think it is like most things. I will never be able to draw well or dance well. No amount of practice will ever make me good. I don't know what the dropout rates are among other majors but I would think it would be at least a quarter.",
            "CS and engineering freshman classes are always  filled but graduation rates for those majors haven’t gone up significantly, why? Most of those students will drop the major before they graduate because the math, engineering, and programming classes are rough and most people can’t handle seeing their GPA drop or potentially having to retake a class",
            "Social media is a disease. It gives people a warped view of reality. There could be a billion people going into CS. If 99% of them are unskilled or only in it for money and not actually interested in being good at it, they probably won't make it very far.",
            "Nah, my intro to CS class last year had 130 students and by week 3 we had about 25 students. \n\nThey like the idea of being a programmer but then realize it’s hard work. I’m new as well, but for separate reasons :3",
            "no because people that have gone through college with difficult degree knows\n\neverybody in intro classes don't make it to upper level and graduate",
            "When I was in school, most people went to Info Systems in the business college.\n\nCS (in the college if engineering and science) had far less than half the students.",
            "When I started my freshman class had about 200 students and my graduating class had less than 30 so no not really.",
            "No. It's a neat subject. As to the competition side of things I'm not terribly worried. The job market is doing nothing but growing and if my own experiences are anything to go by the attrition rate will ensure not even 1/4 of those 250 students will finish the degree.\n\nA *lot* of people get into it because \"oh wow software engineers make a lot of money!\" but then find out that there's, uh...*reasons* for that.",
            "How many times can one get scared to be scared shitless. All the freshman drop",
            "Honestly, it annoys me. I went through a boot camp program to get my Google IT Support certificate. Even getting an entry level helpdesk position is very difficult. I try to tell people what the reality may be like. Cybersecurity is hard to get into. I’m planning on getting CompTIA certifications when I can or try and go back to school for tech courses. \n\nBut literally every tech tiktok ad I see is talking about how easy it is when, for the average person with few connections, it’s difficult.",
            "Once upon a time, being a software developer was cool.\n\nAnd then in 2000, suddenly all of our jobs in America were outsourced overnight to third-world countries. It would literally be ten full years before those jobs would come back.\n\nAnd now? Jesus. Look at all the people who think that there are unlimited jobs in this field.",
            "90% would pivot to liberal arts or something less serious.",
            "I’ve got a dude our firm just brought on, he has said over and over he’s A+,net+, sec+ but can’t find his way around a Windows machine.\nCerta and pokeballs, collect them all",
            "It's been growing for years, so not really no",
            "Nah a lot of people like every major find out it’s not for them. Perfectly fine until many more of such people end up graduating. 😆",
            "When I enrolled in CS in 2000, my introduction class had 80 students. Only 40 remained at the end. Programming 1 had those 40 and only 20 remained at the end. Programming 2 had those 20 and 10 were left at the end of the semester. Then assembly came and those 10 passed. The language was BASIC, C++ and x86. People struggled with C++ the most. When I reenrolled into college in 2017 to obtain my bachelor s degree, I met a lot of people who thought all they had to do was create their own Facebook or YouTube site to make millions.",
            "I’m in my second year And I’m just waiting for that “gotcha class”. I’m doing well for now tho, gotta keep up the grind",
            "it might get popular but not everyone has the ability to be a cs major. drop out rates will increase",
            "It was the same in the early 80s when I went to school.\n\nAssembly language, calculus, and writing a compiler will thin the herd.",
            "Not really worried because the amount of people who chose CS the year I entered university was halved 1 year in."
        ]
    },
    {
        "post_id": "r59ul5",
        "author": "MsftReject",
        "title": "3 months ago I posted here about being rejected by Microsoft for full time after my internship. Today I have 8 new grad offers.",
        "url": "https://www.reddit.com/r/csMajors/comments/r59ul5/3_months_ago_i_posted_here_about_being_rejected/",
        "score": 489,
        "num_comments": 75,
        "created_utc": 1638231748.0,
        "selftext": "Original post:\n\n[https://www.reddit.com/r/csMajors/comments/pe541i/rejected\\_for\\_full\\_time\\_return\\_offer\\_after/](https://www.reddit.com/r/csMajors/comments/pe541i/rejected_for_full_time_return_offer_after/)\n\nWhen I made the post here 3 months ago and it took off, I got a lot of good advice to start applying to companies immediately. I probably applied to aprox. 200 companies for new grad in the month of September.\n\nHere are some notable rejections:\n\n**Failed after OA:**\n\nIBM 9/16\n\nStripe 9/16\n\nOcient 9/16\n\nExpedia 9/26\n\nBetter 9/26\n\nGoogle 9/26\n\nRedfin 10/7\n\n**Failed after phone:**\n\nFacebook 10/11\n\nBloomberg: 10/25\n\nOracle\n\n**Failed after final:**\n\nAmazon 11/26\n\nQualtrics 11/15\n\n**Offers:**\n\nJPMorgan 130k NYC (switch to another location) Accepted\n\nDell 86k Austin\n\nGM 100k Detroit\n\nChevron 100k Houston\n\nProgressive 75k Remote\n\nCaterpillar 90k Chicago\n\nFord 90k Detroit\n\nWells Fargo 74k Raleigh\n\nFirst thing to note is that Microsoft (or probably any FAANG) on resume got me responses from just about every company. There were countless ghosts and rejections not shown here but I got a good shot at almost all big tech companies (except Apple which always ghosts me).\n\nIf you notice, I only got offers from companies that have fully behavioral interview loops. Yes Chevron and JPMorgan asked technical questions but they were LC super easy (Fibonacci question for example). The good news about this is my STAR responses really work. The bad news is I could not meet the bar in my LeetCode style technical interviews.\n\nI started the recruiting season after my Microsoft rejection with 81 LeetCode solved. About 60 Easy, 21 Medium. From September to now I completed 46 problems for a current total of 127 (63 E / 57 M / 7 H).\n\nClearly this amount wasn’t enough. I bombed basically every DS&A interview round except the one for JPMC where they asked me to count the occurrences of nums in an array…\n\nMy strategy for the last 3 months was to fully complete and internalize this even more consolidated version of the B75 list written by the original B75 creator. It is 50 questions instead of 75:\n\n[https://techinterviewhandbook.org/best-practice-questions/](https://techinterviewhandbook.org/best-practice-questions/)\n\nThis list opened my eyes to Tries, Heaps, and a bunch of other crucial LeetCode patterns I had not known.\n\nAt my current level of preparation, I feel that I have seen each LC pattern at least once and know about each data structure. However, I don’t feel like I’ve mastered any one topic. If there’s one thing I’ve learned about LC (at least for myself) its that time and practice are the only thing that will help me improve. Some people crack G with >50 LC solved, and I can not even understand how. This process is a painful slog and there is no way around it. I will be grinding this until I crack FAANG again and it may suck the entire time, but I will do it.\n\nI'm excited to start at JPMorgan next year and explore a new city. Along side my new job Ill continue to interview prep for next years recruiting season. I’m hoping to apply to all the same companies again when my cooldowns come up and I can interview as a new grad around August 2022. Hopefully by then I’ll have hundreds of LC solved and be ready to give it another shot.\n\nPlease ask away if you have any questions or advice",
        "permalink": "/r/csMajors/comments/r59ul5/3_months_ago_i_posted_here_about_being_rejected/",
        "comments": [
            "Congrats! Glad you are doing so well! I remember that post lol",
            "How important is knowing to code data structures to pass an interview and get a job? Important tips for a CS senior that hasn't done any internships?",
            "Dude did an internship at Microsoft and was worrying about a job after graduation.",
            "[deleted]",
            "[deleted]",
            "Big congrats!",
            "Damn, i got asked 2 Mediums(one DP Medium) for JP Morgan",
            "You JPM offer looks amazing! are the 130k base or TC?",
            "Lol chevron asked me the fibonacci question during my internship interview which is probably as far as my technical skill goes. great to see that full time is the same level of leetcode ridiculously easy",
            "What college do u go to",
            "How did you manage to succeed in behavioural interviews and STAR responses?",
            "How important (on a scale of 1-10) it is to have big tech names on your resume? Just curious. No hate pls.",
            "[deleted]",
            "what does OA mean?",
            "great job, congrats!",
            "Congrats!! Love to hear it",
            "Congrats! I enjoyed my time at JP Morgan this past summer & I hope you end up liking it too :D",
            "Congrats! I also accepted a JPMC offer but my TC looks a little different at my location lol",
            "Do you have a PowerPoint available on how to breakintabiktek?",
            "Hey what jobs at GM and Ford was this for? Their rotational programs? GM at phone screen telling me new grad base is $65k lol",
            "wow! congrats!!  hope JPM is a good experience for you",
            "Congrats!! I remember reading your original post and I'm glad you were able to step up and get so many great offers! Hats off to ya",
            "How do you guys get so many interviews? Please enlighten me!",
            "Did you have any previous job experience at all related to software?",
            "I'm so proud of you. It is a total grind - a grind that never stops. That being said - your title was a little clickbait.",
            "Congratulations!!!!",
            "Just keep doing LC! Eventually will make it",
            "Do you mind telling us what was your prior experience?",
            "[deleted]",
            "[deleted]",
            "Thank you for your post! I’m in the same boat, and I’m feeling very confident in the end, like you. We’ll get FAANG again!!! 💪🏻",
            "How long did it take for JPMorgan to get back to you after your final interview?"
        ]
    }
]