[
    {
        "post_id": "1biv60i",
        "author": "Strange-Rub-2772",
        "title": "Finally I did it guys as an International student!!",
        "url": "https://i.redd.it/go714qbmucpc1.jpeg",
        "score": 1975,
        "num_comments": 180,
        "created_utc": 1710882013.0,
        "selftext": "I am beyond thrilled to share with you all that I've finally secured an internship after facing numerous challenges and enduring many sleepless nights. As an international student, the journey was nothing short of daunting, but here I am, a testament to the power of perseverance.\n\nThe path wasn't easy. I remember my first interview at Bytedance; it was a disaster. I froze and couldn't speak for 20 minutes straight. It was one of those moments where everything you've prepared just vanishes.\n\nFast forward to now, and I've received 3 offers, including one from a company that had previously rejected me. In a twist of fate, I've decided to accept this offer.\n\nTo everyone out there struggling, I want to say: your next offer, your next interview, your next opportunity is on the horizon. Keep pushing, keep striving, and most importantly, keep believing in yourself. The road might be tough, and the nights long, but the dawn of success is near.\n\nKeep going, everyone. Your time is coming!\n\n#InternationalStudent #InternshipJourney #Perseverance #SuccessStory",
        "permalink": "/r/csMajors/comments/1biv60i/finally_i_did_it_guys_as_an_international_student/",
        "comments": [
            "All this for a fucking internship ? This is ridiculous",
            "8 of your rejected turned into an interview, incredible!",
            "Hey guys,\n\nA lot of you were texting me. about my resume so here it is \n\nhttps://preview.redd.it/zyh4qs6ziepc1.jpeg?width=948&format=pjpg&auto=webp&s=48812cfa1920aac39d190b2cd1f3f902f2873f74",
            "Damn, congrats! Wishing you good luck during your internship :)",
            "Wow. That is like 200 applications for an interview. Impressive considering you're international. I'm a U.S. citizen, and I've gotten like 1 interview per 100 apps or something.",
            "Congratulations man big W!",
            "Congrats! I know how hard it is for international students, especially in this market",
            "do 1632 companies exist? /s. congrats. sorry it was so turbulent.",
            "Congrats man, this is so encouraging! May I ask where did you apply mostly? I having been using LinkedIn quick apply and greenhouse a lot, but the ratio of receiving the interview is quite low. Did you also mainly apply using this kind of quick method or just patiently apply on the official website or workday?",
            "1 632 applications for an internship?\n\nCongratulations on finally making it, but dear God these numbers are absolutely staggering",
            "Very inspirational as an international, you got replies from cold applying or referrals?",
            "Do you mind sharing an anonymized version of your resume or maybe the key points that might have helped you?",
            "I cant wait for when 2500 apps will be the new norm.",
            "Did you use chatgpt to write this post",
            "Any general advice for new undergrad students?\n\nIt feels like everyone is so far ahead of me lol.",
            "Congrats! Would you mind sharing your resume for reference?",
            "congrats dude, top job. I am also in the same boat, started applying from November applied to 350 companies, no interviews up until.",
            "could you also share your anon resume if you don’t mind? also intl rising senior",
            "Congratulations!!!🍾",
            "What’s your resume like, thats a godly interview to rejection rate",
            "What's most insane is how you managed to track these many applications! Applying is quite insane and I can only imagine how hard it must've been, but tracking them must've also been a logistical nightmare!!",
            "Damn, 1600 apps lol. Did you try to tailor your apps based on the position? I don’t think it’s worth the effort, but just curious. Also, did you have a portfolio or GitHub of projects to show?",
            "Congrats! What did you use to graph this?",
            "Is your school T20?",
            "Congrats dude! Can I dm you for some questions?",
            "Jesus dude, how many different companies did you apply to?",
            "where are you from and in what country did you apply ? 1632 applications sounds completely insane to me. In what time frame ? Looks like you applied to every single company existing",
            "can i see your resume in dms? It would be really helpful!!",
            "Congratulations! Would you mind sharing your resume with me? I'm an international student as well, and I've been struggling to land an interview.",
            "is this the states?",
            "Can you please show us an anonymized version of your resume?",
            "Congratulations buddy, glad you did it.\nCould you please share tips of where and how to apply? I’m an international student too graduating this May, I hardly find jobs for entry level positions. I have 1.5Y exp but still couldn’t. Need tips please.\nAlso how you tracked all of these?",
            "So proud of you!",
            "Share your profile pls?",
            "I went from a international student to intern to fulltime employee in the last 8 months . I know your pain and brother , I just want to sat good job on holding on . It will only get better and better from here. \n\nAlso , Trust yourself , Stay grounded and work with confidence. Good luck my man . You got this . I am rooting for uoi .",
            "What the fuck? How long did it take to put in all of those applications?",
            "[deleted]",
            "Rubbing one out for you too my brother, very happy for you, congrats.\n\nLet the good times roll!",
            "Ghosted after a 2nd interview? Ouch!!",
            "This is super inspiring; can I DM you?",
            "Congratulations 🎉 <3",
            "Hey congrats. Not sure if you posted it or not but if the internship is in America and you are moving physically there and plan to work there in the future, look into what CPT and OPT are. It might be different for you since you don't have a J-1 visa, but some of it might apply to you if the conditions above meet.\n\nBut if it's remote, enjoy your internship, ask a lot of questions and watch your sleep schedule if you are still in India",
            "I remember I was applying to 10-15 jobs a day, for like 4 months, and after like 15 interviews I finally got a job. Jesus life is difficult",
            "Congratulations man!!",
            "how does one come up with this visualisation? 👀",
            "You is my source of the inspiration. Bravo.",
            "hey man, congrats on your internship. is this a good time to come to the US for masters. could you give your opinion given the job market today",
            "Hey how did u track it?\nWhat application is used for this?",
            "Congratulations",
            "You gotta be like 22 to do this lol",
            "Nice job mate!",
            "Why there were 7xx rejections but then you got offers among them?\nDid those companies reject you then reach out again for interview invitations?",
            "When you say rejected, do these include the automated OA that some give?",
            "Damnn congratulationsss\nU planning to settle in us?",
            "Yo bro, firstly congrats to you! Also, I'm thinking of pursuing masters, I have a local internship for 6 months and 2 international internships, 1 from a YC funded startup, both 6 months so I'd say I have 1.5 yr exp, along with 2 months of backend work in my college. Tier 3 college, do you think it's a good option for me to join for masters? Ofc, the same perseverance as you had will be in order",
            "And suddenly dude is a motivational speaker",
            "Man you shouldn't have to try this hard to get a job, let alone an internship. Nonetheless, congratulations and good job with the hussle.",
            "What software did u use to generate this graph. Look interesting!",
            "1632 is just bullshit really. Just spamming anyone and everyone",
            "Damnnn ! This is awesome! Please mention some resources and what did you study to prepare for all this",
            "fellow international here: it’s a hellish process but boy is that final payoff gratifying",
            "Congratulations 🎊 ❤️!! I’m an international student too and this gives me hope",
            "CS majors be going over mountains for this. Never knew how hard it can be. I don’t know if it’s just a major thing. Because in my major it’s not like that.",
            "Is this a Sankey diagram?",
            "Which app do you guys use to track this ?",
            "As an international student, this makes me happy, All the best op!",
            "For me multiple that graph by 100 and add 1 offer and one sacked for no reason given and no reference given keep away from uk",
            "Bro what are all the websites you used for applying",
            "congrats dude! genuinely wondering where do I find so many jobs to apply though? i use the simplify extension for autofilling and while it definitely speeds the process up, i struggle finding jobs to apply.",
            "Congratulations",
            "Great job.\n\nI think this also shows that even for strong profiles, getting the interviews is really the hardest part.",
            "Are you a masters student?",
            "love all those hashtags in reddit posts lolll. But big congrats and much respect on your determination. Onwards and Upwards!"
        ]
    },
    {
        "post_id": "1bym0p7",
        "author": "FamilyUnfriendly",
        "title": "im cooked",
        "url": "https://i.redd.it/qegfxmn6x5tc1.jpeg",
        "score": 1976,
        "num_comments": 120,
        "created_utc": 1712541524.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bym0p7/im_cooked/",
        "comments": [
            "In grad school what shall i do now, PHD ? Feels like giving up",
            "I wouldn't be able to afford grad school 😬",
            "Solid meme. Suspect that building shit for a year would be cheaper and more relevant than a year of school. But being eligible for internships sure does seem appealing.\n\n  \nedit: eligible not edible lol",
            "Then you go to apply for the role and see that 50-60% of the applicants are with MS degrees",
            "I think grad school is only worth it if you can get into a top CS program (big tech feeder schools), then applying for internships during the summer. Otherwise, just a Masters Degree alone isn't worth the time and money required.",
            "I got my masters and met the recruiters at two separate career fairs my school was holding. I gave my resume at both and eventually got the interview and job. Networking helps! You have a much better shot than being a total stranger.",
            "Y’all rlly attacked me on this Monday 🥲☠️",
            "Keep looking; get certifications while you get a job",
            "But what about people who are about to graduate from grad school?",
            "I wonder if masters is going to get way more competitive for this reason",
            "Can confirm, never had an internship and I’m graduating early so I’m doing a quick year of grad school. Now I’ve got a good internship and hopefully can convert for a full time offer",
            "emotional damage",
            "Dude I’m applying for PhD this year and have been planning for a long time. Don’t ruin it for me cuz you can’t find a job.",
            "This is only prolonging uneviatable",
            "If im graduating this fall, should I start thinking about grad school now or wait and see after I graduate?",
            "It’s over for us",
            "this is what happens when you have 0 projects and no dsa skills",
            "That’s what I did. Got a GA position that gave me a full ride and monthly stipend just to teach some undergrad cs classes. Got a free AI and ML masters, and leveraged it for a job shortly before graduation. Albeit, the job was SWE, but it pays well so I can’t really complain. Definitely the way to go if it’s financially feasible for you if you can’t get anything lined up. It only serves to help you.",
            "Literally half of my class. It’s this or find an unrelated job. The funny thing is an MS in CS is pretty irrelevant.\n\nCS is feast or famine",
            "I do have potential jobs lined up but I rather take a break after college to relax than to head straight into the workforce.",
            "I have served a few people who have been in the industry for a long time (I’m a server at a fairly nice restaurant) and one of them advised me that grad school is useless without experience under your belt. I want to get a masters but only after I work for a while first.",
            "so we all had the same idea",
            "As someone who just got their masters, no.. no it is not.",
            "I thought a CS doctor should be contacted by the headhunting company automatically and just need to wait for the offer at home.\n\nbut now I am thinking about the PhD dream seriously",
            "I think grad school is a popular choice for when the job market isn't great. I graduated with my B.S. in 2006 - and saw the 2008 recession where it was even worse than today apparently for software engineers. Fortunately, I was doing a PhD in CS from 2006-2013. If you get into a decent PhD program, you will expect a tuition waver and a stipend as long as you're covered by your advisor's research funding as an RA, or the department's teaching funding. I would not recommend paying for grad school\n\nEither an M.S. or Ph.D. has been historically required for most data science and machine learning engineer positions. Although, I have seen the degree requirements becoming more relaxed through time. Graduate program and publications can open up exciting fields such as generative AI/machine learning, scientific computing, advanced graphics, etc.",
            "But how am I going to slack my way through grad school :(",
            "It’s awful",
            "This was me. Covid hit halfway in to make matters worse.",
            "I became an electrician lol",
            "I completed my Master's degree in December 2023 and have applied for 218 jobs so far. Unfortunately, I have not received a single interview yet. I have a Bachelor's and Master's degree in Computer Science, but I am starting to question whether I made the right choice by choosing this field after high school.",
            "I’m don’t even have a degree and I live in a 3rd world country and I got a job how is the job market so fucked for you all?",
            "My masters was basically a two year long networking opportunity with people who had their shit together more than I did.\n\n\nThat being said, it was exactly worth 2 years experience, so going directly into industry would have been fine too.",
            "I don’t get why CS acts like it’s in this special category of BS is enough to land a great job at a top company just because, as compared to other STEM fields. You normally do not find this in the natural sciences at least…\n\nAfter doing my bachelors in chemistry and biochemistry at a top 50 school, it took years working as a contractor for a pharma company before being brought in as an FTE at that company. Now they are paying for my masters in CS as they hope I can apply what I learn to benefit the company. \n\nYou can also apply for jobs that are related your bachelors through the skill you learned, and aim for one’s where the benefit is tuition reimbursement towards a masters. That way you get the money, you get the degree, and you get the experience/time to apply it."
        ]
    },
    {
        "post_id": "19b2s0v",
        "author": "Forward_Opinion6038",
        "title": "Cooked😭😭",
        "url": "https://i.redd.it/docoh5skqidc1.jpeg",
        "score": 1968,
        "num_comments": 79,
        "created_utc": 1705723118.0,
        "selftext": "The way it’s looking rn this might actually be a reality",
        "permalink": "/r/csMajors/comments/19b2s0v/cooked/",
        "comments": [
            "Computer science is the new liberal arts degree 😂",
            "A lot of computer scientists can’t actually computer science… some sophomores at my school might struggle with defining a loop.",
            "I think some people just get the degree by relying too much on other people like copying assignments, memorising concepts w/o understanding, etc without actually learning anything",
            "https://preview.redd.it/pvi5gxrcyidc1.jpeg?width=1170&format=pjpg&auto=webp&s=3922d11be1431556408f4a3ed0187f4c2ebb44a8\n\nwe might be doomed",
            "It’s jover",
            "Good thing I did computer engineering instead, y'all stay safe tho.",
            "it’s over 😭😭",
            "Computer science is the next psychology degree",
            "It do be like that sometimes",
            "This sub really transformed into some meme shit didn't it",
            "😂😂😂",
            "i wanna laugh and cry",
            "Is cyber security just as fucked? Literally just applied to a college to study that lmao. Still have time to pivot if so",
            "That mf is not even in the states",
            "Thank God I needed this comment section for my mental health 😭 \n...nvm (I scrolled down a bit) 😭😭😭😭😭😭😭😭😭",
            "Glad I did electrical engineering",
            "Ayo",
            "So our main skill set is to problem solve In an algorithmic fashion\n\nWe are inherently valuable in other fields that are unrelated for the exact same reason engineers are\n\nWe should not have that problem\n\nIf we are having that problem it's because something has gone wrong and not the normal type of wrong"
        ]
    },
    {
        "post_id": "18ulswf",
        "author": "Big_Zookeepergame711",
        "title": "Our Mental States Now",
        "url": "https://i.redd.it/mjeiiil94h9c1.jpeg",
        "score": 1954,
        "num_comments": 33,
        "created_utc": 1703960116.0,
        "selftext": "If I grind one more question, maybe I’ll finally land FAANG 💯",
        "permalink": "/r/csMajors/comments/18ulswf/our_mental_states_now/",
        "comments": [
            "That'd be me if I even got interviews lol\n\nExcept from Google's OA, it's all automatic rejections lmao",
            "getting past resume screen is harder than the OA",
            "GPT 4 can outperform most humans on leetcode, we just have to figure out a way to hook GPT 4 into like a Google Glass type of tech and walk into interviews with them on lowkey and BAM! Get job",
            "The American Dream 💯🦅🦅🦅",
            "nah can't relate, don't want FAANG. I just want to live and support my little hobbies.",
            "Nah I’m a LC monkey for life 🔥💯🥶",
            "ive gotten more results from studying concepts from my DSA class like BFS/DFS/Dijkstra/Topological Sort/ etc. than I have from doing leetcode ngl",
            "Already at FAANG, not worth it.",
            "I gave up ages ago. xD\n\nJust searching for something better. I'd rather work a job that doesn't cause my eczema to trigger constantly from all the stress. Making 150k means nothing if I don't have a right hand in 20 years.",
            "Its a numbers game, leetcode isn't that important at all I think.",
            "I get to the technical interview and fold so fast I need to get better at coding fr 😩 . I can talk it out but actually typing it out is different story 😅",
            "I just need to create skynet"
        ]
    },
    {
        "post_id": "1b8ndju",
        "author": "bellashiraaa",
        "title": "Saw this today really debating my major…",
        "url": "https://i.redd.it/25f79uwhtumc1.jpeg",
        "score": 1955,
        "num_comments": 158,
        "created_utc": 1709792015.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b8ndju/saw_this_today_really_debating_my_major/",
        "comments": [
            "Could be worse. Looking at you, art students",
            "I’m convinced this subreddit is a ploy to discourage CS majors in order to steal all the jobs for themselves",
            "Will code for food. HMU",
            "Add a layer of abstraction called “money” and then a layer called “employment” then you’ll get an average dev.",
            "I’ll take a full stack application sir",
            "I’m a freshman right now. Someone just cross posted [this](https://www.reddit.com/r/singularity/s/r9n5duRe1W) video of an AI making a multiplayer program in 2 minutes off of one prompt. I genuinely suck at coding too. Should I just switch my major?",
            "Wth is this... There's no way anyone talked to him about coding",
            "CS is losing any prestige it once had",
            "Just remember this: if your society wasn’t broken it wouldn’t matter if your education became useless.\n\nYou’d just get free education in something that mattered right after because of the loss of demand.",
            "What are you switching to then genius?",
            "I mean everyone can code now. It’s like driving.",
            "Until I see a diploma, I assume he is self taught",
            "Would Eat for Code",
            "Sell those pants and you'll be fed for a week\n\nThe iPods could feed you for a month with careful spending",
            "Don’t get discouraged, good coder can never be unemployed. \n\nIf I would have seen this dude I would have paid him $100 to answer first 10 medium leet code or maybe 5.",
            "A lot of people spreading these ideas for some reasons that I still couldn't figured it out. And as a student of computer science and technology in China. I found all the speeches that discouraging the students of this major and reduce their expectations and their trust in themselves. \nI can agree that some jobs could/will be replaced with AI but at the same time it will open a lot of opportunities for intelligent people. \nSo my advice for you guys and also for myself just keep learning and be up to date and you should know that the traditional methods of applying and working is changing and the most important thing is to THINK OUT OF THE BOX.\nAND I WISH YOU A BRILLIANT AND A SHINY FUTURE. \n🫰🏻⭐",
            "If you like math, take actuarial exams. If you don't like math, be a premed.",
            "I wonder what happened to this guy. Did someone just walk up with a computer? Lol",
            "Look what happens to international talents in US... should've gone to EU",
            "It should be abundantly clear by now that you should only stay in CS if you genuinely enjoy it regardless of money. If you are chasing money, which is fine, there are obviously better ways than grinding CS.",
            "got his friend to stand outside then looped back around the block",
            "Yes thats how it is\n\nhttps://preview.redd.it/djq7qz4efzmc1.png?width=1366&format=png&auto=webp&s=aa9ecc53f4abfacceb37dfc1b2bc00a2b1ef7a68",
            "HAHAHHAHAHHAHAHHA THIS SHIT HILARIOUS LOLOLILOL",
            "Just lift from store or go food bank"
        ]
    },
    {
        "post_id": "181rjhs",
        "author": "DivideLocal3926",
        "title": "My Internship Application Journey",
        "url": "https://i.redd.it/vtj7hapjl02c1.png",
        "score": 1940,
        "num_comments": 45,
        "created_utc": 1700709175.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/181rjhs/my_internship_application_journey/",
        "comments": [
            "getting banned on linkedin is rough",
            "NoBoDy WaNtS tO wOrK aNyMoRe\n\n![gif](giphy|QUXYcgCwvCm4cKcrI3)",
            "Lmao just saw a normal version yesterday this cracks me up",
            "Forgot the serious flair",
            "So I'm less concerned that they revoked your citizenship and deported you than The fact that they did it twice how did they do it twice did you get kicked out of the second country too",
            "I hate it when I send in a job app with a strange amount of required personal information and they empty my bank account 🙄",
            "Has to be the best sankey chart on here though lol",
            "OP got a speeding ticket for speedrunning teh internships",
            "How to create this type of tree's ??",
            "I read \"Rejected me again for good measure\" at first and got concerned, then I saw the rest. This cracked me up well, thanks OP!",
            "typical application experience 😂",
            "This is what I call journey",
            "How does it revoke your citizenship?",
            "Real",
            "Imma brings a katana to challenge them to a mortal combat till death if I fail the technical interview in this case, let me know which company allows me to do this OP",
            "Which website are you using to make this graph",
            "Forgot the hair loss and sleep disorder ones.",
            "They had us in the first half not gonna lie"
        ]
    },
    {
        "post_id": "1ahl6d4",
        "author": "punchawaffle",
        "title": "They're putting it in the job description now lol",
        "url": "https://i.redd.it/1k7vck8u5agc1.jpeg",
        "score": 1902,
        "num_comments": 314,
        "created_utc": 1706926833.0,
        "selftext": "This job posting literally put the colleges they'll hire from lol. I've never seen this in a job posting till now.",
        "permalink": "/r/csMajors/comments/1ahl6d4/theyre_putting_it_in_the_job_description_now_lol/",
        "comments": [
            "Google and Jane street tremble in their seats knowing they’ll have to compete with this “local comapny in Austin” for the best talent",
            "In Austin and lists only two schools in Texas. RIP",
            "Name and shame (and also so I can look up the posting, or could I dm you so I can see the posting)",
            "Seems TAMU >> UIUC",
            "Waterloo punching the air hard rn",
            "TAMU is a top school??",
            "RAHHHHH TEXAS A&M MENTIONED 🤠🤠🤠👍👍👍 🐄🐄 🧑‍🌾🧑‍🌾⚙️🇨🇱🇨🇱🇨🇱 WHAT THE FUCK IS JAVA",
            "No UIUC, UMich, but yes to RIce and TAMU??? Its not even prestige cuz the Ivys are Cornell Penn and Princeton not even Harvard Yale etc. Wtf is this arbitrary ass list?",
            "Cries in UWaterloo 😭",
            "I convince myself that school name doesn’t matter and that tech is different from other fields, but alas, the truth will always be cold and bitter. ",
            "“I can throw ball really far” *immediately hired*",
            "Small Indie Dev company hiring CS grads who have 20 years of experience of programming, top 5% GPA and 10 patents filled by graduation.  \n\n\nCompetitive salary starting from $9.99\\*.   \n\n\n  \n\\* Terms and conditions may apply. Free coffee not included.",
            "I mean... like the pay is decent, so it's fair that they choose to only recruit from these schools. But Rice over UIUC & UCLA? Fuk off lol, clearly the recruiter is clueless",
            "I guess eth zurich, imperial, tu munich, national uni of singapore, are all shit.",
            "Can you dm the posting lol",
            "Gig’em Aggies!",
            "[deleted]",
            "EPFL but no ETH xD",
            "\"Our client is a leader in technology and is looking for a Junior / Associate level Software Engineer to fill a high-impact role on their team.\"",
            "Imagine graduating from Beida to work at a \"local company in Austin\" lmao I'd rope",
            "Run, don’t walk away from this company.  It’s clear they don’t know how to recruit talent.",
            "For those of you asking, this is the job posting lol: Check out this job at Simplex.:  https://www.linkedin.com/jobs/view/3813306318",
            "should as well give this link  [QS World University Rankings 2024: Top Global Universities | Top Universities](https://www.topuniversities.com/world-university-rankings) , lot top 10 uni name not in the list.\n\nImperial? Zurich? NUS?",
            "SAN Paulo over Waterloo???",
            "Universidade de Sao Paulo? Omg We are so in <3",
            "texas a & m in that list is crazy",
            "sao paulo > ETH zurich, NTU, NUS, waterloo. damn",
            "People still use name recognition as a primary factor in hiring - that's embarrassing. There are a lot of mid sized no name colleges with great CS programs out there.",
            "I mean that's way bigger than our list lol. We filtered any resumes not from MIT, berkeley or stanford and I can't remember which canadian university for our new grad pipeline this year. Still way too many resumes",
            "Sad Harvard graduate noises 😢😭",
            "They didn’t thought of mentioning Harvard in the ivy list.",
            "Good thing there are no German universities in that list. Everybody knows that Germans are really bad at engineering.\n/s",
            "Random ass international schools too. No NUS or NTU?",
            "What's \"On-Site M-F\"? \n\nThere's only one thing I can think of and that's really inappropriate 😁",
            "All the r/WGU_CompSci graduates are devastated",
            "nyu missing this time",
            "A company hiring in Austin doesn't deserve employees from these school",
            ">$170k entry level job with no state income tax.\nThats nice.\n\nWith so many kids graduating with CS nowadays, employers get to be picky. IMO it’s going to keep trending this way for the industry.",
            "TAMU",
            "UWAterloo?",
            "They slid in TAMU 😭💀",
            "This is a green card interview for someone who they already hired and went to tsinghua and prolly mit.",
            "Listen, it's great if you can get into an ivy league. It does to an extent show that you have the ability to Excell in an academic environment. Half the people I know that went to ivy league had absolutely no social skills. I think company's basing their posting off of college choice is absolutely ridiculous. What school you went to doesn't reflect your ability to perform in a workforce environment. I wouldn't want to work at a company that judges you solely based on what school you go to😂",
            "I hate being a UC Irvine student...",
            "limiting your hiring to 'top schools' is honestly some of the more inane elitism shit I've seen.",
            "Its really obvious what they are doing. Every school on there works you like a horse. They are looking for CS people they can force into working long hours. Notice how harvard isnt on there but Cornell is?",
            "A&M being on that list tells you all you need to know lmao",
            "[deleted]",
            "[deleted]",
            "why isnt IIT on the list. Modi ji in shambles jAi hInD",
            "...isn't that discrimination?",
            "Its says examples, don’t get triggered",
            "Very America weighted",
            "Nobody who's graduated from Oxbridge is going to move to Texas to work on site Mon-Fri. Behave.",
            "I honestly dont mind that. Why would you wanna apply for this job if they secretly have these criteria anyway?",
            "SChOol RaNk DoeSNt MAtTeR",
            "Mfs getting pressed bc their school’s not listed. As if \n\n1. the post didn’t say \n“But are not limited to”\n\n2. An arbitrary job posting says ANYTHING AT ALL about your schools as an engineer",
            "It's easier for them to interview less candidates and pick the ones they want. Only interviewing the top colleges achieves that easily. They're not saying that anyone not from the top colleges is worthless or not as good as them; it's just that the people from top colleges are better on average so they are more likely to find the ideal candidate from that pool",
            "Shouldnt that be considered discrimination?",
            "Name and shame the company, this is sofa King dumb. \n\nPlus you have to live in Texasistan. Somany better places to live in the US.  \n\nThe micromanagement and the shittiness of the position is directly proportional to the job posting length!",
            "Honestly, I don't see the problem? You just look like a bunch of losers complaining that a job requires people from top universities of the world.",
            "lol uc Berkley being a top school 💀",
            "this is a good thing",
            "Yea because lower tiered schools have dumber students on average.  Makes sense.  Glad to see my school in the list",
            "Scheller STAND UP !!! 😤💪🏾😤💪🏾",
            "there's another company that does the same thing",
            "Not purdue????",
            "Name and shame",
            "What the hell!!! Too funny and sad",
            "So Sao Paulo is better than any European uni?",
            "Ask them which of those schools Dave Cutler, Jeff Dean and John Carmack attended.",
            "So, they expect to know where they're recruiting from... But their super duper top secret company in TX that the recruit is expected to work for is… TOP SECRET!!!",
            "So many internships and jobs keep being listed in Texas nowadays. Why is it such a popular state for jobs?",
            "No Irish colleges? Wack",
            "The worst kind of elitist assholes are incompetent elitist assholes.",
            "They hate B1G.",
            "Jokes on them, you don’t get a degree from Oxford or Cambridge but from the constituent college.   \n\nThey should have included Hull as well, Oxfords a complete dump",
            "\"Texas A&M\"",
            "seeing my school’s name on this list actually makes me feel so much better",
            "Is this company so big and provides the experience so exceptional they can filter their employees this way and still find someone?",
            "I just want to let any recent grads know that outside FAANG, this isn’t an issue. I went to DePaul, didn’t graduate because I joined a startup that wanted to bring me on full time, and I’m now an EM with my next goal becoming a director. Talent matters, work ethic matters, and there’s a whole universe of great software companies outside of search and social media.\n\nMy advice, join an early stage startup, prove your mettle, and build a solid resume. You give up earnings early on, but it’s an amazing skill and career booster.",
            "Fuck it. I just applied for the hell of it.",
            "We want superman on a homelander budget",
            "Hey could you dm me the link to this role?",
            "Damn I don’t see my community college 😞",
            "They have a typo in their job posting. That's an automatic no no from me. Without it, the list itself is a red flag the size of Jupiter.",
            "I'm extremely uninterested.",
            "It's a bit silly that Imperial College London is not on this list.. Even if the list is not exhaustive.",
            "Uh, isn’t this discrimination?",
            "TAMU hella generous",
            "Texas A&M but not University of Michigan?",
            "Where my Tijuana community college?",
            "Harvard and Yale students it's over",
            "eyyy, Georgia Tech is here.",
            "A lot of people missing the “(but are not limited to).”",
            "No UIUC is crazy.",
            "And redditors insist its better to go to community college for a degree than a top college😭",
            "Would UChicago be part of the list?",
            "They tried to sneak A&M in the list😂",
            "The pay better be minimum 150K",
            "No Harvard?",
            "They can go f themselves.",
            "Companies aren’t stupid. They know when they can get a better candidate for less money. Hence, they will ask for it if they can",
            "This market and the brazenness of these local companies. It’s almost laughable. Waiting till the market gets a little better, it will be fun looking at these same companies scrambling for talent.",
            "A&M???????",
            "Why is Texas A&M considered a \"top school\", but not UIUC?",
            "Lowkey shocked that Harvard isn’t on the list.",
            "U Penn? Lol",
            "Companies know how desperate CS grads can be.They will most likely get a person from a top 5 school",
            "\"This role is On-site m-f\" yeah good luck finding someone from those schools haha",
            "As a fellow Ga Tech alum, I can’t say I’m surprised companies do this, but I also think it’s a bit presumptuous of them to think they offer what top engineers in the nation would want. Not that I am one, I just graduated from a top school, I don’t claim to be a genius",
            "Looking for top tier CS ppl, only to put out garbage service",
            "So when should we start fighting for educational discrimination? Sounds weirder writing it out in my head, but basically discrimination based on what school you went to. Seems rather unfair for those who couldn't afford to go to one of these more well known schools.",
            "That's a weird list, actually. All over the place within the top 50+ schools in terms of quality & prestige. \n\nAnd they missed IIT. Wtf?",
            "Guess ill be unemployed for the rest of my life",
            "I didn’t think Texas A&M was that hard to get into. I know they have a very well regarded CS program, it seems kind of out of place on this list.",
            "It’s always been an open secret in college recruitment  programs they operate by tier 1, tier 2, tier 3 and so on. Tier 1 being best schools, in addition to largest universities schools for most states with some 30k attendance (think Alabama, Ole Miss, UGA.) A good indicator of Tier 1 schools aside from obvious top ones are Division 1 football schools that are raking in truckloads of money and can finance hiring pipelines for their graduates.\n\nTier 2 are the state schools that aren’t the biggest in their states but nonetheless great, like CSU vs UC systems in California. And some name ones like Taft in masscusettets. Then again, using NCAA Division 1 as an indicator, the rest of the schools like Hawaii or CU Boulder.\n\nTier 3 - it gets quite hard to define this category but again, I’ve seen most of them are NCAA division 2 and 3.\n\nThe industry doesn’t make life fair like that unfortunately. You absolutely have to network and know people.",
            "It’s probably owned and posted by some old fuck who is brainwashed so deep that refuses to believe someone who didn’t go to college has an iq over 50 n has any work ethic"
        ]
    },
    {
        "post_id": "1clkcp6",
        "author": "Awkward_Evidence_791",
        "title": "Those impacted by Tesla rescinding offers",
        "url": "https://i.redd.it/c82zxsayftyc1.jpeg",
        "score": 1903,
        "num_comments": 106,
        "created_utc": 1715005530.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1clkcp6/those_impacted_by_tesla_rescinding_offers/",
        "comments": [
            "I feel like that GM doesn't have enough opportunities left to actually help tbh and it's just a recruiter trying to gain publicity (Might be wrong tho. Idk)\n\nEdit: If they are doing this for publicity, it's disgusting af",
            "So does anyone know how GM SWE intern interviews are",
            "GM just abandoned a bunch of people last year. They closed down their innovation center in Arizona and fired 900 engineers giving them less than a weeks notice.",
            "Faster way to recruit. Someone else has already done the homework in interviewing.",
            "Isn't GM also laying off/pushing early retirement to a few thousand people",
            "100% for the looks and to see if they get any outstanding talent on a bargain",
            "Lmaooo Elon is burning bridges left and right. He's a powerful guy with a lot of money but all this animosity he's drumming up very well could bite him in the ass eventually.",
            "Any CS shill who takes a TSLA or TWTR job is just desperate at this point.  Musk is a horrific boss and is persona non grata on the West Coast among the folks who actually get shit done.  Most of the talent he has left is trapped H1B talent and a few sycophants.  He'll be baiting the class of 2025 in a few months.  Avoid.\n\nEdit:  https://www.theverge.com/2024/5/6/24150274/tesla-layoffs-employee-fourth-week-elon-musk-ev-demand",
            "How does one react to this ? On one hand, you are thankful that people want you, but on the other hand, you are pining over a lost opportunity like TSLA and having to settle for some tier 3/4 like GM which you never wanted in the first place.",
            "RIP to all those already in the GM pipeline lol",
            "GM actually pays surprisingly well for new grads. I had a friend in Canada who got hired at GM for 102k TC straight out of school. This is in Canadian dollars of course, but I imagine the pay is even higher for U.S. positions",
            "Come to Detroit.",
            "GM abandoned my country.",
            "The tech in Gm is like 30 years old , do they even need tech interns ?",
            "So less work since Tesla already did the heavy lifting",
            "Lmao why the fuck would anyone want to work at GM, if they got into Tesla ?",
            "[removed]"
        ]
    },
    {
        "post_id": "16ybex5",
        "author": "Life-Marionberry5377",
        "title": "I did it boys",
        "url": "https://www.reddit.com/r/csMajors/comments/16ybex5/i_did_it_boys/",
        "score": 1894,
        "num_comments": 199,
        "created_utc": 1696287566.0,
        "selftext": "State school in Texas (not UT), CS, 3.0 GPA, no LeetCode, no projects, one internship, got a return offer for $85k, let’s goooo\n\nIt’s not six figures, but I’ll take it in this economy with my resume and COL in Texas",
        "permalink": "/r/csMajors/comments/16ybex5/i_did_it_boys/",
        "comments": [
            "People need to stop obsessing over 6 figures for their first job. 85K is fucking great",
            "Congrats! Remember it's your foot in the door. Won't be long until you pass 6 figures.",
            "What?! You're not making 400k/yr? \n\nWith that said, congrats and hope you celebrate 🎉",
            "This sub is giving people such unrealistic standards I swear. Not making 100k out the gate is in no way a failure or even indicative of your worth as an engineer. Being employed at all right now is huge, and 85k is life changing money to some people. It certainly was to me when I got started. First dev job was 75k and it was huge to me back then. Congratulations on your big accomplishment!",
            "Congrats 🎊",
            "My first job literally paid less than 60k and I was a swe. Half this sub thinks just because they went to a T30 school they should get a 6 figure salary it’s hilarious. Congrats OP.",
            "I lived a good life in NYC with a starting salary close to yours for a while. If I could do it here, you can do it in Texas! Fuck six figures: the “secret” is to be intentional with maximizing bang for your buck (quality of life wise). \n\n(This should be true at any income, even if a few years from now you make 185 instead of 85, but at higher income levels it can be quite difficult for most to resist increasing their quality of life by 10% for a 50% premium. This applies to vehicles, homes, clothes, travel, food, and so many other things…)\n\nBe grateful that you’ll get more than enough to live comfortably *and* responsibly, and enjoy it!",
            "No projects? Like not even from school? Nice👍",
            "lets gooooooooooooooooooooooooo\n\nI didn't do much leetcode, my GPA was a lot higher than yours, I only had school projects, no internships and got a similar starting salary + remote, it aint 6 figs but job hop a couple of times and it will be",
            "Shit man, how'd u get ur internship 😭",
            "Congrats 🎊. Pretty early too \n\nWhat was the process like ?",
            "Congrats dude\n\n![gif](giphy|blSTtZehjAZ8I|downsized)",
            "Congrats! I would go crazy if I got an offer like that. Don’t let this sub make you think you didn’t do something amazing bc it’s not 6 figures🙏🏽",
            "Good shit brother!",
            "85k is amazing (by all standards, other than the delusional ones of this sub) for the first job out of college! Congratulations!",
            "important lesson for everyone: if you dont get an internship that turns into a return offer, its over for you.",
            "Good job, even though I am not a boy!",
            "6 figures isn't happening unless you're living in Cali, Seattle or something like that. I'd happily live in Arkansas, Texas for that salary as a new grad",
            "Great job! Congratulations!! 🎉 a light in the darkness of elitists and regarded recruitment metrics/policies!",
            "85k in texas is quite good considering theres no state income tax and MCOL",
            "$85k out of school is good, especially in the current market conditions imo",
            "Awesome",
            "Dude was that school UT Austin?",
            "Well for your next job you can almost guarantee 6 figs. great job!",
            "Oh cool so tell me which Indian uncle you had to call ?",
            "Holy shit howd you do it 😭😭😭",
            "Vamos 💪",
            "85K starting is very solid, grats!",
            "Good shit man! You’re giving the rest of us hope!!!",
            " web dev job? asking bc im stressing abt leetcode and have no prjs either but dont wana do frontend/backend",
            "Congratulations!! Which company it is?",
            "literal chad of our time, well done!",
            "how did you do it?",
            "I want to be in TX working in this industry. Hopefully my experience will mirror yours one day. $85k in TX with a wife that also works will be AMAZING for me. Congrats!",
            "HOWWWW???  \nBetter networking?  \nwe all wanna know!!",
            "Salute to you. 85K out of college is a pipe dream for me",
            "CONGRATULATIONS!!! LEZ GOOO",
            "no leetcode omegalul",
            "That’s great. Do you mind sharing the resume you used to get hired? Also is it a local place? I’m also in Texas. Good job though!",
            "My man! Congratz. You don't need 6 figures for your first job. That's also nice, plus your focus should be now studying and learning.",
            "Congratulations mate 🎉🍾",
            "When did you graduate",
            "get me a referral please.",
            "You dropped this king^(or queen) 👑",
            "Congrats! Good to see good news here once in a while",
            "Give me referral🤣🤣🤣🤣🤣🤣",
            "Nice, hope my CS degree pays when I graduate soon in March 2024",
            "I would blow someone for such money in my first IT job. It was 14 years ago and i got 9k a year back then first year. My country dont pay much and i was an intern. When internship ended after a year i got 13k $ lol.",
            "In Texas. Just started this year as a retread (psych path was worthless). This gives me hope!!",
            "They didnt ask you Leetcode style questions?",
            "Congrats! It’s only the start of a journey ur going to do great things!",
            "Congrats! Similar boat; this gives me hope. Best of luck in the future",
            "Congratulations OP! So happy for you!",
            "Can you give advice on how to tailor the resume as a fresh grad without projects? Oh light the way, our beacon pls",
            "My friend got 6 fig after bootcamp",
            "85k? That's a pretty low offer. I would suggest renegotiating for a better offer or find a real job.",
            "lets go !(Jake)",
            "Congrats👏🏻👏🏻",
            "Congratulations! 🎉",
            "Congrats man",
            "YEAHHHHH BOY CONGRATS",
            "Congratulations, this is a huge achievement and you should be proud of this!",
            "which company did you intern at?",
            "W",
            "What school if you don’t mind answering",
            "🥳..",
            "💪🏿💪🏿",
            "Yess",
            "What school in Texas man? I go to TTU 😎",
            "Grats!",
            "What helped you get the offer OP? Any tips? Congratulations 🎉",
            "The fact you had an internship without any projects blows my mind.",
            "Nice, just starting uni hope I can post the same thing in 4 years",
            " What stack?",
            "Nice",
            "The guy f***in with luck!!!",
            "Could you please share your resume in general? It doesn’t need to be detailed. If not, it doesn’t matter. I am a graduate student studying at Northeastern University. I am now looking for an internship. I submitted my resume but there is no response.",
            "Dude that's amazing seriously congrats!",
            "FIREEEEEE",
            "Congrats homie!",
            "congratulation bro",
            "Congratulations! Wishing you a successful time and for it to be a fruitful stepping stone",
            "Which role will you have or tech stack you are going to use?",
            "85 is great",
            "congrats dude. Mind sharing the interview exp?",
            "Congrats! Plus it’s all about trajectory anyway 85k at this age means you’ll be passing 100k by your next role.",
            "Hey congrats, a job is a job!!! You can always climb the rank and get more money",
            "Where? And how!!!",
            "Huge W mate. Real proud 💪. Make the most of it!",
            "you got that dawg in you :)",
            "congrats <3",
            "Lol it is too good to be true",
            "Not bad at all. Give it three years and you’ll double it.",
            "How did you find this position? LinkedIn or in-person connections or? And is it remote?",
            "Congratulations!",
            "How? I am also trying. Applying at various platforms for the position of SW Eng and Data Eng. But no luck until.\nI don't mind the salary range. I can even work for less than 60k, I just need a nice job.\nCurrently I am in my last semester of Masters course in software engineering.",
            "Mind if I see your resume for some pointers??",
            "It sounds like you did the bare minimum and landed a decent job. Congrats!",
            "When I saw this message in my inbox, I thought it would be about job search problems. And I was right.",
            "Any tips on getting that 1st internship? I'm a sophomore who is also at a state school.",
            "Sounds like a defense company",
            "Never touched leetcode nor has any of my coworkers. Also only been at two jobs my entire career (10 years) and currently making 180k. \n\nBeing a good fit/team mate, good communication, hard working, and politics is what’s going to have you seeing an increase in pay every year.",
            "Dude let’s gooooooo. Congrats. 80k ain’t a slouch at all. I’d kill for that haha",
            "Congrats! How did you get that job?",
            "Guyz, I need help finding an internship, I went to the career fair but haven’t heard back from amy of the employers(applied to all of them) except for verizon, where they reached back saying that they are currently reviewing my application.\nGot any tips, suggestions or general ideas?\nPs - imma sophomore",
            "How did you get your Internship, in the process of applying to everything but no luck",
            "how did you get the internship without doing any leetcode?",
            "Congrats!!!!!!!\nAny tips you can give younglings to achieve the same thing?\nThanks bro and good luck!!",
            "congratulations!!!!",
            "Congratulations! I hope the job goes well and you learn a lot from it.  \n\n&#x200B;\n\nWork hard and make sure you ask tons of questions and talk with the more senior folks at the company so you can learn from them.",
            "If you see this comment, give me tips I need the help.",
            "What do you mean no leetcode and no projects? I haven’t started college yet. Are these important things?",
            "Congratulations Buddy. :D\nIt would be really helpful to us if you share how did you got your internship, what work part was being carried out by you on your internship and now on job.",
            "Congrats I still don't have a cs job 3 years after graduation",
            "Lets goooooooooo, I would have been stoked with 85k out of school",
            "💯",
            "Which school btw?",
            "Okay, spill it, which magic spell did you use?",
            "you rocking boy 🔥",
            "gotta get a job to get a job. great start!",
            "Well done, I was at 95k beginning of this year w/ 5 YOE and as a tech-lead on a large DARPA project. I shortly went to 140k through a job change, but I know plenty of people who are still there with some YOE under their belt and under 100j comp."
        ]
    },
    {
        "post_id": "163sxxv",
        "author": "DavidBrent9999",
        "title": "I hate influencers :(",
        "url": "https://i.redd.it/5erc6a9c3wkb1.png",
        "score": 1891,
        "num_comments": 349,
        "created_utc": 1693245210.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/163sxxv/i_hate_influencers/",
        "comments": [
            "It’s all fake anyway.  I was typing in cybersecurity in YouTube looking for learning material, bad mistake.  It’s all fake cybersecurity professionals hogging the search results.  Had to look up individual tools to get away from it.",
            "She's just a few years late",
            "You do realize that at a certain point half the shit on this subreddit was pretty much this and it would make the front page every other week? This subreddit is also at fault not just influencers",
            "personally I choose not to feel insecure and competition towards people who went into CS because of a tiktok lol",
            "Even worse are the influencers saying all you need to make 6 figures is do my 6 week React bootcamp. No degree required.",
            "When people talk about GPA like this I get the feeling the feeling they’re the same type of people that just get the degree for the piece of paper. If you put genuine effort in understanding the course material I cant see how someone can have anything lower than a 3.0. Whats the point of going to school at that point?",
            "Bro cmon with this gate keeping nonesense. Don't pretend like 70% of the people here aren't here for the same reason. You heard CS paid a lot so you are doing it. And no it's not just the influencers fault. The industry pushes \"learn to code\" on everyone because it's in their best interests to get as many candidates as possible, no company wants to pay 200K for you to write 10 lines of code a day. They will sponsor people to promote courses, certificates, and overall want to promote an influx of CS grads. A lot of \"influencers\" are also recruiters. The influencers and people who create bootcamps are just the ones smart enough to sell the shovels during a gold rush rather than partake only in the rat race. People relying on an entire industry, that publishes its salaries publically, being kept a secret are the only ones who should be blamed for being that naive.",
            "Maybe this is a bit ignorant to say coming from a 3rd year cs student. But all these influencers are always new grads. Like wtf do they know about working in the industry? Sure more than me, but I feel like they've only had a taste of the real world yet they feel like they know everything.\n\nAre there any good CS influencers older than 25 that anyone is aware of and can recommend?",
            "This post is mostly true. I do hate influencers as well but from this post alone I think it’s just sharing information and I wish I got into CS sooner.",
            "its totally okay. Coding is not for everyone. 80% will give up if they are dumb or dont find passion in this anyway",
            "How is this relevant?",
            "Gee, do you think CS is some sort of big secret that only you are entitled to know about?",
            "I’m kind of regretting CS! I’m almost done with my Bachelors but I’m thinking of going to law school.",
            "unpopular opinion:\n\nWFH is overrated for me. U feel isolated and you feel like a discord mod just staying home majority of the day + you have motivation to work at home?",
            "This is only true If you get into a school with single digit acceptance rates and even then you have to obtain good internships.\n\nEdit: I worded this poorly.  I did not mean that if you don't go to a good school you aren't going to start out with a high salary.  I was trying to say that it is MORE LIKELY to be easy to get a six figure salary under the above conditions.\n\nThe people that land six figure jobs out of college in CS are in the minority in the vast majority of colleges across America.",
            "You also get to listen to low fi, make day in the life videos, wear matte colored clothing, sport a liberal attitude, pretend to be a geek, pretend to have nothing else to do aside from tech related things, have a shitty social life, and very little friends because every conversation is about how much better you are than other people because you’re a cs major.",
            "I would have never chosen this field if I had known what I was getting myself into. They fail to mention all the hours of projects, leetcode, and hunting for jobs like a full time job itself.\n\nI chose this field because of tiktokers myself lol",
            "we need to balance the scales. Any UPS drivers interested in creating a tiktok account?",
            "This is Oppenheimer-grade weaponized horseshit.",
            "Influencing is the best job. No degree required. No one will fact check you. You pull in tons of ad revenue and misguide a bunch of poor saps and get to wfh",
            "I mean yes it’s not that easy but if there’s one major than can make it as easy as it can to land a job after graduation, it’s CS. What other major is gonna be better than that?",
            "Stg you people only look for jobs in FAANG. Jobs are everywhere for devs",
            "Eh even before influencers, it was like this. During high school and undergrad (2015-2017), I talked to engineers  working at Amex and Intel who would say similar stuff (minus the WFH since that wasn’t that big back then).",
            "For people saying you shouldn’t be worried about them as competition because they’re on TikTok… it’s not just the ‘competition’, it’s also the awareness and levels of entry. Guess what happens when everyone has a bachelors, with no inquiry on GPA and people can do basic Leetcode? The bar raises. Eventually they WILL start requiring more.",
            "I can code a hello world react app. Pay me 300k/yr",
            "I'm a graphic design major. Now jobs expect us to know coding but for minimum wage.",
            "This is all true though lol\n\n✅ Computer science is the best major \n✅ A degree is sufficient qualifications\n✅ You can make 6 figures after graduating (after a couple jobs though, not the first one usually)\n✅ You can get WFH\n✅ You can do things you like",
            "Dude seriously, I am so tired of this. It's already competitive enough but we have blabber mouths trying to make a quick buck on social media adding unnecessary obstacles to the already broken hiring process.",
            "Idm, but those ppl will def suffer once they find out the reality",
            "CS is all fake.",
            "[deleted]",
            "[removed]",
            "I’m willing to bet douchebags corps are sponsoring these fucks so they can fool ppl to ovecrowd the market",
            "Exactly why i hate them",
            "christ imagine if social media and influencers didnt exist\n\npure fucking bliss",
            "Computer Science is fake I made bad mistake, drop shipping is better",
            "Looks like whopping 60 lines of code on the screen",
            "Idk. Isn’t gatekeeping worse?",
            "where’s the lie?? maybe not easily but it is realistically achievable.",
            "I routinely fire these people.\n\nManagement keeps hiring them because they frequently tick enough checkboxes to give HR a lady-boner for diversity.\n\nThank Elvis that we work in an industry where performance can be evaluated via the unit test. Incompetence can be punished via objective criteria, but I still have to work against the all-pervasive agenda of the twitter-gazing millennial douchebags that occupy the management offices.\n\nEDIT: That's right you drones, downvote me protecting the thin sliver of meritocracy that still exists in my department.",
            "Well... I guess they aren't in the weed out program that I am in 😂 ..you can't mess around and stay in the dept.",
            "This was all true back in 2017. I had friends who barely had 3.0 GPAs and were getting internships and full time offers from FAANG with little more than crack the code interview book.\n\nMost of them spent less than 40 hours per week on school.\n\nMeanwhile I was in chemical engineering busting my ass and there were zero jobs to be had anywhere.",
            "Fake. Have the job openings are now scams too. I recently got scammed because I was too eager to get a job.",
            "It worked out like that for me. I’m a 2020 grad, now working remotely as a software engineer with 3 years experience.",
            "My APM role had 2000 applicant fwiw",
            "cstok is wild bro, sometimes it highkey fuels my imposter syndrome. like wdym life is easy with CS😭😭",
            "I LOVE INFLUENCERS",
            "Is she a chameleon or what??? In the profile picture her skin is clearly white but the video shows otherwise",
            "Imagine making the main selling point of programming, everything other than programming\n\n\" Get to do the things you like \"",
            "I dunno if this is actually true but I’ve also met some people who, probably bc of this, are extremely gatekeepy on “having REAL PASSION!!!” and it’s kind of awkward and brings back r/A2C vibes",
            "A degree in CS will only get you as far as most cs majors can see - barely.",
            "[removed]",
            "I wonder why the entry level market is absolutely flooded",
            "If anything, AI is going to make programmers more efficient at their jobs rather than outright replacing them.  CS is definitely still one of the top majors for finding a good paying job out of college",
            "Posts like this make me hate CS influencers and all the morons who believe it and think it's the god major",
            "Maybe continued posts focusing on how rewarding cs SHOULD be will bring to light the disparities in the actual hiring practices. Where large American multinational companies pay premiums to visa workers and small American companies pay lowball wages to American workers.",
            "you can \"easily\" get 6 figures.\n\nBy the time you learn the skills you need for the job, there's already a new technology on the market lmao.",
            "This is true… except that most people are filtered by calc and disc math let alone leet code and other things. Don’t stress",
            "Someone forgot the 5 coding interviews for EVERY job application. On top of having an impeccable GitHub record or Stack overflow points.",
            "Everyone and their mothers getting a cs degree (including me 😂)",
            "I'd rather have influenza",
            "definitely not in india 💀",
            "I can’t even make 2 figures having a cs degree",
            "using lofi stream to act like you working code but really just typing nonsense in lofi chat lol",
            "It was like that up until covid. CS majors used to have the lowest unemployment rates in my country.",
            "True for me, but I am making 7 figures salary.",
            "So true",
            "yeah, it was like that until you influencers started making this shit and oversaturated the market",
            "Are they selling a course? Lmao. Also, you can \"easily\" make 6 figures? It all depends on where you live. Yes you will make 100k in SF or NYC, but those salaries are the equivalent of making 40-50k in the midwest.",
            "They make it seem so easy when in reality it’s extremely difficult and takes so much dedication",
            "Problem with influencers is that they oversimplify things and make it seem super easy. Buzzwords, scams, \"boot camps\", are easy to bait people in.  \n\n\nI don't want to discourage people from going into CS, I actually would encourage more people to do so, but its not a walk in the park by any means. It takes a lot of hard work and effort to be successful. In my experience, the math and higher level classes weed people out.",
            "Only makes a big group of people entering CS feel suicidal because they thought gpa didn’t matter but passing a class and remembering the content is a marathon in itself",
            "Sure you’ll be making 10 figures after graduating but in shit coins :)",
            "I don’t get it",
            "Keychron in the background?",
            "I mean, this is an honest story for a lot of people, myself included.",
            "No, stats is the best major",
            "I hate the ones LYING about their success or salary to get a band of losers that want to take to the easy way out. It took me 5 years before I broke into six figures. I have a masters degree and worked at the government as an engineer. I cannot stand the lying and the crappy boot camps",
            "If you’re in a gold rush sell shovels",
            "this happened for me. saw a video, changed my major, internship, landed a job before grad… it works"
        ]
    }
]