[
    {
        "post_id": "18tsjuu",
        "author": "Malaa2002",
        "title": "It gets easier",
        "url": "https://www.reddit.com/r/csMajors/comments/18tsjuu/it_gets_easier/",
        "score": 495,
        "num_comments": 27,
        "created_utc": 1703871323.0,
        "selftext": "So i did it. Got my first internship in nyc paying 45 per h. I applied to over 300 companies from January to November this year and only 3 interviews. Yea exactly 3. I was so down in the trenches in the beginning of the year that i couldn't even do binary search questions on leetcode. But i took it 1 step at a time. I did a problem a day on leetcode. Then 2 and 3. Then i did a problem on project euler a day. Then 2 and 3. I don't wanna ramble but if theres one thing id say is that quote from Bojack Horseman: it gets easier. Every day it gets a little easier. But you gotta do it every day, that's the hard part. But it does get easier.",
        "permalink": "/r/csMajors/comments/18tsjuu/it_gets_easier/",
        "comments": [
            "Congrats, good stuff",
            "The grind pays off",
            "That's great man, do you got to a top school and how many projects and what kind did you have under your belt?\n\nCongratulations and hope you do amazing on the internship",
            "What position? Was this your first internship overall or just “first internship in NYC”",
            "Did you put the number of leetcode problems you solved in your resume?",
            "How proficient would you say you are in LC now",
            "Bojack horseman is the best show",
            "So you are not graduated yet?",
            "Congratulations!!!",
            "Are you international? Do you require work visa?",
            "Could you share your resume? Did you go to a good school? Thanks, and congrats 👏 👏",
            "Congratulations!!!",
            "Amazing 🤩",
            "Grats dude",
            "What was ur resume?",
            "Brick by brick 🧱",
            "What year are you in?",
            "Congratulations",
            "In retrospect of your job, would you do euler again? \n\nWhat's it bringing to the table? why not more building whatever?",
            "Can a person go about learning programming logic in leetcode?",
            "Good job dude! You killed it!",
            "Grats and ty",
            "Holy damn, I was about to quote BoJack only for you to already have him quoted congrats ma dude.",
            "Bojack Horseman? Did you mean Hambone Fakenamington?",
            "Congratulations 🎉"
        ]
    },
    {
        "post_id": "17jdg8s",
        "author": "KathirHasBigGay",
        "title": "showering is unnecessary: an inductive proof",
        "url": "https://www.reddit.com/r/csMajors/comments/17jdg8s/showering_is_unnecessary_an_inductive_proof/",
        "score": 490,
        "num_comments": 23,
        "created_utc": 1698615761.0,
        "selftext": "P(1): I didn't shower today (I forgot). I smelled fine (it's just one day).\n\n(U(P(k)) for k < n) -> P(n): On a given day, I don't shower after not having showered for n - 1 days. I don't smell *that much worse* than before.\n\n\\-> I don't need to shower.\n\n\n\nedit: it’s satire you buffoons, of course the induction isn’t sound… or else this logic would actually hold. Stupid code monkeys 😭",
        "permalink": "/r/csMajors/comments/17jdg8s/showering_is_unnecessary_an_inductive_proof/",
        "comments": [
            "Inductive hypothesis does not hold",
            "Proof by induction you smell worse each day k you don’t shower: \n\nP(1): you smell ok\n\nP(2): you smell worse than p(1)\n\nP(3): you smell even worse than p(2)\n\nP(4): you smell worse than p(3) and people are starting to avoid you\n\nP(5): everyone avoids your smell, which is now worse than p(4). It has been almost a week of no showers.\n\nLet k=5\n\nThen p(k+1) will lead to a worse smell then p(k) for all k.\n\n**im bad at proofs, the math might be wrong the message isn’t",
            "Theorem: ∀n ∈ ℕ, ∀t > 0: P(n, t), where P(n, t) represents the necessity of personal hygiene, particularly showering, as a function of both the discrete time variable (t) and the quantified entity (n), which corresponds to an arbitrary human subject.\n\nBase Case (n = 1):** P(1, t) ≡ (∀t > 0: [SH(n=1, t) ∧ ¬ODO(n=1, t)]), where SH(n, t) denotes the act of showering and ODO(n, t) indicates the presence of undesirable odor at time t. Thus, for a single human subject, showering is obligatory to prevent undesirable odor at any moment t.\n\nInductive Hypothesis: Assume P(k, t) holds for an arbitrary n = k and any t.\n\nInductive Step: We aim to prove P(k + 1, t) for the next arbitrary n = k + 1 and any t.\n\n- By the inductive hypothesis, we have P(k, t), meaning (∀t > 0: [SH(k, t) ∧ ¬ODO(k, t)]) holds.\n- Failure to adhere to personal hygiene (¬SH(k, t)) at time t within this state of affairs would lead to the presence of undesirable odor (ODO(k, t)) at that time.\n- The presence of undesirable odor (ODO(k, t)) is antithetical to societal norms and human decency.\n- Therefore, the only logical conclusion is that, for an arbitrary n = k + 1 and any t, showering (SH(k + 1, t)) is a necessity to avoid the undesirable odor (¬ODO(k + 1, t)).\n\nBy induction, we have demonstrated that for any n and t, the act of showering (P(n, t)) remains a necessity to preserve human dignity and societal standards.",
            "Pls stop. Go shower",
            "There's a saying, \"When you're always around shit, it starts to smell normal.\"\n\nIt's why people who smoke cigarettes can't tell they smell like cigarettes.\n\nSo please people, I beg of you...shower every day.",
            "Bros gonna be smelling like the slums of Alabama",
            "I had to do a double take while scrolling lmao",
            "counter example: you always smelled you just never realised",
            "This guy literally plagiarised my algorithm and got all the updoots [1].\n\n[1] https://www.reddit.com/r/csMajors/s/mtuSg7IFtC",
            "Assuming every day you become a constant amount smellier, it can be proven that you may become arbitrarily smelly after a finite number of days.",
            "what did bro just call us?",
            "Most hygienic UChicago student",
            "I'm not sure which is worse\n\n\\- You're trying to justify not showering,  \n\\- You're using inductive reasoning to do it, or  \n\\- Your proof is wrong",
            "This is why you ****ers can't get laid.",
            "Fallcy of the beard",
            "This is what y'all do with your \"useful\" degrees?",
            "“I smelled fine” and “I don’t smell that much worse than before” are poorly defined."
        ]
    },
    {
        "post_id": "yp3nnx",
        "author": "urai19",
        "title": "Pain.",
        "url": "https://www.reddit.com/r/csMajors/comments/yp3nnx/pain/",
        "score": 489,
        "num_comments": 50,
        "created_utc": 1667861812.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/yp3nnx/pain/",
        "comments": [
            "best akatsuki member",
            "So vague, and yet I cannot agree more!",
            "most emotionally healthy cs major",
            "Those who do not understand pain can never understand true peace.",
            "Talk to me, who rejected you",
            "If you are a new grad searching for a job like me... well, in this case I feel you. I'm with you bro.\n\nThey told me for 5 years: \"you will have to choose between tons of high paid jobs.\" And now I'm here asking myself \"wtf?\". \n\nI think the whole field is just hyped by some tiktokers and now we're going back to reality.",
            "fax",
            "Pain++",
            "mood",
            "Calculus 2",
            "Same here",
            "And suffering.",
            "relatable",
            "us moment",
            "Now that's what I call art.",
            "Max",
            "Real",
            "Failed NNN",
            "God is punishing me",
            "Quel pain? Baguette? Croissant? Banh mi???",
            "Why are we still here? Just to suffer?",
            "Genuine question: is nobody willing to take a non big-tech job in LCOL area? Just as a first job? Like insurance, energy, defense, etc… as a stepping stone? \n\nI mean, as I’m reading these posts, I feel like maybe I just lucked out in my case. Not going to be making $300,000 when I graduate, no FAANG prestige, but it’s all remote and I’m going to be starting just at six-figures when you factor the yearly bonus. Great bennies, retirement, WLB…And it’s only my first job out the gate. I’m not doing anything groundbreaking at work but I code every day. It’s pretty mundane actually. Automating business stuff. But the interview was minimally technical. No LC questions. Just silly HR type questions and discussion of my resume projects. Am I just one lucky asshole? Or is everyone posting just a tad hyper-focused on FAANG/big-N?\n\nNo hate fr, I’m out here applying to higher paying stuff and getting rejected too. Solidarity. But maybe just get an easy job in the pocket for now to ease the pain of rejection while you get more xp. Forego the dream job for a few years while you buff up the résumé.\n\nIn any case, best of luck to you all. I hope you all get your dream job someday!",
            "Pain",
            "It’ll get easier, i promise",
            "Bro failed NNN",
            "I understand.",
            "This is exactly how I felt after failing the Amazon OA at the same time you posted this, maybe next year…",
            "Yes",
            "Trust I felt but we move regardless",
            "exactly",
            "I love that 3 days grace song"
        ]
    },
    {
        "post_id": "l9r2zf",
        "author": "antenarock",
        "title": "Rename the sub to “The Amazon interview”",
        "url": "https://www.reddit.com/r/csMajors/comments/l9r2zf/rename_the_sub_to_the_amazon_interview/",
        "score": 484,
        "num_comments": 81,
        "created_utc": 1612141954.0,
        "selftext": "Why people in this sub are  so obsessed about Amazon anyway?",
        "permalink": "/r/csMajors/comments/l9r2zf/rename_the_sub_to_the_amazon_interview/",
        "comments": [
            "It’s just that people want to work for Big N, and Amazon hires the most people by far",
            "Amazon hires a ton of interns, therefore, there are a ton of posts about them.",
            "How many days after OA3 do you hear back for final interview???? It has been 0.42069 min after the final interview when can I get a response???? Am I ghosted if I havent heard back for more than 2 days??????? What does moved to another location mean on Amazon's candidate portal website??????? Am I safe if I have application submitted as a part of my application process???? Has anyone got rejected after giving perfect OA1 7/7 OA2 2/2 and the most beautifully optimized solution???????? No response after 2 months... when should I expect a final interview?",
            "They're going through a hiring surge while other company's are probably taking less with covid.",
            "Amazon is by far the largest tech company of all the big names. On LinkedIn Google has 66,102 engineers, Facebook has 28,418, and Amazon has 102,354 and is growing faster than any of them",
            "Maybe it's time for a sister sub.",
            "When can you start applying for Amazon for Fall?",
            "Amazon has an easier application process than most non-faangs, pays well and they are a massive company so they are hiring a shit ton of people. It does get annoying when people keep asking the same questions about the process when it’s been answered many times",
            "amazon is hiring a ton of people and hasn’t slowed down during covid",
            "Not only does Amazon hire a shit ton of interns and new grads, their interview process is very optimizable and predictable. All OAs and just one video interview.",
            "Lmao so many toxic comments here",
            "there should be a FAANG subreddit for real.\n\nIt’ll help divert these types of questions there and make info about faang more concentrated and accessible. But it’ll be another Team Blind.",
            "True!! How come I've never read a Tesla interview post? Or of some startup?",
            "Why do people keep questions like \"How many people who interviewed between 1/25 12:15 PM and 12/27 4:45:234234 PM got responses back?\" As if that's going to impact their application",
            "$$$",
            "When should we apply for amazon new grad position if we are graduating in December 2021?",
            "[deleted]",
            "[deleted]",
            "They hire in bulk and you get the FAANG tag for no reason.",
            "[deleted]",
            "[deleted]"
        ]
    },
    {
        "post_id": "18ar6to",
        "author": "Dazzling-Rooster2103",
        "title": "I did it! Got a Full Time new grad offer letter.",
        "url": "https://www.reddit.com/r/csMajors/comments/18ar6to/i_did_it_got_a_full_time_new_grad_offer_letter/",
        "score": 484,
        "num_comments": 52,
        "created_utc": 1701715988.0,
        "selftext": "I fucking did it! $70k/year, LCOL area, pretty big company! Fully remote, full insurances... I know it's not $100k, it's not a FAANG company, but its a great place to start out at.\n\nAlso I put in around 300 applications, got 1 interview, and then got the offer. I go to a school not even in the T400, I have 1 internship at a no name company.",
        "permalink": "/r/csMajors/comments/18ar6to/i_did_it_got_a_full_time_new_grad_offer_letter/",
        "comments": [
            "[deleted]",
            "Congratulations. Not everyone can get 6 fig at a FAANG or whatever, be happy with what you got, it is a large success! $70k is a lot of money still, and with a big name you can move around in the future to something better later. A good job is better than no job!",
            "ay bro, you’re already living my graduation dream, live it up!!",
            "Congratulations, 70k is an awesome starting salary for a new grad, with experience will come bigger and better opportunities if that is something you are worried about, I’d love to ask you some questions in private if and when you get the chance",
            "Congrats! Is it a tech company? I want exactly the type of job you got. Did you have any projects on your resume? I don't have any yet but have a small internship.",
            "That's awesome man . Me next universe lol",
            "I’ll take 70k remote job anyday",
            "70k in LCOL will take you really far. I’d rather take that instead of 100k in HCOL (or even 120k).",
            "You can bank 70k in LCOL. \n\nI am at 95k in MCOL and put away 50k a year towards retirement with not much effort.",
            "Congrats!! Most people who are obsessed with TC will be very unemployed and upset for a while. $70k is great and nothing to scoff at, especially in a LCOL. Enjoy the rest of your senior year OP",
            "WOOOO!!!\n\nCONGRATS :D",
            "Congratulations!! I don’t know you, but I’m proud of you and happy for you. Keep going up!! 🥳",
            "Congrats! Good thing it’s a remote job so you don’t have to work next to haters like some people in these comments. $70k is an awesome start. I’m sure $100k will be there for you in a year or 2.",
            "$70k in LCOL full remote is amazing. Most new grads who have 6-figure jobs are at HCOL cities so you’ll end up with quite similar quality of life.",
            "Did you have some technical challenge?",
            "Congrats! Are you international",
            "Grats 🙌🙌🙌🙌🙌",
            " Congrats ! don't worry about your 1st job and pay. You can get to better pay and better job eventually. Everyone's path is going to be different.",
            "did the damn thing congrats.",
            "That is honestly my dream job. May I ask what level of leetcode you needed for the interview?",
            "Good shit",
            "Congrats. Time to celebrate!",
            "Congrats!!!",
            "Congrats man!",
            "Congrats!!!",
            "Congrats !!",
            "let’s fkn go!!! huge congratulations(-:",
            "That’s great! And remote is worth so much too, I hope it goes well for you",
            "that’s awesome 🤩",
            "which uni did you go to?",
            "Way to kick ass. Well done.",
            "$70k in LCOL is a great start. Play your cards right and you’ll be over that six figure mark in a few years at most.",
            "Congrats & well done!!",
            "Congratulations! Did you cold apply on the companies website? Or did you reach out to a recruiter? Or apply on indeed or LinkedIn? Any advice? I had a new grad offer too for 60k fully remote but I’m looking for a new job now"
        ]
    },
    {
        "post_id": "1ccl9er",
        "author": "codefreak-123",
        "title": "No Job as a May 2024 CS graduate. So stressed. ",
        "url": "https://www.reddit.com/r/csMajors/comments/1ccl9er/no_job_as_a_may_2024_cs_graduate_so_stressed/",
        "score": 487,
        "num_comments": 200,
        "created_utc": 1714027515.0,
        "selftext": "Hey everyone!\n\nI am applying to 100+ jobs everyday and have got ZERO response. I am currently a project manager at a small agency paying me minimum wage but even that’s a blessing rn. I don’t know what to do. I am so stressed and graduation doesn’t feel like an accomplishment 😔 is anyone in the same situation!!!???",
        "permalink": "/r/csMajors/comments/1ccl9er/no_job_as_a_may_2024_cs_graduate_so_stressed/",
        "comments": [
            "Applied around 1400 applications globally. Got one offer which is return offer. Keep grinding my friend",
            "Have any of your classmates found jobs? Have they taken a different approach?",
            "No job as may 2023 grad lol",
            "Might be an unpopular opinion for this sub but I think it’s pretty normal to not have a full time job lined up until after you’ve graduated. I had an internship that lasted a few months past my graduation date and then I was unemployed for 3 months until they found a position for me. ~aug-nov last year I was unemployed while there were no positions open.",
            "Hang in there! I'm a '23 grad and I'm still applying. Do some freelancing, read up on new languages (or brush up old ones), expand your horizons. Make tons of side projects!",
            "100+ jobs a day is concerning. You can’t really cater your resume to each job posting with numbers like this. Try doing 5 a day, and change your resume to align with the job descriptions",
            "Get ready to learn defense industry, buddy",
            "Lol yeah in the same boat. Applying as an international student sucks lol.",
            "Sounds like your strategy of dumping an unsuccessful resume isn’t working out. Try using the same resume a few hundred more times and don’t even bother addressing the job listing when applying. Cover letters? Fuck em. Haven’t done one yet, don’t even try doing something different. Why would someone want a synopsis of your background when they could just throw out your resume because it looks the exact same as every other grad with no experience and some YouTube tutorial projects?\n\nCmon guys, this isn’t McDonald’s jobs we’re going for. You don’t just fill out an app. You have to try to win the job, you’re competing against people who actually put time and effort into their application. Youre competing against people who find the company’s keywords and pepper them into a resume specifically for that company. You find the core values and the mission statement and talk about them in a cover letter and your resume objective/summary. You look at the technologies used and redo your experience to talk about the stuff relevant to the company’s technologies - you don’t keep your bullet points the same when applying to different jobs.\n\nGet your numbers down to 5 applications a day and actually apply rather than dumping some more trash on the recruiters desk! It’s easy to tell a resume that didn’t read the job description",
            "Same. But I got a few interviews at startups. Try that for now.\n\nYou",
            "Which university do you go to?",
            "Better than May 2024 CS dropout. \n\nCongratulations!",
            "If you’d like to work on an e-commerce marketplace DM me. I’m hiring.",
            "Just wanted to say thanks so far guys. It has been a stressful experience but you guys are making it better",
            "I’m right there with you man. It’s a little hard to feel positive about graduating.",
            "Go for an internship. In this economy, money is tight and companies ARE not willing to train new graduates as of now for a \"regular\" position. It will get better.",
            "Are you tailoring your resume?? Feel like that's one of the most important things with the market being so bad.",
            "If you wanna DM me I can help you with your resume and other options. I applied to like 200ish companies and got one bite, and managed to pass all rounds.",
            "Try applying to smaller companies e.g startups. Have to say I got a pretty good callback rate doing that.",
            "If people on here are US citizens get into cybersecurity. Thats an in demand skill.",
            "I spent 4 months after graduation full time applying to jobs. I was applying to every position I relatively qualified for (SWE, embedded, web, QA, test) and got a few OAs and no interviews. After 4 months of “failure” to find a position I reached out to my former employer that I did a 16 month internship with and without an interview got a full time offer. \n\nI’m super grateful to have any offer but man it’s a bit of a kick in the dick trying so hard for these other jobs, hearing nothing and getting a return offer without having to verbally speak to anyone. \n\nThe game is who you know and not what you know…",
            "If you manage to apply for 100/day the quality of each entry is probably mediocre. Employers don’t enjoy when you just copy paste stuff.",
            "here’s one up, No job as a Dec 2023 graduate",
            "I graduate in 3 days with nothing lined up yet!",
            "Graduated then with a Masters and novel AI research under an NSF grant. Took me 6k applications with probably 1k custom cover letters to get 4 interviews, 3 offers, and a decently well paying SWE job near the end of August after having to move back in w/ parents. Job in app development not AI, but hopefully there's the chance to go back into it in the future. Job market sucks rn but it'll get better when all this AI written code needs to be fixed and the dumbass MBAs lose their jobs for the failure their choices will turn out to be.",
            "in the same boat.. 💀we are so doomed",
            "Hey you aren’t alone, I’ve submitted over 900 applications since August 2023 and still no full time offer. I’ve interned at Microsoft, Meta, Amazon, Adobe, PwC, and currently ServiceNow. My internship ends mid June then after that I’m stuck as I graduated undergrad this past December. I’ve been networking like crazy but literally nothing is falling. Lots of recruiters ghost and the ones that do get back it’s a dead end.",
            "Sounds like you are submitting way too many applications to me",
            "Applying blindly online will not get you a job without a resume that’s too good to be true. Network. Meet people. Get referrals. Pretty much the only way to get an interview now.",
            "July 2023 Grad.\n\nApplied 1000+ Job.\n25+ interviews \nStill no offer. Getting ghosted or rejected after final round which happened in past 10 interviews.\n\nIts been 8 months unemployed. Still trying my best. Applying DA, DS, DE role \n\nHave around 3 yrs of experience. Hoping for best and giving my best.",
            "Keep grinding and network network network. Get friends who got jobs to get you in. It’s all about who you know",
            "Why do y’all think sending out hundreds of applications is an effective tactic? If you aren’t at least getting phone interviews then your resume sucks.",
            "Tech is out.\nIndia is in",
            "I still don’t have a job yet, but I was able to get a co op offers, you may want to look into that.",
            "How tf do you apply to 100 jobs a DAY?",
            "Took me 6 months to find something after graduating just gotta keep trying. Startups are usually good as long as they aren’t run by bosses who think they can hire someone for cheap just because of that. You wanna find something that’s already semi well established not something that’s just finding its feet or one of these top tech companies that get over 500+ applications a day otherwise they will have crazy expectations of you I made that mistake already lol.",
            "You gotta apply to 1000s.",
            "Are you applying remote or hybrid or in office? Can you share your resume (anonymized)? It might be a resume problem",
            "Like, federal minimum or state minimum?",
            "Oppp opp may graduate to Brodie. I’m about 15 apps deep.",
            "May I ask that are you currently in the US market?",
            "Same, it’s brutal out here. My resume is way better in terms of internship experience and projects compared to earlier in college yet I’m getting way less of a response rate than back then 😭",
            "Graduated in December. Networked my ass off, but was able to find something in March and got an offer. It can get really disheartening, but I would definitely recommend broadening your search just in case. I started looking for temp work and other types of office jobs at a certain point. Don't give up though.",
            "You and every other 2023 grad. Don't worry, it's not the end of the world, just hold tight",
            "Since you’re a Project Manager you might as well get your PMP",
            "They want hire guys with work experience, if we want to be hired we must have work experience. But we don't have work experience, how can we get hired? 🤔 interesting",
            "Are you international student ? Which university did you study from ?",
            "Yeah, I think these days you should get an internal referral to get to interviews, pretty difficult to get to the interview phase without that",
            "How are you guys submitting 100+ every day??? I feel like this is the issue. Youre spam applying and not tailoring your application/resume and it gets thrown out by the filtering system most likely. There was a guy who did hiring for his company on a post last week and he said if he sees zero effort in tailoring your resume, and spamming he ignores it",
            "We should work on a project together, let’s collaborate and build something that will look good on our resume, could be worth a shot",
            "Applying to jobs right now feels like shooting in the dark especially if you are an international student.",
            "These may feel like empty words since they felt like them to me when I was in your shoes. Right now the market is terrible so it’s hard to get new grad offers. Your degree isn’t a waste no matter what you see online. My advice would be to fix your resume( I assume you already have gone through this 100x), and start building something actually useful in the meantime while applying to places. Don’t lose in touch with your coding skills. Try to learn something off of Udemy or something and start building a full application you can show. You’ll learn a lot and eventually you’ll get an interview and if you can build a whole app from scratch your leagues ahead most new grads who can do basic stuff they did in classes only. Government sector is doing a lot of hiring so try to look into government contracting and reach out to recruiters on LinkedIn. Spam the shit out of them and eventually one will hit you back up.",
            "System churning out grads like hotcakes . May 2023, Dec 2023, May 2024 lol 😆 but jobs want 2014-2017 grads.",
            "Get certifications and make connections. Go to conferences. I’ve gotten 2 offers since January but been on quite a few interviews.  Build projects, help people with websites and management work. Do whatever you can to pad your resume. Keep grinding. Stand out with cover letters. It’s a full time job landing a full time job.",
            "I'm in the same situation rn. Plus I'm an international student, so people can take advantage of me more easily. \nIf you are working for a startup, I would say do a large scale project with them and once it is done, use it to boost your resume and apply to new places. That is what I am doing rn. \nI'm a may 2023 grad btw.",
            "shouldve gone to the career fair today lol",
            "Guys give me some hope. Planning to graduate in August.",
            "Took me 8 months after i graduate in 2022. Good luck bruh",
            "Stay strong, my senior is struggling while having 1 bachelor's and 2 masters(one from a tier 2 college in India and second from LA Uni) degrees in IT/Comp Sci, I don't know how it's working in US but hope things get better.",
            "I’m struggling for the next job even though instead of going to college I just went straight into the industry and worked for big tech (though would’ve graduated around now if not). I was recently affected by mass layoffs, it’s surprisingly tougher than expected even with prior experience and I can’t imagine how it must be for people who are straight out of college right now",
            "Networking",
            "Do a graduate degree",
            "Is there a rush for you to start working?",
            "It's over for you"
        ]
    },
    {
        "post_id": "199thp6",
        "author": "MarkZuccsForeskin",
        "title": "FROM WENDYS DUMPSTER TO WENDYS DRIVE-THRU HELLL YEAAAAHHHHH",
        "url": "https://i.redd.it/dnm22opv08dc1.png",
        "score": 487,
        "num_comments": 42,
        "created_utc": 1705593819.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/199thp6/from_wendys_dumpster_to_wendys_drivethru_helll/",
        "comments": [
            "Great man, more power to you.",
            "immaculate interview skills",
            "This  encompasses my search from May '23 up to now. I'm still applying just for fall'24  internships.\n\nI accepted an offer  for a fall '23 internship last year and completed it (Couldn't get  extended to spring unfortunately due to headcount) and also got a second  offer around the same time for Summer '24 at a large asset  management/investment company.\n\nI  pretty much stopped applying sept-december (literally the worst time)  and resumed in December after my internship ended, mainly for spring 24  or fall 24 roles. Some summer '24 if the job position looked really  interesting\n\nI failed many OAs just  because I was not on top of leetcoding, if I had done more of this i  probably could have passed more OA screens. Literally blew my chances  with Adobe, Netflix, TikTok, and Roblox because of this.\n\n* public state university student\n* gpa is in the gutter (though thankfully the ones who extended offers didn't ask)\n* I  had one OK project on my resume, and during one technical interview the  hiring manager actually wanted me to pull up my code and show him how  it worked, it was really nice because I actually gave a shit about this  project so I had plenty to talk about\n* 12 leetcode solved (lol)",
            "i’m still on fries 😅 good job with the promotion",
            "For some reason I thought you just got moved to the drive thru window, congrats!!",
            "🚀🚀🚀",
            "**How do you make this, through Google sheets?**",
            "you ACCEPTED 2 Offers?",
            "Were any of the interviews technical?",
            "What’s ur gpa ? And how many side projects do you have ?",
            "What app is this ? I see multiple subreddits using it",
            "Probably better to clarify that these are internships and not jobs.",
            "Can anyone suggest how I can get a part time remote job ?\nI grind 300 leetcode questions 🫨.\n(Out of Us)",
            "hey what app did you use to make this graphic",
            "🫡🫡",
            "Any chance you can share your Anon resume? i feel like i share a lot of similarities with you, no offers yet still :(",
            "Congrat bro"
        ]
    },
    {
        "post_id": "180u4gf",
        "author": "NoCondition7556",
        "title": "Im beyond tears (happy)",
        "url": "https://www.reddit.com/r/csMajors/comments/180u4gf/im_beyond_tears_happy/",
        "score": 491,
        "num_comments": 92,
        "created_utc": 1700607427.0,
        "selftext": "I got a position at McDonalds for their software engineering role at chicago! I’m beyond happy I can’t wait for the summer. I need tips on how to renege another offer I had, I want to renege since this one pays more, is at a better location and is a much more better opportunity. Help me please",
        "permalink": "/r/csMajors/comments/180u4gf/im_beyond_tears_happy/",
        "comments": [
            "Congrats!! I used to work at McDonald’s too. Pay was only $13 an hour tho and they had me in the kitchen flipping patties (I thought I would learn a new tech stack)",
            "Congratulations . Can you fix the ice cream machine software now.",
            "Congrats dude",
            ">I got a position at McDonald's\n\nThey had us in the first half not gonna lie. Hahahaha",
            "Congrats!!!! As a upcoming new grad I’m shaking in my boots but these happy updates bring me a little peace that things will work out 🥲",
            "You almost got me there at the first half. Enjoy your happy meal.",
            "Wooo!\n\nDon’t procrastinate. Schedule a call with your point of contact and tell them you have chosen to pursue other opportunities. Apologize for any inconveniences you may have caused, and thank them for their interest in bringing you aboard.",
            "CONGRATS! All the SWE people I talked to at McDonalds were so cool and nice! So excited for you! Can’t give too much advice on the renege, but do it asap and be apologetic/grateful. Tell them you’re grateful for the opportunity and sorry for the inconvenience but you’ve decided to pursue another offer than aligns more with your career goals 👍",
            "All that schooling and hard work and you still ended up working at McDonald’s 😂 jk good job!",
            "What's the pay range , only if u are comfortable sharing?",
            "Awesome! When people at parties ask what you do, you get to say you work at McDonalds. 😁",
            "Congrats!!!!",
            "congraaats 💕💕🎉",
            "Nice!",
            "congratulations 🫡",
            "Congrats!!",
            "Hey that's great congrats!!! I don't have any tips on reneging as I need to do so myself, but good luck!",
            "That's great, congratulations 🎉",
            "Now when someone’s asks where you work you can say McDonald’s and troll them for a bit",
            "Congrats here I am thinking I might be working for McDonalds as cashier since I can't seem to get anything 😭",
            "Congrats!!!",
            "Congrats!!!",
            "Wait they have those jobs in chicago?",
            "Congratulations! Honestly, I’d probably retire at McDs as a dev. Good work!",
            "I would keep both offers tbh, looking at the market situation",
            "YOOOOOOOOOOOOOOOOOOOOO PLZ HIRE ME",
            "TC or GFTO",
            "Congrats!",
            "Was there a technical assessment/ leet code like questions? Congrats!",
            "did you went to a top tier school or mid tier school? Just curious! Also congratulations!",
            "CONGRATSSS!! I’ll be in chicago for swe over the summer too, I’m so excited and pretty nervous",
            "What's the TC for Chicago? Congrats man. Free big macs for life 💪",
            "please fix the app",
            "What’s the perks like for interns (discounted/free McDs?) Their McD in Chicago is nice",
            "Congrats! Is it an internship or new grad?"
        ]
    },
    {
        "post_id": "1aqr1k0",
        "author": "ElementalPistachio",
        "title": "The Duality of Man",
        "url": "https://i.redd.it/z9ulmmckvkic1.jpeg",
        "score": 489,
        "num_comments": 16,
        "created_utc": 1707928250.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1aqr1k0/the_duality_of_man/",
        "comments": [
            "Inside every CS student there are 2 wolves",
            "I'm giving up",
            "Hahahaha so good 😀😀",
            "Whoever is in the quit side is a loser. Stay broke",
            "You're trash if you can't get a job with a CS degree lol",
            "Lol facts",
            "🤣🤣"
        ]
    },
    {
        "post_id": "vxt8vt",
        "author": "throwington10957",
        "title": "My dad keeps texting me screenshots of news articles with stuff like “Google CEO says company will slow hiring” and “peloton laid of 500 employees” in efforts to convince me to go to Med school instead, what is the best response to this?",
        "url": "https://www.reddit.com/r/csMajors/comments/vxt8vt/my_dad_keeps_texting_me_screenshots_of_news/",
        "score": 483,
        "num_comments": 393,
        "created_utc": 1657682428.0,
        "selftext": "My dad, while supportive of my education, really wants me to go to medical school instead, citing that it has more prestige, but more importantly has greater job security and is recession proof, and I won’t be “playing on a computer all day”. At first I figured whatever, but it’s been months. What is the best way to respond this?",
        "permalink": "/r/csMajors/comments/vxt8vt/my_dad_keeps_texting_me_screenshots_of_news/",
        "comments": [
            "Every friend or family member who's in the medical profession or aiming to enter it keeps telling me they're \"guaranteed to have a job\" in the next 10-15 years. But I'm also \"guaranteed\" to have a job in the next 3 years when I graduate? \n\nMy roommate and I did a rough calculation where I graduate with a CS degree earning 90k as a rough estimate. By the time he's graduated med school/residency (10 years assuming no specialization) I will be earning (hopefully) upwards of 150-200. I will also have (hopefully) saved a good chunk of my income in Roth/investment accounts, and I'll have enjoyed my life leading up to that point. All that is to say, medicine is for those who truly give a damn about it. Don't do it for the money, because it's really not worth it",
            "Tell him that you love him but you prefer CS to med.",
            "Imagine this. By the time you become a doctor. You’ll be ~32 years old 500k in debt, stressed out of your mind. Finally in your early 30s you can start your life/family. While software engineers will have been working 10 years no debt. By that time at age 30 you will be senior level making 150k+,  if you’re lucky or in FAANG which is easier to get into than becoming a doctor you will be making 300k+ no debt and with 10 years of savings. You can spend your whole 20s living life etc. And with stock potential work life balance and literally not having to work in a shitty hospital with horrible rude patients it’s not worth it. Show your parent salaries and tell him what your life and finances will be like at 30 yrs old. Also FAANG SWE internships pay more than residency.",
            "I was thinking about sending him a screenshot of physician suicide rates and saying something about how at least I’ll have a lower chance of killing myself",
            "I work at Google, the company that is slowing down hiring. My position is also recession proof, I have great job security, and I see playing at a computer all day as a plus. It's also been a much less stressful job to have during a pandemic.\n\nIt's worth noting that Google also never even fired their kitchen or driving staff during the pandemic. They basically got paid to stay at home and do whatever for a year and a half.",
            "What prestige though?\n\nIs your dad sleeping on the fact that many doctors & medical professionals were worked to the bone across the globe during the early years of pandemic while being understaffed with no days off, to the point some couldn't take it and took their own lives?\n\nAnd what did they get for all those selfless sacrifices? Some claps from apartment complex every 7pm for being \"essential workers\" and not-so-much wages.",
            "Med student here. DO NOT go to med school if your heart isn’t absolutely set on being a doctor. It is literal hell on Earth. Medicine is already a hard subject, but what I’ve seen is that schools try to make the learning process way harder than it needs to be because they have to maintain a stat distribution. Every doctor I’ve asked basically said while they loved being a doctor, med school pretty much gave them PTSD. It’s a four year long hazing process and admins do things simply because they have power over the students. Not to mention the whole application process to get into med school is extremely competitive, time consuming and expensive, along with the med school debt.",
            "I was thinking about medicine because I love biology and physiology. However, after reading many posts in some subreddits, I realize that I cannot deal with the stress. \n\nMany healthcare employees are now getting another degree in CS, IT, or any IT certificate so they can work remotely, pay off their student debts, don't have to deal with rude patients, rude colleagues, required overtime, overwork, no weekend, night shift, etc.",
            "hes delusional lol",
            "Listen up, OP:\n\nI had my heart set on law school. I was a straight A student and loved studying English and American and British literature. \n\nI told my parents I was applying to one school: William and Mary and that I wanted to go to their law school. \n\nA week later, my Dad has one of his sit-down conversations with me and tells me, I don’t think you’ll make it as a lawyer. I don’t think you have what it takes. \n\nI was destroyed inside. I quit school for a year. I went on to transfer to a different school, finished my BA in English, went on and finished my MA and Ph.D, and now, I’m an English professor in NC. \n\nI love my job, but I tell you this: be very careful. A parent can destroy your plans, hopes, and dreams. Take what they say with due consideration and caution.\n\nP.S.: I’m enrolled part-time at my univ., pursuing their accelerated B.S.-M.S. comp sci degree. I’ve always had a deep passion for computers and computer architecture.",
            "A cs degree is international, medical is not.  I got my bachelors in Canada and I’m currently living in Finland and working remote for a company based in Denmark and Turkey.  I can get a job in any technologically advanced country on the planet… if there’s a recession on one part of the world, I can move.  If there’s a slowdown in my current field, I can easily change to another.\n\nYou can’t do that with a medical degree.",
            "recession proof? lol\n\nsend him back screenshots of news articles about how doctors are basically unable to earn a living anymore, have to work insane hours, how the typical doctor doesn't earn a full-time salary until 10 years after the typical college graduate starts making money, how many physicians are not actually wealthy, how Doctor salaries look attractive, but it takes a lot to get there —and stay there articles like\n\n[$1 million mistake: Becoming a doctor](https://www.cbsnews.com/news/1-million-mistake-becoming-a-doctor/)",
            "[deleted]",
            "a lot of people are mentioning salary here but I’m not sure if that’s the best metric to go off of. Sure, you are able to save a lot more in those years of schooling / residency but I’ve seen friends finish residency and make 600k starting, which is much higher than any entry level cs job. \n\nIn the end, it really comes down to personal satisfaction. Will you enjoy medical school? Will you enjoy being a doctor for the rest of your life? Are you willing to sacrifice your 20s? Life satisfaction > money if you don’t want to burnout !!",
            "[deleted]",
            "Until an AI MD can diagnose and prescribe medication.  Nothing is perfectly safe.  Med schools have an artificial monopoly on doctor creation.  I can't wait for that to break.\n\nPersonally, I'd try to tell them you understand their point of view (maybe repeat a few things to prove it), and that you'd like to make the decision for yourself.  No more \"evidence\" is necessary or desired.  If they want a doctor in the family, then they can apply to med school.\n\nAnecdotal evidence is just that...  Everyone thinks their perspective is special or more accurate.\n\nHeck you can go to med school after getting a CS degree too (with a lot of pre-med additional classes).\n\nIf you can be paid to \"play\" all day, then why not?",
            "Send him an article about hospital overflow during peak COVID. And tell him he can thank people “playing on a computer all day” for giving him the ability to discover those articles and send you that screenshot",
            "Have you visited the r/medicine sub or r/residency sub to read the stories of overworked, exhausted drs…",
            "Nope, send levels.fyi",
            "Well, he's your father and he definitely wants what's good for you. Even though that's what he thinks about you wanting to study CS. Try showing him that you respect his opinion but that's now what you really want. Cuz in end, no amount of money could compensate your love for your work.",
            "How old are you brother? It seems like you care way too much about what your parents think.",
            "Reply back with a screenshot of the average debt of someone that goes to medschool. It’s literally a whole ass mortgage",
            "I always suspect that parents that \"suggest\" careers involving doctor, lawyer, etc. are doing it for bragging rights. Not really caring what said career can do to you or if it's your passion/forte.",
            "My parents are both asian immigrants and came from families who were doctors. They themselves also were (dad) or wanted to be (mom) doctors. Initially they wanted me to be a doctor but they changed their minds. This was their logic:\n\n1. You will be spending upwards of 8-10 years in preparation to be a doctor, at which point you’ll be making good-ish money. If you work in CS you could be making good money from the get-go, and then crazy money by the time you would have otherwise been just finishing residency. The idea that Med or Law is the Good Guaranteed Way™️ is an old way of thinking.\n\n2. If you become a doctor you will have constant demand but a cap on what you can do with it. You’ll be a specialist in your field but that’s it. If you’re in CS you can branch in ways that would make Git blush. You have the opportunity to research, hybridize with other fields, or even start your own tech company. Or you could be on the ground floor for a new startup. With Medicine the best you could do is go into Business and try to move up or start your own practice.\n\n3. Big companies might be slowing hiring but if I threw a rock into a crowd of onlookers I’ll hit some startup person in the face. You may not have that kind of “I have a medical license I can go where I want” security but everyone, and I mean EVERYONE, needs CS people. Tech is the lifeblood of modern industry. \n\n4. I think that, especially now, your dad is overestimating the kind of “prestige” that medicine has. I love doctors and their work is important and grueling and often times has a big mental toll, but unless you’re some kinda brain surgeon or you invented some incredible new treatment you’re just another doctor at another nameless hospital... doing the same things that every other doctor does. \n\nTech is life now. The next recession or economic dive isn’t going to be the great depression or some huge post apocalyptic luddite movement where we fucking abandon all our computers suddenly and twist motherboards into speartips. The modern world will always need tech workers.\n\nBut uh if you really need something else just say you can work medical technology. Biotech or some shit. Then just don’t do it,",
            "He must have no idea about what being a doctor is like. You spend 2 hours a day with patients and 10-12 hours in front of a computer filling out reports.\n\nCS people have more interaction with people than doctors.",
            "Sure if he pays for med school lmao.",
            "it has wayyy greater exhaustion as well",
            "\"It's my life dad.\"\n\nHe cares about your future and every parent like this wants you to make the safe decision.  Nobody tells stories about the safe decisions they made in their life.\n\nFor me, CS is an art school.  We create things and have insights into the world that others never really see.  He sends you screenshots from a computer, encoded by a computer, over computer mediated radio waves, to you who is far away.  He probably has no idea how that works or how many people like us were involved in every step of that simple ( to him ) operation.  It is done so well that he just expects it to work.\n\nMedicine is a body mechanic.  Besides empathy and some diagnostics, it can be ( and will be ) replaced by machines.  Empathy, as a career, can take a brutal toll on one's soul.  Old doctors and nurses are so often sour, scared and bitter people who have seen so much of the worst in people.  The prestige is an old world, last generation kind of thing.  Young doctors often look to us with envy and the trappings of being called Dr are fading.\n\nWhereas art and creation lift us up.  As CS people, we are literally creating worlds that connect people in ways that humans have never been connected before.  We automate away the tedium using ingenuity, insight and passion in high speed teams of interconnected humans.  We rarely solve the same problem twice.  Or alone.\n\nIt's a much better life choice in my mind and 25y later, I'm still very happy to have chosen CS over medicine or law.",
            "Show him the number of doctors that died during the pandemic. Real great job security...",
            "OP please for the love of god do not listen to your dad. He doesnt know shit and just wants the honor of saying his son is a doctor. Please trust me. I am a doctor. You can read my post history, and how many doctors wish they did tech instead. Please don’t feel pressured to fulfill your dads selfish dream. You will regret it.",
            "CS can also go towards many engineering roles as well",
            "How about telling him that this is your life and he’s in no position to be telling you what to do with it.",
            "omg talking about toxic parents, my Asian parents throughout my upbringing told me girls can't do STEM, smh",
            "Tell him the plain truth that most people can't see or won't accept.\n\nEverything in the world uses IT nowadays, even doctors need their equipment calibrated and programmed for they do to their jobs. Planes don't fly without algorithms, banks can't process transactions, basically if everyone in IT went on strike at the same time, the world would crumble.\n\nThe world needs IT to survive, once it didn't but now it does, and we're here to help... for a price.",
            "Med school is uber competetive and demands a lot of hoop jumping for you to prequalify. Then you have to consider the time you will spend and all the possible risks (from failing to family situations) that cam happen in that decade of learning.\n\n\nI chose comp sci over bio because of the pandemic . Before that my parents were pushing me to be a lawyer or a doctor or whatever is considered traditionally respectable and high status. My father nearly died stayed in the hospital for 4 months the docs told us to pull the cord and sometimes to intubate him(which they later acknoedged wouldve killed him) on top of him being neglected and not allowed to have visiotors for some reason which all led to us being unable to work or attend college.\n\nYou have to ask yourself now on whether you want that medical doctor job and what you will do if you dont get in but majored in bio. \n\nMy father kind of pushed and told me what to do but ever since his near death experience he understands that if he is gone i will still live with the choices he forced on me .\n\nso hopefully this stuff i wrote makes sense.",
            "[levels.fyi](https://levels.fyi) screenshot",
            "Your dad is right. The world will always need doctors and demand for their services is inelastic. Even during the worst recessions, when ppl need medical care, they will empty out their last savings to receive it. Doctors and other healthcare workers provide a critical service that is required for society to function. Also, they hold life and death in the hands so the bar to become a doctor is super high—they’re very hard to replace. \nProgrammers do not provide a critical service to humanity that everyone else needs to survive. The world has existed for millennia without code, and let’s face it, most programmers work on making their companies’ ads have a 0.1% higher click rate. It’s difficult and high paying work for sure but when the recession hits... also programmers don’t hold life and death in their hands, so the barrier to entry is lower.",
            "Can’t handle the sight of blood or bodily functions, not to mention pus, infections etc.  Just don’t have the stomach or desire dad. I would end up being removed from the program. To be a dr dad you need to be extremely passionate about medicine and willing to most if not all of your 20s in school and training. I want a more balanced life that is more appropriate for a family\\*\n\n&#x200B;\n\n\\*don’t use this part if you are not desiring spouse and kids.",
            "Medical school sucks, it’s hard, grueling, and you’ll make doctor salaries and then some in a few years if you do things right in CS.",
            "Tell your dad to get a 515 in mcat, then you’ll consider medschool.",
            "I have a high school diploma and I earn a six figure salary in tech working remotely from a LCOL area. \n\nThere are more opportunities, the pay is better, and you don't have to go into any more debt than you absolutely want to on education. Unless you're super passionate about medicine, then being a doctor sounds like a miserable career.\n\nMy girlfriend has a friend who went to medical school. He's doing his residency now and he's several hundred thousand dollars in debt and he earns $50k/year while living in a relatively expensive city for that income. Sure, he'll have better earning potential once he finishes his residency, but once again he'll likely have to move somewhere else again, potentially somewhere even more expensive to live, and it may well take him a decade or more to pay off that debt before he gets to start enjoying that income.\n\nBy then, my income will be pretty well in-line with what a doctor earns and I will have been saving/investing for many years. And I can work from anywhere with solid Internet, which means I can live anywhere I want. I could even travel while working if I really wanted to do that. I have colleagues at work who do that.\n\nThe work/life balance, the flexibility, and the pay to debt ratio is soooo much better in tech.\n\nWho gives a shit about \"prestige.\" Nobody actually cares about you or what you're doing in life. Most people are just too focused on their own lives and their own problems. Anyone who is paying attention to you is likely either criticizing you (regardless of how successful you are) or jealous of you. \n\nWhat does \"prestige\" get you at the end of the day? Happiness doesn't come from impressing other people, it comes from building a life that you genuinely enjoy. Living to impress other people is a great way to spend your entire life chasing happiness while never actually finding it. That's not a good reason to choose a career path.",
            "How do you know what the medical job market will be like in 10 years? Do you even know how it is now? It's not easy to get a job.",
            "Share the, \"One Million Dollar Mistake\" presentation with your Dad.\n https://prezi.com/qt33o9wooria/the-one-million-dollars-mistake/ \n\nIn summary med school cost x interest=$460k + opportunity cost of $500,000( 50k x 10 years of work). \n\n460k\n+\n500k\n-----------\n1 Million Dollar Mistake\n\nThis doesn't address the amount of other people who flunk out or become suicidal in med school (which has the highest rate of suicidality).",
            "It’s your life, do what you want or you will regret it.",
            "Is this post asking us how to say no to your dad?",
            "The best response is asking him to support you in what you want to do, and sending you things intended to demotivate you or make you feel like it's a hard mountain to climb is not something a good dad should do.  \n\n\nIf he thinks Software Engineers are \"playing on a computer\" all day, he's wrong. I make 100k+ from home in my pajamas, but it is still work. Just like you're at a point in your life where you're trying to figure out yourself and what you want to do, it may also be time to realize that other people -- even your parents -- don't need to sign off on the things you choose are important to you.  \n\n\nGodspeed.",
            "No one here understands your personal life or family dynamic. How can anyone answer?",
            "Tell him doctors will be replaced by robots soon enough, that’s the thing these boomers don’t seem to grasp.\nHopefully it occurs within his lifetime so you can slam dunk that fact on his old ass",
            "Tell him that most likely you will fail to get into medicine. Only ~40% of people who apply to med school get in. And that’s just the people who apply. Most of the people who try for medical school in college just won’t have the GPA to make it anyway. My friend who was in the top quarter at a magnet school for BIOLOGY with an average (1500 sat score) couldn’t get a 3.5 gpa. Tbh you 3.8+ to have an AVERAGE chance to be competitive at medical school admissions. You also have to score well on the MCAT which is basically as hard as leetcode. Then even if you get into med school, you have to get residency. Out of my extended family 3/30 cousins got into med school, one is trying to get residency 10 years later, the other gave up after 5, and only one succeeded. The difference between the one who succeed and the other two was that he genuinely enjoyed medicine and wanted to be a doctor, the other two just wanted $$. Tbh medicine is like investment banking it’s really hard to get into, it’s not a safe and easy path. CS even if your bad you can make 100k at least. And you have your whole career to grow and can make FAANG if you want to. I mean FAANG at least after 5 years of experience you will make 350k. Surgeons don’t make that much more when considering loans tbh. Most people who try for med school end up failing getting a degree in Biology and making 60k washing test tubes.",
            "[deleted]",
            "Medicine is not as bad as some make it seem. 4 years of medical school, really only the first two are bad. The latter two are pretty chill. Residency is work, but it’s paid work. You usually leave with 300-500k in debt, but who cares. Pay the minimum over 30years. Regardless I guess, if you don’t want medicine, then just be firm about it and tell him that no way in hell you’d go to medical school.",
            "He’s mot wrong that it’s better in a recession but everybody hurts.\n\nAt least the country isn’t trying to socialize software development.",
            "He’s probably right lmao; the gold rush for CS is over lol\n\nt. bag-holder",
            "Go to med school.",
            "https://www.ama-assn.org/residents-students/resident-student-health/1-4-med-students-around-world-shows-depression-signs#:~:text=Timothy%20M.,Smith&text=Twenty%2Dseven%20percent%20of%20medical,meta%2Danalysis%20published%20in%20JAMA.",
            "aside from others, haven't he seen how many doctors resigned or are planning to resign in next months due to stress level at job?",
            "That's pretty funny. The market is telling you to do software stuff. Do what the market says.",
            "Start sending him back articles about how AI is replacing doctors.",
            "Become an Electrical engineer or process/chemical engineer. Do not waste your life on an MD if it is not your calling.",
            "https://www.ama-assn.org/practice-management/physician-health/medicine-s-great-resignation-1-5-doctors-plan-exit-2-years",
            "Tell him stop riding the trends, seeing people die on a daily basis is difficult to process.",
            "Wasn’t your question but you can still go to med school after CS.",
            "“Stop sending me this stuff.”",
            "Everyone is talking about the debt you come out with. That's not even the worst part. You are constantly grinding. 4 years of pre med. 4 years in med school and then another 4 years in residency. And I swear each stage gets progressively worse. My friend who specializes in internal and he said over a 12 day period he was working like 140hrs. It might be even more. And he only gets paid 70k a year. On top of that he has to study at home. Also there's no guarantee you'll get into med school in the first place.",
            "Show him articles that show the benefits of CS. CS is in high demand, there are lots of well paying jobs and is still growing.",
            "Do not go to med school for a stable career or money. Not only is it hard to get in, but it’s very tough, in almost every manner. Sure it pays well but there will be sacrifices of all kind,",
            "Speaking specifically to his points about the current market downturn: those job losses are the result of overinflated valuations and the huge funding rounds that companies were able to raise as a result. The tech industry has gone through downturns before, just like any other industry, but has always come back strong. Additionally, the headlines are always going to be taken by the biggest and flashiest companies that are failing in spectacular fashion. For every bloated overvalued unicorn in the valley there's dozens (if not more) of companies that need software engineers who are doing just fine. Computing is the bedrock of our society at this point; there's no better job security out there.",
            "Make it a codeing project.... filter his messages to stop your trigger words/ things from going through. That way you wonder why the message went through insted of focusing on how annoying it is.",
            "bro. you’re grown. do what YOU wanna do. if you do shit to please others you’ll be miserable",
            "Lol the best idea is to not try to convince him. Um who cares, you know?",
            "Keep in mind though doctors get way more pussy",
            "Tell him you would prefer if he was a doctor but here we are.",
            "Tell your dad you knocked up a girl at a party and she's keeping it. He'll stop.",
            "Simple. Google is not the only IT company in the world. There many other well established IT businesses and many more are still growing :)",
            "What worked w my mother was just getting super annoyed every time she sent any article like this or made some subtle suggestion. That was the only thing that worked. I had tried several other things before. Boundaries are boundaries and it’s reasonable to me that I get annoyed/upset if someone crosses a boundary for me.",
            "Lol this is pretty much the same message my Asian mum would tell me when I was younger - that any career path other than medicine would lead to job insecurity. I went through med school and a few years of working as a doctor, and just recently went through a career pivot to work as a programmer.\n\nHonestly the Asian parent pressure to do medicine is pretty insane - my parents bombarded me almost daily with this message that every career path is second class to medicine from the time I was 15, and my mum still tries to shame me for not pursuing a career in medicine.\n\nAt the end of the day it's you who has to face the consequences of your choices and spend the rest of your life in the field, not your parents. Your parents aren't the ones who will have to work 7 consecutive 12-hour night shifts, while needing to spend most of your spare time writing meaningless research papers and hospital audits to impress the senior doctors, as well as study for difficult exams with large failure rates for doctors, just so you can have a chance to progress in your career. All this while being in huge debt (if you're in the US and don't have a scholarship/financial support), and earning considerably less than the same intelligence/persistence/energy put elsewhere.\n\nJob security is bullshit if you hate your job, computers/the Internet are increasingly taking over the world, and prestige does less and less for you as you grow older.",
            "Prestige to... who?\n\nGetting started in CS is bumpier, but the jobs pay roughly the same, but for fewer hours, a third as much advanced schooling, and less than a third as many student loans.  We don't deal with sick people, either young contagious sick people or old people who aren't going to recover.\n\nThat said, you should likely do the one that's more motivating for you, and you'll go further.  If you wanted to be a doc and your family wanted you to do CS, you'd be worse at CS, and go less far.  Same applies here; unless you want to be a doctor, no one really makes it through an extra \\*decade\\* of school.",
            "DONT go to Med School if you Dont have a passion for it.",
            "send him articles about hospitals overworking and underpaying their staff lol",
            "I leave my parents on delivered",
            "Send him a report on decreasing pension rates and increasing the age requirement to qualify for it.",
            "Ask your dad if he'd like to be treated by a doctor who's in it for the prestige and job security. Your dad wants what's best for you, but what's best for you isn't always best for everyone. If you don't want to be a doctor, you probably shouldn't be.",
            "Gotta choose your own path in life. Trust your gut and stick to your guns, you’ll be happier",
            "whatever just do you man,",
            "Levels.fyi",
            "Go to med school? Unless you just hate medicine, Doctors definitely have better job security than we do.",
            "I’ve never posted, but I feel like I’m somewhat qualified to offer advice. I’m a class of 2022 MD/MPH graduate. I matched into a community general surgery program, nothing special. 3 months before I graduated I was diagnosed with a rare genetic disease and now I can’t practice. Currently getting my MS in software engineering. Don’t do medicine if you aren’t passionate about. I studied 8-10 hours a day for my first two years, consistently worked 70-80 hours during clinicals. 7% of US MD students didn’t match this year and I think it was around 10% for DO students. Getting an MD is not a guarantee anymore. There’s also mid level encroachment in primary care and anesthesia. Emergency medicine is over saturated.  I don’t personally believe in it, but some people think AI will make radiology obsolete. Medicine is not the perfect field that your dad is making it seem like",
            "I’m 28 and just accepted an offer for 350k/yr, remote, and have $0 dollars debt. Got my offer rescinded from coinbase a month before this new offer. Got 3 months severance and 10 interviews lined up at top tech companies before accepting my new position. Douchey flex but my family is from the Middle East and it took a lot of convincing them that there are other paths than Doctor/lawyer/banker.  \n\nWant me to talk to him? :) DMs are open",
            "You can work as an engineer for a while and go later into medicine if you'd like. Your preferences and ambitions will change with time.",
            "wish i could show him my inbox from recruiters",
            "There'll only be more jobs in CS as tech becomes more integrated into our lives.",
            "GO TO MED SCHOOL",
            "Idk I'm sure you can find articles on how malpractice insurance is at an all time high or something along those lines lol",
            "Tell him that historically recessions last 1.5 years \n\nMedical school takes 8-9 years and about 500k+\n\nAt the end of the day, it's your life. The progression of tech is and will continue to outpace the number of software engineers(yes, I know the market is oversaturated for juniors).\n\n Every company, doesnt even have to be FANG or tech needs people who can code. Kroger, John Deer, taco bell... every company needs people who can code.",
            "Going back to school for CS degree. I got a bs and ms in an unrelated stem field, due to health stuff I'm changing careers. Coming from a family of doctors I chose not to go to med school for the following reason:\n\nHaving to be the one to break bad news. I was 4 and remember my dad coming home torn down from having to tell a single mom she had cancer. \n\nThat moment sat with me all these years as a 30 year old. I chose not to go into medicine because of that. \n\nBut I also watched my dad go from caring about patients and family, to being the most most narcissistic money driven asshole. Both him and his brother are doctors, both bounced on their kids once both wifes died of cancer. Shit family luck. My cousins, my sister and I are so fucked up mentally because of our dads.\n\nDo something you enjoy. Fuck money (to an extent obviously). Tell your dad you're doing what makes you happy and that what you're doing will satisfy your life goals. You don't get to take your wealth and materials with you when you die. \n\nAlso, who tf wants to go into medicine with COVID being a thing. College is already stressful, sprinkle in plauge and that just sounds like hell with extra steps.\n\nSorry for the tangent.",
            "Acknowledge them. There is a recession. There are recession proof careers",
            "If your calling is medicine go to med school. We always need doctors. Otherwise don’t grind for the sake of being a doctor",
            "You can try to tell him CS is incredibly secure as well, considering modern medicine can't do what they do without computers. \n\nThe future will only become more computerized, not less.",
            "Say its my life",
            "You could always take the middle road and specialise in computer science for medicine.",
            "Tell him that you love him but he should shut the fuck up.",
            "Tell him recessions are not forever. If it was doctors would also be in the crapper.",
            "Jobs in med school/field are just as bad. It's not limited to IT. You need to do what you'll be happy with your entire life, don't do it just for pay. $10,000 =/= misery and I make more in IT than some doctors in my area.",
            "Someone has to build the tech that the Doctors use.",
            "Do whatever you love the most since both fields far good enough for living",
            "Send him screenshots of Dr. Anthony Fauci.",
            "“No”\n\nEdit: shortly followed with “Please refrain from sending these in the future. I do not appreciate the sentiment and I have made up my mind as an adult.”\n\nIf they get angry or defensive, it was never about you or your prosperity to begin with, it was about their feeling of accomplishment. Do what makes you happy or what makes you feel fulfilled, others don’t choose that for you.",
            "So I’m entering as a biostatistician. I’ve talked with several well known doctors, and they said that hospitals are starved of biostatisticians and data scientists, which is what I’m going to be doing.\n\nAlso, the more education you invest your time in (I.e., the amount of time you spend in grad school: 2 years for a masters, 4 years on top of that for a PhD), the less of a chance you’re going to be fired when recessions hit.\n\nAlso, when recessions hit, it’s not as if everyone becomes unemployed. Maybe an addition 2-3% of the population becomes unemployed. Sure, that’s a lot of people, but you’re probably going to be fine.",
            "start sending him articles about how trades careers :)  \n\ndeclining in numbers, short people already, job security, good pay, freedom, less schooling, being paid while achieving your qualifications.",
            "I would ignore his texts.\n\nI assume you already had a talk with him about what you want to do. \n\nI would not continue to beat a dead horse.",
            "Leave him on read.",
            "Parents like the medical field because it is a \"steady job.\" They don't understanding there are many other occupations where you can make good money and not be what amounts to factory labor for a  conglomerate where there is daily pressure to make your quota and stay in budget. I just got a survey yesterday from my provider's organization asking me to rate him on everything to how long he spent to his communication style. Made me realize he is nothing more than a highly paid Amazon warehouse worker, with every action measured.\n\nNote: my parents wanted me to be a pharmacist, lucky for me I was too stupid and got an MBA instead, which led to a very well paying and satisfying career.",
            "This is literally me but not getting convinced for med school just being warned of a tougher job market lol",
            "It’s your career, not his. He has zero input worth listening to when it comes to career prospects and choices.",
            "Goto med school…",
            "You could develop computer tools that automate or support  some MD work. Now there are diagnostic tools, imagery systems, most of the medical equipment runs with software.\n\nMy uncle had a hardware device that followed is heart rate and could call an ambulance automatically.",
            "Show him articles of Google engineers making $500k/year.  Few doctors ever reach this level of pay despite wasting 4 years in med school and another 4 years in residency.",
            "As a nurse looking to get into programming I can understand both sides. The medical field in general definitely guarantees a good steady job but if it’s not your passion it will get very old very fast especially with the long hours and amount of workload that’s expected from you.  Burnout is a very real thing especially in this field. From my understanding there is a much bigger barrier for entry into the tech world and once your in it you have to prove your skills are indispensable especially during tough economic times with mass layoffs. But believe it or not your dad is just looking out for his kid and doesn’t want to see you struggle later on, it’s a tough world out there and your dad knows it.",
            "Programmers won't lack for work.\n\nSalaries are still rising. The world may become sane again and junior devs won't see six figures just for graduating and they may not raise four million dollar seed rounds for stupid shit, but there will be jobs and careers.",
            "No offense but you’re Asian aren’t you",
            "All on your hand. But one thing for sure , your dad is trying to find which is the best for you. All is for your sake and not for him, please remember this.",
            "Tell him to go to Med school",
            "Response: “OK”",
            "Start finding news of doctors committing suicide. \nIrritate him for 2-3 days. \nThen discuss that one can prove any point by selectively sharing news.",
            "You’re an adult and you can make your own choices",
            "Dr. Glaucomflecken",
            ">**citing that it has more prestige,** but more importantly has greater job security and is recession proof\n\nI dunno mate, this seems to be more about him than you.\n\nAnd no. No job is recession proof. \n\n>https://www.chcf.org/blog/covid-19-is-reshaping-californias-health-workforce/\n\n>https://www.beckershospitalreview.com/finance/10-hospitals-laying-off-workers.html\n\n>https://www.seiu-uhw.org/press/kaiser-permanente-lay-off-200-california-healthcare-workers/\n\n\nDo you even want to go to med school?\n\nI dont know your dad but it really seems to be more about him being able to say his kid is doctor more than \"better job security, and recession proof\"",
            "Memes. Send him back memes or gifs."
        ]
    }
]